{
    "news": [
        {
            "title": "MWOS dominates PSL May awards; Mutasa, Veremu honoured",
            "url": "https://www.newzimbabwe.com/mwos-dominates-psl-may-awards-mutasa-veremu-honoured/",
            "content": "By Sport Reporter\n\nCastle Lager Premier Soccer League log leaders MWOS FC dominated the May awards with head coach Lloyd Mutasa and striker Billy Veremu voted winners.\n\nMutasa was voted coach of the month May, after maintaining his teams unbeaten run in the league, which has stretched to 14 games.\n\nThe former Dynamos coach managed to record three wins out of the six matches his side played in May, the other three ending in draws.\n\nMutasa returned the monthly award, which he also won in April, making himself the only coach to have scooped it twice this season.\n\nMWOS striker Billy Veremu was voted PSL Player of the Month for May after a good run in which he scored five goals during the period.\n\nVeremu is the current league top scorer with Tel Ones Washington Navaya, who also has nine goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/06111647/billy-veremu.jpg",
            "description": "<p>By Sport Reporter Castle Lager Premier Soccer League log leaders MWOS FC dominated the May awards with head coach Lloyd Mutasa and striker Billy Veremu voted winners. Mutasa was voted coach of the month May, after maintaining his team’s unbeaten run in the league, which has stretched to 14 games. The former Dynamos coach managed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwos-dominates-psl-may-awards-mutasa-veremu-honoured/\">MWOS dominates PSL May awards; Mutasa, Veremu honoured</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "Jailed bogus doctor swindled prospective nurse trainees US$8,000",
            "url": "https://www.newzimbabwe.com/jailed-bogus-doctor-swindled-prospective-nurse-trainees-us8000/",
            "content": "By Staff Reporter\n\nA BULAWAYO man, who posed as a qualified medical doctor, has been convicted of multiple fraud and sentenced to an effective 42 months imprisonment.\n\nThe accused person, 29-year-old Prosper Taurai Vanhuvaone, appeared at the Bulawayo Magistrates Court on charges involving false representation as a registered medical doctor and agent facilitating certificates of sponsorship (CoS).\n\nCourt heard that between February and September 2024, Vanhuvaone orchestrated a calculated scheme to exploit vulnerable individuals at Mpilo Central Hospital and in Bulawayos central business district.\n\nMasquerading as a medical practitioner, the offender misled several clients into paying him money on the promise that he would secure places for nurse training at Mpilo Central Hospital. He also lied that he could process CoS for qualified nurses intending to secure employment in the United Kingdom (UK).\n\nFollowing his conviction, the presiding magistrate sentenced Vanhuvaone to 84 months in jail, suspending 18 months for five years on condition of good behaviour. A further 24 months were set aside on condition that he restitutes the complainants US$8,165 by July 30, 2025. He will, therefore, serve an effective 42 months imprisonment.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) said this case sends a strong message to would-be conmen on the dire consequences of fraud, especially when public trust is manipulated for personal gain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/06110940/bogus-Dr.jpg",
            "description": "<p>By Staff Reporter A BULAWAYO man, who posed as a qualified medical doctor, has been convicted of multiple fraud and sentenced to an effective 42 months’ imprisonment. The accused person, 29-year-old Prosper Taurai Vanhuvaone, appeared at the Bulawayo Magistrates Court on charges involving false representation as a registered medical doctor and agent facilitating certificates of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jailed-bogus-doctor-swindled-prospective-nurse-trainees-us8000/\">Jailed bogus doctor swindled prospective nurse trainees US$8,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "Corruption is robbing Zimbabweans – US Ambassador",
            "url": "https://www.newzimbabwe.com/corruption-is-robbing-zimbabweans-us-ambassador/",
            "content": "By Staff Reporter\n\nThe United States Ambassador to Zimbabwe, Pamela Tremont, described corruption as a cancer that is robbing the people of Zimbabwe of their precious resources, warningthat this has hada detrimental effect on trade and investment within the country.\n\nAmbassador Tremont made these remarks during the 249th US Independence Day celebrations held in Harare on Wednesday.\n\nThe office of the Prosecutor General admitted that the country loses about US$2 billion annually due to illicit deals and leakages.\n\nAddressing delegates at the celebrations, Tremont said corruption is like a cancer that must be nipped in the bud.\n\nA strong stance against corruption is also imperative, as it is corrosive to an investment climate. I strongly encourage efforts to fight this cancer in Zimbabwes economy that robs the Zimbabwean people of the benefit of their precious resources and raises exponentially the cost of doing business in Zimbabwe, she said.\n\nTremont added that a corruption-free business and trade investment environment would make the sector vibrant and lucrative for the people of Zimbabwe.\n\nA healthy, vibrant investment climate would create a culture of opportunity  an opportunity for what our founders 249 years ago called life, liberty, and the pursuit of happiness. That is what we celebrate today, she said.\n\nAlthough he did not directly address the issue of corruption, Foreign Affairs Minister Amon Murwira reiterated Zimbabwes commitment to enhancing its investment climate. He admitted that the country is still learning and expressed pride in taking inspiration from the US.\n\nWe wish, therefore, to invite all potential United States investors to come and invest in Zimbabwe. As you are aware, the government of Zimbabwe is enhancing the investment climate with a view to safeguarding investors interests and guaranteeing the protection of investments. In 45 years, we have learned a lot. We are still learning a lot. We are not 249 years, Murwira said.\n\nThe latest Corruption Perceptions Index (CPI) reflects a worsening corruption situation in Zimbabwes public sector, according to Transparency International (TI), and the country has performed poorly on global corruption indices for years.\n\nThe CPI ranks Zimbabwe 158th out of 180 countries, where the top-ranked country is perceived to have the most honest public sector.\n\nIn 2023, Zimbabwe was ranked 149th, meaning the level of corruption has increased, with the Southern African country slipping nine steps down the scale.\n\nCurrently,questions have been raised overthe cost of the recently commissioned Trabablas Interchange in Harare. Many believe the US$88 million price tag is excessive compared to regional market rates.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15215508/Tremont-Photo-scaled.jpg",
            "description": "<p>By Staff Reporter The United States Ambassador to Zimbabwe, Pamela Tremont, described corruption as a cancer that is robbing the people of Zimbabwe of their precious resources, warning that this has had a detrimental effect on trade and investment within the country. Ambassador Tremont made these remarks during the 249th US Independence Day celebrations held in Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/corruption-is-robbing-zimbabweans-us-ambassador/\">Corruption is robbing Zimbabweans – US Ambassador   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "South African citizens languish in Harare prisons, convicted for drug dealing, or awaiting deportation",
            "url": "https://www.newzimbabwe.com/south-african-citizens-languish-in-harare-prisons-convicted-for-drug-dealing-or-awaiting-deportation/",
            "content": "IOL\n\nThe Zimbabwe Human Rights Commission has told IOL that scores of South African nationals are languishing in Zimbabwes Harare Remand Prison, awaiting deportation, after they were arrested for breaching the neighbouring countrys immigration laws.\n\nAnother group of three South African men are not facing deportation, but will face trial in Zimbabwes courts after they were charged for conspiracy to commit armed robbery. On the other hand, the Zimbabwe Human Rights Commission has established that a South African woman has been convicted for dealing in dangerous drugs in Zimbabwe, and has sentenced to 10 years in jail.\n\nIn an interview, chairperson of the Zimbabwe Human Rights Commission, Jessie Majome told IOL that by Thursday, she had established that there are six men, who have been certified to be South African nationals in conjunction with South Africas High Commission in Zimbabwe, who are ready for deportation from the Harare Remand Prison.\n\nShe said a seventh man in the group will not be deported to South Africa, as the diplomatic mission has informed Zimbabwes authorities that the elderly man is not a South African citizen.\n\nI had gone to the prison to visit a certain group of people who had been in custody for too long. I then noticed that there were 66 foreign nationals in the Harare Remand Prison for men. It is an issue that is of interest to the Commission because it involves a special category of people who should not be in prison; even though irregular immigration is against the law, they should not be treated like individuals awaiting trial, she said.\n\nMajome said Zimbabwe does not have independent holding facilities for people arrested for violating the countrys immigration laws, and verifications happen while the people are detained in prison.\n\nAt the time of the Zimbabwe Human Rights Commissions visit in April, it was established that there were about seven South African men, but Majome said the number has now risen because other South African nationals were found in the womens section of Harare Remand Prison.\n\nChairperson of the Zimbabwe Human Rights Commission, Jessie Majome spoke to IOL on the plight of South Africans detained in Zimbabwe. Image:Zimbabwe Human Rights Commission\n\nIn its April report, the Zimbabwe Human Rights Commission stated that detained foreign nationals at the Harare Remand Prison comprised 16 people from Burundi; 12 from Ethiopia; 11 from Democratic Republic of Congo; two from Rwanda; two from Uganda; eight from Malawi; one from Libya; one from Mozambique; one from the Peoples Republic of China; seven from South Africa; one from Pakistan; one from Taiwan; one from France; one from Britain and one from Cape Verde.\n\nDuring the interview with IOL on Thursday, Majome said her organisation has since established that there are three South Africans in the womens section of the Harare Remand Prison.\n\nThere are three South African nationals, who are women in the Harare Remand Prison, it is a separate prison. Two of those women are awaiting deportation back to South Africa.\n\nThree of the detained South African men are facing charges of conspiracy to commit armed robbery. Those ones are not awaiting deportation, but they are going to appear before the Harare Magistrates Court in June.\n\nSo it is seven South African men awaiting deportation, and two women. The third South African woman has been convicted of dealing in dangerous drugs and has been sentenced to 10 years in prison in Zimbabwe, she said.\n\nThe human rights activist and attorney told IOL that the Harare Remand Prison is heavily crowded.\n\nConditions of prisons in Zimbabwe depend on where the person is. Where the three women are detained, at the womens prison, it is not crowded at all but at the Harare Remand Prison where the men are, there is crowding, she said.\n\nMajome reiterated the Zimbabwe Prisons and Correctional Services requires additional funding, and the Zimbabwe Human Rights Commission has been at the forefront for campaigning for additional funds for the ZPCS.\n\nThe human rights activist added that this is not the first or last time South African nationals have been detained in Zimbabwean prisons.\n\nThis is not a new thing, even though I understand it is of interest. This happens a lot. It just so happened that on that particular visit, we highlighted that in our report.\n\nThis is a common phenomenon the world over. What is important is to always remember the humanity and the equality of all human beings wherever they are  be it in prison, whether they have jumped the border, they must be treated with dignity.\n\nMigration is a phenomenon of human beings and must be done legally, but if it is not, human rights must still be upheld, she told IOL.\n\nLast year, IOL published a story where non-profit organisation Baagi Ba South Africa was advocating for the South African government to enter into international prisoner transfer treaties.These treaties would allow South African prisoners convicted in other countries to be brought back home, to serve their sentences in South Africa.\n\nIn countries where such programmes exist, including the United States, they are designed to alleviate the hardships faced by offenders incarcerated far from home and facilitate their rehabilitation.\n\nAt the time,IOL interviewed Glory Matipile, founder and chief executive of Baagi Ba South Africa, who insisted that effective rehabilitation for the hundreds of South Africansimprisoned around the world requires them to serve their sentences within South Africas correctional system. A key benefit of this, she noted, is the ability to speak the local language.\n\nGlory Matipile, founder and chief executive of Baagi Ba South Africa, a non-governmental organisation fighting for South Africans to serve jail sentences back home. Image:Supplied\n\nThis organisation, Baagi Ba South Africa, was founded in 2018, and so far, we have about 260 young people working across South Africa to raise awareness and provide support to families with relatives convicted abroad. We also collaborate with organisations that assist South Africans in foreign prisons. We reached out to our representatives in South African embassies but did not receive much support. Now, we work with organisations in foreign countries to facilitate communication between imprisoned South Africans and their families back home, she said.\n\nShe said with the economic hardships, it is almost impossible for most families in South Africa to travel to visit their incarcerated relatives in countries including Brazil, Philippines or Hong Kong  a special administrative region of the Peoples Republic of China.\n\nSouth Africa is one of the few countries in the world without international prisoner transfer. Such a programme already exists in the United Nations, and what is left is for South Africa to adopt it and follow the rules that are already there, and being used by other countries. The essence is that if we had such a programme, South Africans convicted in foreign countries would be sent home to serve near their families. Foreigners in our prisons would them be moved to go and serve their sentences in their home countries so that rehabilitation can take place.\n\nYou will remember that former president Nelson Mandela was advocating for prisoners rights. We are being denied to have such a policy.\n\nShe said her organisations records hasaround 800 names of South Africans convicted and sentenced in foreign countries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/11041022/Man-in-Prison.png",
            "description": "<p>IOL The Zimbabwe Human Rights Commission has told IOL that scores of South African nationals are languishing in Zimbabwe’s Harare Remand Prison, awaiting deportation, after they were arrested for breaching the neighbouring country’s immigration laws. Another group of three South African men are not facing deportation, but will face trial in Zimbabwe’s courts after they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-citizens-languish-in-harare-prisons-convicted-for-drug-dealing-or-awaiting-deportation/\">South African citizens languish in Harare prisons, convicted for drug dealing, or awaiting deportation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "SADC urged to reassess trade ties amid U.S. trade tariffs: official",
            "url": "https://www.newzimbabwe.com/sadc-urged-to-reassess-trade-ties-amid-u-s-trade-tariffs-official/",
            "content": "Xinhua\n\nThe Southern African Development Community (SADC) should reassess its trade partnerships to maximize benefits in the face of rising U.S. trade tariffs and the withdrawal of traditional development support, a senior official said Thursday.\n\nSpeaking at the 34th Meeting of the Committee of Ministers of Trade and the 24th Meeting of the Ministerial Task Force on Regional Economic Integration in Harare, Zimbabwes capital, SADC Executive Secretary Elias Magosi said the changing global tariff landscape had redefined trade dynamics, prompting the region to adopt pragmatic and strategic responses.\n\nWe must shape and determine our destiny going forward and swiftly attain robust negotiation skills that enable us to define trade and related aspects on our terms and for our benefit, Magosi said.\n\nHe noted that most SADC member states that previously benefited from the African Growth and Opportunity Act (AGOA), a U.S. trade program granting duty-free access to African countries, stand to lose significantly following the blanket 10 percent tariff the United States is considering imposing on all imported goods.\n\nFurther, the uncertainty over whether AGOA will be renewed this September compounds the existing challenge. I firmly believe that these recent geopolitical developments should serve as a powerful wake-up call for our region, a call for us to unite, cooperate, and integrate more, he said.\n\nMagosi expressed deep concern over low inter-regional trade within SADC, which stands at 18 percent, despite the establishment of the SADC Free Trade Area (FTA) in 2008.\n\nThe full implementation of the SADC FTA by all SADC member states remains critical in ensuring enhanced market access, leveraging on the gains from trade to grow our economies, Magosi said.\n\nThe SADC is a 16-member regional bloc, comprising Angola, Botswana, the Comoros, the Democratic Republic of the Congo, Eswatini, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, Seychelles, South Africa, Tanzania, Zambia, and Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/01065949/Elias-Magosi-SADC-Executive-Secretary.jpg",
            "description": "<p>Xinhua The Southern African Development Community (SADC) should reassess its trade partnerships to maximize benefits in the face of rising U.S. trade tariffs and the withdrawal of traditional development support, a senior official said Thursday. Speaking at the 34th Meeting of the Committee of Ministers of Trade and the 24th Meeting of the Ministerial Task</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-urged-to-reassess-trade-ties-amid-u-s-trade-tariffs-official/\">SADC urged to reassess trade ties amid U.S. trade tariffs: official</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "False start to a murky deal – Mnangagwa backs controversial Geo Pomona Waste Management as refuse piles up in Harare",
            "url": "https://www.newzimbabwe.com/false-start-to-a-murky-deal-mnangagwa-backs-controversial-geo-pomona-waste-management-as-refuse-piles-up-in-harare/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwa has said the controversial takeover of waste management by Geo Pomona in Harare will enhance the sector, an area in which the City Council had failed.\n\nMnangagwa made the remarks in Harare, Thursday while commissioning the waste sorting plant and refuse collection trucks at the Geo Pomona Waste Management facility.\n\nThe commissioning of the sorting plant, 45 refuse trucks, and 100 skip bins comes amid uproar from residents associations over Geo Pomonas takeover of waste collection, which will cost Harare City Council millions of dollars.\n\nResidents have questioned the opaque tripartite agreement between Geo Pomona, the Harare City Council, and the Ministry of Local Government, arguing that the arrangement was made with no prior consultation.\n\nHowever, Mnangagwa, in his address, insisted that Geo Pomona would improve waste collection in the capital.\n\nTo date, the waste collection crisis, particularly in the capital city of Harare, has had dire consequences, ranging from environmental degradation to public health risks, among other negative impacts. We have seen outbreaks of diseasesa situation that is wholly unacceptable. Such conditions must become a thing of the past.\n\nTherefore, in line with Vision 2030, my Government continues to prioritise the creation of clean, safe, and modern urban environments, which are engines of economic growth. Cleanliness and the efficient management of service delivery are not just indicators of good governance but also essential benchmarks for a nations competitiveness, said Mnangagwa.\n\nGeo Pomona, which was tasked with refuse collection earlier this year in an arrangement spearheaded by the Minister of Local Government, Daniel Garwe, is yet to fully fulfil its mandate.\n\nPiles of uncollected refuse in residential areas remain a sore sight months after the companys takeover.\n\nThis has angered residents, who have cast doubt on the impact of Geo Pomonas operations, despite the governments prior praise for the waste management initiative.\n\nFurther fuelling residents frustration is the US$40 per tonne that the City Council will pay Geo Pomona for waste disposal. The company is expected to collect 650 tonnes daily once operations are in full swing.\n\nPresident Mnangagwa said the Harare model should be replicated in other local authorities.\n\nThrough the purchase of this equipment, we must see the waste management system being capacitated to efficiently and consistently collect waste across all parts of Harare.\n\nI urge sector players in other towns and cities to take a leaf from such initiatives towards improving waste management in our country, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210357/mnangagwa-geo-pomona.jpeg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa has said the controversial takeover of waste management by Geo Pomona in Harare will enhance the sector, an area in which the City Council had failed. Mnangagwa made the remarks in Harare, Thursday while commissioning the waste sorting plant and refuse collection trucks at the Geo Pomona Waste Management</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/false-start-to-a-murky-deal-mnangagwa-backs-controversial-geo-pomona-waste-management-as-refuse-piles-up-in-harare/\">False start to a murky deal – Mnangagwa backs controversial Geo Pomona Waste Management as refuse piles up in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "What migrant care workers from Zimbabwe sacrifice for their children’s futures",
            "url": "https://www.newzimbabwe.com/what-migrant-care-workers-from-zimbabwe-sacrifice-for-their-childrens-futures/",
            "content": "Daily Maverick\n\nRuby is a 30-year-old mother of three, and shes ready to do whatever it takes to give her kids a better life. Even if it means leaving her family in Zimbabwe to become a live-in care worker in the UK.\n\nNow, halfway across the world from everyone she loves, Ruby works round the clock to make enough money to bring her family together again.\n\nBeing a live-in care worker for seniors in the UK is hard work. It involves lifting people in and out of bed all day, feeding them and sometimes changing their diapers. All that while keeping on top of their housework too.\n\nFor Ruby, a 30-year-old mother of three from Zimbabwe, this wasnt her dream job, but that didnt matter. She was determined to give her kids a better life. So she sacrificed her career as a teacher and left her kids back home in Zimbabwe to become a care worker in the UK.\n\nRuby wont let anything stand in the way of getting her kids and husband to England, where they can receive free education and healthcare, things she doesnt have in Zimbabwe. But therealquestion is: Can Ruby sustain the punishing routine long enough to pull it off?\n\nGreener Pastures, a podcast episode byRadio Workshop, captures the highs and lows of Rubys mission: the intimate relationship she built with her client, the joy of her husbands first day of work in the UK and the madness of working opposite shifts. And not least, Rubys momentous trip home to get the kids.\n\nWhen Ruby arrived in the UK in January 2024, she quickly learnt that the real England is far from the romanticised version people have back home.\n\nWhile not exactly the greener pastures she expected, her visa offered her the opportunity to earn pounds. After struggling to support her family on a teachers salary in Zimbabwe, that meant everything to her.\n\nRubys first job involved providing round-the-clock care to a woman in her nineties. She was paid to work eight hours a day, but it was a 24-hour job. She says sometimes shed call her friends just to cry.\n\nBut Ruby says she was lucky. The woman she was caring for was kind and did everything she could to make Ruby feel at home. Not like the horror stories Ruby heard from colleagues about being spat on by racist clients.\n\nBut arguably, the biggest challenge will begin with the start of their family life in the UK. Ruby explained: In a year or two, [the kids are] going to be different people. But, I am there to remind them of their roots.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05084906/DM-HEADERradiolab.webp",
            "description": "<p>Daily Maverick Ruby is a 30-year-old mother of three, and she’s ready to do whatever it takes to give her kids a better life. Even if it means leaving her family in Zimbabwe to become a live-in care worker in the UK. Now, halfway across the world from everyone she loves, Ruby works round the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-migrant-care-workers-from-zimbabwe-sacrifice-for-their-childrens-futures/\">What migrant care workers from Zimbabwe sacrifice for their children’s futures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "Domboshava teen convicted of stealing from Chiwenga’s store",
            "url": "https://www.newzimbabwe.com/domboshava-teen-convicted-of-stealing-from-chiwengas-store/",
            "content": "By Staff Reporter\n\nAn 18-year-old from Domboshava has been found guilty of stealing cellphones worth US$15,000 from Vice President Constantino Chiwengas wife, Miniyothabos shop in Borrowdale.\n\nSuccess Mukaro was convicted of unlawful entry by Harare magistrate Ethel Chicheta at his own plea of guilty.\n\nHe awaits sentencing this Friday.\n\nThe incident occurred on May 31 this year, around 15:00 hrs.\n\nOssie Shone, a supervisor at Miniyothabos shop, Style By Minie V.V.I.P knocked off duty after he secured the property with locks. He carried the keys with him.\n\nOn the same day, Mukaro then went to the shop and broke the front glass display wall of the shop, creating a hole through which he could sneak into the shop.\n\nInside, he stole cellphones worth US$16,915 and disappeared.\n\nOn June 3 2025, detectives received information that there were some cellphones, suspected to have been stolen being sold at Ximex Mall.\n\nDetectives recovered some phones from BlessedLuciano.\n\nDetectives established that the cellphones were part of the complainants stolen property.\n\nThey interviewed Lucianowho said he bought the cellphones from Isaac Craig Chaza on June 1.\n\nThe police managed to recover more cellphones from Chaza after luring him by pretending to be buyers.\n\nChaza and Steve Makangira led the detectives to Mukaro, who was arrested along Jason Moyo Street while in the company of his brother.\n\nHe was also in possession of more cellphones.\n\nFurther searches were done at his house in Domboshava where more were recovered. His fingerprints matched those at the crime scene.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051524/zdf-chiwengas.jpeg",
            "description": "<p>By Staff Reporter An 18-year-old from Domboshava has been found guilty of stealing cellphones worth US$15,000 from Vice President Constantino Chiwenga’s wife, Miniyothabo’s shop in Borrowdale. Success Mukaro was convicted of unlawful entry by Harare magistrate Ethel Chicheta at his own plea of guilty. He awaits sentencing this Friday. The incident occurred on May 31</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/domboshava-teen-convicted-of-stealing-from-chiwengas-store/\">Domboshava teen convicted of stealing from Chiwenga’s store</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        },
        {
            "title": "Musk says Trump would have lost 2024 election without him as ‘Big, Beautiful Bill’ feud continues",
            "url": "https://www.newzimbabwe.com/musk-says-trump-would-have-lost-2024-election-without-him-as-big-beautiful-bill-feud-continues/",
            "content": "Fox News\n\nElon Musk and President Donald Trumps feud about the Big, Beautiful Bill continued on Thursday when the tech billionaire responded to the presidents criticism in a post on X.\n\nWithout me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate. Such ingratitude, Musk wrote in a post responding to Trumps remarks about him.\n\nWhile speaking with reporters in the Oval Office, Trump said that he was very disappointed by Musks vocal criticisms of the bill. The president claimed that Musk knew what was in the bill and had no problem with it until the EV incentives had to be cut.\n\nIm very disappointed because Elon knew the inner workings of this bill better than almost anybody sitting here, better than you people. He knew everything about it. He had no problem with it, Trump said. All of a sudden, he had a problem. And he only developed the problem when he found out that were going to have to cut the EV mandate.\n\nMusk pushed back on the presidents claim in another post on X and said that this bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\n\nThe Tesla founder has been a vocal critic of the Trump administration and Republicans over the last few days because of the legislation that the president has pushed. Musk has taken to calling it the Big Ugly Bill and at one point advocated for a Slim, Beautiful Bill.\n\nEarlier on Thursday, Musk highlighted Trumps old posts that seemingly align with the tech billionaires current positions and objections to the Big, Beautiful Bill.\n\nTrump turned to social media on Thursday afternoon to criticize Musk, who he appointed to find ways to cut $2 trillion after forming the Department of Government Efficiency (DOGE).\n\nElon was wearing thin, I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY! Trump said in one post.\n\nThe easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elons Governmental Subsidies and Contracts. I was always surprised that Biden didnt do it! he wrote in another.\n\nMusk has also faced criticism from House Speaker Mike Johnson, who said on Wednesday that he was surprised by the former DOGE leaders objections to the legislation. The Republican lawmaker said that he and Musk, whom he considers a friend, had a great conversation about the bill on Monday. Johnson told reporters on Wednesday that Musk was flat wrong about the legislation.\n\nMeanwhile, there are several Republicans who have expressed solidarity with Musk, including Rep. Thomas Massie, R-Ky., Sen. Rand Paul, R-Ky., and Sen. Mike Lee, R-Utah. Additionally, Sen. John Kennedy, R-La., said that Musk was right to be concerned that Americans are quickly becoming debt slaves.\n\nNow that the bill has passed the house, its up to the Senate to meet Trumps July 4 deadline.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210734/musk-trump.webp",
            "description": "<p>Fox News Elon Musk and President Donald Trump’s feud about the “Big, Beautiful Bill” continued on Thursday when the tech billionaire responded to the president’s criticism in a post on X. “Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate. Such ingratitude,”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musk-says-trump-would-have-lost-2024-election-without-him-as-big-beautiful-bill-feud-continues/\">Musk says Trump would have lost 2024 election without him as ‘Big, Beautiful Bill’ feud continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "06 Jun 2025"
        }
    ]
}