{
    "news": [
        {
            "title": "Elon Musk lies again: ‘Starlink not allowed to operate in South Africa because I’m not black’",
            "url": "https://www.newzimbabwe.com/elon-musk-lies-again-starlink-not-allowed-to-operate-in-south-africa-because-im-not-black/",
            "content": "By Xolile Mtembu l IOL\n\nTHE worlds richest man, South African-born Elon Musk is once again spewing disinformation on his platform X.\n\nXs generative AI, Grok, identified Musk, a member of the US Department of Government Efficiency (DOGE), as the leading spreader of lies and misinformation on the social media platform he acquired for a staggering $44 billion.\n\nIn a recent post, Musk claimed that his satellite internet constellation, Starlink, is not allowed in South Africa because he is not black.\n\nThe Tesla owner was responding to another misinformation claim that there are 140 race-based laws in the country, which are all anti-white.\n\nStarlink is not allowed to operate in South Africa, because Im not black.\n\nIn actuality, Musks Starlink plans to expand into South Africa have been halted, as the business withdrew from regulatory hearings held by the Independent Communications Authority of South Africa (ICASA), according to Techpoint.\n\nICASA reportedly organised these hearings to get industry feedback on its proposed South African satellite services licensing system. Setting up a registration procedure is an important goal for multinational satellite operators that want to offer services directly or through partnerships with approved local suppliers.\n\nWhen asked by IOL about the biggest spreader of misinformation on X, Grok said:  Based on available reports, analyses, and sentiment on X as of March 07, 2025, Elon Musk is frequently identified as one of the most significant spreaders of misinformation on the platform.\n\nGrok added that this assessment comes from various sources, including studies by organisations like the Center for Countering Digital Hate, which found that Musks posts promoting false or misleading claims about topics like the US election have amassed billions of views in 2024 alone.\n\nHis large followingover 200 million as of recent countsamplifies the reach of such content, often related to politics, health issues like Covid-19, and conspiracy theories.\n\nThe AI further elaborated, noting that Musks interactions with accounts known for spreading misinformation have been highlighted as contributing factors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/26043006/esla-and-SpaceX-CEO-Elon-Musk.jpeg",
            "description": "<p>By Xolile Mtembu l IOL THE world’s richest man, South African-born Elon Musk is once again spewing disinformation on his platform X. X’s generative AI, Grok, identified Musk, a member of the US Department of Government Efficiency (DOGE), as the leading spreader of lies and misinformation on the social media platform he acquired for a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elon-musk-lies-again-starlink-not-allowed-to-operate-in-south-africa-because-im-not-black/\">Elon Musk lies again: ‘Starlink not allowed to operate in South Africa because I’m not black’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "China, Zimbabwe celebrate 40th anniversary of medical cooperation",
            "url": "https://www.newzimbabwe.com/china-zimbabwe-celebrate-40th-anniversary-of-medical-cooperation/",
            "content": "By Xinhua\n\nTHE Chinese Embassy in Zimbabwe held a reception on Thursday to mark the 40th anniversary of the Chinese medical teams presence in Zimbabwe.\n\nThe event also saw the bidding of farewell to the 21st batch of the Chinese medical team, who were awarded medals in recognition of their dedicated service to the country, and the welcoming of the 22nd batch.\n\nZimbabwean Deputy Minister of Health and Child Care Sleiman Kwidini said the partnership between Zimbabwe and China in the health sector is a shining example of what nations can achieve when they work together with mutual respect and friendship.\n\nFor the past 40 years, these teams have been at the forefront of delivering quality healthcare to our people, often in the most remote and underserved areas, he said.\n\nNot only have they healed bodies, but they have also strengthened the bonds of friendship between our two nations. The enduring legacy of their work will be felt for generations, both in the lives of those they have helped and in the healthcare system they have contributed to building.\n\nKwidini added that Chinese medical teams exemplify the power of compassion, collaboration, and dedication.\n\nCheng Yan, charge daffaires of the Chinese Embassy in Zimbabwe, said the milestone not only marks four decades of unwavering dedication and service to Zimbabwe by Chinese medical teams, but is also a testament to the enduring friendship between the two countries.\n\nTheir efforts embody the spirit of Chinas vision for a global community of health for all, and demonstrate that their mission is not just about treating illness, but about building bridges of friendship between our peoples, he said.\n\nCheng said China and Zimbabwe maintain close exchanges in medical personnel training, adding that China will invite more than 60 Zimbabwean hospital staff and medical officials to visit China this year.\n\nOver the past year, the 21st batch of the Chinese medical team has treated over 14,000 patients, trained more than 1,000 local health workers, and established critical health facilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08042611/GlbUJhfWMAAKdZu.jpeg",
            "description": "<p>By Xinhua THE Chinese Embassy in Zimbabwe held a reception on Thursday to mark the 40th anniversary of the Chinese medical team’s presence in Zimbabwe. The event also saw the bidding of farewell to the 21st batch of the Chinese medical team, who were awarded medals in recognition of their dedicated service to the country,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-zimbabwe-celebrate-40th-anniversary-of-medical-cooperation/\">China, Zimbabwe celebrate 40th anniversary of medical cooperation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Chief hails Freda Rebecca reforestation programme, calls on mining companies to take a leaf",
            "url": "https://www.newzimbabwe.com/chief-hails-freda-rebecca-reforestation-programme-calls-on-mining-companies-to-take-a-leaf/",
            "content": "By Staff Reporter\n\nA TRADITIONAL leader from Mashonaland Central, Chief Chipadze has urged mining companies to take environmental conservation seriously by planting indigenous trees to counter deforestation and land degradation caused by mining activities.\n\nThe traditional leader was giving remarks at a sustainability campaign launch event, which was held by Freda Rebecca Gold Mine (FRGM) Friday where he commended efforts to rehabilitate the environment.\n\nThe campaign focuses on restoring and rebuilding sustainable communities through developmental and preservation of green spaces using native plants, dust suppression initiatives, and local infrastructure rehabilitation and these include planting trees and lawn.\n\nThis tree planting exercise we are witnessing today is a great initiative as we are using our own indigenous trees which can survive in this environment.\n\nWe wish and urge all mining companies to do the same to avoid environmental damages to the surrounding communities, Chipadze said.\n\nThese initiatives are done at the Tailing Storage Facility (TSF), a mining structure used to store waste materials after mineral extraction which can cause significant damage to local communities if not managed properly.\n\nTSFs can cause water and air pollution, soil erosion, dust pollution, landscape alteration, and potential disasters like dam failures, impacting ecosystems and human health.\n\nThis year alone, FRGM, a subsidiary of Kuvimba Mining House (KMH) has already planted over 10 000 trees under the theme restoring nature and securing tomorrow.\n\nSince the beginning of this year, FRGM has already planted more than 10 000 trees and we planted another 900 trees here today.\n\nWe are replanting specifically indigenous trees but a few exotics which will be planted for very specific reasons like some of them will be able to restore the soil quality and assist the indigenous trees to grow as well, added KMH CEO Trevor Barnard.\n\nThe campaign will be rolled out across all KMH mines in Zimbabwe.\n\nThis will go to all our other operations, we cleared vegetation, we removed crop soil, we disturbed the natural environment, even though we can never completely restore this area to what it was before, that would have been an effort to restore the vegetation, said FRGM managing director Patrick Shayawabaya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08041457/Chief-Chipadze-scaled.jpg",
            "description": "<p>By Staff Reporter A TRADITIONAL leader from Mashonaland Central, Chief Chipadze has urged mining companies to take environmental conservation seriously by planting indigenous trees to counter deforestation and land degradation caused by mining activities. The traditional leader was giving remarks at a sustainability campaign launch event, which was held by Freda Rebecca Gold Mine (FRGM)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chief-hails-freda-rebecca-reforestation-programme-calls-on-mining-companies-to-take-a-leaf/\">Chief hails Freda Rebecca reforestation programme, calls on mining companies to take a leaf</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Supreme Court throws out Chimombe’s appeal in US$7 million Presidential Goat Scheme fraud case",
            "url": "https://www.newzimbabwe.com/supreme-court-throws-out-chimombes-appeal-in-us7-million-presidential-goat-scheme-fraud-case/",
            "content": "By Staff Reporter\n\nTHE Supreme Court has thrown out an appeal by controversial businessman Mike Chimombe, who was challenging denial of bail by the High Court.\n\nChimombe is facing high profile fraud allegations after he allegedly duped the Ministry of Lands US$7 million by securing a tender to supply goats using a non-existent company.\n\nHe is jointly charged with his partner Moses Mpofu, whose appeal is yet to be finalised by the Supreme Court.\n\nThe two were denied bail by High Court Judge Justice Pisirayi Kwenda who ruled that they were likely to abscond given the offence they were facing that attracts 20 years imprisonment if convicted.\n\nThe Supreme Court concurred with Kwenda ruling that his decision cannot be faulted.\n\nThe court found that the State had established compelling reasons for his continued detention, including the likelihood of absconding, the seriousness of the charges and the risk of interfering with witnesses, said the State after the ruling.\n\nChimombe has been at the centre of a high-profile fraud case involving allegations of misusing funds related to Presidential Goat Pass-On Scheme.\n\nAlong with his co-accused he was arrested in 2024 Chimombe was initially denied bail by the magistrates court in July 2024, with the court citing concerns that he was likely to abscond and interfere with witnesses.\n\nHe appealed this decision at the High Court, but the appeal was overtaken by events when he and his co-accused were indicted for trial at the same court.\n\nIn January 2025, Chimombe filed a further bail application at the High Court, which was also denied.\n\nChimombe then took his case to the Supreme Court, arguing that the High Court erred by relying on the magistrates earlier findings instead of applying a fresh mind to his bail application.\n\nHe maintained that the State failed to prove compelling reasons for his continued detention.\n\nHe is represented by Ashiel Mugiya, who is instructing Lovemore Madhuku.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Staff Reporter  THE Supreme Court has thrown out an appeal by controversial businessman Mike Chimombe, who was challenging denial of bail by the High Court. Chimombe is facing high profile fraud allegations after he allegedly duped the Ministry of Lands US$7 million by securing a tender to supply goats using a non-existent company. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-throws-out-chimombes-appeal-in-us7-million-presidential-goat-scheme-fraud-case/\">Supreme Court throws out Chimombe’s appeal in US$7 million Presidential Goat Scheme fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Jailed AMH journalist Blessed Mhlanga files High Court appeal against decision denying him bail",
            "url": "https://www.newzimbabwe.com/jailed-amh-journalist-blessed-mhlanga-files-high-court-appeal-against-decision-denying-him-bail/",
            "content": "By Staff Reporter\n\nALPHA Media Holdings senior journalist Blessed Mhlanga, who is currently locked up in remand prison on allegations of transmitting information that incites violence, has filed an appeal at the High Court challenging magistrate Farai Gwitimas decison to deny him bail.\n\nThe journalist has been behind bars for close to two weeks now.\n\nHis arrest followed interviews he allegedly had with Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza is currently being sought by the police to answer to incitement, undermining the authority of the President and theft charges.\n\nIn denying him bail, Gwitima ruled that Mhlanga was likely to interfere with witnesses who are his subordinates.\n\nThe magistrate also said his release has potential to spark unrest in Zimbabwe.\n\nThrough his lawyer, Chris Mhike, the AMH senior scribe told the High Court that Gwitima was wrong in denying him bail.\n\nWe have amplified our efforts to secure freedom for Mhlanga by filing an appeal at High Court against Harare Magistrate Farai Gwitimas decision to deny bail to the senior journalist.\n\nIn the appeal, our lawyer Chris Mhike, argued that Magistrate Gwitima grossly erred and misdirected himself in denying bail to Mhlanga late last month as there were no compelling reasons to justify Mhlangas continued incarceration, said ZLHR.\n\nThe appeal is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26062142/Mhlanga-Blessed.png",
            "description": "<p>By Staff Reporter  ALPHA Media Holdings senior journalist Blessed Mhlanga, who is currently locked up in remand prison on allegations of transmitting information that incites violence, has filed an appeal at the High Court challenging magistrate Farai Gwitima’s decison to deny him bail. The journalist has been behind bars for close to two weeks now.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jailed-amh-journalist-blessed-mhlanga-files-high-court-appeal-against-decision-denying-him-bail/\">Jailed AMH journalist Blessed Mhlanga files High Court appeal against decision denying him bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Zanu PF crafts digital media policy to rein in rogue members",
            "url": "https://www.newzimbabwe.com/zanu-pf-crafts-digital-media-policy-to-rein-in-rogue-members/",
            "content": "By Darlington Gatsi\n\nZIMBABWES governing party, Zanu PF is in the process of crafting a digital media policy to rein in its members and affiliates, who have been at loggerheads with some leaders as internal conflicts persist.\n\nThe envisaged policy was submitted to the Politburo Wednesday for consideration as the party frets over members abusing social media.\n\nAddressing the media at the party headquarters recently, Zanu PF secretary for legal affairs, Patrick Chinamasa, said there are members who are using social media to cause instability within the party.\n\nThe national political commissar is chairing a committee to come up a Zanu PF social media management policy. We found that the party has suffered a lot of harm from what goes on on social media.\n\nWhat we do not approve is a Zanu PF cadre, a member of Zanu PF from the cell right up to the president, use social media to criticise colleagues. The channels are there. We are hopeful the social media policy that is to be crafted will assist not entirely or help assist put order and discipline and unity within our party, said Chinamasa.\n\nZanu PF has been struggling to contain its members and affiliates, some of which were ostensibly created to support President Emmerson Mnangagwa. One of the affiliates, Varakashi for ED, recently criticised Chinamasa after he warned them about bringing the party into disrepute.\n\nThey have been accused of fanning factionalism, going against President Mnangagwas public declaration of not seeking re-election.\n\nDespite some of the affiliates having been established to counter the narrative of the opposition using digital media, some have reflected Zanu PFs divisions, with members split between supporting Mnangagwa and his deputy, Constantino Chiwenga, who is touted to be next in the partys succession plan.\n\nChinamasa said once the digital media policy has been approved, Zanu PF will nip in the bud any members going against the party.\n\nThe party is going to put its foot down on issues to do with WhatsApp exchanges. We have developed technology to detect who are the ghost people. A lot of people have been masquerading under ghost accounts. We have technology to tell who is a ghost. This time we will be able to uncover who are the ghosts doing all these things, he said.\n\nZanu PF recently purged and suspended members who were accused of spreading divisive messages using social media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/02192657/Social-media.jpg",
            "description": "<p>By Darlington Gatsi  ZIMBABWE’S governing party, Zanu PF is in the process of crafting a digital media policy to rein in its members and affiliates, who have been at loggerheads with some leaders as internal conflicts persist. The envisaged policy was submitted to the Politburo Wednesday for consideration as the party frets over members abusing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-crafts-digital-media-policy-to-rein-in-rogue-members/\">Zanu PF crafts digital media policy to rein in rogue members </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Police detective killed in shootout while pursuing armed robbers",
            "url": "https://www.newzimbabwe.com/police-detective-killed-in-shootout-while-pursuing-armed-robbers/",
            "content": "By Staff Reporter\n\nIN a tragic incident, a member of the Zimbabwe Republic Police (ZRP) Criminal Investigations Department (CID) Homicide, Detective Constable Cassandra Hove, was shot dead Thursday night while pursuing armed robbery suspects.\n\nThe shooting incident occurred in the Harbek area, Pumula South in Bulawayo.\n\nIn a statement, ZRP national spokesperson, Commissioner Paul Nyathi said a probe into the shooting is underway.\n\nThe Commissioner-General of Police Stephen Mutamba expresses condolences to the Hove family and assures the public that comprehensive investigations are underway with a view of establishing what actually transpired, said Nyathi.\n\nThe ZRP has promised to fight back any armed robbers in the country.\n\nMeanwhile, the Zimbabwe Republic Police reiterates that there is no going back in the fight against armed robberies and other violent crimes in the country, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/07165405/1741365604148.jpg",
            "description": "<p>By Staff Reporter  IN a tragic incident, a member of the Zimbabwe Republic Police (ZRP) Criminal Investigations Department (CID) Homicide, Detective Constable Cassandra Hove, was shot dead Thursday night while pursuing armed robbery suspects. The shooting incident occurred in the Harbek area, Pumula South in Bulawayo. In a statement, ZRP national spokesperson, Commissioner Paul Nyathi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-detective-killed-in-shootout-while-pursuing-armed-robbers/\">Police detective killed in shootout while pursuing armed robbers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "UK: Moving tributes as former BBC journalist laid to rest",
            "url": "https://www.newzimbabwe.com/uk-moving-tributes-as-former-bbc-journalist-laid-to-rest/",
            "content": "By UK Correspondent\n\nLONDON: It is difficult to put into words the depth of our loss, but even harder to fully capture the incredible life that he lived, said Duduzile Machipisa.\n\nAs a journalist, he was passionate about telling stories that needed to be told, Duduzile added in a touching tribute to her late father and former BBC reporter Lewis Machipisa.\n\nDuduzile Machipisa\n\nHis work at BBC Africa was more than a career; it was a calling. He believed in the truth, in justice and in giving a voice to the unheard.\n\nDozens of colleagues from the BBC, the UK-Zimbabwe media fraternity, as well as family and friends attended Machipisas funeral service and burial last Thursday at the Kemnal Park Cemetery & Memorial Gardens in London.\n\nUK-based global risk solutions provider,Diaspora Insurance, sponsored the live broadcasting of the funeral service.\n\nTributes from colleagues and friends captured the fascinating contrast between the seriousness of Machipisas impactful journalism and his humble, unassuming and happy-go character.\n\nIfhakuna matata (no worries) was a person, that was Lewis; just unbothered, explained long-time friend and colleague Innocent Chifamba Sithole.\n\nLewis lived authentically  no frills, just Lewis. He represented the lighter side of life. He was sunshine and what I mean by that is you wouldnt be talking to Lewis if you were not smiling and laughing.\n\nViolet Gonda, another contemporary of Machipisa added, Lewis was a very close friend; I used to call him MaChips.\n\nHe was just a fun-loving guy and I remember the last time I saw him was at the UK Zimbabwe Achievers Awards. He is the one who made the whole event so entertaining.\n\nHe wouldnt keep quiet and was just dancing throughout the evening; that was Lewis for you.\n\nLance Guma (right)\n\nNehanda Radios Lance Guma said, The guy (Lewis) was always making us laugh.\n\nI dont remember a single event I went to and did not leave with a sore set of ribs from the laughter. He was comedy gold; he knew how to make us laugh.\n\nWhile comedy defined how Machipisa related with family and friends, his journalism was anything but; it was serious, professional, impactful and inspirational.\n\nHopewell Chinono is another veteran journalist and long-time friend who attended the funeral. Chinono was in the same class at journalism school in Harare with Machipisa between 1991 and 1993.\n\nLewis was dedicated to his work to a point where he had to leave Zimbabwe and come into exile in the United Kingdom because he was being harassed by the then (Robert) Mugabe administration.\n\nChofamba Sithole added; He (Lewis) was an inspiration to me as a young journalist in Zimbabwe. I got to know him when he was already working with IPS and covering stories for global audiences.\n\nHe quickly followed that up with the BBC, reporting from hot spots such as South Sudan as it emerged to become Africas 54thindependent nation; Lewis was there to report and record that moment in history.\n\nHis voice is well known and beloved across the African continent which he reached out to through BBC World Service programmes such as Focus on Africa and Network Africa.\n\nHe (Lewis) was a pathfinder, concluded Professor Winston Mano of the University of Westminsters School of Media and Communication.\n\nHe introduced many of us to the BBC. A humble man and keen journalist but also somebody who was the soul of the party; always up for a good laugh.\n\nMachipisa, who was 53, passed on peacefully at his home in Catford, Southeast London, on Wednesday morning, January 8, 2025. He is survived by three children Dudu, Dumi, and Chikomborero.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/07093048/Machipisa-Collage-e1741339864986.png",
            "description": "<p>By UK Correspondent LONDON: “It is difficult to put into words the depth of our loss, but even harder to fully capture the incredible life that he lived,” said Duduzile Machipisa. “As a journalist, he was passionate about telling stories that needed to be told,” Duduzile added in a touching tribute to her late father</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-moving-tributes-as-former-bbc-journalist-laid-to-rest/\">UK: Moving tributes as former BBC journalist laid to rest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Four dead at Christmas Pass as haulage truck rams into cars, pedestrians",
            "url": "https://www.newzimbabwe.com/four-dead-at-christmas-pass-as-haulage-truck-rams-into-cars-pedestrians/",
            "content": "By Staff Reporter\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/07051403/GlWsqmsXMAAprSP.jpeg",
            "description": "<p>By Staff Reporter FOUR people died Thursday after a haulage truck rammed into four vehicles before ploughing into pedestrians while descending the Christmas Pass in Mutare. An undisclosed number of people sustained injuries. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the road traffic accident at a treacherous mountainous stretch along the Mutare-Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-dead-at-christmas-pass-as-haulage-truck-rams-into-cars-pedestrians/\">Four dead at Christmas Pass as haulage truck rams into cars, pedestrians </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        },
        {
            "title": "Zimbabwe awaits decision on its application to join BRICS – Foreign Minister",
            "url": "https://www.newzimbabwe.com/zimbabwe-awaits-decision-on-its-application-to-join-brics-foreign-minister/",
            "content": "TV Brics\n\nMinister of Foreign Affairs and International Trade of Zimbabwe Amon Murwira has arrived in Moscow on a visit to hold talks with Russian Foreign Minister Sergey Lavrov.\n\nAt a press conference following the meeting, the Russian Minister said relations between the countries were based on the principles of equality and mutual respect.\n\nWe paid special attention to the need to strengthen trade and economic cooperation, agreed to take additional steps to identify promising areas of joint interests, first of all in geological exploration, development of mineral resources, energy, including nuclear, agriculture, space, as well as information and communication technologies, said Sergey Lavrov, Russian Foreign Minister.\n\nHe pointed out that Russia annually allocates 125 scholarships for Zimbabwean citizens to study in the countrys universities. He said the Russian side is ready to increase this quota.\n\nLavrov also said that the third Russia-Africa summit will be held in 2026, and the second ministerial conference of the Russia-Africa Partnership Forum will be held in 2025 in one of the African countries.\n\nFor his part, Murwira emphasised that Zimbabwe and Russia enjoy excellent relations in the political sphere and are working to ensure that ties expand in the economic field.\n\nJournalists asked the ministers a number of questions on the international agenda. Murwira, among others, responded to a question of TV BRICS correspondent Yana Panferova on Zimbabwes possible participation in BRICS. The minister said the association represented one of the most important platforms for economic cooperation.\n\nZimbabwe is currently working on fulfilling the requirements necessary to join BRICS. We are at the application stage and are awaiting a response in line with the consensus reached within the BRICS framework, said Amon Murwira, Zimbabwes Minister of Foreign Affairs and International Trade.\n\nThis is Murwiras first visit to Moscow as Zimbabwes Foreign Minister.\n\nRead original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13165307/Zimbabwe-s-President-Emmerson-Mnangagwa-L-Zimbabwe-s-Minister-of-Foreign-Affairs-and-International-Trade-Amon-Murwira.webp",
            "description": "<p>TV Brics Minister of Foreign Affairs and International Trade of Zimbabwe Amon Murwira has arrived in Moscow on a visit to hold talks with Russian Foreign Minister Sergey Lavrov. At a press conference following the meeting, the Russian Minister said relations between the countries were based on the principles of equality and mutual respect. “We</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-awaits-decision-on-its-application-to-join-brics-foreign-minister/\">Zimbabwe awaits decision on its application to join BRICS – Foreign Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "08 Mar 2025"
        }
    ]
}