{
    "news": [
        {
            "title": "Central Bank’s Financial Intelligence Unit officials arrested over US$2,500 extortion",
            "url": "https://www.newzimbabwe.com/central-banks-financial-intelligence-unit-officials-arrested-over-us2500-extortion/",
            "content": "By Staff Reporter\n\nTwo officials from the Reserve Bank of Zimbabwes Financial Intelligence Unit (FIU) have been arrested on allegations of extorting US$2,500 from a Bulawayo businessman, promising to facilitate the unfreezing of his bank accounts.\n\nThe two are Tonderai Makoni and Wisdom Mutami.\n\nAccording to the Zimbabwe Anti-Corruption Commission (ZACC), which arrested the two, their alleged accomplice, Clemence Nyamima, is still at large.\n\nThe two accused persons, acting in common purpose with a third accomplice, Clemence Nyamima (still at large), allegedly demanded money from a Bulawayo-based businessman whose accounts are frozen by the FIU, claiming Makoni will facilitate the unfreezing.\n\nIt is alleged that in May 2025, Mutami approached a businessman whose accounts are frozen by FIU, claiming he can facilitate the unfreezing of accounts by his relative, Makoni, ZACC said in a statement.\n\nIt is alleged that Mutami demanded US$3,000, which was later negotiated down to US$2,500.\n\nThe complainant made an initial payment of US$520 to Nyamimas mobile wallet, on Makonis instructions.\n\nThe balance of US$2,000 was later handed over in cash.\n\nDespite these payments, the complainants accounts remained frozen, and the accused persons became evasive, prompting the complainant to lodge a report with ZACC.\n\nMutami was arrested in Bulawayo on 23 July 2025 while Makoni was arrested in Harare.\n\nThe two are due to appear in court for initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>By Staff Reporter Two officials from the Reserve Bank of Zimbabwe’s Financial Intelligence Unit (FIU) have been arrested on allegations of extorting US$2,500 from a Bulawayo businessman, promising to facilitate the unfreezing of his bank accounts. The two are Tonderai Makoni and Wisdom Mutami. According to the Zimbabwe Anti-Corruption Commission (ZACC), which arrested the two,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/central-banks-financial-intelligence-unit-officials-arrested-over-us2500-extortion/\">Central Bank’s Financial Intelligence Unit officials arrested over US$2,500 extortion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "25 Jul 2025"
        },
        {
            "title": "PSL, ZWSL set to elect new executives",
            "url": "https://www.newzimbabwe.com/psl-zwsl-set-to-elect-new-executives/",
            "content": "By Sports Reporter\n\nThe Premier Soccer League (PSL) and Zimbabwe Womens Super League (ZWSL) will today head to the polls in Harare to elect new executive leadership, under the oversight of the Zimbabwe Football Association (ZIFA).\n\nThe elections mark a significant step forward for both leagues, which have been operating under interim leadership in recent months. The PSL has been without a chairman since the resignation of Farai Jere in 2024.\n\nFour candidates are vying for the PSL chairmanship: Dumisani Sisale (FC Platinum), Masimba Chihowa (Manica Diamonds), Leonard Musariri (Ngezi Platinum), and Isiah Mupfurutsa (Simba Bhora).\n\nIn the ZWSL, two candidates are in the running for the chairperson position: Chido Chizondo of Platinum Royals and Thokoziso Moyo of Black Rhinos Queens.\n\nThe ZWSL has been under the leadership of an interim committee appointed by the ZIFA Normalisation Committee, following the dissolution of the Barbara Chikosi-led executive over allegations of poor management.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/25060345/vote.png",
            "description": "<p>By Sports Reporter The Premier Soccer League (PSL) and Zimbabwe Women’s Super League (ZWSL) will today head to the polls in Harare to elect new executive leadership, under the oversight of the Zimbabwe Football Association (ZIFA). The elections mark a significant step forward for both leagues, which have been operating under interim leadership in recent</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-zwsl-set-to-elect-new-executives/\">PSL, ZWSL set to elect new executives </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:48",
            "date": "25 Jul 2025"
        }
    ]
}