{
    "news": [
        {
            "title": "Pretoria High Court orders repatriation of Zambia’s ex-president Edgar Lungu’s body",
            "url": "https://www.newzimbabwe.com/pretoria-high-court-orders-repatriation-of-zambias-ex-president-edgar-lungus-body/",
            "content": "SundayWorld\n\nThe Pretoria High Court has delivered a historic ruling today, ordering the repatriation of former Zambian President Edgar Lungus body home for a state funeral, resolving a nearly two-month dispute that captivated the nation and resonated across southern Africa.\n\nLungu, who passed away on June 5 at Mediclinic Medforum in Pretoria during treatment for oesophageal cancer, will be laid to rest at Embassy Park in Lusaka with full military honours, as mandated by the court.\n\nThis is a matter of national dignity, said Acting Judge President Aubrey Ledwaba, delivering the ruling alongside a full bench. As a former head of state, President Lungus burial must reflect Zambias protocol and honour his service to the nation.\n\nThe decision followed a heated legal battle between the Zambian government, represented by Attorney General Mulilo Kabesha, and Lungus family, who insisted on a private burial in South Africa to honour the late Presidents alleged wish to exclude his political rival, President Hakainde Hichilema, from the proceedings.\n\nLungu, Zambias sixth president from 2015 to 2021, was a polarising figure whose death at age 68 sparked a controversy reflective of his contentious political career. His widow, Esther Lungu, and lawyer Makebi Zulu argued that Lungu had explicitly stated his wishes.\n\nMy husband was clear: he wanted President Hichilema nowhere near his funeral or his body, Esther Lungu stated in her affidavit.\n\nThe family cited past grievances, including the 2023 stripping of Lungus presidential benefits and alleged delays in approving his medical evacuation to South Africa, which they claim hastened his death.\n\nThe Zambian government, however, maintained that national law supersedes personal wishes. The burial of a former President is a state matter, as seen with President Kenneth Kaunda, Kabesha argued in court documents.\n\nThe government sought four key orders: a declaration of its exclusive right to repatriate Lungus body, the release of the body from a Pretoria funeral home to the Zambian High Commission, authorization for a state delegation to accompany the remains, and the exclusion of the familys authority over the burial process.\n\nThe court granted these requests but acknowledged the familys concerns. Judge Ledwaba noted: While we respect the familys sentiments, national protocol must prevail. We urge minimal involvement of President Hichilema to honour their wishes as far as possible.\n\nThe court dismissed an application by Zambian citizen Vincent Kafula to intervene. The applicant lacks the legal standing to influence this matter, said Ledwaba.\n\nKafula had warned that the dispute was tearing Zambia apart.\n\nThe court ordered Lungus body to be transported to Lusaka on a private chartered plane, where it will lie in state at his residence and a conference centre for public viewing before burial at Embassy Park.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/31160456/President-Lungu.jpg",
            "description": "<p>SundayWorld The Pretoria High Court has delivered a historic ruling today, ordering the repatriation of former Zambian President Edgar Lungu’s body home for a state funeral, resolving a nearly two-month dispute that captivated the nation and resonated across southern Africa. Lungu, who passed away on June 5 at Mediclinic Medforum in Pretoria during treatment for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pretoria-high-court-orders-repatriation-of-zambias-ex-president-edgar-lungus-body/\">Pretoria High Court orders repatriation of Zambia’s ex-president Edgar Lungu’s body</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        },
        {
            "title": "Labour Court upholds teacher’s award, slams Watershed College in contract dispute",
            "url": "https://www.newzimbabwe.com/labour-court-upholds-teachers-award-slams-watershed-college-in-contract-dispute/",
            "content": "By Mary Taruvinga\n\nThe Labour Court has dismissed an appeal by Watershed College Trust against an arbitral award in favour of a former probationary teacher, ruling that the institution clearly aprobated and reprobated its contractual obligations and acted unlawfully by issuing notice of termination after the expiration of the probation period.\n\nIn a judgment delivered by Justice Samuel Kudya, the court found that while the arbitrator erred in concluding that the teacher, Jenipha Madziva, had become a permanent employee, the substantive award of damages for unfair dismissal remained valid.\n\nWatershed College Trust had challenged the arbitrators ruling on five grounds, including the claim that Madziva was erroneously classified as a permanent employee and that damages were improperly awarded in US dollars. However, Justice Kudya found that only one of the grounds had merit and upheld the rest of the arbitrators findings.\n\nThe employer clearly aprobated and reprobated by writing in the probation contract that it did not intend to extend it, yet it was doing exactly that which it said it did not intend to do, the judge ruled.\n\nThe dispute arose when the school employed Madziva on a fixed-term probation contract, which was due to expire on 31 March 2023.\n\nOn that very day, the school issued a notice stating it would not be extending her contract.\n\nThe arbitrator ruled that this amounted to unlawful termination and awarded damages, prompting the appeal.\n\nKudya criticised the colleges handling of the matter, stating, Had the employer indeed intended to give notice for the termination of the probation contract, it should have done so before its expiration.  It was not remiss for the arbitrator to conclude that once parties were in the April to December phase of the contract, they were now operating in the main contract.\n\nHe added that the colleges attempt to treat the contract as terminated while simultaneously letting it roll into the next phase of employment cannot pass the unreasonableness test laid out in Hama v NRZ.\n\nOn the matter of prejudice, the court noted that unfair dismissal need not be measured by harm suffered.\n\nPrejudice is indeed not a prerequisite to find unlawful termination, Kudya said, affirming the arbitrators position that the dismissal was inherently unfair.\n\nAddressing the employers objection to the damages awarded in US dollars, the court reaffirmed Zimbabwes multi-currency framework.\n\nThere was nothing remiss by making the order which the arbitrator made.  If the employer wants to pay what was ordered using the rate of the local currency at the date of payment, nothing stops it from doing so.\n\nThe judge further dismissed the employers contention that the arbitrator had wrongly quantified the damages.\n\nIt was unnecessary to try to find out what was due when it was apparent on the contract. The res ipsa loquitur principle applies.\n\nThe judge upheld the appeal relating to the employees classification as permanent.\n\nHe ruled that the arbitral award stands, but with the correction that Madziva was not a permanent employee.\n\nWatershed College Trust was ordered to pay costs on the ordinary scale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13050811/labour-court.jpeg",
            "description": "<p>By Mary Taruvinga The Labour Court has dismissed an appeal by Watershed College Trust against an arbitral award in favour of a former probationary teacher, ruling that the institution “clearly aprobated and reprobated” its contractual obligations and acted unlawfully by issuing notice of termination after the expiration of the probation period. In a judgment delivered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-court-upholds-teachers-award-slams-watershed-college-in-contract-dispute/\">Labour Court upholds teacher’s award, slams Watershed College in contract dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        },
        {
            "title": "‘I felt welcomed’: Zimbabwean rapper marries into Zulu royal heartland",
            "url": "https://www.newzimbabwe.com/i-felt-welcomed-zimbabwean-rapper-marries-into-zulu-royal-heartland/",
            "content": "The South African\n\nZimbabwean rapperAwa Khiwehas married a Qwabe man fromKwaNongomain KwaZulu-Natal, South Africa, marking not just a union of love, but a powerful moment of cultural fusion.\n\nThe intimate traditional wedding, held recently in KwaZulu-Natal, celebrated African heritage and cross-border unity.\n\nBorn Awakhiwe Sibanda, the musician expresses fierce pride in her Ndebele roots as a rapper.\n\nI felt welcomed, she said in an exclusive interview withThe South African.\n\nReferring to her Ndebele roots Awa Khiwe said: They call meumzukulu kaMashobane(the grand daughter of Mashobane). I think once you show people respect, they know you were raised well. Where you come from becomes a secondary issue.\n\nDespite cultural similarities, Awa Khiwe revealed that her upbringing in a Zimbabwean village in Nkayi prepared her for life in KwaNongoma.\n\nBeing raised in the village helped me shape my cultural identity. The KwaNongoma lifestyle is similar to that of Nkayi its not a huge adjustment.\n\nAwa Khiwe, renowned for championing Ndebele pride on global stages, has opened up about embracing a more traditional role in her personal life.\n\nNow living in a new home, the outspoken rapper revealed that while many know her as a fierce and fearless queen, she proudly takes on the role of being a loved,spoiled and submissive wife to her Zulu husband.\n\nSpeaking candidly, she said she respects both Zulu and Ndebele cultures, describing the union as a beautiful exchange rather than a clash.\n\nAwa said her open-mindedness allows her to find strength in unity and mutual respect, rather than division, even in deeply rooted cultural differences.\n\nVeteran actor Ernest Ndlovu joined Awa Khiwe in KwaNongoma to celebrate her wedding day. Image: Pixel Visuals\n\nWhile fans speculated that new music inspired by the wedding might be on the way, Awa was quick to set the record straight:\n\nI have new music, but it has nothing to do with the wedding, she said. I juggle music and family, Im old enough to handle the situation.\n\nHer husband, a Qwabe man involved in the construction industry, has been in her life for years. The two met through a mutual friend, Macingwana, and nurtured their relationship quietly before tying the knot in a ceremony that honoured both families.\n\nOn social media, she called it the best day of my life and added in a heartfelt tribute:\n\nThank you for keeping your promise, my love. I promise to love, honour, respect and protect you, till death do us part.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/08064403/awa-khiwe.jpeg",
            "description": "<p>The South African Zimbabwean rapper Awa Khiwe has married a Qwabe man from KwaNongoma in KwaZulu-Natal, South Africa, marking not just a union of love, but a powerful moment of cultural fusion. The intimate traditional wedding, held recently in KwaZulu-Natal, celebrated African heritage and cross-border unity. Born Awakhiwe Sibanda, the musician expresses fierce pride in her Ndebele roots</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-felt-welcomed-zimbabwean-rapper-marries-into-zulu-royal-heartland/\">‘I felt welcomed’: Zimbabwean rapper marries into Zulu royal heartland</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        },
        {
            "title": "UK resets ties with Zimbabwe in push for critical minerals",
            "url": "https://www.newzimbabwe.com/uk-resets-ties-with-zimbabwe-in-push-for-critical-minerals/",
            "content": "Bloomberg\n\nZimbabweand theUKare rekindling diplomatic ties after almost three decades of tension, driven by a global surge in demand for critical minerals thats led the former colonial power to pursue $1 billion in deals with the resource-rich nation.\n\nIn June, the UK dispatched Minister for Africa Lord Ray Collins of Highbury to meet Zimbabwean PresidentEmmerson Mnangagwaand other senior leaders. The trip marked a rare encounter between the two nations officials after years of deteriorating relations, especially under former PresidentRobert Mugabe a vocal critic of Britains 90-year colonial rule of the southern African nation.\n\nCollins described his visit as a mission for economic growth that would lead to a win-win situation for both countries. The British Embassy in Harare echoed that sentiment in the past week, citing a $1 billion pipeline of prospective deals across key sectors such as agriculture, finance, telecommunications, renewable energy and critical minerals that it wants to close.\n\nIt identified the 30-megawatt Vungu solar energy investment as a beacon project and said others will follow soon.\n\nThe UK is working hard to increase trade and investment for mutual benefit, a spokesperson said in an emailed response to questions.\n\nZimbabwes foreign affairs spokesperson didnt respond to a request for comment.\n\nRelations between Zimbabwe and Western powers, including the UK, were largely cordial after independence in 1980, with Britain serving as the countrys biggest trading partner and a key source of aid supporting land reform and economic development. In 1997, the ties deteriorated after Britain refused to fund the land reform program. In a letter that November, the UK government said it had no colonial obligation to finance the program. That sparked tensions between the two countries and fueled debate over land redistribution in Zimbabwe.\n\nTwo years later, Zimbabwe defaulted on loan repayments, andin 2000, it began state-sanctioned farm seizures that displaced 4,500 White farmers and caused agricultural output to plunge. In response, the UK and other Western nations imposed sanctions, citing violations of property rights.\n\nBy 2024, the UK ranked as Zimbabwes 14th-largest trading partner, with total trade valued at $155 million  significantly overshadowed byChinas $3.9 billion and theUnited Arab Emiratess $2.9 billion.\n\nThe UKs renewed engagement with Zimbabwe reflects more than a diplomatic thaw and signals a strategic interest in critical minerals, particularly lithium, said Zaynab Hoosen, senior Africa analyst at Pangea-Risk, a specialist intelligence advisory firm. Zimbabwes substantial lithium reserves offer a timely opportunity to diversify supply chains and reduce reliance on dominant producers.\n\nWestern nations from the US to the UK are scouring the globe for greater access to critical minerals needed for clean energy, military infrastructure, advanced defense systems, semiconductors and electric-vehicle batteries.\n\nThe UK said in a policy paperlast monththat an upcoming critical minerals strategy will highlight the importance of forming targeted growth partnerships.\n\nIts strategy in Africa is undergoing an overhaul from traditional aid toward commercially focused, mutually beneficial ties under its newApproach to Africa,unveiled in June, Hoosen said. Recent moves include an infrastructure partnership withSouth Africa, which builds on existing cooperation in platinum group metals and the UKs first trade and investment mission to Angola, where UK-based firmPensana Plcis advancing theLongonjo Rare Earth Project.\n\nFor Zimbabwe, the benefits go beyond minerals diplomacy, as the stronger ties with the UK offer access to diversified investment, expanded trade and renewed international legitimacy, Hoosen added.\n\nThe improved relations also coincide with Zimbabwes economic diplomacy strategy adopted by its cabinet last month that prioritizes key sectors including mining, manufacturing and agriculture in foreign relations.\n\nZimbabwe is what it is because of the economic endowments that it has, Foreign Affairs and International Trade Minister Amon Murwira told a post-cabinet briefing on July 29 as he unveiled the new policy. The southern African nation wont hesitate to leverage on its natural resources to further its national interests, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/08061230/lithium-rock.webp",
            "description": "<p>Bloomberg Zimbabwe and the UK are rekindling diplomatic ties after almost three decades of tension, driven by a global surge in demand for critical minerals that’s led the former colonial power to pursue $1 billion in deals with the resource-rich nation. In June, the UK dispatched Minister for Africa Lord Ray Collins of Highbury to meet Zimbabwean President Emmerson</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-resets-ties-with-zimbabwe-in-push-for-critical-minerals/\">UK resets ties with Zimbabwe in push for critical minerals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        },
        {
            "title": "Doctors Without Borders calls for urgent action as anti-migrant groups block access to essential medical care for foreigners in South Africa",
            "url": "https://www.newzimbabwe.com/doctors-without-borders-calls-for-urgent-action-as-anti-migrant-groups-block-access-to-essential-medical-care-for-foreigners-in-south-africa/",
            "content": "By Thandiwe Garusa\n\nDOCTORS Without Borders (MSF) in South Africa has raised serious concerns over the ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring countrys already overstretched public resources.\n\nThe targeted foreigners includeZimbabweans, who make up a large portion of undocumented immigrants.\n\nHowever,evensome ofthoseZimbabweanswho are legally living and working in South Africa are also being denied access to healthcare.\n\nAnti-migrant groups have camped outside dozens of clinics and hospitals in Gauteng, preventing non-South Africans from entering public health facilities to seek medical care regardless of their legal documentation status.\n\nIn a statement issued Thursday, MSF warned that the lives of pregnant women, children, people living with HIV, and chronic patients are now at risk, with some having gone weeks without the medication they need, urging authorities to put an end to the xenophobic acts.\n\nDoctors Without Borders (MSF) is deeply concerned by the persistent and systematic physical blocking of non-South Africans from accessing healthcare, including pregnant women, people living with HIV, chronic patients and children, particularly in Gauteng and KwaZulu-Natal.\n\nWe call for immediate action by the National Department of Health (NDoH) and relevant Provincial Departments of Health to guarantee the right of access to healthcare for all, as enshrined in the countrys Constitution and the National Health Act, the statement reads.\n\nMSF also noted that some patients who tried to retrieve their medical files from clinics in an effort to seek care elsewhere were unsuccessful, leaving them uncertain about their next steps.\n\nOthers, lacking prescriptions to refill their medication, are now unable to purchase the medicine they need from pharmacies.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa DOCTORS Without Borders (MSF) in South Africa has raised serious concerns over the ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring country’s already overstretched public resources. The targeted foreigners include Zimbabweans, who make up a large portion of undocumented immigrants. However, even some of those Zimbabweans who are legally</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctors-without-borders-calls-for-urgent-action-as-anti-migrant-groups-block-access-to-essential-medical-care-for-foreigners-in-south-africa/\">Doctors Without Borders calls for urgent action as anti-migrant groups block access to essential medical care for foreigners in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        },
        {
            "title": "RBZ moves to salvage ‘fragile’ ZWG ahead of monocurrency plans",
            "url": "https://www.newzimbabwe.com/rbz-moves-to-salvage-fragile-zwg-ahead-of-monocurrency-plans/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) Thursday upheld the tight Monetary Policy stance as a strategy to conserve the local currency.\n\nPresenting the Mid-Term Monetary Policy Statement (MPS), premised under the theme Walking The Talk And Staying The Course, the central bank governor, Dr John Mushayavanhu, once again stated that the bank was receiving widespread acclaim for its sustained exchange rate stability.\n\nThe RBZ projected inflation to end the year at around 30%, giving a positive real interest rate of 5% and maintained the Bank Policy rate at 35% despite sustained outcry from industry on the need to ease the cost of borrowing.\n\nThe high policy rate has choked productivity in the recent past by worsening the cost of capital to fund critical industry needs. However, on its part, the RBZ believes that such rates are necessary to curb speculative borrowing.\n\nOn bank charges, the MPS implored banks to adhere to the measures announced in the February 2025 Monetary Policy Statement to exempt from bank charges all accounts that maintain a balance below US$100 or its equivalent in ZiG.\n\nIn addition, Point of Sale (POS) transactions for amounts less than US$5 or its equivalent in ZiG were also exempted from transaction charges for both banking institutions and Payment System Providers (PSPs).\n\nWhile a noble step, the move falls far short of addressing the thorn in flesh for the transacting public who are ordinarily forced to part ways with US$3,00 per every US$100 withdrawn from banks, a position which increases the cost of doing business, especially for corporates who withdraw large volumes of money.\n\nThe current statutory reserve requirements are set between 15% and 30% depending on the nature of the deposits. Banking institutions can, therefore, easily reduce the effective statutory reserve requirements towards 15% by attracting more long-term deposits.\n\nThe statutory reserve ratios, therefore, remain unchanged and will be reviewed when appropriate and consistent with the monetary policy thrust, reads the MPS in part.\n\nThis is despite complaints from the banking sector alleging that high statutory reserves are mopping up excess resources necessary to support productive lending.\n\nThe MPS maintained the export surrender thresholds at 30% but did not address the pertinent concerns raised by exporters who allege they have not been paid the ZWG portion for a prolonged period of time in what experts believe to be one of the strategies to protect the local unit.\n\nMarket watchers suspect that the move to withhold the export surrender thresholds for fear of weakening ZWG is an indication of a currency facing the crisis of fragility.\n\nDespite having triggered fears across the markets on impending monocurrency by 2030, Dr Mushayavanhus MPS did not disclose the practical roadmap to his course of action, instead opting to give assurances of a workable process.\n\nThe de-dollarisation roadmap will be crystallised in the National Development Strategy II and the Reserve Bank, which is chairing the NDS2 Thematic Working Group on Macroeconomic Stability and Financial Deepening (MESFIND) is currently seized with consultations on the issue.\n\nThe roadmap will undoubtedly encapsulate the need to maintain the current stability, preserve the foreign currency accounts and the value of the existing USD-denominated contracts. Consideration will always be made to ensure that there is business continuity and certainty, the MPS added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) Thursday upheld the tight Monetary Policy stance as a strategy to conserve the local currency. Presenting the Mid-Term Monetary Policy Statement (MPS), premised under the theme “Walking The Talk And Staying The Course,” the central bank governor, Dr John Mushayavanhu, once again stated that the bank</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rbz-moves-to-salvage-fragile-zwg-ahead-of-monocurrency-plans/\">RBZ moves to salvage ‘fragile’ ZWG ahead of monocurrency plans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        },
        {
            "title": "Defending champions Dynamos prioritising relegation survival over Chibuku Super Cup win",
            "url": "https://www.newzimbabwe.com/defending-champions-dynamos-prioritising-relegation-survival-over-chibuku-super-cup-win/",
            "content": "By Sports Reporter\n\nDynamos FC is this season not prioritising winning the Chibuku Super Cup tournament despite being the defending champions.\n\nThe two-time winners revealed this on Wednesday after eliminating Yadah in the preliminary round of the tournament at Ngoni stadium via penalties 4-3 following a nil-all draw in regulation time.\n\nHaving won the Chibuku Super Cup back to back in 2023 and 2024, Dembare is not worried about chasing a new record of winning the prestigious knockout tournament three times in a row.\n\nOur main aim is to survive relegation, we are not worried much about winning the Chibuku Super Cup.\n\nSo we will push and take each game as it comes, but at the back of our mind, we know what we want, said Dynamos assistant coach Thomas Ruzive.\n\nDynamos is a relegation candidate this season. Currently, the team is sitting second from bottom (17) on the log with 19 points.\n\n2025 marks Dembares worst season run in history as they have only managed three wins in 24 games.\n\nHowever, the Glamour Boys seem to be enjoying life under former Highlanders coach Kelvin Kaindu, who was appointed last week.\n\nSince his arrival, Dembare has won two games, a 1-0 win over MWOS on Saturday and Wednesday, and 4-3 penalty shootout win against Yadah.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/18144839/200853473_277859160786955_7126518592801743654_n.jpg",
            "description": "<p>By Sports Reporter Dynamos FC is this season not prioritising winning the Chibuku Super Cup tournament despite being the defending champions. The two-time winners revealed this on Wednesday after eliminating Yadah in the preliminary round of the tournament at Ngoni stadium via penalties 4-3 following a nil-all draw in regulation time. Having won the Chibuku</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defending-champions-dynamos-prioritising-relegation-survival-over-chibuku-super-cup-win/\">Defending champions Dynamos prioritising relegation survival over Chibuku Super Cup win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "08 Aug 2025"
        }
    ]
}