{
    "news": [
        {
            "title": "Human rights defenders acquitted after year-long trial",
            "url": "https://www.newzimbabwe.com/human-rights-defenders-acquitted-after-year-long-trial/",
            "content": "By Mary Taruvinga\n\nHuman rights activists Robson Chere, Namatai Kwekweza and Samuel Gwenzi, who were arrested after being dragged off a plane last year, are finally free following their acquittal by a Harare magistrate.\n\nThe three walked out of court free after being on trial for over a year, facing disorderly conduct charges.\n\nThey were jointly tried together with others who were arrested on the same charge, who included Vusumuzi Moyo, Phillies Pikitayi, Dephine Gutsa, Simbarashe Blackson, Emmanuel Sitima and Last Chinody, who were also acquitted.\n\nKwekweza (26), Chere (41) and Gwenzi (40) were minutes from taking off on a Fastjet flight to Victoria Falls when they were ordered off a plane at the Robert Gabriel Mugabe International Airport.\n\nPolice accused them of having taken part in an illegal protest outside the Harare Magistrates Court a month earlier, on June 27, in solidarity with over 70 Citizens Coalition for Change activists who were appearing in court.\n\nKwekwezas lawyers successfully argued that she was not in the country on June 27 and accused authorities of arresting the activists as part of an operation driven by paranoia to thwart potential protests during the SADC summit, which Zimbabwe hosted on August 17.\n\nSince 25 July 2024, we have been in and out of courts answering to trumped-up charges which were simply meant to break and discourage us from demanding a just and democratic Zimbabwe. We are finally free after a whole year of persecution. It only strengthened our resolve, Sitima said after the acquittal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21055042/chere-namatai-gwenzi.jpeg",
            "description": "<p>By Mary Taruvinga Human rights activists Robson Chere, Namatai Kwekweza and Samuel Gwenzi, who were arrested after being dragged off a plane last year, are finally free following their acquittal by a Harare magistrate. The three walked out of court free after being on trial for over a year, facing disorderly conduct charges. They were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/human-rights-defenders-acquitted-after-year-long-trial/\">Human rights defenders acquitted after year-long trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:54",
            "date": "21 Aug 2025"
        },
        {
            "title": "High Court upholds detention of DRC refugee pending identity verification",
            "url": "https://www.newzimbabwe.com/high-court-upholds-detention-of-drc-refugee-pending-identity-verification/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an urgent bid by a Congolese national seeking immediate release from Harare Remand Prison, ruling that his detention is lawful under the countrys immigration laws.\n\nBenoit Ombeni Mupenzi, who claims to be a refugee in Zimbabwe, had argued that his incarceration was unlawful as he had not been informed of the reasons for his arrest nor shown a valid warrant.\n\nHe told the court that his liberty was being arbitrarily restrained, causing irreparable harm and insisted he was unaware of any offence committed.\n\nSitting at the Harare High Court, Justice Fatima Maxwell held that authorities were acting within the law.\n\nCiting section 8(1) of the Immigration Act [Chapter 4:02], the judge said, The detention of the applicant is in terms of a law which remains in our statute books. Until and unless section 8 of the Immigration Act is declared unconstitutional and such declaration is confirmed by the Constitutional Court, the courts hands are tied.\n\nThe provision gives immigration authorities up to 14 days to verify an individuals identity, nationality and antecedents.\n\nThe Chief Immigration Officer opposed Mupenzis release, stating that his nationality was still under investigation and that none of the documents he presented substantiated his claim to refugee status.\n\nApplicants identity and nationality status have been questioned by the countrys security apparatus, the court was told.\n\nThe judge acknowledged Mupenzis complaint over not being given reasons for his detention, but made it clear that release was not the remedy. Whilst applicant might have a genuine grievance that he was not furnished with reasons for the arrest and detention forthwith, I am not persuaded that the remedy for that is his immediate release, she said.\n\nThere was no order regarding costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an urgent bid by a Congolese national seeking immediate release from Harare Remand Prison, ruling that his detention is lawful under the country’s immigration laws. Benoit Ombeni Mupenzi, who claims to be a refugee in Zimbabwe, had argued that his incarceration was unlawful as he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-upholds-detention-of-drc-refugee-pending-identity-verification/\">High Court upholds detention of DRC refugee pending identity verification</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:54",
            "date": "21 Aug 2025"
        },
        {
            "title": "Delayed govt payments force Bitumen World to cut jobs",
            "url": "https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/",
            "content": "By Alois Vinga\n\nDELAYED payments to government contractors have left one of the countrys top construction companies, Bitumen World (BW), with no choice but to cut down jobs.\n\nProblems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the governments agenda to revamp the countrys infrastructure.\n\nMarket watchers believe the government is withholding the payments, especially in the local ZWG currency, in a bid to curtail parallel market activities, which trigger depreciation. Just recently, mineral exporting companies revealed that the central bank has not been paying their 30% export surrender in local currency.\n\nThe latest decision by Bitumen Worlddemonstrates the authorities appetite to uphold currency stability even at the cost of other critical economic imperatives.\n\nThe Zimbabwean government, one of the companys largest debtors, is experiencing significant challenges in making timely payments to its contractors. The government is facing delays in settling arrears, affecting various projects, including road rehabilitation and dam construction.\n\nWhile efforts are underway to establish payment plans and small payments have been received, these financial constraints have contributed to the companys decision to realign its operations to remain resilient in a challenging fiscal environment, said the company.\n\nThe company said this necessary transition reflects a committed effort to adapt to the current economic challenges, including operating under cash flow pressures caused by delayed payments from clients.\n\nBW said it recognises and deeply values the dedication and professionalism of all its employees and is committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\nBW CEO, Andre Zietsman, said the decision has been very tough but had to be made due to limited options at hand.\n\nOver recent months, we have engaged in extensive discussions and evaluations to guide Bitumen World through this difficult period. While the decision to restructure was not made lightly, it is essential for ensuring our long-term viability and ability to continue contributing meaningfully to infrastructure development in Zimbabwe and beyond, he said.\n\nHe said the employees who have worked tirelessly to restore the countrys infrastructure glory will, unfortunately, suffer heavy blows when they see their jobs going down the drain.\n\nThe tragedy of these layoffs is that they impact the very people who built this prestigious brand  a brand that was wholly created by Zimbabweans, said Zietsman.\n\nThe company committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20210647/bitumen-world-.jpeg",
            "description": "<p>By Alois Vinga DELAYED payments to government contractors have left one of the country’s top construction companies, Bitumen World (BW), with no choice but to cut down jobs. Problems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the government’s agenda to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/\">Delayed govt payments force Bitumen World to cut jobs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:54",
            "date": "21 Aug 2025"
        },
        {
            "title": "Teen fined for illegal possession of pistol stolen from his father",
            "url": "https://www.newzimbabwe.com/teen-fined-for-illegal-possession-of-pistol-stolen-from-his-father/",
            "content": "By Staff Reporter\n\nA TEENAGER from Bindura in Mashonaland Central has been fined US$200 for illegal possession of a firearm, which he stole from his fathers gun cabinet.\n\nAccused person, Brian Kaviya (19), was arraigned before the Bindura Magistrates Court, where he pleaded guilty to unlawful possession of a pistol.\n\nHe was fined US$200 or alternatively serve four months imprisonment in default of payment.\n\nThe State case was that on September 11, 2022, at Chiwaridzo Phase 2, Bindura, police officers witnessed the offender fighting with another man. In the melee, a Barandelli pistol, serial number 11323, loaded with a magazine containing two rounds, fell to the ground.\n\nIt was further heard that police immediately intervened to quell the fracas and upon questioning, the offender admitted ownership of the firearm.\n\nInvestigations revealed that he had stolen keys to his fathers gun cabinet, secretly taken the pistol and left home without his parents knowledge.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said parents and guardians should properly secure firearms so that they dont end up in the wrong hands, thereby endangering communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30115141/Pistol.jpg",
            "description": "<p>By Staff Reporter A TEENAGER from Bindura in Mashonaland Central has been fined US$200 for illegal possession of a firearm, which he stole from his father’s gun cabinet. Accused person, Brian Kaviya (19), was arraigned before the Bindura Magistrates Court, where he pleaded guilty to unlawful possession of a pistol. He was fined US$200 or</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-fined-for-illegal-possession-of-pistol-stolen-from-his-father/\">Teen fined for illegal possession of pistol stolen from his father</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:54",
            "date": "21 Aug 2025"
        },
        {
            "title": "Our welfare has worsened – Hwende bemoans poor conditions for MPs",
            "url": "https://www.newzimbabwe.com/our-welfare-has-worsened-hwende-bemoans-poor-conditions-for-mps/",
            "content": "By Staff Reporter\n\nFOR the umpteenth time, Members of Parliament have bemoaned their poor conditions, demanding that the government address their grievances.\n\nSpeaking in the National Assembly recently, opposition MP Chalton Hwende said the welfare of the legislators is worsening.\n\nA month ago, during a workshop in Bulawayo, you promised us that you were going to come to Parliament and address on the issue of the welfare of Members of Parliament.\n\nI noticed that you were not around but since that time, nothing has improved. In fact, it is becoming worse and worse. I just want to remind you of that commitment that you did in Bulawayo, said Hwende.\n\nThe disgruntlement expressed by Hwende is the latest in a series of concerns raised by MPs over their poor welfare, which is marked by the late disbursement of salaries.\n\nThis, according to MPs, has been hindering them from discharging their parliamentary duties in their respective constituencies.\n\nMPs are entitled to allowances, vehicles and Community Development Funds (CDF), which are used on different projects in constituencies.\n\nIn response, the Speaker of the National Assembly, Jacob Mudenda, said the government was in the process of disbursing funds for the welfare of the legislators.\n\nWe have had a meeting with the Hon. Minister of Finance, and the matter is being handled. What is outstanding at the moment, what was paid for and other urgent matters where members were behind, including coupons, is ZWL1.5 million and what we, as Parliament, had indicated to bring all the requirements up to date, we needed ZWL5 million.\n\nI was assured that the balance of ZWL3.5 million should be paid before the end of this month. The Hon. Deputy Minister is here. That is what we have arranged, said Mudenda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/02043546/Chalton-Hwende.jpg",
            "description": "<p>By Staff Reporter FOR the umpteenth time, Members of Parliament have bemoaned their poor conditions, demanding that the government address their grievances. Speaking in the National Assembly recently, opposition MP Chalton Hwende said the welfare of the legislators is worsening. “A month ago, during a workshop in Bulawayo, you promised us that you were going</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/our-welfare-has-worsened-hwende-bemoans-poor-conditions-for-mps/\">Our welfare has worsened – Hwende bemoans poor conditions for MPs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:54",
            "date": "21 Aug 2025"
        },
        {
            "title": "Pastor up for indecent assault",
            "url": "https://www.newzimbabwe.com/pastor-up-for-indecent-assault/",
            "content": "By Staff Reporter\n\nA Zvishavane-based Pastor has been arraigned before the Kwekwe Magistrates Court facing charges of aggravated indecent assault after he allegedly sexually violated a teenage male congregant.\n\nThe incident occurred on August 11 2025, at the victims home in Redcliff.\n\nThe victim allegedly woke up to find himself being caressed by the accused person, who had paid a visit to the victims family, said the state.\n\nWhen the victim enquired about his actions, the accused person allegedly said that the victim was too handsome and the lack of beard made him feel as if he was in bed with a woman, the court further heard.\n\nThe accused person is alleged to have forcibly removed the victims shorts and threatened to shoot him with a gun if he screamed or told anyone.\n\nHe then forced himself on the victim three times that night. The accused person left the victims home at 0630 hours.\n\nThe victim disclosed his ordeal to his aunt on the same day.\n\nThe matter was reported at Redcliff Police Station, leading to the arrest of the accused.\n\nThe accused was remanded in custody and will be back in court on 27th of August 2025 for trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/29060624/kwekwe-mag.jpg",
            "description": "<p>By Staff Reporter A Zvishavane-based Pastor has been arraigned before the Kwekwe Magistrates’ Court facing charges of aggravated indecent assault after he allegedly sexually violated a teenage male congregant. The incident occurred on August 11 2025, at the victim’s home in Redcliff. “The victim allegedly woke up to find himself being caressed by the accused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-up-for-indecent-assault/\">Pastor up for indecent assault </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:54",
            "date": "21 Aug 2025"
        }
    ]
}