{
    "news": [
        {
            "title": "Dynamos being run like a tuck-shop says fuming supporters",
            "url": "https://www.newzimbabwe.com/dynamos-being-run-like-a-tuck-shop-says-fuming-supporters/",
            "content": "By Darlington Gatsi\n\nDYNAMOS fans have declared war on club owner Bernard Marriot and his executive, vowing to protest against the maladministration that has seen the Harare giants slide into murky waters.\n\nThe fading Harare side find themselves in a quagmire days before they face old foes Highlanders on Sunday at Rufaro Stadium, with fan unrest threatening to overshadow the encounter.\n\nDynamos supporters are demanding sweeping reforms at the club, which they argue will address the troubles burdening the 22-time league champions.\n\nTeam loyalists are threatening to boycott the Highlanders match as they demand Marriot fire the board, led by Moses Maunganidze, whom they accuse of incompetence and unprofessionalism.\n\nAddressing the media in Harare Thursday, Dynamos Harare Chapter Organising Secretary Robetho Machovo said the deterioration at the club had reached alarming levels, prompting the boycott.\n\nWe are frustrated by the current state of affairs at our beloved club Dynamos. The mismanagement by the Dynamos executive led by Bernard Marriot, his relatives, and the so-called NEC has reached a boiling point, said Machovo.\n\nDynamos continue to sink deeper, currently occupying the relegation zone, separated by only two points from Kwekwe United, who sit at the basement of the table.\n\nDeMbare have managed just one win in 13 matches, scoring only two goalsa record that has sparked fury among supporters.\n\nThe struggles have been attributed to poor recruitment and the general welfare of players at the club.\n\nMachovo accused Dynamos leadership of running the club with an amateurish, and an outdated approach.\n\nWe can no longer remain silent. Our key concerns is the tuck shop mentality, outdated approach and sponsorship failure, said Machovo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Darlington Gatsi DYNAMOS fans have declared war on club owner Bernard Marriot and his executive, vowing to protest against the maladministration that has seen the Harare giants slide into murky waters. The fading Harare side find themselves in a quagmire days before they face old foes Highlanders on Sunday at Rufaro Stadium, with fan</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-being-run-like-a-tuck-shop-says-fuming-supporters/\">Dynamos being run like a tuck-shop says fuming supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "Mnangagwa officially opens Trabablas roadworks to motorists, promises six more interchanges in Harare",
            "url": "https://www.newzimbabwe.com/mnangagwa-officially-opens-trabablas-roadworks-to-motorists-promises-six-more-interchanges-in-harare/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has announced an ambitious expansion of Harares road network that includes the construction of new multiple interchanges and deployment of smart traffic systems.\n\nMnangagwa was delivering his remarks at the official opening of the Trabablas Interchange, formerly Mbudzi Roundabout, where he said two additional interchanges will be built along Simon Mazorodze Road.\n\nThe interchange links three key roads Simon Mazorodze, High Glen, and Chitungwiza and includes the construction of 15 major bridge structures, with some rising as high as 18 meters above ground.\n\nProcesses for the construction of two more interchanges along this road are underway. These will be at the intersection of Simon Mazorodze and Willowvale Roads, as well as Simon Mazorodze and Remembrance Drive.\n\nMnangagwa also said four more interchanges will be built at busy road points across Harare, including Mabvuku Junction, several spots along Harare Drive, and at major traffic circles like Westgate and Kuwadzana.\n\nAdditionally, four interchanges will also be constructed at the Mabvuku Junction; Harare Drive/Mutare Road; Harare Drive/Liberation Legacy Way; Nemakonde Way/Harare Drive; Sam Nujoma/Harare Drive; Westgate Traffic Circle; Kuwadzana Traffic Circle and Churchill/Liberation Way, Mnangagwa said.\n\nHe also added that nine junctions along Harare and Bulawayo Airport Roads will also be upgraded, and smart traffic systems will be used to improve traffic flow and road discipline.\n\nNine junctions shall be updated as part of the J. M. Nkomo Road (RGM International Airport Road) upgrade to grade separation structures.\n\nIn addition, smart traffic management systems are now also in place and will be deployed towards optimising traffic flow through intelligent systems. The roll out of these systems must be publicised and see greater discipline on our roads.Although the long-delayed project is now complete, its high cost reported at US$88 million has sparked public and parliamentary debate, with calls for an audit to clarify how the funds were used, as many accuse the government of massive looting.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31062141/IMG-20250530-WA0047.jpg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa has announced an ambitious expansion of Harare’s road network that includes the construction of new multiple interchanges and deployment of smart traffic systems. Mnangagwa was delivering his remarks at the official opening of the Trabablas Interchange, formerly Mbudzi Roundabout, where he said two additional interchanges will be built along</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-officially-opens-trabablas-roadworks-to-motorists-promises-six-more-interchanges-in-harare/\">Mnangagwa officially opens Trabablas roadworks to motorists, promises six more interchanges in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "SRC suspends Zimbabwe Netball Association president",
            "url": "https://www.newzimbabwe.com/src-suspends-zimbabwe-netball-association-president/",
            "content": "By Sports Reporter\n\nTHE Sports and Recreation Commission (SRC) has suspended the Zimbabwe Netball Association (ZINA) president Lecitica Chipandu.\n\nIn a letter SRC said Chipandus suspension comes after an investigation conducted following several allegations against her.\n\nThe Sports and Recreation Commission (SRC) wishes to advise the public and netball stakeholders that the president of the Zimbabwe Netball Association (ZINA) Mrs Leticia Chipandu has been suspended as an official responsible for the stewardship and strategic direction of the Zimbabwe Netball Association, and from all forms of netball administration in Zimbabwe with immediate effect.\n\nThe suspension is as result of the investigations conducted by the SRC on the challenges prevailing within the Zimbabwe Netball Association administration and structures, reads part of SRC press release.\n\nChipandu reigned as the Zimbabwe netball boss since 2007 and is the associations longest serving leader.\n\nDuring her tenure, Chipandu has faced several allegations, amongst them embezzlement of 2019 Liverpool World Cup funds for the players.\n\nSRC further stated that Chipandus suspension shall stand until ZINA holds its next elections.\n\nThis is in terms of Section 30(1)(c)(i) as read with Section 19(a), (b) and (c) and paragraph 23 of the second schedule of the Sports and Recreation Act (Chapter 25:15) and shall subsist until such a time when the next ZINA elections are held, further read SRC letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31061320/ZINA-president-Leticia-Chipandu.webp",
            "description": "<p>By Sports Reporter THE Sports and Recreation Commission (SRC) has suspended the Zimbabwe Netball Association (ZINA) president Lecitica Chipandu. In a letter SRC said Chipandu’s suspension comes after an investigation conducted following several allegations against her. “The Sports and Recreation Commission (SRC) wishes to advise the public and netball stakeholders that the president of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/src-suspends-zimbabwe-netball-association-president/\">SRC suspends Zimbabwe Netball Association president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "Airforce of Zimbabwe pilot killed as fighter jet crashes",
            "url": "https://www.newzimbabwe.com/airforce-of-zimbabwe-pilot-killed-as-fighter-jet-crashes/",
            "content": "By Staff Reporter\n\nA TRAGIC incident has struck the Zimbabwe Defence Forces (ZDF) family following the crash of an Airforce of Zimbabwe (AFZ) F-7 fighter aircraft in the Wazheri general area, along the Gweru-Mvuma Road.\n\nThe crash resulted in the death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube, a highly respected and experienced pilot.\n\nThe aircraft is said to have been engaged in a routine sortie procedure when the accident occurred.\n\nIn a statement following the accident, ZDF Commander, General Philip Valerio Sibanda, expressed deep sorrow over the loss.\n\nThe Zimbabwe Defence Force have learnt, with heavy hearts, of the passing of a proficient and highly experienced pilot, Squadron Leader Ncube after an aircraft accident. Right now, our thoughts and prayers are with the family of the deceased pilot, said Sibanda.\n\nIn the meantime, investigations are underway to establish the causes of the accident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31060834/Retired-Squadron-Leader-Ritswanetsi-Vuyo-Ncube.jpeg",
            "description": "<p>By Staff Reporter A TRAGIC incident has struck the Zimbabwe Defence Forces (ZDF) family following the crash of an Airforce of Zimbabwe (AFZ) F-7 fighter aircraft in the Wazheri general area, along the Gweru-Mvuma Road. The crash resulted in the death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube, a highly respected and experienced pilot. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/airforce-of-zimbabwe-pilot-killed-as-fighter-jet-crashes/\">Airforce of Zimbabwe pilot killed as fighter jet crashes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "Olorato Mongale: Suspect in South African student’s murder killed in police shootout",
            "url": "https://www.newzimbabwe.com/suspect-in-south-african-students-murder-killed-in-police-shootout/",
            "content": "BBC\n\nA suspect wanted for the murder of a South African university student has been killed in a shootout with the police.\n\nThe man was linked to the death of Olorato Mongale, whose body was found in Johannesburg on Sunday, about two hours after she was reported missing having gone on a date.\n\nIn the early hours of Friday morning, police officers found the main suspect hiding at a residential complex in the coastal town of Amanzimtoti, police spokesperson Athlenda Mathe said.\n\nThe suspect, who has not been named by the police, shot at the officers, who returned fire and killed him, Brigadier Mathe added.\n\nMs Mongales death has sparked a fierce debate about the levels of violence faced by women in South Africa.\n\nIn an impassioned statement, Police Minister Senzo Mchunu called the killing inhumane and gruesome, adding: To all men, this is a plea  simple, urgent, and human: Please, stop killing women.\n\nThe search for two other men linked to Mongales killing continues, while police have arrested the parents of the deceased suspect.\n\nThe suspects mother is accused of enabling him to evade arrest by tipping him off about the polices presence at her house.\n\nThe police also said that the suspects father is the owner of a VW Polo allegedly used in Ms Mongales murder.\n\nEarlier this week, the police named the three suspects linked to the killing as Fezile Ngubane, Philangenkosi Sibongokuhle Makhanya and Bongani Mthimkhulu.\n\nTwo of them  Mr Makhanya and Mr Mthimkhulu  were last month arrested for kidnapping and robbing a woman in KwaZulu-Natal, using the same VW Polo involved in Ms Mongales murder but had been freed on bail, police said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/30111037/3d2900f0-3c6b-11f0-bd09-85867b04fa4e.jpg.webp",
            "description": "<p>BBC A suspect wanted for the murder of a South African university student has been killed in a shootout with the police. The man was linked to the death of Olorato Mongale, whose body was found in Johannesburg on Sunday, about two hours after she was reported missing having gone on a date. In the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/suspect-in-south-african-students-murder-killed-in-police-shootout/\">Olorato Mongale: Suspect in South African student’s murder killed in police shootout</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "Zimbabwe’s farmers push on as land grab compensation flounders",
            "url": "https://www.newzimbabwe.com/zimbabwes-farmers-push-on-as-land-grab-compensation-flounders/",
            "content": "AFP\n\nIn a field of paprika plants in the heart of Zimbabwe, fourth-generation farmer Daniel Burger and relative newcomer Miriam Mupambawashe discuss the quality of the crop.\n\nBurger, 36, and Mupambawashe, 59, are neighbours and partners in efforts to revive the countrys once-flourishing agriculture sector cut down by a ruinous land reform drive in the 2000s.\n\nThe reform distributed land from the white minority, which still owned most of the best farmland 20 years after independence in 1980, to the black majority.\n\nAround 4,000 white-owned farms were confiscated, some with deadly violence.\n\nMupambawashe was among thousands who received land. Though she initially knew little about farming, her small subsistence plot now thrives.\n\nOther farms failed or were abandoned, with some new tenants unschooled in agriculture and others  including politicians who were handed land  uninterested.\n\nThere were food shortages and Zimbabwe soon required international aid.\n\nThere was a bit of a tough period through the 2000s and, unfortunately, I think it sort of refuelled racial tensions to an extent, Burger told AFP.\n\nBut being so passionate about farming was the motivator for me to move forward, he said.\n\nMupambawashe moved to the area from the southern city of Bulawayo, around 200 kilometres (125 miles) away.\n\nWhen we first came here in 2001, it was a forest and there was nothing built, she said.Some of the white farmers were angry but we managed to talk to each other in good faith and move forward.\n\nThey never let us down and said, You grabbed the farm, lets see if you can do it. But instead they brought their own tractors and equipment to come and help, which we felt was a nice gesture.\n\nIt was hard in the beginning, especially after irrigation equipment was stolen, and the early failures were embarrassing, Mupambawashe said.\n\nBut today her plot does so well that she only needs to buy in sugar and cooking oil.\n\nBurger leases land from her and lends tractors and expertise.\n\nHis familys land was among the few hundreds that were not seized in the 2000s.\n\nNonetheless, For a long time we became wound up in compensation, said Burger, vice-president of the Commercial Farmers Union of Zimbabwe (CFU) that represents mostly white farmers.\n\nBut it wasnt our purpose. Our purpose was driving agriculture and current agricultural affairs forward, he said.\n\nThis year, some farm owners whose land was confiscated received the first compensation payments after decades of waiting.\n\nThe process has been complex and divisive.\n\nThe government committed to compensation as part of an effort to settle arrears and reform the economy in order to be able to regain access to international credit lines cut two decades ago.\n\nIt announced in 2020 the creation of a fund that would pay out US$3.5 billion for infrastructure on farms but not the land, which it says was taken by force by colonial settlers.\n\nUnable to raise cash, the government in 2023 changed the offer to one percent in cash and the remainder in US dollar denominated treasury bonds.\n\nIn April, the first payments were made to 378 of 780 farmers approved for this scheme.\n\nDeon Theron, who represents the Compensation Steering Committee group of former white farmers, says the introduction of the bonds has annulled the original deal and negotiations need to start over.\n\nThe bonds are unsecured and there is limited recourse in the event of non-performance by government, he told AFP.\n\nThe general feeling amongst the farmers is firstly frustration that after 20-odd years we still have not received anything, Theron said.\n\nBut the Property and Farm Compensation Associationsaid its members would take what is on offer.\n\nThe bonds are under international guarantee, said leader Harry Orphanides, adding that digging in and seeking more from the government would be futile.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29191457/Screenshot-2025-05-29-at-20.14.21.png",
            "description": "<p>AFP In a field of paprika plants in the heart of Zimbabwe, fourth-generation farmer Daniel Burger and relative newcomer Miriam Mupambawashe discuss the quality of the crop. Burger, 36, and Mupambawashe, 59, are neighbours and partners in efforts to revive the country’s once-flourishing agriculture sector cut down by a ruinous land reform drive in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-farmers-push-on-as-land-grab-compensation-flounders/\">Zimbabwe’s farmers push on as land grab compensation flounders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "Treasury delists defaulting suppliers, bans pre-payment of services due to non-delivery",
            "url": "https://www.newzimbabwe.com/treasury-delists-defaulting-suppliers-bans-pre-payment-of-services-due-to-non-delivery/",
            "content": "By Anna Chibamu\n\nTREASURY says it has delisted suppliers who have failed to deliver goods and services after receiving payments.\n\nFinance Ministry Permanent Secretary George Guvamatanga said no advance payments will be made to suppliers who are contracted by the government.\n\nThe ban comes after the Auditor Generals report revealed that several goods and services paid for through Ministries, departments and agencies (MDAs) by the Treasury were not delivered.\n\nThose who have not delivered goods and services have been banned from transacting with government.\n\nWe have actually banned the advance payment from most of the goods and services that the ministries and departments and agencies do secure from various suppliers.\n\nAs we speak now, what has been delivered, who has been banned, and what remains outstanding, it was a very long list, Guvamatanga told the Public Accounts Parliamentary Committee (PAC) recently.\n\nHe added, We were shocked by what we discovered. But I think following that intervention, there is now a very marked improvement.\n\nAccording to Guvamatanga, some MDA officers were involved in the scandals involving the loss of millions of dollars by the government.\n\nAnd we did emphasise that there will be an action taken against the accounting officers in the event that they continue with this practice following the intervention of closure, added Guvamatanga.\n\nCommittee chairperson Charlton Hwende requested to have the list of those companies that defaulted on delivery.\n\nWe will provide the list. It is available, said Guvamatanga.\n\nRegarding defaulters, Guvamatanga said, Its the same companies, they change directors, they go and change directors, they get another contract, you know, and its the same players.\n\nSo when we present it for the identity of the companies, we then see the same players all over. We are now calling them, bringing them to where you must bring your bank statements. \n\nThose same people become the directors of the new company. They are then given another tender, which they flout. Three, two years later, they change the name of the company, but they remain with the same directors, Guvamatanga said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Anna Chibamu TREASURY says it has delisted suppliers who have failed to deliver goods and services after receiving payments. Finance Ministry Permanent Secretary George Guvamatanga said no advance payments will be made to suppliers who are contracted by the government. The ban comes after the Auditor General’s report revealed that several goods and services</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/treasury-delists-defaulting-suppliers-bans-pre-payment-of-services-due-to-non-delivery/\">Treasury delists defaulting suppliers, bans pre-payment of services due to non-delivery</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        },
        {
            "title": "Students demand government intervention as UZ strike disrupts academics",
            "url": "https://www.newzimbabwe.com/students-demand-government-intervention-as-uz-strike-disrupts-academics/",
            "content": "By Staff Reporter\n\nZIMBABWE National Students Union (ZINASU) has requested an audience with the government over the chaos at the University of Zimbabwe, which has seen lecturers embarking on industrial action for more than 40 days.\n\nUZ is on the edge with this years graduation risking being postponed as lecturers are on strike demanding an increase to their salaries.\n\nLecturers have been picketing at UZ registering their displeasure on the reluctanceby the institutionto increase their wages. They are demanding US$2,500 salaries.\n\nThe strike has consequently suspended examinations with planned sittings also facing a potential icing, further derailing the academic year.\n\nIn a letter addressed to the Ministry of Higher and Tertiary Education, ZINASU Secretary General Devine Nyakudya said the students are bearing the brunt of the continued deadlock between UZ and the striking lecturers.\n\nWe are writing to express our deep concern regarding the ongoing strike by university lecturers at the University of Zimbabwe, which has resulted in significant losses for students.\n\nDespite the university administrations claim that it is business as usual, students have not received academic services for over three weeks, despite paying their tuition fees, read the letter.\n\nUZ and the government have been silent on the ongoing strike, with ZANU PF recently urging that the impasse be resolved.\n\nNyakudya said the government and UZ should urgently address the salary demands of the lecturers.\n\nThe high tuition costs are already a burden for many students, and the lack of academic services exacerbates the situation. We believe that the universitys failure to address the needs of both students and lecturers has led to this impasse.\n\nA demotivated lecturer cannot provide quality education, and it is essential that their concerns are addressed, read the letter further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181203/Zinasu-1.png",
            "description": "<p>By Staff Reporter ZIMBABWE National Students Union (ZINASU) has requested an audience with the government over the chaos at the University of Zimbabwe, which has seen lecturers embarking on industrial action for more than 40 days. UZ is on the edge with this year’s graduation risking being postponed as lecturers are on strike demanding an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/students-demand-government-intervention-as-uz-strike-disrupts-academics/\">Students demand government intervention as UZ strike disrupts academics </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "31 May 2025"
        }
    ]
}