{
    "news": [
        {
            "title": "Sables coach predicts competitive Rugby Africa Cup, as Zimbabwe eyes title defense",
            "url": "https://www.newzimbabwe.com/sables-coach-predicts-competitive-rugby-africa-cup-as-zimbabwe-eyes-title-defense/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade believesthat this years Rugby Africa Cup will be more challenging as his side defends itstitle.\n\nThe Rugby Africa Cup kickedoffTuesday at Nelson Mandela Stadium in Ugandawithdefending champions Zimbabweopeningits campaign against North African side Morocco.\n\nAlthough Benade boasts of continuity as he has managed to retain the bulk of players who won last years Rugby Africa Cup edition, the Sables gaffer is not undermining his competitors efforts.\n\nMany teams have invested in players and new staff so there is definitely going to be an increased level of competitiveness in this edition with the prize being the World Cup qualification, said Benade.\n\nThis years Rugby Africa Cup comes with an automatic ticket to the 2027 Rugby World Cup, and Benade has all that in mind.\n\nThe target is to take it game by game and hopefully we do enough to really challenge each opponent.\n\nWhile the vision is there for qualification to the global showpiece, we need to take a number of steps and overcome tough opponents to get there, he added.\n\nZimbabwe last qualified for the Rugby World Cup in 1991, and hopes are high that the current crop of players can break the jinx.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/29051559/Sables-7.png",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s rugby team coach Piet Benade believes that this year’s Rugby Africa Cup will be more challenging as his side defends its title. The Rugby Africa Cup kicked off Tuesday at Nelson Mandela Stadium in Uganda with defending champions Zimbabwe opening its campaign against North African side Morocco. Although Benade boasts of continuity as he has managed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-coach-predicts-competitive-rugby-africa-cup-as-zimbabwe-eyes-title-defense/\">Sables coach predicts competitive Rugby Africa Cup, as Zimbabwe eyes title defense</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "08 Jul 2025"
        },
        {
            "title": "UK: Zimbabwean Embassy ensuring justice is pursued after murder of Dr Fortune Gomo in Dundee",
            "url": "https://www.newzimbabwe.com/uk-zimbabwean-embassy-ensuring-justice-is-pursued-after-murder-of-dr-fortune-gomo-in-dundee/",
            "content": "By Darlington Gatsi\n\nIN the aftermath of the tragic murder of Zimbabwean national Dr. Fortune Faith Gomo in Scotland, the Zimbabwean Embassy in the United Kingdom has pledged to assist the bereaved family, adding that it will ensure justice is served.\n\nDr. Gomo was fatally stabbed in Dundee on Saturday, 5 July 2025, in full view of her 10-year-old child, and was pronounced dead at the scene.\n\nA 20-year-old man, Kyler Rattray, has since been arrested in connection with the murder.\n\nThe Embassy confirmed the tragic death of Dr. Gomo, who was a respected scientist at the University of Dundee and an employee of Scottish Water.\n\nThe Embassy confirmed the tragic passing of Gomo who was a scientist at the University of Dundee.\n\nThe Embassy of the Republic of Zimbabwe in the United Kingdom is deeply saddened to confirm the untimely passing of Dr. Fortune Faith Gomo, a Zimbabwean national who was fatally stabbed in Dundee, Scotland, on 5 July 2025.\n\nDr. Gomo, a respected Hydro Nation PhD scholar at the University of Dundee and employee of Scottish Water, was attacked while walking with her 10-year-old daughter. Emergency services responded to the scene, but despite their best efforts, Dr. Gomo sadly succumbed to her injuries. The local authorities have confirmed the arrest of a 20-year-old male suspect, who remains in custody.\n\nDr. Gomo was a dedicated scholar, a beloved mother, and a rising expert in her field. Her death is a devastating loss to her family, the Zimbabwean community in the diaspora, and the broader academic and professional community in Scotland, read the statement.\n\nDr. Gomo had recently begun working at Scottish Water as a senior service planner.\n\nThe Embassy has dispatched Officials to Dundee to: Engage with Scottish authorities on the ongoing investigation; Provide support and assistance to the minor child and immediate family; Liaise with the next of kin on burial arrangements; Ensure that Zimbabwean citizens are treated with dignity and that justice is pursued diligently.\n\nThe Embassy is also in contact with media representatives and will be providing verified updates in due course, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/06095328/1751787728513.jpg",
            "description": "<p>By Darlington Gatsi IN the aftermath of the tragic murder of Zimbabwean national Dr. Fortune Faith Gomo in Scotland, the Zimbabwean Embassy in the United Kingdom has pledged to assist the bereaved family, adding that it will ensure justice is served. Dr. Gomo was fatally stabbed in Dundee on Saturday, 5 July 2025, in full</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-zimbabwean-embassy-ensuring-justice-is-pursued-after-murder-of-dr-fortune-gomo-in-dundee/\">UK: Zimbabwean Embassy ensuring justice is pursued after murder of Dr Fortune Gomo in Dundee</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "08 Jul 2025"
        },
        {
            "title": "LONDON: Diaspora Insurance CEO wins UK Africa business award",
            "url": "https://www.newzimbabwe.com/london-diaspora-insurance-ceo-wins-uk-africa-business-award/",
            "content": "By Gilbert Nyambabvu\n\nDIASPORA InsuranceCEO, Jeff Madzingo, was last week recognised and honoured as one of the leading African entrepreneurs and business leaders in the United Kingdom.\n\nMadzingo won the Financial Services Excellence Award at a glittering gala dinner in London hosted by theAfrican Business Chamberand attended by diplomats, entrepreneurs and business executives.\n\nIn his keynote address, Rwandas High Commissioner to the United Kingdom, H.E. Johnston Busingye,\n\nRwandas High Commissioner to the United Kingdom, H.E. Johnston Busingye\n\nchallenged Africans to commit ourselves to making a difference.\n\nThe Africa we want is within reach, but getting there requires governments that match policy with implementation, businesses that take bold steps, and partners who are willing to build lasting and productive relationships.\n\nMeanwhile, founded 14 years ago,Diaspora Insurancehas enjoyed phenomenal growth, developing into a multi-million-dollar business from its global headquarters in Birmingham.\n\nFrom covering just two countries when it was founded, the company now covers 20 African nationalities not just in the UK and Europe but right across the world.\n\nWhen we started, we did say we can only call ourselves a civilised people when we are able to create common solutions for our common good, said Madzingo.\n\nWe were coming from a background where every time there is a bereavement, it comes with a begging bowl, and we needed to arrest that challenge.\n\nDiaspora Insurancechanged the traditional services-based approach to funeral insurance, introducing products more suited to the unique needs of African diasporas.\n\nThe companysfuneral cash planprovides immediate cash intervention to ensure families are not subjected to the double trauma and indignity of grieving and begging at the same time.\n\nMadzingo also shared insights on challenges which face African entrepreneurs in the UK, including poor access to capital, lack of professional support and limited networks, limited experience in top executive roles.\n\nOther drawbacks include a consumer rather than producer mindset that we come with as African entrepreneurs, said Madzingo, adding that we also tend to focus on businesses that are very difficult to scale up.\n\nAwards host, theAfrican Business Chamber (AfBC), is a global organisation dedicated to representing and supporting African businesses, investors, and entrepreneurs as they grow and thrive in the global economy.\n\nChamber CEO Eugene Nizeyimana said the organisation was eight years ago to enhance our representation in the UK economy, enhance our voice, and establish businesses that create jobs and wealth.\n\nSecondly, we want to drive investment between the UK and Africa, make sure that all of us, as we live in the UK we also contribute back, engage back and invest back in Africa.\n\nTop 100 Business Leader of the Year:Said ADREN\n\nBusiness Excellence Award:Edward Obi Chartered FCIPD, MIRP, TechIOSH\n\nEntrepreneur of the Year:Cody Gapare (CMgr MCMI MBA)\n\nStartup and New Business of the Year Award:Michaelle Kubwimana\n\nTechnology and Innovation Excellence Award:Olusola (Sola) Idowu\n\nHealthcare Excellence Award:Professor Rotimi Jaiyesimi\n\nCreative Industry Excellence Award:Juliana Olayinka\n\nFinancial Services Excellence Award:Jeff Madzingo\n\nProfessional Services Excellence Award:Leslie Owusu\n\nWomen in Business (WIB) Excellence Award:Fungai Ndemera\n\nInternational Trade Excellence Award:Veronica Bolton Smith\n\nSocial Enterprise Excellence Award:Leah Chikamba-Mulando\n\nDiaspora Excellence Award:Jabo Butera\n\nBusiness of the Year Award:Bank Of Africa UK\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08071952/Jeff-Madzingo.png",
            "description": "<p>By Gilbert Nyambabvu DIASPORA Insurance CEO, Jeff Madzingo, was last week recognised and honoured as one of the leading African entrepreneurs and business leaders in the United Kingdom. Madzingo won the Financial Services Excellence Award at a glittering gala dinner in London hosted by the African Business Chamber and attended by diplomats, entrepreneurs and business</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/london-diaspora-insurance-ceo-wins-uk-africa-business-award/\">LONDON: Diaspora Insurance CEO wins UK Africa business award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "08 Jul 2025"
        }
    ]
}