{
    "news": [
        {
            "title": "POSB introduces instant payday loan to boost financial inclusion",
            "url": "https://www.newzimbabwe.com/posb-introduces-instant-payday-loan-to-boost-financial-inclusion/",
            "content": "The Peoples Own Savings Bank (POSB) has announced the launch of its newest financialproduct thePOSB Payday Loan a fast, flexible, and fully automated loan facility designed to give customers the freedom to manage their finances with ease and confidence.\n\nWith the POSB Payday Loan, customers no longer need to wait for payday to take care of lifes important moments. Whether its buying electricity tokens, paying rent, covering school expenses, or simply making sure theres enough for groceries and transport, this new facility ensures that help is always just a few taps away.\n\nThe Payday loan is accessibleinstantlythrough any mobile phone by dialing *223# (Econet users) or *222# (NetOne andTelecelsubscribers), the loan is available instantly, without the need for paperwork, a guarantor, or employer involvement.\n\nThis innovative product is a strategic addition to POSBs growing loan portfolio, offering unmatched convenience and discretion. Customers can apply anytime, from anywhere, and use the funds however they choose  whether its swiping at the till, transferring to a mobile wallet, sending money to a loved one, or withdrawing cash. The process is simple, secure, and designed to fit seamlessly into everyday life.\n\nAt POSB, we are committed to delivering inclusive financial solutions that meet the real needs of Zimbabweans,saidMr. Garainashe Changunda, Chief Executive Officer of POSB.\n\nThe Paydayloan is a reflection of our promise to empower our customers with tools that offer speed, dignity, and control over their financial lives,no matter where they are or what device they use.\n\nThe POSB Paydayloan is more than just a financial product  its a promise of support. Its for the parent who wants to make sure their child never misses a school trip. Its for the professional who wants to avoid awkward moments at the checkout counter. Its for the entrepreneur who needs to keep business moving while waiting for client payments. And its for anyone who values privacy, speed, and reliability in their financial services,.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19194030/WhatsApp-Image-2025-06-18-at-18.08.38.jpeg",
            "description": "<p>The People’s Own Savings Bank (POSB) has announced the launch of its newest financial product — the POSB Payday Loan — a fast, flexible, and fully automated loan facility designed to give customers the freedom to manage their finances with ease and confidence. With the POSB Payday Loan, customers no longer need to wait for payday to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/posb-introduces-instant-payday-loan-to-boost-financial-inclusion/\">POSB introduces instant payday loan to boost financial inclusion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak",
            "url": "https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/",
            "content": "By Staff Reporter\n\nThe government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan.\n\nThis Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna Resort in Harare, marking the start of a process to craft the countrys five-year economic blueprint 2026-2030.\n\nThe indaba drew participants from industry and commerce, farmers organisations, the clergy, civil society and academia.\n\nSpeaking on the sidelines of the event, Minister of Finance, Economic Development and Investment Promotion, Mthuli Ncube, said a draft of NDS 2 should be ready by October.\n\nThe NDS 2 will be a successor to NDS 1. We have appointed consultants to do an evaluation of NDS 1 and their observations will serve as the base for NDS 2, which will be crafted following wide consultations, at the provincial and district levels. We should have a draft ready by October, said Ncube.\n\nAlthough Ncube emphasised that as NDS 1 approaches its end in December 2025, Zimbabwe remains solidly on track to attain an upper-middle-income society status, poverty and unemployment remain widespread among the general populace. The nation is reeling from a liquidity crunch amid a faltering Zimbabwe Gold (ZiG) currency.\n\nNcube said NDS 2 will serve as the crucial five-year plan to leapfrog the country towards the ambitious Vision 2030, by which Zimbabwe will attain upper-middle-class society status.\n\nNcube said chairpersons of 10 national priorities that will underpin the strategy were hitting the ground running to contribute to the national document.\n\nThe final document is expected to be tabled by November 2025, ahead of the National Budget presentation. Thereafter, it will be officially launched by the President.\n\nFollowing NDS 2s launch, Ncube said there will be public awareness campaigns by amplifiers to extensively disseminate its contents so that there is buy-in for the important national blueprint.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Staff Reporter The government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan. This Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/\">Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "19 Jun 2025"
        }
    ]
}