{
    "news": [
        {
            "title": "Pressure mounts to probe Kenya police and army after BBC exposé",
            "url": "https://www.newzimbabwe.com/pressure-mounts-to-probe-kenya-police-and-army-after-bbc-expose/",
            "content": "BBC\n\nLeading human rights organisations have renewed calls for investigations into the killing of protesters by Kenyas security forces during demonstrations against a rise in taxes last June.\n\nIt follows a BBC Africa Eye investigation, exposing members of the security forces who shot dead three protesters at Kenyas parliament, igniting public outrage and demands for justice.\n\nAmnesty International and the Kenya Human Rights Commission (KHRC) said the officers identified in the documentary should face the law.\n\nKenyas government spokesman has responded by saying every life is important, the police watchdog is conducting an investigation and criticised the BBC documentary for being one-sided.\n\nThose who did the documentary should have sought government opinion so that they can be fair and balanced, Isaac Mwaura said.\n\nFor example, they show the parliament being burnt, but they dont show who is doing it; they seem to minimise the vandalisation that happened in parliament.\n\nHe admitted the protesters had legitimate concerns about the finance bill but said: We cannot have a country that also is led through anarchy and mayhem.\n\nThe BBC had asked the government to take part in the documentary.\n\nIt was briefly discussed in Kenyas parliament on Tuesday when MP John Kiarie accused the BBC of pushing a foreign agenda, while another MP, Millie Odhiambo, said the government and parliament should deal with the aftermath of the protests soberly, without gagging the media.\n\nThe BBC documentary has created more anger among young people You cant stop the media, Odhiambo said.\n\nIn response to the documentary before it was aired, the police service said the force could not investigate itself, adding that Kenyas Independent Policing Oversight Authority (IPOA) was responsible for investigating alleged misconduct.\n\nThe Kenyan Defence Forces (KDF) told the BBC the IPOA had not forwarded any request to look into any of its personnel involved in the operations at parliament.\n\nBBC Africa EyesBlood Parliament documentaryrevealed how security forces brutally responded to youthful protesters who breached Kenyas parliament on 25 June 2024, the day lawmakers voted to approve the proposed tax hikes.\n\nThe controversial finance billwas aimed at raising $2.7bn (2bn) the government said it needed to cut its reliance on external borrowing  but had sparked widespread.\n\nUsing open-source data and user-generated content, the BBCs analysis of more than 5,000 images identified uniformed security personnel  a policeman and solider  who opened fire killing three unarmed protesters at parliament.\n\nThe wider clampdown by the security forces on a series of protests against the finance bill left at least 65 people dead, resulted in the forcible disappearance of 89 others and the arrest of thousands,according to Amnesty International.\n\nThe Kenyan government put the death toll at 42.\n\nOn Monday, the BBC said it had cancelled a private screening of the documentary in Kenyas capital Nairobi due to pressure from the authorities.\n\nWe are very disappointed not to have been able to share the documentary and panel discussion as planned, a BBC spokesperson said.\n\nIn the meantime, audiences can watch the film on BBC Africas YouTube channel, the spokesperson added.\n\nAmnesty said the documentary corroborated the groups earlier report that unnecessary and excessive lethal force was used against protesters.\n\nIt called on the police and the army to publicly state the actions being taken with regard to the findings of the BBC expos.\n\nThe rights group urged Kenyans to sign a petition calling for a public inquiry into the killings during what were dubbed the #OccupyParliament protests.\n\nThe KHRC said the BBC documentary revealed how organised criminals in police and military uniforms were deployed to murder innocent Kenyans.\n\nIt said the responsibility rests with [President William] Ruto, who must be held accountable for these deaths.\n\nKenyans expressed their anger online, pressing the government to hold security officers accountable for the killings and injuries of peaceful protesters.\n\nRuto has previously defended police against accusations of brutality and recently warned Kenyans against commenting on military matters.\n\nPolice have also repeatedly denied involvement in the abductions and killings. No officers have been charged.\n\nOn Monday, following the release of the BBC Africa Eye documentary, the IPOA gave an update on the investigations.\n\nThe authority revealed that so far, of the 60 deaths under investigation, 41 involved gunshot wounds.\n\nThe IPOA said it had completed 22 investigations, while it was actively pursuing 36, and that two cases were currently before the courts.\n\nThe investigating agency said it had recorded 233 injury cases during the demonstrations.\n\nIn a statement, the main opposition coalition said the execution of peaceful protesters was premeditated and sanctioned at the highest levels.\n\nMr Mwaura said the documentary risked inciting Kenyans to violence while one legislator called for the BBC to be banned in Kenya.\n\nGeorge Peter Kaluma, said that the 37-minute-long documentary risked destabilising the country.\n\nBut a senator, Edwin Sifuna, defended the documentary saying there were no fabrications in it.\n\nWe must encourage these stories to be told from all angles for the sake of truth and justice. Those who are uncomfortable with this are wrestling with their own consciences and we cannot help them with that, Sifuna posted on X.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29173036/kenya-protests.webp",
            "description": "<p>BBC Leading human rights organisations have renewed calls for investigations into the killing of protesters by Kenya’s security forces during demonstrations against a rise in taxes last June. It follows a BBC Africa Eye investigation, exposing members of the security forces who shot dead three protesters at Kenya’s parliament, igniting public outrage and demands for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pressure-mounts-to-probe-kenya-police-and-army-after-bbc-expose/\">Pressure mounts to probe Kenya police and army after BBC exposé</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Turnall pins growth hopes on stable exchange rates",
            "url": "https://www.newzimbabwe.com/turnall-pins-growth-hopes-on-stable-exchange-rates/",
            "content": "By Alois Vinga\n\nTURNALL Holding has pinned hopes on obtaining stable exchange rates as well as the anticipated economic rebound on the back of a good agricultural season as firm springboards to presenting lucrative growth opportunities.\n\nPresenting the groups financial performance for the year ended December 31 2024, Turnall board chairperson, Grenville Hampshire, said current economic indications are quite positive.\n\nHe said there has been a steady increase in diaspora remittance inflows in the current year, which have had a positive impact on the economy.\n\nThere is hope for some recovery in 2025 due to the ongoing capital projects in the manufacturing and construction sectors, coupled with an expected rebound in the agricultural sector on the back of the La Nina weather phenomenon. This recovery is expected to have downstream benefits for the other sectors in the economy. In addition, a stable exchange rate, low inflation, as well as favourable international commodity prices for key minerals are expected to provide a conducive environment for doing business, he said.\n\nThe Groups turnover for the year was US$231.6 million, which is 11% below the previous year. Despite slightly improved demand in the second half, Turnall experienced unavailability of foreign currency for the importation of raw materials, high power outages and fuel shortages.\n\nTurnall intends to implement technical cooperation initiatives aimed at improving product quality and productivity. Export turnover improved to $10.5 million, contributing 5% of turnover from 1.2% in the previous year. This was attributed to the Groups export strategy that resulted in enhanced presence in the regional markets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/12054330/Turnall-Holdings.jpg",
            "description": "<p>By Alois Vinga TURNALL Holding has pinned hopes on obtaining stable exchange rates as well as the anticipated economic rebound on the back of a good agricultural season as firm springboards to presenting lucrative growth opportunities. Presenting the group’s financial performance for the year ended December 31 2024, Turnall board chairperson, Grenville Hampshire, said current</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/turnall-pins-growth-hopes-on-stable-exchange-rates/\">Turnall pins growth hopes on stable exchange rates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Abu Dhabi launches $500m maternal health fund for Africa; Zimbabwe among beneficiaries",
            "url": "https://www.newzimbabwe.com/abu-dhabi-launches-500m-maternal-health-fund-for-africa-zimbabwe-among-beneficiaries/",
            "content": "AFP\n\nA $500-million fund aimed at improving maternal and neonatal health in sub-Saharan Africa was launched Tuesday in Abu Dhabi at a time when Western countries are sharply cutting aid to Africa.\n\nThe Beginnings Fund brings together philanthropists including the Gates Foundation and the Mohamed bin Zayed Foundation for Humanity, run by the United Arab Emirates (UAE) president.\n\nIt set a deadline of 2030 to reach the $500-million target and has already reached $450 million in pledges, organisers said in a statement.\n\nThe fund seeks to prevent more than 300 000 deaths and improve access to quality care for 34 million mothers and babies by that date.\n\nAn aid freeze ordered earlier this year by US President Donald Trump has slashed budgets for many humanitarian programmes.\n\nIts a very critical time, said Tala Al Ramahi, spokeswoman for the Mohamed bin Zayed Foundation for Humanity.\n\nThe UAE has been accused of complicity in genocide by Sudan through its support for the paramilitary Rapid Support Forces and of violating a UN arms embargo to supply weapons to Libyas eastern military strongman Khalifa Haftar.\n\nIt denies any military involvement in the conflicts despite evidence presented by the United Nations and many other agencies.\n\nOver the next five years, the Beginnings Fund aims to partner with 10 countries: Ethiopia, Ghana, Kenya, Malawi, Lesotho, Nigeria, Rwanda, Tanzania, Uganda and Zimbabwe.\n\nMost deaths in sub-Saharan Africa occur within the first month of life, and the region accounts for 70 percent of global maternal deaths, the statement said.\n\nIt said 182 000 women and 1.2 million newborns die each year from preventable causes, along with 950 000 stillbirths.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/14204714/Pregnant.jpg",
            "description": "<p>AFP A $500-million fund aimed at improving maternal and neonatal health in sub-Saharan Africa was launched Tuesday in Abu Dhabi at a time when Western countries are sharply cutting aid to Africa. The Beginnings Fund brings together philanthropists including the Gates Foundation and the Mohamed bin Zayed Foundation for Humanity, run by the United Arab</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/abu-dhabi-launches-500m-maternal-health-fund-for-africa-zimbabwe-among-beneficiaries/\">Abu Dhabi launches $500m maternal health fund for Africa; Zimbabwe among beneficiaries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "WATCH: Fans protest against ZRU board over ill-treatment of Lady Sables",
            "url": "https://www.newzimbabwe.com/watch-fans-protest-against-zru-board-over-ill-treatment-of-lady-sables/",
            "content": "By Sports Reporter\n\nAngry rugby fans on Tuesday afternoon picketed against the Zimbabwe Rugby Union (ZRU) board, which is facing allegations of ill-treatment of female players and was appearing before the Sports and Recreation Commission (SRC).\n\nThe board was summonedto a hearingby the SRC followingbacklash over the welfare ofLady Sables players who recently represented the country in Ivory Coast at the Rugby Africa Women Division Cup.\n\nZRU reportedly gave the players a US$150 allowance after a week of national duty and ordered them to return all tracksuits and kits used during the tournament.\n\nIn a viral leaked audio, ZRU president Losson Mtongwiza threatens players with a life ban if they dare complain publicly.\n\nThis board should go, they dont respect women, what they did to the girls was unfair, and it has to stop, said one of the protesters.\n\nAnother protester told New Zimbabwe.com that Mtongwiza isthe problem in the ZRU executive.\n\nPresident Losson Mtongwiza is the problem; the greatest mistake was to vote him into power.\n\nRemember, he served as a vice president in the previous administration, which was led by the late Aaron Jani and faced corruption allegations, she said.\n\nThe underfire ZRU boss had to hide in the SRC offices to avoid facing the angry mob.\n\nThe SRC is expected to sharethe outcome of the ZRU hearing this week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/26074443/Losson-Pic2-1-696x1149-1-e1724150059820.jpg",
            "description": "<p>By Sports Reporter Angry rugby fans on Tuesday afternoon picketed against the Zimbabwe Rugby Union (ZRU) board, which is facing allegations of ill-treatment of female players and was appearing before the Sports and Recreation Commission (SRC). The board was summoned to a hearing by the SRC following backlash over the welfare of Lady Sables players who recently represented the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-fans-protest-against-zru-board-over-ill-treatment-of-lady-sables/\">WATCH: Fans protest against ZRU board over ill-treatment of Lady Sables</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "We are not weaklings, we are not cowards – rural teachers say, as requests for salary hikes are ignored",
            "url": "https://www.newzimbabwe.com/we-are-not-weaklings-we-are-not-cowards-rural-teachers-say-as-requests-for-salary-hikes-are-ignored/",
            "content": "By Leopold Munhende\n\nAMALGAMATED Rural Teachers Association of Zimbabwe (ARTUZ) secretary general Robson Chere has bemoaned governments decision to ignore their plight, and warned that their silence should not be taken for weakness or cowardice.\n\nTeachers, represented by ARTUZ and various other unions, are demanding a US$1,260 monthly salary, up from not more than US$350 they currently earn.\n\nThe US$350 is paid in ZiG, Zimbabwes latest of the many failed currencies it has introduced since the early 2000s.\n\nGovernment has been evasive and seems not interested in dialoguing with teachers over the matter, according to their unions.\n\nEfforts to sit and resolve the wage crisis have constantly hit a snag. Reports indicate that Ministry of Primary and Secondary Education officials, including the Minister Torerai Moyo, have avoided meetings with teachers associations.\n\nWithout us is definitely against us. We have been patient with the employer thus far, we have reached out, negotiated and been treated in bad faith, said Chere, at the annual congress held in Jotsholo, Matabeleland North.\n\nWe have received contempt and abuse in response, arrests, suspensions, and illegal disciplinary hearings. We are not weaklings, we are not cowards, we are not secondary citizens, we are patriotic professionals.\n\nCalls for protests, stay-aways and go-slows have dominated schools opening days each term since government slashed salaries for teachers.\n\nThese calls have often been labelled anti-establishment, sponsored and unpatriotic.\n\nAdded Chere: There is no one with monopoly over patriotism in this country, if we were not patriotic, we would not have been here.\n\nWe choose not to go to greener pastures to actually sacrifice and serve our country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29121055/chere-rob.png",
            "description": "<p>By Leopold Munhende AMALGAMATED Rural Teachers Association of Zimbabwe (ARTUZ) secretary general Robson Chere has bemoaned government’s decision to ignore their plight, and warned that their silence should not be taken for weakness or cowardice. Teachers, represented by ARTUZ and various other unions, are demanding a US$1,260 monthly salary, up from not more than US$350</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-not-weaklings-we-are-not-cowards-rural-teachers-say-as-requests-for-salary-hikes-are-ignored/\">We are not weaklings, we are not cowards – rural teachers say, as requests for salary hikes are ignored</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Underfire Minister Garwe drags Mnangagwa into messy, illegal takeover of Arlington Estate",
            "url": "https://www.newzimbabwe.com/underfire-minister-garwe-drags-mnangagwa-into-messy-illegal-takeover-of-arlington-estate/",
            "content": "By Leopold Munhende\n\nBARELY a month after President Emmerson Mnangagwa was made to hand over some 480 hectares of the remainder of Arlington Estate to PPC Zimbabwe, documents have revealed it has belonged to a housing cooperative since 2006.\n\nThe Nyikavanhu Housing Cooperative now alleges that Local Government Minister Daniel Garwe, who invited Mnangagwa to hand over the land, fraudulently altered documents to PPC Zimbabwes benefit.\n\nAccording to High Court summons gleaned by NewZimbabwe.com and supporting documents from Nyikavanhu Housing Cooperative, the government offered them 530.25 hectares of Subdivision E of Arlington in 2006 for the construction of houses.\n\nAlthough the layout plan is still to be signed by the Local Government Ministry, the offer is still in existence.\n\nOne of the beneficiaries of this illegal process is PPC Zimbabwe. It is illegal because Nyikavanhu Housing Cooperatives offer letter for the same land was never withdrawn, read the summons.\n\nAccording to the court documents, PPC Zimbabwe presented an offer letter dated February 9, 2024, after being indicted to ensure it removed billboards that had been erected along the property boundary, purporting they owned it.\n\nA Deed of Transfer (No: 6168/2024) from the Sheriff of the High Court, dated March this year, was later presented by PPC Zimbabwe during proceedings.\n\nBecause PPC Zimbabwe kept on manufacturing documents during the court application, it changed the complexion of the matter. Nyikavanhu Housing Cooperative abandoned the application and will apply for the quashing of proceedings as they had become meaningless.\n\nIt is clear that this was a calculated and well-coordinated plan to take over land which had already been allocated to the Nyikavanhu Housing Cooperative.\n\nThe last holder of the title, which was cancelled when the land was gazetted for compulsory acquisition, was Portland. It was earmarked for the expansion of the Robert Gabriel Mugabe International Airport, with an extra runway having been set for construction.\n\nBecause the land had been earmarked for airport expansion, the government had given the Civil Aviation Authority of Zimbabwe (CAAZ) power to weigh in such cases.\n\nNyikavanhu Housing Cooperative has in its possession a 2011 letter from CAAZ authorising its application to subdivide the remainder of Arlington Estate into residential stands.\n\nPlease be advised that CAAZ cleared your application and the development should be carried out according to the requirements listed by the Harare City Council Combination Master Plan, reads the letter dated October 26, 2011 and signed by a P.T Dohwe.\n\nAnother letter of support from the Local Government Ministry, dated November 30, 2010, indicates that Nyikavanhu Housing Cooperative owns the land in question and acknowledges it.\n\nThis letter serves to confirm that Nyikavanhu Housing Cooperative is known and recognised by the office of the Governor and Resident Minister and that it is based at Arlington Estate Subdivision E, reads the letter signed by then Acting District Administrator Godfrey Maeresa.\n\nSimilar letters, shown to NewZimbabwe.com, have raised a stink and added weight to Nyikavanhu Housing Cooperatives allegations that Garwe might have illegally parcelled out the land to PPC Zimbabwe, dragging Mnangagwa into the messy affair.\n\nAfter Mnangagwas presentation of the land, it was lauded as his sign of commitment to promoting industrialisation, supporting the private sector and attainment of Vision 2030 that seeks to have transformed Zimbabwe into an Upper-Middle Income economy by then.\n\nMnangagwa was presented with 60 tonnes of cement by PPC Zimbabwe at the handover.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Leopold Munhende BARELY a month after President Emmerson Mnangagwa was made to hand over some 480 hectares of the remainder of Arlington Estate to PPC Zimbabwe, documents have revealed it has belonged to a housing cooperative since 2006. The Nyikavanhu Housing Cooperative now alleges that Local Government Minister Daniel Garwe, who invited Mnangagwa to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/underfire-minister-garwe-drags-mnangagwa-into-messy-illegal-takeover-of-arlington-estate/\">Underfire Minister Garwe drags Mnangagwa into messy, illegal takeover of Arlington Estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Bed bugs appear resistant to insecticides, as fears are raised outbreak will spread to other areas",
            "url": "https://www.newzimbabwe.com/bed-bugs-appear-resistant-to-insecticides-as-fears-are-raised-outbreak-will-spread-to-other-areas/",
            "content": "By Anna Chibamu\n\nHARARE City Council is battling to get rid of bed bugs (tsikidzi) in Mbare high-density suburb following an outbreak which was reported this month.\n\nFumigation of the bed bugs has proved difficultas the parasitic insects appear to have developed a resistance to the chemicals used, the City of Harare health officialshave noted.\n\nIn an interview with NewZimbabwe.com, Monday, Harare City Epidemiologist and Disease Control Officer, Michael Vhere, said getting rid of the bed bugs is difficult because the initial chemical used to control the bug did not work.\n\nThe insecticide we used to control the bed bugs faced some resistance, and we immediately switched to another one.\n\nResults on the new drug effectiveness are expected today (Tuesday), said Vhere.\n\nVhere added that the other challenge the council was facing was residents failure to cooperate with the Harare City health officials.\n\nWe have now reached 64% in terms of our spraying target, but we should have completed fumigation of the 5700 housing units if people had cooperated.\n\nThe main challenge is that people are not taking heed of our call to avail themselves when we fumigate homes.\n\nMost of the residents are not available, and they lock their doors, leaving no one attending our spraying teams in the suburb.\n\nInvestigations are underway to rule out any possible disease caused by the bed bug bites.\n\nHe added that investigations done so far show that the bed bug outbreak might have been caused by the sale of second-hand clothes from abroad, exacerbated by poor hygiene.\n\nCouncil will be fumigating public transport vehicles such as kombis and buses starting next week to stop the bugs from spreading to other areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07180257/mbare-8.jpeg",
            "description": "<p>By Anna Chibamu HARARE City Council is battling to get rid of bed bugs (tsikidzi) in Mbare high-density suburb following an outbreak which was reported this month. Fumigation of the bed bugs has proved difficult as the parasitic insects appear to have developed a resistance to the chemicals used, the City of Harare health officials have noted.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bed-bugs-appear-resistant-to-insecticides-as-fears-are-raised-outbreak-will-spread-to-other-areas/\">Bed bugs appear resistant to insecticides, as fears are raised outbreak will spread to other areas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Govt under pressure as hospitals turn into death traps",
            "url": "https://www.newzimbabwe.com/govt-under-pressure-as-hospitals-turn-into-death-traps/",
            "content": "By Staff Reporter\n\nPRESSURE is mounting on President Emmerson Mnangagwas government to address the deteriorating public health care system, which has become a death trap for many seeking medical attention.\n\nConcerns are being raised over the state of the countrys public health care system, which is characterised by a lack of basic medical supplies and demotivated workers.\n\nThis has forced general citizens to purchase medicines and equipment such as gloves before being attended to by doctors.\n\nOpposition politician Linda Masarira has initiated a petition to the government to address the dire straits that the public hospitals are in.\n\nWe, the citizens of Zimbabwe, urgently call upon His Excellency, President Emmerson Dambudzo Mnangagwa to use his presidential powers to fix Zimbabwes collapsing healthcare system.\n\nMillions of Zimbabweans are suffering and dying because of unaffordable healthcare, chronic shortages of medicines, unethical conduct by health workers, and deteriorating public hospitals. Over 90% of citizens survive through the informal sector and cannot afford private health insurance, reads the petition.\n\nThe lack of medicines and medical provision has left patients in limbo, with the majority failing to afford private hospitals due to the high costs.\n\nActress Tinopona Katsande recently vented frustration on social media, labelling the health system a genocide.\n\nListen, somethings got to give!! I dare say its like some kind of genocide zvirikuitika muma government hospitals edu. Our family members, colleagues and even foes are dying without a second blink, said Katsande.\n\nIn 2017, when President Mnangagwa replaced then-longtime ruler Robert Mugabe, he promised to revamp the health sector, but it still has deteriorated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on.jpg",
            "description": "<p>By Staff Reporter PRESSURE is mounting on President Emmerson Mnangagwa’s government to address the deteriorating public health care system, which has become a death trap for many seeking medical attention. Concerns are being raised over the state of the country’s public health care system, which is characterised by a lack of basic medical supplies and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-under-pressure-as-hospitals-turn-into-death-traps/\">Govt under pressure as hospitals turn into death traps </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Ndebele King’s visit to Coltart shocks, angers government – Bulawayo ordered not to recognise him",
            "url": "https://www.newzimbabwe.com/ndebele-kings-visit-to-coltart-shocks-angers-government-bulawayo-ordered-not-to-recognise-him/",
            "content": "By Leopold Munhende\n\nA MEETING between Ndebele King Bulelani Khumalo, a descendent of late King Lobengula, and Bulawayo Mayor David Coltart hasangered government, with the Local Government ministry describing it as unlawful and wrong.\n\nA letter to Coltart on the matter questioned why he had invited him and described King Bulelani as a charlatan, and criminal.\n\nColtart shared images of their April 21 meeting and described it as productive.\n\nIt was my great honour today to hostInkosiuBulelani Lobengula Khumalo for a courtesy meeting at City Hall, said Coltart on X alongside images of Bulelani and his entourage.\n\nIn a highly productive and fruitful meeting we discussed how our city can honour the proud history of King Mzilikazi and his descendants through recognition of important historical days and the development of culturally and historically significant sites, both in Bulawayo and its environs. We discussed how this will help not only respect culture, tradition and history but also boost Bulawayos tourist potential.\n\nIt was my great honour today to host Inkosi u Bulelani Lobengula Khumalo for a courtesy meeting at@CityofBulawayoCity Hall.\n\nIn a highly productive and fruitful meeting we discussed how our City can honour the proud history of King Mzilikazi and his descendants throughpic.twitter.com/Qnw0x3JXhA\n\n David Coltart (@DavidColtart)April 21, 2025\n\nGovernment does not recognise the Ndebele monarch, who was installed King on September 28, 2018 by traditional leaders and members of the Khumalo family but recognises Ndebele chiefs, most of whom have been enjoying benefits from the state.\n\nDespite contestation over the rightful heir to the Ndebele crown, King Bulelani has widely been accepted as the Ndebele King against another one of King Lobengulas heirs, Peter Zwide Khumalo who also claims the throne.\n\nThe Ministry of Local Government and Public Works has learnt with shock and utter disgust of a meeting you reportedly held in your capacity as the Mayor of City of Bulawayo with a pseudo King Bulelani allegedly at your invitation and bidding, read the letter, doing rounds on social media.\n\nIt has been brought to my attention that this unlawful and wrongful meeting was held in the Bulawayo Mayors Parlour on 21 April 2025 whereat a pseudo character known as Bulelani was addressed as King Bulelani at your own behest.\n\nAs you may be aware, the Government of Zimbabwe has over the years incessantly denounced and dissociated itself from a self-proclaimed King Bulelani who illegally claims to be the legitimate heir to the now defunct throne of King Lobengula.\n\nThe Ministry would like to advise you, as the Mayor the City of Bulawayo and any other functionary of City of Bulawayo to desist from entertaining this charlatan self-styled King Bulelani as such behaviour is not only criminal but has the negative effect of misleading the general public.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29061714/coltart-bulelani.jpeg",
            "description": "<p>By Leopold Munhende A MEETING between Ndebele King Bulelani Khumalo, a descendent of late King Lobengula, and Bulawayo Mayor David Coltart has angered government, with the Local Government ministry describing it as unlawful and wrong. A letter to Coltart on the matter questioned why he had invited him and described King Bulelani as a ‘charlatan,’ and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ndebele-kings-visit-to-coltart-shocks-angers-government-bulawayo-ordered-not-to-recognise-him/\">Ndebele King’s visit to Coltart shocks, angers government – Bulawayo ordered not to recognise him</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        },
        {
            "title": "Business grinds to a halt at Chirundu Border Post as Zambians, Zimbabweans square off",
            "url": "https://www.newzimbabwe.com/business-grinds-to-a-halt-at-chirundu-border-post-as-zambians-zimbabweans-square-off/",
            "content": "By Staff Reporter\n\nBusiness came to a halt at Chirundu Border Post on Monday following counter-protests by Zambian and Zimbabwean nationals over alleged unfair treatment on either side.\n\nThe potentially explosive situation resulted in hours of a stand-off that saw Zambian nationals protesting and blocking Zimbabweans from entering the neighbouring country.\n\nAlthough efforts to get comments from Immigration officials were futile, media reports say in recent weeks, Zambian authorities have been arresting Zimbabweans crossing the border without permits, while undocumented Zambians have been allowed to enter Zimbabwe freely without facing any consequences.\n\nZimbabwean nationals, who are nabbed for flouting immigration laws, reportedly fork out 24,000 Kwacha (approximately US$800) to secure their freedom.\n\nSources say the rift over the unfair treatment reached fever pitch Monday, as Zimbabweans fought back against what they described as harassment and exploitation at the border.\n\nZambian vendors also reportedly protested after Zimbabwean immigration officers allegedly stopped them from entering the country to sell their wares.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/24071017/chirundu-boarder-post.jpg",
            "description": "<p>By Staff Reporter Business came to a halt at Chirundu Border Post on Monday following counter-protests by Zambian and Zimbabwean nationals over alleged unfair treatment on either side. The potentially explosive situation resulted in hours of a stand-off that saw Zambian nationals protesting and blocking Zimbabweans from entering the neighbouring country. Although efforts to get</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/business-grinds-to-a-halt-at-chirundu-border-post-as-zambians-zimbabweans-square-off/\">Business grinds to a halt at Chirundu Border Post as Zambians, Zimbabweans square off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Apr 2025"
        }
    ]
}