{
    "news": [
        {
            "title": "EcoCash escalates digital platforms’ efficiency",
            "url": "https://www.newzimbabwe.com/ecocash-escalates-digital-platforms-efficiency/",
            "content": "By Alois Vinga\n\nLEADING financial technology firm, EcoCash Holdings has escalated digital platform efficiencies which will go a long way in spurring customer experience.\n\nPresenting a Trading Update for the third quarter period ended November 30 2024, EcoCash company secretary, Charmaine Daniels revealed details on the latest innovative strides.\n\nThe Bank introduced a new and innovative Omni Channel platform; a unified, secure digital platform, enhancing customer experience and security. This platform integrates essential banking services, including account and card management, bill payments, and fund transfers, she said.\n\nDaniels said the Bank also launched a new ZIPIT Fund Transfers service which enables customers to transfer funds from any Foreign Currency Account or Mobile Wallet directly to their Steward Bank VISA card using the ZIPIT platform with speed, convenience, and flexibility.\n\nThe Bank further enhanced its service offerings with the implementation of card-less withdrawals and deposits through its intelligent ATMs, thereby affording customers heightened convenience and flexibility in conducting transactions, she said.\n\nMeanwhile, revenues for the quarter ended 30 November 2024 increased by 80% over the revenues for the previous quarter.\n\nThe Bank maintained its strategy of improving operational efficiencies through leveraging technology. This increased operating profit. The Bank is compliant with Tier 1 Capital requirements as prescribed by the Reserve Bank of Zimbabwe.\n\nEcoCash Holdings continues to focus on identifying and developing opportunities in the market that are consistent with providing convenient digital solutions to the increasing customer demands. The Organisation will continue to adapt to the changes in the operating environment and implement strategies to create shareholder value and maximize returns, added Daniels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/13101737/ecocash-scaled.jpeg",
            "description": "<p>By Alois Vinga LEADING financial technology firm, EcoCash Holdings has escalated digital platform efficiencies which will go a long way in spurring customer experience. Presenting a Trading Update for the third quarter period ended November 30 2024, EcoCash company secretary, Charmaine Daniels revealed details on the latest innovative strides. “The Bank introduced a new and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ecocash-escalates-digital-platforms-efficiency/\">EcoCash escalates digital platforms’ efficiency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "Zimbabwe to assist South Africa to identify Stilfontein illegal miners",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-assist-sa-to-identify-stilfontein-illegal-miners/",
            "content": "eNCA\n\nSTILFONTEIN  The Zimbabwean consulate is prepared to work with the South African government to verify and identify its citizens from Stilfontein mine in North West.\n\nZimbabwean consulate general Eria Phiri says this partnership is to ensure that the whole process is brought to a conclusion and finality.\n\nPhiri says the verification and identification process will also be done for the 465 illegal miners who have been brought to the surface alive.\n\nThe death toll in Stilfontein has risen to 87 with 246 survivors.\n\nIt is believed that nearly 2000 illegal miners were in the mine in August, and over 1000 have since been arrested.\n\nThe rescue operation at Stilfontein has come to an end.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>eNCA STILFONTEIN – The Zimbabwean consulate is prepared to work with the South African government to verify and identify its citizens from Stilfontein mine in North West. Zimbabwean consulate general Eria Phiri says this partnership is to ensure that the whole process is brought to a conclusion and finality. Phiri says the verification and identification</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-assist-sa-to-identify-stilfontein-illegal-miners/\">Zimbabwe to assist South Africa to identify Stilfontein illegal miners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "Zimbabwe’s business sector in survival mode as inflation and currency woes bite",
            "url": "https://www.newzimbabwe.com/zimbabwes-business-sector-in-survival-mode-as-inflation-and-currency-woes-bite/",
            "content": "Business Report\n\nZimbabwean companies are grappling with severe economic challenges, including soaring inflation, a skewed exchange rate, and escalating operational costs, forcing some to retrench workers and others to reduce stock levels.\n\nAmong the hardest hit is Tongaat Huletts Zimbabwean subsidiary, Triangle, which announced job cuts after other cost-saving measures failed. Retailers like OK Zimbabwe are also struggling, with de-stocking becoming a growing concern as businesses navigate the countrys volatile economic landscape.\n\nAn uncertain monetary framework, characterised by run away inflation, a skewed exchange rate and pricing distortions, has left corporates in Zimbabwe battling for survival. Some of them have had to retrench while the retailers are de-stocking.\n\nZimbabwe is already battling a high unemployment rate that has driven droves of locals to seek greener pastures in South Africa and elsewhere on the region and internationally at a time the countrys economic challenges are mounting.\n\nTongaat Huletts Zimbabwean unit, Triangle, said this week that it was facing operational challenges that had forced it to retrench employees after cost cutting measures failed to yield a respite.\n\nThe current economic environment in Zimbabwe has presented unprecedented challenges for Triangle Limited over the past [three] years. After careful deliberation and extensive evaluation of our operational and economic realities, we have made the extremely difficult decision to implement a phased retrenchment process, Tendai Masawi, the managing director of Triangle, said in a note to employees this week.\n\nHe cited escalating operational costs particularly in areas such as fertiliser, fuel, maintenance costs and imported goods/services, combined with inflationary pressures, currency losses, the inability to claim VAT on inputs after sugar was exempted from VAT, and competition from low cost duty-free imported sugar as having severely impacted the companys ability to sustain continued production.\n\nTriangle, which housed Tongaat Huletts Zimbabwean interests that also include Hippo Valley, said it had seen profit margins decline significantly by 55%with manpower costs is spiking by 133% as a proportion of revenue, and debt levels rising to unsustainable levels.\n\nTriangle had thus been unable to generate positive cash flows from its operating activities over the past three years as it had faced a very constrained working capital position.\n\nThese financial realities underscore the urgent need for corrective action so that the business can generate sufficient cash flows to reduce debt and reinvest in its future. This (retrenchment) decision has been taken to protect the long-term sustainability of our organisation and ensure that Triangle Limited continues to play its vital role in Zimbabwes economy, the company said.\n\nTongaat Hulett Limited, is currently preparing to dispose of the Zimbabwe operations to the owners of the Vision Group for about R5.9 billion. The Zimbabwe operations for Tongaat Hulett were among a few stable divisions under the crisis ridden and troubled South African sugar and agro-processing unit that also had operations in Mozambique.\n\nRetailers are equally affected, with OK Zimbabwe and other operators like Choppies reducing stock levels due to policies that mandate local currency transactions despite widespread use of foreign currencies.\n\nDe-stocking levels across most of OK Zimbabwes outlets have raised the alarm and concerns that the company is buckling under Zimbabwes policies that force retailers to trade in local currency against widespread use of foreign currencies in a country battling for currency stability.\n\nIn a statement, OK Zimbabwe acknowledged that it had faced stocking levels over the past few weeks. The company faced intermittent product supply challenges during the festive period. The Company, as well as most of the formal retail sector, has been adversely impacted by a volatile operating environment, said OK Zimbabwe.\n\nMeanwhile, manufacturers like Mega Mart have appealed to government officials for structural reforms to expand the formal sector, which they argue would boost tax revenues and support economic recovery.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>Business Report Zimbabwean companies are grappling with severe economic challenges, including soaring inflation, a skewed exchange rate, and escalating operational costs, forcing some to retrench workers and others to reduce stock levels. Among the hardest hit is Tongaat Hulett’s Zimbabwean subsidiary, Triangle, which announced job cuts after other cost-saving measures failed. Retailers like OK Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-business-sector-in-survival-mode-as-inflation-and-currency-woes-bite/\">Zimbabwe’s business sector in survival mode as inflation and currency woes bite</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "“You are punished for doing the right thing” – top official who survived two murder attempts says Harare City Council now a ‘Mafia organisation’",
            "url": "https://www.newzimbabwe.com/you-are-punished-for-doing-the-right-thing-top-official-who-survived-two-murder-attempts-says-harare-city-council-now-a-mafia-organisation/",
            "content": "By Darlington Gatsi\n\nHARARE City Councils acting Director of Human Capital, Bosman Matengarufu, who claims there were two attempts on his life after he initiated investigations into some of the local authoritys officials has described the Town House as a mafia-like territory.\n\nMatengarufu said his food was poisoned twice following his attempts to investigate and bring order to the beleaguered Harare City Council.\n\nOn one occasion, his office was broken into, and several importantdocuments implicating some officials in transgressions went missing,prompting Matengarufu to use a briefcaseoffice.\n\nMatengarufu on Monday told the Harare Commission of Inquiry led by retired judge Justice Maphios Cheda that the working environment at the Town House is toxic.\n\nBosman Matengarufu\n\nMy office was broken into in March 2021 and up to now it is not secure. I do not keep records there, I move with my office, he said.\n\nIn 2020, Matengarufu was chased away from a workshop by fellow council officials.\n\nHe also claimed that his home was raided by robbers and his security guard sustained some injuries.\n\nThe situation at the Town House is so chaotic that even suspended officials show up for work in violationof laws governing workers serving suspensions.\n\nHe said bringing normalcy to HCC is impossible as the overtures are thwarted by senior officials with Town Clerk, Hosiah Chisango being fingered.\n\nAdded Matengarufu, You can describe it like that (chaotic) but myself I say it is a toxicenvironment. When you want to do the right thing you are penalised for doing the right thing or you are just ignored like I have written to the Town Clerk. I was like a lone figure in the chaos you are trying to describe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25025158/Harare-Town-House.png",
            "description": "<p>By Darlington Gatsi HARARE City Council’s acting Director of Human Capital, Bosman Matengarufu, who claims there were two attempts on his life after he initiated investigations into some of the local authority’s officials has described the Town House as a “mafia-like territory”. Matengarufu said his food was poisoned twice following his attempts to investigate and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-are-punished-for-doing-the-right-thing-top-official-who-survived-two-murder-attempts-says-harare-city-council-now-a-mafia-organisation/\">“You are punished for doing the right thing” – top official who survived two murder attempts says Harare City Council now a ‘Mafia organisation’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "Chimombe, Mpofu denied bail; judge says duo faces 20-year jail term if convicted",
            "url": "https://www.newzimbabwe.com/chimombe-mpofu-denied-bail-judge-says-duo-faces-20-year-jail-term-if-convicted/",
            "content": "By Mary Taruvinga\n\nFraud-accused business partners Moses Mpofu and Mike Chimombe have been denied bail by High Court Judge Justice Pisirayi Kwenda.\n\nThe two were seeking bail pending appeal after all their previous freedom bids flopped.\n\nThe two are accused of abusing US$7 million state funds in a botched presidential goats scheme through their company Black Deck Poultry Pvt Ltd which was allegedly a non-existent company.\n\nIn handing down his ruling Kwenda said facts are critical in making a bail application and lawyers should not labour or drag court proceedings citing unnecessary issues.\n\nKwenda said the evidence against the two as alleged by the State is there and the court could not ignore this.\n\nI notice that the State insisted on interference and that they may not stand trial.\n\nRegarding the seriousness, I have looked at the penaltythe presumptive penalty for fraud is 20 years.\n\nIf a fraud involves public funds and involves a huge prejudice the sentence will be severe.\n\nIm persuaded that the presumptive sentence knowledge of the penalty remains, and is likely to influence the applicants to flee, he said.\n\nRegarding the seriousness, I have looked at the penaltythe presumptive penalty for fraud is 20 years.\n\nIf a fraud involves public funds and involves a huge prejudice the sentence will be severe.\n\nIm persuaded that the presumptive sentence knowledge of the penalty remains, and is likely to influence the applicants to flee, he said.\n\nA presumptive sentence is where the court starts from. It must consider that sentence first, it can go down or up.\n\nThese sentencing guidelines tend to be followed. In this case, it provides for two presumptive sentences.\n\nWhere the prejudice is insignificant it can be six months.\n\nWhere the item, funds, or property is of high value or State funds, it will be an aggravating factor.\n\nIf the fraud is committed by an offender who is a holder of a public office, it is an aggravating actor and the court should start from there.\n\nIf it involves public funds, it is an aggravating actor and the court should start from there, he said.\n\nThe judge also criticised lawyers for delaying progress and how Mpofu made his application, noting that he laboured the court with unnecessary submissions.\n\nWhat should be important to a practitioner is to provide facts that there are compelling reasons.\n\nKwenda said the fact that the Constitutional Court took the entire third term of the 2024 judicial year was regrettable, although it was dismissed.\n\nHe said the bail application by Mpofu also did not meet the basic provisions of a bail application.\n\nA bail application is expected to be simple and unemotional presentations of facts supporting ones entitlement to bail, he said.\n\nHe also said some submissions were not persuasive.\n\nThe State had persuaded Kwenda to hold that the two were resisting trial.\n\nProsecutors also said their likelihood of absconding was higher because the legal woes had increased.\n\nKwenda said each case depends on its circumstances.\n\nMy analysis of facts and submissions before me are as follows. Bail matters should be simplehowever, as a profession, we tend to be so obsessed and end up unwittingly infringing upon the matter that will be before a court.\n\nHe further complained about how the court sat for two days only to hear a bail application which was regarded as urgent.\n\nIt was extraordinarythat speed resolution of bail cannot be completed if we take two days on a bail application.\n\nThe simple issue before me was whether the applicants should be granted bail.\n\nA lot of time was lost while parties tussled over what type of an application was before me.\n\nI must criticise both counsels before me. There is no need to give a process like bail application, a name that does not appear in the CPEA Act.\n\nIm just saying to show that we delayed this case for no reason, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03215456/WhatsApp-Image-2024-10-03-at-12.49.46.jpeg",
            "description": "<p>By Mary Taruvinga Fraud-accused business partners Moses Mpofu and Mike Chimombe have been denied bail by High Court Judge Justice Pisirayi Kwenda. The two were seeking bail pending appeal after all their previous freedom bids flopped. The two are accused of abusing US$7 million state funds in a botched presidential goats scheme through their company</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chimombe-mpofu-denied-bail-judge-says-duo-faces-20-year-jail-term-if-convicted/\">Chimombe, Mpofu denied bail; judge says duo faces 20-year jail term if convicted</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "15-year-old Zimbabwean boy sought over killing of teen on London bus",
            "url": "https://www.newzimbabwe.com/15-year-old-zimbabwean-boy-sought-over-killing-of-teen-on-london-bus/",
            "content": "BBC\n\nDetectives investigating the fatal stabbing of a 14-year-old boy in south-east London have named two people they are looking to speak to.\n\nKelyan Bokassa died shortly after being attacked on a 472 double-decker bus on Woolwich Church Street on 7 January.\n\nNo arrests have been made but the Metropolitan Police has named 15-year-old Colin Chabikwa and Mosawar Zazi, 16, as people they are seeking to locate.\n\nMembers of the public have been urged not to approach either of them if seen and instead contact police as soon as possible.\n\nPolice, paramedics and the London Air Ambulance were called to the scene of the stabbing at about 14:30 GMT after the alert was raised by an officer on patrol.\n\nMedics tried to treat Kelyans injuries, but he died soon afterwards.\n\nKelyan, pictured with his mum Marie Bokassa, was stabbed to death on a bus on 7 January\n\nDet Ch Insp Sarah Lee said Kelyans death had deeply affected many in the community, and she thanked people in Woolwich for the support they have shown.\n\nOfficers have been undertaking increased weapons searches, reassurance patrols and house-to-house inquiries, she said.\n\nI know these can be disruptive, however it has been vital, and your patience is appreciated.\n\nShe added that officers were working around the clock to catch those responsible for Kelyans death.\n\nMarie Bokassa, Kelyans mum,told BBC London last weekthat her son was very caring and kind.\n\nHowever, she said he had experienced some extremely challenging times and had been taken into care for a number of years.\n\nKelyan was groomed by gangs from the age of six years old, Ms Bokassa said.\n\nShe added: I feel hurt because I tried to prevent it. Ive tried so many, so many times. I screamed it, I said my son is going to be killed.\n\nKelyans death comes three months after another teenage boy lost his life to knife crime in Woolwich.\n\nDaejaun Campbell, 15,was stabbed to death in Eglinton Roadon 22 September, less than a mile-and-a-half away from last Tuesdays stabbing.\n\nHe was among 11 teenage boys who lost their lives to homicide in London in 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/16150417/chabikwa.webp",
            "description": "<p>BBC Detectives investigating the fatal stabbing of a 14-year-old boy in south-east London have named two people they are looking to speak to. Kelyan Bokassa died shortly after being attacked on a 472 double-decker bus on Woolwich Church Street on 7 January. No arrests have been made but the Metropolitan Police has named 15-year-old Colin</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/15-year-old-zimbabwean-boy-sought-over-killing-of-teen-on-london-bus/\">15-year-old Zimbabwean boy sought over killing of teen on London bus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "Zanu PF MP says proposed draft motion to amend Zimbabwe Constitution to extend President, Parly terms of office is authentic",
            "url": "https://www.newzimbabwe.com/zanu-pf-mp-says-proposed-draft-motion-to-amend-zimbabwe-constitution-to-extend-president-parly-terms-of-office-is-authentic/",
            "content": "VOA\n\nA Zanu PF parliamentarian has confirmed that efforts are being made by the ruling party and a faction of the opposition Citizens Coalition for Change (CCC) to amend the Zimbabwe Constitution in order to extend the term of office of President Emmerson Mnangagwa, legislators and councilors by at least five years.\n\nIn a statement, Zanu PFs Bikita West Member of Parliament Energy Mutodi said a proposed motion on presidential, parliamentary and local government term limits was untimely leaked to the media.\n\nMutodi said the proposed draft motion circulating on social media is authentic and work in progress, which will become official when signed by the Speaker of Parliament Jacob Mudenda and its proponents.\n\nMutodi, who allegedly authored the draft motion with CCCs Charles Moyo, said due process will be followed in accordance with the Standing Rules and Orders and the Constitution of Zimbabwe leading to a properly approved motion.\n\nBut Moyo distanced himself from the leaked document saying, I have nothing to do with that and the only person to speak about this issue is our senate leader Hon. Nonhlanhla Mlotshwa.\n\nThe latter said her party has nothing to do with the draft motion and make no mistake, we will oppose it as much as we can because I support constitutionalism and not somebody who wants to change the constitution to suit himself.\n\nHowever, backers of the draft motion said to be at least 22 CCC parliamentarians and a large number of Zanu PF legislators, are confident that they will table it when parliament opens in February.\n\nMutodi and his colleagues have already informed Justice Minister Ziyambi Ziyambi about their intentions. The minister was not available for comment as he was unreachable on his mobile phone.\n\nThere is a lot of resistance in the ruling party about any constitutional amendments relating to presidential terms. A senior Zanu PF official, who requested not to be identified in fear of being victimized, said, I think I can honestly say its madness! Theres no reason to extend EDs term and its insanity for the opposition to openly advocate for the ruling party to continue ruling. I know that as a party, we are really good at intelligence and corrupting the opposition, but this is brazenly ridiculous.\n\nConstitutional expert Lovemore Madhuku, who is also leader of the opposition National Constitutional Assembly party, told Studio 7 that Zimbabweans should take to the streets to block any constitutional amendments that would lead to the extension of the term of office of the president.\n\nMadhuku said, This is a year where we ought to face directly and bluntly this whole nonsense about 2030 and it must be buried whether alive or dead and once we bury it we are able to move forward with the politics of the country. This thing must be removed from our political processes.\n\nMutodi and his colleagues are planning to move a motion for the introduction of a constitutional amendment bill that seeks to amend Section 95(b) of the Constitution of Zimbabwe to allow the term of the president to be extended by any period not exceeding 5 years as shall be determined by parliament.\n\nThe proposed bill, according to the draft motion, will seek to also amend Section 91(2) of the Constitution of Zimbabwe to allow parliament to determine an additional period of time the president may continue to hold office at the expiry of his or her second term.\n\nThey want parliament to amend Section 143(1) and 158(1)(a) to extend the term of office for parliamentarians by such period parliament may determine for the sake of economic development, peace building and the restructuring of government including addition or abolition of government posts.\n\nThe proponents of the motion are also suggesting the amendment of Section 328(7) which bars a sitting president from seeking a third term, arguing that the current supreme law does not conform to the needs of Zimbabweans as there is need to hold a referendum before any constitutional amendments.\n\nAccording to the lawmakers, some of the constitutional provisions do not meet the current aspirations of the people of Zimbabwe who would like to see the current national development trajectory continue under Mnangagwa.\n\nThey claim that there is a lot of toxic politics in Zimbabwe, which calls for a comprehensive electoral reform process, dialogue and consensus by all citizens.\n\nThe proponents of the draft motion also claim that Mnangagwa deserves an extension of his term beyond 2028 when his two terms expire as he has worked hard for Zimbabwes social and economic development.\n\nSome members of a faction of the CCC led by Welshman Ncube, including the self-imposed party secretary general Sengezo Tshabangu, are allegedly backing proposals for amending the constitution in order to extend the term of office of the president.\n\nTshabangu was recently suspended by CCC for allegedly attempting to make some parliamentary leadership changes without following proper party procedures. He has dismissed his suspension as nonsensical.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/10141426/Mnangagwa.png",
            "description": "<p>VOA A Zanu PF parliamentarian has confirmed that efforts are being made by the ruling party and a faction of the opposition Citizens Coalition for Change (CCC) to amend the Zimbabwe Constitution in order to extend the term of office of President Emmerson Mnangagwa, legislators and councilors by at least five years. In a statement,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-mp-says-proposed-draft-motion-to-amend-zimbabwe-constitution-to-extend-president-parly-terms-of-office-is-authentic/\">Zanu PF MP says proposed draft motion to amend Zimbabwe Constitution to extend President, Parly terms of office is authentic</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "Harare Town Clerk’s assistant rakes in US$12,000 per month while ‘cash-strapped’ council fails to procure workers’ uniforms",
            "url": "https://www.newzimbabwe.com/harare-town-clerks-assistant-rakes-in-us12000-per-month-while-cash-strapped-council-fails-to-procure-workers-uniforms/",
            "content": "By Darlington Gatsi\n\nA top Harare council official, Mathew Marara is earning a hefty US$12,000 a month while the local authority is failing to procure uniforms for its workers and poor service delivery is the order of the day.\n\nThis was revealed during the ongoing Commission of Inquiry which is investigating the operations of the Harare City Council since 2017 where Marara appeared on Tuesday.\n\nMarara disclosed that his current salary is US$12,000 which is inclusive of benefits.\n\nMarara, Human Capital Director at HCC, reportedly awarded himself the post of Executive Assistant to the Town Clerk under mysterious circumstances.\n\nThis was reportedly done with the approval of suspended Town Clerk Hosiah Chisango, devoid of the Ministry of Local Governments nod.\n\nThis position came with lucrative benefits which Marara detailed to the Commission of Inquiry.\n\nMy salary is currently is US$12,000 paid at interbank rate. It is inclusive of salary, allowances, motor benefits because I use my own vehicle, said Marara.\n\nThe revelation came at a time when the City Council is struggling to procure uniforms for its workers as disclosed before the Commission.\n\nHCC has also been struggling to procure basic essentials such as fuel to service its vehicles but has been paying Mararas salary which amounts to US$144,000 per year.\n\nMarara has been embroiled in controversy at the Harare City Council after receiving US$320,000 as compensation for a period that he was suspended due to corruption allegations.\n\nThis figure, previously revealed before retired Justice Cheda led the committee, raised eyebrows given the City of Harare is struggling to fulfil its mandate.\n\nHowever, Mararara dismissed the amount as exaggerated, stating that he had not received the full amount.\n\nThat is not correct. The figure that was signed for by the negotiating committee was US$131,000. They are still paying. So far I have received US$116,000, he said.\n\nMarara will continue his testimony on January 21 where he will further clarify his salary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15223501/town-house-marara.png",
            "description": "<p> By Darlington Gatsi A top Harare council official, Mathew Marara is earning a hefty US$12,000 a month while the local authority is failing to procure uniforms for its workers and poor service delivery is the order of the day. This was revealed during the ongoing Commission of Inquiry which is investigating the operations of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-town-clerks-assistant-rakes-in-us12000-per-month-while-cash-strapped-council-fails-to-procure-workers-uniforms/\">Harare Town Clerk’s assistant rakes in US$12,000 per month while ‘cash-strapped’ council fails to procure workers’ uniforms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "Focus on what we could do together, not the negatives – US tells Zimbabwe",
            "url": "https://www.newzimbabwe.com/focus-on-what-we-could-do-together-not-the-negatives-us-tells-zimbabwe/",
            "content": "By Staff Reporter\n\nAMERICAs Ambassador to Zimbabwe Pamela Tremont has urged the government to avoid emphasising the two countries points of conflict but instead take advantage of possible areas of collaboration that could benefit both nations.\n\nTremont, who presented her credentials and moved to Harare last year, said she had been concentrating on getting more American investors into the country since presenting papers to President Emmerson Mnangagwa.\n\nThe United States of America (USA) has not had the best relationship with Zimbabwe, which stands accused of gross human rights abuses among other ills, since the early 2000s.\n\nTheir relationship has been characterised by accusations and counter-accusations regards the roles played in getting Zimbabwes economy on its knees.\n\nRuling, Zanu PF officials have argued and accused America of illegally sanctioning its entities and powerful organisations while the US has continuously professed ignorance and maintained corruption is the main crisis.\n\nTremont said her comments were in full realisation that the USA had been Zimbabwes largest source of donor aid since independence in 1980.\n\nWhat I would really like to do is get the Zimbabwean government to refocus away from our areas of disagreement and focus on what we can do together to achieve our mutual goals, said Tremont.\n\nI have been focused on the investment climate and how we can improve the situation here on the ground that will attract more US investors to Zimbabwe, create jobs and hopefully improve the prosperity of Zimbabweans.\n\nWe have been the largest bilateral donor to Zimbabwe since its independence in 1980. Despite our many areas of disagreement and the tension that we sometimes have had, we have continued to support the Zimbabwean people.\n\nThat is not the kind of relationship we want to have. We would like Zimbabwe to be a self-sufficient, self-reliant country that can stand on its own two feet, and make its own decisions without the influence of anybody else.\n\nTremont was speaking on American platform Do Hard Stuff, hosted by J. W. Oliver of ZimWorX, an organisation promoting employment creation in Zimbabwe.\n\nWe are constantly trying to win people over to believing that the US is a force for good in the world and that we should be the partner of first resort in solving all of the worlds problems, said Tremont.\n\nOur interests in Zimbabwe are to build partnerships with Zimbabweans so that we can counter challenges such as climate change, hunger, and disease increase trade and combat diseases.\n\nWe believe that increased trade and prosperity is important for us and Zimbabweans. Those are the sort of things we talk about with the Zimbabwean government.\n\nOur goals in Zimbabwe havent really changed so much over the years.\n\nWelfare and equality in Zimbabwe are actually getting worse.\n\nThe rich are getting richer, the poor are getting poorer, the number of people living below the poverty line has doubled since 2011 despite significant Chinese investment here.\n\nWe believe that strong democratic institutions and respect for human rights are really key components of having a free market economy that works well without corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15215508/Tremont-Photo-scaled.jpg",
            "description": "<p>By Staff Reporter AMERICA’s Ambassador to Zimbabwe Pamela Tremont has urged the government to avoid emphasising the two countries’ points of conflict but instead take advantage of possible areas of collaboration that could benefit both nations. Tremont, who presented her credentials and moved to Harare last year, said she had been concentrating on getting more</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/focus-on-what-we-could-do-together-not-the-negatives-us-tells-zimbabwe/\">Focus on what we could do together, not the negatives – US tells Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        },
        {
            "title": "ZWG scarcity has eased exchange rate depreciation  – Industry",
            "url": "https://www.newzimbabwe.com/zwg-scarcity-has-eased-exchange-rate-depreciation-industry/",
            "content": "By Alois Vinga\n\nLIMITED ZWG availability has eased exchange rate depreciation on the parallel market with US$ demand pressures pushing up the premiums towards the end of 2024.\n\nThe ZWG was introduced last year as the countrys first-ever Structured Currency backed by multiple resources like minerals and foreign currency.\n\nAfter maintaining stability in the first few months, the local premium took a dip, forcing the Reserve Bank of Zimbabwe (RBZ) to institute measures to safeguard the currencys total collapse.\n\nThe Confederation of Zimbabwe Industries (CZI) inflation tracker noted that the tight liquidity stancehas managed to ease parallel market exchange rates.\n\nDue to the limited supply of ZWG in the market, the depreciation in the parallel market was not sustained, as ZWG started appreciating on the parallel market rate from the 30thof September 2024. This resulted in a decline in the exchange rate premium to a low level of 27% on the buying rate by mid-October.\n\nHowever, since mid-October, the upward pressure on the buying rate at the parallel market began to resurface, which pushed the premium to about 46% on the 31st of October 2024, the industry group said.\n\nThe CZI said sources of liquidity that drove the parallel exchange rate towards the end of October need to be addressed, as the trend in the parallel market had demonstrated that the parallel market rate can indeed appreciate under tight liquidity.\n\nThe industry lobby group said the 43% devaluation of the official exchange rate initiated by the RBZ did not result in convergence with the parallel market buying rate, as the parallel market rate also depreciated by 24% on the same day.\n\nThe recent ZiG inflation surge in the months of September and October 2024 confirms that inflation in Zimbabwe is exchange rate driven. The outlook for inflation generally hinges on the ability to stabilise the exchange rate, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga LIMITED ZWG availability has eased exchange rate depreciation on the parallel market with US$ demand pressures pushing up the premiums towards the end of 2024. The ZWG was introduced last year as the country’s first-ever Structured Currency backed by multiple resources like minerals and foreign currency. After maintaining stability in the first</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-scarcity-has-eased-exchange-rate-depreciation-industry/\">ZWG scarcity has eased exchange rate depreciation  – Industry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "17 Jan 2025"
        }
    ]
}