{
    "news": [
        {
            "title": "Back to the future: Why defending Zimbabwe’s Constitution is defending the country",
            "url": "https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/",
            "content": "By Chofamba Sithole\n\nWhen Nelson Chamisa recently declared on X that there is no constitution to protect or defend and that we must instead defend and protect our country, his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when clarity and focus are essential.\n\nTo suggest that there is no constitution to defend is to surrender the very ground upon which the democratic struggle was built. Our constitution is not some detached piece of paperit is the living embodiment of the peoples will, painstakingly won through generations of struggle. To abandon it is to abandon Zimbabwe itself.\n\nWe have been here before. In the late 1990s, Zimbabwe was gripped by a similar sense of national crisis. Corruption, authoritarianism, and economic decline had hollowed out public confidence in the state. Recognising the depth of the malaise, a broad coalition of social movementsfrom labour unions to churches, students, womens groups, and civic activistsconcluded that the countrys salvation lay in a new constitutional order.\n\nOut of this awakening came the National Constitutional Assembly (NCA), spearheaded by the Zimbabwe Congress of Trade Unions under the leadership of Gibson Sibanda and Morgan Tsvangirai. The NCAs mission was clear: to mobilise citizens to write a people-driven constitution that would redefine the relationship between state and citizen.\n\nAlarmed by this groundswell, Robert Mugabes government rushed to produce its own draft through a state-appointed commission. But when this elite-driven constitution was put to a referendum in February 2000, the people rejected it. For the first time in history, Mugabe tasted defeat at the ballot box, because Zimbabweans demanded a constitution of the people, not for the rulers.\n\nThat dream was finally realised in 2013, when, during the inclusive government, the Movement for Democratic Change (MDC) and ZANU-PF agreed to a consultative process that produced a new, progressive, and people-endorsed constitution. Adopted by an overwhelming majority, it became Zimbabwes first truly democratic social contract.\n\nBut from the very beginning, the ruling elite treated this document not as a national covenant but as an inconvenience. After Emmerson Mnangagwa became President following the November 2017 military coup, he led efforts to butcher the new constitution, most notably the presidential running mate clause, to ensure continuity of Big Man, presidential dominance.\n\nNow Mnangagwa seeks, further, to drive a chariot and horses through the same constitution he once swore to uphold. His reported ambition to amend or suspend key provisions to entrench a preferred succession plan amounts to nothing less than a constitutional coup. With a co-opted and compliant parliament, the regime hopes to legalise illegality and codify authoritarianism.\n\nWhat is at stake, therefore, is not simply a factional battle within ZANU-PF between Mnangagwa and his deputy, General Constantino Chiwenga. It is a national crisis that cuts to the very foundations of the Republic. The fight over the constitution is the fight over the soul of Zimbabwe.\n\nIt is in this context that Advocate Nelson Chamisas assertion that there is no constitution to defend may be seen as problematic. The constitution defines who we are, what we aspire to become, and what powers the state may or may not exercise over us.\n\nTo claim that the constitution is in tatters and therefore unworthy of defense is to concede defeat to those who have been tearing it apart. The constitutions fragility is not a reason to abandon it; it is the reason we must defend it all the more vigorously.\n\nThe 2013 Constitution remains a democratising document, a peoples shield against tyranny. It provides the legal, moral, and political framework through which citizens can resist authoritarian excesses. It tells us not just what Zimbabwe is, but what Zimbabwe ought to be.\n\nWithout it, talk of defending the country becomes abstract rhetoric. What country are we defending, if not the one defined by a constitution born of the peoples struggle? What rules guide that defence? What limits restrain it? If the fight for Zimbabwe is undefined, it risks descending into chaos or co-option.\n\nZimbabwe stands today at another historic crossroads. The constitution is under siege. The institutions meant to uphold it have been captured. The opposition has been divided and, in some cases, clearly paid off. Yet this very moment demands that all democratic forces  political, civic, and social  reclaim their original mission: to defend the constitution as the ultimate expression of the peoples sovereignty.\n\nThe answer to authoritarian manipulation is not to discard the constitution but to rally around it. That was the lesson of 1999. It remains the challenge of 2025.\n\nIf the constitution falls, the Republic falls with it.\n\nSo yes, Zimbabwe must be defended, but to defend Zimbabwe is to defend its constitution. The two are one and the same.\n\nHistory has given Nelson Chamisa a through-pass in the penalty box. The question is, will he shoot for the goal by galvanising Zimbabweans to save their constitution, hence their nation?\n\nChofamba Sithole is a veteran Zimbabwean journalist and political commentator.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05121529/chofamba.jpg",
            "description": "<p>By Chofamba Sithole When Nelson Chamisa recently declared on X that “there is no constitution to protect or defend” and that “we must instead defend and protect our country,” his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/\">Back to the future: Why defending Zimbabwe’s Constitution is defending the country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "Pomona Flats construction takes shape",
            "url": "https://www.newzimbabwe.com/pomona-flats-construction-takes-shape/",
            "content": "By Staff Reporter\n\nBUILDING of the Pomona flats is progressing well with the first block now under construction and indications that two more blocks will be out of the ground by year-end.\n\nTwo blocks are already sold out while blocks three and four are on the market and selling equally fast.\n\nWestProp Holdings is renowned for its signature developments, including Millennium Heights and Pokugara. Its latest project, The Hills Luxury Golf Estate, is set to redefine the live, work, shop, and play lifestyle that underpins all WestProp communities  offering a bold new standard in integrated urban living.\n\nWith the introduction of apartments at Pomona City, Westprop chief executive Ken Sharpe is making a bold statement and declaring confidence in Harares urban evolution.\n\nWith three blocks already sold out, the project is capturing the attention of homebuyers and investors alike  a testament to its strategic location, modern design, and flexible ownership models.\n\nIn response to growing demand for quicker delivery timelines, WestProp has introduced a dedicated block tailored for buyers seeking occupancy within six months. This block comes with a synchronised payment plan, allowing purchasers to align their financial commitments with the construction schedule  a move designed to ease pressure on buyers while maintaining WestProps hallmark quality.\n\nThe Pomona Flats project is part of WestProps broader vision to redefine urban living in Zimbabwe through sustainable, secure, and stylish communities. With construction now underway and momentum building, prospective buyers are encouraged to act swiftly to secure units in the remaining blocks.\n\nPomona, dubbed a City within a City, borders with one of Harares premier 18-hole golf clubs  Wingate and is within striking distance of Harares growing commercial hubs  the Green Zone.\n\nA total of 22 blocks consisting of 16-unit apartments on three floors each will decorate the Pomona landscape, creating a new vibrant community and business opportunities.\n\nThis means in phase 1, there will be 352 apartment units  translating to housing 352 families. Phase 2 will have the same number of units. The architects created a spacious parking space of 530 bays for residents and 178 for visitors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Staff Reporter BUILDING of the Pomona flats is progressing well with the first block now under construction and indications that two more blocks will be out of the ground by year-end. Two blocks are already sold out while blocks three and four are on the market and selling equally fast. WestProp Holdings is renowned</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pomona-flats-construction-takes-shape/\">Pomona Flats construction takes shape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "Zimbabwe set for normal to above-normal rainfall",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-for-normal-to-above-normal-rainfall/",
            "content": "By Anna Chibamu\n\nThe Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season across most parts of Zimbabwe for the 20252026 farming period.\n\nMSD director Rebecca Manzou announced the first seasonal forecast for November, December, and January during a stakeholder briefing in Harare on Tuesday. She said collaborative work between the MSD and its regional partners indicated generally favourable rainfall patterns across the country.\n\nIn general, from November to January, the northern part of the country is normal to above normal rainfall, said Manzou.\n\nThe bulk of the country,which includes Manicaland, Masvingo, most of Mashonaland East, Harare Metropolitan, much of Midlands, the southern parts of Mashonaland Central and West, the south-eastern part of Mashonaland North, Bulawayo Metropolitan, and the bulk of Matabeleland South,has an increased chance of above normal rainfall.\n\nShe added, Also, from November to January, in the northern and western parts of the country, there is an increased chance of normal to above normal rainfall. So, we are at a good place as a country.\n\nFor the period December 2025 to February 2026, Manzou said rainfall is expected to remain within the normal to above-normal range, with the same trend likely to continue from January to March.\n\nHowever, she cautioned that rainfall patterns may vary from month to month, with nearer forecasts being more accurate.\n\nNovember will have normal to below normal rainfall. So, we are already in November and, in general, we are not talking of site-specific forecasts.\n\nFor December, rainfall distribution in the southern parts of the country will be higher compared to the northern parts.\n\nJanuary is expected to have a normal to above normal; February, normal to above normal it is a cumulative rainfall pattern, she explained.\n\nManzou urged farmers to seek advice from Agritex officers in their respective areas and avoid planting before the onset of effective rains.\n\nThe MSD is also monitoring temperature trends for the season. Despite recent hot weather, the conditions donot qualify as a heatwave.\n\nAccording to the MSD, temperatures for November to December are expected to be warmer than normal, while December will likely experience cooler-than-normal conditions.\n\nIt is now cooler, except in the extreme north, where it is still very uncomfortable (hot), Manzou said.\n\nFrom January to February 2026, temperatures are projected to remain cooler than normal across the country.\n\nManzou reminded stakeholders that the forecast issued was for total cumulative rainfall amounts, expressed relative to long-term averages, and that the MSD also issues daily, three-day, and 10-day forecasts for more precise weather guidance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05061210/rain.jpg",
            "description": "<p>By Anna Chibamu The Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season across most parts of Zimbabwe for the 2025–2026 farming period. MSD director Rebecca Manzou announced the first seasonal forecast for November, December, and January during a stakeholder briefing in Harare on Tuesday. She said collaborative work between the MSD</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-for-normal-to-above-normal-rainfall/\">Zimbabwe set for normal to above-normal rainfall</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss the law of succession as it relates to agricultural land in Zimbabwe. What are the main considerations?\n\nVM:Thank you\n\nBefore delving into the laws of succession in agricultural land, it is necessary that I first address how agricultural is held in Zimbabwe. Agricultural land is held either through title deeds, 99-year leases, leases with an option to purchase, offer letters, permits or customarily as rural land under Rural District Councils.\n\nThese forms of holding confer personal rights to the holder except in title deeds, where the holder has real rights to the land. The personal rights titles emanating from Land Reform, being mainly permits, offer letters and 99-year leases, are a result of potentially one of the most significant wealth transfer events in post-colonial Africa.\n\nThe land itself is owned by the state and occupiers have usufructs on the land to use, enjoy and earn from it.\n\nThis background or understanding is necessary as it has a direct effect on succession.\n\nSuccession itself has become topical as farming by its very nature is a generational business.\n\nIf land reform started around 2000, it means the process is now 25 years old and cases of succession by heirs are now commonplace.\n\nReporter: You highlight land reform beneficiaries, that is A1 and A2. What is the process when the initial beneficiary dies?\n\nVM:It is important that we first differentiate the A1, being a small holder farm held under a permit from the government and an A2 farm being a large-scale commercial farm held under an offer letter or a 99-year lease.\n\nI understand that the current government policy is aimed at issuing deeds for these holders. I will discuss on succession for deeds later on. For now, I will restrict myself to permit, offer letter and lease holders.\n\nFirst thing to understand is that the land under these models belongs to the State and not individuals, therefore, succession in its strictest sense, which is through the Master of the High Court, is only for improvements and movable property.\n\nIf its for land, then the succession or reallocation of land to an heir has to be approved by the government who is the landowner. When the estate of the late holder is being administered, the value of the land is not included in the process as it does not belong to the estate but the government.\n\nMaking the process twotier\n\nFor A1 farms, the surviving spouse and dependants may succeed although the successor has to be approved by the Minister of Lands. The process is done through the District Lands office within 3  6 months after the death of the land owner, depending on whether or not there are disputes. In situations of disputes, spousal rights are protected and consideration is also given to potential successors who developed the farm.\n\nThe process is similar for A2 offer letters; there is a need for an application to the Ministry of Lands district office with the required documents, which is dealt with by the Valuation and Estate Management section. As part of its consideration, it will assess, among other things, the capacity to farm, whether or not the potential heir has other farms et cetera.\n\nAs for lease holders, it is governed by general inheritance laws; the executor, upon completing the beneficiary identification process, will still be required to make an application to the Minister for approval of allocation.\n\nReporter:What issues may inhibit or stop the A1 or A2 farms being re-allocated or distributed to the selected beneficiary?\n\nVM:I am forced to start by reiterating that the rights conferred by offer letters and or leases are personal in nature. This makes it necessary for the beneficiary or potential heir to prove the rights to the Ministry of Lands.\n\nSuch proof is through the offer letter, permit or lease granted to the deceased. A failure to prove implies that the late occupier may potentially have been an unlawful occupier.\n\nIn the absence of proof, the Ministry of Lands has no obligation to re-allocate the land to the selected heir. As there may be back and forth between the offices, it is important that copies of correspondence with the Ministry are kept judiciously in the event there is a need for them to be reproduced\n\nReporter: What is the inheritance position for rural kumusha land when it comes to inheritance and farms having a title deed?\n\nVM:Communal land is vested in the President and administered by the Rural district Councils through traditional leaders being chiefs and headmen. Their inheritance for use is normally through family lines.\n\nAs for farms having title deeds, they fall under our normal inheritance laws under the purview of the Master of the High Court. The Ministry of Lands does not have jurisdiction over these types of farms.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04171724/mcm-legal.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "ZIFA appoints Marian Marinica new Warriors head coach",
            "url": "https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/",
            "content": "By Sports Reporter\n\nZIFA has appointed Marian MarioMarinica as the new head coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nMarinica is a Romanian national who has previously managed Malawi and Liberia.\n\nThe 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in the game.\n\nIn a statement, ZIFA said Marinica was given a one-year contract andwill becommencing duty this month.\n\nZimbabwe Football Association (ZIFA) is pleased to announce the appointment of Marian (Mario) Marinica as the new Head Coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nThroughout his distinguished career, Marinica has worked with several prestigious clubs and national teams, including Arsenal FC, Chelsea FC, Internazionale Milano, AS Monaco, Liverpool FC, and Tottenham Hotspur, as well as the national teams of Paraguay, Mauritius, Malawi, and Liberia.\n\nUnder his leadership, Malawi reached the Round of 16 at the 2022 Africa Cup of Nations, their best-ever finish, while Liberia became the highest climber in the FIFA Rankings in June 2024, reads thestatementon Marinicas appointment.\n\nHe comes in toreplaceMichael Nees, who was fired last month following a string ofpoor results.\n\nMarinicas first assignment will be the upcoming friendly matches against Qatar and Algeria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05043256/marion-coach.jpeg",
            "description": "<p>By Sports Reporter ZIFA has appointed Marian ‘Mario’ Marinica as the new head coach of the Zimbabwe Senior Men’s National Football Team, the Warriors, on a one-year contract. Marinica is a Romanian national who has previously managed Malawi and Liberia. The 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/\">ZIFA appoints Marian Marinica new Warriors head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "Zimbabwean mayoral candidate admits trying to rig Adelaide council election",
            "url": "https://www.newzimbabwe.com/zimbabwean-mayoral-candidate-admits-trying-to-rig-adelaide-council-election/",
            "content": "The Noticer\n\nAn Zimbabwean mayoral candidate, Jaison Midzi, has pleaded guilty to electoral fraud charges on the day he was set to go to trial for trying to rig anAdelaidecouncil election.\n\nMidzi, 44, from Seacombe Gardens, was arrested in July last year for providing fake ballot papers while running for Mayor in the City of Marion in 2022.\n\nOn Monday, he pleaded guilty to 10 counts of dishonestly exercise a vote at an election or poll under the Local Governments Act 1999, and another 16 counts were withdrawn,The Advertiserreported, despite maintaining his innocence for the past year.\n\nA day before polling in November 2022 the Electoral Commission of South Australia (ECSA) informed Marion Council candidates that it was investigating 490 returned declaration envelopes suspected of being submitted by the same people, and said it took action to ensure the integrity of the election.\n\nThe ECSA also investigated voting scams in West Torrens, and in the City of Adelaides Central Ward that led to that election being declared void in April after a court foundChinese councillor Jing Li was elected as a result of illegal practicesrelated to postal ballots involving foreign students. Li has not been accused of wrongdoing.\n\nMidzi, an immigrant and a former Citizen of the Year nominee, told reporters outside court not to misinform the public, and said he would comment further on the case after he was sentenced next month. He faces a maximum penalty of one year in jail or a $5,000 fine for each charge.\n\nHe also ran as an independent candidate in the seat of Gibson in the South Australian state election in March 2022, was elected Chairperson of the South Australia Zimbabwe Association in 2018, and ran as a City of Marion councillor in 2018.\n\nMidzi has made regular pro-diversity posts on social media, often weighs in on Zimbabwean and African politics, writing on X: One Africa is what we want. The borders came from your greedy Europeans.\n\nDuring the 2018 election he made a campaign video with a music group called the Diversity Music Collective, which included him dancing in front of the City of Marion council chambers and singing the lyrics thank you all for trusting me.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04162040/jaison-midzi.jpg",
            "description": "<p>The Noticer An Zimbabwean mayoral candidate, Jaison Midzi, has pleaded guilty to electoral fraud charges on the day he was set to go to trial for trying to rig an Adelaide council election. Midzi, 44, from Seacombe Gardens, was arrested in July last year for providing fake ballot papers while running for Mayor in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-mayoral-candidate-admits-trying-to-rig-adelaide-council-election/\">Zimbabwean mayoral candidate admits trying to rig Adelaide council election</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "5 minutes with the creator of Bad Influencer and Zimbabwean visionary Kudi Maradzika",
            "url": "https://www.newzimbabwe.com/5-minutes-with-the-creator-of-bad-influencer-and-zimbabwean-visionary-kudi-maradzika/",
            "content": "The Drum\n\nWho knew the illicit handbag trade was a dog-eat-dog world?\n\nYou either eat or get eaten.\n\nAll for the statement of a Birkin, Chanel or a Louis Vuitton handbag.\n\nTo an ordinary person, the frenzy is unnecessary, but in the influencer world, the handbag carries your worth and status in circles of power.\n\nIn the Bad Influencer series, we see how a single mother capitalises on the staged detoxification of this high life as she navigates climbing the ladder of the illicit trades under the microscope of a police officer she falls in love with.\n\nWith this intriguing story, the creator, Kudi Maradzika, wanted to capture the intersection of two worlds that she is intrigued by.\n\nInfluencer culture and the world of crime. The original concept always had influencers, crime and counterfeit bags at its core, although the story did evolve in development. Bad Influencer allowed me to explore these worlds with humour, social tension and emotional depth, while still having fun with the wildness of internet culture.\n\nShe tells Drum that she also wanted to interrogate how we measure value in a world where women dont have power or financial freedom.\n\nInfluence, beauty, wealth and success are often curated illusions, and chasing them without grounding can feel exhilarating but can be dangerous. That said, I also want audiences to laugh, reflect, and question the ladders we climb to attain power and social currency.\n\nLed by Jo-Anne Reyneke, Cindy Mahlangu and Thapelo Mokoena, the cast brings to life the female-driven crime story rooted in the belly of Johannesburg streets.\n\nArt plays in the hands of reality as the Zimbabwean producer also leads in various male-dominated creative spaces.Im redefining power on my own terms. Im taking up space, building ecosystems instead of waiting for permission, and creating opportunities for others as I climb. My responsibility is not just to tell stories, but to help create platforms and initiatives where African women can own, build and lead their creative futures.\n\nShe explains how she bridges storytelling across TV, comics and gaming.\n\nI build worlds first. The medium becomes an extension of the universe. Each platform deepens the audience experience and longevity of the intellectual property (IP). Africa doesnt yet have the full transmedia infrastructure, but thats also the opportunity. The goal is not just to make content from one IP, but also to build entire story universes with unique offerings at each product vertical, from video games to merchandise, to animation and film.\n\nIP is legacy. Its economic freedom. Its how we build generational wealth in storytelling, she adds.\n\nFrom as far back as she can remember, her imaginative mind has always bred stories itching to be told.\n\nAs a child, I would write my own version of Peter Rabbit stories, and later, Id write plays in high school. That instinct followed me into journalism, and eventually into film production and screenwriting. For me, storytelling has always been a way of making sense of human behaviour, power, identity, and possibility.\n\nHer upbringing between different cultures, countries and identities also turned her perspective into a muscle she could exercise from an early stage in her life.\n\nWith a background in journalism, I also learned to observe and question narratives early in my career. Id like to believe that my upbringing shaped my hunger, resilience, and belief in creating things that outlive me, whether thats a story world, a book, a platform, or a shift in how we imagine African stories.\n\nOver the years, the creative in her late 30s has been part of international fellowships and labs in which shes championed feminine power and ownership.\n\nNow with Bad Influencer out on Netflix, shes already on to the next project. Her new project is Artemis Elixa; she shares with Drum what its all about.\n\nArtemis Elixa is a pan-African sci-fi franchise about a brilliant engineer from the future who time-travels back to stop a rogue super-intelligence from taking over humanity. Each mission sends her across the continent, from Congos mineral frontlines to Nairobis tech corridors.\n\nWith each mission, she confronts power, exploitation, and the ethics of progress. Its an African answer to Lara Croft meets The Terminator, with a touch of Black Panther, grounded in our real-world trajectory of technology, geopolitics, and African innovation. Its part graphic novel, part game, part cinematic world. The comic will be launching in 2026, she concludes the conversation with Drum.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04164958/kudi-maradzika.jpg",
            "description": "<p>The Drum Who knew the illicit handbag trade was a dog-eat-dog world? You either eat or get eaten. All for the statement of a Birkin, Chanel or a Louis Vuitton handbag. To an ordinary person, the frenzy is unnecessary, but in the influencer world, the handbag carries your worth and status in circles of power.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/5-minutes-with-the-creator-of-bad-influencer-and-zimbabwean-visionary-kudi-maradzika/\">5 minutes with the creator of Bad Influencer and Zimbabwean visionary Kudi Maradzika</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        },
        {
            "title": "How much do Zimbabwean domestic workers really earn in South Africa?",
            "url": "https://www.newzimbabwe.com/how-much-do-zimbabwean-domestic-workers-really-earn-in-south-africa/",
            "content": "The South African\n\nFor the past few years, many Zimbabweans have continued to relocate to South Africa in search of greener pastures, and some have settled as domestic workers.\n\nThe question is how much do they earn as domestic workers in South Africa.\n\nA domestic worker is a person who works in a private household and is entitled to receive pay.Their workgenerally includes caring for members of a household, especially children.\n\nAccording to a recentLandscape Review of South Africas Care Economyreport, domestic work in South Africa is mostly informal.\n\nThe report notes that domestic workers account for about 6.5% of the workforce and nearly all are women.\n\nResults from a recent annual survey conducted bySweepSouth, an online platform for connecting home employees to homeowners, found that Zimbabwe has more domestic workers in South Africa.\n\nAccording to SweepSouth, majority of domestic workers respondents were women and between the ages of 26 and 41.\n\nThe nationality of respondents was split between South Africa (37%) and Zimbabwe (59%), with Malawi (3%), Lesotho (1%) and other nationalities making up the remainder, reads part of the survey.\n\nHome employees fall under national minimum (NMW) wage legislation, which entitles them to earn R28.79 per hour.\n\nHowever, according to the SweepSouth survey, most home employees average hourly earnings exceed the current national minimum wage.\n\nThe report states that there islittle variation by nationality. South African home employees getR36.64per hour and foreign nationals getR33.35 per hour.\n\nThe report states: However, when breaking down hourly rates by individual worker, we found that while the bulk of workers earn above minimum wage (54%), an alarmingly large number of workers earn less than the NMW (46%).\n\nOverall, whether Zimbabwean or not, home employees earn betweenR3 105andR5 242per month, according to the recent SweepSouth report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04163201/Domestic-worker.jpg",
            "description": "<p>The South African For the past few years, many Zimbabweans have continued to relocate to South Africa in search of greener pastures, and some have settled as domestic workers. The question is how much do they earn as domestic workers in South Africa. Understanding domestic workers in South Africa A domestic worker is a person</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-much-do-zimbabwean-domestic-workers-really-earn-in-south-africa/\">How much do Zimbabwean domestic workers really earn in South Africa?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "05 Nov 2025"
        }
    ]
}