{
    "news": [
        {
            "title": "Edson Sithole: New book uncovers the work of a thinker, lawyer and Zimbabwean freedom fighter who ‘disappeared’",
            "url": "https://www.newzimbabwe.com/edson-sithole-new-book-uncovers-the-work-of-a-thinker-lawyer-and-zimbabwean-freedom-fighter-who-disappeared/",
            "content": "The Conversation\n\nEdson Sitholewas born in what was then Southern Rhodesia in 1935. He was the first black person in southern Africa to obtain a Doctor of Laws degree. He was the second black person in the country (which became Zimbabwe in 1980) to qualify as a lawyer, and co-founded Rhodesias African Bar Association in 1973.\n\nSithole was an anti-colonial nationalist. He was disappeared alongside his secretary, Miriam Mhlanga, in downtown Salisbury (present-day Harare) 50 years ago. Brooks Marmon, a historian of Zimbabwes liberation struggle, has compiled and edited aforthcoming collectionof Sitholes writings, speeches and interviews.\n\nHe was one of the most prominent pan-African nationalists who had not gone into exile, a major legal and intellectual force behind multiple Zimbabwean liberation movements.\n\nDespite his important intellectual and organisational contributions to Zimbabwes independence struggle, he is best remembered today for the sensational nature of his elimination from the political scene. He left the Rhodesian press club at a downtown hotel in Salisbury on 15 October 1975, and was never seen again.\n\nThe 50th anniversary of Sitholes elimination is an apt time to recover his political voice. Sithole was a prolific writer but much of his work appeared in periodicals that were banned and silenced by settler authorities.\n\nThe contributions in the book highlight four themes: Sitholes views on pan-Africanism; his experience as a political prisoner; his views on intra-nationalist factionalism; and his search for a settlement with white Rhodesians.\n\nSitholes voice is supplemented by my own biographical account of his political life.\n\nGiven Zimbabwes struggles with political pluralism, the section on factionalism is especially illuminating. A recurring theme is Sitholes rivalry with one of the leading protagonists of Zimbabwes liberation struggle,Joshua Nkomo. Coupled with Sitholes overlooked membership in several breakaway liberation movements, a holistic view of his independent character emerges.\n\nThis was particularly notable in an era in which an absolute commitment to unity was a key facet of the defining ideology of the struggle,pan-Africanism.\n\nSithole was an executive member of four Zimbabwean liberation movements. In 1964 he became the publicity secretary of Zanu-PF, Zimbabwes current ruling party, then known as the Zimbabwe African National Union. He was that partys chief spokesperson 60 years ago this November when the colonys small white minorityunilaterally declared its independencefrom Britain.\n\nThe last decade of Sitholes life was spent trying to end this rebellion and usher in genuine independence under majority rule.\n\nWhen the Conservative British government appeared poised to reach a settlement favourable to continued white domination, Sithole co-founded the African National Council (ANC) in December 1971. Its opposition to the tentative accord forced the British government to abandon that effort to reconcile with their settler kith and kin in Rhodesia.\n\nWhite minority rule dragged on for eight more years and thousands lost their lives in the struggle to affect a change, including Sithole.\n\nSitholes intellectual profile was particularly impressive as he spent more than half of his adult life as a political prisoner. He was first detained in 1959 at the age of 23. He completed a masters degree in law from the University of London via correspondence during that first stint of restriction. During a second period of imprisonment, he completed most of his work toward a Doctor of Laws from the University of South Africa.\n\nIn April 1974, the hardline Estado Novo regime in Portugal was overthrown in amilitary coup. It soon became clear that Portugal would dismantle its colonial empire, including Mozambique and Angola.\n\nThis development transformed the political scene in southern Africa. White Rhodesia was deprived of a major European ally and a secure border on its eastern flank. At the end of that year, all four of Zimbabwes major liberation movements united under the banner of the African National Council in Zambia.\n\nFor some of the most prominent Zimbabwean nationalists, such as Nkomo and Robert Mugabe, the Portuguese revolution resulted in their release from prison, culminating in their ascent to political power in independent Zimbabwe in early 1980.\n\nSithole, however, experienced no fruits of dtente. Instead he became enmeshed in a political struggle with both the settler state and his erstwhile nationalist colleagues.\n\nIn early June 1975, intra African National Council violence erupted between factions loyal to its head, Abel Muzorewa, whom Sithole backed, and Nkomo, a long-time foe of Sithole, who had headed the Zimbabwe African Peoples Union.\n\nNearly a dozen people were killed and Sithole was manhandled by Nkomo loyalists.\n\nNear the end of the month, Sithole released a document which claimed that Nkomo and prime minister Ian Smith had reached a secret deal to elevate Nkomo to the head of the African National Council. Days later, Sithole developed severe stomach cramps. He declared that the settler statehad poisoned him, an allegation backed by a Zambian doctor who treated him.\n\nTensions increased. The last month of Sitholes life was consumed by attempts to derail any possible attempt by Nkomo and the Zapu element in the African National Council to reach an accord with the Rhodesian state.\n\nOn Sitholes last day as an independent man  15 October 1975  he held a press conference which accused the settler state of favouring Nkomo, whose faction had recently been allowed to hold a massive open-air meeting.\n\nTwo detectives visited Sithole at his office that afternoon and took a statement.\n\nThat evening, he made the short drive to the Ambassador Hotel in his blue BMW for drinks at the Quill Club.\n\nSithole left the hotel around 7pm, where a witness outside saw him met by two white and two black men who identified themselves as belonging to Rhodesias Special Branch. They escorted Sithole and his secretary into a grey Mazda van, a make typically associated with the renegade states security apparatus.\n\nInternational media accounts identified Detective Inspector Winston Hart and Detective Section Officer George Mitchell as the two white men. As recently as April 2023, an interview with Hart about his service in Rhodesiapopped up on YouTube.\n\nSithole was never seen again, although persistent rumours claimed that he had been seen in various government detention centres.\n\nSithole was just one of tens of thousands of individuals who died during Zimbabwes independence struggle.\n\nUnlike South Africa, Zimbabwe did not embrace any formal transitional justice mechanism following independence. After Mugabe was voted into power, he announced:\n\nWe will be interested to get some evidence as to what happened to Dr. Sithole. (16 March 1980 issue of the Zimbabwean Sunday Mail)\n\nNothing substantial ever came out of the inquiry.\n\nResearch Associate in the Department of Historical and Heritage Studies, University of Pretoria\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/04203121/edson-sithole.webp",
            "description": "<p>The Conversation Edson Sithole was born in what was then Southern Rhodesia in 1935. He was the first black person in southern Africa to obtain a Doctor of Laws degree. He was the second black person in the country (which became Zimbabwe in 1980) to qualify as a lawyer, and co-founded Rhodesia’s African Bar Association in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/edson-sithole-new-book-uncovers-the-work-of-a-thinker-lawyer-and-zimbabwean-freedom-fighter-who-disappeared/\">Edson Sithole: New book uncovers the work of a thinker, lawyer and Zimbabwean freedom fighter who ‘disappeared’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "07 Oct 2025"
        },
        {
            "title": "UNDP, government launch innovative zero-emission cooling system to tackle climate impacts",
            "url": "https://www.newzimbabwe.com/undp-government-launch-innovative-zero-emission-cooling-system-to-tackle-climate-impacts/",
            "content": "UNDP\n\nThe United Nations Development Programme (UNDP), in partnership with the Ministry of Environment, Climate and Wildlife; Ministry of Power and Energy Development; and Scientific and Industrial Research and Development Centre (SIRDC) today launched theLow Temperature Evaporative Cooling System (LTEIHT-AC) an innovative, zero-emission cooling technology designed to provide sustainable and affordable temperature control in Zimbabwes increasingly warming climate.\n\nDeveloped byPhokeng Global Health and Environmental Solutions, the Evaporative Cooling System leverages atmospheric enthalpy and water evaporation to produce cooling effects without relying on electricity or ozone-depleting refrigerants. Built using locally available materials, the system is both environmentally friendly and economically accessible, offering a scalable solution to Zimbabwes energy and climate resilience challenges.\n\nThis initiative represents a practical example of climate innovation in Zimbabwe  a solution that not only reduces greenhouse gas emissions but also empowers communities through local manufacturing and skills development, saidDr. Ayodele Odusola, UNDP Resident Representative. By investing in sustainable technologies like this, we are helping to ensure that no one is left behind in the transition to a greener, more resilient future.\n\nKey Highlights of the Event:\n\nTheEvaporative Cooling System Inception Meeting, held at UNDPs Harare offices, marked a significant milestone in Zimbabwes transition toward climate-resilient and energy-efficient technologies. The event brought together key stakeholders from government, academia, the private sector, and development partners to discuss the systems design, applications, and roadmap for national deployment.\n\nA highlight of the event was theformal introduction of the prototypefrom Phokeng Global Health and Environmental Solutions to the Scientific and Industrial Research and Development Centre (SIRDC), symbolizing the transition from design to institutional adoption and field testing. The technology will undergo pilot testing and performance monitoring in selected communities, with results informing wider national rollout.\n\nThe system directly supports the National Climate Change Policy (2017), the Energy Efficiency Policy (2024), and Zimbabwes Nationally Determined Contributions (NDC 3.0). It also contributes to the achievement of Sustainable Development Goals (SDGs) 7, 9, and 13, advancing access to clean energy, innovation, and climate action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07072932/undp-scaled.jpg",
            "description": "<p>UNDP The United Nations Development Programme (UNDP), in partnership with the Ministry of Environment, Climate and Wildlife; Ministry of Power and Energy Development; and Scientific and Industrial Research and Development Centre (SIRDC) today launched the Low Temperature Evaporative Cooling System (LTEIHT-AC) — an innovative, zero-emission cooling technology designed to provide sustainable and affordable temperature control in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/undp-government-launch-innovative-zero-emission-cooling-system-to-tackle-climate-impacts/\">UNDP, government launch innovative zero-emission cooling system to tackle climate impacts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "07 Oct 2025"
        },
        {
            "title": "Trump says chance of Gaza peace deal ‘really good’ as talks to continue in Egypt",
            "url": "https://www.newzimbabwe.com/trump-says-chance-of-gaza-peace-deal-really-good-as-talks-to-continue-in-egypt/",
            "content": "BBC\n\nIndirect talks aimed at reaching a final agreement on a US peace plan to end the war in Gaza are set to continue on Tuesday in the Egyptian city of Sharm El-Sheikh.\n\nPalestinian and Egyptian officials have told the BBC that the sessions are focused on creating the field conditions for a possible exchange that would see the release of all Israeli hostages in return for a number of Palestinian prisoners.\n\nIsraels prime minister said on Saturday that he hoped to announce the release of hostages in the coming days.\n\nAs the officials met on Monday, US President Donald Trump told reporters at the White House: We have a really good chance of making a deal, and itll be a lasting deal.\n\nHamas has said it agrees to the peace plan proposals in part, but has not responded to several key demands  including its disarmament andnot having any future role in the governance of Gaza.\n\nA senior Israeli security source said the talks initially would focus only on the release of hostages and give Hamas a few days to complete that phase.\n\nThe second day of thetalks, which will see Egyptian and Qatari officials holding shuttle meetings with delegations from both Israel and Hamas separately, will be taking place on the second anniversary of the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nThe Israeli military launched a campaign in Gaza in response. Since then, 67,160 have been killed by Israeli military operations in Gaza, including 18,000 children, according to the territorys Hamas-run health ministry.\n\nIn a statement commemorating the 7 October anniversary, United Nations Secretary-General Antonio Guterres said Trumps plan presents an opportunity that must be seized to bring this tragic conflict to an end.\n\nUK Prime Minister Sir Keir Starmer reiterated his support for the plan in his statement commemorating the anniversary, saying: We welcome the US initiative towards peace in the Middle East, and this government will do everything in our power to bring about the day where every child of Israel can live peacefully, alongside their Palestinian neighbours, in safety and security.\n\nThese discussions are expected to be among the most consequential since the start of the war and could determine whether a path toward ending the conflict is finally within reach.\n\nUS special envoy Steve Witkoff, Trumps son-in-law Jared Kushner and Qatari foreign minister Sheikh Mohammed bin Abdulrahman Al Thani are among those attending.\n\nTrump, writing on social media, has urged everyone involved in efforts to end the Gaza war to move fast and says he has been told the first phase of the peace plan  which includes the hostage release  should be completed this week.\n\nOn Monday, he told reporters at the White House that Hamas has been agreeing to things that are very important.\n\nI really think were going to have a deal, he added.\n\nA Palestinian official close to the negotiations told the Reuters news agency that the first session ended late Monday evening, and more talks were due to take place on Tuesday.\n\nState-affiliated Al-Qahera News also said talks would continue on Tuesday  and that the first day had ended amid a positive atmosphere.\n\nThe 20-point plan, which has been agreed upon by Trump and Israeli Prime Minister Benjamin Netanyahu, proposes an immediate end to fighting and the release of 48 hostages, only 20 of whom are thought to be alive, in exchange for hundreds of detained Gazans.\n\nThe plan stipulates that once both sides agree to the proposal full aid will be immediately sent into the Gaza Strip.\n\nIt also states that Hamas would have no role in governing Gaza, and it leaves the door open for an eventual Palestinian state.\n\nHowever, after the plan was announced publicly a week ago, Netanyahu reinstated his longstanding opposition to a Palestinian state, saying in a video statement: Its not written in the agreement. We said we would strongly oppose a Palestinian state.\n\nOn Friday,Hamas responded to the proposalin a statement, in which the groupagreed to release all Israeli prisoners, both living and dead, according to the exchange formula contained in Trumps proposal  if the proper conditions for the exchanges are met.\n\nIt did not specifically mention or accept Trumps 20-point plan but said it renews its agreement to hand over the administration of the Gaza Strip to a Palestinian body of independents (technocrats), based on Palestinian national consensus and Arab and Islamic support.\n\nThe statement made no mention of the demands that Hamas agree to its disarmament and to playing no further role in the governance of Gaza.\n\nIt added that the part of the proposals dealing with the future of Gaza and the rights of Palestinian people was still being discussed within a national framework, of which it said Hamas will be a part.\n\nMany Palestinians described Hamas response to the peace plan as unexpected, after days of indications that the group was preparing to reject or at least heavily condition its acceptance of Trumps peace plan proposal.\n\nInstead, Hamas refrained from including its traditional red lines in the official statement, a move many interpret as a sign of external pressure.\n\nEuropean and Middle Eastern leaders have welcomed the proposal. The Palestinian Authority (PA), which governs parts of the Israeli-occupied West Bank, has called the US presidents efforts sincere and determined.\n\nIran  which has been one of Hamass main sponsors for many years  has also now signalled its support for Trumps Gaza peace plan.\n\nIsraeli bombardment continued in several parts of the Gaza Strip on Monday ahead of the talks beginning.\n\nIsrael is carrying out an offensive in the city, which it has said is aimed at securing the release of the remaining hostages.\n\nMahmoud Basal, spokesman for Gazas Hamas-run civil defence, told the BBC that no aid trucks have been allowed into Gaza City since the offensive began four weeks ago.\n\nThere are still bodies we cannot retrieve from areas under Israeli control, he said.\n\nHundreds of thousands of Gaza City residents have been forced to flee after the Israeli military ordered evacuations to a designated humanitarian area in the south, but hundreds of thousands more are believed to have remained.\n\nIsraels defence minister has warned that those who stay during the offensive would be terrorists and supporters of terror.\n\nIn the last 24 hours, 21 Palestinians have been killed in Gaza and a further 96 injured, the Hamas-run health ministry said in its latest update.\n\nInternational journalists have been banned by Israel from entering the Gaza Strip independently since the start of the war, making verifying claims from both sides difficult.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07055500/gaza-city.webp",
            "description": "<p>BBC Indirect talks aimed at reaching a final agreement on a US peace plan to end the war in Gaza are set to continue on Tuesday in the Egyptian city of Sharm El-Sheikh. Palestinian and Egyptian officials have told the BBC that the sessions are focused on “creating the field conditions” for a possible exchange</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-says-chance-of-gaza-peace-deal-really-good-as-talks-to-continue-in-egypt/\">Trump says chance of Gaza peace deal ‘really good’ as talks to continue in Egypt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "07 Oct 2025"
        },
        {
            "title": "No talk of succession at Zanu PF conference – says Marapira, dismisses ongoing Chiwenga, Mnangagwa tussle for power",
            "url": "https://www.newzimbabwe.com/no-talk-of-succession-at-zanu-pf-conference-says-marapira-dismisses-ongoing-chiwenga-mnangagwa-tussle-for-power/",
            "content": "By Leopold Munhende\n\nTHERE will not be any discussions on President Emmerson Mnangagwas succession at the upcoming Zanu PF National Peoples conference, the partys Information and Publicity Director Farai Marapira has said.\n\nParty members, supporters and onlookers, intrigued by the ongoing tussle for power between Mnangagwa and his deputy Constantino Chiwenga, were expecting that the issue would be addressed at the upcoming conference to be held in Mutare.\n\nMnangagwas supporters are pushing for him to hang on beyond his constitutionally mandated two terms by extending his second one up to 2030.\n\nThose backing Chiwenga are against such a move and are silently working towards thwarting it and taking over before Mnangagwa hands power to his business partner and close associate, Kudakwashe Tagwirei, as is being pushed for by a considerable section of the party.\n\nSuccession is dealt with at congress; we are not going to congress, we have congress in 2027, we are going to a conference, said Marapira.\n\nThe issue of succession is not an issue within Zanu PF. Most of the purveyors of this succession issue are known not to be members of Zanu PF; they are known not to be within the structures of Zanu PF.\n\nAs Zanu PF, we will not allow a conversation to be imported into the party. We are going to a conference to check on the mandate which we received from the people in 2023.\n\nAlthough party slogans declaring that Mnangagwa will be in power up until 2030 appear to have been silenced, at provincial, district or cell meetings, they continue being chanted, even in the presence of party bigwigs such as Kazembe Kazembe and Owen Ncube in the Midlands Province.\n\nRecent Politburo meetings have been nothing short of explosive, with Chiwenga standing up to Mnangagwa and bringing dossiers to nail his allies and fear abounds that their tussle could result in another coup.\n\nChiwenga, then Commander of Zimbabwes military, led the 2017 coup that installed Mnangagwa as state leader. Although his influence in the army might have been diluted by his decision to join politics, there is fear that he has a lot of sympathisers within its ranks.\n\nMnangagwa has most of Zimbabwes cash-rich individuals, all of whom would be ready to defend his stay to protect their interests.\n\nAdded Marapira: The relationship between the President and his two Vice Presidents is friendly.\n\nAll this talk of animosity, hatred and fighting is a narrow agenda by other parties hoping to bring alarm and despondency within our rank and file.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/02060218/Farai-Marapira-1.jpg",
            "description": "<p>By Leopold Munhende THERE will not be any discussions on President Emmerson Mnangagwa’s succession at the upcoming Zanu PF National People’s conference, the party’s Information and Publicity Director Farai Marapira has said. Party members, supporters and onlookers, intrigued by the ongoing tussle for power between Mnangagwa and his deputy Constantino Chiwenga, were expecting that the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-talk-of-succession-at-zanu-pf-conference-says-marapira-dismisses-ongoing-chiwenga-mnangagwa-tussle-for-power/\">No talk of succession at Zanu PF conference – says Marapira, dismisses ongoing Chiwenga, Mnangagwa tussle for power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "07 Oct 2025"
        },
        {
            "title": "Chinese cement firm director jailed for defying court order in Hurungwe land dispute",
            "url": "https://www.newzimbabwe.com/chinese-cement-firm-director-jailed-for-defying-court-order-in-hurungwe-land-dispute/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Philda Muzofa has found executives of Wih-Zim Construction Material Investments in contempt of court for defying a previous order to halt construction of a cement manufacturing plant in Magunje, Hurungwe.\n\nIn a recent judgment delivered in Chinhoyi, Justice Muzofa ordered the immediate halt of all works at the controversial site, ruling that the company and its director had acted in flagrant disregard of a court order issued on February 4, 2025.\n\nThe application for contempt of court be and is hereby granted, Justice Muzofa ruled. The first and second respondents (Labenmon Investments and the director Daniel Mlalazi) and are hereby found to be in contempt of this courts provisional order issued under Case Number HCCC15/25.\n\nShe further directed that the respondents are hereby ordered to immediately stop all works at the Wih-Zim Construction Material Investments Cement Manufacturing plant in Magunje, Hurungwe until the matter under HCCC15/25 is finalised.\n\nThe first respondent was fined US$3,000 payable within one month, while Mlalazi was sentenced to 30 days imprisonment, wholly suspended on condition that the company complies with the court order.\n\nMuzofas ruling comes after villagers from Kapere and Chasara under Ward 11 in Hurungwe, represented by Zimbabwe Lawyers for Human Rights (ZLHR) lawyers Tinashe Chinopfukutwa and Kelvin Kabaya, challenged the setting up of the cement plant, saying it was encroaching on their grazing and farming land.\n\nAccording to the villagers, the Chinese firm Labenmon Investments, which is linked to Wih-Zim, arrived in July 2024 and began fencing off the land without consultation.\n\nThe villagers later learnt that Labenmon Investments was going to establish a cement manufacturing plant on the pegged area, and they were prohibited from accessing their grazing fields and farming land, ZLHR said in a statement.\n\nThe lawyers argued that the Environmental Management Agency (EMA) erred in law by issuing an Environmental Impact Assessment (EIA) certificate to Labenmon Investments without receiving or properly evaluating the companys EIA report  a violation of sections 100(1) and 100(2) of the Environmental Management Act.\n\nThe Director-General of EMA violated the principles of natural justice as espoused in section 136 by failing to consult the appellants who are affected by the proposed cement manufacturing plant and giving them an opportunity to be heard, the lawyers said.\n\nThey further contended that the Director-General of EMA failed to exercise his powers by not inviting the developers and affected villagers to a consultative meeting as required by law.\n\nAbout 23 families are reportedly affected by the project, which has sparked outrage in the rural community for displacing farmers and cutting off access to communal grazing land.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Philda Muzofa has found executives of Wih-Zim Construction Material Investments in contempt of court for defying a previous order to halt construction of a cement manufacturing plant in Magunje, Hurungwe. In a recent judgment delivered in Chinhoyi, Justice Muzofa ordered the immediate halt of all works at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-cement-firm-director-jailed-for-defying-court-order-in-hurungwe-land-dispute/\">Chinese cement firm director jailed for defying court order in Hurungwe land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "07 Oct 2025"
        },
        {
            "title": "Warriors begin preparations in Durban as Bafana Bafana suffer key injury blow",
            "url": "https://www.newzimbabwe.com/warriors-begin-preparations-in-durban-as-bafana-bafana-suffer-key-injury-blow/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens national football team held its first training session in Durban on Monday afternoon ahead of Fridays FIFA World Cup Qualifier against South Africa at Moses Mabhida Stadium.\n\nThe session included both locally based and South Africa-based players, who make up the majority of the squad. Team captain Marvellous Nakamba, who plies his trade in England, joined camp later in the evening, while other European-based players are expected to arrive on Tuesday morning.\n\nThe clash carries more than just qualification hopes; national pride and regional bragging rights are also at stake in this long-standing rivalry.\n\nZimbabwe, who sit bottom of Group C with four points, are already out of contention for World Cup qualification, while South Africa remain in the hunt, sitting second with 13 points, nine ahead of the Warriors.\n\nMeanwhile, Bafana Bafana have suffered a major setback after key player Relebohile Mofokeng was ruled out due to injury.\n\nSpeaking at a press conference on Monday, South Africa coach Hugo Broos confirmed that Kaizer Chiefs midfielder Mduduzi Shabalala has been called up as Mofokengs replacement.\n\nWe replaced him with Shabalala. Second, there are two players who have not arrived because they played yesterday , thats (Lyle) Foster and (Sphephelo) Sithole. They will arrive tomorrow (Tuesday) morning, and in the afternoon, we will be complete, said Broos.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07045718/warriors-durban.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s national football team held its first training session in Durban on Monday afternoon ahead of Friday’s FIFA World Cup Qualifier against South Africa at Moses Mabhida Stadium. The session included both locally based and South Africa-based players, who make up the majority of the squad. Team captain Marvellous</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-begin-preparations-in-durban-as-bafana-bafana-suffer-key-injury-blow/\">Warriors begin preparations in Durban as Bafana Bafana suffer key injury blow</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "07 Oct 2025"
        }
    ]
}