{
    "news": [
        {
            "title": "Eastern Region Division One League Pacific Storm sponsorship deal launch set for month-end",
            "url": "https://www.newzimbabwe.com/eastern-region-division-one-league-pacific-storm-sponsorship-deal-launch-set-for-month-end/",
            "content": "By Staff Reporter\n\nDETAILS of the Zimbabwe Football Association (ZIFA) Eastern Region Division One Leagues Pacific Storm sponsorship will be shared on March 29 at Mucheke Stadium in Masvingo, NewZimbabwe.com has learnt.\n\nDespite having confirmed the deal, the Eastern Region administration is yet to share details on prize money and how much will be set aside for the leagues marketing.\n\nThis will be the first title sponsor of the regional league that stretches from Marondera, the whole breadth of Manicaland and Masvingo provinces.\n\nThe launch has been set for March 29 in Masvingo and that is where details will be officially divulged, said a source close to developments.\n\nWithout confirming the event, Eastern Region Soccer League Chairperson Wisdom Simba said: This is a monumental step for us as the deal will also focus, beyond the core package, on branding and marketing of the league. We cannot currently share details of its worth.\n\nPacific Storm Marketing Manager Kudakwashe Chiutsi said the sponsorship was part of their corporate social responsibility (CSR) and a continuation of the organisations longstanding support for local football.\n\nMuch recently, the cigarette brand was principal sponsor of 2024 Castle Lager premiership champions Simba Bhora where it poured in half a million US dollars.\n\nIn the mid-2000s, Pacific Storm financed Zimbabwean giants Dynamos and Highlanders in a deal that was in the tens of millions, then in Zimbabwean dollars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/18033126/football_net.jpg",
            "description": "<p>By Staff Reporter DETAILS of the Zimbabwe Football Association (ZIFA) Eastern Region Division One League’s Pacific Storm sponsorship will be shared on March 29 at Mucheke Stadium in Masvingo, NewZimbabwe.com has learnt. Despite having confirmed the deal, the Eastern Region administration is yet to share details on prize money and how much will be set</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eastern-region-division-one-league-pacific-storm-sponsorship-deal-launch-set-for-month-end/\">Eastern Region Division One League Pacific Storm sponsorship deal launch set for month-end</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Women’s lobby group petitions Parliament over lapsed National Gender Policy",
            "url": "https://www.newzimbabwe.com/womens-lobby-group-petitions-parliament-over-lapsed-national-gender-policy/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) has petitioned Parliament on the need to enact a relevant National Gender Policy following the expiry of the previous blueprint back in 2022.\n\nThe policy is a government framework that outlines strategies and actions to achieve gender equality and equity, ensuring that both men and women benefit equally from development and participate fully in all aspects of society.\n\nAfter its lapse in 2022, Zimbabwe has not yet enacted another policy blueprint to dictate the way forward in attaining gender-based goals for the country.\n\nSpeaking to NewZimbabwe.com shortly after filing a petition at the Parliament of Zimbabwe, EJWP Executive Director, Margaret Mutsamvi said the gender policy is an important instrument for promoting gender equality in all spheres of society to include employment, health, education and political representation.\n\nAt the moment so many strategies, Bills and policies are being developed and without incorporating the gender policy, may overlook the significance of being gender- responsive and inclusive meaning women are missing out on the ongoing development gains since its expiration. See why its urgent? she said.\n\nShe noted that petitioning Parliament was inspired by the realisation that they are the lawmakers with the mandate to propose, draft or vote for laws with authority to summon hearings, investigate issues and monitor the full implementation of laws and the respective financing of such.\n\nMutsamvi said parliamentary officials, who received the petition on behalf of the Clerk of Parliament said we would get a response on the matter in three weeks.\n\nIn the meantime, we are having a parallel online campaign, building awareness amongst other women groups on why the gender policy is key in our everyday work in empowering women and towards gender justice.\n\nAs we celebrate the Womens Month, at every opportunity we get, we highlight why the gender policy is critical at the moment and the opportunity costs. We primarily seek to engage all relevant stakeholders through any means to push for this urgent request, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16025444/Margaret-Mutsamvi.webp",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) has petitioned Parliament on the need to enact a relevant National Gender Policy following the expiry of the previous blueprint back in 2022. The policy is a government framework that outlines strategies and actions to achieve gender equality and equity, ensuring that both men and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/womens-lobby-group-petitions-parliament-over-lapsed-national-gender-policy/\">Women’s lobby group petitions Parliament over lapsed National Gender Policy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Expelled SA Ambassador to the United States Ebrahim Rasool given 72 hours to leave",
            "url": "https://www.newzimbabwe.com/expelled-sa-ambassador-to-the-us-ebrahim-rasool-given-72-hours-to-leave/",
            "content": "By News24\n\nTHE US has given the expelled Ambassador to the United States, Ebrahim Rasool, 72 hours to leave.\n\nRasool was expelled on Friday following comments he made during a webinar.\n\nPretoria is making arrangements for his return as well as appointing a replacement.\n\nChrispin Phiri, spokesperson for International Relations and Cooperation Minister Ronald Lamola, confirmed to News24 that Pretoria was arranging to have him back very soon.\n\nOnce in South Africa, Rasool will be expected to debrief Pretoria.\n\nPhiri said Pretoria had received official confirmation from the SA mission in the US late on Friday night that Rasool had been expelled.\n\nRasool, who returned to Washington as SAs ambassador in December, was expelled by US Secretary of State Marco Rubio.\n\nRasool had also previously served as US ambassador from 2010 to 2015, when Barack Obama was the president.\n\nRubio wrote in a post on X that Rasool is no longer welcome in our great country, and that the US now considers him persona non grata.\n\nRasools expulsion stemmed from comments he made while addressing a webinar facilitated by the think-tank, Mapungubwe Institute for Strategic Reflection.\n\nAmong other things, he accused US President Donald Trumps administration of supremacism.\n\nSpeaking to News24 on Saturday, Phiri said: Ambassador Rasool has 72 hours to leave the United States and hence we are facilitating his return.\n\nHe added: And then, from there, Pretoria will assess the next steps that need to be done and attend to replace him.\n\nPhiri said Rasools expulsion was regrettable as there had been positive developments between the two countries  and the process to expel him had, to some extent, scuttled those.\n\nNonetheless, we are determined to ensure that our relationship with the United States not only remains mutually respectful, but mutually beneficial.\n\nSo ensuring that we have a very capable and able replacement for our Ambassador Rasool is critical And also with someone who carries the full authority of the South African government, he said, adding that it was important for Pretoria to ensure it continued engagements with Washington.\n\nHe also said the correct diplomatic channel would have been for the US to rather have Rasool understand the context in which he made his remarks at the webinar before making any decision. However, the US chose not to follow that process.\n\nTheyve gone through another process rather than just declaring our Ambassador PNG [persona non grata]. So thats the route that they have chosen, and we will have to respect the decision as a sovereign state, said Phiri.\n\nMeanwhile, speaking to the SABC on Saturday, Lamola said the expulsion of Rasool was an unprecedented, regrettable decision by the US as it was not done via normal diplomatic relations.\n\nIt is also regrettable because he was at a very advanced stage to prepare for the special envoys, to reset the relations and so forth. But we are now where we are we have to work with what we have, and that is what we will continue to do because we believe the relationship between the two countries is mutually beneficial, it is strategic, and it has to be maintained.\n\nLamola added: We need to find time to engage with each other behind closed doors, where the US can raise their concerns with us, and we can also raise our concerns with them because it is not helpful to engage in megaphone and Twitter diplomacy. But we have to engage each other face-to-face on various issues of mutual concern.\n\nHe said South Africa would continue to engage and open the lines of diplomatic engagements with the US.\n\nLamola said it was unfortunate the Trump administration had taken the route of engaging in tweets, adding that this was not helpful in mending the relationship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/16024317/b5797c971e4a4dcf902615151673150c.jpg",
            "description": "<p>By News24 THE US has given the expelled Ambassador to the United States, Ebrahim Rasool, 72 hours to leave. Rasool was expelled on Friday following comments he made during a webinar. Pretoria is making arrangements for his return as well as appointing a replacement. Chrispin Phiri, spokesperson for International Relations and Cooperation Minister Ronald Lamola,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/expelled-sa-ambassador-to-the-us-ebrahim-rasool-given-72-hours-to-leave/\">Expelled SA Ambassador to the United States Ebrahim Rasool given 72 hours to leave</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "‘Zimbabwe’s maternal, neonatal deaths unacceptably high’, says Health and Child Care official",
            "url": "https://www.newzimbabwe.com/zimbabwes-maternal-neonatal-deaths-unacceptably-high-says-health-and-child-care-official/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEs pregnant women and newborn babies remain at risk as the country is grappling with unacceptably high maternal and neonatal deaths, Health and Child Care minister has revealed.\n\nThis is expected to get worse as international donors like the UKAID, which helps over two million women and babies access essential maternal and neonatal healthcare, recently announced a significant budget cut to its international assistance.\n\nThe countrys health sector is generally poorly funded and relies heavily on the benevolence of Western development partners.\n\nAddressing a press conference Friday on his ministrys achievements, Health and Child Care Minister Douglas Mombeshora revealed that despite a notable reduction in under five mortality rate institutional maternal and neonatal deaths remain high.\n\nMombeshora did not share the statistics related to the neonatal and maternal deaths.\n\nThe life expectancy at birth increased from 61 years to an average of 65 and to as high as 68 years for women.\n\nMaternal and under five mortality rates have been on a declining trend since 2010. For instance, the maternal mortality declined from 525 maternal deaths per 100,000 live births in 2012 to 363/100,000 live births in 2022 according to the Zimbabwe Population Census Report.\n\nThe under-five mortality rate decreased to 39.8 deaths per 1,000 live births. However, institutional maternal and neonatal deaths are still unacceptably high, Mombeshora said.\n\nRecently, the deputy Minister of Health and Childcare, Sleiman Kwidini, told Parliament that nearly 300 infants and 54 women died due to complications during childbirth in January 2025 alone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/14204714/Pregnant.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE’s pregnant women and newborn babies remain at risk as the country is grappling with unacceptably high maternal and neonatal deaths, Health and Child Care minister has revealed. This is expected to get worse as international donors like the UKAID, which helps over two million women and babies access essential maternal and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-maternal-neonatal-deaths-unacceptably-high-says-health-and-child-care-official/\">‘Zimbabwe’s maternal, neonatal deaths unacceptably high’, says Health and Child Care official</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Journalist Blessed Mhlanga, political activists’ arrests will ‘send Zimbabwe back to the dark ages’, warns Human Rights Commission",
            "url": "https://www.newzimbabwe.com/journalist-blessed-mhlanga-political-activists-arrest-will-send-zimbabwe-back-to-the-dark-ages-warns-human-rights-commission/",
            "content": "By Costa Nkomo\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has cautioned the Government of Zimbabwe (GoZ) that the arrest of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, alongside other political activists, threatens to drag the nation back to its dark ages, jeopardising its standing in the international community.\n\nZimbabwe at one point was branded a pariah State due to rising cases of rights violations.\n\nIn a statement released Friday, the commission warned that the recent arrests of Mhlanga and several other activists are leaving an indelible stain on Zimbabwes justice system, which is frequently accused of being a mere puppet on a string, manipulated by the ruling Zanu PF party.\n\nThe ZHRC is, however, deeply concerned by the arrests of journalists and human rights defenders, particularly in cases where heightened political interests are at stake.\n\nThe Commission has noted with concern that such political interests often muddy the waters of the justice delivery process and procedures, frequently at the expense of the accuseds rights.\n\nThis also detracts from the positive progress Zimbabwe has generally made in upholding fundamental rights and freedoms, the statement read.\n\nThe Commission further reminded the GoZ of its obligations under the national Constitution, as well as various international and regional instruments to which Zimbabwe is a signatory, regarding freedom of expression, association, and assembly.\n\nThe right to freedom of opinion and expression is guaranteed by the Universal Declaration of Human Rights, the International Covenant on Civil and Political Rights  on which Zimbabwe recently presented a report to the United Nations Human Rights Council in Geneva  and by the African Charter on Human and Peoples Rights.\n\nThe ZHRC further reminds the GoZ of UN resolutions on the treatment of journalists, including the Human Rights Council Resolution HRC/RES/21/12 on the safety of journalists, the statement continued.\n\nThe Commission also asserted that every individual has the right to share and debate even politically sensitive issues without fear of reprisal.\n\nThe ZHRC reminds everyone that it is acceptable to openly share views and debate even sensitive political issues, such as the current debate on the amendment of the Constitution to extend presidential terms to 2030 or beyond.\n\nEvery person in Zimbabwe has a right to express their views without fear of persecution or reprisal on this or any other matter and seek to persuade others in a peaceful manner, the statement declared.\n\nThe Commission did, however, commend the Zimbabwe Republic Police (ZRP) for treating Mhlanga with dignity, even though the court heard two weeks ago that he was forced to sleep in a filthy police cell, a fate not fit for a dog, let alone a human being.\n\nMhlanga was arrested on 24 February 2025 after turning himself in to the police, who had publicly sought his whereabouts.\n\nThe charge of inciting public violence stems from HSTVs broadcast of explosive press briefings given by expelled Zanu-PF Central Committee member Blessed Geza, in which Geza called for President Emmerson Mnangagwa to resign.\n\nHe was charged with transmitting messages with intent to incite public violence or damage to property under Section 164 of the Criminal (Codification and Reform) Act.\n\nMhlanga was denied bail by the Harare Magistrate Court, and his bail appeal at the High Court has been shelved indefinitely. He remains in custody at Harare Remand Prison.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Costa Nkomo THE Zimbabwe Human Rights Commission (ZHRC) has cautioned the Government of Zimbabwe (GoZ) that the arrest of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, alongside other political activists, threatens to drag the nation back to its dark ages, jeopardising its standing in the international community. Zimbabwe at one point was branded a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-blessed-mhlanga-political-activists-arrest-will-send-zimbabwe-back-to-the-dark-ages-warns-human-rights-commission/\">Journalist Blessed Mhlanga, political activists’ arrests will ‘send Zimbabwe back to the dark ages’, warns Human Rights Commission</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Zimbabwe among 43 countries on Trump’s draft list for new U.S travel ban",
            "url": "https://www.newzimbabwe.com/zimbabwe-among-43-countries-on-trumps-draft-list-for-new-u-s-travel-ban/",
            "content": "By The New York Times\n\nA DRAFT circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States.\n\nThe most stringent restriction level would flatly bar citizens from 11 countries from entering the United States.\n\nThe Trump administration is considering targeting the citizens of as many as 43 countries as part of a new ban on travel to the United States that would be broader than the restrictions imposed during President Trumps first term, according to officials familiar with the matter.\n\nA draft list of recommendations developed by diplomatic and security officials suggests a red list of 11 countries whose citizens would be flatly barred from entering the United States. They are Afghanistan, Bhutan, Cuba, Iran, Libya, North Korea, Somalia, Sudan, Syria, Venezuela and Yemen, the officials said.\n\nDraft List of Proposed Travel Ban Countries\n\nAn internal Trump administration proposal lists the following countries whose citizens could face restrictions on entering the U.S. Some countries may change in any final order.\n\nRed\n\nAll travel banned\n\nOrange\n\nVisas sharply restricted\n\nYellow\n\n60 days to address concerns\n\nThe officials, who spoke on the condition of anonymity to discuss the sensitive internal deliberations, cautioned that the list had been developed by the State Department several weeks ago, and that changes were likely by the time it reached the White House.\n\nOfficials at embassies and in regional bureaus at the State Department, and security specialists at other departments and intelligence agencies, have been reviewing the draft. They are providing comment about whether descriptions of deficiencies in particular countries are accurate or whether there are policy reasons  like not risking disruption to cooperation on some other priority  to reconsider including some.\n\nThe draft proposal also included an orange list of 10 countries for which travel would be restricted but not cut off. In those cases, affluent business travelers might be allowed to enter, but not people traveling on immigrant or tourist visas.\n\nCitizens on that list would also be subjected to mandatory in-person interviews in order to receive a visa. It included Belarus, Eritrea, Haiti, Laos, Myanmar, Pakistan, Russia, Sierra Leone, South Sudan and Turkmenistan.\n\nWhen he took office on Jan. 20, Mr. Trump issued an executive order requiring the State Department to identify countries for which vetting and screening information is so deficient as to warrant a partial or full suspension on the admission of nationals from those countries.\n\nHe gave the department 60 days to finish a report for the White House with that list, meaning it is due next week. The State Departments Bureau of Consular Affairs has taken the lead, and the order said the Justice and Homeland Security Departments and the Office of the Director of National Intelligence were to assist with the effort.\n\nSpokespeople at several agencies declined to comment or did not respond to a request for comment. But the State Department previously said it was following Mr. Trumps order and was committed to protecting our nation and its citizens by upholding the highest standards of national security and public safety through our visa process, while declining to specifically discuss internal deliberations.\n\nThe Times and other news outlets reported this month that Afghanistan, which was not part of Mr. Trumps first-term travel bans but fell to the Taliban when the U.S. withdrew its forces in 2021, was likely to be part of the second-term ban. But the other countries under consideration had been unclear.\n\nIt is also not clear whether people with existing visas would be exempted from the ban, or if their visas would be canceled. Nor is it clear whether the administration intends to exempt existing green card holders, who are already approved for lawful permanent residency.\n\nThe Trump administration this past week said it had canceled the green card of a Syrian-born former Columbia University graduate student of Palestinian descent, Mahmoud Khalil, because he had led high-profile campus protests against Israels war in Gaza that the government says were antisemitic, setting off a court fight over the legality of that move.\n\nSome of the countries on the draft red and orange lists were sanctioned by Mr. Trump in his first-term travel bans, but many are new. Some share characteristics with the earlier lists  they are generally Muslim-majority or otherwise nonwhite, poor and have governments that are considered weak or corrupt.\n\nBut the reason several others were included was not immediately clear. Bhutan, for example, was proposed for an absolute ban on entry. The small Buddhist and Hindu country is sandwiched between China and India, neither of which were on any of the draft lists.\n\nThe proposal to sharply restrict, if not outright ban, visitors from Russia raises a different issue. While the Russian government has a reputation for corruption, Mr. Trump has been trying to reorient U.S. foreign policy in a more Russia-friendly direction.\n\nA decision to include Venezuela could also disrupt a nascent thaw in relations that has been useful to Mr. Trumps separate efforts to deport undocumented migrants.\n\nThe proposal also includes a draft yellow list of 22 countries that would be given 60 days to clear up perceived deficiencies, with the threat of being moved onto one of the other lists if they did not comply.\n\nSuch issues could include failing to share with the United States information about incoming travelers, purportedly inadequate security practices for issuing passports, or the selling of citizenship to people from banned countries, which could serve as a loophole around the restrictions.\n\nThat list, the officials said, included Angola, Antigua and Barbuda, Benin, Burkina Faso, Cambodia, Cameroon, Cape Verde, Chad, the Republic of Congo, the Democratic Republic of Congo, Dominica, Equatorial Guinea, Gambia, Liberia, Malawi, Mali, Mauritania, St. Kitts and Nevis, St. Lucia, So Tom and Prncipe, Vanuatu and Zimbabwe.\n\nDuring Mr. Trumps first term, courts blocked the government from enforcing the first two versions of his travel ban, but the Supreme Court eventually permitted a rewritten ban  one that banned citizens from eight nations, six of them predominantly Muslim  to take effect. The list later evolved.\n\nSoon after he became president in January 2021, Joseph R. Biden Jr. issued a proclamation revoking Mr. Trumps travel bans, calling them a stain on our national conscience and inconsistent with our long history of welcoming people of all faiths and no faith at all.\n\nMr. Trumps executive order in January said he would revive the bans in order to protect American citizens from aliens who intend to commit terrorist attacks, threaten our national security, espouse hateful ideology or otherwise exploit the immigration laws for malevolent purposes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/10155043/Donald-Trump1.jpg",
            "description": "<p>By The New York Times A DRAFT circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States. The most stringent restriction level would flatly bar citizens from 11 countries from entering the United States. The Trump administration is considering targeting the citizens of as many as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-among-43-countries-on-trumps-draft-list-for-new-u-s-travel-ban/\">Zimbabwe among 43 countries on Trump’s draft list for new U.S travel ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Motorist robbed of handbag containing US$14,100",
            "url": "https://www.newzimbabwe.com/motorist-robbed-of-handbag-containing-us14100/",
            "content": "By Staff Reporter\n\nA THREE-man robbery gang this Friday pounced on a motorist in Mvurwi, Mashonaland Central, smashed the vehicles windshield before snatching a handbag containing US$14,100.\n\nThe Zimbabwe Republic Police (ZRP) confirmed the incident, which is now underinvestigation.\n\nThe ZRP is investigating a case of robbery which occurred in Mvurwi on March 14, 2025, said ZRP national spokesperson, Commissioner Paul Nyathi.\n\nThree suspects who were travelling in a black Toyota Probox vehicle, intercepted the complainant who was travelling in a Honda Fit Hybrid vehicle along GMB Road near Mbizi location Turn-off, Mvurwi.\n\nThe suspects smashed the complainants vehicle before taking a handbag which contained US$14,100 cash, Ecocash Debit Card and Innbucks Visa card.\n\nZRP appealed to anyone with information that may lead to the arrest of the suspects to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/26064246/US-dollars.jpg",
            "description": "<p>By Staff Reporter  A THREE-man robbery gang this Friday pounced on a motorist in Mvurwi, Mashonaland Central, smashed the vehicle’s windshield before snatching a handbag containing US$14,100. The Zimbabwe Republic Police (ZRP) confirmed the incident, which is now under investigation. “The ZRP is investigating a case of robbery which occurred in Mvurwi on March 14, 2025,”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-robbed-of-handbag-containing-us14100/\">Motorist robbed of handbag containing US$14,100</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Trio steals US$25,000, spends loot on Honda Fit, iPhones",
            "url": "https://www.newzimbabwe.com/trio-steals-us25000-spend-loot-on-honda-fit-iphones/",
            "content": "By Staff Reporter\n\nA MUTARE trio, including two 16-year-olds, has been arrested for stealing US$25,000 which they used to buy a motor vehicle and high-end smartphones.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms the arrest of Munyararadzi Madzure (39) and two juveniles (16) in connection with a case of theft which occurred in Chikanga, Mutare on March 14, 2025, Nyathi said.\n\nThe suspects allegedly stole US$25 000 cash from the complainant and used the money to buy a Honda Fit vehicle and three iPhones.\n\nThe police have since recovered the motor vehicle and cell phones.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/17163132/Honda-Fit.jpg",
            "description": "<p>By Staff Reporter  A MUTARE trio, including two 16-year-olds, has been arrested for stealing US$25,000 which they used to buy a motor vehicle and high-end smartphones. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms the arrest of Munyararadzi Madzure (39) and two juveniles (16) in connection with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trio-steals-us25000-spend-loot-on-honda-fit-iphones/\">Trio steals US$25,000, spends loot on Honda Fit, iPhones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "Former deputy minister ups freedom bid as trial resumes",
            "url": "https://www.newzimbabwe.com/former-deputy-minister-ups-freedom-bid-as-trial-resumes/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro believes his political rivals fabricated allegations that he illegally siphoned vegetable seeds on the guise of distributing them to the needy in his Mbire constituency.\n\nIt is alleged Karoro received 5 000 vegetable combo kits from Valley Seed Private Limited, which were to be handed over to Grain Marketing Board (GMB) Mushumbi under the Presidential Input Programme but converted the seed to his own use.\n\nAs his trial continues, Karoro has maintained his innocence saying he is a victim of name-dropping by actual thieves of the inputs.\n\nHe said his political foes were determined to have him lose his parliamentary seat in Mbire by raising false allegations.\n\nThe trial continued with a State witness Tichaona Maponga telling Regional Magistrate Taurai Manuwere that he cannot say it was Karoro who collected the combo seeds because he was not there.\n\nThe seeds were dispatched by a temporary worker unknown to him because they hire new people every season, he said.\n\nMaponga said he has no evidence to show that the deputy minister phoned him regarding the seeds.\n\nKaroros lawyer Admire Rubaya has challenged all documents being attributed to him saying they could have been doctored.\n\nThis came after the State produced a delivery note inscribed D.Karoro, which they said referred to the deputy minister.\n\nIt could have been another person being referred to adding that there are many people with such initials, Rubaya said.\n\nThe State witness, Tichaona Maponga who is in charge at the depot told the court that he cannot corroborate the allegation that Karoro collected the seed at the depot because he was not on the ground.\n\nHe said it was not conclusive to say it his him being referred to as D.Karoro after the lawyer suggested it could have been a Dhuvai or a Doto Karoro.\n\nMaponga also denied being the author of a delivery note that was produced in court stating that they hire seasonal employees who could have signed the seeds out.\n\nThe matter will continue on April 4.\n\nIt is alleged Karoro received 5 000 vegetable combo kits from Valley Seed Private Limited which were to be handed over to GMB Mushumbi under the Presidential Input Programme but converted the seed to their own use.\n\nIt is alleged that acting in connivance with one Ngowe, they ordered the GMB Mushumbi inputs clerk, Honesty Nyathi and security guard, Manyara Manuwere to fraudulently book the consignment in the goods received voucher, goods dispatch voucher, gate book and stack register to appear as if the consignment had been received and despatched to Karoro, prejudicing GMB of US$25 000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro believes his political rivals fabricated allegations that he illegally siphoned vegetable seeds on the guise of distributing them to the needy in his Mbire constituency. It is alleged Karoro received 5 000 vegetable combo kits from Valley Seed Private Limited, which were to be handed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-deputy-minister-ups-freedom-bid-as-trial-resumes/\">Former deputy minister ups freedom bid as trial resumes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        },
        {
            "title": "ZMC Executive Secretary Phiri in court over fuel scandal",
            "url": "https://www.newzimbabwe.com/zmc-executive-secretary-phiri-in-court-over-fuel-scandal/",
            "content": "By Staff Reporter\n\nZIMBABWE Media Commission (ZMC) Executive Secretary Godwin Phiri Friday appeared in court charged with fraud after he allegedly misappropriated fuel worth millions of dollars.\n\nPhiri appeared before Harare Magistrate Marewanazvo Gofa jointly charged with other ZMC officials Tafadzwa Chikwiti an accountant, Revai Madire and administrator Mercy Hondo.\n\nThey are facing two fraud counts. The four were not asked to plead and were all remanded out of custody on US$600 bail each. They will be back in court on April 28 for routine remand.\n\nAppearing for the State, Lancelot Mutsokoti alleged that alleged that during the period extending from May 2023 to February 2024 and on diverse occasions, the accused acting in connivance with Petros Mudhokwani, still at large, hatched a plan to steal from the commission.\n\nPursuant of their plan, Mudhokwani allegedly raised requisitions for the purchase of fuel from PetroTrade, and Chikwiti uploaded the requisition on an online procurement platform, which was adopted by the commission known as the Systems Application and Products (SAP).\n\nSecretary approved the release of funds for the purchase of the coupons. Tawanda Hlomai, who is also still at large, collected 104 976 litres of fuel from PetroTrade in form of coupons and four issued goods received vouchers purporting that all the fuel had been received by the commission, when in actual fact, only 45 120 litres of fuel were recorded.\n\nThough the misrepresentation the accused defrauded the commission of 59 856 litres of fuel and the complainant suffered a prejudice of ZWL 54 836 704, 95 and nothing was recovered, the court heard.\n\nOn the second account, the accused persons also used the same method to defraud their employer and Phiri approved the release of another ZWL51 million into various accounts and collected proceeds in foreign currency.\n\nThe offence came to light when an audit was carried out and the complainant reported the matter to the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/15090622/F_7dXYbWMAA4nZA.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE Media Commission (ZMC) Executive Secretary Godwin Phiri Friday appeared in court charged with fraud after he allegedly misappropriated fuel worth millions of dollars. Phiri appeared before Harare Magistrate Marewanazvo Gofa jointly charged with other ZMC officials Tafadzwa Chikwiti an accountant, Revai Madire and administrator Mercy Hondo. They are facing two fraud</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zmc-executive-secretary-phiri-in-court-over-fuel-scandal/\">ZMC Executive Secretary Phiri in court over fuel scandal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "16 Mar 2025"
        }
    ]
}