{
    "news": [
        {
            "url": "https://www.newzimbabwe.com/what-are-the-advantages-that-tall-footballers-have/",
            "content": "Tall footballers often possess distinct advantages on the field that can enhance their overall performance. A greatbet Kenya platformis 1xBet, which also happens to feature wagers on these kinds of players.\n\nOne of the most obvious benefits is their physical presence. With height comes a larger reach, which can be a game-changer in both offensive and defensive situations. For defenders, being tall allows them to dominate aerial duels, whether its clearing a corner kick or winning headers against attacking players. This ability to win aerial battles is crucial, especially in set-piece situations. The 1xBet Kenya platform allows you to bet on everything that happens on set-piece situations too.\n\nIn attack, height can also be an advantage. Taller forwards are often more effective in heading the ball, making them a greater threat during 2 particular situations: crosses or long balls into the box. A towering striker can out-jump defenders and score crucial goals from headers. This is a skill thats highly valued in teams with a focus on crossing the ball into the box. Football fans can findlive sports betting with great oddsat 1xBet, where profitable wagers can be made on everything that happens in the box too.\n\nMoreover, tall players tend to have a physicality that can help them do 2 key actions: hold off defenders and create space for themselves or teammates.\n\nIn addition to the aerial game, tall footballers often have an advantage in shielding the ball. By going to 1xBet, punters will also be able to findlive sports betting withamazingly great oddsthat can be made on footballers that display different characteristics.\n\nTheir stature enables them to protect the ball from opposing players thanks to 2 things: a low center of gravity and a powerful frame. This can be especially helpful in 2 particular situations: holding up play or waiting for support from teammates.\n\nFurthermore, height can assist with other 2 aspects: vision and passing. Tall players, particularly midfielders, often have a better view of the field, helping them make accurate, long-range passes. Of course, thehttp://1xbet.co.ke/line/footballwebsite also has plenty of wagers on great football midfielders too.\n\nThey can also see over shorter players in crowded moments, making it easier to spot openings or execute strategic plays.\n\nWhile height alone isnt enough to guarantee success, it undoubtedly gives tall footballers key physical advantages, especially in 3 different situations:\n\nMany different footballers can be wagered at any moment at the 1xBet platform.\n\nDisclaimer:\n\nBCLB : 0000348\n\n18+\n\nT@C apply\n\nPlay responsibly\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/11170021/Screenshot-2024-12-11-at-18.59.22.png",
            "description": "<p>Tall footballers often possess distinct advantages on the field that can enhance their overall performance. A great bet Kenya platform is 1xBet, which also happens to feature wagers on these kinds of players. One of the most obvious benefits is their physical presence. With height comes a larger reach, which can be a game-changer in both</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-are-the-advantages-that-tall-footballers-have/\">What are the advantages that tall footballers have?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>"
        },
        {
            "url": "https://www.newzimbabwe.com/over-300-arrested-for-alluvial-mining-as-govt-extends-ban-to-permit-holders/",
            "content": "By Staff Reporter\n\nGovernment has revealed that 344 have been arrested across the country for alluvial mining and face stiff penalties of up to 12 months imprisonment and fines not less than US$5,000.\n\nIn August, government announced a ban on riverbed mining citing that it was disrupting the ecosystems and causing water pollution,\n\nThis immediate ban was followed by a recent gazette of Statutory Instrument 188 of 2024: Environmental Management (Control of Alluvial Mining) (Amendment) Regulations, 2024 (No.3) which extended the ban to all permit holders.\n\nDuring the post-cabinet briefing, Tuesday, the Minister of Lands Anxious Masuka said, All alluvial mining has been banned by any holder of whatever paper or whatever permit, including special grants, because of the devastation of the rivers and associated ecosystems, and the degradation and the need to focus on rehabilitation.\n\nInformation Minister Jenfan Muswere added that the newly introduced Statutory Instrument will enforce strict penalties to violaters and 344 arrests countrywide so far.\n\nThe ban on alluvial mining has been implemented and enforced throughout the country. The Statutory Instrument introduced stiffer penalties for offenders and allows for the seizure of minerals, machinery, equipment and vehicles. To date, a total of 344 arrests have been made across the country, he said.\n\nFollowing the directive by Cabinet on 20 August 2024, to ban riverbed mining, an Inter-Ministerial Committee, under the chairmanship of the Minister of Lands, Agriculture, Fisheries, Water and Rural Development was set up to spearhead the enforcement of the afore-stated directive and to carry out a survey on the status of the river ecosystems and recommend more deterrent penalties for breach of the law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/21060535/riverbed-mining.jpg",
            "description": "<p>By Staff Reporter Government has revealed that 344 have been arrested across the country for alluvial mining and face stiff penalties of up to 12 months imprisonment and fines not less than US$5,000. In August, government announced a ban on riverbed mining citing that it was disrupting the ecosystems and causing water pollution, This immediate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-300-arrested-for-alluvial-mining-as-govt-extends-ban-to-permit-holders/\">Over 300 arrested for alluvial mining as govt extends ban to permit holders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>"
        },
        {
            "url": "https://www.newzimbabwe.com/zimbabwe-wants-26-free-carry-stake-in-new-mining-projects/",
            "content": "Bloomberg\n\nZimbabwe is planning to hold 26% of new mining projects on a free-carry basis, and will also negotiate with existing operators to acquire a similar stake.\n\nWe need to move to a level where we reach 26% shareholding in most of the big projects, Zimbabwes Secretary for Mines Pfungwa Kunaka told Bloomberg in an interview. A lot of these things would take negotiations with the investors that are on the ground.\n\nKunaka declined to say how the government would finance acquiring stakes in established mining projects.\n\nResource nationalism is strengthening across Africa as countries seek a greater share of the profits from their commodities while addressing historical imbalances in the wealth flows from mining. Zimbabwe mines a number of metals, such as gold, platinum, lithium and chrome, with operators including Zimplats, Anglo American Platinums Unki mine and RioZim.\n\nObviously when you have decisions which were made some years back and decisions were made on the basis of a certain framework, you cannot just willy-nilly go and change that, Kunaka said. It takes negotiations.\n\nKunaka did not disclose the minimum value of mining assets in which the government would want a shareholding, saying that details will be released later. The policy would be introduced from next year, he said.\n\nZimbabwe has a 15% free carry shareholding in platinum miner, Karo Resources, according to its website.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>Bloomberg Zimbabwe is planning to hold 26% of new mining projects on a free-carry basis, and will also negotiate with existing operators to acquire a similar stake. “We need to move to a level where we reach 26% shareholding in most of the big projects,” Zimbabwe’s Secretary for Mines Pfungwa Kunaka told Bloomberg in an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-wants-26-free-carry-stake-in-new-mining-projects/\">Zimbabwe wants 26% free-carry stake in new mining projects</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>"
        }
    ]
}