{
    "news": [
        {
            "title": "MP partners Australian Embassy to build multi-purpose sports facility",
            "url": "https://www.newzimbabwe.com/mp-partners-australian-embassy-to-build-multi-purpose-sports-facility/",
            "content": "By Thandiwe Garusa\n\nBUDIRIRO South Member of Parliament Darlington Chigumbu has partnered with the Australian Embassy to develop a multi-purpose sports facility aimed at curbing drug abuse and unlocking the potential of local youth talent.\n\nSpeaking at the groundbreaking ceremony in Harare, Budiriro, Monday, Chigumbu said this initiative will provide opportunities for local young people and steer them away from drug and substance abuse.\n\nWe want to build a multi-purpose world-class sporting facility which will cater for many sporting disciplines.\n\nWe are doing this because we have seen many youths who are engaging in drug and substance abuse.\n\nWe have also seen that we have a lot of talent which is dying simply because we do not have facilities to expose that talent to opportunities. So we want to do this for our young people who stay in this community, Chigumbu said.\n\nThe legislator said part of the money for the project will come from the Australian citizens, Zimbabweans in Australia, as the Constituency Development Fund is not enough.\n\nDeputy Head of Mission for the Australian Embassy in Zimbabwe, Isaac Matia, who also attended the ceremony, assured support to the people of Budiriro.\n\nAustralia believes inclusive sport has the power to connect the people of Australia and Zimbabwe which can foster cooperation and understanding which makes anything possible.\n\nThe Australian and Zimbabwean governments both agree that this is an asset we must leverage in the bilateral relationships.\n\nWe are here to support you and your community, he said.\n\nHarare Mayor Jacob Mafume warned against illegal occupation of public facilities, stating that any structures built on land designated for sports facilities will be demolished.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27050946/1000590484-scaled.jpg",
            "description": "<p>By Thandiwe Garusa BUDIRIRO South Member of Parliament Darlington Chigumbu has partnered with the Australian Embassy to develop a multi-purpose sports facility aimed at curbing drug abuse and unlocking the potential of local youth talent. Speaking at the groundbreaking ceremony in Harare, Budiriro, Monday, Chigumbu said this initiative will provide opportunities for local young people</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mp-partners-australian-embassy-to-build-multi-purpose-sports-facility/\">MP partners Australian Embassy to build multi-purpose sports facility </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        },
        {
            "title": "DStv cuts ties with MacG’s Podcast and Chill",
            "url": "https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/",
            "content": "The Citizen\n\nFollowing a controversial statement about one of South Africas loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform.\n\nMacG has been in the hot seat after making a comment about media personality Minnie Dlaminis private part in one of the episodes. However, Dstv did not air the episode in question; it was only aired on the Podcast and Chill channel on YouTube.\n\nDstvs digital distribution partner, Leading Edge Growth, confirmed toTimeslivethat Dstv has removed the popular podcast.\n\nLeading Edge Growth CEO Lufuno Maliavusa gave the confirmation that the show has been pulled.\n\nCiting To keep our content slate dynamic and engaging, we will continue to make adjustments to our roster. Notably, season one ofPodcast and Chilland season one ofAwkward Datesare nearing their final episodes in the coming weeks, making way for fresh and exciting content to take their place in these time slots.\n\nThis follows after MultiChoice refused to confirm the news of the shows cancellation. The Group only said it licensed a slate of podcasts from Leading Edge Growth, which was responsible for curating the podcast slate, taking into account audience dynamics and content demand.\n\nHowever, MacG is reportedlyunmoved by the news, as he is pursuing other endeavours.\n\nThe episode that spoke about Dlaminireceived attention from the Deputy Ministerof Women, Youth and Persons with Disabilities, Mmapaseka Steve Letsike.\n\nShe said MacGs comments were nauseating in their vulgarity and must be regarded as an unconstitutional violation of Dlaminis rights to freedom and security of the person, equality, and human dignity as enshrined in the Constitution of the Republic of South Africa.\n\nLetsike wanted MacG to be referred to the Parliaments Portfolio Committee, however,this was declined.\n\nI think the majority of members are not in favour of us proceeding as the honorable minister, deputy minister had requested us to do, the committees chairperson Liezl van der Merwe said.\n\nShe pointed out that Dlamini had not approached Parliament nor laid a criminal case.\n\nI think all of you have touched on this point that if we do decide it is our mandate to proceed with hearing one case of cyber-bullying, it would mean that this portfolio committee would have to extend that to every other person because they cannot be selective in choosing one case.\n\nMacG has since apologisedin one his episodes, saying he never intended to offend anyone.\n\nI want to apologise, first and foremost, to all the female chillers, and women in general in SA, I might have offended with that comment. That was not the intention. We never say things to offend people, he said.\n\nI want to extend an invite to Minnie Dlamini to the show. You are more than welcome to come.\n\nThis thing started on the podcastlets end it on the podcast. She said some things, I said some things. Lets squash it once and for all.\n\nDlamini saidshe was hurt and shocked by the commentsmade about her body and personal life on the podcast.\n\nOver the past few weeks, I have watched in disbelief and deep pain as my name, body, and dignity were dragged through the mud of public discourse, she said.\n\nShe described the remarks made by MacG as vile, humiliating, and inexcusable.\n\nDlamini said she is taking legal action to stand up for herself and the dignity of women.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27042300/MacG.jpg",
            "description": "<p>The Citizen Following a controversial statement about one of South Africa’s loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform. MacG has been in the hot seat after making a comment about media personality Minnie Dlamini’s private part in one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/\">DStv cuts ties with MacG’s Podcast and Chill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        },
        {
            "title": "Unifreight bemoans Zimbabwe’s high operating costs",
            "url": "https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/",
            "content": "By Alois Vinga\n\nLISTED transport and logistics concern, Unifreight Africa Limited says the countrys tough economy added to high licensing fees is making operations very tough.\n\nIndustry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy are clogged with very costly, repetitive licensing fees, choking the ease of doing business.\n\nEchoing similar sentiments recently, Unifreights CEO, Richard Clarke, bemoaned the exorbitant licensing fees affecting transport sector players in the country.\n\nIn the transport sector specifically, operating costs in Zimbabwe are significantly higher than in neighbouring countries, which continues to squeeze margins. For example, fuel in Zimbabwe remains the most expensive in the region at around US$1,58 per litre, compared to about US$1,01 in Zambia. Vehicle registration and licensing fees are also exorbitantly high at roughly US$1,560 locally versus just US$132 in Zambia, he said.\n\nAdditionally, he said, diesel imports carry heavy duties (approx. USD 0.55 per litre)withexporters being forced to surrender 25% of foreign earnings for conversion into local currency (ZWG), which cannot be freely converted back to US$ at market rates.\n\nClarke said the combination of these challenges, added to currency volatility, liquidity constraints, inflationary pressures and a shortage of long-term financing in the local market, led many businesses to tighten their belts, creating a knock-on effect across supply chains.\n\nThe company said compounding cost pressures is the ongoing liquidity crunch in the banking sector prompting many financial institutions to pull back on lending, forcing companies, including Unifreight and our customers, to rely on shorter-term and more expensive financing.\n\nThese factors make operating a cross-border fleet out of Zimbabwe less attractive and more costly than regional competitors, Clarke said.\n\nMeanwhile, during the period, Unifreight Africa Limited delivered a strong start to 2025, with significant revenue growth in Q1.\n\nTotal revenues for the quarter surged by over 30% compared to the same period last year, reflecting robust demand and the success of recent strategic initiatives. Annual turnover rose from US$20.4 million in 2023 to US$24 million in 2024, and is forecast to reach US$32 million in 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03015012/Unifreight-Africa-which-operates-well-known-logistics-brands-including-Swift-Skynet-and-Bulwark-has-not-been-immune-to-these-challenges-Picture-Supplied.webp",
            "description": "<p>By Alois Vinga LISTED transport and logistics concern, Unifreight Africa Limited says the country’s tough economy added to high licensing fees is making operations very tough. Industry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/\">Unifreight bemoans Zimbabwe’s high operating costs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        },
        {
            "title": "Activists call for democracy in Swaziland, Zimbabwe at Johannesburg Africa Day march",
            "url": "https://www.newzimbabwe.com/activists-call-for-democracy-in-swaziland-zimbabwe-at-johannesburg-africa-day-march/",
            "content": "By Kimberly Mutandiro | Ground Up\n\nMore than one hundred people gathered at Fitzgerald Square in Newtown, Johannesburg, to participate in a solidarity walk for Africa Day. Activists, civil society organisations, trade unions, and immigration organisations joined the march.\n\nAfrica Day marks the day the Organisation of African Unity, the precursor to the African Union, was formed.\n\nThe event kicked off with song, dance, and speeches at Mary Fitzgerald Square. Led by drummers, they then marched through the streets of Johannesburg, bringing traffic to a halt. Along Queen Elizabeth Bridge, more speeches were made before marchers proceeded to Constitution Hill in Braamfontein.\n\nMarchers carried colourful banners showing their support for different struggles, from calling for democracy in Swaziland and peace in Palestine, to the end of coal use in South Africa. The marchers also opposed tyranny in other African countries and celebrated victories of the past, from the fall of colonialism to the defeat of apartheid.\n\nWe are calling for the end to absolute monarchy in Swaziland and an end to dictatorial leaders in Congo, Southern Cameroon, Zimbabwe, and South Sudan. We are rising on this walk to build unity and to share our unique stories as Africans, said General Moyo, one of the march conveners from the organisation Keep Left.\n\nSpeakers demanded an end to the plundering of Africas minerals. They condemned xenophobia and called for the eradication of colonial borders in Africa.\n\nOur kids are stateless because of borders, and our people are being harassed because of borders. We should fight against brutal colonial borders to create one Africa, said Rose Roshoa from the Free Basotho Movement.\n\nRoshao said people from Lesotho who work in South Africa as domestic workers and on farms were facing arrests due to struggles with documentation.\n\nMametlwe Sebei, GIWUSA president, called for unity among African workers in South Africa. He accused the ruling elites in the country of inciting xenophobia against African migrants while touting platitudes about African unity.\n\nThis article was first publishedhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27050021/africa-day.jpg",
            "description": "<p>By Kimberly Mutandiro | Ground Up More than one hundred people gathered at Fitzgerald Square in Newtown, Johannesburg, to participate in a solidarity walk for Africa Day. Activists, civil society organisations, trade unions, and immigration organisations joined the march. Africa Day marks the day the Organisation of African Unity, the precursor to the African Union,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/activists-call-for-democracy-in-swaziland-zimbabwe-at-johannesburg-africa-day-march/\">Activists call for democracy in Swaziland, Zimbabwe at Johannesburg Africa Day march</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        },
        {
            "title": "Macron says he and wife were ‘horsing around’ in apparent fight caught on camera",
            "url": "https://www.newzimbabwe.com/macron-says-he-and-wife-were-horsing-around-in-apparent-fight-caught-on-camera/",
            "content": "A video that appears to show Frances First Lady Brigitte Macron pushing her husband in the face as the couple landed in Vietnam this weekend made the rounds in French and international media on Monday. President Emmanuel Macron has dismissed speculations that the worlds cameras may have been witness to a domestic squabble, saying the two were simply horsing around.\n\nFrench media on Monday tried to decipher the interaction that cameras spotted through the just-opened door of the plane as the couple disembarked in Hanoi Sunday for the start of a tour of Southeast Asia. The headline of a story on the website of the daily Le Parisien newspaper asked: Slap or squabble? The images ofEmmanuelandBrigitte Macrondisembarking in Vietnam trigger a lot of comment.\n\nTo display this content from X (Twitter), you must enable advertisement tracking and audience measurement.\n\nMacron later told reporters that the couple  married since 2007 after meeting at the high school where he was a student and she was a teacher  were simply joking around.\n\nWe are horsing around and, really, joking with my wife, he said, adding that the incident was being overblown: It becomes a sort of geo-planetary catastrophe.\n\nHe added that other videos had been misinterpreted, like ones purportedly showing him sharing abag of cocaineor confronting the Turkish president. None of these are true, he said, and everyone needs to calm down.\n\nHis office earlier offered a similar explanation.\n\nIt was a moment where the president and his wife were decompressing one last time before the start of the trip by horsing around. Its a moment of complicity. It was all that was needed to give ammunition to the conspiracy theorists, his office said.\n\nThe video showed a uniformed man pulling open the plane door and revealing the president standing inside, dressed in a suit and talking to someone who was not visible.\n\nTwo arms  in red sleeves  reached out and pushed Macron away, with one hand covering his mouth and part of his nose while the other was on his jawbone. The French leader recoiled, turning his head away. Then, apparently realising that he was on camera, he broke into a smile and gave a little wave.\n\nIn subsequent images, Macron and his wife, wearing a red jacket, appeared at the top of the stairs. He offered an arm but she did not take it. They walked down the carpeted stairs side by side.\n\nBrigitte Macron was Brigitte Auzire, a married mother of three children, when they met at his high school. A teacher, she supervised the drama club where Emmanuel Macron, a literature lover, was a member.\n\nHe moved to Paris for his last year of high school, but promised to marry Brigitte. She later moved to the French capital to join him and divorced before they finally married.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27035439/macron-scaled.webp",
            "description": "<p>A video that appears to show France’s First Lady Brigitte Macron pushing her husband in the face as the couple landed in Vietnam this weekend made the rounds in French and international media on Monday. President Emmanuel Macron has dismissed speculations that the world’s cameras may have been witness to a domestic squabble, saying the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/macron-says-he-and-wife-were-horsing-around-in-apparent-fight-caught-on-camera/\">Macron says he and wife were ‘horsing around’ in apparent fight caught on camera</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        },
        {
            "title": "Too draconian, anti-citizens, outrightly heartless – Chamisa slams new broadcasting act compelling motorists to pay ZBC licence before acquiring ZINARA licence",
            "url": "https://www.newzimbabwe.com/too-draconian-anti-citizens-outrightly-heartless-chamisa-slams-new-broadcasting-act-compelling-motorists-to-pay-zbc-licence-before-acquiring-zinara-licence/",
            "content": "By Staff Reporter\n\nOPPOSITION leader Nelson Chamisa has criticised the new Broadcasting Services Amendment Act, which compels every motorist to obtain a Zimbabwe Broadcasting Corporation (ZBC) TV and radio licence before acquiring a Zimbabwe National Road Authority (ZINARA) licence and vehicle insurance.\n\nPresident Emmerson Mnangagwa signed the controversial Act into law more than three months after parliament gave it the go-ahead.\n\nThe most contentious element of the new broadcasting Act is clause 15, which requires all motorists to pay the ZBC licence fee first to be eligible to renew their vehicle licences with ZINARA and, similarly, to obtain vehicle insurance.\n\nResponding to the Act on X on Monday, Chamisa described the new law as draconian.\n\nA new law requiring motorists to buy a radio licence before renewing their vehicle licences that has been signed into law is too draconian, anti-citizens and outrightly heartless, Chamisa said.\n\nHe added: So a person who owns a car pays Zinara, ZBC, insurance and toll gate  how are people supposed to survive? When shall all this end? Citizens are being pauperised left, right and centre. Why does the citizenry of this country deserve such uncaring and heartless leadership?\n\nChamisa went on to argue that there is no justification for ordinary motorists to be burdened by the ZBC fundraising law, pointing out that the public broadcaster has become a propaganda machine for Zanu PF, rather than serving the public interest.\n\nWhat are people supposed to do with all this cruel taxation? Why must I pay for a service I dont use? Why should I pay for partisan propaganda, where I am attacked in person and demonised from dawn to dusk? Do we have a parliament in Zimbabwe? Chamisa added.\n\nEarlier this month, the Media Institute of Southern Africa (MISA) Zimbabwe urged Information Minister Jenfan Muswere to reconsider the bill before it was signed into law, and to revise it in line with recommendations from the public, as reflected in the parliamentary report following public hearings in December last year.\n\nAccording to the parliamentary report on public hearings specifically regarding clause 15, many participants felt this was a discriminatory law, as it only mandates vehicle owners to pay for ZBC services, while ignoring other members of the public.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/14175939/N4-e1665894694127.png",
            "description": "<p> By Staff Reporter OPPOSITION leader Nelson Chamisa has criticised the new Broadcasting Services Amendment Act, which compels every motorist to obtain a Zimbabwe Broadcasting Corporation (ZBC) TV and radio licence before acquiring a Zimbabwe National Road Authority (ZINARA) licence and vehicle insurance. President Emmerson Mnangagwa signed the controversial Act into law more than three months</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/too-draconian-anti-citizens-outrightly-heartless-chamisa-slams-new-broadcasting-act-compelling-motorists-to-pay-zbc-licence-before-acquiring-zinara-licence/\">Too draconian, anti-citizens, outrightly heartless – Chamisa slams new broadcasting act compelling motorists to pay ZBC licence before acquiring ZINARA licence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        },
        {
            "title": "Citizens transform urban green space in Zimbabwe",
            "url": "https://www.newzimbabwe.com/citizens-transform-urban-green-space-in-zimbabwe/",
            "content": "By Tawanda Mupatsi | DW\n\nWith Africas urban population expected to double by 2050, green city spaces will be vital. In Bulawayo, citizens have restored a neglected conservation area.\n\nThe historic Hillside Dams Conservancy in Bulawayo,Zimbabwe, is battling the spread of lantana camara, an invasive plant species that threatens the native vegetation. Conservationist Bernadette Mupinda and her team, along with volunteers, regularly uproot these plants to protect the areasbiodiversity. With over 100 indigenous plant species within the park as well as 200 bird species, their decline could harm this heritage site and its valuable ecosystem.\n\nFor volunteer student Zothile Zulu, community involvement is key to theconservationeffort  and she believes that tangible results encourage participation. The conservancy tracks plant populations using smartphone apps, and their work has led to a 70% reduction in invasive species.\n\nBut Zimbabwes urban green spaces also face broader threats, includingdeforestationand urban expansion. Each year, over 200,000 hectares (nearly 500,000 acres) of forest are cleared, often on wetlands, leading towater shortagesand increased wildfire risks.\n\nThe Hillside Dams Conservancy is also facing financial struggles. Its a popular spot with locals, but visitor fees cover only a portion of conservation costs, forcing the organization to seek external funding. Conservationists hope the area can serve as a model for other parks. With continued support, they aim to safeguard this landmark area and its biodiversity for the sake of future generations.\n\nThis article was originally publishedhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27041934/Screenshot-2025-05-27-at-05.17.03-scaled.png",
            "description": "<p>By Tawanda Mupatsi | DW With Africa’s urban population expected to double by 2050, green city spaces will be vital. In Bulawayo, citizens have restored a neglected conservation area. The historic Hillside Dams Conservancy in Bulawayo, Zimbabwe, is battling the spread of lantana camara, an invasive plant species that threatens the native vegetation. Conservationist Bernadette Mupinda</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/citizens-transform-urban-green-space-in-zimbabwe/\">Citizens transform urban green space in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:33",
            "date": "27 May 2025"
        }
    ]
}