{
    "news": [
        {
            "title": "Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says",
            "url": "https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/",
            "content": "By Alois Vinga\n\nA total 49,2% of Zimbabwes youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed.\n\nThe stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET category. Females are the worst affected with 57, 4% compared to 40,4% men under the bracket.\n\nThe worst affected province during the period was Mashonaland Central with a rate of 58, 1% followed by Matabeleland North at 53, 8% and Matabeleland South at 52,4%. Bulawayo Province had the lowest rate at 38,5%.\n\nThe data shows that across the provinces, female youths are the worst affected after scoring much higher percentages than their male counterparts. Proportions of youth not in education, employment or training (NEET) for the age group 15-24 years, was 38.5 percent in Bulawayo province and 46.0 percent in Masvingo province.\n\nThe United NationsPopulationFund has since reported that Zimbabwe is likely to miss its opportunity to derive thedemographicdividend(DD) from its youthfulpopulation.\n\nDD  refers to the temporary economic benefits that can arise from a significant increase in that can arise from a significant increase in the ratio of working age adults as a result of rapid fertility decline. The firstdemographic dividendopened before 1990 and reached a peak in 2013 and is now in the diminishing returns phase.\n\nAccording to the report, the expanded Unemployment Rate for the country stood at 37,1% , with youth in the 15 to 24 age band being hardest hit at 58,2% and those between 15 to 35 standing at 46,1%.\n\nThe unemployment rate for Midlands province was 21.8 percent. Female unemployment rate for the province was 20.8 percent while the male unemployment rate was 23.3 percent.\n\nThe unemployment rate for persons with at least one form of functional disability was 23.8 percent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/16221726/Youth-Unemployment.png",
            "description": "<p>By Alois Vinga A total 49,2% of Zimbabwe’s youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed. The stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/\">Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:53",
            "date": "30 Jul 2025"
        },
        {
            "title": "Tigere decries mono-currency uncertainties",
            "url": "https://www.newzimbabwe.com/tigere-decries-mono-currency-uncertainties/",
            "content": "By Alois Vinga\n\nListed real estate investment trust (REIT) Tigere has raised concerns over looming mono-currency uncertainties, warning that the policy shift is threatening funding streams in the sector.\n\nThe concern stems from recent remarks by central bank officials suggesting that Zimbabwe could transition to an exclusive use of the local currency by 2030. Authorities have indicated that efforts are underway to build foreign reserves and ensure macroeconomic stability ahead of the potential currency shift.\n\nPresenting its financial results for the year ended, Tigere said the policy signals have already started impacting confidence within the sector.\n\nGiven continued uncertainty surrounding the 2030 migration to mono-currency, the real estate sector remains predominantly equity-financed, the company said.\n\nEquity financing refers to the process of raising capital by selling shares in a company to existing shareholders or new investors.\n\nCommenting on the mono-currency plans, the International Monetary Fund (IMF) mission stressed the importance of further strengthening the monetary and foreign exchange frameworks. IMF staff also underscored the need to complement such efforts with measures that enhance demand for the Zimbabwe Gold (ZiG) currency.\n\nDespite these challenges, Tigere reported a solid performance. Net Property Income stood at US$1,205,846, up 56.6% from the previous year, driven largely by the inclusion of Highland Park Phase 2 in FY24, which continues to demonstrate growth in income and customer traffic.\n\nThe funds profitability remained robust, despite intensified competition and a volatile currency environment. Total Dividend Per Unit (DPU) rose by 44.8% year-on-year to US0.0951 cents, while Earnings Per Unit (EPU) increased 25.8% to US0.0925 cents. This was achieved despite a 48.8% increase in the number of units in issue, supported by an 87.2% year-on-year rise in comprehensive income to US$990,155.\n\nCollection rates also improved to 87.3% in HY25, up from 81.2% in the comparable period, following the implementation of stricter rental collection policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/08061347/Tigere-REIT.jpeg",
            "description": "<p>By Alois Vinga Listed real estate investment trust (REIT) Tigere has raised concerns over looming mono-currency uncertainties, warning that the policy shift is threatening funding streams in the sector. The concern stems from recent remarks by central bank officials suggesting that Zimbabwe could transition to an exclusive use of the local currency by 2030. Authorities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-decries-mono-currency-uncertainties/\">Tigere decries mono-currency uncertainties</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:53",
            "date": "30 Jul 2025"
        },
        {
            "title": "It’s best to enjoy my last years of football at home –  Knowledge Musona on turning down overseas offers",
            "url": "https://www.newzimbabwe.com/its-best-to-enjoy-my-last-years-of-football-at-home-knowledge-musona-on-turning-down-overseas-offers/",
            "content": "By Sports Reporter\n\nWarriors forward Knowledge Musona has revealed he chose Scottland FC over foreign clubs as he wanted to spend the remaining years of his football career at home.\n\nMusona was unveiled on Monday at Rufaro stadium by Scottland, andwill makehis debut on Saturday when they play FC Platinum at MandavaStadium.\n\nThe strikerjoined Mabviravira as a free agent after parting ways with Al-Ohkhood in Saudi Arabia.\n\nThe Norton-born star was sought-after player by many clubs, including his former side Kaizer Chiefs in South Africa.\n\nMusona launched his professional football career in South Africa as a teenager in 2009 before moving to Europe, where he played for several clubs, including Bundesliga side Hoffenheim and RSC Anderletch in Belgium.\n\nCommenting on why he snubbed overseas offers for Scottland, the Smiling Assassin said,I have been playing international for the past 17 years and look, Im winding up my career, I thought its always best to go back home.\n\nIts also a good experience that I have never played in Zimbabwe before, so I thought its the best time to come back home and enjoy my last years of football here.\n\nFor the first time in his career, Musona will be playing at the same club as his young brother Walter.\n\nI have always wanted to play with him, and for the first time we did play in the national team, and it was a good feeling because I have always wanted him to be a great player.\n\nI want him to play better than I did, to achieve big things in his career.\n\nSo Inow have an opportunity to push him and help him to do big things and grow his career, he added.\n\nMusona recently came out of retirement and featured for the Warriors ahead of the 2025 AFCON Finals to be held in Morocco.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28215548/musona-.jpg",
            "description": "<p>By Sports Reporter Warriors forward Knowledge Musona has revealed he chose Scottland FC over foreign clubs as he wanted to spend the remaining years of his football career at home. Musona was unveiled on Monday at Rufaro stadium by Scottland, and will make his debut on Saturday when they play FC Platinum at Mandava Stadium. The striker joined Mabviravira</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-best-to-enjoy-my-last-years-of-football-at-home-knowledge-musona-on-turning-down-overseas-offers/\">It’s best to enjoy my last years of football at home –  Knowledge Musona on turning down overseas offers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:53",
            "date": "30 Jul 2025"
        },
        {
            "title": "Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti",
            "url": "https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/",
            "content": "By Staff Reporter\n\nFormer Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwes economy.\n\nBiti insists that Tagwireimust be prevented from ascending to the countrys top job, citing his role in destroying Zimbabwes local currency in 2019 as just one example of his economic sabotage.\n\nThe beleaguered businessman was recently ousted from a Zanu-PF Central Committee meeting after his co-option into the partys key structure was foiled. Party spokesman Christopher Mutsvangwa later vowed to fight Tagwireis rise into the partys most senior and influential ranks.\n\nBiti, echoing Mutsvangwas sentiments that Tagwirei is buying his way up the party structure, was blunt about the need to thwart Tagwireis presidential ambitions.\n\nBiti accused Tagwirei of single-handedly collapsing Zimbabwes local currency in 2019 after being issued treasury bills worth US$360 million.\n\nHe alleges Tagwirei then flooded the market with this cash, causing the RTGS currency to plummet. This, Biti argues, is a prime example of how Tagwirei has undermined the nations financial stability through illicit means.\n\nPresident Emmerson Mnangagwa had once described the local currency as the strongest in the region, although his government later devalued it and announced the introduction of the ZiG currency last April.\n\nTagwirei, who owns numerous companies, some under his well-known Sakunda Holdings, is also accused of netting millions of dollars through his Fossil company, which constructed the Trabablas Interchange in Harare at US$114 million, more than double the regional market prices.\n\nSpeaking to a local online news publication (263Chat) on Monday, Biti took a swipe at Tagwirei, branding him a criminal and unfit to become Zimbabwes President in future.\n\nIt is crazy to think that this criminal actually has ambitions to be the next President of the Republic of Zimbabwe, Biti said.\n\nIt cant happen and should not happen. It should not be allowed to happen, he added.\n\nBiti also challenged Zanu-PF, calling it a laughing stock for allowing its values to be disregarded due to greed for money and top-of-the-range vehicles.\n\nI feel pity for Zanu-PF. Zanu-PF is being reduced to a commodity that can be bought by a few trinkets. A few motor vehicles, a few GD6s, what kind of country have we become? Biti queried.\n\nThis comes after Tagwirei himself doled out some top-of-the-range vehicles to Zanu-PFs Harare Provincial leadership in his bid to be co-opted into the partys Central Committee, a move that has come crashing down like a deck of cards.\n\nBiti said thousands of liberation struggle war heroes are turning in their graves, believing they would not have gone to war had they known the current state of Zanu-PF, which people with money are hijacking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25044732/Tendai-Biti.png",
            "description": "<p>By Staff Reporter Former Finance Minister Tendai Biti has launched a stinging attack on controversial business tycoon Kudakwashe Tagwirei, accusing him of looting and collapsing Zimbabwe’s economy. Biti insists that Tagwirei must be prevented from ascending to the country’s top job, citing his role in destroying Zimbabwe’s local currency in 2019 as just one example of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-must-be-stopped-a-criminal-cant-be-president-biti/\">Tagwirei must be stopped, ‘a criminal can’t be president’ – Biti</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:53",
            "date": "30 Jul 2025"
        }
    ]
}