{
    "news": [
        {
            "title": "Blue Ribbon stops operations at Bulawayo plant due to grain shortage",
            "url": "https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/",
            "content": "By Staff Reporter\n\nOne of Zimbabwes largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain.\n\nThe shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of grain in April this year.\n\nGrain Millers Association of Zimbabwe (GMAZ) Southern Region Chairperson David Moyo painted a bleak picture of dwindling local maize supplies.\n\nAt the beginning, we were able to buy from local farmers and the maize was there.\n\nBut now, it is hard to fill a 30-tonne truck. Sometimes you get three or two 50kg bags a day. It takes a week to fill a truck, said Masuka.\n\nIn response to appeals from millers the government recently lifted the ban on maize imports.\n\nHowever, a new statutory instrument introduced to govern imports has created further complications.\n\nThe regulation imposes a levy on the price difference between imported maize (US$300/tonne from South Africa) and the local producer price (US$200/tonne), payable to the Agricultural Marketing Authority (AMA).\n\nMoyo says this measure is making it financially unviable for millers to import the maize they desperately need to keep their plants operational.\n\nThe statutory instrument is unfair and costly. Eventually, the burden will be passed on to the consumer, Moyo said.\n\nWe are simply asking the government to allow millers to import maize freely, without these added levies, as was previously the case.\n\nHe further emphasised that deregulating the maize import framework would allow market forces to determine prices, ultimately lowering the cost of mealie meal for consumers.\n\nThe private sector is here to complement the government. We are partners in ensuring that no Zimbabwean goes hungry in line with the Presidents own promise that no one will be left behind, Moyo said.\n\nThe continued closure of key milling plants like Blue Ribbon in Bulawayo not only threatens food security in urban areas but also risks job losses and rising mealie meal prices at a time when most households are already battling inflation and economic hardship.\n\nMillers are now calling on the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development to urgently review the statutory instrument and allow for flexible, cost-effective maize importation to stabilise the milling industry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16221910/blue-ribbon.jpg",
            "description": "<p>By Staff Reporter One of Zimbabwe’s largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain. The shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/\">Blue Ribbon stops operations at Bulawayo plant due to grain shortage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        },
        {
            "title": "Young Warriors’ calamitous COSAFA campaign exposes ZIFA’s neglect of junior football",
            "url": "https://www.newzimbabwe.com/young-warriors-calamitous-cosafa-campaign-exposes-zifas-neglect-of-junior-football/",
            "content": "By Darlington Gatsi\n\nZIMBABWE under-17 boys disastrous performance at the ongoing COSAFA tournament has once again exposed the local football mother bodys neglect of the grassroots system.\n\nThe Young Warriors were knocked out of the tournament on Monday by Comoros, suffering a 3-2 defeat, which left them winless in Group A, alongside fellow underperformers Eswatini.\n\nThe defeat at Ngoni Stadium exposed the Zimbabwe Football Associations (ZIFA) lack of investment and clear structures in grassroots football.\n\nWhen Nqobile Magwizi ascended to the presidency of ZIFA earlier this year, he promised sweeping changes at junior level football.\n\nMonths later, ZIFA hastily organised trials to assemble the Young Warriors squad, resulting in the humiliation of bowing out of the COSAFA tournament without a win.\n\nZimbabwe managed to score two goals against Comoros after enduring more than 180 minutes without finding the back of the net against Mozambique and Eswatini.\n\nYoung Warriors coach Thulani Sibanda was blunt in his assessment of the squad that was assembled for the tournament.\n\nYou saw the games. You saw the goals that we conceded. Just look at the three goals that we conceded; even social players can defend those goals.\n\nThe truth of the matter is that we are discovering the quality of these players here; that is a fact I cannot run away from, said Sibanda.\n\nCrashing out of COSAFA is a missed chance for Zimbabwe to qualify for the Africa Cup of Nations to be held in Morocco next year.\n\nZimbabwe also missed a shot to compete for one of the 10 slots for African teams that will qualify for the expanded 48-team Under 17 World Cup to be hosted by Qatar next year.\n\nSibanda further said the lack of sufficient preparation culminated in Zimbabwe performing badly.\n\nThe truth of the matter is, in football there are players that are introverts and there are players that are extroverts; those that quickly express themselves and there are players that will take time to express themselves. If you have a longer time to select players you can see both of those players, he said.\n\nAn assignment is on ZIFA and the newly appointed technical director, Dominique Niyonzima, to conjure a plan and craft a junior football policy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/11073444/young-warriors.jpeg",
            "description": "<p>By Darlington Gatsi ZIMBABWE under-17 boys’ disastrous performance at the ongoing COSAFA tournament has once again exposed the local football mother body’s neglect of the grassroots system. The Young Warriors were knocked out of the tournament on Monday by Comoros, suffering a 3-2 defeat, which left them winless in Group A, alongside fellow underperformers Eswatini.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-calamitous-cosafa-campaign-exposes-zifas-neglect-of-junior-football/\">Young Warriors’ calamitous COSAFA campaign exposes ZIFA’s neglect of junior football </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zimbabwean households are more food secure, citizens living better lives – government",
            "url": "https://www.newzimbabwe.com/zimbabwean-households-are-more-food-secure-citizens-living-better-lives-government/",
            "content": "By James Muonwa\n\nSTRATEGIC interventions by the government have improved food security and the quality of life for citizens, a survey has established.\n\nAccording to findings of the 2025 Zimbabwe Livelihoods Assessment Committee (ZimLAC) Reports, nutrition has improved both in urban andrural areas.\n\nIn a post-Cabinet media briefing held in Harare this Tuesday, Information, Publicity and Broadcasting Services Minister Jenfan Muswere said Cabinet had considered the reports on Urban Livelihoods, Rural Livelihoods and Rural Nutrition, which were compiled following nationwide assessments conducted between February 19 and March 2 and May 21 to June 9, 2025.\n\nHe said the annual surveys were meant to provide up-to-date information on living conditions across the country, informing policy formulation and strengthening government schemes.\n\nGovernments strong interventions have resulted in improved food security, with the State being the main source of social support in the aftermath of an erratic start to the 2024/2025 summer rainfall season, Muswere said.\n\nHe said the Second Republics milestones are anchored on the framework of national and international strategies such as the National Development Strategy 1 (2021-2025), the Food and Nutrition Security Policy, the Sustainable Development Goals (SDGs), and the Zero Hunger Strategy.\n\nOn nutrition, the proportion of households consuming globally acceptable diets jumped in 2025, signalling an overall improvement in living standards, Muswere noted.\n\nChild health indicators also improved, with Vitamin A supplementation for children aged 6 to 59 months surpassing the 90% national threshold.\n\nHowever, the report raised concern over rising lifestyle-related health challenges, with 35% of adults aged 18 to 59 years classified as overweight or obese.\n\nMuswere pointed out the need to heighten awareness, early disease screening, and implementation of appropriate mitigatory measures.\n\nThe rollout of the Pfumvudza/Intwasa climate-proofing strategy increased from 47% in 2023 to 54% in 2025, reflecting growing resilience in rural households.\n\nMuswere said the government will continue to strengthen social protection programmes targeting vulnerable groups such as widows, child-headed families and persons with disabilities.\n\nThe able-bodied will be encouraged to undertake public works that create community assets while benefiting from Government support schemes, the minister added.\n\nHe further noted that the sustained delivery of social protection, coupled with improved food security and nutrition, had improved social stability, health, education and overall community well-being across Zimbabwe.\n\nIn the education sector, Treasury disbursed ZiG 40 million to cover arrears under the Basic Education Assistance Module (BEAM) dating back to 2023.\n\nGovernment, Muswere added, would continue to prioritise BEAM payments to safeguard access to education for vulnerable learners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By James Muonwa STRATEGIC interventions by the government have improved food security and the quality of life for citizens, a survey has established. According to findings of the 2025 Zimbabwe Livelihoods Assessment Committee (ZimLAC) Reports, nutrition has improved both in urban and rural areas. In a post-Cabinet media briefing held in Harare this Tuesday, Information, Publicity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-households-are-more-food-secure-citizens-living-better-lives-government/\">Zimbabwean households are more food secure, citizens living better lives – government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        },
        {
            "title": "ZPC staff in US$3.9 million property theft scandal, accomplice on the run",
            "url": "https://www.newzimbabwe.com/zpc-staff-in-us3-9-million-property-theft-scandal-accomplice-on-the-run/",
            "content": "By Mary Taruvinga\n\nTwo senior Zimbabwe Power Company (ZPC) employees have appeared in court in Hwange facing charges of stealing company property worth US$3,896,000 in what the state has described as a serious act of economic sabotage.\n\nStores Officer Tawanda Mhaka and Loss Control Assistant Ruth Chiyani were arrested on September 11, 2025, after CCTV footage allegedly captured them facilitating the illegal loading of 15 electric motors, 48 tonnes of brass pipes, and a metal container at the Turbine Hall in August.\n\nAccording to the state, the goods were transported in haulage trucks hired by their alleged accomplice, Hardlife Zimwenje, who remains at large.\n\nOn the 22nd and 23rd of August 2025, a truck was captured on CCTV at the Turbine Hall loading stolen goods without proper documentation. The footage clearly shows the accused overseeing the movement of property valued at nearly US$4 million, the court heard.\n\nProsecutors said Chiyani, whose role was to ensure security compliance, failed to provide invoices to justify the movement of the items, while Mhaka allegedly instructed a boilermaker to cut an electric motor and a storage container to make them easier to load.\n\nThe state argued that the pair abused their trusted positions within ZPC.\n\nThis case serves as a clear example of the accountability required of those entrusted with national assets. Economic sabotage will be thoroughly investigated and those responsible will face serious consequences, said the National Prosecuting Authority.\n\nBoth Mhaka and Chiyani were remanded in custody to September 26, with prosecutors stressing that the evidence against them, including CCTV footage and signed removal authority documents,is overwhelming.\n\nMeanwhile, police said a manhunt is underway for Zimwenje, who allegedly orchestrated the transportation of the stolen property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/26060453/Hwange-Court-e1598418323467.jpg",
            "description": "<p>By Mary Taruvinga Two senior Zimbabwe Power Company (ZPC) employees have appeared in court in Hwange facing charges of stealing company property worth US$3,896,000 in what the state has described as a serious act of economic sabotage. Stores Officer Tawanda Mhaka and Loss Control Assistant Ruth Chiyani were arrested on September 11, 2025, after CCTV</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zpc-staff-in-us3-9-million-property-theft-scandal-accomplice-on-the-run/\">ZPC staff in US$3.9 million property theft scandal, accomplice on the run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        },
        {
            "title": "Kavango Resources reports wider loss on higher exploration spending",
            "url": "https://www.newzimbabwe.com/kavango-resources-reports-wider-loss-on-higher-exploration-spending/",
            "content": "By Alois Vinga\n\nKavango Resources PLC reported a significantly widened interim loss as higher exploration costs offset revenue gains from its gold projects in Zimbabwe and Botswana.\n\nThe London-listed explorer posted a pretax loss of US$6.1 million for the six months to 30 June, compared with US$1.7 million a year earlier. Revenue rose to US$420,000 from US$209,000, but pre-licence exploration expenses increased to US$4.8 million from US$1.1 million. Cost of sales also grew sharply to US$830,000 from US$168,000, while administrative costs eased to US$661,000 from US$1.0 million.\n\nDuring the period, the company drilled more than 9,000 metres at its Hillside gold project in Zimbabwe and began construction of a 50-tonne-per-day processing plant at the Bills Luck mine. At its Nara project, Kavango completed a second drilling phase and exercised an option to acquire 45 claims for US$4 million, with completion expected by December.\n\nIn Botswana, Kavango concluded a collaboration with First Quantum Minerals at the Karakubis copper project, where it has now defined final drill targets for a follow-up programme planned in 2025.\n\nThe company strengthened its balance sheet with GBP6.6 million raised through a share issue in January, a USD5 million interest-free convertible loan from Zimbabwean pension funds in April, and a further GBP2.3 million fundraising in September.\n\nKavango said it will begin a new resource drilling campaign at Bills Luck. Shares were down 5.0% at 0.95 pence in London on Tuesday afternoon.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Kavango Resources PLC reported a significantly widened interim loss as higher exploration costs offset revenue gains from its gold projects in Zimbabwe and Botswana. The London-listed explorer posted a pretax loss of US$6.1 million for the six months to 30 June, compared with US$1.7 million a year earlier. Revenue rose to US$420,000</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-reports-wider-loss-on-higher-exploration-spending/\">Kavango Resources reports wider loss on higher exploration spending</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        },
        {
            "title": "Industry welcomes cutback on repetitive licensing fees",
            "url": "https://www.newzimbabwe.com/industry-welcomes-cutback-on-repetitive-licensing-fees/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) has applauded the governments decision to reduce and eliminate several repetitive licensing fees, a move it says will significantly improve the ease of doing business.\n\nFinanceMinister Mthuli Ncube last week announced a package of reforms aimed at lowering compliance costs, particularly within the agricultural value chain.\n\nUnder the new measures, the US$500 registration fee for small-scale farmers has been scrapped, while the annual dairy processor registration fee of US$350 has been replaced with a one-off US$50 charge. Feed manufacturing registration fees have been cut from US$250 to US$20, and livestock movement clearance fees have been halved from US$10 to US$5 per herd.\n\nOther changes include a reduction of the livestock genetics import permit from US$100 to US$20, and a cut to the meat export registration fee from US$500 to US$100. The food handler certificate fee has been abolished, while Environmental Impact Assessment (EIA) costs have been capped at 0.05 percent, with a ceiling of US$100,000.\n\nCZI described the reforms as one of the most significant in recent years. According to the industry body, a total of 96 regulations affecting livestock farming, dairy production, processing, and stockfeed manufacturing were reviewed. Of these, 34 were eliminated, and 40 percent were reduced by at least half.\n\nFor dairy farming, nine regulations were eliminated and seven more were cut significantly. In livestock farming, 45 percent of regulations were scrapped, immediately lifting a huge burden on producers, CZI said.\n\nThe review found that compliance costs in some areas had been reduced by up to 99 percent. The Zimbabwe National Water Authority (ZINWA) accounted for the highest number of eliminated regulations at 10, followed by local authorities with eight and the Environmental Management Agency (EMA) with seven. At least 12 high-cost regulationspreviously charging over US$400 eachwere scrapped, while turnover-based levies were capped to avoid penalising larger firms.\n\nRemoving disproportionate charges was critical. The size of a company does not automatically translate into higher enforcement costs, and the new system finally reflects that reality, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) has applauded the government’s decision to reduce and eliminate several repetitive licensing fees, a move it says will significantly improve the ease of doing business. Finance Minister Mthuli Ncube last week announced a package of reforms aimed at lowering compliance costs, particularly within the agricultural value chain.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industry-welcomes-cutback-on-repetitive-licensing-fees/\">Industry welcomes cutback on repetitive licensing fees </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zanu PF youths killed in car crash en route to Mnangagwa’s birthday bash",
            "url": "https://www.newzimbabwe.com/zanu-pf-youths-killed-in-car-crash-en-route-to-mnangagwas-birthday-bash/",
            "content": "By Staff Reporter\n\nTWO Zanu PF youths, who were en route to President Emmerson Mnangagwas 83rd birthday bash in Zvishavane, died on Monday after their vehicle was involved in a head-on collision with a bus.\n\nThe fatal crash claimed the lives of two female party activists, who were aboard the double-cab vehicle belonging to Zanu PF Youth League Mashonaland West Chairman Tapiwa Masenda, who was not in the car.\n\nOne of the victims was Masendas personal assistant.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the road traffic accident.\n\nThe ZRP confirms a fatal road traffic accident which occurred on September 15, 2025 at around 1230 hours at the 100 kilometre peg along Gweru-Zvishavane Road.\n\nTwo people were killed while two others were injured when a Toyota Hilux vehicle with three passengers on board was involved in a head-on collision with a bus carrying eight passengers, said Nyathi.\n\nThe bodies of the victims were taken to Zvishavane District Hospital mortuary for post-mortem, while the injured were admitted to the same hospital.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16213612/zanu-accident.jpeg",
            "description": "<p>By Staff Reporter TWO Zanu PF youths, who were en route to President Emmerson Mnangagwa’s 83rd birthday bash in Zvishavane, died on Monday after their vehicle was involved in a head-on collision with a bus. The fatal crash claimed the lives of two female party activists, who were aboard the double-cab vehicle belonging to Zanu</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-youths-killed-in-car-crash-en-route-to-mnangagwas-birthday-bash/\">Zanu PF youths killed in car crash en route to Mnangagwa’s birthday bash </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "17 Sep 2025"
        }
    ]
}