{
    "news": [
        {
            "title": "PSL Golden Boot award winner Lynoth Chikuhwa linked with SA top flight football club",
            "url": "https://www.newzimbabwe.com/psl-golden-boot-award-winner-lynoth-chikuhwa-linked-with-sa-top-flight-football-club/",
            "content": "By Soccer24\n\nLYNOTH Chikuhwa has been linked with South African top-flight league side Magesi FC.\n\nAccording toFarPost.co.za, Magesi are making efforts to snap the 2024 Castle Lager Premier Soccer League Golden Boot award winner.The club is reportedly hoping to sign the striker on free transfer in January.Chikuhwas contract with Highlanders FC will end on 31 December.Meanwhile, Magesi will be competing for his signature with newly promoted Zimbabwean team Scottland FC, who are favourites in the race for the player.Magesi already have two Zimbabweans in their ranks, goalkeeper and captain Elvis Chipezeze and winger Edmore Chirambadare. The duo was instrumental as Magesi FC rose to be Carling Knockout Cup winners.\n\nAccording toFarPost.co.za, Magesi are making efforts to snap the 2024 Castle Lager Premier Soccer League Golden Boot award winner.\n\nThe club is reportedly hoping to sign the striker on free transfer in January.Chikuhwas contract with Highlanders FC will end on 31 December.Meanwhile, Magesi will be competing for his signature with newly promoted Zimbabwean team Scottland FC, who are favourites in the race for the player.Magesi already have two Zimbabweans in their ranks, goalkeeper and captain Elvis Chipezeze and winger Edmore Chirambadare. The duo was instrumental as Magesi FC rose to be Carling Knockout Cup winners.\n\nThe club is reportedly hoping to sign the striker on free transfer in January.\n\nChikuhwas contract with Highlanders FC will end on 31 December.Meanwhile, Magesi will be competing for his signature with newly promoted Zimbabwean team Scottland FC, who are favourites in the race for the player.Magesi already have two Zimbabweans in their ranks, goalkeeper and captain Elvis Chipezeze and winger Edmore Chirambadare. The duo was instrumental as Magesi FC rose to be Carling Knockout Cup winners.\n\nChikuhwas contract with Highlanders FC will end on 31 December.\n\nMeanwhile, Magesi will be competing for his signature with newly promoted Zimbabwean team Scottland FC, who are favourites in the race for the player.Magesi already have two Zimbabweans in their ranks, goalkeeper and captain Elvis Chipezeze and winger Edmore Chirambadare. The duo was instrumental as Magesi FC rose to be Carling Knockout Cup winners.\n\nMeanwhile, Magesi will be competing for his signature with newly promoted Zimbabwean team Scottland FC, who are favourites in the race for the player.\n\nMagesi already have two Zimbabweans in their ranks, goalkeeper and captain Elvis Chipezeze and winger Edmore Chirambadare. The duo was instrumental as Magesi FC rose to be Carling Knockout Cup winners.\n\nMagesi already have two Zimbabweans in their ranks, goalkeeper and captain Elvis Chipezeze and winger Edmore Chirambadare. The duo was instrumental as Magesi FC rose to be Carling Knockout Cup winners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/23040750/Lynoth-Chikuhwa.jpg",
            "description": "<p>By Soccer24  LYNOTH Chikuhwa has been linked with South African top-flight league side Magesi FC. According to FarPost.co.za, Magesi are making efforts to snap the 2024 Castle Lager Premier Soccer League Golden Boot award winner. The club is reportedly hoping to sign the striker on free transfer in January. Chikuhwa’s contract with Highlanders FC will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-golden-boot-award-winner-lynoth-chikuhwa-linked-with-sa-top-flight-football-club/\">PSL Golden Boot award winner Lynoth Chikuhwa linked with SA top flight football club</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "Mayor Mafume admits Harare water supply is insufficient amid ongoing crisis",
            "url": "https://www.newzimbabwe.com/mayor-mafume-admits-harare-water-supply-is-insufficient-amid-ongoing-crisis/",
            "content": "By Staff Reporter\n\nMAYOR Jacob Mafume has admitted that the City of Harare (CoH) is failing to provide adequate water supply to residents and ratepayers, a situation that has plunged many suburbs into a severe water crisis.\n\nMafumes admission comes at a time when residents of Harare are grappling with prolonged water shortages. Many areas experience days without a drop of clean water, worse off with this happening towards the festive season.\n\nThe city premier said government should help provide water to Harare on a day-to-day basis.\n\nThere is still a significant shortage of supply in terms of what we need to supply on a day-to-day basis, and that had to be dealt with through a number of measures that require a whole of government approach.\n\nWe have since approached central government and made a request in terms of the pumping capacity, the civil works that have been done at Morton Jaffray, and also give an update on what needs to be done once we do those, we would be able to at least get 500 mega litres per day. That will significantly alleviate the water shortages that we were currently facing, said Mafume.\n\nMafume also noted that the prolonged water supply cuts are being affected by the recent power surge that damaged water treatment equipment.\n\nWe understand that there are suburbs that have not had water in the currents few days, after our shutdown, we had a power surge and the power surge created the situation where the water flowed back into the plants and the pumps that we used to pump the water, were water locked, or they were flooded.\n\nThey are currently being dried by a specialist company that is doing the work, and one of the pumps will be finished within the next few 48 hours.\n\nWe have already started pumping in certain suburbs, Glenview, Kuwadzana, and so forth, we will be pumping into the CBD, or we are already pumping the effects that will be felt as the day progresses, said Mafume\n\nThe mayor also acknowledged the environmental concerns at Lake Chivero being polluted and requires various stakeholders to fix the problem while stating that the water body is managed by Zimbabwe National Water Authority (ZINWA) and the National Parks, while the CoH claims that they treat the lakes water each day.\n\nWe are also concerned and working to deal with the issue of the pollution in Lake Chiveroit is a whole of government responsibility, we get our water from Lake Chivero but it is managed by ZINWA and also by National Parks.\n\nIt requires all stakeholders to work together to maintain its environmentally friendly and to make it cleaner, it is in our interest to have Lake Chivero clean because it also reduces the chemicals we are using or in other words we get more water for the chemicals that we will be using, if the water is clean.\n\nWe treat the water, and we can assure the residents that it is safer for them to drink Harare water to where we are supplying than to get water from unprotected sources and untreated water bodies especially at this time where we have infectious disease outbreaks which is very irresponsible for stakeholders, NGOs, government officials or anybody to move around trying to say that Harare water is not safe for consumption.\n\nIf other people need to take extra precautions, they can. If you need to boil it, if you need to do anything, you do it, said Mafume.\n\nHe, however, assured stakeholders that CoH is going to look into the causes of pollution at Lake Chivero.\n\nWith the festive season fast approaching, Mayor Mafume assured residents that it will provide enough water, as they are not going on holiday.\n\nThe CoH doesnt go on Christmas holiday, we work 24/7 all year round, none of the directorates have gone on any holiday nor have we authorised any holidays.\n\nWe are also going to make sure that we try to find any extra energy sources for our key points so that we deal with energy shortages as they occur from time to time but we want to assure, the citizens of Harare that we are here at work.\n\nWe will not go for any Christmas breaking to make sure that they receive water and that it is safe for them to use, and that we increase the water supply to many suburbs as we possibly can, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/04203500/Harare-Water-Crisis.jpeg",
            "description": "<p>By Staff Reporter  MAYOR Jacob Mafume has admitted that the City of Harare (CoH) is failing to provide adequate water supply to residents and ratepayers, a situation that has plunged many suburbs into a severe water crisis. Mafume’s admission comes at a time when residents of Harare are grappling with prolonged water shortages. Many areas</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mayor-mafume-admits-harare-water-supply-is-insufficient-amid-ongoing-crisis/\">Mayor Mafume admits Harare water supply is insufficient amid ongoing crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘Promise of a unified Zimbabwe dashed due to toxic politics’— says Chamisa, claims Unity Day has lost its lustre",
            "url": "https://www.newzimbabwe.com/promise-of-a-unified-zimbabwe-dashed-due-to-toxic-politics-says-chamisa-claims-unity-day-has-lost-its-lustre/",
            "content": "By Alois Vinga\n\nOPPOSITION leader, Nelson Chamisa says the promise of a unified nation has been sacrificed on the altar of toxic politics, which continues to widen the gap between the haves and have nots in the country.\n\nNational Unity Day is a public holiday in Zimbabwe and is observed on December 22 every year. This day commemorates the merger of two political parties, Zanu-PF and PF-Zapu on December 22, 1987.\n\nFollowing ethnic and political differences between ZANU and ZAPU that led to violence and civil unrest leading to massacres known as Gukurahundi, which claimed 20,000 lives between 1983 and 1987, to stem the violence, ZANU leader, Robert Mugabe, and ZAPU frontman Joshua Nkomo signed the historic Unity Accord.\n\nThe pact formed a single united nationalist political party under the name Zimbabwe African National Union Patriotic Front (Zanu PF).\n\nThe National Unity Day has been a public holiday since 1997 as a day to reflect on efforts towards peace and reconciliation in Zimbabwe.\n\nSpeaking on the commemorations, Chamisa said the day now signifies a broken promise and a missed golden opportunity.\n\nUnity Day reminds us of all of the elusive promise of a united and prosperous Zimbabwe! A promise that has been broken by bad governance, toxicity, inequality, mistrust and injustice. True unity is not about unity of political parties or individuals, he said.\n\nThe trailblazing opposition leader, who has remained focused on his dream and vision to take over the reins someday, said unity of all citizens is founded on shared values and mutual ideals built on love, peace and shared prosperity.\n\nHe underscored that unity must neither be a one-day event nor a concept on paper but has to be practiced, palpable and experienced daily in all facets of life as he reiterated that during his tenure such values will be respected.\n\nIn the coming Zimbabwe, there will be new and genuine unity, powered by love and mutual respect, where every Zimbabwean is proud to belong and their dignity is protected and well treasured, added Chamisa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Alois Vinga OPPOSITION leader, Nelson Chamisa says the promise of a unified nation has been sacrificed on the altar of toxic politics, which continues to widen the gap between the ‘haves’ and ‘have nots’ in the country. National Unity Day is a public holiday in Zimbabwe and is observed on December 22 every year.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/promise-of-a-unified-zimbabwe-dashed-due-to-toxic-politics-says-chamisa-claims-unity-day-has-lost-its-lustre/\">‘Promise of a unified Zimbabwe dashed due to toxic politics’— says Chamisa, claims Unity Day has lost its lustre</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "Kavango’s US$13 million injection to boost gold mining ventures in Zimbabwe",
            "url": "https://www.newzimbabwe.com/kavangos-us13-million-injection-to-boost-gold-mining-ventures-in-zimbabwe/",
            "content": "By Alois Vinga\n\nKAVANGO Resources, a company listed on the London Stock Exchange with gold projects in Zimbabwe, has made a significant financial move by securing 10 million (US$13 million) as part of an increased strategic financing package.\n\nThis financing shows strong backing towards mineral exploration from major stakeholders.\n\nOperating through its Zimbabwean subsidiary, Kavango Zimbabwe, established in July 2023, the company is targeting several historic high-grade gold mines in the Matabeleland region with a focus on economic bulk mining.\n\nKavangos chief executive officer, Ben Turney confirmed substantial funding has been secured to launch the Hillside Gold Project in 2025.\n\nWe have completed the first phase of exploration and believe we have identified two potential gold mines. One of these is an underground, high-grade opportunity that we hope to mine using a spiral decline.\n\nSpiral declines are a modern form of mining, developed in Australia over the last 25 years. They enable bulk mining of underground, lode gold systems. This is a relatively new approach in Zimbabwe, which we hope to pioneer.\n\nWe have built a very strong exploration and mining team in Bulawayo. We look forward to what they can achieve next year, he said.\n\nKavango also aims to use a prospectus to list its shares on the Victoria Falls Stock Exchange, signalling its intent to broaden market exposure.\n\nEarlier this month, Kavango announced the discovery of substantial tungsten and other strategic elements at its Hillside Project. These findings stem from the initial phase of Inductively Coupled Plasma (ICP) testing on core samples from the site.\n\nWith its newly secured finance package, Kavango moves confidently into 2025 as it aims to bring modern mining practices to its Hillside Gold Project. If it is successful, this promises to be a pioneering project in the development of Zimbabwes extremely large goldfields.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/24201025/Gold-Mining.jpg",
            "description": "<p>By Alois Vinga KAVANGO Resources, a company listed on the London Stock Exchange with gold projects in Zimbabwe, has made a significant financial move by securing £10 million (US$13 million) as part of an increased strategic financing package. This financing shows strong backing towards mineral exploration from major stakeholders. Operating through its Zimbabwean subsidiary, Kavango</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavangos-us13-million-injection-to-boost-gold-mining-ventures-in-zimbabwe/\">Kavango’s US$13 million injection to boost gold mining ventures in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "Civil servants, government showdown looms in 2025 over low salaries, poor working conditions",
            "url": "https://www.newzimbabwe.com/civil-servants-government-showdown-looms-in-2025-over-low-salaries-poor-working-conditions/",
            "content": "By Tapiwa Svondo\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) has issued a warning to government as it reflects on a tumultuous financial year 2024, describing the season as an annus horribilis for workers.\n\nThe ZCTU outlined a catalogue of grievances that have left the labour force struggling, hinting of a confrontational approach as they head into 2025.In a statement, the union lamented the absence of meaningful improvements in workers conditions, highlighting critical issues such as inadequate wages, soaring inflation, and a failing healthcare system, while indicating that there is nothing to celebrate about the year 2024.The much-anticipated improvement to the plight of the working people did not materialize. During the course of the year, the working people of Zimbabwe have been confronted with among others: Lack of serious consultation on serious policy issues like the introduction of the Zig currency Unilateral devaluation the Zig without due care of its implications to the workers and ordinary Zimbabweans; Poverty/slavery wages that have failed to match the poverty datum line of over US$500 against a wage of around US$300;Shocking price increases and over the roof inflation levels; Punitive taxation regime on workers and Zimbabweans as a whole; A health delivery system that has failed to recover from collapse and innocent Zimbabweans continue to die of treatable diseasesA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salariesErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nThe ZCTU outlined a catalogue of grievances that have left the labour force struggling, hinting of a confrontational approach as they head into 2025.\n\nIn a statement, the union lamented the absence of meaningful improvements in workers conditions, highlighting critical issues such as inadequate wages, soaring inflation, and a failing healthcare system, while indicating that there is nothing to celebrate about the year 2024.The much-anticipated improvement to the plight of the working people did not materialize. During the course of the year, the working people of Zimbabwe have been confronted with among others: Lack of serious consultation on serious policy issues like the introduction of the Zig currency Unilateral devaluation the Zig without due care of its implications to the workers and ordinary Zimbabweans; Poverty/slavery wages that have failed to match the poverty datum line of over US$500 against a wage of around US$300;Shocking price increases and over the roof inflation levels; Punitive taxation regime on workers and Zimbabweans as a whole; A health delivery system that has failed to recover from collapse and innocent Zimbabweans continue to die of treatable diseasesA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salariesErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nIn a statement, the union lamented the absence of meaningful improvements in workers conditions, highlighting critical issues such as inadequate wages, soaring inflation, and a failing healthcare system, while indicating that there is nothing to celebrate about the year 2024.\n\nThe much-anticipated improvement to the plight of the working people did not materialize. During the course of the year, the working people of Zimbabwe have been confronted with among others: Lack of serious consultation on serious policy issues like the introduction of the Zig currency Unilateral devaluation the Zig without due care of its implications to the workers and ordinary Zimbabweans; Poverty/slavery wages that have failed to match the poverty datum line of over US$500 against a wage of around US$300;Shocking price increases and over the roof inflation levels; Punitive taxation regime on workers and Zimbabweans as a whole; A health delivery system that has failed to recover from collapse and innocent Zimbabweans continue to die of treatable diseasesA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salariesErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nThe much-anticipated improvement to the plight of the working people did not materialize. During the course of the year, the working people of Zimbabwe have been confronted with among others: Lack of serious consultation on serious policy issues like the introduction of the Zig currency\n\n Unilateral devaluation the Zig without due care of its implications to the workers and ordinary Zimbabweans; Poverty/slavery wages that have failed to match the poverty datum line of over US$500 against a wage of around US$300;Shocking price increases and over the roof inflation levels; Punitive taxation regime on workers and Zimbabweans as a whole; A health delivery system that has failed to recover from collapse and innocent Zimbabweans continue to die of treatable diseasesA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salariesErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\n Unilateral devaluation the Zig without due care of its implications to the workers and ordinary Zimbabweans; Poverty/slavery wages that have failed to match the poverty datum line of over US$500 against a wage of around US$300;\n\nShocking price increases and over the roof inflation levels; Punitive taxation regime on workers and Zimbabweans as a whole; A health delivery system that has failed to recover from collapse and innocent Zimbabweans continue to die of treatable diseasesA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salariesErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nShocking price increases and over the roof inflation levels; Punitive taxation regime on workers and Zimbabweans as a whole; A health delivery system that has failed to recover from collapse and innocent Zimbabweans continue to die of treatable diseases\n\nA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salariesErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nA collapsed education system that has been characterized by chaos and constant threats of industrial action from teachers over low salaries\n\nErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.Among other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nErratic supply of water and electricity that has decimated industrial production; Loss of jobs, high unemployment and underemployment levels.\n\nAmong other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.Institutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nAmong other concerns were the low-capacity utilization in industry, serious brain drain in the health sector and other critical sectors while informalisation of the economy was regrettable.\n\nInstitutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.Given the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nInstitutional collapse, decay and corruption; Endemic poverty afflicting in excess of 80% of the population; Threats, arrests of trade unionists, civic leaders by a paranoid State.\n\nGiven the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.ZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nGiven the above, therefore there has been nothing much to celebrate about in 2024 as workers continue to suffer immensely, further reads the statement.\n\nZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.Workers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nZCTU specifically condemned the governments proposed tax reforms, which include a Fast-Food Tax and a Betting Tax, while vowing to fight the economic hemorrhage in 2025.\n\nWorkers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.So desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nWorkers should come back prepared to fight against economic hemorrhage as the year 2025 also looks gloomy for workers. The government has already put in place a highly punishing taxation regime.\n\nSo desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.The Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nSo desperate is the Finance Minister that his 2025 budget is hinged on brutal taxation by introducing other taxes such as Fast-Food Tax, Betting Tax and Plastic Bag tax.\n\nThe Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.Excessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nThe Minister should realize that overtaxing a nation can have negative consequences as people will begin to think on ways to evade paying taxes; it can lead to dissatisfaction, protests, and even revolution.\n\nExcessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.He should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nExcessive taxation can also make a nation less competitive in the global market, potentially leading to reduced foreign investment.\n\nHe should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.Ultimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nHe should also realise that excessive taxation can limit individual freedom and choice, as people have less disposable income to make their own decisions.\n\nUltimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\nUltimately, high tax rates can cause brain drain as it drives talented individuals to seek opportunities in lower-tax countries, ZCTU said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/28170228/zimbabwe-civil-servants-strike.webp",
            "description": "<p>By Tapiwa Svondo  THE Zimbabwe Congress of Trade Unions (ZCTU) has issued a warning to government as it reflects on a tumultuous financial year 2024, describing the season as an “annus horribilis” for workers. The ZCTU outlined a catalogue of grievances that have left the labour force struggling, hinting of a confrontational approach as they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/civil-servants-government-showdown-looms-in-2025-over-low-salaries-poor-working-conditions/\">Civil servants, government showdown looms in 2025 over low salaries, poor working conditions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "Zimbabwe kicks-off project to reduce mercury use in artisanal and small-scale gold mining",
            "url": "https://www.newzimbabwe.com/zimbabwe-kicks-off-project-to-reduce-mercury-use-in-artisanal-and-small-scale-gold-mining/",
            "content": "By IOL\n\nZIMBABWES government is taking action to support a more responsible artisanal gold mining sector, launching a $23.7 million USD project to reduce mercury across mine sites in the country.\n\nA toxic chemical used to extract gold from ore, mercury damages the lungs, skin, and eyes. The chemical can travel far from where it is released, polluting the air, water, and soil. Furthermore, it bioaccumulates up the food chain.\n\nIn Zimbabwe, more than 300 000 people work in artisanal gold mining, with the sector contributing to more than 40% of the countrys mineral exports.\n\nAcross the country, 96% of artisanal gold mine sites use mercury, with miners often forgoing protective equipment and risking exposure to toxic fumes. Zimbabwes artisanal gold mining activities result in more than 24 tonnes of mercury being released annually.\n\nThe five-year planetGOLD Zimbabwe project is financially supported by the Global Environment Facility (GEF) and implemented by the United Nations Environment Programme (UNEP). The project is executed by the international non-profit organization, IMPACT, in close coordination with the government of Zimbabwe.\n\nThe project will work together with local communities to reduce the use of mercury in artisanal and small-scale gold miningthe worlds largest source of anthropogenic emissions of mercury pollution while improving the health and lives of local mining communities. The Zimbabwe project is part of a global programme implemented in 25 countries.\n\nThe planetGOLD Zimbabwe project plans to support 7,500 men and women at 11 districts in Zimbabwe, reducing mercury use by 4.85 tonnes. In addition to mercury reduction, the project aims to support formalization of the artisanal gold mining sector and increasing miners access to finance.\n\nThis will lead to the adoption of mercury-free technologies and promote more responsible and traceable gold supply chains. The project officially launched in November in Harare, with an Inception Workshop that brought together stakeholders to discuss how planetGOLD Zimbabwe will support a more responsible artisanal gold sector.\n\nIn a keynote speech, Edward Samuriwo, Acting Permanent Secretary of the Ministry of Environment, Climate, and Wildlife, outlined the projects significance in addressing the challenges of mercury use in Zimbabwes gold mining sector.\n\nSamuriwo reaffirmed Zimbabwes commitment to the Minamata Convention on Mercury and emphasized the pivotal role the planetGOLD project will play in supporting the countrys efforts to eliminate mercury use in artisanal gold mining through the implementation of Zimbabwes National Action Plan.\n\nZimbabwe ratified the Minamata Convention on Mercury in 2021. In its National Action Plan, the country committed to strong cooperation among all stakeholders including government agencies and supply chain actors to improve the health and safety of communities involved in artisanal gold mining.\n\nThrough the launch of the planetGOLD project, Zimbabwe moves towards more responsible artisanal gold mining. We look forward to working with all stakeholders to create a sustainable change in the sector, said Yann Lebrat, IMPACTs Deputy Executive Director.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/19142937/Illegal-miners-at-a-dam-trying-to-sieve-gold-from-the-soil-dug-from-the-closed-shafts-using-water-and-self-made-sieves-in-Benoni-Picture-Boxer-Ngwenya-Independent-Newspapers.webp",
            "description": "<p>By IOL ZIMBABWE’S government is taking action to support a more responsible artisanal gold mining sector, launching a $23.7 million USD project to reduce mercury across mine sites in the country. A toxic chemical used to extract gold from ore, mercury damages the lungs, skin, and eyes. The chemical can travel far from where it</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-kicks-off-project-to-reduce-mercury-use-in-artisanal-and-small-scale-gold-mining/\">Zimbabwe kicks-off project to reduce mercury use in artisanal and small-scale gold mining</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "Calls for village title deeds in Zimbabwe as Mnangagwa issues same to A1 and A2 farmers",
            "url": "https://www.newzimbabwe.com/calls-for-village-title-deeds-in-zimbabwe-as-mnangagwa-issues-same-to-a1-and-a2-farmers/",
            "content": "By Anna Chibamu\n\nTHE Coalition for Market Liberal Solutions (COMALISO) Zimbabwe says rural folk need to be disentangled from a vicious cycle of poverty through a bankable land ownership system.\n\nIn a statement released this weekend, COMALISO commended governments efforts in giving land reform programme beneficiaries title deeds but also called for those who lost their land to be compensated and the rural inhabitants to be issued title deeds.We applaud President Mnangagwas re-admission of commercial farmland to the free-market value chain but hoping that previously dispossessed citizens receive full compensation.However, with 60% of Zimbabweans residing on untitled land, delusions of rural land ownership being an exclusive preserve of the President and Traditional Leaders keeps those citizens locked in a vicious circle of poverty, antagonism, anxiety, and prostate subserviency, read part of COMALISOs statement.If equitable land distribution is not prioritised, add the impact of sustainable energy deficit, we risk turning Zimbabwe into a desert. Preventing rural title deeds marginalises communities, stifles agricultural productivity and economic development.COMALISO also highlighted the importance of land tenure security which it said was critical for rural citizens to also invest in their land and adopt modern agricultural practices.The lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.Last Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nIn a statement released this weekend, COMALISO commended governments efforts in giving land reform programme beneficiaries title deeds but also called for those who lost their land to be compensated and the rural inhabitants to be issued title deeds.\n\nWe applaud President Mnangagwas re-admission of commercial farmland to the free-market value chain but hoping that previously dispossessed citizens receive full compensation.However, with 60% of Zimbabweans residing on untitled land, delusions of rural land ownership being an exclusive preserve of the President and Traditional Leaders keeps those citizens locked in a vicious circle of poverty, antagonism, anxiety, and prostate subserviency, read part of COMALISOs statement.If equitable land distribution is not prioritised, add the impact of sustainable energy deficit, we risk turning Zimbabwe into a desert. Preventing rural title deeds marginalises communities, stifles agricultural productivity and economic development.COMALISO also highlighted the importance of land tenure security which it said was critical for rural citizens to also invest in their land and adopt modern agricultural practices.The lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.Last Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nWe applaud President Mnangagwas re-admission of commercial farmland to the free-market value chain but hoping that previously dispossessed citizens receive full compensation.\n\nHowever, with 60% of Zimbabweans residing on untitled land, delusions of rural land ownership being an exclusive preserve of the President and Traditional Leaders keeps those citizens locked in a vicious circle of poverty, antagonism, anxiety, and prostate subserviency, read part of COMALISOs statement.If equitable land distribution is not prioritised, add the impact of sustainable energy deficit, we risk turning Zimbabwe into a desert. Preventing rural title deeds marginalises communities, stifles agricultural productivity and economic development.COMALISO also highlighted the importance of land tenure security which it said was critical for rural citizens to also invest in their land and adopt modern agricultural practices.The lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.Last Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nHowever, with 60% of Zimbabweans residing on untitled land, delusions of rural land ownership being an exclusive preserve of the President and Traditional Leaders keeps those citizens locked in a vicious circle of poverty, antagonism, anxiety, and prostate subserviency, read part of COMALISOs statement.\n\nIf equitable land distribution is not prioritised, add the impact of sustainable energy deficit, we risk turning Zimbabwe into a desert. Preventing rural title deeds marginalises communities, stifles agricultural productivity and economic development.COMALISO also highlighted the importance of land tenure security which it said was critical for rural citizens to also invest in their land and adopt modern agricultural practices.The lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.Last Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nIf equitable land distribution is not prioritised, add the impact of sustainable energy deficit, we risk turning Zimbabwe into a desert. Preventing rural title deeds marginalises communities, stifles agricultural productivity and economic development.\n\nCOMALISO also highlighted the importance of land tenure security which it said was critical for rural citizens to also invest in their land and adopt modern agricultural practices.The lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.Last Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nCOMALISO also highlighted the importance of land tenure security which it said was critical for rural citizens to also invest in their land and adopt modern agricultural practices.\n\nThe lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.Last Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nThe lobby group urged Parliament to reform the countrys Constitution and guarantee that Zimbabweans, particularly those in rural areas received title support and rights as their urban and commercial farm counterparts to build a prosperous nation.\n\nLast Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.Mnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nLast Friday, Mnangagwa handed over title deeds to an estimated 23,500 commerical and 360,000 smallholder farmers.\n\nMnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.He urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nMnangagwa said this was done to empower the beneficiaries of the land reform programme by giving them security of tenure to unlock the value of the land allowing it to be used as collateral.\n\nHe urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.Most Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nHe urged financial institutions to embrace the title deeds inorder to improve farmer access to finance and capital.\n\nMost Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.It is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nMost Zimbabwean farmers, who benefitted from the land reform programme have not done so well due to lack of financial capital as banks were reluctant to provide finances without clear guarantees from the State.\n\nIt is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\nIt is yet to be seen if the banks will now give capital to these farmers as title deeds can now be used as collateral for farming loans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/21044156/IMG-20241220-WA0042-696x464-1.jpg",
            "description": "<p>By Anna Chibamu THE Coalition for Market Liberal Solutions (COMALISO) Zimbabwe says rural folk need to be disentangled from a vicious cycle of poverty through a bankable land ownership system. In a statement released this weekend, COMALISO  commended government’s efforts in giving land reform programme beneficiaries’ title deeds but also called for those who lost</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/calls-for-village-title-deeds-in-zimbabwe-as-mnangagwa-issues-same-to-a1-and-a2-farmers/\">Calls for village title deeds in Zimbabwe as Mnangagwa issues same to A1 and A2 farmers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "Employee disgruntled over unpaid wages turns robber, sentenced to 10 years in prison",
            "url": "https://www.newzimbabwe.com/employee-disgruntled-over-unpaid-wages-turns-robber-sentenced-to-10-years-in-prison/",
            "content": "By Staff Reporter\n\nA DISGRUNTLED employee at a Mutare mine has been jailed for holding hostage his boss and fellow workers demanding outstanding wages, before driving off in a stolen vehicle.\n\nAccused person, Josiah Saungweme (30) of Musi village recently appeared at Mutare Magistrates Court facing robbery charges.\n\nHe was slapped with a 10-year jail term of which two years were set aside on condition of good behaviour. Saungweme will, therefore, effectively serve eight years behind bars.\n\nAgreed facts were that on July 14, 2024, around 9am, accused person accosted his employer, who is complainant in the matter, at his workplace at Doornfontein Vantage Mine.\n\nSaungweme demanded his outstanding wages while forcibly taking keys to complainants beige Nissan X-Trail. The violent action prompted complainant to surrender US$260.\n\nThe court heard that accused person went on to forcemarch everyone present into the complainants car and drove it towards Whitehouse shopping centre.\n\nIt was heard that on the way back from shops, Saungweme pushed one of the workers out of the vehicle after he complained of his behaviour.\n\nUpon arrival at Doornfontein Vantage Mine, accused person armed himself with a machete, ordered everyone to get out of the car before driving off. Inside the car was a Redmi cellphone belonging to complainant.\n\nThe matter was reported at Zimbabwe Republic Police (ZRP) Dzivarasekwa station.\n\nOn September 14 this year, Saungweme was nabbed at Bezel Bridge by detectives from the Criminal Investigations Department (CID) Mutare. His arrest led to the recovery of the Nissan X-Trail valued at US$5,000 dumped in the Wengezi area, Mutare in Manicaland while the cellphone was found in Zvimba, Mashonaland West province.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/07053229/Mutare-Court.jpg",
            "description": "<p>By Staff Reporter  A DISGRUNTLED employee at a Mutare mine has been jailed for holding hostage his boss and fellow workers demanding outstanding wages, before driving off in a stolen vehicle. Accused person, Josiah Saungweme (30) of Musi village recently appeared at Mutare Magistrates’ Court facing robbery charges. He was slapped with a 10-year jail</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/employee-disgruntled-over-unpaid-wages-turns-robber-sentenced-to-10-years-in-prison/\">Employee disgruntled over unpaid wages turns robber, sentenced to 10 years in prison </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "‘Mnangagwa won’t be around come 2030’— vows veteran musician Clive Malunga, labels him ‘coward’",
            "url": "https://www.newzimbabwe.com/mnangagwa-wont-be-around-come-2030-vows-veteran-musician-clive-malunga-labels-him-coward/",
            "content": "By Mary Taruvinga\n\nVETERAN musician, Clive Malunga has frowned upon President Emmerson Mnangagwas aspirations to seek a third presidential term, arguing that the leaders survival thus far is not due to his shrewdness, but rather the will of God.\n\nIn a video that has gained widespread attention, Malunga, a war veteran, challenged Mnangagwas presidency, asserting that the 82-year-old Zanu PF leader was not divinely appointed.\n\nVaMnangagwa 2030 havaisvike. Kana vakaita zvekutamba 2030 havaisvike. Sei ndirikudaro nekuti vaMnangagwa havasi Mwari, stated the founder of the Jenaguru Arts Centre.\n\nMalunga expressed disbelief at the presidents claims of remaining in power past 2030, emphasising that life is a gift from God that everyone should seek.\n\nIn a later post on his X account, Malunga directly confronted Mnangagwa and anyone who might have been offended by his remarks, affirming his stance.\n\nYes, I clearly said it, Mnangagwa wont see 2030 or even 2026 because he isnt God and he wasnt appointed by God to be President of Zimbabwe.\n\nIn fact, Mnangagwa is a useless coward, Ive nothing to fear and here is me, Zimbabwe is boiling whilst hes busy creating his dynasty, to hell, he declared.\n\nThe award-winning creator of the hit song Nesango articulated his concerns over the socio-economic issues plaguing Zimbabwe, stating that they indicate a failing government.\n\nSince the ousting of long-time leader Robert Mugabe in a military coup in 2017, criticising the president has become a serious offence in Zimbabwe, leading to the arrest and prosecution of hundreds albeit without convictions.\n\nGOD IS IN IT.pic.twitter.com/LbXjFdBcCj\n\n Clive Malunga (@JenaguruV)December 21, 2024\n\nThis is not the first time Malunga has drawn attention for his outspoken views.\n\nIn 2022, he denounced Mnangagwas administration as corrupt, retrogressive, and selfish.\n\nHe criticised the presidents lavish trips abroad, challenging him to cultivate the same favourable conditions in Zimbabwe that he admires in other countries.\n\nMalunga also lamented the underutilisation of the nations abundant natural resources while the populace continues to wallow in abject poverty.\n\nAdditionally, he called for accountability regarding the allegedly missing US$15 billion in diamond revenue from Chiadzwa, among other issues.\n\nHis recent comments have ignited discussions about factional disputes within the ruling party, with some suggesting that Malunga has the backing of a Zanu PF clique giving him the spine to attack Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051558/zdf-Mnangagwa-0.jpeg",
            "description": "<p>By Mary Taruvinga  VETERAN musician, Clive Malunga has frowned upon President Emmerson Mnangagwa’s aspirations to seek a third presidential term, arguing that the leader’s survival thus far is not due to his shrewdness, but rather the will of God. In a video that has gained widespread attention, Malunga, a war veteran, challenged Mnangagwa’s presidency, asserting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-wont-be-around-come-2030-vows-veteran-musician-clive-malunga-labels-him-coward/\">‘Mnangagwa won’t be around come 2030’— vows veteran musician Clive Malunga, labels him ‘coward’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        },
        {
            "title": "2 dead as SA bound buses pile up after one of them hits donkey",
            "url": "https://www.newzimbabwe.com/2-dead-as-sa-bound-buses-pile-up-after-one-of-them-hits-donkey/",
            "content": "By Staff Reporter\n\nTWO people have been confirmed dead following an accident involving three South Africa bound buses along Masvingo-Beitbridge highway Sunday morning.\n\nThe crash occurred in the early hours of Sunday at the 197km peg, involving buses from Tombs Motorways, Rimbi Tours, and Mbokodo.\n\nIt has been reported that a Tombs bus struck a donkey, prompting the crew of a nearby Mbokodo bus to stop and assist, but their efforts were disrupted when a speeding Rimbi bus crashed into the two stationary buses.\n\nAccording to an eyewitness, who was speaking in a video posted on social media, Rimbis driver was speeding.\n\nThree buses have collided just after Bubi. Tombs hit a donkey and it died on the spot. So Mbokodo pulled over to help and whilst they were still stationary, an overspeeding and probably sleeping Rimbi bus driver hit them, the eyewitness said.\n\nMany people are said to have been seriously injured.\n\nMasvingo provincial police spokesperson, Inspector Kudakwashe Dhewa confirmed the death of two people in the accident.\n\nTwo people lost their lives, details are still sketchy, and police are yet to get in touch with the deceaseds next of kin, Dhewa said.\n\nRimbi Tours operating license was suspended in January last year following a fatal accident involving one of its buses which was racing with a Zebra Kiss bus along the Harare-Nyamapanda highway.\n\nThe accident claimed the life of a bus conductor leaving several others injured.\n\nThe suspension of the companys operating licence was then lifted after it submitted a compelling safety policy to the government to avert similar incidents in future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/22172738/IMG-20241222-WA0013.jpg",
            "description": "<p>By Staff Reporter  TWO people have been confirmed dead following an accident involving three South Africa bound buses along Masvingo-Beitbridge highway Sunday morning. The crash occurred in the early hours of Sunday at the 197km peg, involving buses from Tombs Motorways, Rimbi Tours, and Mbokodo. It has been reported that a Tombs bus struck a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/2-dead-as-sa-bound-buses-pile-up-after-one-of-them-hits-donkey/\">2 dead as SA bound buses pile up after one of them hits donkey</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "23 Dec 2024"
        }
    ]
}