{
    "news": [
        {
            "title": "Ukraine leader Zelensky willing to give up presidency in exchange for NATO membership",
            "url": "https://www.newzimbabwe.com/ukraine-leader-zelensky-willing-to-give-up-presidency-in-exchange-for-nato-membership/",
            "content": "By BBC\n\nVOLODYMYR Zelensky said he would be willing to give up his presidency in exchange for peace ahead of the third anniversary of Russias full-scale invasion of Ukraine.\n\nIf to achieve peace you really need me to give up my post  Im ready. I can trade it for Nato membership, if there are such conditions, the Ukrainian president said in response to a question during a news conference.\n\nHis comments came after US President Donald Trump called Zelensky a dictator without elections earlier in the week.\n\nI wasnt offended, but a dictator would be, Zelensky, who was democratically elected in May 2019, responded on Sunday.\n\nI am focused on Ukraines security today, not in 20 years, I am not going to be in power for decades, he added.\n\nAccording to Ukrainian law, elections are suspended under martial law, which has been in place since Russias full-scale invasion in February 2022.\n\nZelensky is meeting Western leaders on Monday, some in person in Kyiv and some online, as they work out how to provide a post-war security where the US will not.\n\nHe said the topic of Ukraine joining Nato would be on the table at the meeting but he did not know how the discussions would finish. He hoped the meeting would be a turning point.\n\nOn the topic of Trump, Zelensky said that he wanted to see the US president as a partner to Ukraine and more than a mediator between Kyiv and Moscow.\n\nI really want it to be more than just mediationthats not enough, he said.\n\nWith the White House demanding that it gets access to billions of dollars worth of Ukraines natural minerals in exchange for the military aid it provided to date  and could in the future  Zelensky said US help so far had been agreed as grants, not loans.\n\nHe said he would not agree to a security deal which  in his words  would be paid off by generation after generation.\n\nWhen asked about a potential mineral deal, Zelensky said we are making progress, adding that Ukrainian and US officials had been in touch.\n\nWe are ready to share, the Ukrainian leader said, but made clear that Washington first needed to ensure Russian President Vladimir Putin ends this war.\n\nZelensky appeared relaxed as he faced questions from the worlds media. In previous years he had been more impassioned and even emotional, but on Sunday his approach was business-like.\n\nIf Ukraines leader rejects a Donald Trump-shaped peace proposal he does not agree with  as he suggested today  then it could have lasting consequences for the course of this war.\n\nZelenskys comments came hours after Russia launched its largest single drone attack on Ukraine yet, Ukrainian officials said.\n\nOn Saturday night, Ukraines Air Force Command spokesman Yuriy Ignat said a record 267 Russian drones were launched in a single, coordinated attack on the country.\n\nThirteen regions were targeted and while many of the drones were repelled, those that were not caused destruction to infrastructure and at least three casualties, emergency services said.\n\nUkraines Air Force reported that 138 of the drones were shot down and 119, which were decoy drones, were lost without negative consequences, likely due to jamming.\n\nIn Kyiv, the attack meant six hours of air alerts.\n\nIn a statement, Zelensky thanked Ukraines emergency services for their response and called for the support of Europe and US in facilitating a lasting and just peace.\n\nIn a post on X, Ukraines First Lady Olena Zelenska said that hundreds of drones had brought death and destruction overnight.\n\nIt was another night of explosions, burning houses and cars, and destroyed infrastructure, she wrote. Another night when people prayed for their loved ones to survive.\n\nOn Monday, the war will enter its fourth year.\n\nDiplomatic wrangling over a potential peace deal continues, with Ukraine, European allies and the US offering differing visions for how to end the conflict.\n\nThe US and Russia held preliminary talks in Saudi Arabia this week  without delegates from Europe, including Ukraine, present  which resulted in European leaders holding a hastily-arranged summit in Paris.\n\nZelensky criticised Ukraines exclusion from the US-Russia talks, saying Trump was living in a disinformation space governed by Moscow, prompting Trump to respond by calling the Ukrainian president a dictator.\n\nFrench President Emmanuel Macron is expected to visit Washington on Monday, while UK Prime Minister Sir Keir Starmer will be there on Thursday.\n\nSir Keir has publicly backed Zelensky, reiterating the UKs ironclad support for Kyiv, and said he would discuss the importance of Ukraines sovereignty when he speaks to Trump.\n\nPope Francis  who is in hospital with respiratory illness  wrote in a remarks released on Sunday that the third anniversary of the war was a painful and shameful occasion for the whole of humanity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/16062050/Zelensky.jpg",
            "description": "<p>By BBC  VOLODYMYR Zelensky said he would be willing to “give up” his presidency in exchange for peace ahead of the third anniversary of Russia’s full-scale invasion of Ukraine. “If to achieve peace you really need me to give up my post – I’m ready. I can trade it for Nato membership, if there are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ukraine-leader-zelensky-willing-to-give-up-presidency-in-exchange-for-nato-membership/\">Ukraine leader Zelensky willing to give up presidency in exchange for NATO membership</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Zimbabwe, Albania, Oman and Sulawesi offer the ultimate international vacation in 2025",
            "url": "https://www.newzimbabwe.com/zimbabwe-albania-oman-and-sulawesi-offer-the-ultimate-international-vacation-in-2025/",
            "content": "TravelandTourWorld\n\nOvertourism has become an escalating issue in many of the worlds most sought-after travel destinations. The overwhelming influx of visitors to a single location can lead to severe consequences, including overcrowding, environmental degradation, strained infrastructure, reduced quality of life for locals, resource depletion, and a diminished travel experience.\n\nBeyond harming ecosystems, overtourism also drives up travel costs, with many iconic hotspotsespecially in Europeintroducing tourist taxes and strict visitor limitations in an attempt to curb excessive footfall.\n\nIf youre looking to escape the crowds and explore destinations that remain largely untouched by mass tourism, consider these underrated travel gems, as highlighted by Independent.\n\nFor those dreaming of an African safari without the overwhelming crowds of Kenya or South Africa, Zimbabwe offers an authentic and intimate wildlife experience. The country is home to Hwange National Park, one of Africas largest game reserves, spanning 14,600 square kilometers and teeming with elephants, lions, and rhinos.\n\nZimbabwe is also home to one of the worlds most breathtaking natural wondersVictoria Falls, the largest waterfall on Earth, where the thunderous cascade of water plunges into the Zambezi River, creating a spectacle like no other.\n\nMost visitors begin their adventure in Harare, a city lined with jacaranda-filled streets and cultural hotspots. The National Gallery of Zimbabwe is a must-visit, showcasing captivating photography, sculptures, and historical artifacts that provide insight into the countrys rich artistic heritage.\n\nWith majestic mountains, pristine beaches, and charming islands in the Ionian Sea, Albania offers an incredible variety of landscapes packed into a compact area. The Albanian Riviera is a paradise for travelers seeking a tranquil escape without the overwhelming crowds.\n\nFor nature lovers, Theth National Park is a must-visit, featuring breathtaking hiking trails and hidden wonders like the Blue Eye, a mesmerizing natural spring nestled in limestone rock formations. Not far from here, the Albanian Alps form part of the Dinaric Alps, offering jagged peaks, verdant valleys, and a stunning display of wildflowers in spring.\n\nMeanwhile, Albanias capital, Tirana, is a fascinating blend of historical and modern influences. Architectural highlights include the Tirana Pyramid, the striking Namazgah Mosque, and the eerie House of Leaves, a museum dedicated to Albanias secret surveillance history.\n\nOften overshadowed by its glitzy neighbors, Oman is a land of vast deserts, unspoiled beaches, and towering mountains, offering an authentic Arabian experience steeped in tradition. Unlike many Middle Eastern cities filled with skyscrapers, Oman embraces its heritage by constructing buildings in the neo-Islamic architectural stylestunning examples include the Sultan Qaboos Grand Mosque and the Royal Opera House in Muscat.\n\nFor breathtaking natural beauty, head to Jebel Akhdar, where pink damask roses bloom in spring, creating a mesmerizing landscape. Meanwhile, Jebel Shams, Omans highest peak, is home to Wadi Ghul, often dubbed the Grand Canyon of Arabia, where Egyptian vultures soar above abandoned mud-brick villages.\n\nFor a truly off-the-beaten-path experience, explore theMusandam Peninsula, famous for its fjord-like inlets, where crystal-clear waters meet rugged cliffs, making it a perfect spot for dhow cruises and snorkeling adventures.\n\nWhile Bali steals the spotlight, Sulawesi remains one of Indonesias most underrated treasures, offering stunning coastlines, vibrant marine life, and a rich cultural heritageall without the tourist rush.\n\nIn South Sulawesi, Tanjung Bira Beach boasts soft white sands and swaying palm trees, offering a serene alternative to Balis often overcrowded beaches. Meanwhile, divers can explore Bunaken National Marine Park, home to vibrant coral reefs teeming with over 2,000 species of fish.\n\nFor a cultural experience, head to Tana Toraja, a highland region where the Toraja people uphold their unique traditions, including elaborate funeral ceremonies and ancient stone graves. This regions dramatic landscapes and fascinating customs make it an unmissable destination for adventurous travelers.\n\nThe world is filled with extraordinary destinations that remain untouched by mass tourism. By venturing off the beaten path to places like Albania, Oman, Sulawesi, and Zimbabwe, you not only enjoy breathtaking landscapes and rich cultural experiences but also contribute to sustainable tourism efforts that protect the integrity of these hidden gems.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21060705/vic-falls.jpeg",
            "description": "<p>TravelandTourWorld Overtourism has become an escalating issue in many of the world’s most sought-after travel destinations. The overwhelming influx of visitors to a single location can lead to severe consequences, including overcrowding, environmental degradation, strained infrastructure, reduced quality of life for locals, resource depletion, and a diminished travel experience. Beyond harming ecosystems, overtourism also drives</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-albania-oman-and-sulawesi-offer-the-ultimate-international-vacation-in-2025/\">Zimbabwe, Albania, Oman and Sulawesi offer the ultimate international vacation in 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Triple murder suspect arrested after week on the run",
            "url": "https://www.newzimbabwe.com/triple-murder-suspect-arrested-after-week-on-the-run/",
            "content": "By James Muonwa\n\nAFTER spending a week on the run, a fugitive triple murder suspect was finally arrested Sunday in dramatic fashion in Hurungwe district of Mashonaland West province.\n\nTrymore Tore (37), who had earlier been mistakenly reported as having been arrested following the gruesome killing of his wife, niece and village head, was surrounded by villagers at a homestead where he had sought food and water.\n\nAccording to sources, the villagers swamped the suspect, who armed himself with a knife before attempting suicide by slitting his own throat.\n\nHe was later disarmed and taken to Karoi Hospital where is reportedly receiving treatment under police guard.\n\nImages of a bloodied Tore were awash on social media with villagers expressing relief that his reign of terror had been brought to an end.\n\nThe gruesome murders have sent shockwaves in the Chundu chieftainship of Hurungwe district.\n\nPolice say their preliminary investigations have established that Tore and his wife had longstanding domestic issues, which now deceased village head, Kuwesu Masawu (56) tried to resolve as mediator.\n\nAccording to the police, bodies of the three victims were found on February 17, 2025, at Mubairecheni Village, Chundu, Hurungwe.\n\nThe first victim who is the suspects wife, Moline Chibayanzara (21), was found dead in a pit latrine with multiple injuries on the head.\n\nThe body was wrapped in a blue blanket, police spokesperson, Commissioner Paul Nyathi said in a statement.\n\nThe second victim, a 17-year-old female juvenile, who is the suspects niece was discovered about 60 metres from Tores homestead with a swollen head and a cut on the forehead.\n\nThe body was covered with tree branches and a knife was recovered beside the body.\n\nThe third victim Musawu, who was the village head, was discovered buried in a shallow grave behind the suspects house with a decapitated head and a deep cut on the neck.\n\nAccording to police, Tore and his wife were allegedly heard by villagers embroiled in a heated verbal exchange over an undisclosed matter at their homestead on February 15, 2025.\n\nMasawu was last spotted alive on February 16, 2025, proceeding to the suspects homestead to mediate a dispute between the couple, while the second victim was also last seen on her way to the suspects homestead to watch television.\n\nAt the weekend, prior to Tores capture, police had launched an appeal to the general public to come forward with information on his whereabouts, thereby allaying earlier claims that suspect had been accounted for.\n\nPolice correct earlier report that Trymore Tore was arrested. This information was not correct and may the public be guided accordingly, police provincial spokesperson, Inspector Ian Kohwera said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24044750/Screenshot_20250222-093255_1.jpg",
            "description": "<p>By James Muonwa  AFTER spending a week on the run, a fugitive triple murder suspect was finally arrested Sunday in dramatic fashion in Hurungwe district of Mashonaland West province. Trymore Tore (37), who had earlier been mistakenly reported as having been arrested following the gruesome killing of his wife, niece and village head, was surrounded</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/triple-murder-suspect-arrested-after-week-on-the-run/\">Triple murder suspect arrested after week on the run </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Changes in Estate Administration in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-changes-in-estate-administration-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back, Mr. Madzima. This week, we want to discuss the changes to estate administration in Zimbabwe. Is there a wholesale change in how estates are administered, and when is this coming into effect?\n\nVM: Thank you.\n\nThere is no wholesale change in how estates are managed in Zimbabwe. The Act is amending certain provisions of the laws administering estates.\n\nThe law that is being introduced is known as the Administration of Estates Amendment Act No. 3 of 2024 which is coming into effect on the 24thof February 2025\n\nThe new Act is amending certain provisions that are contained in the Administration of Estates Act Chapter {6:01} and the Sovereign Wealth Fund Act Chapter {22:20}\n\nReporter:In general terms what is the main purpose for this Amendment Act?\n\nVM: The main purpose of the Act is to convert the office of the Master into a body corporate, stand-alone entity, capable of suing and being sued in its name. The office is the Master is responsible for all estates and insolvency situations like corporate rescue and liquidations.\n\nIn furthering institutional independence for the Masters office, the new laws prescribe that a board of professionals be created whose chairperson has to be qualified as a High Court judge. It will be the duty of the board to determine policies and principles of how the office is managed on a day-to-day basis with a focus on ensuring financial management and operational efficiency.\n\nLong and short, the aim of the Act is to address inefficiencies through corporate governance, with a focus on accountability and judicial oversight in the operations of the Masters office.\n\nReporter: What are some of the amendments introduced that affect day-to-day estate administration?\n\nVM: One such amendment deals with what is to be done where there is a dispute or competition for appointment as the Executor Dative.\n\nFor those who are not aware, the Executor Dative is the person appointed by the Master or Court as responsible for the gathering of assets, establishing liabilities and beneficiaries and ultimately distributing the estate.\n\nSuch disputes on who is to be appointed arise where there is no will stating in clear terms who the testator wishes to be the executor.\n\nIn such circumstances,the new act states the order of preference in appointment as the surviving spouse failing which, next of kin, failing which creditors then failing them legatees.\n\nThe Master will have to apply to the High Court with his choice of executor and if the Master has good reasons against the appointment of any of the interested persons, he can appoint a professional or other fit and proper person. The surest way to oppose the Masters choice is for all interested persons to submit to the court on joint affidavit their preferred executor.\n\nReporter: I understand that the amendments also deal with the issue of removal of executors.\n\nVM: Yes that is true.\n\nFor the avoidance of doubt, the amendments do not override or remove the common law principles for the removal of executors by interested persons to the estate.\n\nThey address a situation where the Master on his own motion following his own enquiry is of the opinion that the executor should be removed for grounds that may include incompetence, illegality in appointment or unsuitability for the role due to physical or mental incapacity.\n\nHe the Master is obliged to apply to the High Court an affidavit justifying his reasons for removal of the executor. On receiving the application, the executor is suspended from his duties pending the decision of the Court. The Master, in the interim, assumes the role of the executor. The judges response can only dismiss the application if he receives an affidavit from an interested person to the estate that there is a good reason not to remove the executor.\n\nReporter: Is there any other amendment that could have an effect on day-to-day estate management by executors?\n\nVM: Where the executor wants to sell the property of the estate privately and not by public auction and the will does not forbid it. The executor is to produce to the Master an affidavit jointly sworn by all the interested persons to sell the property and if the Master is satisfied that it will be in the best interest of the estate that the property is sold privately, he shall grant his authority.\n\nIn the event that it is contested, the executor supported by the Master will make an application to the court which shall determine upon considering practical estate needs and beneficiary interests whether or not the property is sold privately.\n\nReporter: Do you foresee any challenges that may come about as a result of the amendments in the Act?\n\nVM: The additional board approval and court processes may slow down administration coupled with the normal transition risks into autonomy.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24043954/Probate-and-Trust-Administration.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back, Mr. Madzima. This week, we want to discuss the changes to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-changes-in-estate-administration-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Changes in Estate Administration in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "16 Zimbabweans among dozens arrested in SA’s Pretoria major crime crackdown against illegal foreigners",
            "url": "https://www.newzimbabwe.com/16-zimbabweans-among-dozens-arrested-in-sas-pretoria-major-crime-crackdown-against-illegal-foreigners/",
            "content": "By IOL\n\nThe City of Tshwanes weekly Reclaim our City crime operations have led to the arrest of 61 illegal immigrants in Sunnyside, Pretoria.\n\nSixteen of the apprehended illegal immigrants are from Zimbabwe, four are Nigerian, nine Mozambicans, five Ethiopians and Ugandans, one Senegalese and 21 Malawians.\n\nThree other people were nabbed for knowingly employing and harbouring illegal foreigners.\n\nAccording to Tshwane mayor Nasiphi Moya, the operations targeted areas such as Sunnyside, Pretoria West and Pretoria Central as part of her administrations efforts to combat crime.\n\nThe crackdown operation was successful through the joint partnership of law enforcement from several departments, including the Gauteng Traffic Police, the Economic Development and Spatial Planning Department in Tshwane.\n\nWe are grateful to the provincial government for showing support for the citys efforts to rid the Pretoria CBD of crime.\n\nThe operation exerted the necessary impact as proof that intergovernmental partnerships with role players can help strengthen the arm of the law, said Moya.\n\nThe operation was not all gloomy, as a Tshwane Metro Police officer helped a pregnant woman deliver a healthy baby boy.\n\nMoya revealed that the city issued 20 health compliance notices under Section 56, totalling R133 000 fines.\n\nAdditionally, one fine was issued for failing to provide building plans, three were for failing to register second-hand goods, and one fine was for failure to keep record of second-hand goods.\n\nThe operation also saw the closure of a bet-exchange business located at the corner of Robert Sobukwe and Troye Streets, including a takeaway store for not complying to health regulations.\n\nLaw enforcement further confiscated 26 perishable goods, followed by 11 taxis for violating the National Land Transport Act of 2009, and a total of 108 560ml of liquor was seized and taken to the Pretoria West SAPS.\n\nOfficials visited 24 spaza shops, one liquor outlet, two second-hand good shops, and seven drug hotspots.\n\nThe operation also involved searching 456 people and 109 vehicles, and one liquor outlet was shut down.\n\nTwenty-nine vehicles were tested, while authorities searched 10 bad buildings, 44 street traders, and 34 premises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/06035044/SA-Police.png",
            "description": "<p>By IOL  The City of Tshwane’s weekly “Reclaim our City” crime operations have led to the arrest of 61 illegal immigrants in Sunnyside, Pretoria. Sixteen of the apprehended illegal immigrants are from Zimbabwe, four are Nigerian, nine Mozambicans, five Ethiopians and Ugandans, one Senegalese and 21 Malawians. Three other people were nabbed for knowingly employing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/16-zimbabweans-among-dozens-arrested-in-sas-pretoria-major-crime-crackdown-against-illegal-foreigners/\">16 Zimbabweans among dozens arrested in SA’s Pretoria major crime crackdown against illegal foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Washington adopts a Zimbabwe innovation: Grannies offering park-bench therapy",
            "url": "https://www.newzimbabwe.com/washington-adopts-a-zimbabwe-innovation-grannies-offering-park-bench-therapy/",
            "content": "CSMonitor\n\nOutside the Bernice Elizabeth Fonteneau Wellness Center in Petworth, a historically Black neighborhood in Washington, D.C., bundled-up passersby swerve around piles of melting slush. But the small room on the centers third floor radiates warmth. So happy youre here, reads the mat on the doorway, welcoming visitors into the softly lit space.\n\nInside, on what looks to be a park bench covered in throw cushions, Angela Jasper offers free, informal talk therapy sessions, creating what she calls a safe, nonjudgmental space for people to unburden themselves.\n\nOn the other side of the world, by a public clinic in the Zimbabwean capital, Harare, Shelter Nhengo has a bench, too. Sometimes all one needs is someone to talk to, she says.\n\nIn Zimbabwe, mental health care is expensive and even shameful. But a network of therapy-trained grandmothers, sitting on public benches, has brought comfort to 500,000 people. Now the idea has spread to Washington.\n\nMs. Jasper and Ms. Nhengo arent psychologists or social workers. Think of them, instead, as kind of volunteer neighborhood grandmothers  that is, if the grandmothers were trained in cognitive behavioral therapy.\n\nThe two women work using a model calledFriendship Bench, developed by Zimbabwean psychiatrist Dr. Dixon Chibanda. The idea behind it is simple: In many places, formal mental health care is expensive, impractical, or even shameful. But grandmothers are not.\n\nAll told, more than half a million Zimbabweans have sat on a Friendship Bench in the last two decades, and recently, Dr. Chibanda has begun taking his model global.\n\nIsh Mafundikwa A client (left) tells a grandmother her story on a bench outside a Harare clinic. Formal mental health care is expensive, and sometimes shameful, in Zimbabwe. Grandmothers are not.\n\nBut in late January, Dr. Chibanda received a curt email from the U.S. Agency for International Development (USAID), which helps pay for some of his projects. As part of the Trump administrations three-month freeze on American foreign aid, Friendship Benchs funding was being cut off.\n\nDr. Chibanda and his team were shocked. Their USAID grants were helping them train 45 virtual Friendship Bench counselors, among other projects. American aid money had also helped his organization train Ms. Jasper and her fellow volunteers in Washington. While a federal court ruled Feb. 13 totemporarily lift the USAID freeze, it remains unclear if the decision will hold, or if and when funding might be restored.\n\nIt affects us badly, he says. And that funding was not only helping people abroad, but also Americans.\n\nFriendship Bench was born of tragedy. In 2005, one of Dr. Chibandas patients, a woman named Erica, died by suicide after missing a session with him. When he spoke to her family members, they told him that she couldnt find the $15 in bus fares she needed to go to her appointment.\n\nFor a long time, I felt personally responsible for Ericas death, he says. I wanted to do something to prevent something similar from occurring [again].\n\nAt the time, Zimbabwe had, by one count, justseven psychiatrists, and many viewed mental health problems as shameful. This troubled Dr. Chibanda, who saw the traumas that stalked Zimbabweans daily, from the legacies of colonialism and government repression to the AIDS pandemic and poverty. All of that led to a problem known in the local Shona language askufungisisa,literally thinking too much  or what Westerners might know as depression.\n\nBut Dr. Chibanda also noticed that those around him were not entirely without support. As in many parts of the world, they leaned on an invisible army of aunties and grannies, older women with quiet wisdom and the time to listen.\n\nFriendship Bench Dixon Chibanda (seated at left) and some of the counselor grandmothers pose at a 2024 Friendship Bench function in Harare.\n\nSo he decided to formalize that system, training a group of older women in Harare in the basic ins and outs of problem-solving-oriented therapy. As there was no space inside the clinic where the project was piloted, the grandmothers did their counseling outside. It was the complete opposite of a frowning professional in a sterile room scribbling your secrets in a notebook.\n\nToday, thousands of these semiprofessional therapy grannies  along with a few grandfathers and younger people, too  host counseling sessions on benches installed around the country.\n\nIts a hard life, but I always feel better after talking toAmbuya, says one Friendship Bench user in Harare, using the Shona word for grandmother. (We are not identifying either because of the sensitivity of speaking about mental health challenges.)\n\nIn 2021, as the COVID-19 pandemic continued crashing over the world, a group of grandparents in Washington found itself asking a question similar to Dr. Chibandas. People around them were hurting deeply. What could they do to help?\n\nAt the time, the group was working with HelpAge USA, a nongovernmental organization that advocates for the rights of older people. The organizations CEO, Cindy Cox-Roman, had read news stories about Friendship Bench, and wondered if the model might work in Washington, too.\n\nSo she called up Dr. Chibanda, and in September 2023, the grandparents found themselves on Zoom with the Zimbabwe team, starting a 10-week training to learn how they could use the benches.\n\nCourtesy of HelpAge foundation Scarlett Small (left) is among a group of 12 grandparents in Washington providing talk therapy using the Friendship Bench model.\n\nOne of them, Scarlett Small, says that she wondered at first whether the Zimbabwean model would fit in Washington. We have a different culture here, she remembers thinking. But she was quickly struck by how many of the issues they discussed in practice sessions were the same across oceans. People were hurting because of money troubles, family problems, and fractures in the relationships they treasured most.\n\nI think most people that come are sort of all tangled up in their thoughts, Ms. Small says. Friendship Bench is an opportunity for them to speak out loud, instead of it going over and over in their mind.\n\nDr. Chibanda has now brought Friendship Bench to several countries, including Vietnam, El Salvador, Malawi, Kenya, and Jordan, and he says many elements of the program have proved universal.\n\nWe find that everywhere, the less emphasis there is on diagnosing people, the better, he says. Instead, he says, the grandparents are taught to focus on giving people in pain space to tell their stories.\n\nBut now, he is worried about the struggling on the other side of the bench, too. In the days after the USAID freeze, he had to send 45 staff members home. Those who remain feel disempowered and helpless, he says.\n\nIn Washington, meanwhile, there are now 12 older people offering therapy at seven sites in historically Black areas of the city. And HelpAge hopes to eventually have one within walking distance of every person in these neighborhoods.\n\nFor her part, Ms. Jasper continues to look back on her time working with the Zimbabwean team with great fondness, calling it the part of the program I cherish most. In their expertise and empathy, she says, Theres so much we learned from them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24044437/0219-OFRIENDSHIPBENCH-jasper-lede.jpg",
            "description": "<p>CSMonitor Outside the Bernice Elizabeth Fonteneau Wellness Center in Petworth, a historically Black neighborhood in Washington, D.C., bundled-up passersby swerve around piles of melting slush. But the small room on the center’s third floor radiates warmth. “So happy you’re here,” reads the mat on the doorway, welcoming visitors into the softly lit space. Inside, on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/washington-adopts-a-zimbabwe-innovation-grannies-offering-park-bench-therapy/\">Washington adopts a Zimbabwe innovation: Grannies offering park-bench therapy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "Zimbabwe tobacco growers encouraged to prioritize quality",
            "url": "https://www.newzimbabwe.com/zimbabwe-tobacco-growers-encouraged-to-prioritize-quality/",
            "content": "Tobacco Reporter\n\nPredicting a significant increase in global flavor-grade tobacco supply for 2025, Zimbabwes Tobacco Industry and Marketing Board (TIMB) is urging growers to focus on quality by investing in an energy-efficient curing infrastructure, adopting precision farming techniques, and implementing improved agronomic practices.\n\nFor the 2025 season, Zimbabwe saw a 2.75% increase in hectares planted, which combined with improved rainfall distribution and better agronomic practices, puts the projected national output between 280 million and 300 million kg depending on the weather. Last years output of 231.7 million kg of flue-cured Virginia tobacco was a 13.1% increase from 2023.\n\nThe anticipated increase in Zimbabwe combined with projections that Brazils output will increase from 461.8 million kg in 2024 to at least 650 million kg in 2025 has experts predicting downward pressure on tobacco prices, particularly for middle to low-end grades.\n\nTapiwa Masedza, the factory coordinator for the Tian Ze Tobacco Company, said the global demand for tobacco remains robust, with many companies struggling to meet supply orders due to last years reduced crop size. That combined with Chinas need for top-end grades gives hope that prices will remain stable for premium leaf, however low- to medium-end grades prices are expected to drop.\n\nWhile the anticipated increase in production is a testament to the sectors resilience and growth, the potential price pressures underscore the need for strategic planning and investment in quality improvement, Masedza said. Mixing grades in bales, excessive moisture, and moldy tobacco can lead to discounts or rejections, ultimately affecting profitability.\n\nTIMB is trying to help insulate local farmers from potential subdued prices resulting from excess supply with a new pricing system, expected to be implemented April 5. The system will determine the following days minimum price based on the average price of all tobacco sold  both at auction and through contracts  across all grades.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31054919/Tobacco-Agriculture.jpg",
            "description": "<p>Tobacco Reporter Predicting a significant increase in global flavor-grade tobacco supply for 2025, Zimbabwe’s Tobacco Industry and Marketing Board (TIMB) is urging growers to focus on quality by investing in an energy-efficient curing infrastructure, adopting precision farming techniques, and implementing improved agronomic practices. For the 2025 season, Zimbabwe saw a 2.75% increase in hectares planted,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-tobacco-growers-encouraged-to-prioritize-quality/\">Zimbabwe tobacco growers encouraged to prioritize quality</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "PSL: Acting CEO says stadiums crisis pressure has not yet eased",
            "url": "https://www.newzimbabwe.com/psl-acting-ceo-says-stadiums-crisis-pressure-has-not-yet-eased/",
            "content": "By Sports Reporter\n\nACTING Premier Soccer League (PSL) chief executive officer, Rodwell Thabe, says the stadiums crisis has not eased off ahead of the 2025 season.\n\nHe was speaking in an interview in which he was outlining the leagues agenda for the upcoming season.\n\nStadia crisis was one of the major setbacks at the beginning of last season, as most facilities could not meet the required standards to host local games.\n\nThe crisis is being worsened by the closure of the National Sports Stadium in the capital, leaving all six Harare based teams with two stadiums Rufaro and The Heart stadium.\n\nThe six teams which will be relying on the above mentioned facilities are Dynamos, CAPS United, Yadah, Herentals, new comers MWOS and Scottland.\n\nWith the PSL scheduled to kick off March 1, already the ZIFA First Instance Board is moving around the country together with PSL inspecting proposed stadiums to be used by clubs and Thabe is hopeful that the process will be completed by end of February.\n\nWe are in the process of getting our stadia homologated across the country. The stadium pressure has not completely eased off, if you look at a situation like in Harare alone we have six clubs based in and around Harare, probably they will share two stadiums at the moment.\n\nLook, six teams sharing two facilities is not ideal, Thabe said.\n\nThe giant National Sports Stadiums facelift is expected to be completed before June and ease the pressure.\n\nOther than relying on the giant facilitys completion, newcomers MWOS are already renovating Ngoni Stadium in Norton, which is also expected to meet the required local PSL standards by mid year.\n\nScottland FC, on the other end, have embarked on a mission to uplift Mabvuku Stadium, which will hopefully be completed soon.\n\nI understand MWOS FC are working through midnight hours just to get their stadium ready.\n\nSo, from an inspection point of view we are looking to have most stadiums homologated and make sure that when the league kicks off it will not be a fixture congested season.\n\nWe will be able to divide what will be available, added Thabe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/23103017/IMG-20250223-WA0009.jpg",
            "description": "<p>By Sports Reporter  ACTING Premier Soccer League (PSL) chief executive officer, Rodwell Thabe, says the stadiums crisis has not eased off ahead of the 2025 season. He was speaking in an interview in which he was outlining the league’s agenda for the upcoming season. Stadia crisis was one of the major setbacks at the beginning</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-acting-ceo-says-stadiums-crisis-pressure-has-not-yet-eased/\">PSL: Acting CEO says stadiums crisis pressure has not yet eased</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "The Premier Zimbabwe Diaspora Property Showcase is coming to the USA!",
            "url": "https://www.newzimbabwe.com/the-premier-zimbabwe-diaspora-property-showcase-is-coming-to-the-usa/",
            "content": "Following a successful Property Showcase in the UK in July 2024 which attracted over 1 500 attendees, Seeff Zimbabwe is thrilled to announce that the premier Zimbabwe Diaspora Property Showcase will be reaching Zimbabweans residing in the USA and Canada. The extraordinary two-day event is set to take place from April 25 to 26, 2025, at The Westin, Dallas-Fort Worth, Texas, concluding with a social golf tournament for attendees and exhibitors held on April 27th. Seeff Zimbabwe is one of the leading real estate businesses in Zimbabwe that has a presence in the SADC region.\n\nA Gathering of Minds and Opportunities\n\nThe Property Showcase aims to bridge the gap between property businesses in Zimbabwe and the Zimbabwean community in North America, addressing the challenges faced by the diaspora in managing and investing in properties from a distance. With alarming tales of lost investments and many more horror stories due to unreliable agencies and family members, this event strives to provide trustworthy solutions and promote investment back into Zimbabwe through real estate.\n\nWe are really excited that we can bring the real estate industry to North America to engage in productive dialogue with Zimbabweans and start the process of rebuilding relationships with that market, ensuring that we create a safe environment for them to invest in Zimbabwe. After the spectacular success of the UK Showcase we are expecting a similar result as the industry is now fully focused on creating diaspora-friendly products for those markets, the Managing Director for Seeff Zimbabwe Patience Patongamoyo said.\n\nEngage, Learn, and Network\n\nParticipants will have the opportunity to interact with exhibitors, including leading developers, financial institutions, conveyancers, suppliers, property consultants, and many other real estate stakeholders. Many companies have already started registering their attendance and we will expect over 40 to showcase their products and services in April 2025. The event will include panel discussions, presentations by property experts, and networking opportunities, all aimed at empowering Zimbabweans in the USA and Canada to invest confidently in their homeland.\n\nFor those looking to exhibit or to attend please sign up by connecting with the event organizers atwww.zimpropertyshowcaseusa.com.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/21065751/1J8A3552-1-scaled-e1718949505536.jpg",
            "description": "<p>Following a successful Property Showcase in the UK in July 2024 which attracted over 1 500 attendees, Seeff Zimbabwe is thrilled to announce that the premier Zimbabwe Diaspora Property Showcase will be reaching Zimbabweans residing in the USA and Canada. The extraordinary two-day event is set to take place from April 25 to 26, 2025,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-premier-zimbabwe-diaspora-property-showcase-is-coming-to-the-usa/\">The Premier Zimbabwe Diaspora Property Showcase is coming to the USA!</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        },
        {
            "title": "African Energy Chamber advocates multi-energy strategy at IEA-IEF-Opec Symposium",
            "url": "https://www.newzimbabwe.com/african-energy-chamber-advocates-multi-energy-strategy-at-iea-ief-opec-symposium/",
            "content": "IOL\n\nTHE African Energy Chamber (AEC)as the voice of the African energy sectorhas long advocated for a multi-energy approach in Africa, whereby investments in multiple energy sources fuel industrialisation and electrification.\n\nWith 600 million people currently living without access to electricity and 900 million lacking access to clean cooking solutions, the continent requires all of its energy resources to address its energy crisis.\n\nYet, organisations such as the International Energy Agency (IEA) continue to perpetuate the myth that Africa can meet its energy needs without oil and gas. While an immediate shift to renewable energy may work in Western nations, this approach is not feasible in Africa. As such, the AEC is calling for an end to anti-fossil fuel narratives on the continent.\n\nSimilar calls were heard at the 15th IEA-IEF-Opec Symposium in Riyadh, Saudi Arabia, where Tommy Joyce, acting assistant secretary for International Affairs at the US Department of Energy, spoke passionately about oil and gas and their role in combating energy poverty in Africa.\n\nThe AECs executive chairman, NJ Ayuk, participated in the Symposium, underscoring the need for an Africa-centric approach to energy development. Other attendees included Prince Abdulaziz bin Salman bin Abdulaziz, Saudi Arabias Minister of Energy; Haitham Al-Ghais, OPEC Secretary General; Jassim Al Shirawi, Secretary General of the International Energy Forum; Keisuke Sadamori, director of energy markets and security at the International Energy Agency; and US representatives.\n\nAfrica cannot adopt the same model as western nations in its energy transition, or the continent risks falling deeper into energy poverty. Given its reliance on oil and gas, its lack of requisite infrastructure to rapidly transition to renewable energy, its growing population, and its differentiated and complex energy needs, this approach would only exacerbate its crisis.\n\nSouth Africa, for example, Africas largest economy, relies on coal for 72% of its electricity. Operational challenges at its coal-fired generation facilities in recent years have plunged the country into an energy crisis, with load shedding impacting businesses, industries, and economic activity.\n\nYet, South Africa, like many of its regional neighbours, holds the promise of a clean and affordable power generation solution: natural gas.\n\nNatural gas has been dubbed the fuel of the future in Africa. With more than 620trillion cubic feet (tcf) of proven resources and a significant portion of the continents basins still underexplored, gas monetisation stands to power Africas economies, offering a low-cost, low-carbon energy solution.\n\nGas-to-power projects would address the very energy crisis that has impacted economic growth for years. They would also enable exports to regional neighbours such as Zimbabwe, which also grapple with inadequate energy supply.\n\nYet, the IEA has called for an end to new gas projects, citing the need to prioritise renewable energy utilisation over this widely available resource. The organisation has claimed that existing oil and gas fields are more than sufficient, yet reality tells a vastly different story. One cannot look at South Africa and believe this to be true.\n\nThe same can be said for Mozambique, which has been a regional leader in renewable energy through its hydropower projects. Yet, only 40% of the country has access to electricity. Recent discoveries have placed Mozambiques gas resources at upwards of 100 tcf, with major upcoming LNG developments offering a strategic opportunity for the country to boost domestic electrification.\n\nAn integrated and diverse energy mix would work well in Mozambique, just as it would in Angola, Tanzania, Senegal, Mauritania, the Republic of Congo, and many more African nations.\n\nFundamentally, African countries are best positioned to address their own complex energy needs. While oil and gas may be considered dirty words in Paris, London, or New York, hydrocarbons present cleaner alternatives to the solid biomass and kerosene that 85% of Africans use to cook their food today.\n\nTo help end energy poverty in Africa, global institutions like the IEA must cease perpetuating the myth that Africa can meet its populations needs without fossil fuels or can afford to sacrifice economic development for externally imposed climate goals.\n\nEurope, the United States, and China have made incredible strides in addressing malnutrition, life expectancy, and disease by powering economic growth with uninhibited access to coal, oil, and natural gas. Why cant we? said NJ Ayuk, executive chairman of the AEC, referencing the Symposium.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/23073653/Screenshot-2025-02-23-at-09.36.38.png",
            "description": "<p>IOL THE African Energy Chamber (AEC)—as the voice of the African energy sector—has long advocated for a multi-energy approach in Africa, whereby investments in multiple energy sources fuel industrialisation and electrification. With 600 million people currently living without access to electricity and 900 million lacking access to clean cooking solutions, the continent requires all of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-energy-chamber-advocates-multi-energy-strategy-at-iea-ief-opec-symposium/\">African Energy Chamber advocates multi-energy strategy at IEA-IEF-Opec Symposium</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "24 Feb 2025"
        }
    ]
}