{
    "news": [
        {
            "title": "Parliament concerned by government’s snub of Mzilikazi Day",
            "url": "https://www.newzimbabwe.com/parliament-concerned-by-governments-snub-of-mzilikazi-day/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT has raised concerns over the governments continued non-recognition of the annual Mzilikazi Day.\n\nMzilikazi Day is celebrated in honour of the founding father of the Ndebele Kingdom, Mzilikazi ka Matshobane, who died on 9 September 1868.\n\nOn Saturday, thousands thronged Mhlahlandlela to honour the legacy of Mzilikazi, which began in 1823 when he broke ranks from Shaka Zulu to forge the Ndebele Kingdom.\n\nConspicuous by their absence were government officials, including the Minister of Home Affairs and Cultural Heritage, Kazembe Kazembe.\n\nInterestingly, President Mnangagwa sent a representative to a cultural event in Eswatini, turning a blind eye to Mzilikazi Day.\n\nOpposition legislator Daniel Molokela said the governments snubbing of the day, which carries great historical significance, is concerning.\n\nDespite the fact that the event was a big success, one of the big concerns was that relevant Government departments were visible in their absence. Ministry of Tourism and Hospitality Industry, Ministry of Local Government and Public Works were nowhere to be seen, same as the Ministry of Home Affairs and Cultural Heritage. We want to encourage the Government of Zimbabwe to support such traditional and cultural heritage events, said Molokela.\n\nThe Government is at odds with the Ndebele King, Bulelani Khumalo, a descendant of Mzilikazi, refusing to recognise his kingship.\n\nMolokela further said Mzilikazi Day should be honoured and celebrated by the country.\n\nThe event attracted participants from all over Zimbabwe and some from the diaspora, especially from South Africa. Thousands of people from different generations, elders, youths, children, women, men, rural people and urban people attended the event from different cultures and languages.\n\nZimbabwe prides itself in cultural heritage, it prides itself in national identity and also decolonisation in terms of identity. An event like the one which we held on Saturday is something that as Zimbabweans, we must celebrate and encourage all districts, provinces, cultures and all languages in Zimbabwe to organise such kind of events so that as a nation, we can also be recognised that we have gone beyond the colonial system, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10191306/molokela-mzilikazi-day.jpeg",
            "description": "<p>By Darlington Gatsi PARLIAMENT has raised concerns over the government’s continued non-recognition of the annual Mzilikazi Day. Mzilikazi Day is celebrated in honour of the founding father of the Ndebele Kingdom, Mzilikazi ka Matshobane, who died on 9 September 1868. On Saturday, thousands thronged Mhlahlandlela to honour the legacy of Mzilikazi, which began in 1823</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-concerned-by-governments-snub-of-mzilikazi-day/\">Parliament concerned by government’s snub of Mzilikazi Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        },
        {
            "title": "Polish and NATO forces scramble to shoot down Russian drones",
            "url": "https://www.newzimbabwe.com/polish-and-nato-forces-scramble-to-shoot-down-russian-drones/",
            "content": "Al Jazeera\n\nPolish and NATO forces have shot down drones violating the countrys airspace during a Russian aerial attack on neighbouring Ukraine.\n\nFighter jets were scrambled early on Wednesday as more than a dozen drones entered Polish airspace, the Polish military said. It is the first time that Polish and NATO forces have become engaged in the conflict. Ukraine said Russia is testing the West.\n\nDuring todays attack by the Russian Federation on targets in Ukraine, our airspace was repeatedly violated by drones, the Operational Command of the Polish military said in a statement.\n\nAt the request of the Operational Commander of the Armed Forces, weapons have been used, and operations are under way to locate the downed targets, the military said.\n\nThe army said Polish and NATO military aircraft were mobilised to ensure airspace safety.\n\nPolish and allied aircraft are operating in our airspace, while ground-based air defence and radar reconnaissance systems have been brought to the highest state of readiness, the Operational Command said.\n\nPolish Prime Minister Donald Tusk confirmed that an operation is under way related to multiple violations of Polish airspace.\n\nTrwa operacja zwizana z wielokrotnym naruszeniem polskiej przestrzeni powietrznej. Przeciwko obiektom wojsko uyo uzbrojenia. Jestem w staym kontakcie z Prezydentem i Ministrem Obrony. Odebraem bezporedni meldunek od dowdcy operacyjnego.\n\n Donald Tusk (@donaldtusk)September 10, 2025\n\nTranslation: An operation is under way related to multiple violations of Polish airspace. The military used armaments against the objects. I am in constant contact with the president and the minister of defence. I received a direct report from the operational commander.\n\nAn operation was also conducted to collect debris from the drones.\n\nA drone or similar object struck a residential building in Wyryki in eastern Poland, but nobody was injured, its mayor told the state-run news channel TVP Info. Footage showed a house with a damaged roof and the rafters showing.\n\nPolice in the Lublin region said they found a damaged drone in the village of Czosnowka while drone debris was also reported in the town of Czesniki.\n\nTusk confirmed that the drones originated from Russia. We are dealing with a large-scale provocation, the prime minister said.\n\nMoscow appeared to distance itself from the incident. The Russian Ministry of Defence said its drones had struck military facilities in western Ukraine but there were no plans to target sites in Poland.\n\nEarlier, Kremlin spokesperson Dmitry Peskov said the European Union and NATO accuse Russia of provocations on a daily basis, most of the time without even trying to present at least some kind of argument.\n\nTusk said he was in constant contact with NATO Secretary-General Mark Rutte. An emergency meeting of the Polish Council of Ministers was called for Wednesday.\n\nAircraft have used weapons against hostile objects, Defence Minister Wladyslaw Kosiniak-Kamysz said on social media, adding: We are in constant contact with NATO command.\n\nUkraines foreign minister said on Wednesday that the events show Russian President Vladimir Putins impunity and his expansion of the war and added that Moscow is testing the Wests willingness to respond to aggression.\n\nPutin just keeps escalating, expanding his war, and testing the West, Andrii Sybiha said on X.\n\nThis situation shows that finally the decision needs to be taken to enable partner air defence capabilities in neighbouring countries to be used to intercept drones and missiles in the Ukrainian airspace, including those approaching NATO borders.\n\nPresident Volodymyr Zelenskyy said eight Russian drones had been aimed toward Poland, and called the episode an extremely dangerous precedent for Europe.\n\nEU Defence Commissioner Andrius Kubilius called for the EU to develop a drone wall along its eastern flank.\n\nOnce again Russia tests frontier states, EU & NATO, Kubilius wrote in a post on social media. We shall work together with Member States, frontier countries and Ukraine. Russia will be stopped.\n\nRussias war is escalating, not ending. We must raise the cost on Moscow, strengthen support for Ukraine, and invest in Europes defence. The EU plays a major role and we will support initiatives like the Eastern Border Shield defence line, the EUs top diplomat, Kaja Kallas, wrote on social media.\n\nThe United States also questioned Moscows intentions after the incident with President Donald Trump weighing in on Truth Social: Whats with Russia violating Polands airspace with drones? Here we go!\n\nFour airports in Poland, including Chopin Airport in Warsaw, were closed due to military activity late on Tuesday.\n\nAccording to notices posted on the US Federal Aviation Administrations website, the other airports closed were Rzeszow-Jasionka Airport, Warsaw Modlin Airport and Lublin Airport.\n\nChopin Airport confirmed later in a post on social media that airspace over parts of Poland, including over the airport, had been closed temporarily due to the actions of state services and the military to ensure safety.\n\nPassengers whose travel plans were disrupted were asked to monitor airlines and official government announcements for updates.\n\nEarly on Wednesday, all of the airports save for Lublin, which is close to the border with Ukraine, reopened.\n\nWany komunikat dla pasaerw korzystajcych z@ChopinAirport.pic.twitter.com/kN1W7dFSLx\n\n Chopin Airport, WAW (@ChopinAirport)September 10, 2025\n\nThe military mobilisation in Poland came after Ukraines air force reported that Russian drones had entered Polish airspace, posing a threat to the city of Zamosc, but the air force later removed the statement from its Telegram messaging app.\n\nMost of Ukraine, including the western regions of Volyn and Lviv, which border Poland, were under air raid alerts for several hours overnight, according to Ukraines air force data.\n\nPoland said earlier that it planned to close its border with Belarus at midnight on Thursday (22:00 GMT on Wednesday) due to Russian-led military exercises scheduled to take place in Belarus.\n\nRussia and Belaruss large-scale military exercises, known as the Zapad drills, have raised security concerns in neighbouring Poland, Lithuania and Latvia, all NATO member states. The Zapad-2025 (West-2025) drills will be held in western Russia and Belarus from Friday.\n\nAsked about the duration of the border closure, Polish Minister of Interior Marcin Kierwinski said the border would only be reopened when the government was sure there was no more threat to Polish citizens.\n\nThe Belarusian Ministry of Foreign Affairs said it had summoned the Polish charge daffaires to complain about the border closure, which it said caused significant difficulties.\n\nIt described Polands move as an abuse of its geographical position.\n\nThe temporary suspension of passage indicates rather an intention to conceal ones own actions than the existence of any threat from Belarus, the Foreign Ministry said.\n\nLithuanias border guard said on Tuesday that the protection of its border with Belarus and Russia would be strengthened due to the exercises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10194534/polish-air-force.webp",
            "description": "<p>Al Jazeera Polish and NATO forces have shot down drones violating the country’s airspace during a Russian aerial attack on neighbouring Ukraine. Fighter jets were scrambled early on Wednesday as more than a dozen drones entered Polish airspace, the Polish military said. It is the first time that Polish and NATO forces have become engaged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polish-and-nato-forces-scramble-to-shoot-down-russian-drones/\">Polish and NATO forces scramble to shoot down Russian drones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        },
        {
            "title": "King Kandoro headlines comedy night as Shoko Festival celebrates crystal jubilee",
            "url": "https://www.newzimbabwe.com/king-kandoro-headlines-comedy-night-as-shoko-festival-celebrates-crystal-jubilee/",
            "content": "By Darlington Gatsi\n\nAS the Shoko Festival marks 15 years since inception, the spotlight will be on the legacy of the countrys largest urban culture festival, and there is no better way to mark the occasion than with comedian King Kandoro headlining the comedy night on September 25.\n\nKing Kandoro will perform at the Shoko Festival Comedy Night at the Harare Gardens.\n\nThis marks a homecoming for King Kandoro, who last performed in Harare a year ago. The performance will mark a full circle for the jestmaster, who was nurtured through the incubation of the Magamba Network, the organisers of the Shoko Festival.\n\nKandoro, who has sold-out shows in Harare in the past, will be supported by Kenyas Justine Wanda, Munyaradzi Chipere, and Mbongeni Ignatious Ndlovu.\n\nShoko Festival director, Samm Farai Monro, says this years edition will honour the legacy that has been built over the past 15 years.\n\nOur Comedy Night lineup is a reflection of the legacy we have been building over 15 years as Shoko Festival. King Kandoro is an example of that legacy as he grew his comedy career through platforms created by Magamba TV and Shoko and is now one of Zimbabwes biggest comedians.\n\nHe returns triumphantly to Shoko as a headliner and this shows our commitment to nurturing the next generation of artists in Zimbabwe who speak truth to power. Kandoro will be joined on stage by an amazing group of comedians. Its gonna be a hilarious night! says Monro.\n\nKandoro is expected to surpass the performance standard set by Learnmore Jonasi, who was the headliner last year.\n\n",
            "image_url": null,
            "description": "<p>By Darlington Gatsi AS the Shoko Festival marks 15 years since inception, the spotlight will be on the legacy of the country’s largest urban culture festival, and there is no better way to mark the occasion than with comedian King Kandoro headlining the comedy night on September 25. King Kandoro will perform at the Shoko</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-kandoro-headlines-comedy-night-as-shoko-festival-celebrates-crystal-jubilee/\">King Kandoro headlines comedy night as Shoko Festival celebrates crystal jubilee </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        },
        {
            "title": "Chevrons to play Namibia ahead of T20I World Cup Africa Regional Finals",
            "url": "https://www.newzimbabwe.com/chevrons-to-play-namibia-ahead-of-t20i-world-cup-africa-regional-finals/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team is set to play Namibia in a three-match T20I series scheduled from September 15 to 18.\n\nThe upcoming series will see all the games being played at Queens Sports Club.\n\nBoth Zimbabwe and Namibia will be using the series to prepare for the ICC Mens T20 World Cup Africa Regional Finals, scheduled to start the following week, from September 26 to October 4.\n\nThe Chevrons walk into the series coming off a 2-1 defeat against Sri Lanka at Harare Sports Club.\n\nCommenting ahead of the series, Chevrons coach Justin Summons said, Its important that we build on the positives from the Sri Lanka series, and facing Namibia will give us exactly the kind of contest we need before the qualifier.\n\nThey are a quality team who have consistently performed well in this format, so these matches will demand our very best.\n\nZimbabwe squad: Sikandar Raza (c), Brian Bennett, Ryan Burl, Brad Evans, Trevor Gwandu, Tinotenda Maposa, Tadiwanashe Marumani, Wellington Masakadza, Tony Munyonga, Tashinga Musekiwa, Blessing Muzarabani, Dion Myers, Richard Ngarava, Brendan Taylor, Sean Williams\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/25162538/Chevrons.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team is set to play Namibia in a three-match T20I series scheduled from September 15 to 18. The upcoming series will see all the games being played at Queens Sports Club. Both Zimbabwe and Namibia will be using the series to prepare for the ICC Men’s T20</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-play-namibia-ahead-of-t20i-world-cup-africa-regional-finals/\">Chevrons to play Namibia ahead of T20I World Cup Africa Regional Finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        },
        {
            "title": "Zimbabwe most taxed nation in Africa – Biti warns new ‘punitive, absurd’ taxes will further cripple Zimbabwe’s economy",
            "url": "https://www.newzimbabwe.com/zimbabwe-most-taxed-nation-in-africa-biti-warns-new-punitive-absurd-taxes-will-further-cripple-zimbabwes-economy/",
            "content": "By Staff Reporter\n\nFORMER Finance Minister Tendai Biti has slammed the governments newly enforced presumptive taxes as punitive and absurd, warning they will cripple informal traders, small-scale miners, transport operators and other small businesses already struggling in a weak economy.\n\nIn Public Notice 51 of 2025, the Zimbabwe Revenue Authority (ZIMRA) outlined revised presumptive tax rates for the informal sector, reaffirming measures that were already included in the Finance Act of 2024, which was gazetted on October 24 last year.\n\nThe taxes, which range from US$5 to US$500 monthly, affect informal traders, small-scale miners, taxi and commuter omnibus operators, driving schools, hairdressers, cross-border traders, bottle stores and restaurants.\n\nReacting to the notice, Biti said the measures make Zimbabwe one of the most overtaxed countries in Africa.\n\nThe public notice is a mere restatement of punitive presumptive taxes published in the Finance Act of 2024 gazetted on 24 Oct 2024.\n\nSome of the rates are absurd.\n\nHairdressers are obliged to pay US$5 per chair per month with cross-borders paying 20% of the Duty value of goods being imported.\n\nZimbabweans are overtaxed. Before the rebasing of the economy, taxes were 30% of GDP (double Africas average ) making Zim the most taxed African country, Biti said.\n\nThe former finance minister said the government has no clear guiding ideas and is using taxes to cover up its reckless spending which falls on ordinary working people, leaving them with little or nothing to live on.\n\nAt any given time the average Zim pays annually at least 15 different types of taxes and levies that include PAYEE, corporate taxes, IMMT, VAT, Fuel levies, carbon taxes, AIDS levies , excise duties on alcohol and cigarettes presumptive taxes,stamp duties toll gates, vehicle licenses, ZBC, stamp duties, customs duties, capital gains taxes, rates,NSSA to name a few.\n\nAn ideological vacuous regime sees taxes as an antidote to an overzealous expansionary fiscal policy.\n\nHigh regressive taxes hit innocent working people who are left with little or no disposable income.\n\nLow disposable incomes underpin a crises of under accumulation, the basis of any economic recession. Thanks to high toxic taxes, an artificially tight monetary policy and a mismanaged exchange rate this economy is bleeding, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25044732/Tendai-Biti.png",
            "description": "<p>By Staff Reporter FORMER Finance Minister Tendai Biti has slammed the government’s newly enforced presumptive taxes as punitive and absurd, warning they will cripple informal traders, small-scale miners, transport operators and other small businesses already struggling in a weak economy. In Public Notice 51 of 2025, the Zimbabwe Revenue Authority (ZIMRA) outlined revised presumptive tax</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-most-taxed-nation-in-africa-biti-warns-new-punitive-absurd-taxes-will-further-cripple-zimbabwes-economy/\">Zimbabwe most taxed nation in Africa – Biti warns new ‘punitive, absurd’ taxes will further cripple Zimbabwe’s economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        },
        {
            "title": "Kadewere not dropped for Warriors last match, sources explain – as Nees begs for peace",
            "url": "https://www.newzimbabwe.com/kadewere-not-dropped-for-warriors-last-match-sources-explain-as-nees-begs-for-peace/",
            "content": "By Staff Reporter\n\nREPORTS that Warriors coach Michael Nees was forced to drop forward Tino Kadewere for their World Cup qualifier against Rwanda following his altercation with journalist Yvonne Mangunda, have been dismissed.\n\nKadewere and Mangunda had a short touchline bust-up at Orlando Stadium in South Africa where Zimbabwe were training ahead of their match against Rwanda.\n\nHis absence from the matchday squad had sent tongues wagging, with many arguing he had been dropped by Nees, a case that has been dismissed by sources within the ZIFA entourage in South Africa who explained his absence.\n\nZIFA put out a statement on the matter and that was it. He was not dropped but injured on Monday, said a source from within the entourage.\n\nThose who noticed, on Monday he sat out most of the training because of a knock he got last Friday (when Zimbabwe played Benin in Ivory Coast).\n\nSpeaking after another, slim 1-0 loss Nees fell short of begging for peace and unity, saying the matter had been rested.\n\nI appeal to everybody to stick together, be a little bit humble. We had incidents here and I hope they are all sorted out, said Nees.\n\nWe will not benefit; we all need positive energy. We wanted to break that with a result to get that positive mood. Definitely we have too much noise, there is no doubt about thatwe have to stop that on various platforms.\n\nSocial media has been ablaze since the incident, with fans unevenly divided between Kadewere and Mangunda.\n\nKadewere, despite a dip in form, has found favour and been saluted for standing up for himself while Mangunda is being accused of being toxic towards followers of her Facebook page.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/20005548/Tino-Kadewere-x350.jpg",
            "description": "<p>By Staff Reporter REPORTS that Warriors coach Michael Nees was forced to drop forward Tino Kadewere for their World Cup qualifier against Rwanda following his altercation with journalist Yvonne Mangunda, have been dismissed. Kadewere and Mangunda had a short touchline bust-up at Orlando Stadium in South Africa where Zimbabwe were training ahead of their match</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-not-dropped-for-warriors-last-match-sources-explain-as-nees-begs-for-peace/\">Kadewere not dropped for Warriors last match, sources explain – as Nees begs for peace</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        },
        {
            "title": "Zimbabwe targets Asian beef markets, scales up foot and mouth disease surveillance",
            "url": "https://www.newzimbabwe.com/zimbabwe-targets-asian-beef-markets-scales-up-foot-and-mouth-disease-surveillance/",
            "content": "By Alois Vinga\n\nZimbabwe is stepping up efforts to expand beef exports to Asian markets, with authorities intensifying surveillance of foot-and-mouth disease (FMD) to safeguard herd health and meet international standards.\n\nOnce a major beef exporter in the late 1980s, Zimbabwes livestock sector suffered a sharp decline at the turn of the millennium due to the Fast-Track Land Reform Programme, which disrupted large-scale commercial ranching. This, combined with repeated disease outbreaks such as FMD, led to shrinking herd sizes and the loss of lucrative export markets.\n\nIn recent years, however, the sector has shown significant potential to recover through private and government-led initiatives aimed at boosting productivity, improving quality, and opening new markets.\n\nDeputy Lands and Agriculture Minister Vangelis Haritatos told Parliament that Zimbabwe is now working on expanding its beef export base to East Asia.\n\nGovernment is currently negotiating a bilateral Beef Export Trade Protocol with Asian countries such as the United Arab Emirates and Indonesia. The main challenge affecting exports has been foot-and-mouth disease control.\n\nTo this end, Government has intensified FMD surveillance and established disease-free zones for beef production, Haritatos said.\n\nHe added that the ministry has partnered with African Livestock and Organic Welfare (ALOW) and ZimTrade to ensure beef destined for export meets international quality standards.\n\nEast Asia represents a vast market for beef imports, driven by rising demand from its growing middle class. China remains one of the worlds largest consumers, while Japan and South Korea are also among the regions top importers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10061808/beef.webp",
            "description": "<p>By Alois Vinga Zimbabwe is stepping up efforts to expand beef exports to Asian markets, with authorities intensifying surveillance of foot-and-mouth disease (FMD) to safeguard herd health and meet international standards. Once a major beef exporter in the late 1980s, Zimbabwe’s livestock sector suffered a sharp decline at the turn of the millennium due to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-targets-asian-beef-markets-scales-up-foot-and-mouth-disease-surveillance/\">Zimbabwe targets Asian beef markets, scales up foot and mouth disease surveillance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "11 Sep 2025"
        }
    ]
}