{
    "news": [
        {
            "title": "High Court jails businessman Maburutse for contempt in bitter feud over Matebeleland Engineering (Pvt) Ltd",
            "url": "https://www.newzimbabwe.com/high-court-jails-businessman-maburutse-for-contempt-in-bitter-feud-over-matebeleland-engineering-pvt-ltd/",
            "content": "By Mary Taruvinga\n\nThe High Court has found businessman Regis Maburutse in contempt of court and sentenced him to six months in prison, wholly suspended on condition he complies with a 2023 order barring him from interfering in the affairs of Matebeleland Engineering (Pvt) Ltd.\n\nJustice Regis Dembure ruled that Maburutse had wilfully and blatantly defied an earlier judgment by Justice Gladys Mhuri, which interdicted him from disrupting fellow director and shareholder Tony Renato Sarpo.\n\nThe 1st respondent continues to hold himself out as such [a director], blatantly illegally, and continues to usurp the functions of the board, Sarpo told the court in his affidavit, accusing Maburutse of forging records, harassing employees and even rebranding the companys signage in Harare and Bulawayo under new names in a bid to sidestep the order.\n\nMaburutses legal defence collapsed after the court struck out his opposing affidavit, ruling it had been improperly commissioned. Justice Dembure declared, Once an affidavit is found to have been improperly commissioned, it is a nullity. Nothing can flow from it.\n\nThe court accepted Sarpos claims as unchallenged and stressed that its authority had to be respected. The application must succeed as against the first respondent, Dembure ruled.\n\nIn contrast, Wayne Williams, cited as the second respondent, was cleared of contempt. The judge found the 2023 order imposed no clear obligations on him.\n\nThere can be no contempt of court to talk about in these circumstances, he said.\n\nThe ruling marks another dramatic twist in the long-running shareholder war over Matebeleland Engineering, a dispute that has seen allegations of forgery, asset stripping, and multiple appeals  most of which Sarpo has won.\n\nMaburutse will avoid prison if he immediately complies with the High Court order, but Justice Dembure warned that continued defiance would trigger the six-month custodial sentence at Chikurubi Maximum Prison.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has found businessman Regis Maburutse in contempt of court and sentenced him to six months in prison, wholly suspended on condition he complies with a 2023 order barring him from interfering in the affairs of Matebeleland Engineering (Pvt) Ltd. Justice Regis Dembure ruled that Maburutse had “wilfully and blatantly”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-jails-businessman-maburutse-for-contempt-in-bitter-feud-over-matebeleland-engineering-pvt-ltd/\">High Court jails businessman Maburutse for contempt in bitter feud over Matebeleland Engineering (Pvt) Ltd</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Sep 2025"
        },
        {
            "title": "Baba Harare returns to Jiti after sour gospel experience",
            "url": "https://www.newzimbabwe.com/baba-harare-returns-to-jiti-after-sour-gospel-experience/",
            "content": "By Tapiwa Svondo\n\nBaba Harare has returned to his Jiti roots, abandoning the gospel path he had pursued for the past year.\n\nThe musician, who a year ago stunned fans by announcing his decision to leave secular music for gospel, revealed the disrespect and exploitation he faced within the gospel industry. He accused some church event organisers of refusing to pay artists after performances.\n\nIn a Facebook post, Baba Harare, who had rebranded himself asKing Davidduring his gospel stint, said many promoters expect gospel musicians to perform for free, arguing that payment shouldnt matter because its for the Kingdom.\n\nIve been blessed to experience both worlds the secular stage and the gospel stage. From a ministerial perspective, gospel concerts are powerful. They spread the Word, they win souls, and they glorify God. But from a business perspective, its a different story.\n\nOften, people hide under the idea that because youre ministering for the Kingdom, payment shouldnt matter. But lets be honest: I am not only a Christian, I am also a human being and an artist. This is my work, my livelihood, and I need to survive beyond the stage, wrote Baba Harare.\n\nHe warned upcoming musicians not to rely solely on gospel shows, citing widespread exploitation.\n\nI would not advise any upcoming artist to rely exclusively on gospel shows. Too many times Ive been booked to minister at church events and conferences, only to struggle afterwards to recover even my basic expenses.\n\nShame on those who exploit others in the name of Christ. Lets do better as a community.\n\nThe musician also shared a flyer from a recent gospel event where, after performing, he was met with rudeness when he followed up on a promised payment.\n\nLet me give you a recent example. On Friday, I went to minister at a church (see flyer attached). I didnt charge them a performance fee. All I asked for was a token of $200 to cover my fuel and expenses. Instead of being met with understanding, I was met with rudeness. Suddenly, I was no longer a brother in Christ, but mocked and called a comrade (screenshot attached).\n\nThis is not Kingdom behaviour. This is not how we build each other. And its one of the reasons the gospel industry struggles to move forward,lack of respect, lack of accountability, and non-payment of artists.\n\nIm not posting this to attack anyone, but to spark a real conversation. We dont talk about this enough. If youre a promoter, a church, or an organiser, please do better. Honour your word. Respect the artist. Support the ministry in every sense, said Baba Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/01103128/Baba-Harare.webp",
            "description": "<p>By Tapiwa Svondo Baba Harare has returned to his Jiti roots, abandoning the gospel path he had pursued for the past year. The musician, who a year ago stunned fans by announcing his decision to leave secular music for gospel, revealed the “disrespect” and exploitation he faced within the gospel industry. He accused some church</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/baba-harare-returns-to-jiti-after-sour-gospel-experience/\">Baba Harare returns to Jiti after sour gospel experience</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Sep 2025"
        },
        {
            "title": "In-house vs External Training in Health and Social Care",
            "url": "https://www.newzimbabwe.com/in-house-vs-external-training-in-health-and-social-care/",
            "content": "By Dr Richard Dune\n\nWhy blended learning strategies are becoming a compliance essential for health, social care and education providers\n\nIn the UKs heavily regulated health and social care environment, training is not a nice-to-have, but a non-negotiable requirement. For organisations operating under the scrutiny of theCare Quality Commission(CQC), local authorities and service commissioners, training forms the foundation of workforce development, governance, and regulatory compliance.\n\nWhether its safeguarding, infection prevention, medication administration, or supervision and appraisal, training must be consistent, compliant, and aligned with both operational needs and legal frameworks. Yet many leaders still face a critical question:\n\nShould training be delivered in-house or outsourced to external providers?\n\nIn this article,Dr Richard Duneexamine the strengths and weaknesses of each approach, explores why blended learning models are becoming the preferred option, and highlights how digital compliance systems such asComplyPlusare helping health, social care, and education providers deliver training that is strategic, efficient, and inspection-ready.\n\nHealth and social care training is not merely a workforce development function. It is a pillar of compliance. Providers are required to deliver training that enables staff to perform safely, ethically, and effectively across diverse settings, be it a residential care home, healthcare clinic, a supported living facility or a domiciliary service.\n\nEffective training programmes must support:\n\nFailure to provide this can result in enforcement action, reputational damage, or poor inspection ratings.\n\nIn-house training strengthens internal capacity by enabling staff to deliver tailored learning. The following outlines what it is, its advantages, and the challenges organisations need to address:\n\nIn-house trainingrefers to learning and development delivered internally by a providers own staff. Typically, trainers hold credentials such asTrain the Traineror the Award in Education and Training (AET) and are responsible for cascading knowledge across the workforce.\n\nIn-house delivery is commonly used for:\n\nThis model enables organisations to create training experiences that reflect their internal processes, service users, and local context.\n\nWhen implemented well, in-house training offers multiple benefits:\n\nBy using internal trainers, organisations can ensure training is deeply embedded in practice and reflective of their governance and compliance structures.\n\nHowever, internal training has its limitations, including:\n\nTo be effective, in-house training requires robust planning, adequate resourcing, and integration with digital compliance systems like LMS and TMS platforms.\n\nExternal training brings accredited expertise and fresh perspectives into organisations. The following outlines what it is, its advantages, and the challenges providers should consider:\n\nExternal training refers to programmes delivered by third-party providers, including independent consultants or established training organisations. These may offer accredited qualifications, CPD courses, or modules for regulatory compliance.\n\nExternal training formats range from:\n\nExternal training is often used for high-risk, regulated, or highly specialised areas.\n\nWhen used strategically, external training offers several high-value benefits that can enhance both compliance and service quality:\n\nExternal training is ideal for topics that require independent verification, specialist accreditation, or knowledge outside the organisations internal capacity.\n\nDespite its benefits, external training also presents practical and strategic challenges that providers must carefully consider:\n\nExternal training is a powerful tool, but must be strategically selected, reviewed, and quality-assured to deliver value and compliance assurance.\n\nThe COVID-19 pandemic transformed how providers approach training. With restrictions on face-to-face interaction, organisations turned to e-learning platforms and digital compliance systems to maintain training obligations.\n\nThe result? A lasting shift in how training is delivered.\n\nAs digital learning becomes more embedded in training strategies, providers are seeing a range of measurable benefits across compliance, efficiency, and accessibility:\n\nDigital training has now become a core component of compliance infrastructure, bridging the gap between in-house and external delivery.\n\nRecognising the benefits and drawbacks of both models, many providers are adopting blended training strategies, combining in-house training, external expertise, and digital integration.\n\nThis model aligns closely with regulatory expectations, supporting cost control, consistency, and quality assurance.\n\nBlended training brings together the strengths of in-house delivery, the expertise of external providers, and the efficiency of digital integration to create a comprehensive, compliant, and sustainable training strategy.\n\nIn-house training is typically used for:\n\nExternal training is usually applied to:\n\nDigital integration enhances both models through:\n\nThis blended approach ensures training is flexible, high-quality, and aligned with governance and compliance requirements, regardless of how its delivered.\n\nA blended training strategy enables organisations to leverage the strengths of both internal and external delivery, supported by digital tools that enhance oversight and accountability. Key benefits include:\n\nTogether, these benefits make blended learning a strategic, scalable, and sustainable approach to workforce development and regulatory compliance.\n\nBefore deciding which training model to adopt, providers should ask:\n\nThese questions should be integrated into your broader governance and compliance strategy.\n\nAt The Mandatory Training Group, we developedComplyPlusto support providers in building compliant, blended training systems.\n\nOur all-in-one platform includes:\n\nWhether you run a care home, a multi-site nursery, a supported living service, or a complex group organisation, ComplyPlus helps you combine in-house capability with external assurance, all within one integrated platform.\n\nThe debate isnt in-house vs external training. Its about knowing when to use each and how to tie them together through smart governance, digital systems, and compliance strategy.\n\nThe most resilient organisations are those that treat training as a strategic compliance function, not just an HR process or a tick box exercise.\n\nDelivering the right training mix is more than a choice. Its a compliance requirement and a mark of great leadership.\n\nComplyPlus helps you:\n\nThis article was originally published onThe Mandatory Training Groupwebsite.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09114510/In-house-vs-External-Training-in-Health-and-Social-Care-ComplyPlus%E2%84%A2-Dr-Richard-Dune--scaled.jpg",
            "description": "<p>By Dr Richard Dune Why blended learning strategies are becoming a compliance essential for health, social care and education providers In the UK’s heavily regulated health and social care environment, training is not a nice-to-have, but a non-negotiable requirement. For organisations operating under the scrutiny of the Care Quality Commission (CQC), local authorities and service</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-house-vs-external-training-in-health-and-social-care/\">In-house vs External Training in Health and Social Care</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Sep 2025"
        },
        {
            "title": "Kadewere faces disciplinary action over heated confrontation with journalist",
            "url": "https://www.newzimbabwe.com/kadewere-faces-disciplinary-action-over-heated-confrontation-with-journalist/",
            "content": "By Sports Reporter\n\nWarriors striker Tinotenda Kadewere will face disciplinary action following his attack on journalist Yvonne Mangunda at Orlando Stadium, South Africa, on Monday.\n\nThe incident happened during the teams training session ahead of Tuesdays clash against Rwanda.\n\nKadewere threatened Mangunda, accusing her of negative coverage.\n\nFollowing interventions by teammates, Kadewere later apologised to Mangunda for his behaviour.\n\nZIFA issued a statement condemning Kadeweres behaviour.\n\nThe Zimbabwe Football Association notes with deep regret the incident that occurred at Orlando Stadium during the Warriors media open training session, involving national team player Tinotenda Kadewere and journalist Yvonne Mangunda.\n\nZIFA strongly condemns any form of abuse towards the media. Journalists are a vital part of the game, and we are committed to ensuring they carry out their duties without fear or intimidation.\n\nThe player has apologised to Ms Mangunda, and an amicable understanding between the two parties has been reached. The matter is being addressed through the appropriate disciplinary processes by both the team management and the Association.\n\nWe take full responsibility for upholding the highest standards of conduct within our teams and reaffirm our commitment to respectful engagement with all stakeholders, read the ZIFA statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/12044628/Tinotenda-Kadewere-aaa-e1757412433932.jpeg",
            "description": "<p>By Sports Reporter Warriors striker Tinotenda Kadewere will face disciplinary action following his attack on journalist Yvonne Mangunda at Orlando Stadium, South Africa, on Monday. The incident happened during the team’s training session ahead of Tuesday’s clash against Rwanda. Kadewere threatened Mangunda, accusing her of negative coverage. Following interventions by teammates, Kadewere later apologised to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-faces-disciplinary-action-over-heated-confrontation-with-journalist/\">Kadewere faces disciplinary action over heated confrontation with journalist </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Sep 2025"
        },
        {
            "title": "Cassper Nyovest embarks on weight loss journey after social media criticism",
            "url": "https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/",
            "content": "TshisaLive\n\nCassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29.\n\nAfter facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey.\n\nI was doing cardio all week. This time its a bit more fun because Im playing tennis. Next week Ill start weight training. The comments at the weekend were harsh. It hurt my feelings a bit but sometimes thats what you need, a little push, he said.\n\nIt is a projection, about how you feel about yourself. Body shaming and all of that. You dont know what Im going through. Im going to turn the lemons into lemonade.\n\nThis is not the first time Cassper has undergone a weight loss journey before his Fill Up concerts.\n\nIn 2022 Cassper did it before his Fill Up Mmabatho concert in Mahikeng.\n\nI cant explain how proud I am of myself. This was by far the hardest weight loss journey for me because I have done this three times and I now knew what it would take for me to get back in shape. To be honest, mentally I didnt feel like I was as strong as I once was and I was demoralised.\n\nIts supposed to get easier by the day but it got harder and harder. I just kept waking up and going. Lost touch with a lot of relationships and people because I zoned into this goal and I had no time for anyone but myself.\n\nLooking at these pictures now Im in awe of myself. I owe it to myself never to let myself go like that again. Big shout out to my training and nutrition team. Shout out to Fight Club for always having their doors open for me at any time I wanted to train. We four weeks out Boys! Lets put on a show! Im back!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09051311/nyovest.jpg",
            "description": "<p>TshisaLive Cassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29. After facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey. “I was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/\">Cassper Nyovest embarks on weight loss journey after social media criticism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "09 Sep 2025"
        }
    ]
}