{
    "news": [
        {
            "title": "Mutapa Investment Fund injects US$5.3 million to revive Dorowa Mine, boost fertiliser production",
            "url": "https://www.newzimbabwe.com/mutapa-investment-fund-injects-us5-3-million-to-revive-dorowa-mine-boost-fertiliser-production/",
            "content": "By Anna Chibamu\n\nThe government, through the Mutapa Investment Fund (MIF), has injected US$5.3 million to revive Dorowa Mine in a move aimed at boosting local fertiliser production, reducing reliance on imports, and protecting farmers from costly and potentially harmful chemicals.\n\nAn additional US$11 million is expected to be released to ensure the mine reaches full capacity by March 2026, with a target annual output of 150,000 tonnes of phosphate concentrate.\n\nThis was revealed by Tatenda Chimusoro, Head of Investments for Agriculture and Industrials at the Mutapa Investment Fund, during a Tuesday tour of fertiliser companies by the Parliamentary Portfolio Committee on Industry and Commerce.\n\nMIF is working to revive struggling state-owned entities through loans designed to generate profits and strengthen value chains. The Dorowa intervention will allow the mine to reach its full potential, producing enough phosphates to support local fertiliser blending and meet farmers needs, said Chimusoro.\n\nSilinos Mapfumo, a ZimPhos board member, told the committee that the company adds value to phosphates mined from Dorowa by converting them into NPK basal fertilisers applied during planting. This ensures high-quality fertiliser is made available to farmers across the country, he said.\n\nCommittee chairperson Clemence Chiduwa said the visit was crucial to understanding the domestic fertiliser value chain. It is important to see how local production can meet farmers needs while creating jobs and reducing dependence on imports, he noted.\n\nMapfumo added that the fertiliser industry is a top priority under the National Development Strategy 1 (NDS1). The objective is to increase domestic production and value addition while cutting back on imports. Government already holds a major stake in the industry through MIF, with ownership managed by the Industrial Development Corporation of Zimbabwe (IDCZ), he said.\n\nCurrently, Zimbabwe imports a significant share of its fertiliser, often at higher costs and with risks of harmful contaminants such as cadmium and lead. The revival of Dorowa Mine is expected to lower prices for farmers, create jobs, and strengthen the agricultural sector.\n\nThe Mutapa Investment Funds intervention is timely, Chimusoro emphasised. With the mine fully operational by March, we can secure a sustainable supply of fertilisers, protect farmers, and reduce dependence on imported products.\n\nDorowa Mine, a subsidiary of the Chemplex Group of Companies, had temporarily halted production to allow for major plant upgrades.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25053342/dorowa-scaled.webp",
            "description": "<p>By Anna Chibamu The government, through the Mutapa Investment Fund (MIF), has injected US$5.3 million to revive Dorowa Mine in a move aimed at boosting local fertiliser production, reducing reliance on imports, and protecting farmers from costly and potentially harmful chemicals. An additional US$11 million is expected to be released to ensure the mine reaches</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-investment-fund-injects-us5-3-million-to-revive-dorowa-mine-boost-fertiliser-production/\">Mutapa Investment Fund injects US$5.3 million to revive Dorowa Mine, boost fertiliser production</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Mnangagwa’s rivalry with VP Chiwenga spreads to provinces",
            "url": "https://www.newzimbabwe.com/mnangagwas-rivalry-with-vp-chiwenga-spreads-to-provinces/",
            "content": "The East African\n\nPresident Emmerson Mnangagwas bid to remain in power beyond the two terms permitted by the constitution has triggered an internal revolt within the ruling Zanu PF party, led by the very man who paved the way for his rise eight years ago.\n\nThat rivalry is now spilling into the provinces, where grassroots support will be crucial for a decisive constitutional amendment.\n\nVice President Constantino Chiwenga, the former army general who orchestrated the 2017 military coup that ousted long-time ruler Robert Mugabe, is now locked in a public showdown with President Mnangagwa ahead of a pivotal party conference next month.\n\nIn a dramatic twist to the simmering power struggle, Chiwenga presented Mnangagwa with an explosive dossier accusing petroleum magnate Kudakwashe Tagwirei of looting billions of US dollars from Zanu PF.\n\nTagwirei, a controversial businessman under US and UK sanctions for allegedly fuelling corrupt networks that sustain Mnangagwas rule, is being touted as the presidents preferred successor.There have been concerted efforts to install him within Zanu PF structures.\n\nA long-time financier of the party since the Mugabe era, Tagwirei has pledged $3 million for the October 13 conference, which is expected to pass a resolution extending Mnangagwas term by two years beyond its scheduled end in 2028.\n\nChiwengas dossier, tabled during a meeting of the partys top decision-making body, the politburo, a week ago, threw the cat among the pigeons. It triggered a series of events that have laid bare the intensifying factionalism within the ruling party.\n\nMnangagwas loyalists are mobilising party structures to pass a resolution at the October 13-18 conference to extend the 83-year-old leaders term.\n\nThe proposed extension, which would require a constitutional amendment to remove the two-term limit for presidents, has deeply divided Zanu PF.\n\nRetired General Chiwenga opposes the extension, which would derail his own presidential ambitions. He is reportedly backed by the countrys security establishment.\n\nHis confrontation with the president came a day after Tagwireidonated 300 luxury vehicles to Zanu PF, amid allegations that he was attempting to influence the term extension agenda\n\nJust days earlier, another controversial businessman, Wicknell Chivayo-closely linked to the president, donated cash, vehicles, and ambulances worth over $4 million to Zanu PF regional chairpersons. He said the donation was in celebration of Mnangagwas 83rd birthday.\n\nIn the dossier, Chiwenga alleged that Tagwireihad siphoned $3.2 billion from Zanu PF through opaque investments now being used to buy support for a third term. He called for the immediate arrest of Tagwirei and Chivayo, as well as the recovery of the looted funds.\n\nZanu PF spokesperson Christopher Mutsvangwa dismissed the dossier, describing it as part of a destabilisation campaign driven by power-hungry individuals.\n\nMutsvangwa said the former army commander must wait for the partys elective congress in 2027 if he wishes to succeed Mnangagwa.\n\nThere are persistent efforts from detractors who are throwing cobwebs to make us witch-hunt ourselves, he told journalists in Harare on Monday.\n\nThe politburo is not unduly moved by these things. This debate should not define Zanu PF.\n\nThere are people who wish to see the president removed so they can take over.\n\nWait for your time, it will come at the congress through a democratic process.\n\nA day after Mutsvangwas remarks, President Mnangagwa announced a surprise reshuffle of his top politburo lieutenants, removing a key ally of the VP from the influential Secretary-General post.\n\nEldred Masunurgure, a Harare-based academic, said the escalation of Zanu PFs internal power struggles had reached dangerous levels.\n\nMasunungure drew parallels with past leadership battles in the party, dating back to the pre-independence era when Zanu PF, led by Mugabe, was one of two major liberation movements alongside ZAPU, led by the late Vice President Joshua Nkoma\n\nThose phases had bloody endings-hopefully that wont be repeated this time, he said.\n\nThe long and short of it is that the events in the party are not a mere distraction. These dynamics must not be misread by the public especially the opposition, such as it remains as signalling the demise of the party or its regime.\n\nIn 2017, the army-led by retired Gen Chiwenga, then commander-intervened, claiming that Zanu PF infighting over Mugabes succession threatened the partys survival.\n\nAt the time, Mnangagwa, Mugabes long-time deputy, was in exile in South Africa, having been dismissed over alleged presidential ambitions. The military accused Mugabe of purging war veterans to clear the path for then First Lady Grace Mugabe to succeed him.\n\nMasunungure said Zanu PFs infighting is likely to intensify after the October conference, which will not feature leadership contests, although the push to extend the presidents term is expected to dominate proceedings.\n\nIf anything, the gladiation will likely be either more vicious, hopefully bloodless, or more subtle in a Machiavellian sense, he predicted.\n\nThere will clearly be winners and losers at the conference, but its hard to imagine the losers turning the other cheek.\n\nReuben Mbofana, a Harare-based political commentator, said the reshuffle of the partys top brass was designed to ensure Mnangagwas term extension agenda remains on track.\n\nTo me, this is nothing short of Mnangagwa safeguarding his 2030 agenda just ahead of the party conference, using those reassignments, Mbofana said.\n\nPolitical analysts say the military is likely to play a central role in Zanu PFs succession battles, as it did during Mugabes final days.\n\nPresident Mnangagwa has repeatedly insisted he does not wish to remain in office beyond his two terms, yet he has taken no steps to halt his supporters campaign for a two-year extension.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>The East African President Emmerson Mnangagwa’s bid to remain in power beyond the two terms permitted by the constitution has triggered an internal revolt within the ruling Zanu PF party, led by the very man who paved the way for his rise eight years ago. That rivalry is now spilling into the provinces, where grassroots</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-rivalry-with-vp-chiwenga-spreads-to-provinces/\">Mnangagwa’s rivalry with VP Chiwenga spreads to provinces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Nigerian gospel star Ada Ehi to headline inaugural Love Zimbabwe Festival",
            "url": "https://www.newzimbabwe.com/nigerian-gospel-star-ada-ehi-to-headline-inaugural-love-zimbabwe-festival/",
            "content": "By Darlington Gatsi\n\nTop gospel musicians will converge on the Zimbabwe Grounds in Highfields for the Love Zimbabwe Festival, to be held from 26 to 28 September.\n\nThe three-day festival is expected to feature Nigerias Adah Ehi and local musicians such as Michael Mahendere, Janet Manyowa, Takesure Zamar Ncube.\n\nThe Love Zimbabwe Festival is the brainchild of American clerics Andrew and Wendy Palau, who are collaborating with the Zimbabwe Council of Churches, the Evangelical Fellowship of Zimbabwe, and the Zimbabwe Catholic Bishops Conference.\n\nThe festival will make its debut in Zimbabwe after events in Zambia and Kenya.\n\nZCC Secretary General Wilfred Dimingu said the festival aims to bring together Zimbabweans from across denominational divides.\n\nCome and witness Gods hand at work during this festival. This is an opportunity for us as Zimbabweans to come together regardless of our denominations, said Dimingu.\n\nOrganisers have held a plethora of events in the build-up to the three-day festival. Vulnerable communities have been assisted with the provision of glasses.\n\nCampaigns against drug and substance abuse have been held in areas such as Chitungwiza, Mbare, and Glen View.\n\nPalau said he is expecting a successful debut for the festival in Zimbabwe.\n\nIts an honour and a dream that is finally coming true, to partner with you and all the churches, to lift high the name of Jesus. Serving together, we can reach out to every member of the community, right there in the heart of the city, said Palau.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25035913/ada-ehi.png",
            "description": "<p>By Darlington Gatsi  Top gospel musicians will converge on the Zimbabwe Grounds in Highfields for the Love Zimbabwe Festival, to be held from 26 to 28 September. The three-day festival is expected to feature Nigeria’s Adah Ehi and local musicians such as Michael Mahendere, Janet Manyowa, Takesure Zamar Ncube. The Love Zimbabwe Festival is the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-gospel-star-ada-ehi-to-headline-inaugural-love-zimbabwe-festival/\">Nigerian gospel star Ada Ehi to headline inaugural Love Zimbabwe Festival </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Kavango Resources discovers High-Grade Gold Intersections at Zimbabwe Project",
            "url": "https://www.newzimbabwe.com/kavango-resources-discovers-high-grade-gold-intersections-at-zimbabwe-project/",
            "content": "By Alois Vinga\n\nKavango Resources, a metals exploration and gold production company listed in London and on Zimbabwes Victoria Falls Stock Exchange, has announced promising results from its latest surface drilling programme at the Bills Luck Gold Mine, part of its Hillside Project in southern Zimbabwe.\n\nThe company highlighted an 8.05-metre intersection at a depth of 158.62 metres, grading 8.09 grams per tonne (g/t) of gold, as the standout result from the two-hole diamond drilling campaign.\n\nAccording to Kavango, the multiphase programme, which combines diamond and reverse circulation drilling, is designed to deliver a maiden mineral resource estimate to support future mine planning and scheduling. The results announced on September 22 are from the first two completed diamond drill holes.\n\nOne of the holes, drilled to 250 metres, returned notable assays including 5.10g/t over 2.18m from 28.00m depth, 13.66g/t over 2.75m from 134.00m, and 7.87g/t over 2.60m from 209.80m.\n\nThe second hole, also drilled to 250 metres, intersected 3.49g/t over 5.69m from 28.90m, 9.31g/t over 1.00m from 85.55m, and the headline 8.09g/t over 8.05m from 158.62m.\n\nSurface diamond drilling at Bills Luck continues to exceed our expectations. Weve now confirmed that the main Bills Luck ore body extends to at least 160m vertical depth, with multiple high-grade intersections throughout the latest exploration holes. We are particularly encouraged by the 8.05m intersection at 158.62m carrying 8.09g/t gold, said Kavango CEO Ben Turney.\n\nHe added that the company is preparing to advance mining operations by extending shaft sinking from the current three-level to a four-level operation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Kavango Resources, a metals exploration and gold production company listed in London and on Zimbabwe’s Victoria Falls Stock Exchange, has announced promising results from its latest surface drilling programme at the Bill’s Luck Gold Mine, part of its Hillside Project in southern Zimbabwe. The company highlighted an 8.05-metre intersection at a depth</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-discovers-high-grade-gold-intersections-at-zimbabwe-project/\">Kavango Resources discovers High-Grade Gold Intersections at Zimbabwe Project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "First Mutual Holdings posts profit on USD Policies and Investment Gains",
            "url": "https://www.newzimbabwe.com/first-mutual-holdings-posts-profit-on-usd-policies-and-investment-gains/",
            "content": "By Alois Vinga\n\nFirst Mutual Holdings Limited (FMHL) has reported a profit after tax of US$6.2 million for the half year ended 30 June 2025, reversing a US$32.7 million loss in the same period last year.\n\nThe turnaround was driven by strong uptake of US dollar-denominated insurance policies, improved property valuations and relative stability in Zimbabwes economy. Group insurance contract revenue rose 19% to US$87.7 million, reflecting growing preference for USD-based products.\n\nFMHL also posted fair value gains of US$1 million on investment property, compared with a US$50 million loss in 2024. Net investment returns rose nearly 200% to US$0.5 million, while rental income held steady at US$4.3 million.\n\nThe recovery comes amid tight monetary policy, with the Reserve Bank of Zimbabwe maintaining its policy rate at 35% and high statutory reserve requirements to support the Zimbabwe Gold (ZWG) currency. The measures have provided some stability, though the informal sector continues to dominate, accounting for 76% of output.\n\nPerformance across business units was mixed. First Mutual Health grew revenue 30% to US$36.3 million but posted a US$0.7 million loss due to high claims and weak equity markets. Group Life Assurance revenue increased 26% to US$7.5 million, while profit slipped 11% to US$0.2 million.\n\nNicoz Diamond Insurance reported a 7% decline in revenue to US$18.4 million but achieved a 30% rise in profit to US$0.9 million, supported by favorable claims ratios and cost controls. First Mutual Properties lifted profit 11% to US$2 million, while Wealth Management expanded funds under management from US$114 million to US$150.3 million.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/06173822/FIRST-MUTUAL.gif",
            "description": "<p>By Alois Vinga First Mutual Holdings Limited (FMHL) has reported a profit after tax of US$6.2 million for the half year ended 30 June 2025, reversing a US$32.7 million loss in the same period last year. The turnaround was driven by strong uptake of US dollar-denominated insurance policies, improved property valuations and relative stability in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/first-mutual-holdings-posts-profit-on-usd-policies-and-investment-gains/\">First Mutual Holdings posts profit on USD Policies and Investment Gains</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Sean Williams has been around the block and then some (but he’s not stopping now)",
            "url": "https://www.newzimbabwe.com/sean-williams-has-been-around-the-block-and-then-some-but-hes-not-stopping-now/",
            "content": "WhenSean Williamsmade his international debut on February 25, 2005, precisely one T20 international had been played up to that point. Twenty years later Williams will be in action on the day the 6000th T20I, across mens and womens cricket, will be played. It will also be his 39th birthday, as he continues his run as the worlds longest-serving active international cricketer.\n\nWilliams on his way to an unbeaten 70 against West Indies at the 2007 World Cup, which was a dismal one for ZimbabwePaul Gilham/Getty Images\n\nBrendan Taylor (right) and Williams are among Zimbabwes top five run-getters in ODIsAFP\n\nIn a busy Test year for Zimbabwe, Williams has already scored 648 runs, with one hundred and four half-centuries in eight matchesMatthew Lewis/Getty Images\n\nDav Whatmores tenure as Zimbabwe coach in 2015 was one of Sean Williams most productive periods as an international cricketerIndranil Mukherjee/AFP/Getty Images\n\nWilliams was caught on the boundary for 96 against Ireland at the 2015 World Cup. Replays later showed that the fielder, John Mooney, had touched the boundary line when taking the catch. Ireland won the match by five runsAFP\n\nWilliams is trying to return to bowling more now and hopes to be a complementary bowler to wicket-takers Blessing Muzarabani and Richard NgaravaMichael Bradley/AFP/Getty Images\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/26152556/thumbnail_Sean-Williams.jpeg",
            "description": "<p>ESPN Cric Info When Sean Williams made his international debut on February 25, 2005, precisely one T20 international had been played up to that point. Twenty years later Williams will be in action on the day the 6000th T20I, across men’s and women’s cricket, will be played. It will also be his 39th birthday, as he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-williams-has-been-around-the-block-and-then-some-but-hes-not-stopping-now/\">Sean Williams has been around the block and then some (but he’s not stopping now)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Woman jailed 10 years for trafficking girl (14) into prostitution with trucker",
            "url": "https://www.newzimbabwe.com/woman-jailed-10-years-for-trafficking-girl-14-into-prostitution-with-trucker/",
            "content": "By Staff Reporter\n\nA BUHERA woman has been sentenced to 10 years imprisonment by a Mutare court for human trafficking after luring a minor for the purposes of prostitution.\n\nThe offender, Pelagia Zindiye (30), appeared at Mutare Magistrates Court facing a charge of trafficking a 14-year-old girl on the pretext she was accompanying her on an errand to collect a parcel in the city.\n\nThe court heard that on June 29, 2025, Zindiye tricked the victim into accompanying her to Mutare.\n\nThe following day, the victim secretly left her home and travelled to Mutare together with the offender.\n\nUpon their arrival in the city, they met Steward Gororo, a truck driver who is currently on the run. The offender received US$40from Gororoas payment for sexual services to be rendered by the juvenile.\n\nIt was further heard that the trucker took the minor to a restaurant, where he led her to a private room, locked the door and raped her.\n\nAfter the sexual assault, the victim reconnected with the fixer, Zindiye, who ordered her not to disclose the matter to anyone.\n\nA tip-off was made to the police, leading to Zindiyes arrest.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) said the matter highlights the need for communities to be vigilant and protect vulnerable persons, particularly the girl-child.\n\nSexual violence is a serious crime, so is human trafficking. Lets stand together to protect the vulnerable and ensure offenders are brought to justice, the NPA noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter  A BUHERA woman has been sentenced to 10 years imprisonment by a Mutare court for human trafficking after luring a minor for the purposes of prostitution. The offender, Pelagia Zindiye (30), appeared at Mutare Magistrates Court facing a charge of trafficking a 14-year-old girl on the pretext she was accompanying her on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-jailed-10-years-for-trafficking-girl-14-into-prostitution-with-trucker/\">Woman jailed 10 years for trafficking girl (14) into prostitution with trucker</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Chinese company director jailed, company fined US$20,000 for defying court order on Marimba land",
            "url": "https://www.newzimbabwe.com/chinese-company-director-jailed-company-fined-us20000-for-defying-court-order-on-marimba-land/",
            "content": "By Mary Taruvinga\n\nThe High Court has found a Chinese-owned company, Beable Investments (Pvt) Ltd and its director, Lin Weilan, guilty of contempt of court for defying an order to stop clay extraction and brick moulding on land legally owned by Marimba Residential Properties.\n\nIn a recent judgment, Justice Gibson Mandaza ruled that the company must pay a US$20,000 fine within three days, while Weilan was sentenced to 30 days in prison, wholly suspended on condition that she ensures her company complies with the court order.\n\nThis court will not allow its authority to be reduced to a toothless bulldog, Mandaza said.\n\nThe respondents have no defence at all for disobeying the court order. They have brought the administration of justice into disrepute.\n\nThe dispute centres on Subdivision B of Springs Farm in Harare, a 671-hectare property allocated to Marimba Properties in 2024 as compensation for land lost to settlers in Aspindale Park.\n\nDespite multiple directives from the Environmental Management Agency (EMA), the Ministry of Mines, and the Ministry of Lands to cease operations, Beable Investments continued its activities.\n\nMandaza said photographic and drone evidence provided by a licensed expert showed thriving brick moulding and clay extraction in direct violation of the provisional court order issued in July 2025.\n\nIt does not make sense for the respondents to claim that they are not in contempt when the evidence points to a thriving activity on the farm, the judge noted. It is clearly a lie that there is no activity going on at the farm.\n\nThe judge also dismissed the respondents claims of harassment and their objections to the admissibility of photographic evidence, stressing that directors cannot hide behind their companies to evade accountability.\n\nA director who, with knowledge of a court order against a company, causes that company to disobey it, is himself guilty of contempt of court, Mandaza ruled.\n\nThe background to the case reveals a protracted land wrangle. In April 2024, President Emmerson Mnangagwa directed that Marimba Residential Properties be compensated with Springs Farm and Stuhm land after it lost Aspindale Park.\n\nGovernment officials, including Lands Minister Anxious Masuka and Local Government Minister Daniel Garwe, confirmed the transfer.\n\nIn October 2024, the Mines Ministry revoked Beable Investments mining certificate, but the company refused to vacate the land.\n\nJustice Mandaza said the conduct of the company and its director showed a knack for defying authority, adding that their continued operations undermined the rule of law.\n\nAll orders of court, whether correctly or incorrectly granted, have to be obeyed until they are properly set aside, he warned.\n\nThe ruling compels Beable Investments and its director to immediately stop operations, or risk execution of property and imprisonment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has found a Chinese-owned company, Beable Investments (Pvt) Ltd and its director, Lin Weilan, guilty of contempt of court for defying an order to stop clay extraction and brick moulding on land legally owned by Marimba Residential Properties. In a recent judgment, Justice Gibson Mandaza ruled that the company</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-company-director-jailed-company-fined-us20000-for-defying-court-order-on-marimba-land/\">Chinese company director jailed, company fined US$20,000 for defying court order on Marimba land</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        },
        {
            "title": "Malawi’s ex-president Mutharika, 85, wins election by a landside",
            "url": "https://www.newzimbabwe.com/malawis-ex-president-mutharika-85-wins-election-by-a-landside/",
            "content": "Agencies\n\nFormer Malawi President Peter Mutharika has been re-elected with 56.8 percent of votes in last weeks polls that was marked by the dire state of the economy, the election commission has announced.\n\nIncumbent President Lazarus Chakwera took 33 percent of ballots cast on September 16, the authority announced on Wednesday.\n\nEarlier on Wednesday, Chakwera conceded defeat to his predecessor Mutharika, 85, in the largely poor Southern African nation, battered by soaring costs and severe fuel shortages.\n\nIt is only right that I concede defeat out of respect for your will as citizens and out of respect for the constitution, Chakwera, 70, said in an address.\n\nIt was clear that my rival Peter Mutharika has an insurmountable lead over me, he added.\n\nIn the days that remain, I want you to know that I am committed to a peaceful transferofpower, Chakwera said.\n\nLast week, citizens took to the polls to vote on the countrys next leader, in a vote that analysts predicted would be one of the most tightly contested elections in the country in recent history between Mutharika and Chakwera, the candidates of the two biggest parties in Malawis parliament.\n\nHowever, the dire state of the economy dominated the election, with critics accusing the president of mismanagement and indecisiveness.\n\nSince Chakwera was elected in 2020, the country has experienced economic stagnation.\n\nCosts soared in the impoverished agricultural nation, with inflation reaching 33 percent and the price of food, maize and fertiliser increasing.\n\nAccording to the World Bank, nearly three-quarters of Malawians live below the $3 a day poverty line.\n\nAccording to the banks estimates, about half the countrys population does not receive the minimum number of calories required for adequate nutrition.\n\nChakwera also promised to crack down on corruption when he was elected, but critics have accused his government of dealing with cases slowly and selectively.\n\nIn comparison, former law professor Mutharika was credited with improving infrastructure and lowering inflation during his presidency from 2014 to 2020. However, critics accused him of cronyism, which he denied.\n\nIn 2019, Mutharikas 2019 election victory was annulled by a constitutional court due to irregularities, including the use of correction fluid on results sheets.\n\nIn the rerun the following year, Chakwera secured his victory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/29131933/President-Peter-Mutharika.jpg",
            "description": "<p>Agencies Former Malawi President Peter Mutharika has been re-elected with 56.8 percent of votes in last week’s polls that was marked by the dire state of the economy, the election commission has announced. Incumbent President Lazarus Chakwera took 33 percent of ballots cast on September 16, the authority announced on Wednesday. Earlier on Wednesday, Chakwera</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malawis-ex-president-mutharika-85-wins-election-by-a-landside/\">Malawi’s ex-president Mutharika, 85, wins election by a landside</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "25 Sep 2025"
        }
    ]
}