{
    "news": [
        {
            "title": "High Court orders Harare City Council to immediately refurbish Mbare flats in landmark ruling",
            "url": "https://www.newzimbabwe.com/high-court-orders-harare-city-council-to-immediately-refurbish-mbare-flats-in-landmark-ruling/",
            "content": "By Mary Taruvinga\n\nThe High Court has ordered the City of Harare and the government to refurbish Mbare flats with immediate effect to restore dignity to residents who have lived under squalid and intolerable conditions for years.\n\nThe landmark ruling follows an application by residents who told the court that the responsible authorities had long forgotten their mandate and should be compelled to do their work.\n\nHigh Court judge Justice Priscilla Munangati-Manongwa ruled in favour of the residents and ordered the respondents to act swiftly.\n\nCited as respondents in the application were the City of Harare, Local Government, National Housing, Health and Environment ministers.\n\nThe applicants were the combined Harare Residents Association and one Israel Mabhoo\n\nWhereupon after reading documents filed of record and hearing counsel it is ordered that the City of Harar has breached its legal duty to the residents or tenants of Matapi, Matererini, Mbare Flats, Nenyere (also called Magaba) and Shawasha hostels situated in Mbare hostels in terms of the common law and statute by completely neglecting the basicduties and obligations of a landlord and local authority resulting in residents of the Mbare hostels livingin squalid and intolerable conditions.\n\nIt is ordered that the City of Harare is compelled to fulfil its mandatory statutory and common law obligations as a landlord and the local authority of the said hostels or flats to make them safe and fit for human habitation.\n\nIt is ordered that the City of Harare is compelled to immediately restore basic essential services such as a functional water and sewer reticulation system, the cleaning and sanitation of the said flats and hostels.\n\nThe city was also ordered to collect refuse and install fire extinguishers, fire warning devices and fire escapes.\n\nThe judge also ordered the Local Government and National Housing ministers Daniel Garwe and Soda Zhemu together with the local authority to provide temporary shelter such as tents and basic services to the affected residents or tenants during the rehabilitation, renovation, refurbishment, rebuilding of the hostels where such actions require the residents to temporarily vacate from the hostels.\n\nAlternatively they are jointly and severally obliged to put in place a comprehensive plan and interim measures pending relocation to a temporary alternative accommodation guaranteeing security against eviction, access to sanitation, access to water, electricity or gas for heating, lighting and cooking, installation of chemical toilets to the affected residents.\n\nThe National housing minister is ordered to take necessary measures in terms of the Urban Councils Act to ensure that the City of Harare forthwith or within a reasonable period of time provides or restores essential services such as the supply of safe, clean and potable water, refuse collection and disposal and sewerage system to the affected residents.\n\nThe Health Minister, Douglas Mombeshora was ordered to take necessary measures in terms of the Public Health Act to prevent, contain or control the outbreak of diseases or pandemics at the hostels.\n\nMangaliso Ndlovu, the Environment minister, was ordered to take necessary measures to prevent pollution around the hostels.\n\nThere was no order with regard to costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Mary Taruvinga The High Court has ordered the City of Harare and the government to refurbish Mbare flats with immediate effect to restore dignity to residents who have lived under “squalid and intolerable conditions” for years. The landmark ruling follows an application by residents who told the court that the responsible authorities had long</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-orders-harare-city-council-to-immediately-refurbish-mbare-flats-in-landmark-ruling/\">High Court orders Harare City Council to immediately refurbish Mbare flats in landmark ruling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Devine Lunga scoops Player of the Match accolade, as Sundowns beat Stellenbosch.",
            "url": "https://www.newzimbabwe.com/devine-lunga-scoops-player-of-the-match-accolade-as-sundowns-beat-stellenbosch/",
            "content": "By Sport Reporter\n\nWarriors defender Devine Lunga was voted player of the match on Wednesday night after helping Mamelodi Sundowns beat Stellenbosch 1-0 in the Betway Premiership.\n\nWednesdays was the first for Lunga under new club coach Miguel Cardoso who was marking his league debut since his appointment last week.\n\nThe Zimbabwean left-back had a good outing which saw him helping his side to protect the teams solitary goal scored by Iqraam Rayners in the 18th minute.\n\nLunga could have walked away with an assist only if Lucas Ribeiro was calm enough to finish his delivery in the 36th minute.\n\nThe former Golden Arrows defender marked his third appearance in the league for Sundowns on Wednesday, after having limited game time under coach Manqoba Mngqiti who was fired last week.\n\nFor Sundowns, Wednesdays victory was a sweet revenge for the teams 2-0 aggregate loss to Stellenbosch in the MTN 8 semi-finals early this season.\n\nWith a four-match unbeaten run in the league, the Brazilians are now focusing on their next league match against Amazulu scheduled for 24 December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/19061420/devine-lunga.jpg",
            "description": "<p>By Sport Reporter Warriors defender Devine Lunga was voted player of the match on Wednesday night after helping Mamelodi Sundowns beat Stellenbosch 1-0 in the Betway Premiership. Wednesday’s was the first for Lunga under new club coach Miguel Cardoso who was marking his league debut since his appointment last week. The Zimbabwean left-back had a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/devine-lunga-scoops-player-of-the-match-accolade-as-sundowns-beat-stellenbosch/\">Devine Lunga scoops Player of the Match accolade, as Sundowns beat Stellenbosch.</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Land invaders jailed for unlawfully occupying farm",
            "url": "https://www.newzimbabwe.com/land-invaders-jailed-for-unlawfully-occupying-farm/",
            "content": "By Staff Reporter\n\nFIVE illegal settlers have each been slapped with a one-month jail term for unlawfully occupying a farm in Hurungwe district, Mashonaland West province.\n\nThe quintet of Itai Mwale (42), Misheck Mwale (36), Richard Ziwonye (42), Potgetier Mwaze (40) and Isaak Dabvu (33) were recently arraigned before a Karoi magistrate facing charges of unlawfully occupying Bonanza farm in Tengwe, Hurungwe.\n\nThe court heard that the property was gazetted for resettlement under the A1 model scheme and was allocated to intended beneficiaries by the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development.\n\nIt was further averred that the five men unlawfully invaded part of Bonanza farm during the period extending from 2012 to November 28, 2014, and erected various structures while others engaged in farming activities on the farm.\n\nThe group was found guilty of occupying gazetted land without permits or resettlement offer letters from the ministry.\n\nThe presiding magistrate ordered the accused persons to vacate Bonanza farm by January 31, 2025.\n\nIn addition to the eviction order, the group members were each sentenced to four months imprisonment of which three months were suspended for five years on condition of good behaviour. They will, therefore, effectively serve one month behind bars each.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/12/19043340/Karoi-Mag.jpg",
            "description": "<p>By Staff Reporter FIVE illegal settlers have each been slapped with a one-month jail term for unlawfully occupying a farm in Hurungwe district, Mashonaland West province. The quintet of Itai Mwale (42), Misheck Mwale (36), Richard Ziwonye (42), Potgetier Mwaze (40) and Isaak Dabvu (33) were recently arraigned before a Karoi magistrate facing charges of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/land-invaders-jailed-for-unlawfully-occupying-farm/\">Land invaders jailed for unlawfully occupying farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Man (20) sentenced to 17 years in jail for rape",
            "url": "https://www.newzimbabwe.com/man-20-sentenced-to-17-years-in-jail-for-rape/",
            "content": "By Staff Reporter\n\nA DRUNK man, who raped a 33-year-old woman who was gathering thatching grass in the bush, has been sentenced to 17 years imprisonment.\n\nThe unidentified offender aged 20 of Chief Muusha, Chimanimani in Manicaland province, was reportedly drunk when he committed the heinous crime.\n\nHe was found guilty and slapped with a lengthy jail term to deter would-be offenders.\n\nThe court heard that on November 10, 2024, the accused person, who was visibly intoxicated, found the complainant in a bushy area where she was collecting dry grass for thatching.\n\nHe pounced on the unsuspecting woman, grabbed her from behind and she started screaming for help. In a bid to silence her, the accused person threatened to kill the complainant before dragging her to a secluded place in the bush and raped her.\n\nAfter committing the crime, the assailant fled the scene.\n\nThe court further heard that the complainant sought help at a nearby shopping centre, where she reported the matter to other villagers.\n\nMembers of the community mobilised and launched a manhunt for the accused person, who was apprehended and handed over to the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A DRUNK man, who raped a 33-year-old woman who was gathering thatching grass in the bush, has been sentenced to 17 years imprisonment. The unidentified offender aged 20 of Chief Muusha, Chimanimani in Manicaland province, was reportedly drunk when he committed the heinous crime. He was found guilty and slapped with a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-20-sentenced-to-17-years-in-jail-for-rape/\">Man (20) sentenced to 17 years in jail for rape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Civil societies lobby for safe abortions",
            "url": "https://www.newzimbabwe.com/civil-societies-lobby-for-safe-abortions/",
            "content": "By Mary Taruvinga\n\nThe Health Law Policy (HLPC) working together with the Institute for Young Womens Development (IYWD) is pushing for amendment of the abortion law in Zimbabwe to create a safe abortion environment for women and girls.\n\nThis comes at a time when unsafe pregnancy terminations are largely contributing to maternal deaths in the country amid issues of stigma and criminalisation of abortion.\n\nZimbabwe is currently relying on the Termination of Pregnancy Act enacted in 1977.\n\nThe Act allows abortion in specific circumstances, which the two organisations feel are not broad enough to allow safe abortions.\n\nHLPC programmes coordinator Dorcas Chitiyo told NewZimbabwe.com on the sidelines of a media sensitisation training held over the weekend, that there is a need to move with the times and create a safe environment for abortions in Zimbabwe.\n\nThe issue that we are grappling with is that there are many barriers that women face, that are in existence, that are prohibiting access to safe abortions.\n\nWe start with our legal framework, that is the Termination of Pregnancy Act of 1977.\n\nIt creates challenges for women because it has very restricted grounds on which abortion is legalmaybe a woman is a survivor of a sexually violent offence or rape resulting in pregnancy, a crime of incest or in the event that it has been recommended by a doctor that the pregnancy continuation is not safe for the child as well as the quality of life for the child is anticipated to be so poor that termination is recommended by a medical practitioner.\n\nNow given that this act is from 1977, there have been many medical advances and much research and a lot of work done to ensure that abortions are accessed safely through medical procedures and medically without the need of always resorting to surgical processes, she said.\n\nChitiyo said the reality is that women currently have to resort to only seeking legal abortion in a few instances but this does not mean that abortion is not happening.\n\nWhere there are restrictions, what this simply does is it puts abortion underground. It leads to clandestine work that can endanger the life of women, it can endanger their quality of life. It might compromise their future \n\nSo we are saying there is a challenge in the environment we are operating in because of this criminalisation where a person who commits an abortion can be imprisoned for up to five years, she added.\n\nUnder the current law, a person who assists with an abortion can also be imprisoned.\n\nAccording to Chitiyo, there is a lot of stigma, and there are a lot of dangers that are associated with that environment which is restricted.\n\nWe are calling for change, where we say the grounds upon which abortions are allowed in Zimbabwe are broadened to factor in mental health, social economic considerations.\n\nWe are calling for the law to be amended. Our existing law of 1977 is way out of date. It needs to catch up with the present time.\n\nShe said even when abortion grounds are available a woman has to go through so many processes and many permissions, a situation which has to be changed.\n\nHLPC and ITYD have since come up with a position paper on safe abortion highlighting the issues mentioned above among other things.\n\nThe position paper argues that the time for reform towards access to legal and safe abortion in Zimbabwe is now.\n\nThe civic society organisations are working with support from the Safe Abortion Action Fund (SAAF).\n\nThe two organisations said Zimbabwe has one of the highest rates of contraceptive use in Sub-Saharan Africa but also one of the highest maternal mortality ratios in the world.\n\nIt has been observed that there are disparities in access to sexual and reproductive health care across age groups.\n\nA high unmet need for contraceptives has been consistently observed among unmarried and adolescent women.\n\nThese gaps in Zimbabwes family planning program leave women at risk of experiencing an unintended pregnancy and abortion, they said.\n\nIn 2016, an estimated 65,300 induced abortions occurred in Zimbabwe.\n\nThis translates to a rate of 17 abortions for every 1,000women aged 1549.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/01034132/Abortion.jpg",
            "description": "<p>By Mary Taruvinga The Health Law Policy (HLPC) working together with the Institute for Young Women’s Development (IYWD) is pushing for amendment of the abortion law in Zimbabwe to create a safe abortion environment for women and girls. This comes at a time when unsafe pregnancy terminations are largely contributing to maternal deaths in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/civil-societies-lobby-for-safe-abortions/\">Civil societies lobby for safe abortions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Chloe Bailey finally confirms she’s dating Burna Boy on loved-up trip to Nigeria",
            "url": "https://www.newzimbabwe.com/chloe-bailey-finally-confirms-shes-dating-burna-boy-on-loved-up-trip-to-nigeria/",
            "content": "The Sun\n\nUS singer Chloe Bailey has confirmed her relationship with Afrobeats legend Burna Boy as the pair party it up in Nigeria fuelling romance rumours.\n\nThey were seen in aLagosnightclub looking very cosy as multiple videos surfaced of them dancing together.\n\nChloe and the Nigerian Native, 36, were reportedly first introduced at theBillboard Music Awardsback in 2022 where they were both presenters.\n\nTwo years later they appear to have grown close  while confirming their relationship.\n\nChloe, 26,was spotted wearingBurna Boys$1 million chain as the couple danced staring in to one anothers eyes and whispering into each others ears.\n\nThey were then papped leaving the club in the early hours hand-in-hand.\n\nThe couple first added fuel to the rumour mill when Chloe arrived in Burna Boys home country with a huge bouquet of flowers from the Afrobeats star.\n\nFans were in shock over the new couple, taking toX formerly known as Twitterto comment on the pair, one user said: Chloe Bailey dating Burna boy is the biggest plot twist of the year.\n\nChloe Bailey and Burna Boy got so much chemistry (heart eyes emoji) added another.\n\nBurna Boy is happy. Chloe Bailey is happy. Only the miserable humans who need to go outside, touch grass and find love are ones who think those two dont look cute together, penned a third.\n\nThe British star may be getting in the way of his new romance  after she posted and deleted a video this month.\n\nThe video showed her in the Rolls-Royce that Burna Boy gifted her last year.\n\nThey first split in 2021 and have been on and off ever since.\n\nMeanwhile Chloe, who is the older sister of The Little Mermaid actressHalle Baileyhas previously been romantically linked with US rapperGunnaandOffset.\n\nThe singer worked on songs with each rapper and became the centre of romance rumours with both stars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/19040808/American-singer-and-actress-Chloe-Bailey-was-spotted-hanging-out-with-Burna-Boy-over-the-weekend-in-Lagos-Nigeria.jpeg",
            "description": "<p>The Sun US singer Chloe Bailey has confirmed her relationship with Afrobeats legend Burna Boy as the pair party it up in Nigeria fuelling romance rumours. They were seen in a Lagos nightclub looking very cosy as multiple videos surfaced of them dancing together. Chloe and the Nigerian Native, 36, were reportedly first introduced at the Billboard</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chloe-bailey-finally-confirms-shes-dating-burna-boy-on-loved-up-trip-to-nigeria/\">Chloe Bailey finally confirms she’s dating Burna Boy on loved-up trip to Nigeria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Congo files criminal complaints against Apple in Europe over conflict minerals",
            "url": "https://www.newzimbabwe.com/congo-files-criminal-complaints-against-apple-in-europe-over-conflict-minerals/",
            "content": "Reuters\n\nThe Democratic Republic of Congo has filed criminal complaints against Apple subsidiaries in France and Belgium, accusing the tech firm of using conflict minerals in its supply chain, lawyers for the Congolese government told Reuters.\n\nCongo is a major source of tin, tantalum and tungsten, so-called 3T minerals used in computers and mobile phones. But some artisanal mines are run by armed groups involved in massacres of civilians, mass rapes, looting and other crimes, according to U.N. experts and human rights groups.\n\nApple does not directly source primary minerals and says it audits suppliers, publishes findings and funds bodies that seek to improve mineral traceability.\n\nApple last year said it had no reasonable basis for concluding its products contain illegally exported minerals from conflict-hit zones. The tech giant has insisted it carefully verifies the origin of materials in its output.\n\nIts 2023 filing on conflict minerals to the U.S. Securities and Exchange Commission said none of the smelters or refiners of 3T minerals or gold in its supply chain had financed or benefited armed groups in Congo or neighboring countries.\n\nBut international lawyers representing Congo argue that Apple uses minerals pillaged from Congo and laundered through international supply chains, which they say renders the firm complicit in crimes taking place in Congo.\n\nIn parallel complaints filed to the Paris prosecutors office and to a Belgian investigating magistrates office on Monday, Congo accuses local subsidiaries Apple France, Apple Retail France and Apple Retail Belgium of a range of offenses.\n\nThese include covering up war crimes and the laundering of tainted minerals, handling stolen goods, and carrying out deceptive commercial practices to assure consumers supply chains are clean.\n\nIt is clear that the Apple group, Apple France and Apple Retail France know very well that their minerals supply chain relies on systemic wrongdoing, says the French complaint, after citing U.N. and rights reports on conflict in east Congo.\n\nBelgium had a particular moral duty to act because looting of Congos resources began during the 19th-century colonial rule of its King Leopold II, Congos Belgian lawyer Christophe Marchand said.\n\nIt is incumbent on Belgium to help Congo in its effort to use judicial means to end the pillaging, he said.\n\nThe complaints, prepared by the lawyers on behalf of Congos justice minister, make allegations not just against the local subsidiaries but against the Apple group as a whole.\n\nFrance and Belgium were chosen because of their perceived strong emphasis on corporate accountability. Judicial authorities in both nations will decide whether to investigate the complaints further and bring criminal charges.\n\nIn an unrelated case in March, a U.S. federal court rejected an attempt by private plaintiffs to hold Apple, Google, Tesla, Dell and Microsoft accountable for what the plaintiffs described as their dependence on child labor in Congolese cobalt mines.\n\nMinerals fuel violence\n\nSince the 1990s, Congos mining heartlands in the east have been devastated by waves of fighting between armed groups, some backed by neighboring Rwanda, and the Congolese military.\n\nMillions of civilians have died and been displaced.\n\nCompetition for minerals is one of the main drivers of conflict as armed groups sustain themselves and buy weapons with the proceeds of exports, often smuggled via Rwanda, according to U.N. experts and human rights organizations.\n\nRwanda denies benefiting from the trade, dismissing the allegations as unfounded.\n\nAmong the appendices to Congos legal complaint in France was a statement issued by the U.S. State Department in July, expressing concerns about the role of the illicit trade in minerals from Congo, including tantalum, in financing conflict.\n\nThe statement was a response to requests from the private sector for the U.S. government to clarify potential risks associated with manufacturing products using minerals extracted, transported or exported from eastern Congo, Rwanda and Uganda.\n\nCongos complaints focus on ITSCI, a metals industry-funded monitoring and certification scheme designed to help companies perform due diligence on suppliers of 3T minerals exported from Congo, Rwanda, Burundi and Uganda.\n\nCongos lawyers argue that ITSCI has been discredited, including by the Responsible Minerals Initiative (RMI) of which Apple is a member, and that Apple nevertheless uses ITSCI as a fig leaf to falsely present its supply chain as clean.\n\nThe RMI, whose members include more than 500 companies, announced in 2022 it was removing ITSCI from its list of approved traceability schemes.\n\nIn July, it said it was prolonging the suspension until at least 2026, saying ITSCI had not provided field observations from high-risk sites or explained how it was responding to an escalation of violence in North Kivu province, which borders Rwanda and is a key 3T mining area.\n\nITSCI criticized the RMIs own processes and defended its work in Congo as reliable. It has also rejected allegations in a 2022 report by campaigning group Global Witness entitled The ITSCI Laundromat, cited in Congos legal complaint in France, that it was complicit in the false labeling of minerals from conflict zones as coming from mines located in peaceful areas.\n\nApple mentioned ITSCI five times in its 2023 filing on conflict minerals. The filing also made multiple mentions of the RMI, in which Apple said it had continued active participation and leadership but did not mention the RMIs ditching of ITSCI.\n\nIn its July statement, the U.S. State Department said flaws in traceability schemes have not garnered sufficient engagement and attention to lead to changes needed.\n\nRobert Amsterdam, a U.S.-based lawyer for Congo, said the French and Belgian complaints were the first criminal complaints by the Congolese state against a major tech company, describing them as a first salvo only.\n\nSome information for this report came from Agence France-Presse.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/27075424/Apple-Company.jpg",
            "description": "<p>Reuters The Democratic Republic of Congo has filed criminal complaints against Apple subsidiaries in France and Belgium, accusing the tech firm of using conflict minerals in its supply chain, lawyers for the Congolese government told Reuters. Congo is a major source of tin, tantalum and tungsten, so-called 3T minerals used in computers and mobile phones.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congo-files-criminal-complaints-against-apple-in-europe-over-conflict-minerals/\">Congo files criminal complaints against Apple in Europe over conflict minerals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Mnangagwa urged to declare a national disaster as Harare’s primary water source becomes deadly for people, wildlife, livestock and aqua life",
            "url": "https://www.newzimbabwe.com/mnangagwa-urged-to-declare-a-national-disaster-as-harares-primary-water-source-becomes-deadly-for-people-wildlife-livestock-and-aqua-life/",
            "content": "By Staff Reporter\n\nFormer Harare Mayor Hebert Gomba has called on President Emmerson Mnangagwa to declare the contamination of Lake Chivero a state of national disaster, in order to solve the whole array of challenges caused by the water poisoning.\n\nChivero is the primary source of water for Harare residents.\n\nThe contamination of Lake Chivero has been topical this week following an expos by NewZimbabwe.com investigative reporter Mary Taruvinga over the weekend.\n\nBefore this four white rhinos alongside other wildlife, livestock and birds had been reported dead by the Zimbabwe Parks and Wildlife Management Authority (ZimParks).\n\nZimParks said tests had established that the deaths occurred after the animals drank cyanobacteria-contaminated water.\n\nThe contamination was widely caused by a continuous discharge of raw sewage into the lake by Harare City Council.\n\nRELATED:\n\nA visit to the lake showed it had been heavily contaminated and thousands of fish had also died.\n\nA stretch of over a kilometre inspected by the reporter was covered with layers of rotting fish and some fish was captured dying.\n\nThe water had turned green following an algae bloom and had become smelly.\n\nA stench smell of rotting fish and sewage-infested water engulfed the environs of the lake.\n\nIn an X Space discussion Wednesday night Gomba said the work that now lies in the way of Harare City Council is beyond its capacity to deal with and requires the governments attention.\n\nThe politician also said the city can not be blamed for what is unfolding.\n\nThe City needs to be assisted. But it needs to be done in conformity with the law.\n\nMy proposal is for the president to declare a state of national disaster.\n\nRehabilitation of infrastructure should be from the source. The whole distribution system should be refurbished.\n\nIt has been a disaster for too long hence we need a holistic approach and declare this a national disaster.\n\nThe whole system has decayed. We need the whole system to be revamped, he said.\n\nGomba also blamed the late long-time ruler Robert Mugabe for failing to handle the situation from the time he came into power.\n\nWho is to blame? The late former president Robert Mugabe, the ministers who were working with Robert Mugabe whether dead or alive, even if they are holding certain offices now.\n\nGomba said Mugabes government was supposed to construct the Kunzvi and Musami dams, which were supposed to be completed by 1990 but these projects failed.\n\nWe should blame the government.\n\nFrom 1980 to now it has failed to run these affairsHarare was supposed to get water from Kunzvi and Musami so that Chivero could be decommissioned for cleaning.\n\nThe City Council was not able to decommission Lake Chivero because Kunzvi was not built. It was supposed to be built in 1990, he said.\n\nGomba said now more money is needed to solve the situation.\n\nWe need a huge investment into our infrastructure for our water and sewer system\n\nNorton also needs a sewer system plan so that they dont discharge into Darwendale.\n\nThat takes a lot of money, he said.\n\nThe government has since banned fishing operations in Lake Chivero to give space for investigations.\n\nHarare Mayor Jacob Mafume on Tuesday told journalists that they will have a way forward after a fact-finding visit which was scheduled for Wednesday.\n\nZimParks has since relocated the remaining rhinos from Lake Chivero Recreational Park to a safer place among other precautionary measures.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Staff Reporter Former Harare Mayor Hebert Gomba has called on President Emmerson Mnangagwa to declare the contamination of Lake Chivero a state of national disaster, in order to solve the whole array of challenges caused by the water poisoning. Chivero is the primary source of water for Harare residents. The contamination of Lake Chivero</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-urged-to-declare-a-national-disaster-as-harares-primary-water-source-becomes-deadly-for-people-wildlife-livestock-and-aqua-life/\">Mnangagwa urged to declare a national disaster as Harare’s primary water source becomes deadly for people, wildlife, livestock and aqua life</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Civil servants endure second month of late salary payment amid hefty US$ windfall for top officials",
            "url": "https://www.newzimbabwe.com/civil-servants-endure-second-month-of-late-salary-payment-amid-hefty-us-windfall-for-top-officials/",
            "content": "By Staff Reporter\n\nFOR the second consecutive month, the government has failed to pay its employees, including teachers, their meagre salaries on time exacerbating suffering among the working class.\n\nMost civil servants were supposed to have their salaries reflected in their accounts this week, but nothing has come as the Christmas holiday fast approaches.\n\nLast month, November, some teachers among other government workers got late disbursements of their Zimbabwe Gold (ZiG) payments while the United States dollar component of their salaries and bonuses never reflected in their accounts.\n\nThe Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) made the claims in a post on social media this Wednesday, stating that civil servants were wallowing in abject poverty amid continued neglect by their employer.\n\nFor the second month in a row, the Zimbabwean government has failed to pay civil servants salaries on time. Civil servants are already earning paltry salaries and are battling to make ends meet.\n\nFestive season was struck off the calendar of government workers way back. Unfortunately, the late payment of salaries adds a new layer of pain to the exploited government employees. Failing to meet the basics for survival when others are swimming in plenty is torturous, said ARTUZ.\n\nThe teachers representative body alleges top bureaucrats were now enjoying the fruits of their manipulative conduct, which saw them suppressing dissent among impoverished public service employees.\n\nSenior government officials have since received their big perks in United States dollars. The majority of these elites are now on holiday with their families claiming to be resting from a busy year.\n\nIndeed it was a busy year for them. Looting from the impoverished is not an easy job. Working round the clock to silence the oppressed and disenfranchised majority is not an easy task. But as they rest they should be assured that the underpaid civil servants will not be silenced forever.\n\nARTUZ said its members had endured enough unfair labour practices and warned of protests to demand improved pay and working conditions. Teachers are demanding at least US$1 260 per month from an average of US$300.\n\nWe are not in the habit of making empty threats. The anger from the civil servants is reaching the boiling point. 2025 will be a difficult year for those who steal from the poor. We will organize and demand fair wages paid on time, ARTUZ said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/02194048/Teachers-Strike.jpeg",
            "description": "<p>By Staff Reporter FOR the second consecutive month, the government has failed to pay its employees, including teachers, their meagre salaries on time exacerbating suffering among the working class. Most civil servants were supposed to have their salaries reflected in their accounts this week, but nothing has come as the Christmas holiday fast approaches. Last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/civil-servants-endure-second-month-of-late-salary-payment-amid-hefty-us-windfall-for-top-officials/\">Civil servants endure second month of late salary payment amid hefty US$ windfall for top officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        },
        {
            "title": "Scottland FC ground break Mabvuku Stadium as Harare City Council snubs event",
            "url": "https://www.newzimbabwe.com/scottland-fc-ground-break-mabvuku-stadium-as-harare-city-council-snubs-event/",
            "content": "By Darlington Gatsi\n\nAMBITIOUS football club, Scottland FC will begin the construction of Mabvuku 1 Stadium following the official handover of Number 1 Ground by the City of Harare on Wednesday.\n\nThe club, which is owned by ZANU PF legislator Pedzai Scott Sakupwanya, agreed to lease the ground from the local authority for 30 years.\n\nThe 15,000-capacity stadium will serve as the home ground for Scottland FC in the upcoming 2025 Castle Lager Premier Soccer League season, although no specific timelines for completion have been provided.\n\nScottland FC chairman Tonderai Sakupwanya described the construction of the stadium as a milestone move for the Mabvuku-based team.\n\nThe scope of this event, is the official handover from the Council to Mombeyaora consultancy which has the lease of these grounds for the next 30 years. From here we start our work.\n\nI would refer to the engineers and people doing the construction but we are going to do things in phases. We are going to take things one step at a time but immediately we are going to begin the construction of a clubhouse and a practice pitch, said Sakupwanya.\n\nNumber 1 Ground holds historic significance, having produced football legends such as Brenna Musiska, Joel Mugabe, and Cephas Chimedza, among others.\n\nHowever, the official handover of the ground was marked by the conspicuous absence of senior Harare officials.\n\nThis has raised questions about the City Councils full support, as it has traditionally overseen the ownership of recreational facilities in Harare.\n\nSakupwanya said the project will be a multipurpose facility housing different sports codes.\n\nHere is going to be not only a stadium. It will be a facility housing football pitches l, cricket, swimming pools, and stores to sell. We are just reviving and revitalising. It is a big project, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/19034637/scottland-groundbreaking.png",
            "description": "<p>By Darlington Gatsi AMBITIOUS football club, Scottland FC will begin the construction of Mabvuku 1 Stadium following the official handover of Number 1 Ground by the City of Harare on Wednesday. The club, which is owned by ZANU PF legislator Pedzai Scott Sakupwanya, agreed to lease the ground from the local authority for 30 years.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fc-ground-break-mabvuku-stadium-as-harare-city-council-snubs-event/\">Scottland FC ground break Mabvuku Stadium as Harare City Council snubs event </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:29",
            "date": "20 Dec 2024"
        }
    ]
}