{
    "news": [
        {
            "title": "Myanmar earthquake: death toll rises to almost 700 as search for survivors continues",
            "url": "https://www.newzimbabwe.com/myanmar-earthquake-death-toll-rises-to-almost-700-as-search-for-survivors-continues/",
            "content": "By The Guardian\n\nTHE death toll from a huge earthquake that hit Myanmar has reached almost 700, as rescuers dig through the rubble of collapsed buildings in a desperate search for survivors.\n\nThe shallow 7.7-magnitude quake struck northwest of the city of Sagaing in central Myanmar in the early afternoon, followed minutes later by a 6.7-magnitude aftershock.\n\nThe quake destroyed buildings, downed bridges, and buckled roads across swathes of Myanmar, with severe damage reported in the second biggest city, Mandalay.\n\nAt least 694 people were killed and nearly 1,700 injured in Myanmars Mandalay region  believed to be the worst affected  the ruling junta said in a statement. About 10 more deaths have also been confirmed in Bangkok, the Thai capital, where a high rise building under construction collapsed.\n\nBut with communications badly disrupted, the true scale of the disaster has yet to emerge from the isolated military-ruled state, and the toll is expected to rise significantly.\n\nIt was the biggest quake to hit Myanmar in over a century, according to US geologists, and the tremors were powerful enough to severely damage buildings across Bangkok, hundreds of kilometres (miles) away from the epicentre.\n\nRescuers in the Thai capital laboured through the night searching for workers trapped when a 30-storey skyscraper under construction collapsed, reduced in seconds to a pile of rubble and twisted metal by the force of the shaking.\n\nBangkok governor Chadchart Sittipunt told AFP that about 10 people had been confirmed killed across the city, most in the skyscraper collapse.\n\nBut up to 100 workers were still unaccounted for at the building, close to the Chatuchak weekend market that is a magnet for tourists.\n\nBangkok city authorities said they will deploy more than 100 engineers to inspect buildings for safety after receiving over 2,000 reports of damage.\n\nWhile there was no widespread destruction, the shaking brought some dramatic images of rooftop swimming pools sloshing their contents down the side of many of the citys towering apartment blocks and hotels.\n\nEven hospitals were evacuated, with one woman delivering her baby outdoors after being moved from a hospital building. A surgeon also continued to operate on a patient after evacuating, completing the operation outside, a spokesperson told AFP.\n\nBut the worst of the damage was in Myanmar, where four years of civil war sparked by a military coup have ravaged the healthcare and emergency response systems.\n\nJunta chief Min Aung Hlaing issued an exceptionally rare appeal for international aid, indicating the severity of the calamity. Previous military regimes have shunned foreign assistance even after major natural disasters.\n\nThe country declared a state of emergency across the six worst-affected regions after the quake, and at one major hospital in the capital, Naypyidaw, medics were forced to treat the wounded in the open air.\n\nOne official described it as a mass casualty area.\n\nMandalay, a city of more than 1.7 million people, appeared to have been badly hit. Photos showed dozens of buildings reduced to rubble.\n\nA rescue worker from Amarapura, an ancient city and now a township of Mandalay, said the bodies of 30 people had been recovered from collapsed multistorey apartment blocks.\n\nI have never experienced anything like this before  our town looks like a collapsed city, he said, estimating that about a fifth of the buildings had been destroyed.\n\nA resident reached by phone told AFP that a hospital and a hotel had been destroyed, and said the city was badly lacking in rescue personnel.\n\nAnother witness in Mandalay, who asked not to be named, said eight people had been killed and others were feared to be trapped after a construction building in Pyigyitagon township collapsed.\n\nThe whole of Mandalay city was affected by the earthquake. The rescue teams and hospitals are now overrun. We are managing with the resources we have in the neighbourhood, they said.\n\nImages published by Khit Thit Media, a news agency based in Myanmar, showed piles of bricks and rubble outside a damaged mosque, also in Mandalay. At least 20 people had died there, it reported, though it was not possible to verify this figure.\n\nA huge queue of buses and lorries lined up at a checkpoint to enter Naypyidaw early on Saturday.\n\nOffers of foreign assistance began coming in, with President Donald Trump on Friday pledging US help.\n\nIts terrible, Trump told reporters in the Oval Office about the quake when asked if he would respond to the appeal by Myanmars military rulers.\n\nIts a real bad one, and we will be helping. Weve already spoken with the country.\n\nIndia, France and the European Union offered to provide assistance, while the WHO said it was mobilising to prepare trauma injury supplies. Chinas President Xi Jinping extended condolences, state media reported.\n\n(Agence France-Presse and Reuters contributed to this report).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/29052717/FY25_MyanmarEQ_MOB1img.jpg",
            "description": "<p>By The Guardian  THE death toll from a huge earthquake that hit Myanmar has reached almost 700, as rescuers dig through the rubble of collapsed buildings in a desperate search for survivors. The shallow 7.7-magnitude quake struck northwest of the city of Sagaing in central Myanmar in the early afternoon, followed minutes later by a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/myanmar-earthquake-death-toll-rises-to-almost-700-as-search-for-survivors-continues/\">Myanmar earthquake: death toll rises to almost 700 as search for survivors continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Big at home, small elsewhere: CBZ lays out plan to go international",
            "url": "https://www.newzimbabwe.com/big-at-home-small-elsewhere-cbz-lays-out-plan-to-go-international/",
            "content": "By newZWire\n\nCBZ is Zimbabwes largest bank, but CEO Lawrence Nyazema sees it as a big fish in a small pond. He says its time for the bank to expand beyond the countrys bordersstarting this year.\n\nCBZ had planned to grow through mergers and acquisitions, including deals with First Mutual Limited and ZB, but competition regulators blocked the moves. Despite this setback, the bank is still convinced it can go international.\n\nWe cannot remain a Zimbabwean play, our partners are venturing out into the world, and we cannot leave them to go there alone, Nyazema told a meeting of top clients on Wednesday.\n\nCBZ will take its first steps outside Zimbabwe by the end of the year. Its first target is South Africa, which accounts for 70% of Africas insurance revenues. The bank is also looking at Botswana and other markets beyond Africa.\n\nWe like Botswana not as a market where we generate revenue, but we like Botswana because its friendly from a capital perspective, he said. We believe well be able to raise reasonably priced capital either to deploy in Botswana or to deploy elsewhere in the world.\n\nNyazema wants to see CBZ expanding into Africa, the Middle East, and the Americas. Our goal is to be present in seven African countries, one Middle Eastern country, and two South American countries.\n\nZimbabwean companies, especially banks, dont exactly have a stellar record in their attempts to operate in the region. The list of companies that tried and ran back home is long. Nyazema says CBZ will be more cautious, given the size of more experienced operators in the region.\n\nThe company is adopting a measured approach, acknowledging its relative size compared to established players in the target markets, he says. We acknowledge our size; we may be big in Zim, but we are very small elsewhere.\n\nTo scale up, CBZ will explore joint ventures or mergers and acquisitions where it can.\n\nThe bank is also looking to underwrite more business. After raising US$50 million in credit lines from Afreximbank in February, CBZ now plans to raise up to US$500 million this year. With Zimbabwe shut out of international markets, Nyazema sees this as a major achievement.\n\nRaising half a billion dollars is our goal, but it must be under the right conditions. If we achieve this, it will greatly benefit the economy by stimulating trade, supporting business activities across various sectors, and ultimately enhancing overall economic growth, Nyazema said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27051258/lawrence-cbz.jpg",
            "description": "<p>By newZWire  CBZ is Zimbabwe’s largest bank, but CEO Lawrence Nyazema sees it as a big fish in a small pond. He says it’s time for the bank to expand beyond the country’s borders—starting this year. CBZ had planned to grow through mergers and acquisitions, including deals with First Mutual Limited and ZB, but competition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/big-at-home-small-elsewhere-cbz-lays-out-plan-to-go-international/\">Big at home, small elsewhere: CBZ lays out plan to go international</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Govt says security services ‘on high alert’ amid calls for protests",
            "url": "https://www.newzimbabwe.com/govt-says-security-services-on-high-alert-amid-calls-for-protests/",
            "content": "By Staff Reporter\n\nThe government has upped security across the country as disgruntled war vet Blessed Bombshell Geza calls for demonstrations against President Emmerson Mnangagwa.\n\nGeza has been opposing the extension of Mnangagwas tenure and demanding his immediate resignation, levelling allegations of corruption, tribalism and cronyism. Earlier this month, he was expelled from Zanu PF, where he was a Central Committee member over allegations of indiscipline.\n\nThe war vet has recently done explosive live broadcasts calling on citizens to take to the streets on March 31.\n\nIn a statement, Thursday, Home Affairs Minister Kazembe Kazembe warned citizens against participating in the planned protests.\n\nThe illegal acts being mobilised undermine the prevailing security, peace and stability.The retrogressive intents should be dismissed with the contempt they deserve. Those fronting the mobilisation should stand warned.\n\nThe countrys security services are on high alert to ensure the sustained safety and security of the public. The Zimbabwean Republic Police has made adequate deployments to guarantee an environment conducive to socio-economic development and unhindered movement of people in all parts of the country, reads part of the statement.\n\nPolice have since issued a two-month-long prohibition order from March 27 until May 31, barring the carrying of weapons including swords, knobkerries, axes, daggers, machetes and catapults in Harare and Bulawayo.\n\nThere has also been a heavy deployment of police officers in both urban and rural areas to maintain peace and order.\n\nAdded Kazembe, May I also remind the public of the need to abide by the provisions of the Criminal Law (Codification and Reform) Act Chapter 24, which is categorical on the maintenance of public order. Equally, I need not emphasize that we are all expected to remain guided by the provisions of Section 164 of the Criminal Law (Codification and Reform) Act and Section 164 of the Cyber Security and Data Protection Act on offences relating to electronic communications and materials.\n\nThe relevant instruments would be invoked to deal with those who unlawfully engage in transmitting, broadcasting and distributing data messages to any person, group of persons or to the public with the intent to incite acts of violence against any persons or to cause damage to any property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/25185424/Home-Affairs-Minister-Kazembe-Kazembe.jpg",
            "description": "<p>By Staff Reporter The government has upped security across the country as disgruntled war vet Blessed “Bombshell” Geza calls for demonstrations against President Emmerson Mnangagwa. Geza has been opposing the extension of Mnangagwa’s tenure and demanding his immediate resignation, levelling allegations of corruption, tribalism and cronyism. Earlier this month, he was expelled from Zanu PF,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-says-security-services-on-high-alert-amid-calls-for-protests/\">Govt says security services ‘on high alert’ amid calls for protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Transport ministry announces road closure to allow upgrade",
            "url": "https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-allow-upgrade/",
            "content": "By Staff Reporter\n\nTHE Ministry of Transport and Infrastructural Development (MTID) has announced the closure of Simon Mazorodze Road from Harare Drive to Willowvale Road/St George Street.\n\nThe closure, effective 27 March until further notice, is part of a project contracted to Tensor Systems aimed at upgrading and rehabilitating the road.\n\nIn a public notice the MTID announced the temporary traffic changes to ensure a smooth flow of transport and pedestrians.\n\nAll pedestrians and the motoring public who use the affected road are advised as follows: construction of the carriageway)  detours northbound (city-bound citybound (or northbound) traffic may use watts road (the service road adjacent to Simon Mazorodze) by exiting Simon Mazorodze at the Chinzou roundabout and joining the service lane.\n\nTraffic may shift back into Simon Mazorodze after the construction zone. Alternatively, city-bound traffic may turn left onto Harare Drive, then right onto Willowvale road, or continue to highfield road. Southbound (Masvingo bound) traffic may continue using the southbound carriageway. During this period, Watts shall operate as a one-way street, reads the notice.\n\nTraffic will continue on the southbound carriageway initially, but later shift to the northbound lane as construction progresses.\n\nConstruction of the southbound (Masvingo bound Tensor Systems carriageway)  detours northbound (city bound) traffic shall continue to use Watts road, which shall continue to operate as a one-way street as described above. southbound (Masvingo-bound) traffic will be moved the then completed northbound carriageway.\n\nAlternatively, southbound traffic may turn left into Daniel Street then immediately right into Mbirimi Drive, left into St Georges street, right into Waterfalls avenue then back into Simon Mazorodze road, further reads the notice.\n\nMotorists are advised to follow all traffic signs, allow extra travel time, and give way to construction vehicles. Further updates on detours will be provided as necessary.\n\nOther diversion routes will be advised as they are prepared. Additional diversions shall be added to allow bridge construction. Road users are free to use any other roads of their choice but the ministry will only be responsible for the designated routes.\n\nRoad users are advised to follow the traffic signs strictly and at all times cooperate with traffic controllers posted around the construction zone.\n\nAllow for extra time to reach intended destinations. Give right of way to all construction machinery, including all vehicles branded tensor systems, to ensure safety to all road users, the ministry said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/05162122/Road-Construction.jpg",
            "description": "<p>By Staff Reporter  THE Ministry of Transport and Infrastructural Development (MTID) has announced the closure of Simon Mazorodze Road from Harare Drive to Willowvale Road/St George Street. The closure, effective 27 March until further notice, is part of a project contracted to Tensor Systems aimed at upgrading and rehabilitating the road. In a public notice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-allow-upgrade/\">Transport ministry announces road closure to allow upgrade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Tel One F.C plots victory against CAPS United",
            "url": "https://www.newzimbabwe.com/tel-one-f-c-plots-victory-against-caps-united/",
            "content": "By Sports Reporter\n\nGWERU-based topflight league side Tel One FC is eyeing to cause an upset against league giants CAPS United when they face off Saturday at Bata Stadium.\n\nThe Wi-Fi Boys are enjoying a good start in the topflight league where they are sitting on position eight with four points, three behind log leaders MWOS FC.\n\nTel One has lost once against Herentals on matchday one before thrashing Triangle 4-1 and picking and draw against Dynamos before the international break.\n\nCommenting ahead of the CAPS United game team, head coach Herbert Maruwa said the only option for them is to win.\n\nIts not going to be an easy game, CAPS United is a big team, but we have our own targets, to make sure we collect maximum points.\n\nThe team is doing well and Saturday against CAPS we have to give our best. We are coming from a draw away from home against Dynamos, but now we are now home we have to utilise our home advantage and get maximum points.\n\nCAPS United walks into Saturdays match with confidence after picking its first win against Triangle a fortnight ago.\n\nMakepekepe had a slow start in the league, as they started of with a 1-1 draw against Green Fuel before losing to Scottland on the second matchday.\n\nCurrently they occupy position nine with four points.\n\nMATCHHAY 4 FIXTURES\n\nSATURDAY\n\nTELONE FC VS CAPS UNITED F.C. (Bata Stadium)\n\nHIGHLANDERS FC VS SCOTTLAND F.C.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/14064152/telone.jpeg",
            "description": "<p>By Sports Reporter GWERU-based topflight league side Tel One FC is eyeing to cause an upset against league giants CAPS United when they face off Saturday at Bata Stadium. The Wi-Fi Boys are enjoying a good start in the topflight league where they are sitting on position eight with four points, three behind log leaders</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-f-c-plots-victory-against-caps-united/\">Tel One F.C plots victory against CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Chevrons to host New Zealand and South Africa in T20 tri-nations series",
            "url": "https://www.newzimbabwe.com/chevrons-to-host-new-zealand-and-south-africa-in-t20-tri-nations-series/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens cricket team, popularly known as the Chevrons, is set to host New Zealand and South Africa in a T20-tri nations series.\n\nThe series is scheduled to run from the 14th of July to the 26 th.\n\nNeighbours South Africa are scheduled to land earlier in the country as they have a two match test series against the Chevrons before they play the tri nations series.\n\nThe test matches series will be played at Queens Sports Club in Bulawayo, the first one scheduled for June 28 to July 2, before the second match will which run from July 6 to 10.\n\nBoth sides will then shift base to Harare for the tri-nations series clash in crickets shortest format at Harare Sports Club, where the stage will be opened by the two sides on July 14, before South Africa face off with New Zealand two days later.\n\nThe Chevrons will then bounce back in action on July 18 with a clash against New Zealand before facing off the the Proteas in the second leg on the 20th.\n\nAction will then continue on July 22 when South Africa face the Black Caps for the second leg, before Zimbabwe rounds off group games on the 24th with the same opponents.\n\nThe T20 series will end on the 26th of July when top two teams from the two legged round robbin group stages face off in the final.\n\nCommenting on the tri-series, Zimbabwe Cricket managing director Givemore Makoni said, This is the biggest international home season we have had in years.\n\nIt is an incredible opportunity for our players to test themselves against two of the worlds cricketing powerhouses.\n\nHosting South Africa and New Zealand for both Test cricket and an exciting T20I tri-series is a fantastic development for the growth of the game in Zimbabwe.\n\nWe are looking forward to welcoming the teams and putting on a great spectacle for our passionate cricket fans.\n\nZimbabwe last hosted a T20I tri-nation series in July 2018, featuring Australia and Pakistan, with Pakistan emerging victorious.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17061815/ZIM-T20-CHEVRONS.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s cricket team, popularly known as the Chevrons, is set to host New Zealand and South Africa in a T20-tri nations series. The series is scheduled to run from the 14th of July to the 26 th. Neighbours South Africa are scheduled to land earlier in the country as they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-host-new-zealand-and-south-africa-in-t20-tri-nations-series/\">Chevrons to host New Zealand and South Africa in T20 tri-nations series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Tragedy strikes as mine employee is electrocuted",
            "url": "https://www.newzimbabwe.com/tragedy-strikes-as-mine-employee-is-electrocuted/",
            "content": "By Staff Reporter\n\nA SOMBRE atmosphere has engulfed a gold mine in Chinhoyi after an employee working about 100 metres underground was electrocuted while trying to connect a water pump.\n\nThe incident, which claimed the life of Blessed Kanongota aged 21, occurred at Rody Boys Mine just outside Chinhoyi.\n\nZimbabwe Republic Police (ZRP) provincial spokesperson, Inspector Ian Kohwera confirmed the incident.\n\nI confirm a sudden death by electrocution of a 21-year-old man at Rody Boys 4 Mine, Chinhoyi on March 25, 2025, at around 1500 hours.\n\nBlessed Kanongota of Hunyani farm, Chinhoyi was working in a mine shaft approximately 100 meters deep extracting gold ore with other employees.\n\nAt around 1440 hours, one of the employees outside the shaft wanted those in the shaft to drain water using a water pump. He dropped an electric cable and advised them to connect the water pump. Kanongota was electrocuted in the process and died, said Kohwera.\n\nElectricity was switched off, and Kanongotas body was hoisted to the surface.\n\nMine manager Mostaf Sayemu was advised before a police report was made at ZRP Chinhoyi Rural. Police attended the scene and conveyed the body to Chinhoyi Provincial Hospital mortuary for postmortem.\n\nInvestigations are reportedly still underway to establish what transpired.\n\nKohwera urged miners to ensure safety measures are always in place to avoid loss of life through such avoidable incidents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/04045212/mortuary.jpeg",
            "description": "<p>By Staff Reporter A SOMBRE atmosphere has engulfed a gold mine in Chinhoyi after an employee working about 100 metres underground was electrocuted while trying to connect a water pump. The incident, which claimed the life of Blessed Kanongota aged 21, occurred at Rody Boys Mine just outside Chinhoyi. Zimbabwe Republic Police (ZRP) provincial spokesperson,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tragedy-strikes-as-mine-employee-is-electrocuted/\">Tragedy strikes as mine employee is electrocuted </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Police probe arson at Zanu PF-linked tycoons Tagwirei and Chivayo’s business premises",
            "url": "https://www.newzimbabwe.com/police-probe-arson-at-zanu-pf-linked-tycoons-tagwirei-and-chivayos-business-premises/",
            "content": "By Costa Nkomo\n\nFOLLOWING alleged bombings in which vehicles were set alight outside the offices of Zanu PF-linked businessmen Wicknell Chivayo and Kudakwashe Tagwirei, as well as a petrol station in Harare on Thursday night, police have confirmed they are investigating the incidents.\n\nThese suspected bombings occurred hours after expelled Zanu PF Central Committee member and militant war veteran Blessed Geza named Tagwirei and Chivayo as criminals around the President.\n\nIn his explosive address Wednesday evening, Geza warned that action against all the corrupt individuals he named, Chivayo and Tagwirei among them, would be dealt with as a matter of urgency.\n\nWhile he stopped short of specifying the precise action to be taken against these so-called criminals surrounding President Emmerson Mnangagwa, his words have now taken on a decidedly ominous tone.\n\nIn a statement released Friday, Zimbabwe Republic Police (ZRP) National Police spokesperson, Commissioner Paul Nyathi stated that authorities are investigating incidents involving vehicles that were set ablaze at Tagwirei and Chivayos business premises.\n\nThe Zimbabwe Republic Police has received reports of petrol instigated burning of moving vehicles at business premises in Avondale, Highlands, Newlands, and Goromonzi on 28 March 2025 between 12 midnight and 4am.\n\nThis was done by suspects who were driving the vehicles. They quickly jumped onto accompanying vehicles and ran away. Police are conducting investigations into the incidents, Nyathi said.\n\nThe curious timing of the attacks, so soon after Gezas pronouncements, have raised eyebrows. Some observers are suggesting that Gezas words might have been the straw that broke the camels back, inciting individuals to take matters into their own hands.\n\nOther commentators believe that there is more to this than meets the eye, and that the bombings could be the result of internal power struggles inside Zanu PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/29035232/GnHY1KVXAAAzcVw.jpeg",
            "description": "<p>By Costa Nkomo FOLLOWING alleged bombings in which vehicles were set alight outside the offices of Zanu PF-linked businessmen Wicknell Chivayo and Kudakwashe Tagwirei, as well as a petrol station in Harare on Thursday night, police have confirmed they are investigating the incidents. These suspected bombings occurred hours after expelled Zanu PF Central Committee member</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-probe-arson-at-zanu-pf-linked-tycoons-tagwirei-and-chivayos-business-premises/\">Police probe arson at Zanu PF-linked tycoons Tagwirei and Chivayo’s business premises</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "ZETDC introduces mandatory $25 electrical inspections fee for households and other tariffs for generator owners",
            "url": "https://www.newzimbabwe.com/zetdc-introduces-mandatory-25-electrical-inspections-fee-for-households-and-other-tariffs-for-generator-owners/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Electricity Transmission and Distribution Company (ZETDC) has announced a US$25 fee mandatory for inspections and re-inspections of electrical installations nationwide.\n\nIn a public notice, ZETDC said this move will ensure safety and reliability within the electrical infrastructure following recent incidents of house fires and electrical accidents.\n\nWhy these inspections are crucial, recent incidents of house fires and electrical accidents underscore the critical importance of maintaining safe electrical installations. These inspections are not just procedural, but are a vital step in preventing potentially devastating consequences. Unsafe wiring, faulty connections, and non-compliant installations pose serious risks to electricity users and members of the public.\n\nYour safety is our priority!, ZETDC is dedicated to ensuring that all electrical systems meet the highest safety standards. These inspections will identify and rectify potential hazards, minimizing the risk of electrical fires, shocks, and other dangers, reads the notice.\n\nIn addition to the US$25 inspection fee, those who own specific generators will also be charged to pay for the verification and safety inspection fees.\n\nMandatory fees associated with inspections, to facilitate these essential safety measures, the following mandatory fees apply: Statutory inspections and re-inspections: $25.00 (All customers)\n\nGenerator Verification and Safety Inspection Fees: Up to 100KW (petrol, diesel, solar, wind, etc): $5.00 Above 100KW (petrol, diesel, solar, wind, etc): $50.00 Advanced Safety Inspection Fees: For generators below 100KW (petrol, diesel, solar, wind, etc): $20.00 For generators above 100KW (petrol, diesel, solar, wind, etc): $100.00, For prototype generators below 100KW (petrol, diesel, solar, wind, etc): $100.00\n\nCustomers are advised that all payments are to be made using the official ZETDC payment platforms and a receipt shall be provided to that effect. No payments shall be made to individuals during the process of the inspections, reads the notice.\n\nZETDC also added that, We understand that inspections may cause some inconvenience, but the safety of your family and property is paramount. We urge all customers to cooperate fully with our inspection teams. By adhering to these statutory requirements and cooperating with ZETDC, we can collectively create a safer environment for everyone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/29023916/Meter-Box-Replacement-scaled-1.jpeg",
            "description": "<p>By Staff Reporter  THE Zimbabwe Electricity Transmission and Distribution Company (ZETDC) has announced a US$25 fee mandatory for inspections and re-inspections of electrical installations nationwide. In a public notice, ZETDC said this move will ensure safety and reliability within the electrical infrastructure following recent incidents of house fires and electrical accidents. “Why these inspections are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zetdc-introduces-mandatory-25-electrical-inspections-fee-for-households-and-other-tariffs-for-generator-owners/\">ZETDC introduces mandatory $25 electrical inspections fee for households and other tariffs for generator owners </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        },
        {
            "title": "Govt says over one million to benefit from housing schemes by 2030",
            "url": "https://www.newzimbabwe.com/govt-says-over-one-million-to-benefit-from-housing-schemes-by-2030/",
            "content": "By Thandiwe Garusa\n\nTHE governmentis targeting toprovide decent accommodation to over a million citizens with a focus on eliminating illegal settlements and ensuring access to basic services like electricity, clean water and sanitation.\n\nSpeaking at the official ground breaking ceremony of popular cleric Emmanuel Makandiwas United Family International Church (UFIC) housing project in Harare, Waterfalls, Wednesday, Deputy Minister of Local Government and Public Works Benjamin Kabikira said government is willing to have private partnerson boardto help develop serviced housing as part of efforts to curb illegal settlements.\n\nKabikira added that by 2030, over one million people would have benefited from these partnerships.\n\nWe have many illegal settlements in Zimbabwe and it is also our wish that everyone must have a well-serviced home with electricity, roads, access to clean water and a sewer reticulation system.\n\nAs government, we are taking many initiatives to provide accommodation to citizens and these projects by churches to push the same agenda towards developing accommodation for everyone, we really appreciate this as a government, and it is through these partnerships that we move the nation forward, he said.\n\nWe are aiming to provide serviced stands to one million people by 2030, and we are certain we will exceed this target through public-private partnerships.\n\nThe housing scheme  Operation Nehemiah started in 2016 under UFIC and was designed to cater for those people who would ordinarily not afford to be homeowners and will benefit 6,000 beneficiaries.\n\nThese beneficiaries included members of the UFIC as well as non-members.\n\nThe land earmarked for an orphanage, church and residential stands had been illegally grabbed and sold to hundreds of families by suspected Zanu PF-linked land barons who were later evicted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/28085846/Benjamin-Kabikira-scaled.jpg",
            "description": "<p>By Thandiwe Garusa THE government is targeting to provide decent accommodation to over a million citizens with a focus on eliminating illegal settlements and ensuring access to basic services like electricity, clean water and sanitation. Speaking at the official ground breaking ceremony of popular cleric Emmanuel Makandiwa’s United Family International Church (UFIC) housing project in Harare, Waterfalls,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-says-over-one-million-to-benefit-from-housing-schemes-by-2030/\">Govt says over one million to benefit from housing schemes by 2030</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "29 Mar 2025"
        }
    ]
}