{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Investing in Special Economic Zones",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-investing-in-special-economic-zones/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss investing in Special Economic Zones, what does that mean, and what are the general benefits?\n\nVM: A special economic zone is a specified area or location that benefits from or operates under different or special trade laws from those governing businesses operating in the rest of the economy. A specific area may be awarded that designation on application to the government through the responsible body.\n\nLong and short, several countries offer this investment incentive to attract investors and investment. In Zimbabwe, a business operating in a special economic zone may benefit, among other business-specific or tailor-made benefits, from a fiveyear income tax holiday, reduced corporate tax, exemption from customs duty on capital equipment and raw materials.\n\nIt is important to understand that some exemptions may be unique to that business to assist operationalisation or enhance operations. Further to the unique requirements and benefits that may accrue with the status, the business may also enjoy other exemptions available that include exemption on royalties, taxes on management fees etc.\n\nThe purpose and intention are that the long-term benefits of the business outweigh the short-term reprieve in taxes or operational encumbrances and limit set-up costs.\n\nReporter:I notice you mention mainly benefits to the company to the company operating under that status. What benefits accrue to the country or what benefits to the country are critical when considering such applications?\n\nVM: It is my understanding that each business or application to operate under a special economic zone status is looked at in terms of its own unique value proposition. Part of the potential benefits considered by the regulators before issuing special economic zone status, among other things, is the potential export receipts from the business, if it is an exporting business.\n\nThey also look at issues to do with local employment and potential skills development, technology transfer, access to services and community development initiatives by the company that will be operating under a special economic zone status.\n\nIt is useful for such applications to also include other community benefits that will accrue from the granting of the status. Such benefits may include things like rehabilitation of basic infrastructure, building of community service areas like shopping centres, schools, hospitals et cetera so that the local community benefits from the investment project enjoying special economic zone status.\n\nIt is the whole list of benefits considered together that then qualifies or disqualifies a business or area for special economic zone status.\n\nReporter: Do we have areas that benefit from such status already?\n\nVM: Yes, there are areas that have been granted special economic zone status to date. I will mention the most common areas, Sunway City along Mutare road in Harare, before Ruwa, the status is aimed at technology and pharmaceuticals. Bulawayo is targeting industrial manufacturing to recapacitate the area and regain its status as the manufacturing hub of the country, and Victoria Falls on tourism and financial services among others.\n\nReporter: Who designates or assigns special economic zones status?\n\nVM: In a bid to promote the ease of doing business, the mandate to oversee the designation and administration of special economic zones is now directly under the Zimbabwe Investment Development Agency. The previous position under the Special Economic Zones Act, which created the Zimbabwe Economic Zones Authority, was repealed for the purposes of centralising or streamlining investment service provision.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28033521/Special-Eco-Zone.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss investing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-investing-in-special-economic-zones/\">Legal Discussions with Vengai Madzima: Investing in Special Economic Zones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "28 May 2025"
        },
        {
            "title": "In Pictures: UZ lecturers stage third demonstration",
            "url": "https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/",
            "content": "Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled.jpg",
            "description": "<p>Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16. Pictures by Thandiwe Garusa </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/\">In Pictures: UZ lecturers stage third demonstration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "28 May 2025"
        },
        {
            "title": "Tagwirei-led Land Tenure Committee a coterie of looters – Mawarire",
            "url": "https://www.newzimbabwe.com/tagwirei-led-land-tenure-committee-a-coterie-of-looters-mawarire/",
            "content": "By Staff Reporter\n\nLATE President Robert Mugabes spokesperson Jealousy Mawarire has come out in support of a constitutional court application by disgruntled war veterans who are challenging the legality of President Emmerson Mnangagwas Lands Tenure Implementation Committee.\n\nThe Committee, led by businessman Kudakwashe Tagwirei, seeks to establish freehold on agricultural land despite clear constitutional provisions placing its ownership in the State.\n\nAccording to war veterans, the committee has been demanding payments of an unclear nature from beneficiaries of the countrys Land Reform Programme, with some being ordered to pay as much as US$1.5 million.\n\nWar veterans want the committee declared unlawful and for it to let all land issues be dealt with by the constitutionally mandated Land Commission.\n\nSpeaking on SABCs Channel Africa, in support of the court application, Mawarire described the committee as a quartet of looters and Mnangagwas land barons.\n\nThe Presidents attempt to introduce freehold land ownership is a huge departure from the provisions of the constitution and the overarching objective of the liberation struggle, which was to deal with private ownership of land, said Mawarire.\n\nWe have a President who does not respect the constitution for which he was sworn in to uphold.\n\nIn the event that the President has abrogated his responsibilities and has actually, in this case, started to behave like a land baron, then the war veterans are duty-bound to step in and offer those checks and balances that the opposition can no longer do.\n\nThey have launched a constitutional court application in order to put a stop to this madness that is being presided over by the President and his coterie of looters.\n\nIf you look at the whole scheme, this is a parallel structure formed by the President outside the provision of the constitution.\n\nSection 296, Section 297 and Section 72 of the Zimbabwean constitution confirm State ownership of all agricultural land, confirm the role of the Land Commission and further cancel all existing title deeds for it.\n\nMawarire, who has been very vocal, not just about the land issue but Mnangagwas attempts to unconstitutionally stay in power beyond his two terms up to 2030, said the fact that war veterans were now confronting Zanu PF themselves indicated an absence of opposition politicians.\n\nAfter close to two decades of keeping Zanu PF on its toes, the MDC, now led by Douglas Mwonzora, is a shell of its former glory. The Citizens Coalition for Change (CCC), once headed by Nelson Chamisa, was hijacked by self-styled secretary general Sengezo Tshabangu and has since been singing in favour of Mnangagwas term extension.\n\nChamisa withdrew from the party and announced a sabbatical.\n\nIt is actually an indication that we no longer have opposition politics in the country, that is why you find war veterans have stepped in to provide checks and balances.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter LATE President Robert Mugabe’s spokesperson Jealousy Mawarire has come out in support of a constitutional court application by disgruntled war veterans who are challenging the legality of President Emmerson Mnangagwa’s Lands Tenure Implementation Committee. The Committee, led by businessman Kudakwashe Tagwirei, seeks to establish freehold on agricultural land despite clear constitutional provisions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-led-land-tenure-committee-a-coterie-of-looters-mawarire/\">Tagwirei-led Land Tenure Committee a coterie of looters – Mawarire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "28 May 2025"
        },
        {
            "title": "JUST IN: Former CIO boss Isaac Moyo, Ministers Ncube, Sanyatwe delisted from UK sanctions list",
            "url": "https://www.newzimbabwe.com/just-in-former-cio-boss-isaac-moyo-ministers-ncube-sanyatwe-delisted-from-uk-sanctions-list/",
            "content": "By Staff Reporter\n\nTHE United Kingdom (UK) has removed former Central Intelligence Organisation (CIO) boss Isaac Moyo, police Commissioner General Godwin Matanga and former army commander Anselem Sanyatwe from its sanctions list.\n\nMinister of State for Midlands and former Minister of State Security, Owen Ncube and the Zimbabwe Defence Industries (ZDI) have also been removed from the list.\n\nAnnounced in a statement Tuesday, the four top officials and ZDI had been under sanctions for various human rights-related abuses.\n\nMoyo headed the dreaded CIO from 2017 until his exit earlier this year, taking charge of operations that included intimidation, abduction and assault of opposition politicians, human rights activists and journalists.\n\nNcube has been accused of being the godfather of mining gangs in the Midlands. He was fingered as the main man behind violent attacks that claimed the life of an opposition supporter in Kwekwe, in the run-up to the 2018 elections.\n\nThe UK announces the delisting of sanctions against individuals Owen Ncube, Isaac Moyo, Godwin Matanga, Anselem Sanyatwe, and the entity Zimbabwe Defence Industries (ZDI), reads a statement on the UK governments website.\n\nThe revocations follow a similar move from the European Union in February 2025, when they delisted their last remaining entity (ZDI) whilst renewing their existing Zimbabwe sanctions framework.The US also removed a number of designations in March 2024.\n\nZDI was listed by the UK soon after late President Robert Mugabe chucked out the European Union (EU) observer mission ahead of the 2002 elections.\n\nIt stood accused of providing arms used in the abuse of ordinary Zimbabweans.\n\nThe recent round of removals will be taken as a triumph for President Emmerson Mnangagwa, who has been on an overdrive courting the West.\n\nOver recent years, the EU, UK and America have eased restrictions on Zimbabweans and entities that had been fingered in corruption and human rights abuses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/18045457/Owen-Ncube-Minister-of-State-Security.jpg",
            "description": "<p>By Staff Reporter THE United Kingdom (UK) has removed former Central Intelligence Organisation (CIO) boss Isaac Moyo, police Commissioner General Godwin Matanga and former army commander Anselem Sanyatwe from its sanctions list. Minister of State for Midlands and former Minister of State Security, Owen Ncube and the Zimbabwe Defence Industries (ZDI) have also been removed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-former-cio-boss-isaac-moyo-ministers-ncube-sanyatwe-delisted-from-uk-sanctions-list/\">JUST IN: Former CIO boss Isaac Moyo, Ministers Ncube, Sanyatwe delisted from UK sanctions list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "28 May 2025"
        },
        {
            "title": "Internet Speed and Its Role in African eSports",
            "url": "https://www.newzimbabwe.com/internet-speed-and-its-role-in-african-esports/",
            "content": "As African eSports scene is growing fast, competitive gaming is attracting more viewers and more teams. However, to perform at a high level, players need one basic thing: strong and stable internet. Without it, real-time play becomes nearly impossible.\n\nAs eSports spreads across urban centres, better connectivity is helping the industry expand. Companies such ashttps://bizbet.africa/are watching this space closely. Many of them provide live odds and match coverage, relying on smooth streams and real-time updates. Poor speed limits not only gameplay, but also streaming and interaction.\n\nFast, consistent internet means lower lag, better reaction time, and access to online tournaments. It also improves player confidence. When the tech runs smoothly, skill becomes the real focus.\n\nSpeed is critical in eSports. A delay of even 100 milliseconds can change the outcome of a match. Most eSports titles depend on quick reflexes and real-time coordination. This makes internet performance as important as hardware or strategy.\n\nUrban gamers usually enjoy better conditions. Cities are more likely to have fibre lines or 4G/5G coverage. This is why most eSports hubs in Africa are in urban areas. Players gather in cafes or clubs where fast internet is guaranteed.\n\nSome betting-linked platforms also support gameplay tracking. Thehttps://bizbet.africa/mobileintegrates match data and team stats, including live feeds of tournament results. These services benefit when users experience smooth, uninterrupted access.\n\nFor those who follow streams or place live bets, fast internet is essential. They need real-time updates, not delayed scores. This creates a shared need for speed between gamers, platforms, and fans.\n\nWhile urban areas are progressing, gaps remain in rural regions. Limited bandwidth, high data costs, and poor infrastructure slow the growth of competitive gaming. Players may face issues connecting to servers or watching live matches.\n\nEfforts are being made to solve this. Gaming cafes, co-working spaces, and shared hubs offer fast internet in areas where home access is limited. Some developers now build lighter versions of games to suit slower speeds.\n\nIn addition, tech tools that allow low-latency match tracking often support bybizbet bet on sport. These features are built with mobile-first users in mind. This allows even mid-range devices to access real-time data without constant buffering.\n\nThe rise of mobile gaming also plays a role. Many Africans now compete or train on phones. This makes optimisation for mobile important. Fast loading times, reduced lag, and easy login improve the experience.\n\nGood internet access does more than improve play. It shapes the whole eSports economy. From coaching sessions and live commentary to sponsorship and betting markets, everything depends on smooth connectivity.\n\nKey areas affected by internet speed:\n\nIn many cities, local tournaments are beingstreamedfor the first time. This makes internet reliability even more vital. Fans want to follow favourite teams, comment on plays, and share clips. Without good bandwidth, these interactions stop.\n\nPlatforms offering sports odds and digital content rely on this as well. Live bets only work if data updates immediately. This is why strong mobile access supports both gaming and iGaming together.\n\nAfricas eSports future depends on internet growth. Faster networks mean more tournaments, better content, and larger audiences. Providers, platforms, and players all benefit.\n\nAs more users go online, and more titles enter the market, platforms will need to keep up. Investments in local infrastructure, device compatibility, and low-data apps will shape how far the industry can go.\n\nForAfrican gamers, internet speed is not just a technical need. It is part of how they train, compete, and earn. The more reliable the connection, the bigger the arena becomes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27143805/Screenshot-2025-05-27-at-15.37.08.png",
            "description": "<p>As African eSports scene is growing fast, competitive gaming is attracting more viewers and more teams. However, to perform at a high level, players need one basic thing: strong and stable internet. Without it, real-time play becomes nearly impossible. As eSports spreads across urban centres, better connectivity is helping the industry expand. Companies such as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/internet-speed-and-its-role-in-african-esports/\">Internet Speed and Its Role in African eSports</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "28 May 2025"
        }
    ]
}