{
    "news": [
        {
            "title": "Zimbabwe’s PSL, women’s super league executives elections dates confirmed",
            "url": "https://www.newzimbabwe.com/zimbabwes-psl-womens-super-league-executives-elections-dates-confirmed/",
            "content": "By Sports Reporter\n\nZIMBABWE Football Association has set July 25th as the election date for the Premier Soccer League (PSL) and Zimbabwe Women Super League (ZWSL) elections.\n\nThis was confirmed Thursday by ZIFA via a press statement.The Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and the general public that it has developed a proposed road map for the forthcoming Premier Soccer League (PSL) and Zimbabwe Womens Soccer League (ZWSL) elections.This electoral process will be conducted in strict adherence to the ZIFA Statutes and the ZIFA Electoral Code (2024), ensuring that the principles of transparency, integrity, and fairness remain at the core of all proceedings, read part of the letter.ZIFA has set June 6 as the deadline for interested candidates to submit their names and documents so that they go through a vetting process.The upcoming polls will see the voting into power of new executives both at PSL and ZWLS.PSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.Commenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nThis was confirmed Thursday by ZIFA via a press statement.\n\nThe Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and the general public that it has developed a proposed road map for the forthcoming Premier Soccer League (PSL) and Zimbabwe Womens Soccer League (ZWSL) elections.This electoral process will be conducted in strict adherence to the ZIFA Statutes and the ZIFA Electoral Code (2024), ensuring that the principles of transparency, integrity, and fairness remain at the core of all proceedings, read part of the letter.ZIFA has set June 6 as the deadline for interested candidates to submit their names and documents so that they go through a vetting process.The upcoming polls will see the voting into power of new executives both at PSL and ZWLS.PSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.Commenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nThe Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and the general public that it has developed a proposed road map for the forthcoming Premier Soccer League (PSL) and Zimbabwe Womens Soccer League (ZWSL) elections.\n\nThis electoral process will be conducted in strict adherence to the ZIFA Statutes and the ZIFA Electoral Code (2024), ensuring that the principles of transparency, integrity, and fairness remain at the core of all proceedings, read part of the letter.ZIFA has set June 6 as the deadline for interested candidates to submit their names and documents so that they go through a vetting process.The upcoming polls will see the voting into power of new executives both at PSL and ZWLS.PSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.Commenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nThis electoral process will be conducted in strict adherence to the ZIFA Statutes and the ZIFA Electoral Code (2024), ensuring that the principles of transparency, integrity, and fairness remain at the core of all proceedings, read part of the letter.\n\nZIFA has set June 6 as the deadline for interested candidates to submit their names and documents so that they go through a vetting process.The upcoming polls will see the voting into power of new executives both at PSL and ZWLS.PSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.Commenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nZIFA has set June 6 as the deadline for interested candidates to submit their names and documents so that they go through a vetting process.\n\nThe upcoming polls will see the voting into power of new executives both at PSL and ZWLS.PSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.Commenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nThe upcoming polls will see the voting into power of new executives both at PSL and ZWLS.\n\nPSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.Commenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nPSL has been without a chairman since December last year when CAPS United club president Farai Jere stepped down, while ZWSL is currently being led by an interim committee appointed last year by the Normalisation Committee.\n\nCommenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.As ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nCommenting ahead of the elections, ZIFA president Nqobile Magwizi said,The PSL and ZWSL elections represent an important milestone in the renewal of our football structures.\n\nAs ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\nAs ZIFA, we are fully committed to delivering a credible, transparent, and inclusive process that strengthens the foundations of the game in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE Football Association has set July 25th as the election date for the Premier Soccer League (PSL) and Zimbabwe Women Super League (ZWSL) elections. This was confirmed Thursday by ZIFA via a press statement. “The Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and the general public that it has developed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-psl-womens-super-league-executives-elections-dates-confirmed/\">Zimbabwe’s PSL, women’s super league executives elections dates confirmed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        },
        {
            "title": "High Court orders adulterous woman to pay US$25,000 damages",
            "url": "https://www.newzimbabwe.com/high-court-orders-adulterous-woman-to-pay-us25000-damages/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25 000 adultery damages to the wife of a man she snatched six years ago.\n\nA default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings.\n\nMachingura had sued Machaya for US$50,000 after she invaded her 41-year-old marriage.\n\nBroken down, US$30,000 was for contumelia and US$20,000 was for loss of consortium, arising from a protracted adulterous relationship between Machaya and her husband.\n\nThe court heard the relationship started in 2019 and Machaya now has two children with Dhudhlas husband.\n\nThe plaintiff, a retired university lecturer and church elder, testified through affidavit to public humiliation in her congregation and community, severe emotional trauma requiring medical treatment for diabetes, hypertension and depression, and the stripping away of her role in the family estate (bank accounts, farm operations and vehicles), the court heard.\n\nSince 2019 the plaintiffs husband has cohabited with the defendant; intimacy, companionship and joint family life have ceased entirely. The marriage now subsists only in name, court papers further show.\n\nMachaya, despite service, elected to remain absent and, therefore, offered no apology or mitigation.\n\nThe matter was set down on the unopposed roll after her plea was struck out for non-attendance at the pre-trial conference and her subsequent application for rescission was deemed abandoned.\n\nLiability was, therefore, not an issue and the court was only seized with the assessment of quantum under r 25(1) of the High Court Rules, 2021.\n\nWhile handing down his judgement, Justice Mambara said when fixing adultery damages the court considers the nature and duration of the marriage, knowledge of the marriage by the adulterer, character and social-economic standing of the parties and the extent of contumelia and loss of consortium proved.\n\nThe judge also looked into contrition (or lack thereof) by the adulterer, the need for deterrence; and the level of awards in comparable cases.\n\nMambara said there is no reported High Court decision after that of Taoneyi vs Madzima ((HH 18-25) has exceeded the composite figure of US$20,000.\n\nInflation-adjusted though that award is, it remains the highest recent comparable award placed before the court, he said.\n\nThe judge said the plaintiff had a long, otherwise stable marriage.\n\nHe said there was total lack of contrition by Machaya adding that such offenders deserve deterrent penalties.\n\nThe court is satisfied that an award modestly above the most recent ceiling of US $20,000 is justified to reflect both changing economic realities and the egregious facts of this case.\n\nAccordingly, it is ordered that the defendant shall pay to the plaintiff the sum of US $25,000 made up as follows:(a) Contumelia: US $16,000 (b) Loss of consortium: US $9,000.\n\nHe ruled that interest shall run on the above amount at the prescribed rate of 5 % per annum from the date of this judgment to the date of full and final payment.\n\nMachaya will also pay Dhudhlas costs of suit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/20050838/High-Court-Zimbabwe.jpg",
            "description": "<p>By Mary Taruvinga HIGH Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25 000 adultery damages to the wife of a man she snatched six years ago. A default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings. Machingura had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-orders-adulterous-woman-to-pay-us25000-damages/\">High Court orders adulterous woman to pay US$25,000 damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        },
        {
            "title": "3,400 girls forced out of school as early marriages and teenage pregnancies plague education system",
            "url": "https://www.newzimbabwe.com/3400-girls-forced-out-of-school-as-early-marriages-and-teenage-pregnancies-plague-education-system/",
            "content": "By Darlington Gatsi\n\nLAST year, 3,433 girls were forced out of school as a result of early marriages and adolescent pregnancies, the government has revealed.\n\nOf these, 3,324 were secondary school pupils, while 109 dropped out of primary schoola damning statistic in the countrys fight against underage pregnancies.\n\nMashonaland East recorded the highest number of dropouts, with 499 girls education disrupted by teenage pregnancy.\n\nSpeaking in Parliament recently, Deputy Minister of Primary and Secondary Education Angeline Gata painted a grim picture, reporting that girls as young as 13 had fallen pregnant.\n\nWe visited a school in Manicaland. While conducting monitoring and evaluation, we asked the headmaster to provide statistics on any dropouts at the school. He mentioned that two 13-year-old girls had dropped out due to pregnancy, the deputy minister said.\n\nWe need the support of everybodythe MPs hereso that, to reduce these cases of early marriages and pregnancies, we must work together as a community. We must advocate for our girlsall of us here, said Gata.\n\nThe ministry has partnered with the United Nations Development Programme (UNDP) and child protection agencies, leading to increased reporting of early marriages and teenage pregnancies.\n\nDespite the governments stance and legislation against relationships with girls under the age of 18, cases of early marriages and adolescent pregnancies continue to be recorded.\n\nGata also stated that, out of the 3,433 affected girls, 667 had been readmitted into the school system.\n\nWe have readmitted girls into our schools. Of the 3,433, 467 who were married have returned to school. Additionally, 710 pregnant girls have been readmitted, said Gata.\n\nCitizens Coalition for Change (CCC) Member of Parliament Mutsa Murombedzi challenged the government over the high dropout rate, noting that some pregnancies were linked to rape.\n\nAre any arrests being made? It is good that we have the Hon. Minister of Home Affairs hereperhaps they can address these questions together so we understand the governments approach to this problem of early pregnancies, given that some involve rape, said Murombedzi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/23193350/Pregnancy.jpg",
            "description": "<p>By Darlington Gatsi LAST year, 3,433 girls were forced out of school as a result of early marriages and adolescent pregnancies, the government has revealed. Of these, 3,324 were secondary school pupils, while 109 dropped out of primary school—a damning statistic in the country’s fight against underage pregnancies. Mashonaland East recorded the highest number of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/3400-girls-forced-out-of-school-as-early-marriages-and-teenage-pregnancies-plague-education-system/\">3,400 girls forced out of school as early marriages and teenage pregnancies plague education system</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        },
        {
            "title": "MP Mamombe sues opposition CCC counterpart Nyandoro for US$100,000 defamation",
            "url": "https://www.newzimbabwe.com/mp-mamombe-sues-opposition-ccc-counterpart-nyandoro-for-us100000-defamation/",
            "content": "By Mary Taruvinga\n\nCITIZENS Coalition for Change (CCC) Member of Parliament for Harare West, Joana Mamombe has sued her colleague Bridget Nyandoro for US$100,000 for defamation.\n\nIn her summons filed at the High Court, Mamombe said Nyandoro, who represents Southerton constituency defamed her by alleging that she had an affair with former CCC leader Nelson Chamisa.\n\nShe also said her statements that she got favours in exchange of sex with influential members, including those from the ruling party, were defamatory.\n\nAmong other things, the defendant claimed that plaintiff hated defendant, did not stand for the people, had allocated herself some wetlands, had corruptly employed her family members in the City of Harare, had faked an abduction, stolen stands, raped people, falsely claimed to be a human rights defender, fought with Wellington Chikombo and forced herself into his matrimonial home demanding to sleep between Chikombo and his wife, reads part of the summons.\n\nMamombe said that these allegations are profoundly defamatory, as they suggest to the readers of the WhatsApp chats that she is a dishonest individual, a hater, a corrupt liar, a thief of loose morals, and someone unworthy of trust.\n\nThe lawmaker said it was defamatory for Nyandoro to allege that she is a hypocrite.\n\nShe said Nyandoro said Sisi stop being a hypocrite I have a court case that you could help get justice served if you become a witness because you know the truth but I know I will be a big fool if I decide to make you one of my witnesses because it involves a Chamisa and you would not dare testify against a Chamisa because of your closeness to Nelson.\n\nYou of all people do not have a moral standing to call other females to stand up and fight for the abuse of women and citizens.\n\nIf in any case you are forced to come to the witness stand I bet my last breath you will testify against me the survivor of verbal, physical, economic abuse and rape just so as to remain Nelsons darling\n\nWas I not there for you when had you relationship fights with Wellington Chikombo after you forced yourself in his matrimonial home and demanded to sleep between him and his married wife.\n\nWere you not the one who told me that Nelson is stingy he only sleeps with you ukamuudza kuti unoda mari ye rent he will tell you kuti God will make a plan. I am lying kuti unonyepera kutuka Zanu maskati wopedza wezonovateera.\n\nMamombe demanded that Nyandoro responds within 10 days, indicating that if she fails to do so, the court will proceed with Mamombes claims without hearing from Nyandoro.\n\nIf you do not enter an appearance to defend, the plaintiffs claims will be heard and dealt with by the High Court without further notice to you.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/05103635/Joana-Mamombe01.jpg",
            "description": "<p>By Mary Taruvinga CITIZENS Coalition for Change (CCC) Member of Parliament for Harare West, Joana Mamombe has sued her colleague Bridget Nyandoro for US$100,000 for defamation. In her summons filed at the High Court, Mamombe said Nyandoro, who represents Southerton constituency defamed her by alleging that she had an affair with former CCC leader Nelson</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mp-mamombe-sues-opposition-ccc-counterpart-nyandoro-for-us100000-defamation/\">MP Mamombe sues opposition CCC counterpart Nyandoro for US$100,000 defamation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        },
        {
            "title": "Mnangagwa urges traditional leaders, government ministries to deal with GBV, drug abuse and child marriages",
            "url": "https://www.newzimbabwe.com/mnangagwa-urges-traditional-leaders-government-ministries-to-deal-with-gbv-drug-abuse-and-child-marriages/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has urged traditional leaders and key government ministries to intensify efforts to combat social ills such as drug abuse, gender-based violence (GBV), child pregnancies, and early marriages.\n\nMnangagwa was speaking at the launch of the cultural month in Chiredzi Thursday where he said these challenges threaten the moral fabric of Zimbabwean society despite progress in cultural revival.\n\nWhile our commemorations continue to chronicle our success stories in cultural renaissance, we still grapple with societal ills affecting the moral fabric of our nation. These include; drug and substance abuse, gender-based violence, child pregnancies and early child marriages, among others.\n\nI call upon traditional leaders, and the ministries responsible for Social Welfare as well as Primary and Secondary Education, among other stakeholders, to scale up the implementation of concrete interventions for the benefit of our children and the youth, who are the future of this nation, Mnangagwa said.\n\nZimbabwe is grappling with an alarming rise in drug and substance abuse cases, particularly among the youth.\n\nAt the same time womens rights statistics say that nearly half of the countrys female population has been subjected to GBV, while child marriages still persist with one in three women having been married in childhood.\n\nThe President also said the government has committed to investing in education, infrastructure, and the arts to support cultural preservation, creative industries, and the development of cultural centres.\n\nFrom the governments side, we stand ready to invest in education, infrastructure, and the arts as well as to support initiatives that promote cultural preservation and the creative industries.\n\nFunds have also been set aside to establish, renovate, and equip culture centres across the country. These centres will serve as hubs for preserving and promoting Zimbabwes diverse cultural heritage, including traditional music, dance, art, and crafts.\n\nAdditionally, the development of film studios to boost the local film industry, along with funding for infrastructure, equipment, and capacity building programmes for filmmakers, are being supported and prioritised.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/23052013/IMG-20250523-WA0007.jpg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa has urged traditional leaders and key government ministries to intensify efforts to combat social ills such as drug abuse, gender-based violence (GBV), child pregnancies, and early marriages. Mnangagwa was speaking at the launch of the cultural month in Chiredzi Thursday where he said these challenges threaten the moral fabric</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-urges-traditional-leaders-government-ministries-to-deal-with-gbv-drug-abuse-and-child-marriages/\">Mnangagwa urges traditional leaders, government ministries to deal with GBV, drug abuse and child marriages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        },
        {
            "title": "Wicknell Chivayo flaunts his wealth again, offers veteran broadcaster 2025 Land Cruiser, US$100,000 cash",
            "url": "https://www.newzimbabwe.com/wicknell-chivayo-flaunts-his-wealth-again-offers-veteran-broadcaster-2025-land-cruiser-us100000-cash/",
            "content": "By Staff Reporter\n\nWicknell Chivayo\n\nWICKNELL Chivayo, a figure often embroiled in controversy and dubbed Zimbabwes tenderpreneur, has once more made headlines with his latest act of largesse.\n\nThis Thursday, the businessman presented veteran Zimbabwe Broadcasting Corporation (ZBC) journalist Reuben Barwe with a brand-new 2025 Toyota Land Cruiser VXR LX 300 Series, accompanied by a hefty US$100,000 in cash.\n\nChivayo, whose sources of income have come under scrutiny, appears to have a price for anyone in the country at the moment.\n\nCritics have questioned why the businessmans heart is not moved by Zimbabwes crumbling public healthcare system, where many expect him to seed more resources to save lives.\n\nIn response, Chivayo asserted that he does as he pleases with his own money, and no one should dictate how he spends it.\n\nOn Thursday morning, Chivayo took to X (formerly Twitter) to announce his generosity towards Barwe, who has dedicated over 30 years to ZBC.\n\nReuben Barwe\n\nIn recognition of the decades of your professional and loyal dedication to the national broadcaster and in honour of your patriotism, your excellence and resolute service as one of Zimbabwes finest journalists and news reporters, a big congratulations to you Mr Reuben Barwe.Please go and see Farai at FARAMATSI Motors, Club Chambers Showroom, corner 3rd Street and Nelson Mandela Avenue  your brand new 2025 Toyota Land Cruiser VXR LX 300 series is ready for collection and fully paid for, Chivayo wrote on X.Alongside the vehicle, Chivayo also gifted Barwe US$100,000 in cash, describing it as a token to help him stay afloat  a pocket money gesture in the rough waters of Zimbabwes economic climate.To keep you afloat, a small token of US$100,000 in cash pocket money is also ready for collection from my lawyer Mr Sikhumbuzo Mpofu at Munangati and Associates at your earliest convenience, he added.President Emmerson Mnangagwa was once asked to clarify Chivayos activities but chose instead to describe the businessman as a genuine philanthropist, asserting that he could not dictate how Chivayo utilises his wealth.However, earlier this year, without mentioning Chivayo by name, Vice President Constantino Chiwenga described certain individuals as zviganandaa Shona term meaning people who loot State resources shamelessly and then retreat into the shadows.\n\nIn recognition of the decades of your professional and loyal dedication to the national broadcaster and in honour of your patriotism, your excellence and resolute service as one of Zimbabwes finest journalists and news reporters, a big congratulations to you Mr Reuben Barwe.\n\nPlease go and see Farai at FARAMATSI Motors, Club Chambers Showroom, corner 3rd Street and Nelson Mandela Avenue  your brand new 2025 Toyota Land Cruiser VXR LX 300 series is ready for collection and fully paid for, Chivayo wrote on X.\n\nAlongside the vehicle, Chivayo also gifted Barwe US$100,000 in cash, describing it as a token to help him stay afloat  a pocket money gesture in the rough waters of Zimbabwes economic climate.\n\nTo keep you afloat, a small token of US$100,000 in cash pocket money is also ready for collection from my lawyer Mr Sikhumbuzo Mpofu at Munangati and Associates at your earliest convenience, he added.\n\nPresident Emmerson Mnangagwa was once asked to clarify Chivayos activities but chose instead to describe the businessman as a genuine philanthropist, asserting that he could not dictate how Chivayo utilises his wealth.\n\nHowever, earlier this year, without mentioning Chivayo by name, Vice President Constantino Chiwenga described certain individuals as zviganandaa Shona term meaning people who loot State resources shamelessly and then retreat into the shadows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22170835/Gridx4uWkAA1cPR.jpeg",
            "description": "<p>By Staff Reporter WICKNELL Chivayo, a figure often embroiled in controversy and dubbed Zimbabwe’s “tenderpreneur,” has once more made headlines with his latest act of largesse. This Thursday, the businessman presented veteran Zimbabwe Broadcasting Corporation (ZBC) journalist Reuben Barwe with a brand-new 2025 Toyota Land Cruiser VXR LX 300 Series, accompanied by a hefty US$100,000</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wicknell-chivayo-flaunts-his-wealth-again-offers-veteran-broadcaster-2025-land-cruiser-us100000-cash/\">Wicknell Chivayo flaunts his wealth again, offers veteran broadcaster 2025 Land Cruiser, US$100,000 cash </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        },
        {
            "title": "US singer Chris Brown granted $6.7 million bail for world tour by UK court",
            "url": "https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/",
            "content": "U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22052415/chris-brown.jpg",
            "description": "<p>Reuters U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month. Brown has been charged with inflicting grievous bodily harm in what prosecutors said was an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/\">US singer Chris Brown granted $6.7 million bail for world tour by UK court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "23 May 2025"
        }
    ]
}