{
    "news": [
        {
            "title": "More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe",
            "url": "https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/",
            "content": "IOL\n\nA 31-year-old man has appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was apparently being driven towards the Beitbridge port of entry.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody, and the court postponed the matter to Monday next week.\n\nMashaba said the matter was postponed for profiling of the arrested man. Police have since established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen earlier this month, around Pretoria Central.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\nThe police immediately commenced an intensive search for the stolen vehicle until it was positively spotted driving outside Polokwane.\n\nPolice officers attempted to stop the speeding vehicle, but the driver refused to yield.\n\nA car chase ensued until the vehicle was intercepted at Nirvana robots. It was searched and police suddenly discovered a damaged tracking device removed from the vehicle, said Mashaba.\n\nThe 31-year-old man driving the stolen vehicle could not produce authentic documentation proving ownership, and he was immediately placed under arrest.\n\nThe arrested driver was charged for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has saluted the law enforcement team which intercepted and recovered the vehicle.\n\nShe urged the team to continue in their concerted efforts to combat cross border crimes.\n\nEarlier on Tuesday,IOL reported that police in Limpopo announced a significant breakthrough with the recovery of two vehicles, a Toyota Corolla Cross and a Toyota Hilux GD-6valued at approximately R1.4 million, which were destined to be smuggled out of South Africa.\n\nMashaba said the two vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on Sunday.\n\nIn a co-ordinated anti-smuggling operation involving SAPS Anti-Smuggling Team, Tshimollo Security and Investigation, and Reflex Anti-Hijacking Security, the officers intercepted a Toyota Hilux GD-6 double cab on the R101 near Polokwane weighbridge. During the stop, one male suspect fled into nearby bushes, while two female suspects attempted to escape but were apprehended after a foot chase, said Mashaba.\n\nThe women aged 19 and 20 were arrested, and are facing charges of possession of a suspected stolen motor vehicle.\n\nA man escaped on foot, evading arrest while two women aged 19 and 20 were arrested for possession of a Toyota Hilux GD-6 double cab bakkie. Image: SAPS\n\nPreliminary investigations confirmed that the vehicle was stolen on 16 May 2025 in the Garsfontein policing area in Pretoria East, Gauteng.\n\nIn a separate but related intelligence-driven operation, Mashaba said officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101 road, which was also en route to the Beitbridge port of entry.\n\nInvestigations revealed that this vehicle had been reported stolen at the Wierdabrug (City of Tshwane) policing area on Friday. The driver, a 34-year-old undocumented foreign national, was arrested, said Mashaba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21052738/Screenshot-2025-05-21-at-06.26.54.png",
            "description": "<p>IOL A 31-year-old man has appeared before the Polokwane Magistrate’s Court in Limpopo after he was arrested when police intercepted another stolen Toyota Corolla Cross sport utility vehicle which was apparently being driven towards the Beitbridge port of entry. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/\">More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Chikafa bounces back at CAPS United as team manager",
            "url": "https://www.newzimbabwe.com/chikafa-bounces-back-at-caps-united-as-team-manager/",
            "content": "By Sports Reporter\n\nCAPS United has appointed Limited Chikafa as the new team manager.\n\nChikafas appointment marks his return to the club, which he previously served as a player.\n\nThe CAPS United legend played for the famous 2004 and 2005 back-to-back championship-winning side, which was led by Charles Mhlauri.\n\nHis latest appointment marks his reunion with new gaffer Ian Bakala, whom he played with back then at CAPS United.\n\nChikafa joins CAPS United from financially struggling Kwekwe United, which is currently stuck at the bottom of the log.\n\nThe new development is part of CAPS United club president Farai Jeres mission to return all former players as technical team members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051041/chikafa-caps.jpeg",
            "description": "<p>By Sports Reporter CAPS United has appointed Limited Chikafa as the new team manager. Chikafa’s appointment marks his return to the club, which he previously served as a player. The CAPS United legend played for the famous 2004 and 2005 back-to-back championship-winning side, which was led by Charles Mhlauri. His latest appointment marks his reunion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chikafa-bounces-back-at-caps-united-as-team-manager/\">Chikafa bounces back at CAPS United as team manager</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Rights lawyers petition High Court over “vague, badly drafted” PVO Act",
            "url": "https://www.newzimbabwe.com/rights-lawyers-petition-high-court-over-vague-badly-drafted-pvo-act/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR) has filed an application at the High Court seeking an order to declare some repressive provisions of the Private Voluntary Organisations (PVO) Amendment Act as unconstitutional and set them aside.\n\nThe ZLHR said some of the provisions criminalise legitimate critical development and human rights work and over-regulate PVOs.\n\nThe PVO Amendment Act, which was enacted and published in the Government Gazette on 11 April 2025, according to the application, constitutes a fundamental encroachment of rights of members of their organisation, which is an independent universitas established by law.\n\nZLHR opines that the impugned amendments contained in the PVO Amendment Act constitute unconstitutional over-regulation, over-legislation and criminalisation of innocent important charitable, developmental and human rights work.\n\nThe provisions of the PVO Amendment Act, ZLHR argues, overreach by violating the freedom of assembly and association guaranteed under section 58(1) of the Constitution, the freedom of expression under section 61 of the Constitution, the right to administrative justice guaranteed under section 68(1) and (2) of the Constitution, the right to a fair hearing under section 69(1), (2) and (3) of the Constitution and section 71 of the Constitution, which provides for property rights. ZLHR further argues that the impugned provisions of the PVO Amendment Act were vague and badly drafted and contained arbitrary powers and over-regulation of PVOs, said ZLHR.\n\nZLHR also said the PVO Amendment Act has the effect of concentrating arbitrary powers in the Minister of Public Service, Labour and Social Welfare and the Registrars office and contains excessive executive interference in the internal affairs of PVOs.\n\nIt said the impugned provisions of the PVO Amendment Act have the net effect of effectively allowing the Executive to run PVOs and to deregister those that authorities dislike on very nebulous grounds.\n\nTo this end ZLHR is seeking a High Court order of constitutional invalidity, declaring section 4, section 5 as read with section 9(5), section 6, section 13A, section 14, and section 21, of the Private Voluntary Organisations Act (as amended by the PVO Amendment Act) to be ultra vires the Constitution and to be set aside.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/21073523/pvo.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Lawyers for Human Rights (ZLHR) has filed an application at the High Court seeking an order to declare some “repressive” provisions of the Private Voluntary Organisations (PVO) Amendment Act as unconstitutional and set them aside. The ZLHR said some of the provisions criminalise legitimate critical development and human rights work</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-lawyers-petition-high-court-over-vague-badly-drafted-pvo-act/\">Rights lawyers petition High Court over “vague, badly drafted” PVO Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "Makate High Flyers leaves for COSANA tournament",
            "url": "https://www.newzimbabwe.com/makate-high-flyers-leaves-for-cosana-tournament/",
            "content": "By Sports Reporter\n\nMurehwa-based Makate High Flyers on Monday left the country for Namibia, where they will represent Zimbabwe at the Confederation of Southern Africa Netball Association (COSANA) tournament, which kicks off, Thursday.\n\nMakate will be representing the country together with defending Premier Netball League champions ZDF Queens.\n\nThe inaugural regional netball club tournament will run for five days with clubs from Zimbabwe, Botswana, Lesotho, Eswatini and the host nation, Namibia.\n\nMakate were drawn in group A with Namibia Correctional Services and Wanderers Queens, Lesothos Royal Flames, Mauneng Queens and Jwaneng Queens from Botswana.\n\nZDF Queens will be battling in group B with Botswana Defence Force team, Lesotho Correctional Services, the Navy Army team and Mighty Gunners from Namibia.\n\nSpeaking ahead of their departure, Makate High Flyers captain Felistus Murigwa said the team is targeting to attain a good position.\n\nWe are looking forward to this tournament, we believe we are ready to showcase our talent.\n\nOur target is very simple, we want to bring back home a medal, so one way or the other we have to attain a podium finish, she said.\n\nMakate High Flyers is marking its debut in the Premier Netball League after gaining promotion from the Division One League last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051047/makate.jpeg",
            "description": "<p>By Sports Reporter Murehwa-based Makate High Flyers on Monday left the country for Namibia, where they will represent Zimbabwe at the Confederation of Southern Africa Netball Association (COSANA) tournament, which kicks off, Thursday. Makate will be representing the country together with defending Premier Netball League champions ZDF Queens. The inaugural regional netball club tournament will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/makate-high-flyers-leaves-for-cosana-tournament/\">Makate High Flyers leaves for COSANA tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "21 May 2025"
        },
        {
            "title": "NMBZ generates ZWG396 million in three months",
            "url": "https://www.newzimbabwe.com/nmbz-generates-zwg396-million-in-three-months/",
            "content": "By Alois Vinga\n\nNMBZ Holdings has posted a record performance after generating operating income of ZWG396 million during the just-ended quarter amid plans to create a strong regional footprint.\n\nPresenting a trading update for the first quarter ended March 31 2025, NMBZ company secretary, Violet Mutandwa, said the just-ended period recorded sound results.\n\nThe group started the year strongly, generating operating income of ZWG 396 million for the three months ended 31 March 2025. Fee and commission income contributed 64% of the total income, mainly generated on the banks digital platforms. Net interest income amounted to ZWG 141 million, said.\n\nThe group recorded a profit after tax figure of ZWG 56 million, reflecting a positive start to the year. Total assets amounted to ZWG 7,5 billion, an increase of 5% from 31 December 2024 on the back of plans by the management to focus on prudent lending practices and careful loan book management while pursuing growth in lending.\n\nThe financial services provider continues to focus on mobilising external lines of credit in order to fuel productive-sector lending and is expecting to finalise raising funding in excess of US$70 million in the near term.\n\nAs the group continues on its digital drive, there are a number of projects in the pipeline aimed at enhancing transactional platforms and elevating customer experience. To this end, the Bank is set to launch an enhanced mobile banking application for both corporate and individual customers in the coming quarter.\n\nIn line with its strategic thrust, all the Groups subsidiaries continue on a growth trajectory, with the fintech subsidiary, XPlug Solutions, embarking on multiple projects relating to the implementation of fintech operating systems, Robotic Process Automation (RPA).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/20145032/violet-mutandwa-1-scaled.jpg",
            "description": "<p>By Alois Vinga NMBZ Holdings has posted a record performance after generating operating income of ZWG396 million during the just-ended quarter amid plans to create a strong regional footprint. Presenting a trading update for the first quarter ended March 31 2025, NMBZ company secretary, Violet Mutandwa, said the just-ended period recorded sound results. “The group</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-generates-zwg396-million-in-three-months/\">NMBZ generates ZWG396 million in three months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "21 May 2025"
        }
    ]
}