{
    "news": [
        {
            "title": "Oscar Mbo’s eyes Grammy Award glory with ‘Vuka’",
            "url": "https://www.newzimbabwe.com/oscar-mbos-eyes-grammy-award-glory-with-vuka/",
            "content": "IOL\n\nSouth Africas beloved Amapiano star, Oscar Mbongeni Ndlovu, popularly known asOscar Mbo, is making headlines once again, but this time for more than just his iconic style.\n\nKnown for his smooth blend of deep house, deep tech, Nu Jazz, broken beat, and lounge music, the DJ, producer, and podcaster has officially submitted his track Vuka featuring Jazzworld and ThukutOscar Mbo: Amapiano Stars Journey from Fashion Icon to Grammy Recognition held for Grammy Award consideration under the Best African Music Performance category.\n\nCould this be the breakthrough moment his music career has been waiting for?\n\nAlthough he hasnt collected many traditional music accolades, his impact in both music and fashion is undeniable.\n\nIn 2024, he won Best Styled Artist at the Metro FM Awards and Best Dressed Celebrity at the GQ Best Dressed Awards ceremony. With so much focus on his fashion, its easy to wonder: Is he a music artist or a fashion icon?\n\nBut his artistry and influence suggest hes more than capable of balancing both worlds  and now, with Vuka up for Grammy consideration, the spotlight may finally shift toward his musical achievements.\n\nFor being on the list of the artists considered, Oscar responded, Thank you to everyone who keeps on streaming the music, attending shows, and getting merch, youre appreciated.\n\nOscars journey into music wasnt part of the original plan. After matriculating, his parents offered him a choice: a new car or R100,000 in cash. He chose the money and used it to invest in DJ equipment. With his entrepreneurial parents full support  and encouragement to pursue formal education  he began his career, carefully tracking every cent spent. Their belief in his vision laid the foundation for his success, and he remains deeply grateful for it.\n\nBeyond the decks and designer fits, Oscar is also a devoted family man. In a recent podcast, he opened up about his love for his family and his role as a father.\n\nI just want to keep inspiring the youth, guiding them, and helping them avoid the mistakes we made, he shared, looking forward to the next chapter of his journey.\n\nOscar Mbo is also the founder and lead voice behind The Ashmed Hour, a popular entertainment podcast that blends music and thoughtful conversation  showcasing not only his talent but his depth as a creative.\n\nNow, with Vuka being considered for a Grammy,Oscar Mbostands at the edge of a new era. Whether or not he clinches the nomination, one thing is clear: hes more than just a sharply dressed entertainer  hes an art.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14051506/oscar-mbo.jpg",
            "description": "<p>IOL South Africa’s beloved Amapiano star, Oscar Mbongeni Ndlovu, popularly known as Oscar Mbo, is making headlines once again, but this time for more than just his iconic style. Known for his smooth blend of deep house, deep tech, Nu Jazz, broken beat, and lounge music, the DJ, producer, and podcaster has officially submitted his track</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oscar-mbos-eyes-grammy-award-glory-with-vuka/\">Oscar Mbo’s eyes Grammy Award glory with ‘Vuka’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        },
        {
            "title": "Kavango Resources mobilises additional funds in the UK and Zimbabwe",
            "url": "https://www.newzimbabwe.com/kavango-resources-mobilises-additional-funds-in-the-uk-and-zimbabwe/",
            "content": "By Alois Vinga\n\nKavango Resources plc (LSE: KAV, VFEX: KAV.VX), a Southern Africa-focused metals exploration and gold production company, has successfully raised additional capital following its recent 2.2 million UK placing and US$4.5 million VFEX subscription.\n\nThe company has secured a further 150,000 in the UK and US$129,035.24 in Zimbabwe, responding to continued investor demand for its shares.\n\nIn total, 24,557,448 new ordinary shares have been issued, comprising 15,000,000 shares at 0.01 each in the UK and 9,557,448 shares at the equivalent price in Zimbabwe.\n\nKavango said the additional fundraising strengthens its market position and supports its strategic goal of expanding its footprint in Southern Africa.\n\nThe new UK shares will be admitted to the Equity Shares (Transition) segment of the Financial Conduct Authoritys (FCA) Official List and traded on the London Stock Exchange (LSE). Similarly, the VFEX shares will first be listed on the LSE before being transferred to a branch register in Zimbabwe, where they will be listed and traded on the Victoria Falls Stock Exchange.\n\nBoth the UK and VFEX share admissions are expected to take effect, with trading commencing at 8:00 a.m. on or around 16 October 2025.\n\nProceeds from the fundraising will be used to strengthen the companys working capital and fund ongoing exploration and mine development activities across Southern Africa. This follows the firms earlier announcement on 10 September 2025, where it outlined plans to use raised capital to drive its growth and operational objectives.\n\nKavango Resources plc focuses on the exploration and development of metals in Southern Africa, with particular emphasis on copper, nickel, and gold projects. The company aims to unlock long-term value through exploration, resource development, and eventual production.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Kavango Resources plc (LSE: KAV, VFEX: KAV.VX), a Southern Africa-focused metals exploration and gold production company, has successfully raised additional capital following its recent £2.2 million UK placing and US$4.5 million VFEX subscription. The company has secured a further £150,000 in the UK and US$129,035.24 in Zimbabwe, responding to continued investor demand</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-mobilises-additional-funds-in-the-uk-and-zimbabwe/\">Kavango Resources mobilises additional funds in the UK and Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        },
        {
            "title": "China urges its citizens to adhere to Zimbabwe’s investment laws after fatal mine shooting",
            "url": "https://www.newzimbabwe.com/china-urges-its-citizens-to-adhere-to-zimbabwes-investment-laws-after-fatal-mine-shooting/",
            "content": "By Staff Reporter\n\nThe Chinese Embassy in Harare has urged its nationals and investors operating in Zimbabwe to strictly comply with local investment laws, regulations, and ethical standards.\n\nIn a notice issued this week, the embassy reminded Chinese investors to conduct thorough due diligence and risk assessments before undertaking any projects in the country.\n\nThe advisory follows mounting concern over a recent fatal shooting of a villager at a Chinese-owned mine in Mutoko, allegedly on suspicion of attempted theft. The incident has reignited public debate over the conduct of some Chinese investors, with calls for government to review foreign operations after the Centre for Natural Resources Governance (CNRG) released a video exposing poor working and living conditions at a Chinese-run mine in Mashava.\n\nPrior to committing capital, undertake a comprehensive and thorough assessment of Zimbabwes political, economic, social, and legal landscape. Go beyond financial metrics to gain a good understanding of the local investment climate, business culture, community dynamics, and socio-cultural norms including traditions and customs, the embassy said.\n\nIt added: Scrutinise all project details, with a particular focus on identifying potential risks and avenues for resolving disputes, establishing robust risk management protocols from the outset. Avoid involvement in any ventures that might lead to controversies or disputes.\n\nThe embassy also called on investors to prioritise personal and asset security.\n\nImplement proactive security measures upon arrival. This includes engaging reputable professional security services, optimising physical safeguards, and developingthen regularly rehearsingcomprehensive contingency plans for possible emergencies.\n\nAmid growing criticism over some investors alleged disregard for due process, the embassy reminded its citizens to resolve disputes through legal channels and to observe firearm regulations.\n\nAdhere strictly to legal and regulatory frameworks. Compliance with Zimbabwean laws and regulations is the non-negotiable foundation of all operations.\n\nAll disputes must be resolved through proper legal channels. Proactively seek advice and assistance from qualified legal counsel. In the event of criminal incidents such as theft, burglary, or robbery, while ensuring your personal safety, your immediate priority is to report the incident to the local police without delay. Should the police be unreachable or unable to dispatch officers immediately, you should remain calm and composed, and try to avoid any direct confrontation.\n\nEnforce strict firearms control. The illegal possession of firearms is strictly prohibited. The storage and use of any legally authorised firearms must be managed with the highest level of control and in full compliance with relevant regulations.\n\nThe embassy further encouraged Chinese companies to foster goodwill through responsible community engagement and environmental stewardship.\n\nAct as a partner in Zimbabwes development. Wherever possible, engage with local communities respectfully and responsibly. Consistently uphold fair labour practices and demonstrate environmental stewardship in line with all relevant laws and regulations.\n\nCorporate Social Responsibility initiatives are strongly encouraged as visible expressions of goodwill. Such proactive efforts foster mutual trust, strengthen community relations and affirm a shared commitment to Zimbabwes broader economic development and social progress.\n\nThe statement also emphasised that any grievances or threats to personal safety must be handled lawfully.\n\nIf faced with unfair treatment or rights infringement, remain calm and rational. Meticulously collect and preserve all relevant evidence. Your primary recourse is always through the established legal framework, supported by professional legal representation.\n\nIn the face of smears or disinformation, a proactive and strategic response is crucial. Engage legal counsel and seek assistance from relevant authorities to manage the situation and protect your reputation and legitimate rights and interests.\n\nThe embassy reiterated that corruption and bribery are criminal offences both in Zimbabwe and China.\n\nUnder no circumstances should bribes be offered, accepted, or solicited. If you encounter any form of corruption, including solicitation, extortion, or abuse of power, report it promptly to the Zimbabwe Republic Police and/or Zimbabwe Anti-Corruption Commission.\n\nIn light of growing reports of labour and human rights abuses involving some Chinese-run enterprises, the embassy urged all companies to register with it after obtaining licences from relevant Zimbabwean authorities.\n\nThis, it said, would enable the embassy to provide timely consular protection and assistance when required.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14045745/zhou-ding-amb.jpg",
            "description": "<p>By Staff Reporter The Chinese Embassy in Harare has urged its nationals and investors operating in Zimbabwe to strictly comply with local investment laws, regulations, and ethical standards. In a notice issued this week, the embassy reminded Chinese investors to conduct thorough due diligence and risk assessments before undertaking any projects in the country. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-urges-its-citizens-to-adhere-to-zimbabwes-investment-laws-after-fatal-mine-shooting/\">China urges its citizens to adhere to Zimbabwe’s investment laws after fatal mine shooting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        },
        {
            "title": "Zimbabwe warned of risks to economy if dollar abandoned as planned",
            "url": "https://www.newzimbabwe.com/zimbabwe-warned-of-risks-to-economy-if-dollar-abandoned-as-planned/",
            "content": "Bloomberg\n\nZimbabwe will jeopardise the rare bout of economic stability the southern African nation is currently enjoying if it scraps the use of dollars domestically by 2030 as planned.\n\nThats according to the countrys largest independently-owned asset manager that cautioned the government not to rock the boat by following through on its intention to have the gold-backed ZiG currency replace the US unit, which now accounts for 85% of payments.\n\nA free and widespread use of the dollar within the economy, has made it easier for corporates and individuals to transact and plan, Imara Asset Management Chief Executive Officer Shelton Sibanda and colleague John Legat wrote in a client note.\n\nZimbabwe is experiencing one of its longest streaks of economic stability, boosted by a 31% surge in gold output, firmer platinum prices, a record tobacco crop and rising dollar remittances from Zimbabweans living outside the country. Thats being reflected in stronger company results, a 45% rise in the dollar-based Victoria Falls stock exchange and a property boom.\n\nIts also helping the ZiG, short for Zimbabwe Gold, which was launched in April 2024 and marked the sixth effort to establish a viable local currency after high inflation and collapsing foreign-exchange values scuppered previous attempts.\n\nIt has only weakened by 3% against the dollar this year amid tight monetary policy, a far cry from the collapses suffered by its predecessors.\n\nStill, the Harare-based asset manager warned that fragility remains with the nations unsustainable debt levels a threat. Fiscal pressures forced Zimbabwes Treasury last month to order spending cuts to government ministries. It owes creditors $21 billion after defaulting in 1999 and efforts to seek a debt revamp have so far failed to yield fruit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>Bloomberg Zimbabwe will jeopardise the rare bout of economic stability the southern African nation is currently enjoying if it scraps the use of dollars domestically by 2030 as planned. That’s according to the country’s largest independently-owned asset manager that cautioned the government not to “rock the boat” by following through on its intention to have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-warned-of-risks-to-economy-if-dollar-abandoned-as-planned/\">Zimbabwe warned of risks to economy if dollar abandoned as planned</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        },
        {
            "title": "Investigation launched after boxes of ARVs, prescription drugs found in deadly Limpopo bus crash that killed over 40",
            "url": "https://www.newzimbabwe.com/investigation-launched-after-boxes-of-arvs-prescription-drugs-found-in-deadly-limpopo-bus-crash-that-killed-over-40/",
            "content": "IOL\n\nAuthorities in South Africa have launched a full-scale investigation after boxes of antiretroviral (ARV) drugs and other prescription medications were discovered among the wreckage of a cross-border bus that crashed on the N1 near Makhado, killing at least 42 people.\n\nThe long-distance bus, which was traveling from Gqeberha in the Eastern Cape to Harare, Zimbabwe, veered off the road and overturned late Tuesday night, leaving bodies scattered across the crash site and dozens injured. Emergency teams described the scene as horrific, with rescue operations lasting through the night.\n\nEmergency responders and police found a box containing ARVs and other medical supplies in the bus.\n\nThis is highly irregular, said a senior official involved in the recovery operation. There was no documentation for the medical cargo, and its unclear whether the transport of these drugs was legal or who the intended recipient was.\n\nAuthorities are now treating the crash site as both an accident scene and a potential site of pharmaceutical smuggling. ARVs, used to manage HIV, are tightly regulated and are often subject to trafficking due to their high value and demand in the region.\n\nThe presence of the medication has added a complex twist to the investigation, which is still trying to determine what caused the crash. Early reports suggest the driver may have lost control of the bus on a bend, but officials have not ruled out mechanical failure or driver fatigue.\n\nLimpopo Premier Dr Phophi Ramathuba is expected to visit the crash site and meet with the multidisciplinary response team. Speaking briefly on Wednesday morning, she expressed concern about both the loss of life and the possible illegal transport of medical goods.\n\nThis is not just a tragic accident  it now involves deeper issues of public health and criminal conduct, Ramathuba said. We are treating this with the seriousness it deserves.\n\nMost of the passengers were believed to be Zimbabwean nationals making the long journey home. Names of the deceased have not yet been released, pending identification and consular notification. Survivors are receiving treatment at hospitals in Makhado and Polokwane, some with life-threatening injuries.\n\nMeanwhile, transport authorities have reiterated concerns over the growing number of long-distance buses operating with limited oversight. The crash has reignited calls for stricter inspections and better enforcement of passenger safety regulations, especially on international routes.\n\nEmergency responders and police found a box containing ARVs and other medical supplies in the bus.\n\nThis is highly irregular, said a senior official involved in the recovery operation. There was no documentation for the medical cargo, and its unclear whether the transport of these drugs was legal or who the intended recipient was.\n\nAuthorities are now treating the crash site as both an accident scene and a potential site of pharmaceutical smuggling. ARVs, used to manage HIV, are tightly regulated and are often subject to trafficking due to their high value and demand in the region.\n\nThe presence of the medication has added a complex twist to the investigation, which is still trying to determine what caused the crash. Early reports suggest the driver may have lost control of the bus on a bend, but officials have not ruled out mechanical failure or driver fatigue.\n\nLimpopo Premier Dr Phophi Ramathuba was expected to visit the crash site and meet with the multidisciplinary response team. She expressed concern about both the loss of life and the possible illegal transport of medical goods.\n\nThis is not just a tragic accident  it now involves deeper issues of public health and criminal conduct, Ramathuba said. We are treating this with the seriousness it deserves.\n\nMost of the passengers were believed to be Zimbabwean nationals making the long journey home. Names of the deceased have not yet been released, pending identification and consular notification. Survivors are receiving treatment at hospitals in Makhado and Polokwane, some with life-threatening injuries.\n\nMeanwhile, transport authorities have reiterated concerns over the growing number of long-distance buses operating with limited oversight. The crash has reignited calls for stricter inspections and better enforcement of passenger safety regulations, especially on international routes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL Authorities in South Africa have launched a full-scale investigation after boxes of antiretroviral (ARV) drugs and other prescription medications were discovered among the wreckage of a cross-border bus that crashed on the N1 near Makhado, killing at least 42 people. The long-distance bus, which was traveling from Gqeberha in the Eastern Cape to Harare,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/investigation-launched-after-boxes-of-arvs-prescription-drugs-found-in-deadly-limpopo-bus-crash-that-killed-over-40/\">Investigation launched after boxes of ARVs, prescription drugs found in deadly Limpopo bus crash that killed over 40</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        },
        {
            "title": "Warriors end World Cup Qualifiers winless after 1–0 defeat to Lesotho",
            "url": "https://www.newzimbabwe.com/warriors-end-world-cup-qualifiers-winless-after-1-0-defeat-to-lesotho/",
            "content": "By Sports Reporter\n\nThe Warriors World Cup Qualifiers campaign ended on a sour note after a 10 defeat to Lesotho at Peter Mokaba Stadium in Polokwane, South Africa.\n\nThe loss saw Zimbabwe finish their Group C campaign as the only team without a single win.\n\nCoach Michael Nees made several changes to the lineup that faced South Africa on Friday, opting to rest captain Marvellous Nakamba and first-choice goalkeeper Washington Arubi.\n\nElvis Chipezeze started between the posts, while Jonah Fabisch took Nakambas place in midfield. Walter Musona, Bill Antonio, Emmanuel Jalai, and Brendon Galloway also returned to the starting eleven.\n\nThe first half offered little excitement, with both sides struggling to create clear chances. Zimbabwe suffered an early setback when Gerald Takwara was forced off with a head injury, replaced by Godknows Murwira.\n\nIn the second half, Nees introduced Nakamba for Fabisch, followed by Khama Billiat and Daniel Msendami for Walter Musona and Tawanda Chirewa, respectively.\n\nMsendami nearly made an impact in the 88th minute but missed a golden opportunity to put the Warriors ahead. Lesotho capitalised deep into stoppage time when Hlompo Kalake fired past Chipezeze in the 93rd minute to seal victory.\n\nThe defeat piles more pressure on Nees, who has managed just two wins, both against Namibia, since his appointment in July.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13194517/munetsi-lesotho.webp",
            "description": "<p>By Sports Reporter The Warriors’ World Cup Qualifiers campaign ended on a sour note after a 1–0 defeat to Lesotho at Peter Mokaba Stadium in Polokwane, South Africa. The loss saw Zimbabwe finish their Group C campaign as the only team without a single win. Coach Michael Nees made several changes to the lineup that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-end-world-cup-qualifiers-winless-after-1-0-defeat-to-lesotho/\">Warriors end World Cup Qualifiers winless after 1–0 defeat to Lesotho</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        },
        {
            "title": "Businessman Mimana to pay US$11k maintainance to ex-wife",
            "url": "https://www.newzimbabwe.com/businessman-mimana-to-pay-us11k-maintainance-to-ex-wife/",
            "content": "By Mary Taruvinga\n\nThe High Court has ruled that businessman Murombo Josiah Mimana must continue supporting his estranged wife, Marvel Mtisi, with monthly maintenance after finding that he had the capacity to pay for the familys upkeep, previously pegged at US$20,000 per month.\n\nJustice Maxwell delivered the judgment on October 9, 2025, granting Mtisi maintenance of US$11,726 per month and ordering Mimana to contribute 80% of her legal costs pending the conclusion of their divorce proceedings.\n\nThe couple, married under an unregistered customary union in 2001, has eight children. Mtisi approached the court seeking a declaration that the marriage had ended and for Mimana to resume the US$20,000 monthly payments he allegedly stopped in February 2025, despite having consistently paid that amount since March 2024.\n\nMtisi told the court she was unemployed and had been excluded from the couples lucrative businesses, despite holding a 50% stake. She said the companies were financially sound, citing lucrative Jet A1 fuel supply contracts and profitable mining operations. She argued Mimana was well able to meet the US$21,936 in monthly expenses and contribute to her legal costs.\n\nMimana denied personally paying the US$20,000, claiming it was the company that had made the payments for the upkeep of the family. He accused Mtisi of failing to account for the funds and said payments stopped after she engaged in activities that disrupted the smooth running of the company.\n\nHe further disputed that she was a shareholder and insisted she was not entitled to dividends or business proceeds.\n\nBut in his ruling, Justice Fatima Maxwell found that Mimana had the means to continue supporting his wife, noting that even if the company had made the payments, it acted on his behalf.\n\nIt is common cause that the applicant has been dependent on the US$20,000 per month she was getting. The bottom line is that she has no source of income except the contribution she was receiving, the judge said.\n\nRespondent has not disputed that he is unilaterally running the company and that the US$20,000 was being paid on his behalf. He is therefore in a position to contribute to the applicants legal costs whether personally or through the company.\n\nThe court trimmed some nonrecurring and tutoring costs from Mtisis claim, disallowing US$10,210 in total, leaving US$11,726 as the payable monthly amount.\n\nOn Mimanas technical objection that Mtisis affidavit was improperly commissioned, the court described it as a desperate attempt by the respondent to avoid going into the merits of the matter.\n\nThe application for maintenance pendente lite and contribution towards costs be and is hereby granted,  she ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga  The High Court has ruled that businessman Murombo Josiah Mimana must continue supporting his estranged wife, Marvel Mtisi, with monthly maintenance after finding that he had the capacity to pay for the family’s upkeep, previously pegged at US$20,000 per month. Justice Maxwell delivered the judgment on October 9, 2025, granting Mtisi maintenance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-mimana-to-pay-us11k-maintainance-to-ex-wife/\">Businessman Mimana to pay US$11k maintainance to ex-wife </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:31",
            "date": "14 Oct 2025"
        }
    ]
}