{
    "news": [
        {
            "title": "Sponsored lies – Chamisa dismisses claims he is forming new party",
            "url": "https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has dismissedas sponsored liessocial media rumours suggesting he is launching a new movement at the end of this month.\n\nSince his resignation as Citizens Coalition for Change (CCC)president in January 2024, following what he described as the hijacking of his party by Zanu PF,Chamisa has kept both supporters and opponents guessing over his next move.\n\nChamisa has repeatedly emphasised that he has not left politics but was forced to abandon the CCC due to its takeover.\n\nIn recent days, social media has been awash with flyers claiming Chamisa has launched a new party.\n\nIgnore these lies and falsehoods, Chamisa posted on his X account.\n\nOverwhelmed and flooded by calls from anxious, restless and expectant citizens. Disregard these sponsored lies from scared propagandists.\n\nA new nation founded on love, Zimbabwe shall be a new and great nation governed by love, truth and justice, not hate, violence, lies, deceit and corruption.\n\nLove is the missing essential! Love is the foundation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21132503/DSC06267-copy-scaled.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has dismissed as “sponsored lies” social media rumours suggesting he is launching a new movement at the end of this month. Since his resignation as Citizens Coalition for Change (CCC) president in January 2024, following what he described as the hijacking of his party by Zanu PF, Chamisa has kept both supporters</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/\">Sponsored lies – Chamisa dismisses claims he is forming new party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "04 Jun 2025"
        },
        {
            "title": "Don’t panic over army unit on field training exercise— ZNA diffuses fears of a “signal”",
            "url": "https://www.newzimbabwe.com/dont-panic-over-army-unit-on-field-training-exercise-zna-diffuses-fears-of-a-signal/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe National Army (ZNA) has announced that one of its units will be on a routine field exercise in Harares suburban areas.\n\nIn a press statement, ZNA Director of Public Relations, Colonel Hlengiwe Dube, said troops will conduct training exercises in public spaces, although these will not affect the publics daily routines.\n\nThe ZNA wishes to inform the general public that one of its units is conducting a field training exercise in Harare during the period 03 to 06 June 2025.\n\nThe training exercise will be carried out in the general areas of Glenview, Glen Norah, Kuwadzana, Dzivarasekwa, Mt Hampden and Westgate. The road to be used during the exercise is Solomon Mujuru, formerly known as Kirkman Road, Dube said.\n\nThe army spokesperson reiterated that the exercise will be conducted during the day and the public is, therefore, urged to remain calm.\n\nThe public is therefore requested not to panic as the training exercise is part of routine training by ZNA units, added Col Dube.\n\nThe preemptive move was ostensibly timed conveniently to counter the misconception that the drill was a signal for masses to take to the streets in protest against President Emmerson Mnangagwas government, as hoped for by war veteran Blessed Bombshell Runesu Geza.\n\nGeza has on numerous broadcasts vaguely stated that a signal shall come at the appropriate time and Zimbabweans must march in the streets demanding Mnangagwas exit on accusations of a slew of charges, including grand corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/19120420/WhatsApp-Image-2025-02-19-at-14.03.32.jpeg",
            "description": "<p>By Staff Reporter THE Zimbabwe  National Army (ZNA) has announced that one of its units will be on a routine field exercise in Harare’s suburban areas. In a press statement, ZNA Director of Public Relations, Colonel Hlengiwe Dube, said troops will conduct training exercises in public spaces, although these will not affect the public’s daily</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-panic-over-army-unit-on-field-training-exercise-zna-diffuses-fears-of-a-signal/\">Don’t panic over army unit on field training exercise— ZNA diffuses fears of a “signal”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "04 Jun 2025"
        },
        {
            "title": "Scotts Maphuma faces backlash for missing major children’s festival in Mozambique",
            "url": "https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/",
            "content": "IOL\n\nAmapiano artistScotts Maphuma, real name Mpho Lebajoa,is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform.\n\nThe ShayiMoto singer was set to perform in the country over the weekend at an annual Childrens Day festival in Matola, Mozambique.\n\nHowever, he did not show up to the event, and he later discovered that things work differently in Mozambique, finding himself in trouble with the local authorities.\n\nIt all started when a video of the artist in a police holding cell circulated on social media and sparked mixed reactions as well as questions from fans.\n\nLocal reporters from Mz Magazine News posted the video on their Instagram with a caption that reads: Scotts Maphuma  levado a esquadra por no ter chegado a tempo de actuar.\n\nIt translates to: Scotts Maphuma is taken to the police station for not arriving on time to perform.\n\nMaphuma was meant to headline the Childrens Day festival on Sunday, June 1, at an event known as Lizha s festas in Matola, a vibrant Mozambican suburb.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09064854/scotts.webp",
            "description": "<p>IOL Amapiano artist Scotts Maphuma, real name Mpho Lebajoa, is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform. The “Shayi’Moto” singer was set to perform in the country over the weekend at an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/\">Scotts Maphuma faces backlash for missing major children’s festival in Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "04 Jun 2025"
        },
        {
            "title": "High Court trashes stepson’s US$60,000 lawsuit against 70-year-old widow",
            "url": "https://www.newzimbabwe.com/high-court-trashes-stepsons-us60000-lawsuit-against-70-year-old-widow/",
            "content": "By Staff Reporter\n\nHIGH Court judge Justice Christopher Dube-Banda has dismissed an application against a Murewa widow who was being sued US$60,000 for malicious prosecution by her stepson.\n\nThe complainant in the case, Collin Benyure, was suing his stepmother, Anna Benyure, claiming US$$20,000 for emotional stress, US$$30,000 for damages to his reputation, and US$10,000 for legal costs incurred during the prosecution.\n\nThe widowdid not file a notice to defend, resulting in the matter being set down on the unopposed roll.\n\nThe judge dismissed the claim, ruling that Collin had no evidence to support his claim.\n\nThe declaration stated that on 8 May 2024, Anna falsely claimed that the plaintiff, Collin, destroyed her seven-roomed house at Benyure homestead, Nyamakosi Village, Mutoko.\n\nThe court heard Collin was subsequently charged with the crime of contravening s 140 of the Criminal Law [Codification and Reform] Act [Chapter 9:23].\n\nHe was subsequently arrested before he was later cleared, resulting in him filing the present application.\n\nIn casu, in her statement to the police, Anna stated that on 8 May 2004, she received an anonymous call informing her that the plaintiff had demolished her house.\n\nOn the same day, she passed through the homestead and saw that indeed her seven-roomed, unroofed house had been demolished.\n\nThis is the information the defendant provided to the police.\n\nShe mentioned the plaintiff only as a suspect and informed the police that she did not seehimdemolishing the house.\n\nThe court heard she was candid that her information was based on an anonymous call she received.\n\nOn the premise of that account and the investigations, the police arrested and preferred a charge against the plaintiff.\n\nIn dismissing Collins claim, the judge said the decision to arrest and charge the plaintiff was exclusively that of the police.\n\nThe question whether she had a right or not to build a house at the homestead does not arise in this matter. It is irrelevant. The point is that she had a house at the Benyure homestead. Her house was demolished, and this is what she reported to the police. The conduct of the defendant cannot be said to amount to an active instigation of criminal proceedings, said the judge.\n\nIn addition, the judge said Collins affidavit of evidence merely recycles the contents of the summons and declaration.\n\nSuch is unhelpful. The allegation that the defendant made a false statement is not in sync with the facts of this case.\n\nThe demolished house was at the centre of the case; the police could not have arrested, and the prosecution could not have prosecuted the plaintiff if there had been no demolished house. There was a demolished house.\n\nBanda said there is no evidence that, besides giving information to the police, the defendant proceeded to lay a charge and was overbearing on the police to institute proceedings when they would not have otherwise done so.\n\nThe defendant in this case confined herself to giving information on what she believed transpired.\n\nHe said malice may be inferred from the absence of reasonable and probable cause to commence or continue a prosecution.\n\nIn other words, a want of reasonable and probable cause may be evidence of malice, where the court may conclude that there was no honest belief in the accusation made. In casu, there is no evidence of malice.\n\nIn other words, the plaintiff has not proved an absence of reasonable and probable cause operating on the mind of the defendant. Therefore, the plaintiff failed to prove the aspect of malice in the context of a claim for malicious prosecution, the court ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter HIGH Court judge Justice Christopher Dube-Banda has dismissed an application against a Murewa widow who was being sued US$60,000 for malicious prosecution by her stepson. The complainant in the case, Collin Benyure, was suing his stepmother, Anna Benyure, claiming US$$20,000 for emotional stress, US$$30,000 for damages to his reputation, and US$10,000 for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-trashes-stepsons-us60000-lawsuit-against-70-year-old-widow/\">High Court trashes stepson’s US$60,000 lawsuit against 70-year-old widow</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "04 Jun 2025"
        },
        {
            "title": "Pitbull owner was bullheaded – neighbours say as family demands justice following fatal dog attack on relative",
            "url": "https://www.newzimbabwe.com/pitbull-owner-was-bullheaded-neighbours-say-as-family-demands-justice-following-fatal-dog-attack-on-relative/",
            "content": "By Staff Reporter\n\nA Harare family is demanding justice after the death of Samuel Machara, who was fatally attacked by a pitbull over the weekend.\n\nMachara was killed in Bluffhill, becoming the latest victim of the vicious dog in recent months.\n\nThe Machara family came face to face with the dogs owner, Mike Mupinga, who is facing a culpable homicide charge when he appeared at Harare Magistrates Court on Tuesday.\n\nHe will remain locked up after his bail ruling was moved to Friday.\n\nAccording to Bluffhill residents, three pitbulls belonging to a negligent Mupinga had become a menace.\n\nMike is arrogant. We filed a lot of complaints regarding the problems and risks posed by his dogs. Unfortunately, the more you reprimanded him, the more he would show his arrogant side, said one neighbour.\n\nWhen NewZimbabwe.com visited Bluffhill, a ramshackle kennel in which Mupinga kept his four dogs, the perimeter wall too short to secure the dangerous animals.\n\nEfforts to lobby authorities over the viciousness of the pitbulls fell on deaf ears, with officials turning a blind eye to Mupinga.\n\nElijah Machara, who was the first to find his uncles body, said the death had shaken the family.\n\nI was told by a neighbour to come and check on an unconscious body. When I got closer, I found Uncle Samuel dead. He had a deep cut on his neck, and my worst fear became reality  he was dead, said Machara.\n\nMachara is the latest victim in a rising number of fatal pitbull attacks, raising concerns about the safety and coexistence of pitbulls and people.\n\nAn estimated 12 countries worldwide have banned pitbull ownership, and there are growing calls for Zimbabwe to impose similar restrictions.\n\nHarare Mayor Jacob Mafume, in a social media post, said the City Council is working on regulating pitbulls.\n\nWe have raised concerns. We will explore whether, as council, we can stretch our mandate. Our position is that such dogs are dangerous and must be banned or strictly regulated  like how one would regulate a firearm, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04031421/mike-mupinga.jpg",
            "description": "<p>By Staff Reporter A Harare family is demanding justice after the death of Samuel Machara, who was fatally attacked by a pitbull over the weekend. Machara was killed in Bluffhill, becoming the latest victim of the vicious dog in recent months. The Machara family came face to face with the dog’s owner, Mike Mupinga, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pitbull-owner-was-bullheaded-neighbours-say-as-family-demands-justice-following-fatal-dog-attack-on-relative/\">Pitbull owner was bullheaded – neighbours say as family demands justice following fatal dog attack on relative</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "04 Jun 2025"
        },
        {
            "title": "Zimbabwe to cull elephants to manage overpopulation",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-cull-elephants-to-manage-overpopulation/",
            "content": "By Mary Taruvinga\n\nZimbabwe Parks and Wildlife Management Authority (ZimParks) has given the Save Valley Conservancy the green light to cull 50 elephants to curb overpopulation.\n\nThe growing elephant populationis fast exceeding the carrying capacity of Zimbabwes national parks.\n\nZimParks spokesperson Tinashe Farawo confirmed the development in a statement on Tuesday, noting that permits have been issued to Save Valley Conservancy for an elephant management exercise.\n\nThe management quota is meant to address the growing elephant population in the region and will initially target 50 elephants.\n\nAccording to the 2024 aerial survey, there are 2550 elephants against an ecological carrying capacity of 800 elephants in Save Valley Conservancy.\n\nOver the past five years, the Conservancy translocated 200 elephants to Hurungwe and Sapi in an effort to manage the elephant population and protect the wildlife habitat, he said.\n\nAccording to ZimParks, elephant meat from the management exercise will be distributed to local communities.\n\nIvory will be State property that will be handed over to the ZimParks for safekeeping.\n\nZimparks announced the plan to cull 200 elephants last year amid criticism from some conservationists.\n\nZimParks clarified that the culling is part of their routine wildlife management practices, and the number of elephants culled is within the approved management quota.\n\nCulling is primarily driven by two factors: the severe drought affecting both wildlife and human populations, and the growing elephant population exceeding the carrying capacity of Zimbabwes national parks.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/31034915/elephant-4-scaled.webp",
            "description": "<p>By Mary Taruvinga Zimbabwe Parks and Wildlife Management Authority (ZimParks) has given the Save Valley Conservancy the green light to cull 50 elephants to curb overpopulation. The growing elephant population is fast exceeding the carrying capacity of Zimbabwe’s national parks. ZimParks spokesperson Tinashe Farawo confirmed the development in a statement on Tuesday, noting that permits have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-cull-elephants-to-manage-overpopulation/\">Zimbabwe to cull elephants to manage overpopulation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "04 Jun 2025"
        }
    ]
}