{
    "news": [
        {
            "title": "Energy Minister says Zimbabwe to manufacture solar panels, lithium batteries",
            "url": "https://www.newzimbabwe.com/energy-minister-says-zimbabwe-to-manufacture-solar-panels-lithium-batteries/",
            "content": "By Staff Reporter\n\nENERGY and Power Development Minister July Moyo says plans are afoot for Zimbabwe to begin manufacturing solar panels and lithium batteries inorder to avert crippling power outages while embracing clean renewable energy.\n\nThe scheme will involve collaborations between local universities and international firms to harness expertise and technology for commercial production.\n\nSpeaking at the just-ended sixth International Renewable Energy Conference and Expo, Moyo said Cabinet had already approved a project framework for implementation of the novelty.\n\nWe are convinced that the future is here, because of the technology we have. We want to partner our universities, and this week, the Cabinet approved a project to partner with Chinhoyi University of Technology on solar energy, covering all aspects of solar innovation, research, training and potentially manufacturing our own solar panels and exploring battery options, given our lithium resources, Moyo was quoted by State media.\n\nWe believe the opportunities are now available for everyone to participate.\n\nA Memorandum of Understanding (MoU) has been consummated with the International Solar Alliance (ISA) to establish a Solar Technology Application Resource Centre (STAR-C) at Chinhoyi University of Technology (CUT).\n\nThe aim of the scheme is to build capacity for solar energy deployment, research, development and innovation, boosting the countrys renewable energy space.\n\nEnergy Minister July Moyo\n\nWhen we are thinking about these things, solar or renewable energy must be contextualised in our economy, and our economy right now has 17 sectors.\n\nThe big ones are agriculture, the mining, industry, manufacturing. As stakeholders in renewable energy, we must also focus on these areas and identify opportunities within each one, Moyo further said.\n\nThe minister reiterated that Zimbabwe must embrace clean energy.\n\nAnd were looking at clean cooking, and when considering clean cooking, we want to liberate ourselves and our women from the smoke produced by wet wood during the rainy season, which can be overwhelming. So, promoting clean cooking is also part of our goals.\n\nEnergy efficiency is no longer an optionit is a necessity. It is one of the most cost-effective ways to expand energy access, reduce emissions, and support economic productivity across all sectors, Moyo said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/13035442/Solar-Power.png",
            "description": "<p>By Staff Reporter  ENERGY and Power Development Minister July Moyo says plans are afoot for Zimbabwe to begin manufacturing solar panels and lithium batteries inorder to avert crippling power outages while embracing clean renewable energy. The scheme will involve collaborations between local universities and international firms to harness expertise and technology for commercial production. Speaking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/energy-minister-says-zimbabwe-to-manufacture-solar-panels-lithium-batteries/\">Energy Minister says Zimbabwe to manufacture solar panels, lithium batteries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Diaspora Property Syndicates",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-diaspora-property-syndicates/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss the potential for diaspora property syndicates in Zimbabwe.\n\nReporter: Welcome back Mr. Madzima. In your view, isthis a potentially lucrative option?\n\nVM: Thank you\n\nYour question requires a holistic analysis of the property market and the fundamentals that allow or prohibit entry by individual players from the diaspora. In general terms, the last 20 years have witnessed an upward trend in property values. Seismic shifts in global markets like the 2008 global recession, whose effects were felt in markets around the world, hardly impacted Zimbabwe property pricing while property prices were falling around the world.\n\nThis, in my view, is a result of the fact that the majority of property ownership is free from mortgage or bank control. Therefore, prevailing interest rates do not have a significant bearing on property pricing in Zimbabwe.\n\nProperty pricing is usually seller-determined, although buyers have sway depending on the prevailing liquidity in the market.\n\nI mention this because it speaks to the potential returns for property investors normally positive. However, in the converse, the lack of widespread mortgage financing also limits the entry of individual players locally and in the diaspora, as most property sales and purchases require a onetime payment against a limited supply of banks offering mortgage services.\n\nThat being said, the answer to your question is yes, diaspora property syndicates are lucrative in that they potentially unlock foreign finance and, depending on objectives, may benefit from a cost-based market entry.\n\nReporter:What do you think are the things to consider in the formation of such syndicates?\n\nVM: It is critical that the documents constituting the syndicate are clear in what the syndicate intends to achieve, including the preferred property area of investment. Emphasis on this point may appear superfluous, however, you will be surprised at how easily groups of people may have a different understanding of the objectives of the group.\n\nSo if the syndicates intention is to enter the property market to specifically purchase land and construct housing for its members, be it clusters or flats, that must be clear. If, on the other hand, the intention is to develop properties for sale and money is shared among the syndicate members, those terms also must be clear. Here I am talking about governing documents regulating payments of dividends, repatriation of finances, project execution, rights and duties and dispute resolution.\n\nIt may also be advisable to create a similar, duly constituted legal vehicle in Zimbabwe that will execute the mandate on this side of the world.\n\nReporter: What legal protections are available or should be soughtfor such a vehicle?\n\nVM: The diaspora syndicate will enjoy the same protections the local investors enjoy as it relates to purchasing or disposing of property, subject to the proper due diligence being carried out.\n\nDepending on how the syndicate is constituted and its objectives, there may be a need and benefit to seek the assistance of the Zimbabwe Investment and Development Agency (ZIDA) before investing. Should the syndicate want to repatriate profits or rentals, then the investment will need to be registered with the Reserve Bank of Zimbabwe and have the necessary exchange control approvals.\n\nThe syndicate must be duly incorporated in Zimbabwe or be sufficiently compliant for deed registration and operation in Zimbabwe.\n\nReporter: What potential challenges are likely to be faced by such syndicates?\n\nVM: A lack of contemporary on-the-ground knowledge of the property business may affect the syndicates progress, making it prone to title and fraud risk. It will be necessary to have a complement of applicable local professions to assist with the project.\n\nI also mention that the Zimbabwean economy and consequently the liquidity in the property market is in flux and prone to political and regulatory changes, and various opportunities and threats present themselves at various times.\n\nThere is no substitute for local knowledge, currency threats may be mitigated contractually and by registering the investment with ZIDA and or the Reserve Bank of Zimbabwe. Bureaucracy in some instances may prove a potential challenge, for example, maybe approvals for permits such as subdivision or cluster housing permits, et cetera, this really speaks to the selection of the local team in mitigating such risks\n\nReporter: In closing, what opportunities and benefits may this bring?\n\nVM: Our law allows for joint ventures with municipalities and local governments, opening up opportunities for urban renewal, job creation, skills transfer, economic growth and general development through these structures. The opportunities are immense both for the syndicate and the country.\n\nReporter: Thank you, Mr. Madzima, we have to end here, because of our time.\n\nVM: Thank you.\n\nThese discussions are of a general nature, and those seeking specific legal advice should contact their lawyer.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/14055424/property-cluster.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss the potential for diaspora property syndicates in Zimbabwe.   Reporter: Welcome back Mr. Madzima. In your view, is this a potentially lucrative option? VM: Thank you Your question requires a holistic analysis of the property market and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-diaspora-property-syndicates/\">Legal Discussions with Vengai Madzima: Diaspora Property Syndicates   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "The Zimbabwean singer who found fame in China – and obscurity at home",
            "url": "https://www.newzimbabwe.com/the-zimbabwean-singer-who-found-fame-in-china-and-obscurity-at-home/",
            "content": "By Chris Muronzi l Al Jazeera\n\nIT was 2017 and Jo Stak  wearing a red tuxedo jacket, a bow tie and a homburg hat  was belting out a Mandarin song.\n\nRed and yellow lights shimmered around him as a crowd of cheering, flag-waving fans on the Chinese version of The Voice gave a standing ovation at the end of his act.\n\nStaks melodious rendition of a 1992 Chinese song called The World Needs Warm Hearts was broadcast on national television.\n\nI was invited to perform at The Voice as a guest performer that year, Stak recalls.\n\nThe prime-time spot reflected how well-known hed become in China. On Douyin, Chinas version of TikTok, he had about five million followers.\n\nHed appeared on some of the countrys biggest television stations. Fans stopped him on the street to ask for a photo or just have a chat. The Zimbabwean singer was riding high.\n\nBeing Black in China makes you stand out naturally, he explains.\n\nAnd I was a musician [so that] made me stand out more.\n\nThe people who stopped him were often impressed that a foreigner would sing in Mandarin.\n\nToday, in the Zimbabwean capital of Harare, Joe Takawira  Staks real name  is an inconspicuous figure walking down a street in Budiriro 5, the working class suburb where he was born and raised.\n\nIn 2019, after seven years in China, his work visa expired, and he returned home.\n\nSporting his signature beard, grey sweatpants, sneakers and a black T-shirt, he lights a cigarette.\n\nHe saunters past street vendors selling fresh produce and condiments, stops at a corner to chat with a friend, then goes about his day. Whenever he runs into someone he knows, he greets them with a fist bump and a toothy grin.\n\nWhen hes at home, Stak listens to instrumental music and writes songs in Mandarin.\n\nThis is how I spend my time in Budiriro, he says, shrugging.\n\nIt feels a long way from China and the career he enjoyed there. He has not found the same acclaim back home.\n\nEven his neighbours had no idea about his previous life.\n\nClemence Kadzomba, who runs a tyre shop in Staks neighbourhood, had no idea who his neighbour was until some of his clients who were among the 20,000 Zimbabweans living in China recognised him.\n\nI couldnt believe it, 43-year-old Kadzomba says, grinning.\n\nThey were so excited to see him, like he was some big deal. And yet, here he was, just hanging out with us like it was nothing.\n\nUnexpected journey to stardom\n\nStaks musical journey has its roots in the Methodist church-run school he attended as a teenager.\n\nHe sang in his church choir, something he loved, and was part of a group of students who recorded a gospel album.\n\nThe album did well, and some of the songs have close to a million views on YouTube.\n\nMusic runs in his family, says Stak, the middle of three brothers. His older brother wrote songs at school while the youngest brother plays the piano.\n\nAfter graduating, Stak enrolled to study Mandarin in China in 2012, motivated by his love for Chinese culture, which began as a boy watching Jackie Chans action films. He was 20 years old when he moved to Shanghai.\n\nThis came at a time when Zimbabwe was pivoting away from the West with the late leader Robert Mugabes Look East policy, adopted in response to United States and European Union sanctions after a 2002 presidential election marred by violence.\n\nMugabe opened Zimbabwes doors to Asia, leading to an influx of Chinese investment as more Zimbabweans headed to China to work or study.\n\nBy 2014, Stak was proficient in Mandarin and started posting videos of himself singing in Mandarin to Douyin.\n\nI wanted to explore music in a different language, he explains as he lights a cigarette and sits back in his chair on the red-floored veranda of his house.\n\nHe would sing R&B, hip-hop and pop songs in Mandarin and English and started to get booked for gigs.\n\nMy first gig was at Yuyingtang, a music bar in Shanghai, he recalls. He says the venue wasnt very big but he made $1,500  enough to pay for his food and accommodation for months.\n\nThat gig made him realise he could make money from his talent, and it marked the start of his career as a professional pop singer in China.\n\nAfter that, he played at music bars, festivals, weddings and nightclubs  performing mostly in Mandarin.\n\nOf the 37 songs he recorded, one was in the top 10 on the Chinese music streaming service Baidu Music.\n\nIt meant a lot to me, Stak says excitedly, although it earned him only 5,000 yuan ($865).\n\nThen in 2017, he joined the Foundation Band, a group of musicians from Africa, the US and Europe that performed Chinese and Western pop music and hip-hop at weddings and nightclubs.\n\nAs the lead vocalist, he caught the attention of Chinese television networks, leading to performances on major stations.\n\nI was surprised by my success in China, Stak admits.\n\nLife there was good. His daily routine consisted mainly of eating, singing and drinking.\n\nHis favourite dish was hotpot  a meal for which diners cook raw ingredients like seafood and tofu in a shared pot of broth at the table.\n\nEven now, when I miss it, I go to Chinese restaurants, he says.\n\nHed perform at night, and during the day, hed roam along Shanghais historic waterfront with its colonial-era architecture and rooftop bars.\n\nStak made good money. They pay artists well  I mean 1,000 US dollars minimum for a 10-minute show.\n\nBut he also felt accepted and at home in China, where he says the music industry welcomes foreign talent and invests in it.\n\nUnlike many foreign artists singing in English who can struggle to break into the Chinese market, Stak had an edge  he was an African singing in Mandarin, and there were few performers like him. His ability to perform popular Chinese songs endeared him to audiences.\n\nComing home to anonymity\n\nThen in 2019, Staks visa expired. Aged 27, he returned to a country that was in the midst of a devastating economic crisis.\n\nHis parents  his fathers an engineer, his mothers a teacher  were coping, but across the country, people were struggling with hyperinflation, foreign currency shortages and an unemployment rate of more than 50 percent.\n\nStak found work as a translator  and quickly discovered that Zimbabwes music and social media landscapes were unfamiliar to him.\n\nHe says much of his fame and success came from Chinese apps, mostly Douyin. But the apps he relied on are available only in China as Beijing restricts foreign digital platforms through its Great Firewall.\n\nWithout them, Stak could no longer reach his Chinese audience.\n\nHis career vanished when he left Shanghai. I feel like a part of me remained in China, he explains.\n\nIn Zimbabwe, nobody knew him. He started recording some music  and contemplated a switch to gospel, which is popular in the country  but hes struggled to promote his songs. When he contacted a local radio station to play his music, he never heard back.\n\nStak believes that if Chinese social media were accessible to global audiences, he would still have a thriving musical career.\n\nThat would have brought me international recognition, he says.\n\nFor now, the translation work pays well. He currently works for a Chinese mining company, translating English or Shona into Mandarin. When he isnt working, he tries to write music, but full-time work leaves little time to reinvent himself or find an audience for his Chinese pop.\n\nLonging for the stage\n\nToday, Stak is torn. He dreams of a return to China but also wants to rebuild his music career in Zimbabwe, where he hopes to marry and raise a family.\n\nI want to start afresh here, he says.\n\nBut I also miss China, a country that was very good and welcoming to him, he adds.\n\nWhether its in Asia or Africa, he itches to return to the stage. I miss the spotlight, he says.\n\nFive years after he left China, Stak remains popular there. A couple of months ago, his Chinese boss uploaded a video of him singing in Mandarin. [He] posted me on his WeChat status, and people were asking him about me. They were like, Where is this guy?\n\nStak takes a moment and then adds, The Chinese love me.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/14053300/20250330_145518-1-1743421622.webp",
            "description": "<p>By Chris Muronzi l Al Jazeera  IT was 2017 and Jo Stak – wearing a red tuxedo jacket, a bow tie and a homburg hat – was belting out a Mandarin song. Red and yellow lights shimmered around him as a crowd of cheering, flag-waving fans on the Chinese version of The Voice gave a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-zimbabwean-singer-who-found-fame-in-china-and-obscurity-at-home/\">The Zimbabwean singer who found fame in China – and obscurity at home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Gabon coup leader wins election by huge margin",
            "url": "https://www.newzimbabwe.com/gabon-coup-leader-wins-election-by-huge-margin/",
            "content": "By BBC News\n\nGABONS military leader Gen Brice Oligui Nguema  who in 2023 led a coup that ended a near-60-year dynasty  has won Saturdays presidential election with more than 90% of the vote, provisional results show.\n\nAhead of the vote, critics argued that the new constitution and electoral code were designed to give Oligui Nguema a comfortable pathway to the top job.\n\nSome opposition heavyweights who could have posed a serious political challenge were excluded from the race.\n\nHis election victory consolidates his grip on power, nearly two years after he masterminded the demise of President Ali Bongo, whose family had been in power in Gabon since 1967.\n\nOligui Nguema, 50, faced seven other candidates, including former Prime Minister Alain Claude Bilie-by-Nze, who served under the Bongo regime, and two stalwarts of the former ruling PDG party, Stphane Germain Iloko and Alain Simplice Boungoures.\n\nWho is Gen Brice Oligui Nguema?\n\nGen Brice Oligui Nguema\n\nWhy Gabons coup leader is bucking a trend by embracing democracy.\n\nBrice Clotaire Oligui Nguema is elected [president] by absolute majority of votes cast, with 575,222 votes, Interior Minister Hermann Immongault announced.\n\nHis main challenger, Bilie-by-Nze, received just over 3% of the votes.\n\nMore than seven out of 10 registered voters took part in the poll, which the authorities and some observers hailed as signifying the election took place transparently and peacefully.\n\nThere were complaints of instances of irregularities in the process, however.\n\nAt some polling stations the vote was delayed, while some voters on the electoral roll were not able to find where they were meant to cast their ballot.\n\nBilie-by-Nze said he was particularly concerned by claims that in some places unmarked ballot papers were not kept in a secure location, and that he feared they could be used to stuff ballot boxes.\n\nOligui Nguemas victory brings him a seven-year mandate and the resources to tackle the corruption and bad governance that characterised the Bongos time in power.\n\nThe highly articulate former commander of the elite Republican Guard proved to be very popular among a population relieved to be rid of dynastic rule, promising to rid the country of the ill that had tainted Gabons image.\n\nThe small oil- and timber-rich central African nation is home to just 2.5 million people.\n\nDespite its resources, about 35% of the population still live below the poverty line of $2 (1.50) a day.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/14052611/960x640.webp",
            "description": "<p>By BBC News GABON’S military leader Gen Brice Oligui Nguema – who in 2023 led a coup that ended a near-60-year dynasty – has won Saturday’s presidential election with more than 90% of the vote, provisional results show. Ahead of the vote, critics argued that the new constitution and electoral code were designed to give</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gabon-coup-leader-wins-election-by-huge-margin/\">Gabon coup leader wins election by huge margin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Highlanders beat CAPS United to worsen Chitembwe’s troubles",
            "url": "https://www.newzimbabwe.com/highlanders-beat-caps-united-to-worsen-chitembwes-troubles/",
            "content": "By Sports Reporter\n\nHIGHLANDERS bounced back to winning ways Sunday with a 1-0 win over old rivals CAPS United in the battle of cities played at Barbourfields Stadium.\n\nSo sweet was the victory for Bosso that it ended the teams three match winless streak in the ongoing campaign.\n\nWith a determination to pick a positive point, Bosso maximised on its scoring form, finding the back of the net in the 4th minute of the first half, thanks to Reason Sibanda.\n\nThe Bulawayo giants are the highest scoring team in the league with nine goals and boast of being the only club that has scored on every matchday this season.\n\nAlthough his side walked away with maximum points, Highlanders coach Kelvin Kaindu was not impressed.\n\nIts a good victory for us, we didnt play as anticipated, but we got maximum points.\n\nThis game could have gone either way, but with a bit of luck we could have scored two or more.\n\nWe are able to score in every game and if we maintain that Im sure we will be well.\n\nCAPS United fought with everything they had and Im sure if they could play in other games the performance, they displayed today things will fall in place, said Kaindu.\n\nCAPS United have picked four points out of a possible 18 points out of the six games they have played.\n\nThe Green Machine is currently occupying second from last position (17) on the log, with four points, 10 behind log leaders MWOS.\n\nAlready pressure is mounting for team head coach Lloyd Chitembwe, who had a confrontation with club fans last week at Rufaro Stadium after suffering a 2-1 defeat to Ngezi Platinum Stars.\n\nChitembwe did not show up for the post-match interview against Highlanders, instead he was represented by his assistant Tonderai Marume, who believes luck was not on their side.\n\nIts unfortunate, if you look at the first half, we did well but luck was not on our side.\n\nWe even had several chances at one point were denied by the woodwvork.\n\nAnyway, that happens in a game of football, we now have to work on our players mindset as we go forward, said Marume.\n\nCASTLE LAGER PREMIER SOCCER LEAGUE MATCHDAY 6 RESULTS\n\nZPC Kariba 5-0 Kwekwe United\n\nTel One 2-1 Ngezi Platinum Stars\n\nSimba Bhora 4- 1 Manica Diamonds\n\nFC Platinum 0-0 Green Fuel\n\nScottland 1-1 Yadah\n\nBikita Minerals 2- 1 Triangle\n\nDynamos 0-1 Chicken Inn\n\nHighlanders 1-0 CAPS United\n\nHerentals 0- 1 MWOS FC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/16230119/hIGHLANDERS-1.jpg",
            "description": "<p>By Sports Reporter HIGHLANDERS bounced back to winning ways Sunday with a 1-0 win over old rivals CAPS United in the battle of cities played at Barbourfields Stadium. So sweet was the victory for Bosso that it ended the team’s three match winless streak in the ongoing campaign. With a determination to pick a positive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/highlanders-beat-caps-united-to-worsen-chitembwes-troubles/\">Highlanders beat CAPS United to worsen Chitembwe’s troubles</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Mutasa on cloud nine as MWOS goes on top of PSL log",
            "url": "https://www.newzimbabwe.com/mutasa-on-cloud-nine-as-mwos-goes-on-top-of-psl-log/",
            "content": "By Sports Reporter\n\nMWOS FC coach Lloyd Mutasa was a happy man Sunday afternoon after his team managed to pick a 1-0 win over Herentals at Wadzanayi Stadium to go on top of the Castle Lager Premier Soccer League (PSL) log table.\n\nThe debutante side is now on 14 points, one ahead of Ngezi Platinum which is occupying second position with 13 points.\n\nNicknamed The Punters, MWOS is the only team yet to record a defeat this season in the league as they have managed four wins and two draws after match day six.\n\nSo resolute has been the teams defence that they have only conceded one goal this season, a strength which team head coach is impressed with.\n\nVery happy with our defence, you know good teams are built on good defence, even if you have a bad day and fail to score you know that you wont lose a match.\n\nThis is what exactly what my boys are doing, and we l am happy with that, said Mutasa.\n\nMWOS had a late promotion into the league after buying ZPC Hwanges franchise in January.\n\nThe Norton-based side returned the majority of players, who featured for the side in the Northern Region Division One League when they failed to clinch promotion ticket after finishing second to Scottland F.C.\n\nDespite having limited pre-season preparation time, MWOS FC coach believes teamwork is what has given his side a good start in the league.\n\n| think working as a team has helped us, we have been fighting for each other.\n\nI have seen a lot of teamwork from these youngsters, and they have the desire you get good results, which we are trying to do in each and every match, added Mutasa.\n\nMWOS is temporarily using Baobab Stadium in Mhondoro-Ngezi as a home ground but will soon move to Ngoni Stadium in Norton.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225813/LLOYD-MUTASA.jpg",
            "description": "<p>By Sports Reporter MWOS FC coach Lloyd Mutasa was a happy man Sunday afternoon after his team managed to pick a 1-0 win over Herentals at Wadzanayi Stadium to go on top of the Castle Lager Premier Soccer League (PSL) log table. The debutante side is now on 14 points, one ahead of Ngezi Platinum</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutasa-on-cloud-nine-as-mwos-goes-on-top-of-psl-log/\">Mutasa on cloud nine as MWOS goes on top of PSL log</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Labour body raises alarm over bogus officials",
            "url": "https://www.newzimbabwe.com/labour-body-raises-alarm-over-bogus-officials/",
            "content": "By Alois Vinga\n\nTHE National Employment Council for the Commercial Sectors (NECCS) has warned members of the public to be wary of bogus officials on the prowl seeking to dupe victims by peddling lies that the organisation is no longer functional.\n\nIn a statement, the NECCS alleged that two individuals, and one unnamed person, have been causing chaos in the sector by peddling misinformation.\n\nWe have noted with great concern that the following people Jabulani Gwarazimba, Walter Taranhike and another who is yet to be identified are moving within the sector misleading as well as misinforming both employers and employees that the NEC for the Commercial Sectors is no longer functional. The information is not only misleading but malicious, the NEC said.\n\nFor the record, the organisation said the NEC for Commercial Sectors of Zimbabwe is fully functional and performing all its constitutionally mandated duties which are inter alia wage negotiations, dispute resolutions, sector code of conduct cases and sector compliance inspections.\n\nWe, therefore, advise you to ignore and dismiss such unfounded allegations with the contempt they deserve.\n\nThe falsehoods they are peddling are just intended to convince subscribers to join the trade union they purport to represent. Verifications can be done through our offices, the NEC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/14045454/Screenshot_20250414-055255_1.jpg",
            "description": "<p>By Alois Vinga  THE National Employment Council for the Commercial Sectors (NECCS) has warned members of the public to be wary of bogus officials on the prowl seeking to dupe victims by peddling lies that the organisation is no longer functional. In a statement, the NECCS alleged that two individuals, and one unnamed person, have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-body-raises-alarm-over-bogus-officials/\">Labour body raises alarm over bogus officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Motorist knocks dead police officer walking on roadside",
            "url": "https://www.newzimbabwe.com/motorist-knocks-dead-police-officer-walking-on-roadside/",
            "content": "By Staff Reporter\n\nA FEMALE police officer was Saturday knocked dead by a passing vehicle while she was walking, together with her workmates, on the roadside.\n\nThe now deceased police officer was identified as Constable Amanda Katanha stationed at Mazowe Police Station.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nA police officer, Constable Amanda Katanha, stationed at ZRP Mazowe, died on April 12, 2025, after being hit by a Toyota Probox vehicle, registration number AGP 8475, with three passengers on board at around 1840 hours at the 17 kilometre peg along Mazowe-Centenary Road, said Nyathi.\n\nKatanha was walking on the extreme side of the road with two other police officers after knocking off duty from a deployment at Dowkins Farm, Concession.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13181610/Screenshot_20250413-191420_1.jpg",
            "description": "<p>By Staff Reporter  A FEMALE police officer was Saturday knocked dead by a passing vehicle while she was walking, together with her workmates, on the roadside. The now deceased police officer was identified as Constable Amanda Katanha stationed at Mazowe Police Station. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “A</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-knocks-dead-police-officer-walking-on-roadside/\">Motorist knocks dead police officer walking on roadside </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Holy Ten forced off stage after angry fans throw missiles, again!",
            "url": "https://www.newzimbabwe.com/holy-ten-forced-off-stage-after-angry-fans-throw-missiles-again/",
            "content": "By Staff Reporter\n\nZIM hip-hopper HOLY Ten continues to face rejection by fans after his act during Bling 4s album launch was cut short after the crowd started throwing objects at him.\n\nThe Saturday show was to launch Bling 4s new album titled Hosanna, and Holy Ten was a guest artist but the restless Chitungwiza crowd demanded hometown hero Voltz JT, prompting the former to leave stage after sensing danger.\n\nThis is not the first time revellers have subjected Holy Ten to ridicule. Recently, he had to flee a Kariba show with furious fans baying for his blood after reportedly coming late.\n\nDuring the Chitungwiza debacle, the controversial rapper, who has lately aligned himself with ruling party Zanu PF, was forced off stage by a mob which started throwing cans at him. They were chanting NOP Makoni, the album title of his nemesis Voltz JT, which recently won an award at the National Arts Merits Awards (NAMA).\n\nHoly Ten, also known as Mujaya (young man), has been at the centre of controversy over the past few weeks, from an interview that threw jabs at almost every socialite, including his wife, and celebrities like Eubert Angel, Sir Wicknell Chivayo, and Mudiwa Hood, who ultimately filed a police report leading to a warrant of arrest being issued.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/01113948/Holy-Ten.png",
            "description": "<p>By Staff Reporter  ZIM hip-hopper HOLY Ten continues to face rejection by fans after his act during Bling 4’s album launch was cut short after the crowd started throwing objects at him. The Saturday show was to launch Bling 4’s new album titled ‘Hosanna’, and Holy Ten was a guest artist but the restless Chitungwiza</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/holy-ten-forced-off-stage-after-angry-fans-throw-missiles-again/\">Holy Ten forced off stage after angry fans throw missiles, again!</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        },
        {
            "title": "Zanu PF wins Glen View South by-election, unseats ‘dead’ opposition after 25 years",
            "url": "https://www.newzimbabwe.com/zanu-pf-wins-glen-view-south-by-election-unseats-dead-opposition-after-25-years/",
            "content": "By Staff Reporter\n\nZIMBABWES ruling party, Zanu PF has won the Glen View South by-election, marking a major political turning point, grabbing a parliamentary seat traditionally held by the opposition.\n\nZanu PF candidate Tsitsi Tranquility Tawomhera is now the Member of Parliament (MP)-elect after garnering an unassailable 3 404 votes, according to results from the Zimbabwe Electoral Commission (ZEC) constituency elections officer Killian Gambe.\n\nTawomhera shrugged off competition from four other candidates: three independents  Toenderai Chakaredza (993), George Makwangwaidze (681), Tungamirai Madzokere (234)  and National Constitutional Assembly (NCA) candidate Perpetua Mukanda, who scrapped a paltry 77 votes. There were 44 rejected ballots.\n\nVoter apathy characterised the plebiscite, with turnout pegged at 17,2% of Glen View Souths registered voter population of 31 519.\n\nThe seat fell vacancy after the death of Grandmore Hakata.\n\nCommenting on Zanu PFs by-election victory, award-winning journalist and political observer, Hopewell Chinoono blamed the divided opposition for the result, suggesting the alternative is dead.\n\nToday, Glen View is in the hands of Zanu PF for the first time in 25 yearsnot because Zanu PF has done anything fantastic, but because it faces an opposition built around a popular personality, not ideas or a cause.\n\nMany of us think of ourselves as educated, but education is not the certificates we holdit is the ability to use the knowledge we gained from school to think and compute ideas, said Chinoono.\n\nWhat is happening today was predicted on this page in 2022; that without a structured opposition with a Constitution, Zanu PF would pounce.\n\nBut as usual, I was insulted and told about a plan called strategic ambiguity. What happened to the plan?\n\nZanu PF will be in power with a huge majority post 2028 if things remain the way they are. Reality does not hero-worship personalitiesit favours common sense.\n\nThe reality of politics is that if it is hinged on personalities rather than ideas and a cause, the regime becomes stronger because it either buys or immobilises those personalities.\n\nThe MDC survived as long as it did because Morgan Tsvangirai, for the most part, was not threatened by those more educated or more talented than himhe was secure. The pastor is not.\n\nTsvangirai understood the importance of structures and of allowing leaders at various levels to be independent and strong.\n\nWhat you saw in Glen View is the beginning of the total end of the 1999 project, he added.\n\nThe current opposition leaders are the best thing that has ever happened to Zanu PF, Chinoono opined.\n\nWhy would you not want people who are hero-worshipped yet do nothingwho cannot even speak-out about corruption or draconian laws against the citizens?\n\nWhenever you see infighting in Zanu PF, it means there is no opposition to speak of. We are in the worst period Zimbabwe has experienced since 1999. The citizens must be told the truth; 2028 is gone save for a miracle!\n\nThe oppositions emphasis on personalities rather than ideas and causes is a recurring issue that has weakened the opposition and strengthened the regime.\n\nChinoono further stated that the lack of a clear and consistent message from the opposition on critical issues like corruption and draconian laws is a reflection of a failed leadership.\n\nIt is strange that you have adults who defend the mediocrity of their leaders, it is mind boggling as it is sad to watch! It is like watching a man self-harm yet you cant do anything about it! Continue to fool yourselves!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13083854/Screenshot_20250413-092606_1.jpg",
            "description": "<p>By Staff Reporter  ZIMBABWE’S ruling party, Zanu PF has won the Glen View South by-election, marking a major political turning point, grabbing a parliamentary seat traditionally held by the opposition. Zanu PF candidate Tsitsi Tranquility Tawomhera is now the Member of Parliament (MP)-elect after garnering an unassailable 3 404 votes, according to results from the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-wins-glen-view-south-by-election-unseats-dead-opposition-after-25-years/\">Zanu PF wins Glen View South by-election, unseats ‘dead’ opposition after 25 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "14 Apr 2025"
        }
    ]
}