{
    "news": [
        {
            "title": "Ramaphosa appoints Gwede Mantashe as acting police minister",
            "url": "https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/",
            "content": "In a decisive move to address escalating concerns within South Africas police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening,Cape {town} Etcreports.\n\nThis temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast a shadow over the law enforcement agency.\n\nMantashes role will be short-lived as he is slated to hold the position until Professor Firoz Cachalia steps into the role at the beginning of August.\n\nCachalia, who has spent most of his career in academia, is poised to take the reins following his retirement from the University of the Witwatersrand at the end of this month.\n\nHis appointment was previously announced by Ramaphosa during a televised address on Sunday.\n\nThe political landscape is particularly volatile at present, with serious allegations surfacing against former Police Minister Senzo Mchunu. In a stark revelation, KwaZulu-Natal Provincial Police Commissioner, Lieutenant General Nhlanhla Mkhwanazi, claimed a powerful criminal syndicate has infiltrated South Africas law enforcement and judicial systems.\n\nMkhwanazi went one step further, accusing Mchunu of meddling in sensitive cases and colluding with a businessman accused of murder, aiming to dismantle the task force investigating a spate of political killings in KwaZulu-Natal.\n\nIn light of these explosive allegations, President Ramaphosa has taken decisive action, placing Mchunu on special leave while also initiating a judicial commission of inquiry to be led by Acting Deputy Chief Justice Mbuyiseli Madlanga.\n\nThe commission is tasked with investigating claims of interference in investigations, complicity among government officials, and the suppression of crucial law enforcement activities.\n\nMchunu, embroiled in controversy over the past week, has been accused by Mkhwanazi of being entwined with drug cartels and influential business concerns.\n\nAmong the allegations presented was an assertion that Lieutenant-General Shadrack Sibiya, deputy national commissioner for crime detection, colluded with Mchunu and a known information dealer, Brown Mogotsi, in a plot to disband the KwaZulu-Natal political killings task team.\n\nPolice Commissioner Masemola announced that Sibiya would also be requesting a leave of absence while investigations unfold, indicating a stern approach to restoring integrity within the police service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/03003040/Gwede-Mantashe.png",
            "description": "<p>Cape ETC In a decisive move to address escalating concerns within South Africa’s police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening, Cape {town} Etc reports. This temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/\">Ramaphosa appoints Gwede Mantashe as acting police minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:38",
            "date": "16 Jul 2025"
        },
        {
            "title": "ZAA invites global diaspora to annual gathering in Harare",
            "url": "https://www.newzimbabwe.com/zaa-invites-global-diaspora-to-annual-gathering-in-harare/",
            "content": "The Zimbabwe Achievers Awards (ZAA) proudly announces its flagship ZAA Global Diaspora Forum & Awards Gala, set to take place from 2930 August 2025 at the prestigious Hyatt Regency Hotel in Harare.\n\nThis highly anticipated event, organised by the Destiny Media Group, will bring together Zimbabweans from across the world for two days of connection, collaboration, celebration, and impact.\n\nNow in its milestone edition, the ZAA Global Diaspora Gathering serves as a bridge between Zimbabwes thriving diaspora and the motherland. With representation from Canada, the UK, USA, Australia, South Africa, UAE and beyond, the gathering is a vibrant homecoming and a rallying call to build the Zimbabwean dreamtogether.\n\nWhy the Diaspora Should Attend\n\nFor many, this is more than an eventit is a return to ones roots. The Harare gathering offers a moment to reconnect with home, reignite your Zimbabwean identity, and be part of the national conversation.\n\nThe ZAA Global Awards Gala will honour outstanding Zimbabweans from around the world who are making remarkable strides in business, arts, philanthropy, innovation, and leadership. Its a night of glamour, pride, and powerful inspiration.\n\nFounder Conrad Mwanza will officially launch his new book, The Zimbabwean Dream, capturing the vision of a united, prosperous, and globally connected Zimbabwe. The book is a call to action for the diaspora to shape the countrys future.\n\nThe forum on Day 1 will feature engaging panels, investment showcases, and policy discussions, bringing together thought leaders, entrepreneurs, government representatives, and development partners to explore diaspora-led development.\n\nWhether youre looking to invest back home, build new partnerships, or simply connect with like-minded Zimbabweans, the ZAA Diaspora Gathering offers unmatched networking opportunities.\n\nHarare, the heartbeat of the nation, will serve as the backdrop for this iconic eventreminding us all that no matter where we are in the world, home is where the heart is.\n\nFor media inquiries, partnerships, or to confirm attendance, please contactinfo@zimachievers.orgor visit www.zimachievers.org.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/28130223/Conrad-Mwanza.png",
            "description": "<p>The Zimbabwe Achievers Awards (ZAA) proudly announces its flagship ZAA Global Diaspora Forum & Awards Gala, set to take place from 29–30 August 2025 at the prestigious Hyatt Regency Hotel in Harare. This highly anticipated event, organised by the Destiny Media Group, will bring together Zimbabweans from across the world for two days of connection,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zaa-invites-global-diaspora-to-annual-gathering-in-harare/\">ZAA invites global diaspora to annual gathering in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:38",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zim referee Brighton Chimene to officiate at CHAN",
            "url": "https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/",
            "content": "By Sports Reporter\n\nZimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month.\n\nThe tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August.\n\nChimene is one of the 75 selected referees to serve at the tournament.\n\nCHAN call-up marks Chimenes second major tournament this year, the first one being the AFCON boys under 17 three months ago.\n\nAged 35, Chimene was elevated to be an Elite B class on the FIFA panel early this year, making himself eligible for major CAF tournaments.\n\nThe four-time Zimbabwe Premier Soccer League Referee of the Year is now one level lower to officiate at the FIFA World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Zimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month. The tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August. Chimene is one of the 75</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/\">Zim referee Brighton Chimene to officiate at CHAN</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:38",
            "date": "16 Jul 2025"
        },
        {
            "title": "1.5 million people are homeless in Zimbabwe – report reveals, as ZimRights calls for repeal of Vagrancy Act",
            "url": "https://www.newzimbabwe.com/1-5-million-people-are-homeless-in-zimbabwe-report-reveals-as-zimrights-calls-for-repeal-of-vagrancy-act/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Association (ZimRights) has renewed calls for the repeal of the colonial era Vagrancy Act, which criminalises homelessness.\n\nThe Vagrancy Act (Chapter 10:25), criminalises homelessness and disproportionately affects marginalised communities as it gives power to the police to arrest and charge homeless people.\n\nThe law also criminalises any person who assists people living on the streets.\n\nSpeaking at the launch of their 2024 Annual Report, Dzikamai Bere, National Director for ZimRights, said an estimated over a million Zimbabweans do not have homes, adding that nine people previously died in police custody after they were arrested using that law.\n\nDzikamai Bere\n\nWe have a vagrancy act, a colonial piece of legislation that makes it a criminal offence for you to not have a place to stay and if the police find you on the road, they can arrest and charge you under the Act and about US$1.5 million people are affected by that law.\n\nAt one point, about nine people died in police custody after they had been arrested as vagrants.\n\nWe have sent a petition to parliament and we are in the process of engaging with the parliament so that the law may be removed, Bere said.\n\nZimRights last year launched a campaign to repeal the Vagrancy Act and later petitioned parliament.\n\nThe campaign was driven by concerns from communities in Chitungwiza and Harare,where growing numbers of homeless individuals were increasinglytargetedbyauthorities rather than receiving support.\n\nZimRights National Chairman Takesure Musiiwa also added that laws like these are outdated policies introduced by former colonial governments to serve their own interests and no longer benefit citizens.\n\nThese are policies which were imposed on us by previous regimes, (the whites) they brought their own issues for their own reasons and as an organisation we are engaging with the government to say can we have a look at this policy, it is not helping our citizens, so how best can we try to change it maybe replace it with a better law which will protect our citizens, Musiiwa said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/19125926/Screenshot-2024-11-19-at-14.59.12.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Association (ZimRights) has renewed calls for the repeal of the colonial era Vagrancy Act, which criminalises homelessness. The Vagrancy Act (Chapter 10:25), criminalises homelessness and disproportionately affects marginalised communities as it gives power to the police to arrest and charge homeless people. The law also criminalises any person</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/1-5-million-people-are-homeless-in-zimbabwe-report-reveals-as-zimrights-calls-for-repeal-of-vagrancy-act/\">1.5 million people are homeless in Zimbabwe – report reveals, as ZimRights calls for repeal of Vagrancy Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:38",
            "date": "16 Jul 2025"
        },
        {
            "title": "E-creator pyramid scheme trial begins, two socialites set to testify",
            "url": "https://www.newzimbabwe.com/e-creator-pyramid-scheme-trial-begins-two-socialites-set-to-testify/",
            "content": "By Mary Taruvinga\n\nThe trial in which two Chinese nationals, Zhao Jiatong and William Chui are facing fraud charges after they allegedly conned hundreds of people in a pyramid scheme has commenced before Harare Magistrate Francis Mapfumo, with the two denying the allegations.\n\nThe court heard two socialites, Tyra Chikocho, better known as Madam Boss and Admire Mushambi aka Mama Vee, will testify in court.\n\nJiatong is still locked up in jail.\n\nJiatong and Chui denied conning people, telling the court that their arrest came as a surprise.\n\nThe accused (Jiatong) will tell the court that he is not good in the English language, such that he never communicated with any of the state witnesses at any given time, his lawyer submitted.\n\nJiatong said he had never benefited from the alleged fraud and never attempted to run away because he knew nothing regarding the scheme.\n\nHe was surprised when he was arrested in connection with this case and nothing incriminating was found upon his person or in his phone or anywhere else.\n\nHe will thereof put the state to the strict proof thereof, read his defence outline.\n\nChui echoed the same sentiments telling court that he never had any communication with the complainants.\n\nHe also said no complainant named him in their statements.\n\nAllegations against Jiaotong are that in January 2023, he hatched a plan to defraud unsuspecting Zimbabweans through an online investment Ponzi scheme.\n\nIt is alleged that on 7 February, Jiaotong and his alleged accomplices registered a company with the Zimbabwean Registrar of Companies, styled E-Creator Electronic Commerce [Private] Limited under company registration number 2853/23, with its office situated at room number 15 and 16, 10th Floor Joina City Building, Harare.\n\nThey went on to launch the company as an online e-commerce operator with the global internet as its core.\n\nIt is alleged that from February to July 2023, they misrepresented to unsuspecting Zimbabweans that if they invested with the company, they were going to enjoy huge monthly profits proportional to the amounts invested.\n\nAs such, many Zimbabweans joined and invested up to US$1 million in total through various Ecocash subscriber lines supplied on the platform by the suspect.\n\nIt is further alleged that to make the company more attractive and appealing to unsuspecting clients, Jiaotong used the media, including the national television broadcaster Zimbabwean Television (ZTV), social media and socialites Madam Boss, and Mama Vee to advertise the business on their social media platforms.\n\nThey also employed various agents in major towns and cities throughout the country in order to market the business.\n\nOn July 3, some of the complaints encountered challenges in accessing their funds and approached the company for clarification, prosecutors said.\n\nOne of the accused assured these complainants that it was a system upgrade that was affecting their access to their funds.\n\nHe further advised them that the situation would normalise in due course.\n\nHowever, on 5 July 2023, the state says, complainants were shocked to realise that E-Creator Electronic Commerce [Private] Limited had sent a notice on their website that they were no longer operating, and they posted the passport photo of accused Jiaotong as the one who had taken their investments and absconded to China.\n\nClients are said to have visited the investors offices to find directors having vacated the premises with nothing to suggest they were still continuing with operations.\n\nIt is also alleged that clients were informed that Jiaotong had withdrawn their investments and fled.\n\nAs a result of his actions, prosecutors allege, clients suffered an actual prejudice of US$1 million, and nothing was recovered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15193139/Screenshot-2025-07-15-at-20.31.05.png",
            "description": "<p>By Mary Taruvinga The trial in which two Chinese nationals, Zhao Jiatong and William Chui are facing fraud charges after they allegedly conned hundreds of people in a pyramid scheme has commenced before Harare Magistrate Francis Mapfumo, with the two denying the allegations. The court heard two socialites, Tyra Chikocho, better known as Madam Boss</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/e-creator-pyramid-scheme-trial-begins-two-socialites-set-to-testify/\">E-creator pyramid scheme trial begins, two socialites set to testify</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:38",
            "date": "16 Jul 2025"
        }
    ]
}