{
    "news": [
        {
            "title": "Chevrons pumped up for the historical England Test match",
            "url": "https://www.newzimbabwe.com/chevrons-pumped-up-for-the-historical-england-test-match/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens cricket team coach Justin Summons says his team is super excited for the historical Test match against England, scheduled for May 22 to 25 at Trent Bridge cricket ground in Nottingham.\n\nThe Chevrons arrived in England on Sunday and conducted their first training in Leicester on Monday.\n\nBefore taking on England, Zimbabwe will fine-tune their preparations with a four-day warm-up match against a First-Class Counties XI from 15 to 18 May at the Uptonsteel County Ground in Leicester.\n\nCommenting ahead of the historical test, Summons said, I think our preparation is excellent.\n\nWe have got ten days ahead of us for good preparations.\n\nI think its just naturally energising the group, and they are super excited to get going.\n\nI mean, its why you play the game, you want to play against the best, and obviously England are one of the best Test teams in the world.\n\nAnd it really gives us a gauge as to where we are and what we need to do moving forward.\n\nZimbabwes tour to England comes after more than two decades since the two sides last played each other in crickets longest format.\n\nFollowing the Test against England, Zimbabwe will take on South Africa in a four-day encounter from 3 to 6 June at Arundel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15045705/zim-cricket.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s cricket team coach Justin Summons says his team is “super excited” for the historical Test match against England, scheduled for May 22 to 25 at Trent Bridge cricket ground in Nottingham. The Chevrons arrived in England on Sunday and conducted their first training in Leicester on Monday. Before taking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-pumped-up-for-the-historical-england-test-match/\">Chevrons pumped up for the historical England Test match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Belarus’ Lukashenko says ready to rescue Zimbabwe’s hospitals",
            "url": "https://www.newzimbabwe.com/belarus-lukashenko-says-ready-to-rescue-zimbabwes-hospitals/",
            "content": "By Darlington Gatsi\n\nBELARUS President Aleksandr Lukashenko has pledged to revamp Zimbabwes ailing healthcare system, which has been deteriorating due to underfunding by the government.\n\nZimbabwes healthcare system has been under scrutiny, with major hospitals failing to cater to sick patients owing to a shortage of basic medical supplies.\n\nLukashenko, who is hosting President Emmerson Mnangagwa, said his country would assist Zimbabwe by supplying medicines and equipment.\n\nWe are ready to assist Zimbabwe in creating a comprehensive healthcare system, supplying medicines and specialised equipment to address the issue of healthcare accessibility for children, women, and the entire population of Zimbabwe.\n\nYou have studied our healthcare system. As far as I know, you liked it, and you are ready to build it in Zimbabwe with our help. We are willing to assist you in this, said Lukashenko, as quoted by Belarus state media.\n\nZimbabwes healthcare system is likely to collapse further following a halt in funding from the United States of America, which had assisted in providing medicines to vulnerable communities.\n\nDespite the government downplaying the current state of hospitals, health institutions are in dire straits, with patients required to bring their own essential supplies.\n\nWednesday, Finance Minister Mthuli Ncube signed a Memorandum of Understanding with Lukashenkos government to refurbish Parirenyatwa Hospital.\n\nHowever, critic Hopewell Chinono is sceptical about the agreement, raising concerns over its lack of transparency.\n\nThere is nothing he will bring from Belarus that you cannot find in South Africa, China, or Europe, where the goods are actually cheaper than in Belarus. The only difference is that it is harder to steal as much as he wants from those other countries!\n\nWe await the details of the prices of the medical goods that will be procuredwe will find out soon! said Chinono in a social media post.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30041701/Parirenyatwa-Hospital.jpg",
            "description": "<p>By Darlington Gatsi BELARUS’ President Aleksandr Lukashenko has pledged to revamp Zimbabwe’s ailing healthcare system, which has been deteriorating due to underfunding by the government. Zimbabwe’s healthcare system has been under scrutiny, with major hospitals failing to cater to sick patients owing to a shortage of basic medical supplies. Lukashenko, who is hosting President Emmerson</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/belarus-lukashenko-says-ready-to-rescue-zimbabwes-hospitals/\">Belarus’ Lukashenko says ready to rescue Zimbabwe’s hospitals </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Ford Ranger murder: Police believe Ali Mugoya aka Arizona can help in ongoing investigation",
            "url": "https://www.newzimbabwe.com/ford-ranger-murder-police-believe-ali-mugoya-aka-arizona-can-help-in-ongoing-investigation/",
            "content": "IOL\n\nIt is more than a month afterthe shocking incident whereEmmanuel Mahambawas brutally murderedduring a fight linked to a love triangle in Joburg, and the South African Police Service (SAPS) is still investigating circumstances around the incident.\n\nThe disturbing murder was recorded in a video which went viral last month, where a grey Ford Ranger double cab bakkie was used in the attack.\n\nIn the video, widely circulated on social media platforms, Mahamba, a Zimbabwean national, is lying flat on the road surface while the Ford Ranger bakkie runs over him repeatedly. He died at the scene.\n\nGauteng police said they are searching for the motorist implicated in the brutal attack, which happened after a heated dispute.\n\nThe murder incident happened on April 5, 2025, in Rivonia, Sandton.\n\nIn the latest development, the SAPS in Gauteng has told IOL that they are seeking to interview a man called Ali Mugoya in relation to the ongoing investigation.\n\nMasondo confirmed to IOL that Mugoya is the man seen in pictures shared widely on social media.\n\nWe believe Mr Ali Mugoya, also known as Arizona, can help with our investigation, Masondo told IOL.\n\nAnyone with information regarding Mugoyas whereabouts is requested to contact the investigating officer, Constable Ndou Murabeleni on076 416 5664 or 069 591 6447.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15044513/Screenshot-2025-05-15-at-05.43.03.png",
            "description": "<p>IOL It is more than a month after the shocking incident where Emmanuel Mahamba was brutally murdered during a fight linked to a love triangle in Joburg, and the South African Police Service (SAPS) is still investigating circumstances around the incident. The disturbing murder was recorded in a video which went viral last month, where a grey Ford</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ford-ranger-murder-police-believe-ali-mugoya-aka-arizona-can-help-in-ongoing-investigation/\">Ford Ranger murder: Police believe Ali Mugoya aka Arizona can help in ongoing investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Zimbabwe crowned champions in inaugural Online Continental Chess Championships for Prisoners",
            "url": "https://www.newzimbabwe.com/zimbabwe-crowned-champions-in-inaugural-online-continental-chess-championships-for-prisoners/",
            "content": "By Sports Reporter\n\nZimbabwe was on Tuesdaycrowned the overall winner of the inaugural Online Continental Chess Championships for Prisoners.\n\nThe competition, which is played virtually, saw prisoners from different nations across Africa competing.\n\nZimbabwe scooped gold in both male and female categories, proving to be a force to reckon with at the continental level.\n\nTwo of Zimbabwes top male players, Leo Matibe and Nicholas Damota, who came second in 2021 at the Intercontinental chess online competition for prisoners, were the biggest contributors to the teams success.\n\nTeam Zimbabwes male team was undefeated on the day as it posted 6 wins and one draw, securing 13 match points and 24.5 board points.\n\nZimbabwe chess players in prisons are now shifting the focus to the upcoming Behind The Wall Chess Tournament to be played in June.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/14184628/WhatsApp-Image-2025-05-14-at-09.08.46.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe was on Tuesday crowned the overall winner of the inaugural Online Continental Chess Championships for Prisoners. The competition, which is played virtually, saw prisoners from different nations across Africa competing. Zimbabwe scooped gold in both male and female categories, proving to be a force to reckon with at the continental level. Two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crowned-champions-in-inaugural-online-continental-chess-championships-for-prisoners/\">Zimbabwe crowned champions in inaugural Online Continental Chess Championships for Prisoners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Ex-ZIPRA combatants camp in Chinhoyi, demanding seized properties shared among Zanu PF bigwigs – say VP Mohadi backing them",
            "url": "https://www.newzimbabwe.com/ex-zipra-combatants-camp-in-chinhoyi-demanding-seized-properties-shared-among-zanu-pf-bigwigs-say-vp-mohadi-backing-them/",
            "content": "By James Muonwa\n\nFORMER Zimbabwe Peoples Revolutionary Army (ZIPRA) combatants, widows and children of fallen fighters have so far spent three cold winter nights camped on a piece of land in Chinhoyi, Mashonaland West, in protest over the governments failure to facilitate the reclamation of their properties.\n\nThe land, on which a new suburb named Pearview has been established by a private land developer, reportedlybelongs to Nitram Holdings, a company established by former ZIPRA fighters after independence in 1980.\n\nNitram is a holding company formed by the ex-freedom fighters from their demobilisation payments. The veterans contributed $50 each from their demobilisation pay-outs after independence and purchased 52 properties, which include farms, hotels and buildings.\n\nIn a bid to reclaim the property allegedly seized by Zanu PF bigwigs and their cronies during the height of the Gukurahundi atrocities in the 1980s, the ex-ZIPRA combatants, led by Moffat Commander Karomo, have set up camp at a site opposite Mzari Extension, near Machamire area, in Chinhoyi.\n\nThe group numbering nearly 50, comprises former liberation struggle veterans, widows and children of those who died before and after independence.\n\nThe protestors say they will stay put for as long as it takes for whoever forcibly grabbed the property, and many others dotted across the town and countrywide, to hand over the properties to them.\n\nIn an interview with NewZimbabwe.com in Chinhoyi this Wednesday, Karomo claimed their actions, as staged recently at Glen Forest where another of Nitram properties lies, had the blessings of Vice President Kembo Mohadi.\n\nWe are here with the blessings of VP Mohadi, and we are here to take back what was illegally taken away from ZIPRA combatants, widows and their children who are wallowing in abject poverty, said Karomo.\n\nHe claimed President Emmerson Mnangagwa had tasked the veterans to identify their properties across the country so he could facilitate their repossession.\n\nIn Chinhoyi, Karomo claims that besides owning the vast land on which Pearview medium-density suburb was sited, Nitram is the legitimate owner of Old Chinhoyi Hotel and Caves Hotel, currently under the management of the Zimbabwe Parks and Wildlife Authority (ZimParks).\n\nKaromo said it has taken far too long since Mnangagwa promised to facilitate the return of Nitram Holdings stolen properties.\n\nMnangagwa must show his sincerity now. Since he instructed us to identify our properties, we are doing exactly that, thats why we are here in Chinhoyi today on one of our properties. We are not here to fight anyone, but those who took what doesnt belong to them are the ones out to fight us.\n\nIts been 45 years of being taken for a ride. We are not politicking nor engaging in factional politics. We are all Zanu PF, but we want to hear from President Mnangagwa what he has to say, now that we have identified our properties, Karomo told NewZimbabwe.com.\n\nA widow of a former ZIPRA combatant, Cecilia Moyo, said her late husband had confided in her of the vast wealth ex-guerilla fighters had accumulated courtesy of investment in Nitram Holdings.\n\nShe demanded the legacy of her children and grandchildren, which Nitram Holdings amassed under the stewardship of late Vice President Joshua Nkomo.\n\nWe are suffering from hypertension and other chronic diseases because of this matter. We are being victimised on the small plots where we were settled, yet we have all this wealth. We are suffering while some crooked people are enjoying our childrens inheritance, said Moyo.\n\nIn respect of the Chinhoyi land where the group is camped, Moyo claimed an Indian descendant only identified as Khan, now late, who was linked to late VP Nkomo, had knowledge of its ownership as well as the inventory of other Nitram Holdings properties in Mashonaland West.\n\nMoyo says the late Khans son has to answer for his father on how he transferred the disputed land to its current purported owner.\n\nFarai Madzvanya, a representative of children of war veterans, appealed to Mnangagwa to facilitate the expeditious return of the properties, an inheritance bequeathed to them by their now deceased fathers, who themselves never benefited from it.\n\nGovernment, which seized Nitram Holdings properties following the alleged discovery of arms caches at some farms in Midlands and Bulawayo provinces, is accused of dragging its feet in proceedings to return the properties to ex-ZIPRA fighters, widows and their children.\n\nTheNitram Holdings board is on record accusing some unnamed influential government officials of scuttling efforts to repossess their properties.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051629/zdf-mohadi-e1747279959354.jpeg",
            "description": "<p>By James Muonwa FORMER Zimbabwe People’s Revolutionary Army (ZIPRA) combatants, widows and children of fallen fighters have so far spent three cold winter nights camped on a piece of land in Chinhoyi, Mashonaland West, in protest over the government’s failure to facilitate the reclamation of their properties. The land, on which a new suburb named</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-zipra-combatants-camp-in-chinhoyi-demanding-seized-properties-shared-among-zanu-pf-bigwigs-say-vp-mohadi-backing-them/\">Ex-ZIPRA combatants camp in Chinhoyi, demanding seized properties shared among Zanu PF bigwigs – say VP Mohadi backing them</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Zim under-17 girls through to COSAFA Cup semi-finals",
            "url": "https://www.newzimbabwe.com/zim-under-17-girls-through-to-cosafa-cup-semi-finals/",
            "content": "By Sports Reporter\n\nZimbabwe under 17 girls team on Wednesday proceeded to the semi-finals of the COSAFA Cup tournament in Windhoek Namibia, after thrashing Lesotho 12-2.\n\nZimbabwe walked into the match as underdogs following a 3-0 defeat to Botswana on Sunday.\n\nA draw was enough for Lesotho to progress to the semi-finals, but a surprising defeat to Zimbabwe turned the tables.\n\nDee Mapuwa and Mya Munyanduki scored four goals each as Zimbabwe knocked out last years finalists, who were being favoured by odds before the match, as the young Mighty Warriors needed a clear five-goal win.\n\nZimbabwe will now face old rivals Zambia on Friday in the first semi-final, while Mozambique and Malawi clash later on the day in the second semi-final.\n\nMeanwhile, Zimbabwe under-20 girls hope of playing next years World Cup was thwarted by Rwanda on Wednesday after playing a nil-all draw at Kigali Pele stadium.\n\nThe result saw Rwanda qualify for the next round with a 2-1 aggregate from their win on Sunday in the first leg at the same venue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/15045831/cosafa.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe under 17 girls team on Wednesday proceeded to the semi-finals of the COSAFA Cup tournament in Windhoek Namibia, after thrashing Lesotho 12-2. Zimbabwe walked into the match as underdogs following a 3-0 defeat to Botswana on Sunday. A draw was enough for Lesotho to progress to the semi-finals, but a surprising</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-under-17-girls-through-to-cosafa-cup-semi-finals/\">Zim under-17 girls through to COSAFA Cup semi-finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Magistrate orders police to refund UZ lecturers fined over salary protests",
            "url": "https://www.newzimbabwe.com/magistrate-orders-police-to-refund-uz-lecturers-fined-over-salary-protests/",
            "content": "By Staff Reporter\n\nHarare magistrate Isheanesu Matova has ordered the Zimbabwe Republic Police (ZRP) to refund some admission of guilt fines, which had been paid by three University of Zimbabwe (UZ) lecturers, who were arrested last month and charged with disorderly conduct.\n\nThe arrest of the trio followed protests against poor salaries and working conditions.\n\nThe three are Professor Obvious Vengeyi, Boncase Mwakorera and Desmond Ndedzu, who are also leaders of the Association of University Teachers (AUT) at UZ.\n\nMatova has set aside the conviction of Professor Vengeyi, Mwakorera and Ndedzu and ordered ZRP to refund the admission of guilty fines each of the accused persons had paid to the law enforcement agency on 17 April 2025.\n\nIn his response to the letter written by Kabaya, Chibwe and Chinopfukutwa, Magistrate Matova ordered that a full trial should be conducted, where the trio will answer to charges of disorderly conduct in a public place as defined in section 41 of the Criminal Law (Codification and Reform) Act and asked the District Public Prosecutor to ensure that the UZ lecturers are prosecuted in the ordinary course, said Zimbabwe Lawyers for Human Rights in a statement.\n\nUpon arrest, ZRP officers accused Professor Vengeyi, Mwakorera and Ndedzu of breaching the countrys laws when they allegedly picketed together with other UZ lecturers on 16 April 2025, demanding improved working conditions and salary increments.\n\nProfessor Vengeyi, Mwakorera and Ndedzu, who were represented by Kelvin Kabaya, Emmanuel Lawrence Chibwe and Tinashe Chinopfukutwa of Zimbabwe Lawyers for Human Rights, resorted to paying admission of guilt fines amounting to US$15 each, to secure their release and to avert the rigours of pre-trial detention over lawful conduct during the Easter holidays.\n\nOn 22 April 2025, the trios lawyers challenged the confirmation of the admission of guilt fines paid, writing a letter to the Provincial Magistrate at Harare Magistrates Court as provided for in terms of section 356 of the Criminal Procedure and Evidence Act, on the grounds that the trade unionists actions, were protected by the Labour Act and that they only paid the fines to secure their liberty.\n\nIn their letter, the human rights lawyers argued that they were protecting the trios right to collective job action as provided for in section 65 of the Constitution.\n\nKabaya, Chibwe and Chinopfukutwa argued that they would be available to defend the trade unionists should any criminal charges be preferred against them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Staff Reporter Harare magistrate Isheanesu Matova has ordered the Zimbabwe Republic Police (ZRP) to refund some admission of guilt fines, which had been paid by three University of Zimbabwe (UZ) lecturers, who were arrested last month and charged with disorderly conduct. The arrest of the trio followed protests against poor salaries and working conditions.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magistrate-orders-police-to-refund-uz-lecturers-fined-over-salary-protests/\">Magistrate orders police to refund UZ lecturers fined over salary protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Sculpture show returns to Kingham Lodge with art from UK and Zimbabwe",
            "url": "https://www.newzimbabwe.com/sculpture-show-returns-to-kingham-lodge-with-art-from-uk-and-zimbabwe/",
            "content": "Oxford Mail\n\nEngland  A POPULAR sculpture show is returning next week.\n\nBeginning on Saturday, May 17, the Sculpture at Kingham Lodge event will run until Monday, May 26, attracting thousands from across south and mid-England.\n\nNow in its 14th year, the exhibition will showcase the work of 62 British sculptors, alongside pieces from 60 Zimbabwean artists and 32 local schools.\n\nVisitors can expect a variety of artworks in stone, glass, pottery, steel, and resin, with prices ranging from 10 to 13,000.\n\nThe show is not just for those with large gardens; many pieces are suitable for indoor display on windowsills or fireplaces.\n\nBesides the artwork, visitors can enjoy the six-acre private gardens of Kingham Lodge, which are only open to the public for this event.\n\nThe gardens feature a variety of plant life, including a large collection of rhododendrons and azaleas, which will be in bloom during the exhibition.\n\nThe sculptures are integrated throughout the gardens and in the central Moorish Pavilion.\n\nRefreshments, including cakes, scones, and soup will be available.\n\nProceeds from the show will support various charities, including Helen and Douglas House childrens hospice and Cotswolds Arts Through Schools, which are working with over 8,000 local children.\n\nTickets for either morning or afternoon admission can be purchased from the Sculpture at Kingham Lodge website.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/14160725/Screenshot-2025-05-14-at-17.06.42.png",
            "description": "<p>Oxford Mail England – A POPULAR sculpture show is returning next week. Beginning on Saturday, May 17, the Sculpture at Kingham Lodge event will run until Monday, May 26, attracting thousands from across south and mid-England. Now in its 14th year, the exhibition will showcase the work of 62 British sculptors, alongside pieces from 60</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sculpture-show-returns-to-kingham-lodge-with-art-from-uk-and-zimbabwe/\">Sculpture show returns to Kingham Lodge with art from UK and Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Three years after a deadly measles epidemic, Zimbabwe sees renewed resolve to fight the virus",
            "url": "https://www.newzimbabwe.com/three-years-after-a-deadly-measles-epidemic-zimbabwe-sees-renewed-resolve-to-fight-the-virus/",
            "content": "By Enos Denhere | VaccinesWork\n\nZimbabwes recovery from a deadly 2022 measles outbreak shows how community engagement, religious partnerships and education transformed vaccine hesitancy into proactive health-seeking behaviour nationwide.\n\nAmai Nyashas first-born was nine years old in in April 2022, when a ferocious measles outbreak began, soon sweeping through all ten provinces of Zimbabwe.By early October, thousandsof people had been infected, andmore than 750 childrenhad been killed.\n\nI didnt wait  I took her in for vaccination right away, recalled Amai Nyasha at a recent routine immunisation session at a clinic in Budiriro, Harare. Three years had passed, and she was back with her young son. This time, it hadnt taken the pressing threat of a deadly epidemic to prompt preventive action. The awareness campaigns helped me make the right decision, she said.\n\nFor health workers and parents alike, the memory of the 2022 measles epidemic is a sobering one. Routine immunisation had been severely disrupted during the COVID-19 pandemic. In some communities, especially among apostolic religious groups, vaccine resistance had grown.\n\nThe outbreak was a tragic wake-up call, said Dr Aspect J.V. Maunganidze, Permanent Secretary in theMinistry of Health and Child Care (MoHCC). It showed us where our systems were weak, but it also forced us to act decisively.\n\nIn immediate response to the ballooning epidemic, the government launched a two-phase nationwide measles vaccination campaign. In the first phase, targeting children under five years, 1,970,123 children (85.9% of the 2,292,898 target) were vaccinated. The second phase, rolled out in early 2023, focused on older children, aged 5 to 14, in high-risk districts such as Chipinge, Gutu, Mazowe and Chiredzi.\n\nWere not just reacting anymore. Were building systems that prevent, that educate, that respond faster.\n\n Sister Ratowa\n\nThese figures, provided by the MoHCC, demonstrate a rapid and determined scaling-up of efforts. But behind the numbers lies a deeper human story  one of fears faced, myths dispelled and communities rallied.\n\nIn Budiriro, a densely populated suburb of Harare, the epidemic felt close and personal. Wilbert Mavhunga, a carpenter whose workshop is just steps from the Budiriro Polyclinic, recalls the uncertainty that spread faster than the virus itself. Rumours were everywhere, he said. People were saying the measles vaccines were actually COVID-19 vaccines in disguise.\n\nThe generalised sense of anxiety of the pandemic had left many families gripped by confusion, and trust between communities and the healthcare system frayed. But health workers, trained in community engagement, launched a door-to-door initiative to combat hesitancy.\n\nThey patiently explained the risks of measles and how vaccines could protect our children, said Mavhunga. Eventually, my wife and I agreed  it was better to act than to fear. Today, Im thankful we did.\n\nSister Mayoyo, Family Health Services In-Charge at Budiriro Polyclinic, oversaw much of this grassroots effort. We targeted children from four months to fifteen years, visiting homes and organising local clinics, she said. Education was our first tool. We wanted people not just to vaccinate, but to understand why.\n\nReligious engagement proved pivotal. Apostolic communities, which have historically resisted vaccinations, were approached not with judgement, but with empathy and partnership.\n\nWe reached out to church leaders respectfully, said Sister Ratowa, head of maternity services at Budiriro. We promised that there would be no media attention on their vaccination participation, which helped build trust.\n\nAt monthly baby clinics, mothers received consistent education on the importance of vaccines. These sessions allowed health staff to answer concerns directly, helping shift public opinion over time.\n\nVaccines are free and accessible. But access must be matched with trust. Thats where our ongoing engagement comes in.\n\n Dr Maunganidze\n\nDr Maunganidze echoed the importance of these partnerships. We worked closely with interfaith groups  Catholics, Muslims, Traditionalists, Apostolics. They cascaded health messages to their congregations, and that made all the difference.\n\nThe interfaith coalition included the Zimbabwe Council of Churches, Catholic Bishops Conference, UDACIZA, and Islamic Council, among others. Their participation helped bridge cultural divides and brought hesitant communities into the fold.\n\nIn every successful campaign, leadership on the ground matters. Francis Musiyiwa, a respected elder and religious leader in Budiriro, played a key role in reaching local apostolic families.\n\nI knew our people needed reassurance, said Musiyiwa. They trust church leaders more than anyone. So, I spoke to leaders of churches, organised meetings, and even shared information in our WhatsApp groups.\n\nMusiyiwas efforts helped shift the tone of the conversation from suspicion to protection. Every message shared was a chance to save a childs life, he said. His commitment left a lasting impression on his community.\n\nThe campaigns impact in Budiriro was striking. The area is home to 1,754 children under one year, 6,023 children aged one to four, and 19,061 under the age of 15.\n\nWere not just fighting measles. Were building a healthier future  child by child, family by family, door by door.\n\n Sister Mayoyo\n\nThanks to strong community engagement, Budiriro reached close to 100% coverage during the height of the outbreak, according to local health staff. Vaccines were transported using mobile teams equipped with vaccine carriers and ice packs. When overwhelmed, clinics hired additional staff to maintain the response.\n\nHealth teams are now better prepared for future outbreaks. Were not just reacting anymore, said Sister Ratowa. Were building systems that prevent, that educate, that respond faster.\n\nZimbabwe is planning a root cause analysis of vaccine-preventable disease outbreaks in June 2025. The findings will feed into a national multi-year plan to improve immunisation infrastructure, access and education.\n\nAmong the priorities are building health posts in underserved areas, expanding mobile outreach and continuous capacity-building for health personnel.\n\nVaccines are free and accessible, emphasised Dr Maunganidze. But access must be matched with trust. Thats where our ongoing engagement comes in.\n\nThe 2022 measles outbreak laid bare Zimbabwes public health vulnerabilities. But instead of despair, the country responded with resolve.\n\nFor parents like Amai Nyasha, for leaders like Francis Musiyiwa, and for health staff like Sisters Mayoyo and Ratowa, this chapter is not the end  but a beginning.\n\nWere not just fighting measles,said Sister Mayoyo. Were building a healthier future  child by child, family by family, door by door.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/14161504/sister-mayoyo-sister-ratowa_edenhere.jpg",
            "description": "<p>By Enos Denhere | VaccinesWork Zimbabwe’s recovery from a deadly 2022 measles outbreak shows how community engagement, religious partnerships and education transformed vaccine hesitancy into proactive health-seeking behaviour nationwide. Amai Nyasha’s first-born was nine years old in in April 2022, when a ferocious measles outbreak began, soon sweeping through all ten provinces of Zimbabwe. By early</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-years-after-a-deadly-measles-epidemic-zimbabwe-sees-renewed-resolve-to-fight-the-virus/\">Three years after a deadly measles epidemic, Zimbabwe sees renewed resolve to fight the virus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        },
        {
            "title": "Zimbabwe to get first dollar-listed REIT as property heats up",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-get-first-dollar-listed-reit-as-property-heats-up/",
            "content": "Bloomberg\n\nZimbabwe is set to get its first dollar-denominated real estate investment trust listing on Friday, as demand for property stocks grows.\n\nEagle REIT is seeking to raise $62 million from the listing on Zimbabwes US dollar-denominated Victoria Falls Exchange, said Bevin Ngara, managing director of Fidelity Life Asset Management Co., the property companys fund manager. It has already secured $24.5 million through a private placement and will use the money for projects in the resort city of Victoria Falls and Mazowe, according to a pre-listing statement.\n\nVFEX was chosen over the southern African nations local-currency bourse in Harare, the capital, as its easier to showcase value creation in dollars than in an emerging currency, Ngara said by text message on Wednesday.\n\nThe Zimbabwe Stock Exchange has two REIT listings  Tigere Property Fund and Revitus.\n\nInstitutional investors have been plowing into property stocks as a hedge against policy uncertainty, inflation and frequent currency crashes. Zimbabwe debuted the gold-backed ZiG last year, its sixth attempt at a functioning local currency since 2009.\n\nFunds under management invested in property increased to 47% in the final quarter of 2024 from 43.6% in the prior three months, according to the Securities and Exchange Commission of Zimbabwe, the industry regulator.\n\nREITs have become more popular than traditional asset classes, such as direct property ownership, listed equities and the money market, Ngara said.\n\nThey are particularly attractive as they can be sold much faster than physical property, said Lloyd Mlotshwa, head of research at IH Securities. They also frequently pay dividends, letting investors earn income from property without owning or managing it directly.\n\nInstitutional investors are more concerned about consistent dividend payments than capital gains, Ngara said. REITs guarantee consistent dividend payments.\n\nThese attributes have also made REITs popular in other destinations. Dubai Residential REIT recently drew demand for all units on offer within minutes.\n\nVFEX Chief Executive Officer Justin Bgoni said the exchange expects another REIT listing soon, declining to provide further details.\n\nThe Tigere REIT, listed in 2022, whetted institutional investors appetite for the asset class, Mlotshwa said. It will pay its 10th dividend to unit holders later this month.\n\nIn its first-quarter trading update, Tigere said, property remains the favored option for Zimbabwean investors seeking protection from currency shocks and foresees continued interest from individuals, corporates and pension funds looking for tangible exit options.\n\nConcerns of widespread price overheating within the sector are overstated, it said, noting pervasive supply-side gaps in key subsegments such as warehousing, affordable housing, quality retail infrastructure and office space.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/23081422/zse.jpeg",
            "description": "<p>Bloomberg Zimbabwe is set to get its first dollar-denominated real estate investment trust listing on Friday, as demand for property stocks grows. Eagle REIT is seeking to raise $62 million from the listing on Zimbabwe’s US dollar-denominated Victoria Falls Exchange, said Bevin Ngara, managing director of Fidelity Life Asset Management Co., the property company’s fund</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-get-first-dollar-listed-reit-as-property-heats-up/\">Zimbabwe to get first dollar-listed REIT as property heats up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:11",
            "date": "15 May 2025"
        }
    ]
}