{
    "news": [
        {
            "title": "Israel has committed genocide in Gaza, UN commission of inquiry says",
            "url": "https://www.newzimbabwe.com/israel-has-committed-genocide-in-gaza-un-commission-of-inquiry-says/",
            "content": "BBC\n\nA United Nations commission of inquiry says Israel has committed genocide against Palestinians in Gaza.\n\nA new report says there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023: killing members of a group, causing them serious bodily and mental harm, deliberately inflicting conditions calculated to destroy the group, and preventing births.\n\nIt cites statements by Israeli leaders, and the pattern of conduct by Israeli forces, as evidence of genocidal intent.\n\nIsraels foreign ministry said it categorically rejected the report, denouncing it as distorted and false.\n\nThe Israeli military launched a campaign in Gaza in response to the unprecedented Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 were taken hostage.\n\nAt least 64,964 people have been killed in Israeli attacks in Gaza since then, according to the territorys Hamas-run health ministry, whose figures are seen as reliable by the UN.\n\nMost of the population has also been repeatedly displaced; more than 90% of homes are estimated to be damaged or destroyed; the healthcare, water, sanitation and hygiene systems have collapsed; and UN-backed food security experts have declared a famine in Gaza City.\n\nReuters The mother of a Palestinian teenager killed by Israeli fire mourns during his funeral at a hospital in Gaza City in August\n\nThe Independent International Commission of Inquiry on the Occupied Palestinian Territory was established by the UN Human Rights Council in 2021 to investigate all alleged violations of international humanitarian and human rights law.\n\nThe three-member expert panel is chaired by Navi Pillay, a South African former UN human rights chief who was president of the international tribunal on Rwandas genocide. The two other members are Chris Sidoti, an Australian human rights lawyer, and Miloon Kothari, an Indian expert on housing and land rights.\n\nThe commission has previously concluded that Hamas and other Palestinian armed groups committed war crimes and other grave violations of international law on 7 October 2023, and that Israeli security forces have committed crimes against humanity and war crimes in Gaza.\n\nThe commission saidits latest reportwas the strongest and most authoritative UN finding to date on the war. However, it does not officially speak for the UN.\n\nThe 72-page document alleges that Israeli authorities and Israeli security forces have committed and are continuing to commit four of the five acts of genocide defined under the 1948 Genocide Convention against a national, ethnic, racial or religious group  in this case, Palestinians in Gaza:\n\nTo fulfil the legal definition of genocide under the Genocide Convention, it must also be established that the perpetrator committed any one of those acts with specific intent to destroy the group in whole or in part.\n\nWe went to the facts first, Pillay told the BBC. So we looked at statements made by the Israeli authorities indicating genocidal intent. And we looked at the pattern of conduct of Israeli authorities and Israeli security forces to show that genocidal intent was the only reasonable inference.\n\nIsraels political and military leaders have consistently said its militarys operations in Gaza are conducted in self-defence, to defeat Hamas and other Palestinian armed groups, and to secure the release of Israeli hostages.\n\nThey have also insisted that Israeli forces operate in accordance with international law and take all feasible measures to mitigate harm to civilians.\n\nHowever, the commissions report concludes that President Isaac Herzog, Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant have incited the commission of genocide in their speeches and statements.\n\nAs early as 7 October 2023, Prime Minister Netanyahu vowed to inflict mighty vengeance on all of the places where Hamas is deployed, hiding and operating in, that wicked city, we will turn them into rubble, Pillay said.\n\nHis use of the phrase wicked city in the same statement implied that he saw the whole city of Gaza [Gaza City] as responsible and a target for vengeance. And he told Palestinians to leave now because we will operate forcefully everywhere.\n\nGallant said days after 7 October 2023 that Israel was fighting human animals, and we act accordingly. Herzog meanwhile stated that its an entire nation out there that is responsible for the Hamas-led attack.\n\nReuters The Israeli military has ordered hundreds of thousands of Palestinians to evacuate Gaza City ahead a ground offensive to conquer it\n\nThe commission also says genocidal intent was the only reasonable inference that could be concluded from the pattern of conduct of Israeli authorities and security forces in Gaza.\n\nThat has allegedly included intentionally killing and seriously harming an unprecedented number of Palestinians using heavy munitions; systematic and widespread attacks on religious, cultural and education sites; imposing a siege on Gaza and starving its population.\n\nPillay added: It took us two years to gather all the actions and make factual findings, verify whether that had happened Its only the facts that will direct you. And you can only bring it under the Genocide Convention if those acts were done with this intention.\n\nThe commission says the acts of Israeli political and military leaders are attributable to the State of Israel, and that the state therefore bears responsibility for the failure to prevent genocide, the commission of genocide and the failure to punish genocide.\n\nIt also warns all other countries have an immediate obligation under the Genocide Convention to prevent and punish the crime of genocide, employing all measures at their disposal. If they do not, it says, they could be complicit.\n\nIn a statement, the Israeli foreign ministry accused the three members of the commission of serving as Hamas proxies.\n\nThe report relies entirely on Hamas falsehoods, laundered and repeated by others. These fabrications have already been thoroughly debunked, it said.\n\nIn stark contrast to the lies in the report, Hamas is the party that attempted genocide in Israel  murdering 1,200 people, raping women, burning families alive, and openly declaring its goal of killing every Jew.\n\nAn Israeli military official dismissed the report as baseless, saying: No other country has operated in these conditions and done so much to prevent harm to civilians on the battlefield.\n\nPresident Herzog also condemned the report, which he said had misinterpreted his words, according to Reuters news agency.\n\nThe Israeli foreign ministry also said that the commissions members should not be replaced when they step down from their roles later this year, and that the commission itself should instead be abolished.\n\nIn July, all three members submitted their resignations to the UN Human Rights Council. Pillay, who is 83, cited her age, medical issues and the weight of several other commitments, while Sidoti said her retirement marked an appropriate time to reconstitute the commission.\n\nA number of international and Israeli human rights organisations, independent UN experts, and scholars have also accused Israel of genocide against Palestinians in Gaza.\n\nThe UN says it cannot make a legal determination as to whether a situation constitutes genocide under international law. It says a situation is referred to as genocide only after a competent national or international court has declared it as such.\n\nWhen asked by journalists on Tuesday if he would consider using the word genocide to describe Israels actions in Gaza, UN human rights chief Volker Trk said: Its for the court to decide whether its genocide or not, and we see the evidence mounting.\n\nA spokesman for the UK government also said the decision was up to a court, but added that this does not take away from our position that Israels actions are appalling.\n\nThe International Court of Justice (ICJ) is currently hearing a case brought by South Africa that accuses Israeli forces of genocide, but it could take years to reach a conclusion. Israel has called the case wholly unfounded and based on biased and false claims.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/29045412/gaza.jpeg",
            "description": "<p>BBC A United Nations commission of inquiry says Israel has committed genocide against Palestinians in Gaza. A new report says there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023: killing members of a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/israel-has-committed-genocide-in-gaza-un-commission-of-inquiry-says/\">Israel has committed genocide in Gaza, UN commission of inquiry says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "17 Sep 2025"
        },
        {
            "title": "Mufakose residents forced to vacate homes as raw sewage floods yards",
            "url": "https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/",
            "content": "By Darlington Gatsi\n\nFRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges.\n\nMufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation.\n\nCombined Harare Residents Association (CHRA) blasted the lackadaisical approach by the city fathers in addressing the plight of Mufakose residents.\n\nThe City of Harare has been reluctant to resolve the issue, and the residents continue to be affected since registering their first complaint with the Mufakose District office a month ago.\n\nThe situation is dire to the extent that some residents have since vacated their houses following the flow and flooding of their houses with raw sewerage.\n\nUnfortunately, residents have now resorted to open defecation in bushes as an alternative, since their toilets and bathrooms are no longer accessible due to sewer flooding and gushing from toilets, said CHRA in a statement.\n\nThis comes amid reports that Harare City Council employees are on strike, having declared incapacitation following the deaths of colleagues.\n\nHarare residents have been made to endure the city fathers failure to deliver services to the capitals populace.\n\nThe CHRA said the situation is a ticking time bomb that might cause disease outbreaks in the high-density area of Mufakose.\n\nFormal and informal complaints have been made to the local City of Harare District Officer but have yielded no result in addressing the sewerage bursts/blockages.\n\nWe are of the view that the following rights provided in Chapter 4 of the Constitution of Zimbabwe are being infringed or being violated;\n\nSection 73(1) Right to an environment that is not harmful to health or wellbeing; the magnitude of the sewerage bursts are exposing residents to waterborne diseases, and so far residents who reside in Nondo Street have been complaining of stomach pains and diarrhoea and the epicentre of the diarrhoea cases is Nondo Street.\n\nHouses are no longer habitable and at No 18 and 16 Nondo Street residents have evacuated from their houses, and the houses are no longer occupied due to the flooding of the sewer in the houses and yards. In addition, the stench coming out from the sewer is choking, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16215440/mufakose.jpeg",
            "description": "<p> By Darlington Gatsi FRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges. Mufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation. Combined Harare Residents Association (CHRA) blasted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/\">Mufakose residents forced to vacate homes as raw sewage floods yards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "17 Sep 2025"
        },
        {
            "title": "Blue Ribbon stops operations at Bulawayo plant due to grain shortage",
            "url": "https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/",
            "content": "By Staff Reporter\n\nOne of Zimbabwes largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain.\n\nThe shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of grain in April this year.\n\nGrain Millers Association of Zimbabwe (GMAZ) Southern Region Chairperson David Moyo painted a bleak picture of dwindling local maize supplies.\n\nAt the beginning, we were able to buy from local farmers and the maize was there.\n\nBut now, it is hard to fill a 30-tonne truck. Sometimes you get three or two 50kg bags a day. It takes a week to fill a truck, said Masuka.\n\nIn response to appeals from millers the government recently lifted the ban on maize imports.\n\nHowever, a new statutory instrument introduced to govern imports has created further complications.\n\nThe regulation imposes a levy on the price difference between imported maize (US$300/tonne from South Africa) and the local producer price (US$200/tonne), payable to the Agricultural Marketing Authority (AMA).\n\nMoyo says this measure is making it financially unviable for millers to import the maize they desperately need to keep their plants operational.\n\nThe statutory instrument is unfair and costly. Eventually, the burden will be passed on to the consumer, Moyo said.\n\nWe are simply asking the government to allow millers to import maize freely, without these added levies, as was previously the case.\n\nHe further emphasised that deregulating the maize import framework would allow market forces to determine prices, ultimately lowering the cost of mealie meal for consumers.\n\nThe private sector is here to complement the government. We are partners in ensuring that no Zimbabwean goes hungry in line with the Presidents own promise that no one will be left behind, Moyo said.\n\nThe continued closure of key milling plants like Blue Ribbon in Bulawayo not only threatens food security in urban areas but also risks job losses and rising mealie meal prices at a time when most households are already battling inflation and economic hardship.\n\nMillers are now calling on the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development to urgently review the statutory instrument and allow for flexible, cost-effective maize importation to stabilise the milling industry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16221910/blue-ribbon.jpg",
            "description": "<p>By Staff Reporter One of Zimbabwe’s largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain. The shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/\">Blue Ribbon stops operations at Bulawayo plant due to grain shortage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "17 Sep 2025"
        },
        {
            "title": "ZPC staff in US$3.9 million property theft scandal, accomplice on the run",
            "url": "https://www.newzimbabwe.com/zpc-staff-in-us3-9-million-property-theft-scandal-accomplice-on-the-run/",
            "content": "By Mary Taruvinga\n\nTwo senior Zimbabwe Power Company (ZPC) employees have appeared in court in Hwange facing charges of stealing company property worth US$3,896,000 in what the state has described as a serious act of economic sabotage.\n\nStores Officer Tawanda Mhaka and Loss Control Assistant Ruth Chiyani were arrested on September 11, 2025, after CCTV footage allegedly captured them facilitating the illegal loading of 15 electric motors, 48 tonnes of brass pipes, and a metal container at the Turbine Hall in August.\n\nAccording to the state, the goods were transported in haulage trucks hired by their alleged accomplice, Hardlife Zimwenje, who remains at large.\n\nOn the 22nd and 23rd of August 2025, a truck was captured on CCTV at the Turbine Hall loading stolen goods without proper documentation. The footage clearly shows the accused overseeing the movement of property valued at nearly US$4 million, the court heard.\n\nProsecutors said Chiyani, whose role was to ensure security compliance, failed to provide invoices to justify the movement of the items, while Mhaka allegedly instructed a boilermaker to cut an electric motor and a storage container to make them easier to load.\n\nThe state argued that the pair abused their trusted positions within ZPC.\n\nThis case serves as a clear example of the accountability required of those entrusted with national assets. Economic sabotage will be thoroughly investigated and those responsible will face serious consequences, said the National Prosecuting Authority.\n\nBoth Mhaka and Chiyani were remanded in custody to September 26, with prosecutors stressing that the evidence against them, including CCTV footage and signed removal authority documents,is overwhelming.\n\nMeanwhile, police said a manhunt is underway for Zimwenje, who allegedly orchestrated the transportation of the stolen property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/26060453/Hwange-Court-e1598418323467.jpg",
            "description": "<p>By Mary Taruvinga Two senior Zimbabwe Power Company (ZPC) employees have appeared in court in Hwange facing charges of stealing company property worth US$3,896,000 in what the state has described as a serious act of economic sabotage. Stores Officer Tawanda Mhaka and Loss Control Assistant Ruth Chiyani were arrested on September 11, 2025, after CCTV</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zpc-staff-in-us3-9-million-property-theft-scandal-accomplice-on-the-run/\">ZPC staff in US$3.9 million property theft scandal, accomplice on the run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "17 Sep 2025"
        },
        {
            "title": "Kavango Resources reports wider loss on higher exploration spending",
            "url": "https://www.newzimbabwe.com/kavango-resources-reports-wider-loss-on-higher-exploration-spending/",
            "content": "By Alois Vinga\n\nKavango Resources PLC reported a significantly widened interim loss as higher exploration costs offset revenue gains from its gold projects in Zimbabwe and Botswana.\n\nThe London-listed explorer posted a pretax loss of US$6.1 million for the six months to 30 June, compared with US$1.7 million a year earlier. Revenue rose to US$420,000 from US$209,000, but pre-licence exploration expenses increased to US$4.8 million from US$1.1 million. Cost of sales also grew sharply to US$830,000 from US$168,000, while administrative costs eased to US$661,000 from US$1.0 million.\n\nDuring the period, the company drilled more than 9,000 metres at its Hillside gold project in Zimbabwe and began construction of a 50-tonne-per-day processing plant at the Bills Luck mine. At its Nara project, Kavango completed a second drilling phase and exercised an option to acquire 45 claims for US$4 million, with completion expected by December.\n\nIn Botswana, Kavango concluded a collaboration with First Quantum Minerals at the Karakubis copper project, where it has now defined final drill targets for a follow-up programme planned in 2025.\n\nThe company strengthened its balance sheet with GBP6.6 million raised through a share issue in January, a USD5 million interest-free convertible loan from Zimbabwean pension funds in April, and a further GBP2.3 million fundraising in September.\n\nKavango said it will begin a new resource drilling campaign at Bills Luck. Shares were down 5.0% at 0.95 pence in London on Tuesday afternoon.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Kavango Resources PLC reported a significantly widened interim loss as higher exploration costs offset revenue gains from its gold projects in Zimbabwe and Botswana. The London-listed explorer posted a pretax loss of US$6.1 million for the six months to 30 June, compared with US$1.7 million a year earlier. Revenue rose to US$420,000</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-reports-wider-loss-on-higher-exploration-spending/\">Kavango Resources reports wider loss on higher exploration spending</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "17 Sep 2025"
        },
        {
            "title": "Industry welcomes cutback on repetitive licensing fees",
            "url": "https://www.newzimbabwe.com/industry-welcomes-cutback-on-repetitive-licensing-fees/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) has applauded the governments decision to reduce and eliminate several repetitive licensing fees, a move it says will significantly improve the ease of doing business.\n\nFinanceMinister Mthuli Ncube last week announced a package of reforms aimed at lowering compliance costs, particularly within the agricultural value chain.\n\nUnder the new measures, the US$500 registration fee for small-scale farmers has been scrapped, while the annual dairy processor registration fee of US$350 has been replaced with a one-off US$50 charge. Feed manufacturing registration fees have been cut from US$250 to US$20, and livestock movement clearance fees have been halved from US$10 to US$5 per herd.\n\nOther changes include a reduction of the livestock genetics import permit from US$100 to US$20, and a cut to the meat export registration fee from US$500 to US$100. The food handler certificate fee has been abolished, while Environmental Impact Assessment (EIA) costs have been capped at 0.05 percent, with a ceiling of US$100,000.\n\nCZI described the reforms as one of the most significant in recent years. According to the industry body, a total of 96 regulations affecting livestock farming, dairy production, processing, and stockfeed manufacturing were reviewed. Of these, 34 were eliminated, and 40 percent were reduced by at least half.\n\nFor dairy farming, nine regulations were eliminated and seven more were cut significantly. In livestock farming, 45 percent of regulations were scrapped, immediately lifting a huge burden on producers, CZI said.\n\nThe review found that compliance costs in some areas had been reduced by up to 99 percent. The Zimbabwe National Water Authority (ZINWA) accounted for the highest number of eliminated regulations at 10, followed by local authorities with eight and the Environmental Management Agency (EMA) with seven. At least 12 high-cost regulationspreviously charging over US$400 eachwere scrapped, while turnover-based levies were capped to avoid penalising larger firms.\n\nRemoving disproportionate charges was critical. The size of a company does not automatically translate into higher enforcement costs, and the new system finally reflects that reality, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) has applauded the government’s decision to reduce and eliminate several repetitive licensing fees, a move it says will significantly improve the ease of doing business. Finance Minister Mthuli Ncube last week announced a package of reforms aimed at lowering compliance costs, particularly within the agricultural value chain.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industry-welcomes-cutback-on-repetitive-licensing-fees/\">Industry welcomes cutback on repetitive licensing fees </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "17 Sep 2025"
        }
    ]
}