{
    "news": [
        {
            "title": "Zion Apostolic Church’s efforts to sue Chirumanzu RDC for contempt fail",
            "url": "https://www.newzimbabwe.com/zion-apostolic-churchs-efforts-to-sue-chirumanzu-rdc-for-contempt-fail/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by the Zion Apostolic Sect which was suing Chirumanzu Rural District Council (RDC) for contempt of court following a US$900,000 property deal gone wrong.\n\nSitting at the Masvingo High Court, Justice Jester Charewa threw out the application, ruling that there is no evidence.\n\nThe judge said that while it is true that the pace of compliance with a court order by the RDC has been painfully slow, there has, nevertheless, been substantial compliance.\n\nAccordingly, as at the time of the hearing, the burden of the required full compliance, which forms the basis of this application rests heavily on the applicant itself: to first fulfil the transfer requirements.\n\nOn balance, therefore, I cannot, in the circumstances, find that the respondent can be held to be in contempt as there is no evidence of a failure to disobey a clear and unambiguous court order, but rather, evidence of tardy compliance coupled by applicant itself failing to fulfil transfer requirements.\n\nConsequently, wilfulness and mala fides being presumed from a failure to comply with a court order, I am of the view that the respondent has discharged the onus that it did comply with the court order, said the judge before she threw the application.\n\nThe background is that on 2 October 2017, the parties entered into a deed of settlement in HC1245/17, wherein the church had sued the respondent for payment of US$900,000.00.\n\nThe settlement was to the effect that in lieu of the monetary claim, and in full and final settlement of any claims between the parties, the respondent would allocate and, within a reasonable time, transfer (at applicants cost) two institutional stands to applicant.\n\nFurther,Chirumanzu RDCwould fence off its sewer ponds within the applicants farm withinsixmonths of the date of the deed of settlement.\n\nZion Apostolic Church said the RDCfailed to adhere to the terms of the deed of settlement.\n\nThe church was, accordingly and upon suing for specific performance on the deed of settlement, granted an order on 19 April 2023.\n\nThe order required the RDC to allocate and transfer two institutional standswithin 14 days of the grant of the order.\n\nIt was also supposed to fence off, with a fence appropriate to keep wild animals and the applicants livestock from consuming sewer pond water, sewer ponds located in the applicants farm within 30 days of the grant of the order.\n\nIt is this order that thechurch wanted the RDCto be held in contempt of.\n\nChirumanzu RDC argued that the order it was allegedto be in contempt of was not served upon it.\n\nThe RDC also said it was not in contemptas itwasactually complying with the court order, having allocated stand number 2861 as ordered, and stand number 4434 in lieu of Stand 2356, to the applicant; erected the fence around the sewer ponds as ordered and settled costs of suit.\n\nChirumanzu RDC also said it wasonly now awaitingthe churchsapplicants compliance with transfer requirements (which include meeting minimum construction requirements) in order to effect transfer, an argument which was accepted by the judge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by the Zion Apostolic Sect which was suing Chirumanzu Rural District Council (RDC) for contempt of court following a US$900,000 property deal gone wrong. Sitting at the Masvingo High Court, Justice Jester Charewa threw out the application, ruling that there is no evidence. The judge</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zion-apostolic-churchs-efforts-to-sue-chirumanzu-rdc-for-contempt-fail/\">Zion Apostolic Church’s efforts to sue Chirumanzu RDC for contempt fail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        },
        {
            "title": "X restricted in Tanzania after police targeted by hackers",
            "url": "https://www.newzimbabwe.com/x-restricted-in-tanzania-after-police-targeted-by-hackers/",
            "content": "BBC\n\nAccess to the social media platform X has been restricted in Tanzania after some official accounts of government and private institutions were targeted by hackers.\n\nOn Tuesday, the official police account was compromised, with sexually explicit material and false information that the president had died being posted.\n\nThe police dissociated itself from the information and said an investigation was under way to identify those responsible.\n\nHours later data from the internet monitoring organisationNetblocks showed that X was unreachable on major internet providersacross the country.\n\nUsers in Dar es Salaam, the countrys biggest city, could still not access the site on Wednesday, unless they use virtual private networks (VPNs), which is illegal without a permit, although some people in other regions indicated they were able to log on.\n\nThe authorities have not commented on whether they are blocking access to X.\n\nBut Information Minister Jerry Silaa has acknowledged the hacking and assured MPs in parliament that the affected government social media accounts had since been secured.\n\nEarlier, government spokesman Gerson Msigwa warned those responsible that immediate action was being taken.\n\nThe problems with accessing X come amid the continued uproar over the deportation of prominent Kenyans  a move that prevented them from attending the court case of opposition leader Tundu Lissu, who is accused of treason.\n\nOn Monday, the presidentwarned activists from its northern neighbourthat she would not allow them to meddle in her countrys affairs and cause chaos.\n\nShe spoke after Kenyas former Justice Minister Martha Karua along with some others, who had all travelled to attend Lissus court case, were deported.\n\nAnother Kenyan activist, Boniface Mwangi, and Ugandan Agather Atuhaire were arrested in Dar es Salaam by suspected military officers on Monday and their whereabouts remain unknown.\n\nTanzanian authorities have not commented on their whereabouts.\n\nMwangis wife, Njeri, told the BBCs Newsday programme that she had last heard from him on Monday and had not been able to establish where he was.\n\nIm actually concerned for his life. I know my husband, he would have communicated, hed find a way to call or text me and because he hasnt, makes me very worried about what state he is in, she said.\n\nBoniface Mwabukusi, the president of the Tanganyika Law Society, the body representing lawyers in mainland Tanzania, said on Wednesday that they had learnt that the two were being held by the immigration department. He had earlier said they had been deported.\n\nOur legal team on the ground is actively monitoring the situation and exploring appropriate legal remedies to facilitate a just and timely resolution, he said on X.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22052550/tanzania-police.webp",
            "description": "<p>BBC Access to the social media platform X has been restricted in Tanzania after some official accounts of government and private institutions were targeted by hackers. On Tuesday, the official police account was compromised, with sexually explicit material and false information that the president had died being posted. The police dissociated itself from the information</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/x-restricted-in-tanzania-after-police-targeted-by-hackers/\">X restricted in Tanzania after police targeted by hackers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        },
        {
            "title": "US singer Chris Brown granted $6.7 million bail for world tour by UK court",
            "url": "https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/",
            "content": "U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22052415/chris-brown.jpg",
            "description": "<p>Reuters U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month. Brown has been charged with inflicting grievous bodily harm in what prosecutors said was an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/\">US singer Chris Brown granted $6.7 million bail for world tour by UK court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        },
        {
            "title": "‘We won’t bow to imperialism’: Malema defends EFF stance after Trump plays ‘Kill the Boer’ clip",
            "url": "https://www.newzimbabwe.com/we-wont-bow-to-imperialism-malema-defends-eff-stance-after-trump-plays-kill-the-boer-clip/",
            "content": "IOL\n\nEconomic Freedom Fighters (EFF) leader Julius Malema has dismissed the high-level meeting between Presidents Cyril Ramaphosa and Donald Trump at the White House, describing it as a group of older men meeting to gossip about me.\n\nThis remark comes after Trump paused the meeting on Wednesday to show a video montage of Malema chanting Kill the Boer, subsequently questioning why the EFF leader had not been arrested for using the controversial liberation-era slogan.\n\nIn response, Malema maintained that there is no credible intelligence or evidence to support the claim of a white genocide in South Africa. He also reiterated the EFFs firm stance on land reform.\n\nWe will not agree to compromise our political principles on land expropriation without compensation for political expediency, he said on X (formerly Twitter).\n\nIn a statement, the EFF condemned the meeting and said they never bow and succumb to imperialism.\n\nThe EFF is proud that its legislative and political agenda, led by the President and Commander in Chief Julius Malema has shaken the corridors of imperialism in Washington\n\nAs a result, the EFF is concerned by this call that something must be done to stop the EFF President from chanting a liberation heritage song, the EFF said.\n\nThe red berets said it would continue to follow the developments in Washington.\n\nPlay Video\n\nMeanwhile, the party has reiterated that they will oppose any compromising of our laws to allow Starlink to operate in South Africa.\n\nWe will oppose any reversal of transformative legislation, including that which will allow for expropriation of land, it said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22051912/Screenshot-2025-05-22-at-06.18.33.png",
            "description": "<p>IOL Economic Freedom Fighters (EFF) leader Julius Malema has dismissed the high-level meeting between Presidents Cyril Ramaphosa and Donald Trump at the White House, describing it as “a group of older men meeting to gossip about me.” This remark comes after Trump paused the meeting on Wednesday to show a video montage of Malema chanting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-wont-bow-to-imperialism-malema-defends-eff-stance-after-trump-plays-kill-the-boer-clip/\">‘We won’t bow to imperialism’: Malema defends EFF stance after Trump plays ‘Kill the Boer’ clip</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        },
        {
            "title": "‘Rise of ‘blank’ Tagwirei to presidency a disaster that should be stopped’ – Biti",
            "url": "https://www.newzimbabwe.com/rise-of-blank-tagwirei-to-presidency-a-disaster-that-should-be-stopped-biti/",
            "content": "By Staff Reporter\n\nThe potential rise of ZANU-PF benefactor Kudakwashe Tagwirei to the presidency could have dire consequences for Zimbabwe, former opposition MP Tendai Biti has said.\n\nBiti has criticised Tagwirei, who has wormed himself into the ruling party after being nominated for the Central Committee by ZANU-PFs Harare Province.\n\nFormer ZANU-PF member and war veteran Blessed Geza claims that Tagwireis promotion to the Central Committee is a stepping stone to the presidency, positioning him to succeed President Emmerson Mnangagwa.\n\nSpeaking in a recent online discussion, Biti warned that Tagwireis ascent would undermine the countrys reform efforts:\n\nThe next president could be Kudakwashe Tagwirei, and that would be a total disaster. The rise of this blank, totally vacuous comrado eliteso proximate to the seat of powerspells trouble for Zimbabwe, said Biti.\n\nFormer opposition MP Tendai Biti\n\nTagwirei, through his proxies, has secured lucrative government contracts, including a multimillion-dollar deal to construct the Mbudzi Interchange flyover.\n\nHis business empire has expanded into mining, and he holds a near-monopoly in Zimbabwes fuel sector.\n\nAdditionally, he oversees the controversial Command Agriculture programme and chairs the Land Tenure Implementation Committee.\n\nHis company, Sakunda Holdings, was implicated in the misappropriation of $3 billion from the Ministry of Agriculture between 2017 and 2018.\n\nThe United States of America sanctioned Tagwirei for allegedly enabling corruption among senior government officials.\n\nThough Tagwirei has remained silent, his name continues to circulate as a potential successor to Mnangagwa amid ZANU-PFs internal factional battles.\n\nBiti further argued that the decline of liberation-era war veterans has created a vacuum, allowing opportunistic figures like Tagwireiderisively termed zvigananda (parasites)to exploit their proximity to power for political gain:\n\nThe vacuum left by the departure of the liberation generation is being filled by parasitic comrades with no social base, no shame, and no restraintindividuals who conflate themselves with the state. Some are being fast-tracked to the presidium, said Biti.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter The potential rise of ZANU-PF benefactor Kudakwashe Tagwirei to the presidency could have dire consequences for Zimbabwe, former opposition MP Tendai Biti has said. Biti has criticised Tagwirei, who has wormed himself into the ruling party after being nominated for the Central Committee by ZANU-PF’s Harare Province. Former ZANU-PF member and war</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rise-of-blank-tagwirei-to-presidency-a-disaster-that-should-be-stopped-biti/\">‘Rise of ‘blank’ Tagwirei to presidency a disaster that should be stopped’ – Biti</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        },
        {
            "title": "Masvingo woman ordered to pay US$25k in adultery damages",
            "url": "https://www.newzimbabwe.com/masvingo-woman-ordered-to-pay-us25k-in-adultery-damages/",
            "content": "By Mary Taruvinga\n\nHigh Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25,000 adultery damages to the wife of a man she snatched six years ago.\n\nA default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings.\n\nMachingura had sued Machaya for US$50,000 after she invaded her 41-year-old marriage.\n\nBroken down, US$30,000 was for contumelia and US$20,000 was for loss of consortium, arising from a protracted adulterous relationship between Machaya and her husband.\n\nThe court heard the relationship started in 2019 and Machaya now has two children with Dhudhlas husband.\n\nThe plaintiff, a retired university lecturer and church elder, testified through affidavit to public humiliation in her congregation and community, severe emotional trauma requiring medical treatment for diabetes, hypertension and depression, and the stripping away of her role in the family estate (bank accounts, farm operations and vehicles), the court heard.\n\nSince 2019 the plaintiffs husband has cohabited with the defendant; intimacy, companionship and joint family life have ceased entirely. The marriage now subsists only in name, court papers further show.\n\nMachaya, despite the service, elected to remain absent and therefore offered no apology or mitigation.\n\nThematter was set down on the unopposed roll afterherplea was struck out for non-attendance at the pre-trial conference and her subsequent application for rescission was deemed abandoned.\n\nLiabilitywas therefore not in issueand the courtwas onlyseized with the assessment of quantum under r 25(1) of the High Court Rules, 2021.\n\nWhile handing down his judgement, Justice Mambara said that when fixing adultery damages, the court considers the nature and duration of the marriage, knowledge of the marriage by the adulterer, character and social-economic standing of the parties and the extent of contumelia and loss of consortium proved.\n\nThe judge also looked into contrition (or lack thereof) by the adulterer, the need for deterrence, and the level of awards in comparable cases.\n\nMambara said there is no reported High Court decision afterthat ofTaoneyivs Madzima (HH 18-25)has exceeded the composite figure of US$20,000.\n\nInflation-adjusted though that award is, it remains the highest recent comparable award placed before the court, he said.\n\nThe judge said the plaintiff had along, otherwise stable marriage.\n\nHe said there was a total lack of contrition by Machaya, adding that such offenders deserve deterrent penalties.\n\nThe court is satisfied that an award modestly above the most recent ceiling of US $20,000 is justified to reflect both changing economic realities and the egregious facts of this case.\n\nAccordingly, it is ordered that the defendant shall pay to the plaintiff the sum of US $25,000 made up as follows:(a) Contumelia: US$16,000 (b) Loss of consortium: US$9,000.\n\nHe ruled that interest shall run on the above amount at the prescribed rate of 5 % per annum from the date of this judgment to the date of full and final payment.\n\nMachaya will also pay Dhudhlas costs of suit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga High Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25,000 adultery damages to the wife of a man she snatched six years ago. A default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings. Machingura had sued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masvingo-woman-ordered-to-pay-us25k-in-adultery-damages/\">Masvingo woman ordered to pay US$25k in adultery damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        },
        {
            "title": "Trump ambushes South African president by playing video alleging ‘genocide’ in South Africa",
            "url": "https://www.newzimbabwe.com/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa/",
            "content": "Sky News\n\nDonald Trump has ambushed South Africas president during a White House meeting by playing a video purportedly showing evidence of a genocide of white people in the African country.\n\nThe US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of thousands of white farmers.\n\nAfter an initial friendly chat where Trump complimented South African golfers in the room, a montage of clips was played as Mr Ramaphosa sat quietly and mostly expressionless. He later said: Id like to know where that is because this [the videos] Ive never seen.\n\nThe lights were dimmed in the Oval Office as the videos were shown, including of South African officials allegedly calling for violence against white farmers.\n\nThe scene in the heart of the White House administration was reminiscent of Mr Trumps ambush of Ukraines Volodymyr Zelenskyy last February.\n\nSouth Africa has rejected the allegation that white people are disproportionately targeted by crime.\n\nThe clips include one of a communist politician playing a controversial anti-apartheid song that includes lyrics about killing a farmer.\n\nTrump accused South Africa of failing to address the killing of white farmers. People are fleeing South Africa for their own safety, the US president said. Their land is being confiscated and in many cases theyre being killed.\n\nAlluding to people in the videos, Trump said: These are people that are officials and theyre saying kill the white farmer and take their land.\n\nThe US president then displayed printed copies of news articles that he said showed white South Africans who had been killed, saying death, death as he flipped through them.\n\nHe added of one article: Heres burial sites all over the place, these are all white farmers that are being buried.\n\nSouth African leader rejects allegations\n\nRamaphosa pushed back against Trumps accusations, by responding: What you saw, the speeches that were being made, that is not government policy. We have a multi-party democracy in South Africa that allows people to express themselves, political parties to adhere to various policies.\n\nAnd in many cases or in some cases, those policies do not go along with government policy.\n\nOur government policy is completely, completely against what he [a person in the video montage] was saying. Even in the parliament. And they are a small minority party which is allowed to exist in terms of our constitution.\n\nRamaphosa also said of the behaviour alleged by Mr Trump: We are completely opposed to that.\n\nRamaphosa said there was crime in South Africa, and the majority of victims were black. Mr Trump cut him off and said: The farmers are not black. The South African president responded: These are concerns we are willing to talk to you about.\n\nExperts in South Africa have said there is no evidence of white people being targeted, although farmers of all races are victims of violent home invasions in a country that suffers from a very high crime rate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21194112/skynews-donald-trump-cyril-ramaphosa_6923546.jpg",
            "description": "<p>Sky News Donald Trump has ambushed South Africa’s president during a White House meeting by playing a video purportedly showing evidence of a “genocide” of white people in the African country. The US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of thousands of white farmers.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa/\">Trump ambushes South African president by playing video alleging ‘genocide’ in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "22 May 2025"
        }
    ]
}