{
    "news": [
        {
            "title": "African Sun in US$18 million transaction agreement for Monomotapa Hotel disposal",
            "url": "https://www.newzimbabwe.com/african-sun-in-us18-million-transaction-agreement-for-monomotapa-hotel-disposal/",
            "content": "By Alois Vinga\n\nTOP hospitality group, African Sun Limited (ASL) has penned a US$18 million transaction agreement for the disposal of Monomotapa Hotel.\n\nThe group has since placed some of its assets like the Great Zimbabwe Hotel, and the Carribea Bay on the market in line with the groups strategy to raise adequate capital to invest in other areas of interest.\n\nIn a recent Cautionary Statement to shareholders, the hospitality group has reached a transactional agreement with the Public Service Pension Fund.\n\nTransactional agreements for the disposal of the Monomotapa Hotel land, buildings, adjacent car park and associated hotel business as a going concern, for US$18 million (plus any applicable VAT), have now been signed subject to the conditions precedent below.\n\nThe transaction involves two parts: Monomotapa Hospitality (Private) Limited, in which the Public Service Pension Fund has an interest, will acquire the hotel business and associated assets, while the Public Service Pension Fund will directly acquire the hotel land, buildings, and car park, as a single, integrated transaction, the group said in a statement.\n\nThe hospitality group is now seekingshareholder approval since the transaction constitutes a Category 1 transaction, which subjects it to an Extraordinary General Meeting (EGM),(for which a detailed circular will shortly be published.\n\nTHE EGM will be convened at a date soon to be announced, as well as seeking approval from the Competition and Tariff Commission (CTC).\n\nShareholders and the investing public are therefore advised to continue exercising caution when dealing with the Companys securities until advised of the conclusion of the said ongoing processes, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga TOP hospitality group, African Sun Limited (ASL) has penned a US$18 million transaction agreement for the disposal of Monomotapa Hotel. The group has since placed some of its assets like the Great Zimbabwe Hotel, and the Carribea Bay on the market in line with the group’s strategy to raise adequate capital to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-in-us18-million-transaction-agreement-for-monomotapa-hotel-disposal/\">African Sun in US$18 million transaction agreement for Monomotapa Hotel disposal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "11 Jul 2025"
        },
        {
            "title": "Dynamos coach speaks on Mukamba, Mushure signing",
            "url": "https://www.newzimbabwe.com/dynamos-coach-speaks-on-mukamba-mushure-signing/",
            "content": "By Sports Reporter\n\nAs part of efforts to revive the squad and fight relegation, Dynamos is set to sign former players Denver Mukamba and Ocean Mushure.\n\nThe duo was spotted at the teams training ground on Thursday, and are in coach Saul Chaminukas mid-season transfer plans.\n\nMukamba was last attached at Scottland FC when they won their PSL promotion last year from the Northern Region Division One League, while Mushure is coming from Zambia, where he was competing in the top-flight league.\n\nWe are still working on that and I am sure very soon we will be announcing who is now on board.\n\nWe are still working on a number of things but I am sure I will be concluding that business very soon and they will soon start seeing their beloved players playing and getting good results for the team, team head coach Saul Chaminuka said.\n\nNicknamed The Prodical Son, the move marks Mukambas return to Dynamos for the fourth time since his debut signing in 2011.\n\nThe 2012 Soccer Star of the Year left Dynamos in 2023 to join moneybags side Scottland FC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/25043049/Denver-Mukamba.jpg",
            "description": "<p>By Sports Reporter As part of efforts to revive the squad and fight relegation, Dynamos is set to sign former players Denver Mukamba and Ocean Mushure. The duo was spotted at the team’s training ground on Thursday, and are in coach Saul Chaminuka’s mid-season transfer plans. Mukamba was last attached at Scottland FC when they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-coach-speaks-on-mukamba-mushure-signing/\">Dynamos coach speaks on Mukamba, Mushure signing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zimbabwe currency reserves backing ZiG climb to record",
            "url": "https://www.newzimbabwe.com/zimbabwe-currency-reserves-backing-zig-climb-to-record/",
            "content": "Bloomberg\n\nGold and foreign-currency reserves backing Zimbabwes bullion-linked monetary unit rose to a record in June, the central bank said.\n\nThe reserves climbed to $731 million from $639 million in May and $276 million in April last year, when the nation introduced Zimbabwe Gold, the currency known as the ZiG, the central bank said in a statement Wednesday.\n\nYears of economic mismanagement doomed five attempts to create a functioning currency in the southern African nation, with the ZiG replacing the defunct Zimbabwean dollar, which was in freefall.\n\nAuthorities now want the new unit to supersede the US dollar, which since 2009 has functioned as a dual transacting currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Gold and foreign-currency reserves backing Zimbabwe’s bullion-linked monetary unit rose to a record in June, the central bank said. The reserves climbed to $731 million from $639 million in May and $276 million in April last year, when the nation introduced Zimbabwe Gold, the currency known as the ZiG, the central bank said in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-currency-reserves-backing-zig-climb-to-record/\">Zimbabwe currency reserves backing ZiG climb to record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zimbabwe undertakes second Joint External Evaluation to strengthen National Health Security",
            "url": "https://www.newzimbabwe.com/zimbabwe-undertakes-second-joint-external-evaluation-to-strengthen-national-health-security/",
            "content": "UNICEF\n\nFrom 29 June to 4 July 2025, Zimbabwe conducted its second Joint External Evaluation (JEE) to assess the countrys capacity to prevent, detect, and respond to public health threats under the International Health Regulations (2005). The JEE, coordinated by the Ministry of Health and Child Care (MoHCC) with support from WHO and partners, marks a critical milestone in strengthening Zimbabwes public health emergency preparedness and response systems.\n\nThe JEE is a voluntary, collaborative process used globally to assess a countrys readiness to manage infectious disease outbreaks and other health emergencies. It is conducted every five years, with the countrys first evaluation completed in 2018.\n\nThe JEE gives us a structured opportunity to check how ready we are to detect and respond to public health threats and we thank all the partners who have made this possible, said Dr Wenceslaus Nyamayaro, MoHCC Acting Chief Director, Public Health.\n\nThe internal self-assessment, the first phase of the JEE, was completed in July 2025 with over 100 participants from across sectors including health, environment, veterinary services, defense, disaster management, civil society, and development partners including WHO, UNICEF, FAO, Africa CDC and others. This participatory process assessed 19 technical areas ranging from biosafety and surveillance to legislation and points of entry.\n\nKey areas that emerged as requiring urgent attention include outdated or poorly implemented legal instruments, coupled with limited availability of legal support at subnational levels. Gender equity in emergencies remains a concern, with notable gaps in funding for gender-based violence (GBV) prevention and response, as well as low representation of women in emergency preparedness and decision-making processes. Funding for emergency response activities was also highlighted as inadequate.Surveillance systems for foodborne illnesses and healthcare-associated infections (HAIs) are still fragmented, highlighting the need for stronger cross-sector coordination. Coordination between the human, animal and environmental health sectors is still weak, showing the need to improve how these groups work together. Biosafety and biosecurity capacities also require strengthening, particularly in terms of laboratory infrastructure and staff training. Additionally, readiness at points of entry remains limited, with gaps in the ability to detect and respond to public health threats at borders and airports.\n\nZimbabwe also assessed its progress in tackling antimicrobial resistance (AMR), a growing global threat. While the country has developed a robust One Health AMR National Action Plan and established 14 multisectoral surveillance sites, challenges remain in laboratory capacity, integration of data systems and containment of multidrug-resistant organisms (MDROs).\n\nThe next phase of the JEE will involve an external validation mission scheduled for 613 September 2025. A team of international subject matter experts, coordinated by WHOs Regional Office for Africa, will work with technical teams in Zimbabwe to validate scores, review documentation and conduct site visits to key health facilities including laboratories and points of entry. Following the mission, Zimbabwe will develop or update its National Action Plan for Health Security (NAPHS). This plan will consolidate findings from the JEE, past outbreak reviews, and risk assessments to guide future investments and reforms in public health preparedness.\n\nThe evaluation is about continuous improvement. It reflects Zimbabwes commitment to protect the health of its people through stronger systems, better data, and broader collaboration, said Dr. Desta Tiruneh, WHO Representative to Zimbabwe.\n\nThe evaluation was made possible with funding from the Health Resilience Fund (HRF) through WHO, with additional support mobilised by MoHCC from Africa CDC and UNICEF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10163709/WHO-100.jpeg",
            "description": "<p>UNICEF From 29 June to 4 July 2025, Zimbabwe conducted its second Joint External Evaluation (JEE) to assess the country’s capacity to prevent, detect, and respond to public health threats under the International Health Regulations (2005). The JEE, coordinated by the Ministry of Health and Child Care (MoHCC) with support from WHO and partners, marks</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-undertakes-second-joint-external-evaluation-to-strengthen-national-health-security/\">Zimbabwe undertakes second Joint External Evaluation to strengthen National Health Security</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zanu PF Mash Central leadership accused of plotting against ex-deputy minister Karoro",
            "url": "https://www.newzimbabwe.com/zanu-pf-mash-central-leadership-accused-of-plotting-against-ex-deputy-minister-karoro/",
            "content": "By Mary Taruvinga\n\nZANU PF Mbire District Coordinating Committee chairman in Mashonaland Central province, Takesure Chikwamba has been accused of orchestrating the arrest of former Agriculture deputy minister Douglas Karoro on theft charges.\n\nThe move was allegedly driven by revenge after Chikwamba lost the Mbire Constituency to Karoro in the 2018 harmonised elections.\n\nThis came out in court this Thursday when Chikwamba appeared as a State witness against Karoro who is accused of diverting fertilisers that were meant for Mbire district under the Presidential Input Programme.\n\nThe former deputy minister, who is being represented by Admire Rubaya, denies the allegations, describing them as a fabrication by his political rivals, among them Chikwamba, whom he outclassed in the partys primary elections to represent the constituency in parliament.\n\nChikwamba told Regional Magistrate Marehwanazvo Gofa that he reported the matter to the police after he received reports from his party subordinates of suspicious movement of fertilisers at GMB Mushumbi.\n\nHe said he was not in Mbire at the time but was at his home in Ruwa when he was informed about the movement of fertilisers at Mushumbi GMB depot heading to Guruve GMB and rushed to the Police Morris Depot to report.\n\nWhen I got information from Nawo Gumbo and Mutukudzi about the fertilisers I got in touch with intelligence officers from the Presidents office. I also made investigations at GMB Guruve, where I was told there was no ammonium nitrate which was said to be going to be exchanged with compound D which had been taken at Mushumbi.\n\nWe expected the compound D would be returned but it was never delivered to the people of Mbire, he said.\n\nThe defence argued that Chikwamba had no locus standi to receive information at GMB and this shows he had a motive to get back at Karoro who had beaten him in elections.\n\nThey argued that in pursuit of his vendetta, Chikwamba rushed to the police despite not having any evidence but just words from his security officers on the ground.\n\nThey added that Chikwamba never called Karoro to inquire about the allegations but rushed to the police as he had the intention to sink him.\n\nYou had ulterior motives; that is why you did not call him to ascertain whether it was true or not. You just concluded he was a thief and rushed to report without even hearing his side of the story, Rubaya argued.\n\nChikwamba responded, saying he went to the police because he had been told a whistleblower whom he could not name was processing documents at GMB to substantiate the allegations against the former legislator.\n\nThe defence insisted the allegations were a fabrication as they were not supported by evidence, adding that the report was not even made where the alleged offence occurred.\n\nThey said Chikwamba ignored his nearest police stations, Ruwa, Mabvuku and Harare Central and instead rushed to CCD, which ordinarily gets reports through referrals.\n\nThis, they said, showed malice and an intention to get back at Karoro because he had a bone to chew with the accused for defeating them in the elections.\n\nYou were determined to be in the new building in Mt Hampden (parliament) that you sought to have him dismissed through baseless allegations. You ignored all the police stations and just rushed to Morris Depot, now Mkushi Depot, Rubaya said.\n\nChikwamba said he was not bitter after losing the election to Karoro but instead he was happy because it was a learning curve and first time to compete, adding that Karoro was just raising it as a defence to the allegations.\n\nHearing continues next Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Mary Taruvinga  ZANU PF Mbire District Coordinating Committee chairman in Mashonaland Central province, Takesure Chikwamba has been accused of orchestrating the arrest of former Agriculture deputy minister Douglas Karoro on theft charges. The move was allegedly driven by revenge after Chikwamba lost the Mbire Constituency to Karoro in the 2018 harmonised elections. This came</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-mash-central-leadership-accused-of-plotting-against-ex-deputy-minister-karoro/\">Zanu PF Mash Central leadership accused of plotting against ex-deputy minister Karoro </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "11 Jul 2025"
        },
        {
            "title": "No Covid-19 variants in Zimbabwe – govt says",
            "url": "https://www.newzimbabwe.com/no-covid-19-variants-in-zimbabwe-govt-says/",
            "content": "By Anna Chibamu\n\nThe government has dismissed reports of any Covid-19 variants currently circulating in Zimbabwe.\n\nSpeaking during a Question and Answer session in Parliament on Wednesday, Deputy Minister of Health and Child Care, Sleiman Timios Kwidini said the deadly variants being reported in other countries had not yet been detected locally.\n\nThe country is currently battling a viral infection outbreak that authorities havesaid is just an ordinary flu bug.\n\nMashonaland West proportional representation MP Mutsa Murombedzi posed a question to Kwidini regarding Zimbabwes situation on the suspected outbreak of a Covid 19 deadly strain reported in other countries.\n\nThe whole world is preparing for another threatening variant COVID. What has the government put in place to curb the spread of this virus? Murombedzi said.\n\nWe are aware that COVID comes with different variants but at the moment, the variants that are being found in other countries have not yet been found in Zimbabwe.\n\nHowever, the government is actively working to prevent the spread of the virus and has acquired additional test kits to enhance detection capabilities, building on previous experiences with testing for variants like Omicron.\n\nWe anticipate receiving some new medicines that are going to be used to cure this virus, Kwidini said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/09152417/covid-19-test-e1641884205477.jpg",
            "description": "<p>By Anna Chibamu The government has dismissed reports of any Covid-19 variants currently circulating in Zimbabwe. Speaking during a Question and Answer session in Parliament on Wednesday, Deputy Minister of Health and Child Care, Sleiman Timios Kwidini said the deadly variants being reported in other countries had not yet been detected locally. The country is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-covid-19-variants-in-zimbabwe-govt-says/\">No Covid-19 variants in Zimbabwe – govt says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "11 Jul 2025"
        }
    ]
}