{
    "news": [
        {
            "title": "WATCH: Flooding as heavy downpour is recorded in Chipinge",
            "url": "https://www.newzimbabwe.com/watch-flooding-as-heavy-downpour-is-recorded-in-chipinge/",
            "content": "By Staff Reporter\n\nTHE New Year 2025 was marked with a heavy downpour of rains in the town of Chipinge, Manicaland province, triggering flooding in shops and houses.\n\nThis Thursday, the eastern border town recorded above normal rainfall, which resulted in flooding of properties thereby exposing the poor drainage system.\n\nIn one viral video posted by an anonymous shopper at the countrys leading retail chain store, TM Supermarket, excitable shoppers are immersed in water up to ankle level.\n\nWe are literally swimming under water here at TM Chipinge, the female shopper is heard saying in the footage.\n\nChipinge is located on the southeastern side of Zimbabwe, close to the border with Mozambique, and is part of the area devastated by Cyclone Idai in 2019, the other being Chimanimani.\n\nThe district is the largest producer of tea, coffee, dairy milk and timber and is associated with heavy rainfall.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/11/12094652/Chipinge.jpeg",
            "description": "<p>By Staff Reporter  THE New Year 2025 was marked with a heavy downpour of rains in the town of Chipinge, Manicaland province, triggering flooding in shops and houses. This Thursday, the eastern border town recorded above normal rainfall, which resulted in flooding of properties thereby exposing the poor drainage system. In one viral video posted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-flooding-as-heavy-downpour-is-recorded-in-chipinge/\">WATCH: Flooding as heavy downpour is recorded in Chipinge </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Drunken Zambian policeman freed 13 suspects to celebrate New Year",
            "url": "https://www.newzimbabwe.com/drunken-zambian-policeman-freed-13-suspects-to-celebrate-new-year/",
            "content": "By BBC\n\nA DRUNKEN police officer in Zambia freed 13 suspects from custody so that they could go and celebrate the new year, officials say.\n\nDetective inspector Titus Phiri was arrested after releasing the suspects from Leonard Cheelo police station in the capital, Lusaka, before running away himself.\n\nThe 13 detainees were accused of crimes such as assault, robbery and burglary.\n\nThey are all currently on the run and a manhunt has been launched to find them.\n\nPolice spokesperson Rae Hamoonga said that Mr Phiri, in a state of intoxication, forcibly seized cell keys from constable Serah Banda on New Years Eve.\n\nSubsequently, detective inspector Phiri unlocked both the male and female cells and instructed the suspects to leave, stating they were free to cross over into the new year, he said.\n\nOut of the 15 suspects in custody, 13 escaped. Following the incident, the officer fled the scene.\n\nMr Phiri has not yet commented on the allegations.\n\nReacting to the incident, former presidential spokesperson and lawyer Dickson Jere wrote on Facebook: I keep laughing each time I picture the scenario  comical! But then, I remembered a similar incident in 1997.\n\nOn New Years Eve in 1997, the late, controversial High Court Judge Kabazo Chanda ordered the release of 53 suspects, some of whom were deemed dangerous by the police.\n\nMr Chanda was annoyed that the suspects had been arrested as long ago as 1992, but had not yet appeared in court.\n\nJustice delayed, is justice denied, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/03052152/920c3cf0-c910-11ef-94cb-5f844ceb9e30.jpg.jpeg",
            "description": "<p>By BBC  A DRUNKEN police officer in Zambia freed 13 suspects from custody so that they could go and celebrate the new year, officials say. Detective inspector Titus Phiri was arrested after releasing the suspects from Leonard Cheelo police station in the capital, Lusaka, before running away himself. The 13 detainees were accused of crimes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drunken-zambian-policeman-freed-13-suspects-to-celebrate-new-year/\">Drunken Zambian policeman freed 13 suspects to celebrate New Year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Winky D reflects on a year of trials and triumphs as 2025 kicks off",
            "url": "https://www.newzimbabwe.com/winky-d-reflects-on-a-year-of-trials-and-triumphs-as-2025-kicks-off/",
            "content": "By Tapiwa Svondo\n\nAS the new year 2025 begins to unfold, lyrical genius, Wallace Chirumiko popularly known as Winky D or Gaffa President invited his fans to embark on his reflective odyssey, marked by personal and professional hurdles.\n\nIn a heartfelt message to his fans, the music icon expressed the need to pause and contemplate the past year of 2024.\n\nAs we start a new year, I am compelled to pause and reflect on what was, what is, what could have been, and what was not. As I confuse thyself in the bars of the prison that is my mind.\n\nThis journey has been a tapestry woven with threads of trials and triumphs. Each moment a stitch in the fabric of the collective nation called GAFA, said Winky D.\n\nIn this tumultuous year, Winky D discovered flickers of joy amid the shadows. As the year 2024 drew to a close, he faced significant hurdles that threatened to overwhelm him.\n\nOne of the most challenging moments was losing his beloved venue, the Harare International Conference Centre (HICC), known affectionately as paJabuna, where he has hosted his iconic New Years Eve shows.\n\nDespite securing the place as early as May 2024, the venue was in a biased manner given to gospel musician Everton Mlalazi, who has strong ties to the Zanu PF acolyte Kudakwashe Tagwirei.\n\nThis unexpected setback was a heavy blow for the artist, who expressed, Amidst the tempest, we found flickers of joy and connection through music. Towards the end, I faced hurdles that overwhelmed my feeble heart.\n\nAnxiety gripped me as I pondered how to close this chapter on a high note, said the dreadlocked artist.\n\nThe loss of the HICC venue was described as sabotage, yet, amidst this uncertainty, a beacon of hope emerged as his loyal fans in the United Kingdom and Bulawayo embraced his last shows of the year.\n\nYour presence at my live shows in the UK and Bulawayo became the beacon of light during dark hours!\n\nDances on the edge of uncertainty, anxiety and excitement fought within me. But you, the Gafas, sang along. Hope flickered anew.\n\nYour unwavering loyalty and vibrant enthusiasm reminded me of the profound unbreakable bond we have shared over the years.\n\nBefore the HICC debacle, Winky D in 2023 faced a ban on State media over Eureka Eureka, only to be unbanned in 2024 according to NewZimbabwe.com sources.\n\nHowever, certain songs from Winky Ds Eureka Eureka album, such as Ibotso and Dzimba Dzemabwe, remain banned.\n\nDuring his 2023-2024 New Years Eve concert, Winky D acknowledged the impact of the blackout on his music.\n\nFrom 2004 up until 2024, 2023 was the most difficult year for me musically, said Winky D.\n\nI could not get an interview on the radio for the show. I only had the internet and dreams and then you (fans), he further said.\n\nAs the new year dawns, the GAFA, stands ready to embrace whatever challenges and triumphs await, thanking his fans for their love and loyalty towards him and his Vigilance Band.\n\nEach note I play and every lyric I sing is dedicated to you. Your energy fuels my creativity and commitment to our cause. Thank you for being my strength during these trying times.\n\nYour support transcends words; it is a lifeline that propels me forward. Together, let us carry this momentum into the new year, embracing both challenges and triumphs that might await us on the horizon.\n\nHappy Twenty Twenty Strive, he wrote.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/08090848/ZimFest-18.png",
            "description": "<p>By Tapiwa Svondo  AS the new year 2025 begins to unfold, lyrical genius, Wallace Chirumiko popularly known as ‘Winky D’ or ‘Gaffa President’ invited his fans to embark on his reflective odyssey, marked by personal and professional hurdles. In a heartfelt message to his fans, the music icon expressed the need to “pause” and contemplate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/winky-d-reflects-on-a-year-of-trials-and-triumphs-as-2025-kicks-off/\">Winky D reflects on a year of trials and triumphs as 2025 kicks off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Jah Prayzah fans angered by his praises for Wicknell Chivayo",
            "url": "https://www.newzimbabwe.com/jah-prayzah-fans-angered-by-his-praises-for-wicknell-chivayo/",
            "content": "By Staff Reporter\n\nCELEBRATED musician Mukudzeyi Mukombe also known as Jah Prayzah has drawn widespread condemnation from his fans over his effusive praise for controversial tenderpreneur, Wicknell Chivayo, who has lately been gifting cars and cash.\n\nChivayo, known for his close ties to the ruling party, Zanu PF, and his dubious reputation as a tenderpreneur, the endorsement has raised serious ethical questions by Jahs followers over his post.\n\nIn a Facebook post dripping with adoration, Jah Prayzah referred to Chivayo as a blesser par excellence.\n\nBorn with an open hand that uplifts the orphans, the widows and less privileged. In front of you there are no strangers but only children of God, with this you are a blessing to this nation as we have never witnessed this huge kind of love.\n\nThe gifts you offer are received by those who accept them like the rains from God that suddenly pour down, and we cast our seeds into the ground, he said.\n\nWith such rhetoric, while appealing on the surface, is deeply misleading and raises eyebrows in a nation that has witnessed the detrimental impact of Chivayos business practices.\n\nHis tenure as a controversial businessman has often been marred by allegations of corruption, leaving many Zimbabweans questioning his integrity, and leaving the country bleeding.\n\nBootlicking Jah Prayzah himself last year received lavish gifts from Chivayo, including a $180,000 Mercedes Benz S500 becoming the most expensive car gifted a musician in the country.\n\nFollowing the recent Harare shutdown show in November, his female dancers were also gifted with Toyota Aquas, and he was also given an additional $20,000.\n\nThe fans in his Facebook comment section have pointed at serious concerns about whether his rosy lifestyle has clouded his judgment and led him to overlook the troubling realities of those he claims to uplift, as they are seen as people who already have a background to work on their own but are the ones mostly benefitting from Chivayos unquestionable source of income.\n\nJah Prayzah also posed troubling questions, Do you think blessings would fail to multiply through the hearts of many you have pleased? Do you think they would fail to love you for your goodness or for your excellent deeds? Do you think that even God Himself would fail to add blessings on top of others? Out of respect for you, we give you honor; your dignity will forever be associated with your name. Your actions increase the glory of Gods goodness, said Jah\n\nThe award-winning artists praises to Chivayo have alienated the very fans who have supported him through thick and thin, many of whom are disillusioned by the rampant corruption that has plagued their lives.\n\nBELOW IS JAH PRAYZAH SHONA STATEMENT CONVERTED TO ENGLISHYou were born with an open hand that uplifts the orphans, the widows and less privileged. In front of you there are no strangers but only children of God, with this you are blessing to this nation as we have never witnessed this huge kind of love.The blessings that you get from the heavens, along with your hard-earned money you get from your own sweat, that you pray and fast for, you also give to others.You are like a large river that when it overflows it shares its waters to other rivers.Like a tree that, when it bears fruit, it drops some to sustain animals, birds, and humans.The gifts you offer are received by those who accept them like the rains from God that suddenly pours down, and we cast our seeds into the ground.Your name has not been raised through insults, criticism, or by belittling the spirit of others. Those who know you recognize you by your generosity like Kupakwashe Scott Sakupwanya, without an endless giving from a spring that never runs dry.Do you think blessings would fail to multiply through the hearts of many you have pleased? Do you think they would fail to love you for your goodness or for your excellent deeds? Do you think that even God Himself would fail to add blessings on top of others? Out of respect for you, we give you honor; your dignity will forever be associated with your name. Your actions increase the glory of Gods goodness.Everything you plan with your efforts may it succeed, may you be added with more wisdom because it enhances wealth through unification and reconciliation.May your health be preserved because it is the primary wealth. Continue to wipe away the tears of people because those are the blessings you have received. Happy new year to you, my brother Sir Wicknell.\n\nBELOW IS JAH PRAYZAH SHONA STATEMENT CONVERTED TO ENGLISH\n\nYou were born with an open hand that uplifts the orphans, the widows and less privileged. In front of you there are no strangers but only children of God, with this you are blessing to this nation as we have never witnessed this huge kind of love.\n\nThe blessings that you get from the heavens, along with your hard-earned money you get from your own sweat, that you pray and fast for, you also give to others.\n\nYou are like a large river that when it overflows it shares its waters to other rivers.\n\nLike a tree that, when it bears fruit, it drops some to sustain animals, birds, and humans.\n\nThe gifts you offer are received by those who accept them like the rains from God that suddenly pours down, and we cast our seeds into the ground.\n\nYour name has not been raised through insults, criticism, or by belittling the spirit of others. Those who know you recognize you by your generosity like Kupakwashe Scott Sakupwanya, without an endless giving from a spring that never runs dry.\n\nDo you think blessings would fail to multiply through the hearts of many you have pleased? Do you think they would fail to love you for your goodness or for your excellent deeds? Do you think that even God Himself would fail to add blessings on top of others? Out of respect for you, we give you honor; your dignity will forever be associated with your name. Your actions increase the glory of Gods goodness.\n\nEverything you plan with your efforts may it succeed, may you be added with more wisdom because it enhances wealth through unification and reconciliation.\n\nMay your health be preserved because it is the primary wealth. Continue to wipe away the tears of people because those are the blessings you have received. Happy new year to you, my brother Sir Wicknell.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/01025717/Wicknell-Chivayo-gifts-Jah-Prayzah-180-000-Mercedes-Benz-S500.jpeg",
            "description": "<p>By Staff Reporter  CELEBRATED musician Mukudzeyi Mukombe also known as Jah Prayzah has drawn widespread condemnation from his fans over his effusive praise for controversial tenderpreneur, Wicknell Chivayo, who has lately been gifting cars and cash. Chivayo, known for his close ties to the ruling party, Zanu PF, and his dubious reputation as a tenderpreneur,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jah-prayzah-fans-angered-by-his-praises-for-wicknell-chivayo/\">Jah Prayzah fans angered by his praises for Wicknell Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "HIV and AIDS issues take a ‘dead’ seat: Activist speaks on challenges faced by people living with the condition",
            "url": "https://www.newzimbabwe.com/hiv-and-aids-issues-take-a-dead-seat-activist-speaks-on-challenges-faced-by-people-living-with-the-condition/",
            "content": "By Anna Chibamu\n\nEVEN though public health facilities continue providing HIV and AIDS medication with more players tackling the endemic, dealing with the condition, sexual reproductive health and rights (SRHR) issues, focus on the subject seems to be taking a dead seat, an activist has said.\n\nMartha Todhlana told media health practitioners during a Media and Science Cafe Programme in Harare recently that it was sad to note HIV counselling issues had declined with a lot of people now out of support programmes and no longer getting some health services such as health checks and or monitoring.\n\nOnce the universal programme started to say anyone who tests can just test and treat, I think issues of counselling have declined and also people not seeing the need for being in support groups.\n\nYou will find that currently, a lot of people who are in support groups now are those who tested some years back, before we had the programme as it is, but those who started treatment in the test and treat programme, a lot of them are not in support groups because they dont see the need.\n\nI think a positive is that public health facilities continue providing HIV medication and there are more players tackling HIV, tackling sexual and reproductive health and rights, SRHR, but sadly I think focus on HIV seems to be taking a dead seat, Todhlana said.\n\nAll this, according to her, has been attributed to several reasons amongst them a weak psycho-social support system, a shift in funding which is now more focused on young people and to a certain extent, the emergence of non-communicable diseases that are on the increase.\n\nMany people with HIV are struggling with non-communicable diseases, which are not properly managed, and some non-communicable diseases come with extreme pain. Those sharing their experiences indicate that the pain management approach is almost close to none.\n\nI think this is linked to funding and there is a focus on young people, which is good, especially adolescent girls and young women.\n\nWe have seen an improvement on the PrEP issues, but the realities that we consider as we get into 2025 include sadly that HIV stigma and discrimination persists, the level of domestic funding for health and particularly HIV is worryingly too low, Todhlana, who tested HIV positive in 2003 added.\n\nShe explained further: And the continued focus on young people or the 0-49 age group ignores the effect of HIV successes, which means people are ageing with HIV.\n\nBecause when we celebrate the success, by the way I turned 16 last week and Im already out of the 0-49 age group and I get my treatment from the public health sector and it is very obvious that you are autistic outside, but I see so many people who are even older than me, living with HIV and getting their treatment and then you are left to your own individual and without the proper care and support.\n\nI think the HIV facility used to be linked to a robust psycho-social support system, but a lot of times I see that this is no longer available and also it was still for people who are more than 49.\n\nAccording to Todhlana, her worry is the upkeep of the young adults born with HIV.\n\nI keep worrying about who is looking after them and the language we still use around young people is being reckless. We say Im a 2,000 reckless, but we call, and they are putting themselves in situations where they can get HIV. They are putting themselves at risk, but we forget that there is that cohort of young people who were not reckless.\n\nShe said many of those who were born with HIV or might have got it from breast milk before we know what we know now are quite a big number in our population who are in this cohort.\n\nSo, when I talk of people ageing with HIV, I include these young people. And then people diagnosed in their adulthood, like me, we have more than 20 years of treatment and Im increasing in number.\n\nTodhlana spoke of ART side effects saying a lot of lives were being lost because of less attention and monitoring to those taking ARVs.\n\nOn the packaging of the ARVs, the side effects are written, they are very clearly written there to say your kidneys will be affected, your liver will be affected, you know, a whole lot of organs will be affected so they need to be monitored regularly.\n\nBut I, I think the reason they are not being monitored is because when they were doing the monitoring there was external funding to do that and once the external fund has left, then it is no longer there because our labs are no longer eternally being funded.\n\nShe also raised issues to do with menopause and social isolation issues to those living with HIV.\n\nMenopause is coming much earlier for women with HIV than for those who do not have HIV. Maybe 10 years or so earlier.\n\nAnd then also the social isolation at times. With social isolation, I havent been to church for three years now. Im someone who enjoys going for Sunday services and going for midweek services. I havent been inside a church for the past three years.\n\nI was diagnosed of HIV in 2000, then diagnosis of arthritis in my spine in 2008, that was five years after starting ARVs in 2003. But the ARVs we were taking, were too many, at least three tablets three times a day, compared to one tablet once a day. You see how our researchers continue to improve. Today we have progressed to one tablet every 24 hours.\n\nShe stated that research studies are very important.\n\nClinical research and social research have been very important to the response to HIV. And also Im hoping to see that theres also media doing their research as well, as media, to make sure that they contribute to the body of knowledge that is building on our HIV response, she explained.\n\nTodhlana has a daughter, now at university, born without HIV to a mother living with HIV.\n\nShe gave credit to GALZ for the support given during her most difficult time of life.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/26042835/Ruth-Mlambo-looking-at-some-of-the-HIV-and-AIDS-pamphlets-inside-her-house-in-Matika-village-in-Mutare-Zimbabwe-Farai-MatiasheAljazeera-1724176194.webp",
            "description": "<p>By Anna Chibamu EVEN though public health facilities continue providing HIV and AIDS medication with more players tackling the endemic, dealing with the condition, sexual reproductive health and rights (SRHR) issues, focus on the subject seems to be taking a dead seat, an activist has said. Martha Todhlana told media health practitioners during a Media</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hiv-and-aids-issues-take-a-dead-seat-activist-speaks-on-challenges-faced-by-people-living-with-the-condition/\">HIV and AIDS issues take a ‘dead’ seat: Activist speaks on challenges faced by people living with the condition </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Let the pipe dream be buried — says former Harare mayor on capital’s failed attempt to achieve World Class city status by 2025",
            "url": "https://www.newzimbabwe.com/let-the-pipe-dream-be-buried-says-former-harare-mayor-on-capitals-failed-attempt-to-achieve-world-class-city-status-by-2025/",
            "content": "By Leopold Munhende\n\nFORMER Harare mayor, Bernard Manyenyeni has trashed the capitals attempts at achieving world class city status, saying it is a pipe dream which should just be buried.\n\nManyenyeni, who was in office from 2013 to 2018, said until conditions that allowed Harare to be run like a normal metropolis were restored, the local authoritys dream would never come true.\n\nCity of Harare (CoH) had been targeting to have turned the capital into a world class city by 2025, a target it missed dismally.\n\nAttempts by Harare Mayor Jacob Mafume to sell the idea of it having taken steps towards achieving this target have been dismissed.\n\nAccess to basic provisions such as clean potable water remain a challenge for most of the overpopulated citys residents, sewer, dirt, potholes, and general lack of effort have troubled the capitals governance.\n\nFinally, the dream dies, 2025 is here today. I shed no tears, said Manyenyeni.\n\nFormer Harare mayor, Bernard Manyenyeni\n\nI disowned this misplaced mantra some years ago when I was still leading this council.\n\nAs usual, there was a sustained attempt to carry the empty noises onto as late as last night (31 December).\n\nManyenyeni did not wholly heap the blame on council, but he raised issues with laws which govern councils, central government interference, a lack of infrastructure and questioned the readiness of residents and ratepayers to embrace change.\n\nThe mess, he said, must be blamed on a 2013 directive by the Local Government ministry to pardon debts amounting to US$300 million, owed to council.\n\nAnother directive to award bosses at local authorities hefty allowances was also fingered as another reason for the financial woes facing CoH.\n\nBoth affected his tenure, he alleged.\n\nThe ex-premier highlighted that had those directives not been issued, at least US$2 billion would have been realised by council.\n\nAdded Manyenyeni: This was close to 30 months revenues  with zero compensation from the government.\n\nHCC has not yet recovered from both the direct and indirect pains of those ministerial signatures.\n\nMy own estimate is that the indirect costs of just those two directives add another US$2 billion minimum hemorrhage to Harare City Council.\n\nUntil there is convergence of power with willpower in what must be done, there is no room for positive dreams for the city.\n\nNightmares will be the order of the broad day. Until the key ingredients of running even a normal city are restored, forget about a world-class city.\n\nManyenyeni further poked holes into the dream by questioning the manner of governance at Town House where top officials continue facing arrests on spurious allegations of corruption, abuse of office and various other crimes.\n\nHe mocked it, saying CoH could just be targeting a world record.\n\nMunicipalities draw a lot of support from the goodwill they carry, he said.\n\nHCC has a poor record, world record loading. Among other sore red flags, you cannot imagine any capital city whose Mayors and Town Clerks have been arrested in office more than the Zimbabwe capital in the last 20 years.\n\nIn our media age, how many negative stories pop up when anything about Harare City Council is searched on the web? How many good ones?\n\nLet the dead dream be buriedI shed no tears.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/26004850/man-in-harare.jpg",
            "description": "<p>By Leopold Munhende FORMER Harare mayor, Bernard Manyenyeni has trashed the capital’s attempts at achieving world class city status, saying it is a pipe dream which should just be buried. Manyenyeni, who was in office from 2013 to 2018, said until conditions that allowed Harare to be run like a normal metropolis were restored, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/let-the-pipe-dream-be-buried-says-former-harare-mayor-on-capitals-failed-attempt-to-achieve-world-class-city-status-by-2025/\">Let the pipe dream be buried — says former Harare mayor on capital’s failed attempt to achieve World Class city status by 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Retired ZRP Commissioner-General Matanga spotted wearing full uniform sparking speculation of discord within police force",
            "url": "https://www.newzimbabwe.com/retired-zrp-commissioner-general-matanga-spotted-wearing-full-uniform-sparking-speculation-of-discord-within-police-force/",
            "content": "By Staff Reporter\n\nAXED Zimbabwe Republic Police (ZRP) Commissioner-General, Godwin Matanga, was this Thursday reportedly spotted in full uniform despite having been officially retired.\n\nThe development sparked debate amid rumour that the former police boss was refusing to leave office citing reasons that he was not formally served with his retirement papers.\n\nPresident Emmerson Mnangagwa, for unknown reasons, retired Matanga starting January 1, 2025. Deputy Police Commissioner-General, Stephen Mutamba, was elevated to take over reins at Police General Headquarters (PGHQ).\n\nAn organisation claiming to represent children of war veterans has made sensational allegations that Matanga reported at his Harare offices and defended his move saying he was yet to receive official communication of his marching orders.\n\nMatanga reported to his office today in full police uniform. His argument is that he was not served with a letter of dismissal, he only saw the letter on social media, said COZWA.\n\nCOZWA proceeded to make sensational claims that the polices Support Unit, Alpha Troop had been put on standby to forcibly remove him from office.\n\nNational police spokesperson, Commissioner Paul Nyathi was not picking calls when NewZimbabwe.com reached out to him inorder to shed light on the matter.\n\nHowever, an invitation from Nyathis office calling on journalists to attend a handover-and-takeover ceremony on January 3, 2025, circulated Thursday, seemingly conveniently timed to diffuse reports of the unfolding drama at PGHQ. The historic event will take place at Mukushi Depot, formerly Morris Depot this Friday.\n\nMatanga took over from Augustine Chihuri, who fled the country after the November 2017 coup that toppled late President Robert Mugabe before President Emmerson Mnangagwa assumed office.\n\nChihuri was perceived to have been a member of Zanu PFs losing G40 faction whose members also fled and are now scattered across the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/13032459/Godwin-Matanga-ZRP.png",
            "description": "<p>By Staff Reporter AXED Zimbabwe Republic Police (ZRP) Commissioner-General, Godwin Matanga, was this Thursday reportedly spotted in full uniform despite having been officially retired. The development sparked debate amid rumour that the former police boss was refusing to leave office citing reasons that he was not formally served with his retirement papers. President Emmerson Mnangagwa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/retired-zrp-commissioner-general-matanga-spotted-wearing-full-uniform-sparking-speculation-of-discord-within-police-force/\">Retired ZRP Commissioner-General Matanga spotted wearing full uniform sparking speculation of discord within police force</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Resurgent star footballer Khama Billiat seals move to Scottland FC",
            "url": "https://www.newzimbabwe.com/resurgent-star-footballer-khama-billiat-seals-move-to-scottland-fc/",
            "content": "By Staff Reporter\n\nWARRIORSs resurgent star player, Khama Billiat has been confirmed as the latest addition to a potent Scottland Football Club lineup.\n\nBilliat, who was in the books of Prophet Walter Magayas Yadah last season, joins a side already bragging of having Soccer Star of the Year Walter Musona, Highlanders captain Peter Muduhwa and top scorer, Lynoth Chikuhwa.Khama is Scottish, read Scottland FCs bullish official post to confirm his move.Billiat moved back to Zimbabwe last season after an unsuccessful stint at South African side Kaizer Chiefs were the usual goals and assists became elusive.At Yadah he regained his touch, with his goals and assists earning him a spot on the Castle Lager premierships Best XI and a place among the best three as second runner up.Scottland FC owned by gold magnate Pedzisai Scott Sakupwanya, gained promotion into the topflight last season from the ZIFA Northern Region league.The monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\nBilliat, who was in the books of Prophet Walter Magayas Yadah last season, joins a side already bragging of having Soccer Star of the Year Walter Musona, Highlanders captain Peter Muduhwa and top scorer, Lynoth Chikuhwa.\n\nKhama is Scottish, read Scottland FCs bullish official post to confirm his move.Billiat moved back to Zimbabwe last season after an unsuccessful stint at South African side Kaizer Chiefs were the usual goals and assists became elusive.At Yadah he regained his touch, with his goals and assists earning him a spot on the Castle Lager premierships Best XI and a place among the best three as second runner up.Scottland FC owned by gold magnate Pedzisai Scott Sakupwanya, gained promotion into the topflight last season from the ZIFA Northern Region league.The monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\nKhama is Scottish, read Scottland FCs bullish official post to confirm his move.\n\nBilliat moved back to Zimbabwe last season after an unsuccessful stint at South African side Kaizer Chiefs were the usual goals and assists became elusive.At Yadah he regained his touch, with his goals and assists earning him a spot on the Castle Lager premierships Best XI and a place among the best three as second runner up.Scottland FC owned by gold magnate Pedzisai Scott Sakupwanya, gained promotion into the topflight last season from the ZIFA Northern Region league.The monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\nBilliat moved back to Zimbabwe last season after an unsuccessful stint at South African side Kaizer Chiefs were the usual goals and assists became elusive.\n\nAt Yadah he regained his touch, with his goals and assists earning him a spot on the Castle Lager premierships Best XI and a place among the best three as second runner up.Scottland FC owned by gold magnate Pedzisai Scott Sakupwanya, gained promotion into the topflight last season from the ZIFA Northern Region league.The monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\nAt Yadah he regained his touch, with his goals and assists earning him a spot on the Castle Lager premierships Best XI and a place among the best three as second runner up.\n\nScottland FC owned by gold magnate Pedzisai Scott Sakupwanya, gained promotion into the topflight last season from the ZIFA Northern Region league.The monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\nScottland FC owned by gold magnate Pedzisai Scott Sakupwanya, gained promotion into the topflight last season from the ZIFA Northern Region league.\n\nThe monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\nThe monied side is the newest of Zimbabwes wealthy clubs, and has been beefing up its squad ahead of the 2025 season, which its proprietor believes the team will clinch.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/18131249/Khama-Billiat.jpg.webp",
            "description": "<p>By Staff Reporter WARRIORS’s resurgent star player, Khama Billiat has been confirmed as the latest addition to a potent Scottland Football Club lineup. Billiat, who was in the books of Prophet Walter Magaya’s Yadah last season, joins a side already bragging of having Soccer Star of the Year Walter Musona, Highlanders captain Peter Muduhwa and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/resurgent-star-footballer-khama-billiat-seals-move-to-scottland-fc/\">Resurgent star footballer Khama Billiat seals move to Scottland FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Boy of eight survives five days in lion-inhabited game park",
            "url": "https://www.newzimbabwe.com/boy-of-eight-survives-five-days-in-lion-inhabited-game-park/",
            "content": "By BBC\n\nAN eight-year-old boy has been found alive after surviving five days in a game park inhabited by lions and elephants in northern Zimbabwe, according to a member of parliament.\n\nThe ordeal began when Tinotenda Pudu wandered 23 km (14 miles) from home into the perilous Matusadona Game Park, said Mashonaland West MP Mutsa Murombedzi on X.\n\nHe spent five days sleeping on a rocky perch, amidst roaring lions, passing elephants, eating wild fruits, she said.\n\nMatusadona game park has about 40 lions. At one point, it had one of the highest lion population densities in Africa, according to African Parks.\n\nMurombedzi said the boy used his knowledge of the wild and survival skills to stay alive.\n\nTinotenda survived his ordeal by eating wild fruit. He also dug small wells into dry riverbeds with a stick to access drinking water  a skill taught in the drought-prone area.\n\nMembers of the local Nyaminyami community started a search party and beat drums each day to try and guide him back home.\n\nBut ultimately, it was park rangers who managed to find him.\n\nOn his fifth day in the wild, Tinotenda heard a rangers car and ran toward it, narrowly missing it, the MP said.\n\nLuckily, the rangers returned, spotted fresh little human footprints, and searched the area until they found him.\n\nThis was probably his last chance of being rescued after 5 days in the wilderness, said the MP.\n\nThe park is over 1,470 sq km (570 sq miles) and is home to zebras, elephants, hippos, lions and antelope.\n\nAcross social media, people have been praising the young boy for his resilience.\n\nThis is beyond human comprehension, one person wrote on X.\n\nAnother user wrote: Hes going to have one hell of a story to tell when he gets back to school.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/02163507/e3fc1860-c90a-11ef-b64d-9d290e039e0a.jpg.webp",
            "description": "<p>By BBC  AN eight-year-old boy has been found alive after surviving five days in a game park inhabited by lions and elephants in northern Zimbabwe, according to a member of parliament. The ordeal began when Tinotenda Pudu wandered 23 km (14 miles) from home into the “perilous” Matusadona Game Park, said Mashonaland West MP Mutsa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boy-of-eight-survives-five-days-in-lion-inhabited-game-park/\">Boy of eight survives five days in lion-inhabited game park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        },
        {
            "title": "Springbok captain Siya Kolisi’s heart-warming family getaway in Zimbabwe",
            "url": "https://www.newzimbabwe.com/springbok-captain-siya-kolisis-heart-warming-family-getaway-in-zimbabwe/",
            "content": "By IOL\n\nIN a heart-warming display of family bonding, Springbok captain Siya Kolisi has taken to the scenic landscapes of Zimbabwe for a holiday getaway with his children.\n\nThe trip comes just a few months after the South African rugby star amicably parted ways with his wife, Rachel Kolisi, marking a new chapter in his life.Documenting their adventures, Siya shared, on Instagram, a series of joyful moments with his biological children, Nicholas Siyamthanda and Keziah and his adopted half-siblings, Liyema and Liphelo, showcasing the essence of togetherness.The stunning backdrop of Victoria Falls served as a spectacular starting point for their trip, where the family enjoyed splashing around in the river, making unforgettable memories in one of Africas most iconic natural wonders.From exhilarating helicopter rides soaring above the breathtaking scenery to the nostalgic charm of train excursions, every experience was filled with laughter and excitement.A highlight of the holiday was a thrilling night-time safari drive, where the family, armed with eager anticipation, witnessed the enchanting nocturnal wildlife that the region is renowned for.This getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.Siyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nThe trip comes just a few months after the South African rugby star amicably parted ways with his wife, Rachel Kolisi, marking a new chapter in his life.\n\nDocumenting their adventures, Siya shared, on Instagram, a series of joyful moments with his biological children, Nicholas Siyamthanda and Keziah and his adopted half-siblings, Liyema and Liphelo, showcasing the essence of togetherness.The stunning backdrop of Victoria Falls served as a spectacular starting point for their trip, where the family enjoyed splashing around in the river, making unforgettable memories in one of Africas most iconic natural wonders.From exhilarating helicopter rides soaring above the breathtaking scenery to the nostalgic charm of train excursions, every experience was filled with laughter and excitement.A highlight of the holiday was a thrilling night-time safari drive, where the family, armed with eager anticipation, witnessed the enchanting nocturnal wildlife that the region is renowned for.This getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.Siyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nDocumenting their adventures, Siya shared, on Instagram, a series of joyful moments with his biological children, Nicholas Siyamthanda and Keziah and his adopted half-siblings, Liyema and Liphelo, showcasing the essence of togetherness.\n\nThe stunning backdrop of Victoria Falls served as a spectacular starting point for their trip, where the family enjoyed splashing around in the river, making unforgettable memories in one of Africas most iconic natural wonders.From exhilarating helicopter rides soaring above the breathtaking scenery to the nostalgic charm of train excursions, every experience was filled with laughter and excitement.A highlight of the holiday was a thrilling night-time safari drive, where the family, armed with eager anticipation, witnessed the enchanting nocturnal wildlife that the region is renowned for.This getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.Siyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nThe stunning backdrop of Victoria Falls served as a spectacular starting point for their trip, where the family enjoyed splashing around in the river, making unforgettable memories in one of Africas most iconic natural wonders.\n\nFrom exhilarating helicopter rides soaring above the breathtaking scenery to the nostalgic charm of train excursions, every experience was filled with laughter and excitement.A highlight of the holiday was a thrilling night-time safari drive, where the family, armed with eager anticipation, witnessed the enchanting nocturnal wildlife that the region is renowned for.This getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.Siyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nFrom exhilarating helicopter rides soaring above the breathtaking scenery to the nostalgic charm of train excursions, every experience was filled with laughter and excitement.\n\nA highlight of the holiday was a thrilling night-time safari drive, where the family, armed with eager anticipation, witnessed the enchanting nocturnal wildlife that the region is renowned for.This getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.Siyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nA highlight of the holiday was a thrilling night-time safari drive, where the family, armed with eager anticipation, witnessed the enchanting nocturnal wildlife that the region is renowned for.\n\nThis getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.Siyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nThis getaway represents not only a well-deserved respite for Siya after a demanding rugby season but also the first vacation he has taken with his family since becoming a single dad.\n\nSiyas commitment to nurturing his family during this transition is evident.As the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nSiyas commitment to nurturing his family during this transition is evident.\n\nAs the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\nAs the Kolisi family immerse themselves in the beauty and culture of Zimbabwe, fans and followers have lauded the rugby star for showcasing the joy of taking family time seriously, even amidst personal challenges.\n\n@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\n@mantsundu1 commented: Quality time with the kids  Keep up the good work. Thanks for sharing your now reality. You are so real. Somehow for me, you being a present father to those kids means a lot. The last slide about God is beautiful. God has it already figured out. We surrender all to Him.\n\n@tytybrown25 wrote: This man is really a good dad and human I (love) him.@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\n@tytybrown25 wrote: This man is really a good dad and human I (love) him.\n\n@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\n@athindyali said: You are a true inspiration mhlobam, may God give you renewal in strength, grace and love in this new year. We are proud.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/02124351/Siya-Kolisi-with-his-kids-and-half-siblings-at-Victoria-Falls-in-Zimbabwe-Picture-Instagram.webp",
            "description": "<p>By IOL IN a heart-warming display of family bonding, Springbok captain Siya Kolisi has taken to the scenic landscapes of Zimbabwe for a holiday getaway with his children. The trip comes just a few months after the South African rugby star amicably parted ways with his wife, Rachel Kolisi, marking a new chapter in his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/springbok-captain-siya-kolisis-heart-warming-family-getaway-in-zimbabwe/\">Springbok captain Siya Kolisi’s heart-warming family getaway in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "03 Jan 2025"
        }
    ]
}