{
    "news": [
        {
            "title": "Wicknell Chivayo flaunts his wealth again, offers veteran broadcaster 2025 Land Cruiser, US$100,000 cash",
            "url": "https://www.newzimbabwe.com/wicknell-chivayo-flaunts-his-wealth-again-offers-veteran-broadcaster-2025-land-cruiser-us100000-cash/",
            "content": "By Staff Reporter\n\nWicknell Chivayo\n\nWICKNELL Chivayo, a figure often embroiled in controversy and dubbed Zimbabwes tenderpreneur, has once more made headlines with his latest act of largesse.\n\nThis Thursday, the businessman presented veteran Zimbabwe Broadcasting Corporation (ZBC) journalist Reuben Barwe with a brand-new 2025 Toyota Land Cruiser VXR LX 300 Series, accompanied by a hefty US$100,000 in cash.\n\nChivayo, whose sources of income have come under scrutiny, appears to have a price for anyone in the country at the moment.\n\nCritics have questioned why the businessmans heart is not moved by Zimbabwes crumbling public healthcare system, where many expect him to seed more resources to save lives.\n\nIn response, Chivayo asserted that he does as he pleases with his own money, and no one should dictate how he spends it.\n\nOn Thursday morning, Chivayo took to X (formerly Twitter) to announce his generosity towards Barwe, who has dedicated over 30 years to ZBC.\n\nReuben Barwe\n\nIn recognition of the decades of your professional and loyal dedication to the national broadcaster and in honour of your patriotism, your excellence and resolute service as one of Zimbabwes finest journalists and news reporters, a big congratulations to you Mr Reuben Barwe.Please go and see Farai at FARAMATSI Motors, Club Chambers Showroom, corner 3rd Street and Nelson Mandela Avenue  your brand new 2025 Toyota Land Cruiser VXR LX 300 series is ready for collection and fully paid for, Chivayo wrote on X.Alongside the vehicle, Chivayo also gifted Barwe US$100,000 in cash, describing it as a token to help him stay afloat  a pocket money gesture in the rough waters of Zimbabwes economic climate.To keep you afloat, a small token of US$100,000 in cash pocket money is also ready for collection from my lawyer Mr Sikhumbuzo Mpofu at Munangati and Associates at your earliest convenience, he added.President Emmerson Mnangagwa was once asked to clarify Chivayos activities but chose instead to describe the businessman as a genuine philanthropist, asserting that he could not dictate how Chivayo utilises his wealth.However, earlier this year, without mentioning Chivayo by name, Vice President Constantino Chiwenga described certain individuals as zviganandaa Shona term meaning people who loot State resources shamelessly and then retreat into the shadows.\n\nIn recognition of the decades of your professional and loyal dedication to the national broadcaster and in honour of your patriotism, your excellence and resolute service as one of Zimbabwes finest journalists and news reporters, a big congratulations to you Mr Reuben Barwe.\n\nPlease go and see Farai at FARAMATSI Motors, Club Chambers Showroom, corner 3rd Street and Nelson Mandela Avenue  your brand new 2025 Toyota Land Cruiser VXR LX 300 series is ready for collection and fully paid for, Chivayo wrote on X.\n\nAlongside the vehicle, Chivayo also gifted Barwe US$100,000 in cash, describing it as a token to help him stay afloat  a pocket money gesture in the rough waters of Zimbabwes economic climate.\n\nTo keep you afloat, a small token of US$100,000 in cash pocket money is also ready for collection from my lawyer Mr Sikhumbuzo Mpofu at Munangati and Associates at your earliest convenience, he added.\n\nPresident Emmerson Mnangagwa was once asked to clarify Chivayos activities but chose instead to describe the businessman as a genuine philanthropist, asserting that he could not dictate how Chivayo utilises his wealth.\n\nHowever, earlier this year, without mentioning Chivayo by name, Vice President Constantino Chiwenga described certain individuals as zviganandaa Shona term meaning people who loot State resources shamelessly and then retreat into the shadows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22170835/Gridx4uWkAA1cPR.jpeg",
            "description": "<p>By Staff Reporter WICKNELL Chivayo, a figure often embroiled in controversy and dubbed Zimbabwe’s “tenderpreneur,” has once more made headlines with his latest act of largesse. This Thursday, the businessman presented veteran Zimbabwe Broadcasting Corporation (ZBC) journalist Reuben Barwe with a brand-new 2025 Toyota Land Cruiser VXR LX 300 Series, accompanied by a hefty US$100,000</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wicknell-chivayo-flaunts-his-wealth-again-offers-veteran-broadcaster-2025-land-cruiser-us100000-cash/\">Wicknell Chivayo flaunts his wealth again, offers veteran broadcaster 2025 Land Cruiser, US$100,000 cash </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "22 May 2025"
        },
        {
            "title": "X restricted in Tanzania after police targeted by hackers",
            "url": "https://www.newzimbabwe.com/x-restricted-in-tanzania-after-police-targeted-by-hackers/",
            "content": "BBC\n\nAccess to the social media platform X has been restricted in Tanzania after some official accounts of government and private institutions were targeted by hackers.\n\nOn Tuesday, the official police account was compromised, with sexually explicit material and false information that the president had died being posted.\n\nThe police dissociated itself from the information and said an investigation was under way to identify those responsible.\n\nHours later data from the internet monitoring organisationNetblocks showed that X was unreachable on major internet providersacross the country.\n\nUsers in Dar es Salaam, the countrys biggest city, could still not access the site on Wednesday, unless they use virtual private networks (VPNs), which is illegal without a permit, although some people in other regions indicated they were able to log on.\n\nThe authorities have not commented on whether they are blocking access to X.\n\nBut Information Minister Jerry Silaa has acknowledged the hacking and assured MPs in parliament that the affected government social media accounts had since been secured.\n\nEarlier, government spokesman Gerson Msigwa warned those responsible that immediate action was being taken.\n\nThe problems with accessing X come amid the continued uproar over the deportation of prominent Kenyans  a move that prevented them from attending the court case of opposition leader Tundu Lissu, who is accused of treason.\n\nOn Monday, the presidentwarned activists from its northern neighbourthat she would not allow them to meddle in her countrys affairs and cause chaos.\n\nShe spoke after Kenyas former Justice Minister Martha Karua along with some others, who had all travelled to attend Lissus court case, were deported.\n\nAnother Kenyan activist, Boniface Mwangi, and Ugandan Agather Atuhaire were arrested in Dar es Salaam by suspected military officers on Monday and their whereabouts remain unknown.\n\nTanzanian authorities have not commented on their whereabouts.\n\nMwangis wife, Njeri, told the BBCs Newsday programme that she had last heard from him on Monday and had not been able to establish where he was.\n\nIm actually concerned for his life. I know my husband, he would have communicated, hed find a way to call or text me and because he hasnt, makes me very worried about what state he is in, she said.\n\nBoniface Mwabukusi, the president of the Tanganyika Law Society, the body representing lawyers in mainland Tanzania, said on Wednesday that they had learnt that the two were being held by the immigration department. He had earlier said they had been deported.\n\nOur legal team on the ground is actively monitoring the situation and exploring appropriate legal remedies to facilitate a just and timely resolution, he said on X.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22052550/tanzania-police.webp",
            "description": "<p>BBC Access to the social media platform X has been restricted in Tanzania after some official accounts of government and private institutions were targeted by hackers. On Tuesday, the official police account was compromised, with sexually explicit material and false information that the president had died being posted. The police dissociated itself from the information</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/x-restricted-in-tanzania-after-police-targeted-by-hackers/\">X restricted in Tanzania after police targeted by hackers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "22 May 2025"
        },
        {
            "title": "US singer Chris Brown granted $6.7 million bail for world tour by UK court",
            "url": "https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/",
            "content": "U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22052415/chris-brown.jpg",
            "description": "<p>Reuters U.S. singer Chris Brown was granted bail by a London court on Wednesday over a charge of serious assault after promising to pay a 5 million-pound ($6.7 million) security fee, clearing the way for his world tour to begin next month. Brown has been charged with inflicting grievous bodily harm in what prosecutors said was an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-singer-chris-brown-granted-6-7-million-bail-for-world-tour-by-uk-court/\">US singer Chris Brown granted $6.7 million bail for world tour by UK court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "22 May 2025"
        },
        {
            "title": "‘We won’t bow to imperialism’: Malema defends EFF stance after Trump plays ‘Kill the Boer’ clip",
            "url": "https://www.newzimbabwe.com/we-wont-bow-to-imperialism-malema-defends-eff-stance-after-trump-plays-kill-the-boer-clip/",
            "content": "IOL\n\nEconomic Freedom Fighters (EFF) leader Julius Malema has dismissed the high-level meeting between Presidents Cyril Ramaphosa and Donald Trump at the White House, describing it as a group of older men meeting to gossip about me.\n\nThis remark comes after Trump paused the meeting on Wednesday to show a video montage of Malema chanting Kill the Boer, subsequently questioning why the EFF leader had not been arrested for using the controversial liberation-era slogan.\n\nIn response, Malema maintained that there is no credible intelligence or evidence to support the claim of a white genocide in South Africa. He also reiterated the EFFs firm stance on land reform.\n\nWe will not agree to compromise our political principles on land expropriation without compensation for political expediency, he said on X (formerly Twitter).\n\nIn a statement, the EFF condemned the meeting and said they never bow and succumb to imperialism.\n\nThe EFF is proud that its legislative and political agenda, led by the President and Commander in Chief Julius Malema has shaken the corridors of imperialism in Washington\n\nAs a result, the EFF is concerned by this call that something must be done to stop the EFF President from chanting a liberation heritage song, the EFF said.\n\nThe red berets said it would continue to follow the developments in Washington.\n\nPlay Video\n\nMeanwhile, the party has reiterated that they will oppose any compromising of our laws to allow Starlink to operate in South Africa.\n\nWe will oppose any reversal of transformative legislation, including that which will allow for expropriation of land, it said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/22051912/Screenshot-2025-05-22-at-06.18.33.png",
            "description": "<p>IOL Economic Freedom Fighters (EFF) leader Julius Malema has dismissed the high-level meeting between Presidents Cyril Ramaphosa and Donald Trump at the White House, describing it as “a group of older men meeting to gossip about me.” This remark comes after Trump paused the meeting on Wednesday to show a video montage of Malema chanting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-wont-bow-to-imperialism-malema-defends-eff-stance-after-trump-plays-kill-the-boer-clip/\">‘We won’t bow to imperialism’: Malema defends EFF stance after Trump plays ‘Kill the Boer’ clip</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "22 May 2025"
        },
        {
            "title": "MPs grill Kambamura over delays in tabling Mines and Minerals Amendment Bill, EPOs as foreigners take over sector",
            "url": "https://www.newzimbabwe.com/mps-grill-kambamura-over-delays-in-tabling-mines-and-minerals-amendment-bill-epos-as-foreigners-take-over-sector/",
            "content": "By Anna Chibamu\n\nZANU PF legislators, Wednesday grilled Mines and Mining DevelopmentDeputy Minister Polite Kambamura over delays in the tabling of the Mines and Minerals Amendment Bill in the National Assembly.\n\nThe MP alleged that Zimbabweans rights to mining were being undermined as the bill has been kept out of Parliament for too long.\n\nAs of March 26, 2025, the Bill status reads: Bill proofs transmitted to Attorney Generals Office.\n\nGokwe-Kabuyuni MP Spencer Tshuma said the delays in amending the bill had a negative bearing on how mining rights were awarded to citizens, as foreign nationals have an upper hand, leaving out hungry locals.\n\nDuring the question and answer (Q and A) session,Tshuma alleged thatlocals were also being charged the same fees asforeigners.\n\nLooking at the delays in the Mines and Minerals Amendment Bill to this August House so that it is reviewed, what is government doing to ensure that those who are in mining will be accorded different rights from foreign miners?\n\nWe are noting that at the moment they are treated the same from the monies that they pay during the pegging of mines and even in paying their taxes, and that our local people are given rights as citizens of this nation compared to foreigners.\n\nWe have been anticipating this new law for quite some time, and it has been a long time since the 9th Parliament. What is happening, Madam Speaker, is that mining is going on and our minerals are being exploited whilst we are waiting for the law? Tshuma said.\n\nLegislators have in the past also accused the government of mortgaging minerals to foreigners at the expense of citizens who are languishing in poverty.\n\nFurther, Tshuma demanded an explanation on the delays from the deputy minister.\n\nSo, may the Hon. Minister explain how long it is going to take and the challenges that are preventing the new law from coming to this august House so that it is tabled in Parliament and discussed, instead of foreign companies coming to take all the money? Tshuma said.\n\nMedia reports have shown that Chinese-owned companies are flooding the mining sector, violating Environmental and Mining laws, causing devastating land degradation.\n\nGoromonzi West constituency MP Biata Beatrice Karimatsenga-Nyamupinga on EPOs said: When local people apply so that they get the applications processed, they do not succeed, but foreign miners are found mining in schools and in other protected places or in other gazetted places.\n\nOur locals should be able to go to such places and their applications must also be treated with priority over the foreign applications.\n\nZanu PF Rushinga MP Tendai Nyabani urged the Mines Ministry to follow up on miners as most cheat on the value and type of mineral being mined, thereby paying less royalties to the State.\n\nWill the government make a follow-up to check exactly what the miner is mining for, because sometimes they might peg mining minerals of lesser value, yet they are mining some precious minerals?\n\nKambamura saidthat all raised issues would be looked at in the new bill.\n\nWe are reviewing and are going to be looking at these issues. When someone comes from outside the country to bring investment, they should have a substantial investment.\n\nWe cannot just allow people who come into the mining sector without a significant amount of investment.\n\nWe are going to enact a law that stipulates that foreign investors should give locals opportunities to be employed. We have noticed that most investors bring their workers from their countries, who sometimes do not share the technical expertise with locals, the deputy minister responded.\n\nKambamura assured the legislatorsthat locals are going to be prioritised in the next few months.\n\nWe are going to ensure that small-scale miners or the sector will only be for black local Zimbabweans.\n\nRegarding delays in gazetting of the bill, he explained: In the past few days, we gazetted the Act and some sections were noted that needed editing.\n\nSo, the Attorney Generals Office is reviewing such errors, such mistakes which are going to be corrected then it will be regazetted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/19231053/Deputy-Mines-Minister-Polite-Kambamura.png",
            "description": "<p>By Anna Chibamu ZANU PF legislators, Wednesday grilled Mines and Mining Development Deputy Minister Polite Kambamura over delays in the tabling of the Mines and Minerals Amendment Bill in the National Assembly. The MP alleged that Zimbabweans’ rights to mining were being undermined as the bill has been kept out of Parliament for too long. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mps-grill-kambamura-over-delays-in-tabling-mines-and-minerals-amendment-bill-epos-as-foreigners-take-over-sector/\">MPs grill Kambamura over delays in tabling Mines and Minerals Amendment Bill, EPOs as foreigners take over sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "22 May 2025"
        },
        {
            "title": "Govt to allocate 50,000 residential stands to war veterans",
            "url": "https://www.newzimbabwe.com/govt-to-allocate-50000-residential-stands-to-war-veterans/",
            "content": "By Tapiwa Svondo\n\nWar veterans are set to benefit from an initiative which will see the allocation and development of 50,000 residential stands from the government.\n\nThe Ministry of Local Government and Public Works, the Ministry of the Veterans of the Liberation Struggle Affairs, and the CEO of Prevail Private Limited International, Paul Tungwarara, who is set to develop the land, signed a tripartite agreement on Tuesday.\n\nLocal government minister Daniel Garwe said this program will cover all ten provinces in Zimbabwe.\n\nAs we may be aware that section 23 of the Constitution of Zimbabwe has provisions for looking after war veterans in terms of quarter system that 20 percent of the developments taking place in the country in various economic spheres must be set aside for war veterans.\n\nAs the Ministry of local government, we are here to honor that provision in the constitution by today signing a Memorandum of Agreement, between the ministry of local government and public works, the ministry of war veterans affairs and our developer for the construction to completion of developments for stands for war veterans throughout our 10 provinces, said Garwe.\n\nThe Minister of War Veterans, Monica Mavhunga said 50,000 war veterans are set to benefit during the first phase.\n\nThe first phase is to benefit about 50,000 war veterans which is a substantial number and as a ministry responsible for the identification and the final allocation of these stands we are going to do this transparently and we promise everyone in this country that we are not going to be found on the side of those who are corrupt, it mean we are going to do our work transparently, she said.\n\nGarwe said his ministry will ensure that suitable land is identified and no issues will arise in the future, which will result in demolitions.\n\nAdded Garwe, What we are going to do as the Ministry of local government and public works is to identify suitable land where we will then invite the developer to come and provide the road network, water and sewer reticulation and other services that fall under the first line of services.\n\nWe are the Ministry responsible of ensuring that we follow the law in terms of providing developed pieces of land for housing purposes. We will not witness a situation where the developer will be allocated a wetland as a piece of land for this program, it is not happening and we are the Ministry responsible for ensuring that the urban councils act is being respected by anyone including ourselves.\n\nSo there is no way you will find people coming to demolish these houses that the war veterans were building on properly planned survey and governed settlements it will not happen, dont worry about that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21201825/219058-scaled.jpg",
            "description": "<p>By Tapiwa Svondo War veterans are set to benefit from an initiative which will see the allocation and development of 50,000 residential stands from the government. The Ministry of Local Government and Public Works, the Ministry of the Veterans of the Liberation Struggle Affairs, and the CEO of Prevail Private Limited International, Paul Tungwarara, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-to-allocate-50000-residential-stands-to-war-veterans/\">Govt to allocate 50,000 residential stands to war veterans </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "22 May 2025"
        }
    ]
}