{
    "news": [
        {
            "title": "ZAA announces strategic partnership with Lake City Project",
            "url": "https://www.newzimbabwe.com/zaa-announces-strategic-partnership-with-lake-city-project/",
            "content": "By Own Correspondent\n\nHarare, Zimbabwe  August 2025  The Zimbabwe Achievers Awards (ZAA), a global platform that celebrates and connects outstanding Zimbabweans across the world, is proud to announce a groundbreaking partnership with Lake City, the visionary smart urban development on the shores of Lake Chivero.\n\nThis collaboration unites two forward-looking initiatives: ZAAs mission of championing Zimbabwean excellence and diaspora engagement, and Lake Citys ambition to become Zimbabwes first modern eco-smart city, blending housing, tourism, technology, and sustainable living.\n\nA Shared Vision for the Future\n\nLake City is designed as an 829-hectare mixed-use community, featuring residential, commercial, tourism, and leisure infrastructure. With more than 7,000 planned structures set to house 40,000 residents, the project will redefine urban living while creating thousands of jobs in the coming decade.\n\nThrough this partnership, ZAA will:\n\nLake City Tour  1st September 2025\n\nAs part of this partnership, a special guided tour of the Lake City site will take place on Monday, 1st September 2025, offering stakeholders, diaspora delegates, and media a first-hand experience of the vision taking shape on the shores of Lake Chivero. The tour will provide an exclusive opportunity to see progress, engage with developers, and explore the immense potential for collaboration and investment.\n\nSpeaking on the partnership, Conrad Mwanza, ZAA Founder and Global Chairman, said: ZAA has always believed that Zimbabwes greatest resource is its people, at home and abroad. Lake City represents the future of Zimbabwe  a space where innovation, lifestyle, and opportunity converge. Together, we will connect Zimbabwes global community to this transformative project and make it a reality that benefits generations.\n\nTapiwa Nyandoro, Chairman of Lake City, added: Lake City is more than a housing project  it is the birth of a new Zimbabwean city. Our vision is to create a modern, sustainable community that attracts investment, inspires pride, and sets new standards for urban development in Africa. Partnering with ZAA allows us to tell this story to Zimbabweans worldwide and invite them to be part of building the future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/25152317/nyandoro-tapiwa_.png",
            "description": "<p>By Own Correspondent Harare, Zimbabwe – August 2025 — The Zimbabwe Achievers Awards (ZAA), a global platform that celebrates and connects outstanding Zimbabweans across the world, is proud to announce a groundbreaking partnership with Lake City, the visionary smart urban development on the shores of Lake Chivero. This collaboration unites two forward-looking initiatives: ZAA’s mission</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zaa-announces-strategic-partnership-with-lake-city-project/\">ZAA announces strategic partnership with Lake City Project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Aug 2025"
        },
        {
            "title": "Zimbabwe’s public debt servicing crisis leaves countless mothers grieving",
            "url": "https://www.newzimbabwe.com/zimbabwes-public-debt-servicing-crisis-leaves-countless-mothers-grieving/",
            "content": "By Kudzai Tamary Chikiwa | Global Voices\n\nZimbabwes public debt servicing crisis has had far-reaching consequences for the countrys healthcare system. With a significant portion of thenational budgetdedicated to debt repayment, the healthcare sector has been left underfunded and understaffed. This has resulted in a shortage of critical equipment, medicines, and healthcare personnel, ultimately affecting the quality of care provided to patients.The story of Memory Ncube, a Zimbabwean motherand her baby, Tendai, is a tragic illustration of the human cost of this crisis.\n\nIn the quiet moments, Memorys mind wanders back to the day her world shattered. Her preterm baby girl, Tendai, had been fighting for her life, struggling with respiratory distress syndrome (RDS). In a bid to save the new life, Memory was transferred from rural Zvishavane district hospital toMpilo Central HospitalinBulawayo, Zimbabwes second-largest city. This was not because the doctors in Zvishavane were incompetent, but because they lacked the necessary equipment, including a continuous positive airway pressure (CPAP) machine.\n\nFull of hope that her child would make it, Memory traveled 185 kilometers (114.954 miles) toMpilo Central Hospital, which is one of the referral hospitals for patients from the Southern region of Zimbabwe. Recently, the hospital received a lifeline in the form of a donation from theHigherlife Foundation, which provided critical equipment, including CPAP machines, suction machines, monitors, jaundice meters, and phototherapy machines. Prior to this donation, the hospital had been grappling with a shortage of equipment, often resulting in premature deaths of patients.\n\nHowever, tragically for this family, when she arrived at the hospital, it was too late, and her daughter had died. She sobbingly recalled her babys death:\n\nMy heart breaks when I think of what happened to my daughter. If only there was equipment at the hospital, I was not going to travel all this way with a critical baby. I wish the government knew the devastating impact of not servicing public hospitals.\n\nZimbabwes public debt servicing has become a suffocating burden, squeezing the life out of the healthcare system. Witha total public debt of approximately USD 21.53 billion, with much of it owed to the World Bank, China, France, and other international creditors, the governments debt repayment obligations are consuming a significant chunk of the national budget. In the 2025 budget, theMinistry of Health and Child Carewas allocated ZWD 27.8 billion (approximately USD 1.039 billion), just 7.1 percent of public spending, which falls short of theAbuja Declarations 15 percent allocation target.\n\nTheAbuja Declarationis a commitment made byAfrican Unionmember states, including Zimbabwe, in 2001 to allocate at least 15 percent of their national budgets to improve the healthcare system.\n\nFinance Minister Mthuli Ncube has defended the move, saying,\n\nWe need to go through some period of austerity, but the same builds us towards prosperity.\n\nHowever, for Memory and countless other mothers, the prosperity promised seems a distant dream. Memorys baby is just one of many newborns who die before they reach one month in Zimbabwe. The neonatal mortality rate in Zimbabwe stands at37 deaths per 1,000 live births, a grim statistic that reflects the human cost of inadequate healthcare funding.\n\nCommunity Working Group on Health ZimbabweExecutive Director Itai Rusike concurred that the health sector remains distressed due to public debt servicing. He explained:\n\nShortages in healthcare personnel, inadequate infrastructure, high disease burden, and expensive specialist services continue to affect service delivery. These systemic issues are compounded by low public spending on health and weak financial protection mechanisms. Unfortunately, its the poor who suffer the most.\n\nHe emphasised the need for increased investment in building a robust and accessible health system, particularly in rural areas. He noted:\n\nAchieving universal health coverage requires strong public funding and a commitment to treating healthcare as a fundamental right.\n\nTo challenge economic injustice and notorious austerity measures, organizations like theEconomic Justice for Women Projectare educating women on public finances. The project aims to empower women with knowledge about public debt and its impact on service delivery, enabling them to advocate for change. Director Margaret Mutsamvi said:\n\nIssues to do with public debt seem complicated and elitist, but we are now going down to communities to educate them. We take time to explain to them the nexus between public debt servicing and service delivery. This can help them challenge the status quo from an informed perspective.\n\nMutsamvi reiterated that when a government introduces austerity measures in favor of public debt servicing, its the ordinary citizens who suffer.\n\nRight now, our health system is in shambles because a huge chunk of money is put towards clearing external and internal debt. The ordinary people suffer; this is why we have a high neonatal mortality rate in Zimbabwe. Women are the most affected, as they bear the brunt of austerity measures.\n\nShe added:\n\nWhen the government is prioritising public debt servicing it affects public hospitals. This is why there is a rise of privatisation of health facilities, mushrooming of private hospitals, clinics and pharmacies. Sometimes we have seen cases where there are no painkillers in hospitals and its even worse in rural areas. When the government is not funding, Its a woman who is paying for it.\n\nShe continued:\n\nWomen bear the pain of losing a child, caring for the sick at home and going through all the emotional stress. This is unpaid carework.\n\nThe story of Memory and her baby, Tendai, is a heartbreaking reminder of the human cost of Zimbabwes debt crisis. It is a call to action for policymakers to prioritize the health and well-being of the nations most vulnerable citizens.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/25093648/CURE_Childrens_Hospital_of_Zimbabwe-1200x675-1.jpg",
            "description": "<p>By Kudzai Tamary Chikiwa | Global Voices Zimbabwe’s public debt servicing crisis has had far-reaching consequences for the country’s healthcare system. With a significant portion of the national budget dedicated to debt repayment, the healthcare sector has been left underfunded and understaffed. This has resulted in a shortage of critical equipment, medicines, and healthcare personnel, ultimately affecting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-public-debt-servicing-crisis-leaves-countless-mothers-grieving/\">Zimbabwe’s public debt servicing crisis leaves countless mothers grieving</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Aug 2025"
        },
        {
            "title": "Zimbabwe seeks stronger diamond ties with India",
            "url": "https://www.newzimbabwe.com/zimbabwe-seeks-stronger-diamond-ties-with-india/",
            "content": "Zimbabwes Vice President Constantino Chiwenga visited Surat, India last week to discuss direct trade links that would allow it to bypass intermediaries and sell goods directly to Indian manufacturers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/29170900/Chiwenga.jpeg",
            "description": "<p>IDEX Online Zimbabwe’s Vice President Constantino Chiwenga visited Surat, India last week to discuss direct trade links that would allow it to bypass intermediaries and sell goods directly to Indian manufacturers. He also invited Indian investors and diamantaires to consider direct investments and joint ventures in Zimbabwe’s mineral processing and industrial sectors. Zimbabwe is now</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-seeks-stronger-diamond-ties-with-india/\">Zimbabwe seeks stronger diamond ties with India</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Aug 2025"
        },
        {
            "title": "Dynamos coach Kaindu demands more from his players despite victory over Green Fuel FC",
            "url": "https://www.newzimbabwe.com/dynamos-coach-kaindu-demands-more-from-his-players-despite-victory-over-green-fuel-fc/",
            "content": "By Sports Reporter\n\nDYNAMOS coach Kelvin Kaindu was not impressed with his teams performance despite picking maximum points from a 2-0 win against Green Fuel at Rufaro Stadium in Harare.\n\nSundays victory was Dynamos third consecutive win under Kaindu, who remains undefeated since his appointment in July.Dembares win was facilitated by Jaison Kasondo and Temptation Chiwunga (penalty), scoring in the 54th and 58th minute, respectively.Inspire of the triumph at the weekend, Dembare maintains its second-from-last position on the log; however, they closed the gap on Green Fuel, who are now on 27 points.Commenting on his teams performance after the win, Kaindu was ambivalent.Overall play, I think this was an average performance from the team, and I think even in our planning that todays game was going to be very difficult for us, and this is what happened.But at the end of the day, its winning that matters, and we thank God as we push forward.Dembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nSundays victory was Dynamos third consecutive win under Kaindu, who remains undefeated since his appointment in July.\n\nDembares win was facilitated by Jaison Kasondo and Temptation Chiwunga (penalty), scoring in the 54th and 58th minute, respectively.Inspire of the triumph at the weekend, Dembare maintains its second-from-last position on the log; however, they closed the gap on Green Fuel, who are now on 27 points.Commenting on his teams performance after the win, Kaindu was ambivalent.Overall play, I think this was an average performance from the team, and I think even in our planning that todays game was going to be very difficult for us, and this is what happened.But at the end of the day, its winning that matters, and we thank God as we push forward.Dembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nDembares win was facilitated by Jaison Kasondo and Temptation Chiwunga (penalty), scoring in the 54th and 58th minute, respectively.\n\nInspire of the triumph at the weekend, Dembare maintains its second-from-last position on the log; however, they closed the gap on Green Fuel, who are now on 27 points.Commenting on his teams performance after the win, Kaindu was ambivalent.Overall play, I think this was an average performance from the team, and I think even in our planning that todays game was going to be very difficult for us, and this is what happened.But at the end of the day, its winning that matters, and we thank God as we push forward.Dembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nInspire of the triumph at the weekend, Dembare maintains its second-from-last position on the log; however, they closed the gap on Green Fuel, who are now on 27 points.\n\nCommenting on his teams performance after the win, Kaindu was ambivalent.Overall play, I think this was an average performance from the team, and I think even in our planning that todays game was going to be very difficult for us, and this is what happened.But at the end of the day, its winning that matters, and we thank God as we push forward.Dembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nCommenting on his teams performance after the win, Kaindu was ambivalent.\n\nOverall play, I think this was an average performance from the team, and I think even in our planning that todays game was going to be very difficult for us, and this is what happened.But at the end of the day, its winning that matters, and we thank God as we push forward.Dembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nOverall play, I think this was an average performance from the team, and I think even in our planning that todays game was going to be very difficult for us, and this is what happened.\n\nBut at the end of the day, its winning that matters, and we thank God as we push forward.Dembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nBut at the end of the day, its winning that matters, and we thank God as we push forward.\n\nDembare is now shifting focus to an uphill task against Scottland FC next week.Meanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nDembare is now shifting focus to an uphill task against Scottland FC next week.\n\nMeanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.The win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nMeanwhile, Highlanders new coach Pitier De Jong marked his debut with a 2-1 away victory over Bikita Minerals FC.\n\nThe win saw Bosso ending their three match winless streak and registering their first away win this month.Matchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nThe win saw Bosso ending their three match winless streak and registering their first away win this month.\n\nMatchday 26 PSL ResultsHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nMatchday 26 PSL Results\n\nHerentals 0-2 ScottlandYadah 2-3 Ngezi PlatinumZPC Kariba 1-0 TriangleFC Platinum 0-1 CAPS UnitedDynamos 2-0 Green FuelTel One 1  2 Chicken InnManica Diamonds 1-1 MWOSSimba Bhora 3-1 Kwekwe United.\n\nHerentals 0-2 Scottland\n\nYadah 2-3 Ngezi Platinum\n\nZPC Kariba 1-0 Triangle\n\nFC Platinum 0-1 CAPS United\n\nDynamos 2-0 Green Fuel\n\nTel One 1  2 Chicken Inn\n\nManica Diamonds 1-1 MWOS\n\nSimba Bhora 3-1 Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/12193425/KELVIN-KAINDU-10.gif",
            "description": "<p>By Sports Reporter DYNAMOS coach Kelvin Kaindu was not impressed with his team’s performance despite picking maximum points from a 2-0 win against Green Fuel at Rufaro Stadium in Harare. Sunday’s victory was Dynamos’ third consecutive win under Kaindu, who remains undefeated since his appointment in July. Dembare’s win was facilitated by Jaison Kasondo and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-coach-kaindu-demands-more-from-his-players-despite-victory-over-green-fuel-fc/\">Dynamos coach Kaindu demands more from his players despite victory over Green Fuel FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "25 Aug 2025"
        }
    ]
}