{
    "news": [
        {
            "title": "Ex-CIO boss Isaac Moyo appointed Zimbabwe’s ambassador to the United Arab Emirates",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-isaac-moyo-appointed-zimbabwes-ambassador-to-the-united-arab-emirates/",
            "content": "By James Muonwa\n\nFORMER director-general of the dreaded Central Intelligence Organisation (CIO), Isaac Annanias Moyo, has been appointed the countrys ambassador plenipotentiary to the United Arab Emirates (UAE).\n\nThrough an Extraordinary Government Gazette dated September 17, 2025, Chief Secretary to the Office of the President and Cabinet (OPC), Martin Rushwaya announced Moyos deployment.\n\nIt is hereby notified that His Excellency the President has, in terms of section 110 (2)(i) as read with section 204 of the Constitution of Zimbabwe Amendment (No.20) Act 2013, appointed Isaac Annanias Moyo as Ambassador Extraordinary and Plenipotentiary to United Arab Emirates, reads the notice.\n\nBefore assuming the CIOs top post after the 2017 military-assisted operation that ushered Mnangagwa to the presidency, Moyo was Zimbabwes ambassador to South Africa. He was eventually removed as CIO boss under unexplained circumstances.\n\nMeanwhile, President Mnangagwa has also made three other ambassadorial appointments through the same gazette.\n\nDavid Douglas Hamadziripi, who was ambassador to South Africa, has been shunted to the United States of America and will be replaced by Lovemore Mazemo.\n\nPatrick Ronald Mutasa has been named the countrys new representative to Cuba, a nation which has enjoyed long-standing cordial bilateral relations with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08185755/isaac-moyo.jpg",
            "description": "<p>By James Muonwa FORMER director-general of the dreaded Central Intelligence Organisation (CIO), Isaac Annanias Moyo, has been appointed the country’s ambassador plenipotentiary to the United Arab Emirates (UAE). Through an Extraordinary Government Gazette dated September 17, 2025, Chief Secretary to the Office of the President and Cabinet (OPC), Martin Rushwaya announced Moyo’s deployment. “It is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-isaac-moyo-appointed-zimbabwes-ambassador-to-the-united-arab-emirates/\">Ex-CIO boss Isaac Moyo appointed Zimbabwe’s ambassador to the United Arab Emirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Sep 2025"
        },
        {
            "title": "Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine",
            "url": "https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/",
            "content": "By Darlington Gatsi\n\nPRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs.\n\nThe judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of the Chinese nationals.\n\nWe call through you, Madam Speaker, for an appeal of the recent judgement of foreign nationals who were fined US$150 for being arrested in possession of dangerous drugs. We further propose the immediate deportation of these foreign nationals, who are bad apples amongst us, said Tendai Pinduka, a ZANU PF MP.\n\nHarare magistrate Vakayi Chikwekwe ruled that the quantity of cocaine the nine Chinese nationals were in possession of was insignificant.\n\nThe leniency of the judgement has been widely criticised, with the Zimbabwean government accused of being too soft on the Chinese, with whom it maintains a strong relationship.\n\nBy comparison, being found in possession of drugs in China is met with far harsher punishment, in some cases, a death penalty.\n\nThe judgement has been viewed as a mere slap on the wrist and one that undermines the governments stance on fighting drug abuse in communities.\n\nSurprisingly, foreign nationals were recently found in possession of dangerous drugs and cocaine, arrested, and fined a paltry US$150, which in our view is not deterrent enough. It further undermines the authority of His Excellency the President, Dr E.D. Mnangagwa, in combating the menace and scourge of drugs and substance abuse, said Pinduka.\n\nChinese nationals have been accused of committing crimes and escaping harsh sentences by leveraging their all-weather friendship with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26021333/new-parliament-16-1024x637-1.png",
            "description": "<p>By Darlington Gatsi PRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs. The judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/\">Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zimbabwe Alternative Mining Indaba urges pro-poor, sustainable mining practices",
            "url": "https://www.newzimbabwe.com/zimbabwe-alternative-mining-indaba-urges-pro-poor-sustainable-mining-practices/",
            "content": "By Alois Vinga\n\nThe 14th edition of the Zimbabwe Alternative Mining Indaba (ZAMI) kicked off in Bulawayo on Tuesday, with participants urging government and industry players to embrace mining initiatives that place people and communities at the centre of resource exploitation.\n\nZimbabwe is endowed with vast mineral wealth, including platinum-group metals (PGMs), chrome, lithium, gold, coal, diamonds, nickel, copper, black granite, and asbestos, alongside potential resources such as iron ore, tungsten, and semi-precious stones. Yet, despite this vast mineral basket, the majority of Zimbabweans continue to face economic hardship.\n\nThe Borgen Project estimates that 60% of the population lives on less than US$3.65 a day, making Zimbabwe one of the poorest countries in the SADC region. Rural communities, home to about 67% of the population, remain most vulnerable to food insecurity, drought, and economic shocks. Meanwhile, the health sector continues to struggle, with 87% of Zimbabweans lacking medical aid coverage and persistent shortages of medicines, staff, and resources worsened by an ongoing brain drain.\n\nSpeaking at the event, Zimbabwe Council of Churches (ZCC) Secretary General Wilfred Dimingu described mining in the country as a story of plunder rather than stewardship.\n\nIn Zimbabwe, we have witnessed rivers polluted, communities displaced, and workers exploited in the name of short-term gains. This is not stewardship. It is idolatry, worshipping mammon over the Creator. Theologically, we are called to a different path, he said.\n\nDimingu stressed that sustainable development must be rooted in justice and fairness.\n\nThis means harnessing Zimbabwes minerals, particularly those critical for renewable energy and battery technologies, not through voracious extraction that scars the land and sidelines the poor, but through operations that ensure equity and sustainability, he added.\n\nZandile Mvududu, a project officer at Silveira House, emphasised the need for collaboration in shaping the extractive sectors future.\n\nStakeholders must continue to dialogue, hinging on the faith-based approach which we encourage in the districts we work in. The coming Mines and Minerals Bill presents an opportunity for communities to give input and resolve legacy issues in the sector, she said.\n\nProfessor Tumai Murombo, a legal and environmental expert from the University of the Witwatersrand (South Africa), echoed calls for reform, urging a total overhaul of Zimbabwes minerals governance and environmental management framework.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17164316/Dimingu-ZCC.png",
            "description": "<p>By Alois Vinga The 14th edition of the Zimbabwe Alternative Mining Indaba (ZAMI) kicked off in Bulawayo on Tuesday, with participants urging government and industry players to embrace mining initiatives that place people and communities at the centre of resource exploitation. Zimbabwe is endowed with vast mineral wealth, including platinum-group metals (PGMs), chrome, lithium, gold,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-alternative-mining-indaba-urges-pro-poor-sustainable-mining-practices/\">Zimbabwe Alternative Mining Indaba urges pro-poor, sustainable mining practices</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Sep 2025"
        },
        {
            "title": "Presbytery Church Trust row deepens as High Court refuses bid to dismiss case",
            "url": "https://www.newzimbabwe.com/presbytery-church-trust-row-deepens-as-high-court-refuses-bid-to-dismiss-case/",
            "content": "By Mary Taruvinga\n\nThe High Court has refused to throw out a lawsuit filed by the Presbytery of Zimbabwe of the Uniting Presbyterian Church in Southern Africa in a bitter dispute over the control and management of church-run schools.\n\nJustice Faith Mushure dismissed an application for absolution from the instance lodged by trustees of the Presbytery of Zimbabwe Education Trust, ruling that the matter had to proceed to full trial.\n\nThis is not an appropriate case to decree absolution from the instance, ruled Justice Mushure. I must assume that the evidence placed before me is true. There is evidence upon which a court, directing its mind reasonably to such evidence, could or might find for the plaintiff.\n\nThe church is challenging the validity of the trust that oversees its schools, accusing trustees of fraudulently registering it, mismanagement, and failing to account for funds. It is also seeking the trusts dissolution.\n\nCentral to the row are two deeds of trust allegedly registered under the same number in 2010 but with different founders  Reverends Paul Neshangwe and Wilbert Runyararo Sayimani. Both clergymen denied ever appearing before a notary to establish the trust, with Justice Mushure noting their testimonies raised prima facie irregularities.\n\nThe judge stressed that the trustees could not avoid scrutiny through legal technicalities.\n\nQuoting precedent, she said: A defendant who might be afraid to go into the witness box should not be permitted to shelter behind the procedure of absolution from the instance.\n\nThe case also raised red flags over school governance, with financial statements from 2013 to 2017 accounting for only three out of nine schools under the trust. Evidence was also led of trustees allegedly deriving personal benefits and parents expressing disquiet over mismanagement.\n\nRejecting the trustees argument that the church lacked authority to dissolve the trust, Justice Mushure noted: Under common law, the court has powers both to vary or terminate trusts in certain conditions  if the trust is being run contrary to the interests and objectives of the trust.\n\nThe trial is set to resume on September 25.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17163250/Presbytery-e1758123204645.jpg",
            "description": "<p>By Mary Taruvinga The High Court has refused to throw out a lawsuit filed by the Presbytery of Zimbabwe of the Uniting Presbyterian Church in Southern Africa in a bitter dispute over the control and management of church-run schools. Justice Faith Mushure dismissed an application for absolution from the instance lodged by trustees of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/presbytery-church-trust-row-deepens-as-high-court-refuses-bid-to-dismiss-case/\">Presbytery Church Trust row deepens as High Court refuses bid to dismiss case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Sep 2025"
        },
        {
            "title": "Mufakose residents forced to vacate homes as raw sewage floods yards",
            "url": "https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/",
            "content": "By Darlington Gatsi\n\nFRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges.\n\nMufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation.\n\nCombined Harare Residents Association (CHRA) blasted the lackadaisical approach by the city fathers in addressing the plight of Mufakose residents.\n\nThe City of Harare has been reluctant to resolve the issue, and the residents continue to be affected since registering their first complaint with the Mufakose District office a month ago.\n\nThe situation is dire to the extent that some residents have since vacated their houses following the flow and flooding of their houses with raw sewerage.\n\nUnfortunately, residents have now resorted to open defecation in bushes as an alternative, since their toilets and bathrooms are no longer accessible due to sewer flooding and gushing from toilets, said CHRA in a statement.\n\nThis comes amid reports that Harare City Council employees are on strike, having declared incapacitation following the deaths of colleagues.\n\nHarare residents have been made to endure the city fathers failure to deliver services to the capitals populace.\n\nThe CHRA said the situation is a ticking time bomb that might cause disease outbreaks in the high-density area of Mufakose.\n\nFormal and informal complaints have been made to the local City of Harare District Officer but have yielded no result in addressing the sewerage bursts/blockages.\n\nWe are of the view that the following rights provided in Chapter 4 of the Constitution of Zimbabwe are being infringed or being violated;\n\nSection 73(1) Right to an environment that is not harmful to health or wellbeing; the magnitude of the sewerage bursts are exposing residents to waterborne diseases, and so far residents who reside in Nondo Street have been complaining of stomach pains and diarrhoea and the epicentre of the diarrhoea cases is Nondo Street.\n\nHouses are no longer habitable and at No 18 and 16 Nondo Street residents have evacuated from their houses, and the houses are no longer occupied due to the flooding of the sewer in the houses and yards. In addition, the stench coming out from the sewer is choking, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16215440/mufakose.jpeg",
            "description": "<p> By Darlington Gatsi FRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges. Mufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation. Combined Harare Residents Association (CHRA) blasted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/\">Mufakose residents forced to vacate homes as raw sewage floods yards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "17 Sep 2025"
        }
    ]
}