{
    "news": [
        {
            "title": "Sikandar Raza banks on home support as T20 World Cup Africa Qualifiers begin",
            "url": "https://www.newzimbabwe.com/sikandar-raza-banks-on-home-support-as-t20-world-cup-africa-qualifiers-begin/",
            "content": "By Sports Reporter\n\nZimbabwe mens T20 captain Sikandar Raza says home support will be key as the Chevrons begin their campaign in the ICC Mens T20 World Cup Africa Qualifiers, which kick off this Friday in Harare.\n\nThe tournament, running until October 4, will be staged across two venues,Takashinga Sports Club in Highfield and Harare Sports Club.\n\nZimbabwe have been drawn in Group B alongside Botswana, Tanzania, and Uganda, while Group A features Malawi, Namibia, Nigeria, and Kenya. The top two teams will qualify for the 2026 ICC Mens T20 World Cup, set to be hosted by Sri Lanka and India.\n\nRaza expressed confidence ahead of the competition, insisting that playing at home should inspire rather than pressure the side.\n\nI feel very confident that we will be at the World Cup. Some may look at playing at home as pressure, but I see it as support. Our fans give us so much energy, and I believe wewill be the team with the biggest backing throughout the tournament. I cannot wait for the competition to start, he said.\n\nZimbabwe begin their campaign against Uganda at Harare Sports Club on Friday, while Tanzania face Botswana at Takashinga. Both matches start at 13:50.\n\nThe Chevrons head into the tournament in buoyant form, having defeated Kenya by nine wickets on Monday before sealing a 47-run victory over Nigeria in Wednesdays warm-up match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/09154225/Sikandar-Raza-on-Fire.png",
            "description": "<p>By Sports Reporter Zimbabwe men’s T20 captain Sikandar Raza says home support will be key as the Chevrons begin their campaign in the ICC Men’s T20 World Cup Africa Qualifiers, which kick off this Friday in Harare. The tournament, running until October 4, will be staged across two venues, Takashinga Sports Club in Highfield and Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikandar-raza-banks-on-home-support-as-t20-world-cup-africa-qualifiers-begin/\">Sikandar Raza banks on home support as T20 World Cup Africa Qualifiers begin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "26 Sep 2025"
        },
        {
            "title": "Nasty C’s eleven country Ivyson tour kicks off this weekend in Harare",
            "url": "https://www.newzimbabwe.com/nasty-cs-eleven-country-ivyson-tour-kicks-off-this-weekend-in-harare/",
            "content": "SlikourOnLife\n\nNasty C is not wasting time after dropping his highly anticipated and well-received new album, FREE. The rapper has launched an eleven-country, seventeen-stop Ivyson Tour, kicking off in Harare this weekend.\n\nOther stops include Nigeria, Ghana, Namibia, Zambia, Uganda, Eswatini, and his home country South Africa, among others.\n\nThe tour marks another milestone in Nasty Cs growing global reach, taking South African hip hop beyond borders and across the continent. The Ivyson Tour, now a staple of the rappers brand, continues to evolve, serving as both a live experience for fans and a platform for showcasing new material.\n\nThis years edition of the Ivyson Tour also comes with expanded production and staging across several countries, signaling a continued investment in the tours overall experience. Local support acts are expected to join the lineup in various cities.\n\nThe tour is scheduled to run with multiple stops in West, Southern, and East Africa. Tour dates and venues have been released via Nasty Cs official platforms, and ticket sales are underway in several cities.\n\nNasty C has consistently used the Ivyson Tour as a vehicle to connect directly with fans and expand his presence across Africa and beyond. The tours growing scale reflects both the artists rising profile and the increasing demand for live hip hop experiences across the continent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25151514/nasty-c.jpeg",
            "description": "<p>SlikourOnLife Nasty C is not wasting time after dropping his highly anticipated and well-received new album, FREE. The rapper has launched an eleven-country, seventeen-stop Ivyson Tour, kicking off in Harare this weekend. Other stops include Nigeria, Ghana, Namibia, Zambia, Uganda, Eswatini, and his home country South Africa, among others. The tour marks another milestone in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nasty-cs-eleven-country-ivyson-tour-kicks-off-this-weekend-in-harare/\">Nasty C’s eleven country Ivyson tour kicks off this weekend in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "26 Sep 2025"
        },
        {
            "title": "ZCTU slams Sino-Bikita minerals, says sovereignty has been mortgaged",
            "url": "https://www.newzimbabwe.com/zctu-slams-sino-bikita-minerals-says-sovereignty-has-been-mortgaged/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Congress of Trade Unions (ZCTU) has accused the government of mortgaging the countrys sovereignty to Chinese investors who continue to abuse workers rights across multiple sectors.\n\nAccording to the United Nations COMTRADE database, Zimbabwes exports of mineral substances to China reached US$221.03 million in 2024. However, communities living near mining operations tell a different storyone of underpayment, unsafe working conditions, physical assaults, and other inhumane practices.\n\nIn his inaugural statement, newly elected ZCTU Secretary General Tirivanhu Marimo singled out Sino-Bikita Minerals, describing its treatment of workers as emblematic of the abuses in Chinese-run companies across Zimbabwe.\n\nAs labour, we are gravely concerned about the alarming escalation of workers rights violations in Chinese-run mining operations, particularly at Sino-Bikita Lithium Mine. Reports of workers being beaten, intimidated, and subjected to degrading treatment by both foreign managers and their local accomplices are not only barbaric but outrightly unlawful, Marimo said.\n\nZCTU Secretary General, Tirivanhu Marimo\n\nA lawyer by profession, Marimo noted that such conduct flagrantly violates Sections 51, 53, and 65 of the Constitution, which guarantee human dignity, protection from cruel and degrading treatment, and the right to fair and safe labour practices. He added that Section 4A of the Labour Act [Chapter 28:01] also prohibits forced labour and workplace violence, while mandating safe working conditions.\n\nThe ZCTU leader further argued that the violations contravene International Labour Organisation (ILO) conventions, calling for urgent state intervention.\n\nThe ZCTU calls for the immediate investigation and prosecution of perpetrators under Zimbabwes criminal law, including both foreign nationals and local enablers. Labour inspections must be dispatched and enforced by the Ministry of Labour and NSSA to ensure compliance with safety and dignity standards, he said.\n\nHe also urged authorities to suspend mining licences for companies found guilty of systematic abuse until they comply with labour laws, while demanding full compensation and medical rehabilitation for affected workers.\n\nMarimo called for a tripartite dialogue to address the broader pattern of abuse in the mining sector and to establish enforceable, binding standards.\n\nThe mounting complaints of barbaric conduct at Chinese operations constitute not just a breach of labour rights, but a direct assault on Zimbabwes sovereignty, showing contempt for both human rights and the rule of law.\n\nIf the Governments mantra of Zimbabwe is Open for Business is to carry legitimacy, it cannot serve as a smokescreen for modern-day slavery where foreign investment becomes synonymous with unchecked violence, exploitation, and impunity, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/26063418/bikita.jpg",
            "description": "<p>By Alois Vinga The Zimbabwe Congress of Trade Unions (ZCTU) has accused the government of mortgaging the country’s sovereignty to Chinese investors who continue to abuse workers’ rights across multiple sectors. According to the United Nations COMTRADE database, Zimbabwe’s exports of mineral substances to China reached US$221.03 million in 2024. However, communities living near mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zctu-slams-sino-bikita-minerals-says-sovereignty-has-been-mortgaged/\">ZCTU slams Sino-Bikita minerals, says sovereignty has been mortgaged</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "26 Sep 2025"
        },
        {
            "title": "Unlicensed driver jailed for speeding against oncoming traffic causing accident",
            "url": "https://www.newzimbabwe.com/unlicensed-driver-jailed-for-speeding-against-oncoming-traffic-causing-accident/",
            "content": "By James Muonwa\n\nAN unlicensed driver has been sent to prison for reckless driving against oncoming traffic, a stunt which caused an accident in Harare city centre.\n\nOscar Ngonidzashe Mushangazhike (32) from Kuwadzana suburb, Harare, appeared before the Harare Magistrates Court facing charges of reckless driving and driving without a valid licence.\n\nBesides imprisonment, the court also prohibited the offender from driving for two years.\n\nThe court heard that on September 9, 2025, at around 1530 hours, the offender drove against oncoming vehicles while speeding on a marked one-way road, Kenneth Kaunda Avenue in Harare Central Business District(CBD). As a result of his actions,Mushangazhikecaused an accident after he sideswiped another vehicle.\n\nTraffic police officers who attended the scene discovered that hedidnt have a drivers licence.\n\nThe court found him guilty on the following particulars: Count one: reckless driving, sentenced to 18 months in prison, with six months suspended for five years. He will serve an effective 12 months behind bars. Count two: driving without a licence, sentenced to a fine of US$80 and prohibited from driving for 24 months.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPA) noted that reckless driving has taken a toll, resulting in serious road carnage.\n\nReckless driving is a significant concern, and countless lives have been lost on our roads. The criminal justice system will not hesitate to deal with drivers who endanger the lives of others, the NPA said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By James Muonwa AN unlicensed driver has been sent to prison for reckless driving against oncoming traffic, a stunt which caused an accident in Harare city centre. Oscar Ngonidzashe Mushangazhike (32) from Kuwadzana suburb, Harare, appeared before the Harare Magistrates Court facing charges of reckless driving and driving without a valid licence. Besides imprisonment, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unlicensed-driver-jailed-for-speeding-against-oncoming-traffic-causing-accident/\">Unlicensed driver jailed for speeding against oncoming traffic causing accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "26 Sep 2025"
        },
        {
            "title": "Kenyan President Ruto warns UN at 80th General Assembly: Adapt or Perish",
            "url": "https://www.newzimbabwe.com/kenyan-president-ruto-warns-un-at-80th-general-assembly-adapt-or-perish/",
            "content": "ByBernard Momanyi, Capital FM Nairobi\n\nPresident William Ruto used his address to the 80th United Nations General Assembly to deliver a blunt message: the UN must reform or risk drifting into irrelevance.\n\nHe argued that modernising the Security Council and overhauling the global financial system are not optional tweaks but the prerequisites for peace, climate delivery and equitable development  and he placed Africas representation at the centre of that effort.\n\nInstitutions rarely fail because they lack vision, Ruto said. They drift into irrelevance when they do not adapt, when they hesitate to act, and when they lose legitimacy.\n\nRuto opened with a history lesson. The League of Nations collapsed not for want of ideals but for lack of enforcement and inclusion. Eight decades after the UNs founding, he said, the system again faces a legitimacy test amid wars in Eastern Europe, the Middle East, the Sahel and the Horn of Africa, climate shocks, deepening inequality and technological disruption outpacing governance. Funding cuts and bureaucracy have sapped UN capacity, while the Security Council remains frozen in the post-war structures of 1945, unable to act inclusively, with fairness and with speed.\n\nYet he called the UN one of humanitys greatest achievements, citing everything from famine relief and refugee protection to eradicating smallpox and coordinating global health responses  proof, he said, that multilateralism works when it is properly equipped and genuinely representative.\n\nRutos core political demand was unambiguous: two permanent seats for Africa with full rights, including the veto, plus two additional non-permanent seats. Africa dominates much of the Security Councils agenda, contributes significant peacekeeping contingents and bears heavy costs of instability, yet remains the only continent without a permanent seat.\n\nYou cannot claim to be the United Nations while disregarding the voice of 54 nations, he said, invoking the Ezulwini Consensus and Sirte Declaration that have framed the African common position for two decades. Reform, he argued, is not a favour to Africa but essential to the UNs credibility and survival in the 21st century.\n\nPivoting from principles to practice, Ruto showcased Kenyas 15-month leadership of the Multinational Security Support (MSS) mission in Haiti under Security Council Resolution 2699. The mission, he said, worked in a volatile environment under enormous constraints, operating under-funded, under-equipped and below 40% of authorised strength. Even so, he listed tangible gains: the Presidential Palace restored as the seat of government; the national police headquarters and academy secured; more than 700 recruits graduating; schools reopened; roads cleared of gang checkpoints; kidnappings sharply reduced; and both airport and seaport back to normal operations.\n\nIf so much could be achieved with limited resources and stretched personnel within just 15 months, he asked, what more could have been accomplished if the United Nations fraternity had truly acted together in solidarity with the people of Haiti? With the mandate coming to an end in a few days, Ruto urged a careful, orderly transition and sustained, coordinated, undivided international attention so hard-won gains are not lost.\n\nOn human rights, Ruto insisted the protection of civilians and respect for international humanitarian law cannot be applied selectively. He voiced Kenyas grave concern over the humanitarian catastrophe in Gaza, called for the unconditional release of Israeli hostages, and backed a permanent ceasefire and a credible political process toward a two-state solution where Israel and Palestine live side by side, in peace and in security.\n\nTurning toSudan, he endorsed the Quad (Egypt, Saudi Arabia, the United Arab Emirates and the United States), saying there isno military solution. He urged all parties  including SAF, RSF and external actors  to respect Sudans sovereignty, unity and territorial integrity and rejected any attempts to divide the country.\n\nCalling climate change the single greatest threat of our age and also one of the greatest transformation opportunities, Ruto argued that ambition without affordable finance will not deliver. He highlighted Kenyas progress  93% of electricity generated from renewables (geothermal, wind, solar and hydro), along with investments in e-mobility, climate-smart agriculture, clean cooking, green manufacturing and circular-economy solutions. He pointed to Africas unified stance through the Nairobi Declaration (2023) and the follow-up at the second Africa Climate Summit in Addis Ababa two weeks ago, presenting Africa as a source of climate solutions, not merely a victim.\n\nBut implementation costs are steep: $56 billion to deliver Africas new NDCs. Ruto called on the global community to unlock the $300 billion agreed at Baku and accelerate negotiations toward a $1.3 trillion goal under the Baku-Belm Roadmap  and he tied this to a broader overhaul of the financial system.\n\nRuto argued the global financial architecture punishes poor countries while rewarding the rich. As evidence, he cited the IMFs most recent Special Drawing Rights allocation: 64% went to wealthy countries with little need for liquidity, while the poorest received just 2.4%. The outcome, he said, is a cycle of debt, high borrowing costs and inadequate emergency support that stalls climate action and development where it is most needed.\n\nHe proposed transforming Bretton Woods institutions into genuinely independent, apolitical global bodies, democratising decision-making and restoring credibility so the IMF and World Bank serve all countries fairly. In parallel, he spotlighted Africas own financial architecture: the Alliance of African Multilateral Financial Institutions (Afreximbank, Africa Finance Corporation, Trade and Development Bank, Shelter Afrique, Africa Re, ATIDI, ZEP-RE), and AU plans for an African Central Bank, African Monetary Fund and African Investment Bank, plus an African Credit Rating Agency that understands our realities and assesses risk with fairness and truth.\n\nDespite his critique, Ruto warned against cynicism: the UN remains humanitys best chance at global solidarity, with unique legitimacy and convening power. From refugee protection to more than 70 peace operations and the global vaccination push, the world can achieve together what no nation can accomplish on its own, however mighty. Kenya  host to UN headquarters in the Global South  backs the Secretary-Generals UN@80 renewal agenda and stands ready to help drive reform.\n\nThe 80th anniversary of the United Nations must be more than a commemoration, Ruto said. Let us seize this moment to re-imagine and rebuild the UN into a body that commands legitimacy, responds with speed, and delivers justice for all.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25164126/ruto-UN.jpeg",
            "description": "<p>By Bernard Momanyi, Capital FM Nairobi President William Ruto used his address to the 80th United Nations General Assembly to deliver a blunt message: the UN must reform or risk “drifting into irrelevance.” He argued that modernising the Security Council and overhauling the global financial system are not optional tweaks but the prerequisites for peace,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenyan-president-ruto-warns-un-at-80th-general-assembly-adapt-or-perish/\">Kenyan President Ruto warns UN at 80th General Assembly: Adapt or Perish</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "26 Sep 2025"
        }
    ]
}