{
    "news": [
        {
            "title": "Small-scale miners lead gold deliveries in first half of 2025",
            "url": "https://www.newzimbabwe.com/small-scale-miners-lead-gold-deliveries-in-first-half-of-2025/",
            "content": "By Alois Vinga\n\nSmall-scale miners have emerged as the key contributors to Zimbabwes gold production in the first half of 2025, accounting for the majority of the 24.32 tonnes of gold delivered during this period.\n\nAccording to the latest data, Fidelity Gold Refinery (FGR) received a total of 24.31 tonnes of gold, with small-scale and artisanal miners delivering a significant 17.76 tonnes, while large-scale producers contributed 6.55 tonnes.\n\nThis performance highlights the growing importance of small-scale and artisanal mining to Zimbabwes economy. Once banned, artisanal mining has now become a crucial part of the nations economic development, providing livelihoods for thousands and making up a substantial portion of the countrys gold output.\n\nGold production has been on a steady rise throughout the year. Between January and March, a total of 20.10 tonnes were delivered, with small-scale miners contributing 14.56 tonnes, compared to 5.54 tonnes from primary producers.\n\nThe surge in production comes amid strong global demand for gold, which saw the average price per ounce hit a record US$2,862.56 in the first quarter. Experts suggest that these high prices have incentivised miners to increase their output.\n\nThe highest production was recorded in July, when Zimbabwe saw its largest single-month gold intake of 2025. Small-scale miners delivered 3.20 tonnes of the 4.21 tonnes total, while large-scale producers contributed 1.01 tonnes.\n\nInternational gold prices have continued to climb, with spot gold recently surpassing US$3,400 per ounce, peaking at US$3,418.14. This surge has been fueled by softer-than-expected US labour data and growing expectations of policy easing.\n\nAdditionally, global economic uncertainties, such as trade tensions under US President Donald Trumps tariffs, have further solidified golds position as a safe-haven investment, driving up demand and boosting production worldwide.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga Small-scale miners have emerged as the key contributors to Zimbabwe’s gold production in the first half of 2025, accounting for the majority of the 24.32 tonnes of gold delivered during this period. According to the latest data, Fidelity Gold Refinery (FGR) received a total of 24.31 tonnes of gold, with small-scale and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/small-scale-miners-lead-gold-deliveries-in-first-half-of-2025/\">Small-scale miners lead gold deliveries in first half of 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        },
        {
            "title": "Rogue ZRP officer arrested after declaring himself in charge of the force, ordering Chinese to leave Zimbabwe",
            "url": "https://www.newzimbabwe.com/rogue-zrp-officer-arrested-after-declaring-himself-in-charge-of-the-force-ordering-chinese-to-leave-zimbabwe/",
            "content": " officer apologised for police forces poor relationship with public\n\n ordered Chinese nationals to leave within 48 hours\n\nBy Leopold Munhende\n\nASSISTANT Inspector Simbarashe Mandizvidza, a rogue member of the Zimbabwe Republic Police (ZRP) has been arrested after declaring himself the new leader of the police force in a video circulating online.\n\nMandizvidza, who is Member in Charge of the Senior Officers Desk at ZRPs headquarters in Harare, had declared himself its new leader and apologised for their poor relationship with the public, promised a new working relationship and urged Zimbabweans to trust him and his colleagues.\n\nThe ZRP is headed by Commissioner General Stephen Mutamba, who was appointed after the resignation of Godwin Matanga.\n\nBefore Mandizvidzas video had been released, the ZRP was in active pursuit of him after he reportedly hijacked a branded police Ford Ranger from its headquarters (registration number 033).\n\nOur relationship with the Zimbabwean public has not always been ideal, and for any harm or mistrust caused during the execution of our duties I wish to offer a sincere apology, said Mandizvidza in a 12-minute address that has been shared widely.\n\nWe recognise the importance of building trust and fostering a positive partnership with the communities we serve.\n\nAs of today, the ZRP are committed to serving the people and we pledge to uphold the highest standards of integrity and professionalism.\n\nIn light of recent developments, I am announcing that I will be taking charge of the ZRP with immediate effect, with a focus on empowering young officers to lead and drive positive change within the organisation and country at large.\n\nIn Mandizvidzas address, done in a similar fashion to those shared by war veteran Blessing Bombshell Geza ahead of protests that shook internal security, the non-commissioned officer urged Zimbabweans to forgive past differences, choose to pick up officers at bustops and avoid straining their resources by shunning illegal taxi operators (mushikashika).\n\nPolice officers are rarely picked up by private commuter omnibuses or private vehicles due to a broken-down relationship with the public.\n\nMandizvidza had ordered the Chinese to pack and go so as to allow Zimbabweans to talk.\n\nHe added: I really want to thank the Chinese, they have flooded our communities and taken up mining across the country, but I would like to ask the President (Emmerson Mnangagwa) to allow that they go back to their home within the next 48 hours.\n\nIf they are to be allowed back, they will come back after we have agreed on it as a country.\n\nMandizvidzas arrest was announced by the police late Thursday night in a statement that described him as rogue and his actions treasonous.\n\nThe Zimbabwe Republic Police categorically disassociates itself from the treasonous social media videos and statements issued by Assistant Inspector Simbarashe Mandizvidza.\n\nThe errant member has since been arrested and is now facing both disciplinary charges and criminal proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/15060709/mandizvidza.jpeg",
            "description": "<p>  – officer apologised for police force’s poor relationship with public    – ordered Chinese nationals to leave within 48 hours By Leopold Munhende ASSISTANT Inspector Simbarashe Mandizvidza, a rogue member of the Zimbabwe Republic Police (ZRP) has been arrested after declaring himself the new leader of the police force in a video circulating online.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rogue-zrp-officer-arrested-after-declaring-himself-in-charge-of-the-force-ordering-chinese-to-leave-zimbabwe/\">Rogue ZRP officer arrested after declaring himself in charge of the force, ordering Chinese to leave Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        },
        {
            "title": "‘It’s coming home’ – the undignified row over the body of Zambia’s ex-president",
            "url": "https://www.newzimbabwe.com/its-coming-home-the-undignified-row-over-the-body-of-zambias-ex-president/",
            "content": "BBC\n\nIts coming home!  a phrase indelibly linked to English football fans  has now gained currency among some Zambians in the battle over what to do with the body of former President Edgar Lungu.\n\nThe 68-year-old died two months ago in South Africa where he was being treated for an undisclosed illness.\n\nIn the latest episode of what is now a full-blown saga, a Pretoria court ruled in the Zambian governments favour, saying that in the public interest, Lungus remains can be repatriated and given a state funeral, against the wishes of the family.\n\nThe decision triggered celebrations among some governing party supporters, who shared Facebook posts with the phrase: Its coming home, as if Zambia had won a trophy.\n\nAn undignified response, perhaps, but it has come to symbolise how divisive and partisan this has become.\n\nFor some, who are fed up with the row, the sorrow and grief that came with Lungus passing have faded into feelings of fatigue.\n\nBut despite a host of more pressing economic problems, public discussions continue to be dominated by the fallout from the death of the former president, who led the country for six years from 2015.\n\nThe seeds of the controversy were sown in the feud between Lungu and his successor  the man who soundly beat him in the 2021 election  Hakainde Hichilema. But it has now spiralled into a row laced with wild accusations of witchcraft.\n\nWhen the judge in South Africa made his ruling last week, the ensuing anger from Lungus older sister was telling.\n\nBertha Lungu burst into a fit of rage, crying uncontrollably as she hurled unsavoury words at Zambias Attorney General Mulilo Kabesha, who was also present in court.\n\nKabesha, Lungu is not your fathers son hes not Hakaindes son This is really painful. I dont want to go to Zambia, she cried as people, including her niece, Tasila Lungu, struggled to comfort her and cover her mouth.\n\nThe body has not yet been repatriated to Zambia because the Lungu family is appealing against the South African judges decision  a case that is due to be heard on Friday.\n\nThis was all supposed to have been settled in June, when the family initially agreed that there could be a state funeral in Zambia. But the plans were scuppered over a dispute about what role President Hichilema would play.\n\nLungus family said one of his dying wishes was that Hichilema should not go anywhere near his body.\n\nThe key to understanding the animosity was the more than 100 days that Hichilema, opposition leader at the time, spent in detention in 2017, awaiting trial on treason charges.\n\nHe was accused of endangering the life of then-President Lungu after his motorcade allegedly refused to give way to the one transporting the head of state.\n\nThe charges were only dropped after the intervention of the secretary general of the Commonwealth. This was one of several times that Hichilema was arrested while he was in the opposition.\n\nIn turn, the Lungus have alleged persecution under Hichilema. Tasila and the former presidents widow, Esther, continue to face corruptions charges, which they deny.\n\nLungus family have vowed that they are prepared to wait for the court process as long as it takes to ensure he receives a burial they consider dignified, even if it means stalling the process, according to their spokesperson Makebi Zulu.\n\nThey insist that while they were open to burying Lungu in Zambia, they want to honour his wishes that Hichilema should not attend the event.\n\nBut the authorities are adamant that the former president should be accorded a state funeral to be attended by his successor and given a proper send-off as a former president.\n\nThe government, through the attorney general, has even indicated Lungu may have to be buried without the familys involvement.\n\nIf they want to set a precedent, let them give us reasons why the current president should not go near the casket. And who has told them that he wants to be near the casket, anyway? he told the state broadcaster ZNBC.\n\nWe are ready as government to discuss with the family, we will never ignore the family unless the family just walks out but the family has a right to say: We are not coming, we are not part of it. Then we will proceed and bury without them.\n\nTraditionally, all ex-leaders have been accorded state funerals and buried at Embassy Park, which is specifically reserved for them.\n\nSishuwa Sishuwa, a Zambian historian and senior lecturer at South Africas Stellenbosch University, strongly disagrees with the idea that Lungu could be buried without his familys involvement.\n\nSuch reckless statements are culturally insensitive, undermine the governments claims that its actions are motivated by the desire to accord Lungu a dignified burial, and indicate that political considerations rather than public interest are the key drivers at play, he told the BBC.\n\nThe failure by Hichilema to rein in on the unruly conduct of his officials and supporters has fed public perception that the president approves of such conduct and consequently heightened divisions.\n\nHe argues that had Hichilema publicly indicated that he would stay away from the funeral, Lungu would have been buried long ago.\n\nDr Sishuwa says that the authorities determination to take the body of Lungu from the grieving family  in the name of giving him a dignified funeral  has not only worsened political divisions but has also fed the belief that the body may be wanted for occult reasons, in a country where thebelief in witchcraft is widespread.\n\nNevers Mumba, the leader of the Movement for Multiparty Democracy, which is in a political alliance with Hichilemas party, has defended the president.\n\nWhat drives [the president] is not obsession, but a deep, deep sense of duty. Hakainde Hichilema never gives up on anything he pursues as long as he believes he is doing the right thing, Mumba, who is also a pastor, wrote on his Facebook page.\n\nHe fights, with a clear conscience till the end, and he keeps on refining his methods until he gets it right.\n\nHow long this fight will go on for is not known, but several episodes of the saga are yet to be written.\n\nZambians may shrug and try to focus on other matters, but they will still get drawn into the debate about whether the body should come home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25163954/lungu-burial.webp",
            "description": "<p>BBC “It’s coming home!” – a phrase indelibly linked to English football fans – has now gained currency among some Zambians in the battle over what to do with the body of former President Edgar Lungu. The 68-year-old died two months ago in South Africa where he was being treated for an undisclosed illness. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-coming-home-the-undignified-row-over-the-body-of-zambias-ex-president/\">‘It’s coming home’ – the undignified row over the body of Zambia’s ex-president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        },
        {
            "title": "Amin Soma-Phiri bounces back at Highlanders, as coach De Jong work permit delay continues",
            "url": "https://www.newzimbabwe.com/amin-soma-phiri-bounces-back-at-highlanders-as-coach-de-jong-work-permit-delay-continues/",
            "content": "By Sports Reporter\n\nHighlanders FC legend Amin Soma-Phiri has bounced back at the club as new Welfare Manager for the senior team.\n\nSoma-Phiris appointment was confirmed by the club on Thursday via a press release.\n\nHighlanders Football Club is pleased to announce the appointment of Amin Soma-Phiri as the new Welfare Manager for our first team.\n\nWe warmly welcome him back to the Highlanders family and wish him every success in his new role, reads part of the statement.\n\nThe former Highlanders player previously served the club as an assistant coach under coach Erol Akbay in 2017.\n\nMeanwhile, it will take longer than expected for Highlanders new coach Petier De Jong to start duty.\n\nSince his appointment last month, De Jong has yet to get a work permit.\n\nAlthough details behind his work permit delays have not been established yet, sources within the club told this publication that the move is a deliberate sabotage of club chairman Kenneth Mhlope, who pushed for the new coachs appointment.\n\nMhlopes time in office is under threat as some life members are pushing for a vote of no confidence against him in the coming EGM.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/15021816/amin-soma-phiri.jpeg",
            "description": "<p>By Sports Reporter Highlanders FC legend Amin Soma-Phiri has bounced back at the club as new Welfare Manager for the senior team. Soma-Phiri’s appointment was confirmed by the club on Thursday via a press release. “Highlanders Football Club is pleased to announce the appointment of Amin Soma-Phiri as the new Welfare Manager for our first</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amin-soma-phiri-bounces-back-at-highlanders-as-coach-de-jong-work-permit-delay-continues/\">Amin Soma-Phiri bounces back at Highlanders, as coach De Jong work permit delay continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        },
        {
            "title": "Harare City Council officials attending workshops to sleep in hotels – councillor says",
            "url": "https://www.newzimbabwe.com/harare-council-officials-attending-workshops-to-sleep-in-hotels-councillor-says/",
            "content": "By Darlington Gatsi\n\nHARARE City Council continues to be dogged by the extravagance of its top officials, with residents bearing the brunt of the senior executives excessive expenditures.\n\nDespite being cash-strapped, top City Council officials have been attending workshops in excessive numbers at the municipalitys expense.\n\nSpeaking at a recent Council meeting, Harare Councillor Denford Ngadziore bemoaned the extravagance, saying some officials attend workshops merely to sleep in hotels.\n\nAt one time, we had over 20 workshops or trips of Council. My issue is if you go and check attendance, it is showing it seems as if we might be at a position where we are spending more on trips and workshops that are not also having a direct benefit to the Council. For example, you see a report that has three councillors, officials 20. Some of the justifications.\n\nI have been previously attending those workshops, but most of the people during the workshops people will be in rooms, not even contributing to whatever that will be happening, said Ngadziore.\n\nThis is a slap in the face for residents, who are bearing the brunt of the City Councils poor service delivery, often attributed to a lack of funds, while officials attend numerous workshops.\n\nWorkshops have become a feeding trough for council officials, who are reportedly pocketing hefty allowances.\n\nThe City Councils extravagance also became a bone of contention at the Commission of Inquiry, which was investigating the local authoritys governance systems.\n\nIn response, Harare Mayor Jacob Mafume said workshops should be downsized to reduce the burden on the City Council.\n\nLet us look at some of the workshops so that we reduce the cost to the organisation. Let us look at the bottom line as far as that issue is concerned, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/08041101/town-house1.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council continues to be dogged by the extravagance of its top officials, with residents bearing the brunt of the senior executives’ excessive expenditures. Despite being cash-strapped, top City Council officials have been attending workshops in excessive numbers at the municipality’s expense. Speaking at a recent Council meeting, Harare Councillor Denford</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-council-officials-attending-workshops-to-sleep-in-hotels-councillor-says/\">Harare City Council officials attending workshops to sleep in hotels – councillor says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        },
        {
            "title": "Two arrested for assaulting Zimbabwean student in Punjab",
            "url": "https://www.newzimbabwe.com/two-arrested-for-assaulting-zimbabwean-student-in-punjab/",
            "content": "INDIA  Punjab Police arrested two persons for the brutal attack on a Zimbabwean student, Ziweya Leeroy, at Talwandi Sabo in Bathinda district on Wednesday evening.\n\nThe 22-year-old BSc student of Guru Kashi University, a private institute, in Talwandi Sabo, is battling for life at All India Institute of Medical Sciences (AIIMS), Bathinda.\n\nSenior Superintendent of Police (SSP) Amneet Kondal stated on Thursday that Manpreet Singh and Mangu Singh have been arrested, while teams have been constituted to apprehend Dilpreet Singh and Lovepeet Singh.\n\nShe said that Leeroy suffered critical head injuries, and he is under constant medical observation.\n\nRuling out the hate crime, the SSP said that the attack followed an argument between Leeroy and the university security guard, Dilpreet Singh.\n\nDuring checking at the university gate on August 12, a baseball bat was found in Leeroys car, and he had an argument with Dilpreet. A day later, Dilpreet and his accomplices followed Leeroy and attacked him with baseball bats, sticks and sharp-edged weapons. Leeroy is in a critical condition, the SSP said.\n\nA case was registered at Talwandi Sabo under Sections 109 (attempt to murder), 126 (2) wrongful restraint, 115 (2) voluntarily causing hurt; 190 (unlawful assembly for offences committed in prosecution of their common object) and 191 (3) rioting involving deadly weapons of the Bharatiya Nyaya Sanhita (BNS).\n\nThe first information report (FIR) was lodged on the complaint of assistant sub-inspector Des Raj, as the doctors attending to Leeroy pronounced the patient unfit to give a police statement.\n\nA BSc second-year student under the faculty of health and allied sciences of Guru Kashi University, was found in an unconscious condition near the campus on Wednesday and was rushed to the hospital by the police.\n\nInvestigators said that after attacking the foreign national, the attackers rammed their car into a tree and left it behind.\n\nThe vehicle was impounded by the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/09115004/handcuffs.jpg",
            "description": "<p>Hindustan Times INDIA – Punjab Police arrested two persons for the brutal attack on a Zimbabwean student, Ziweya Leeroy, at Talwandi Sabo in Bathinda district on Wednesday evening. The 22-year-old BSc student of Guru Kashi University, a private institute, in Talwandi Sabo, is battling for life at All India Institute of Medical Sciences (AIIMS), Bathinda.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-arrested-for-assaulting-zimbabwean-student-in-punjab/\">Two arrested for assaulting Zimbabwean student in Punjab</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        },
        {
            "title": "High Court refuses to hear Varakashi4ED leader’s divorce case, says Canadian Court has jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-refuses-to-hear-varakashi4ed-leaders-divorce-case-says-canadian-court-has-jurisdiction/",
            "content": "By Staff Reporter\n\nThe High Court has thrown out a divorce bid filed by the leader of Zanu PFs online brigade, Varakashi4ED, Jonas Musara, against his estranged wife living in Canada, ruling that local courts have no jurisdiction because the matter is already before a Canadian court.\n\nThe application was filed by Musara, who is going through a nasty separation with his wife, Winnet Paidamoyo Motsi, who is currently living abroad.\n\nJustice Fatima Maxwell upheld a special plea by Motsi, finding that this court will withhold its jurisdiction until the matter in Canada is finalised, and warning against the risk of conflicting judgments, which is contrary to the principles of justice and judicial comity.\n\nThe judge said the actor forum rei principle  that the court of the defendants domicile has jurisdiction  applied since Motsi is domiciled in Canada.\n\nThe Zimbabwean courts cannot assume jurisdiction simply because the Plaintiff is domiciled or resident in Zimbabwe, she ruled.\n\nMotsi had argued that her husband could not pursue a parallel divorce action in Zimbabwe while a similar case was pending before another court of competent jurisdiction in Canada.\n\nThe judge agreed, stressing that this is correct to prevent duplication and conflicting rulings.\n\nIf an action is already pending between parties it is open to the Defendant to take the objection of lis pendens whereupon the court in its discretion may stay the second action pending the decision of the first, she said.\n\nMusaras lawyer had urged the court to use its inherent jurisdiction to hear the case, arguing that his client was being denied access to the couples minor children.\n\nBut Justice Maxwell said those rights must be enforced in the Canadian proceedings.\n\nThat there is an access order being defied is not for these proceedings, she ruled. Plaintiff is legally represented and should be advised on what steps to take to enforce his rights granted by an order of Court.\n\nThe judge also noted that Musara was seeking to have custody of the children awarded to Motsi, making it more appropriate for the Canadian Court to deal with the issue of the maintenance of the minor children.\n\nDismissing the case, Justice Maxwell advised Musara that if Motsi is unnecessarily dragging the process there should be ways in which he can have that matter dismissed by the Canadian Court Once that is done, he can then properly approach this Court.\n\nThe special plea was upheld, effectively halting the Zimbabwe proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13170431/jones-musara.jpg",
            "description": "<p>By Staff Reporter The High Court has thrown out a divorce bid filed by the leader of Zanu PF’s online brigade, Varakashi4ED, Jonas Musara, against his estranged wife living in Canada, ruling that local courts have no jurisdiction because the matter is already before a Canadian court. The application was filed by Musara, who is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-refuses-to-hear-varakashi4ed-leaders-divorce-case-says-canadian-court-has-jurisdiction/\">High Court refuses to hear Varakashi4ED leader’s divorce case, says Canadian Court has jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "15 Aug 2025"
        }
    ]
}