{
    "news": [
        {
            "title": "Alpha Media Holdings challenges remand as editor-in-chief is dragged to court",
            "url": "https://www.newzimbabwe.com/alpha-media-holdings-challenges-remand-as-editor-in-chief-is-dragged-to-court/",
            "content": "By Mary Taruvinga\n\nThe editor-in-chief at Alpha Media Holdings (AMH), Kholwani Nyathi, on Thursday appeared in court representing his employer, charged with undermining the authority of President Emmerson Mnangagwa.\n\nThe company is accused of insulting the president following the publication of a satirical article in its weekly paper, Zimbabwe Independents Muckracker column.\n\nThe same article titled When you become mafia state landed the Zimbabwe Independent editor Faith Zaba in jail recently. She was granted US$200 bail after spending three nights behind bars.\n\nThrough its lawyer Chris Mhike, AMH challenged placement on remand, arguing that the charge does not disclose an offence.\n\nMhike said in a democratic state, one cannot be arrested for expressing his or her opinion where there is freedom of the media and expression.\n\nThe arrest amounts to restrictions of the right of access to information.\n\nThe disregard of fundamental rights of the accused amount to violation of principle of democracy, he said.\n\nThe lawyer said when the company is placed on remand the state has restricted it from performing its duties to inform the public which is its mandate.\n\nJournalism is not a crime, by placing the company on remand means criminalisation of journalism.\n\nOne consenting to placement on remand means youre admitting to committing the offence, Mhike said.\n\nTakudzwa Jambawu representing the state said there is reasonable suspicion that an offence was committed.\n\nHe said it is not in dispute that Mnangagwa is the current SADC chairperson and the words contained in the article were insulting his authority.\n\nAccording to the state on June 7 2025 accused through the Zimbabwe Independent newspaper edition of 27 June 2025 to 3 July 2025 published an article titled When you become mafia state, intending to undermine the authority of the President by saying: In less than two months, our one year rotating chairmanship of SADC comes to an end and we hope it is not just Muckraker, who has not seen any value that our time in that important role has added to the regional bloc apart from just confirming the obvious fears that SADC is a mere trade union of dictators.\n\nIn the few months that we have been in that role, we have been implicated in the chaos that has rocked most neighbouring countries. We were implicated in the massive vote rigging in Mozambican elections-with proof that our people actually voted for Daniel Chapo in an election in whose disputed outcome resulted in the death of hundreds of people. We were also fingered in the elections in Botswana and Namibia, where our electoral rigging machinery was heavily deployed.\n\nWhen you have become a mafia state, and are known to arm fellow criminals from around the globe with your diplomatic passports, it has become very hard to stop your people from believing just anything.\n\nThere is certainly no doubt who is micro Managing this Chapo chap, so there is not even any need to wonder what our Owner thought when his boy was addressing a virtually empty stadium very soon the boy would have developed a thick skin, just hike his handler who no longer needs to do anything under the cover of the darkness. That is what happens when you become the head of a mafia state.  It is a government that came into power through a coup and is only obsessed with keeping itself in power hence the creation of demons such as the Tshabangus and the like, themselves creations of courts whose top judges are themselves appointed -and kept on  the bench via political chicanery, all to serve the purpose of keeping this criminal enterprise masquerading as a government in power.\n\nThe state alleges that the accused attached a photograph of President Emerson Dambudzo Mnangagwa and Mozambican President Daniel Chapo.\n\nThe state alleges the article was false in material and was designed to engender feelings of hostility by the citizens of Zimbabwe towards the President.\n\nHearing continues Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10193920/kholwani.jpg",
            "description": "<p>By Mary Taruvinga  The editor-in-chief at Alpha Media Holdings (AMH), Kholwani Nyathi, on Thursday appeared in court representing his employer, charged with undermining the authority of President Emmerson Mnangagwa. The company is accused of insulting the president following the publication of a satirical article in its weekly paper, Zimbabwe Independent’s Muckracker column. The same article</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/alpha-media-holdings-challenges-remand-as-editor-in-chief-is-dragged-to-court/\">Alpha Media Holdings challenges remand as editor-in-chief is dragged to court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Olympic champ Semenya did not get a fair hearing in sex eligibility case, human rights court rules",
            "url": "https://www.newzimbabwe.com/olympic-champ-semenya-did-not-get-a-fair-hearing-in-sex-eligibility-case-human-rights-court-rules/",
            "content": "AP\n\nTwo-time Olympic champion runner Caster Semenya won a partial victory at the European Court of Human Rights on Thursday in her seven-year legal fight against track and fields sex eligibility rules.\n\nThe courts 17-judge highest chambersaid in a 15-2 votethat Semenya had some of her rights to a fair hearing violated at Switzerlands Supreme Court,where she had appealedagainst a ruling by the Court of Arbitration for Sport in favor of tracks World Athletics.\n\nHowever, the court declined to rule on several other aspects of Semenyas case, including on the question of whether she was discriminated against in Swiss courts. The European court in Strasbourg, France, said those issues were outside Switzerlands jurisdiction, although four of the 17 judges gave a partial dissent to the majority view.\n\nSemenyas case should now go back to the Swiss federal court in Lausanne. It will be watched closely by other sports which have passed or are reviewing their own rules on eligibility in womens events.\n\nSemenya laterposted on social mediaa photo of herself in the court chamber with a message a three raised fists symbolizing her fight for justice.\n\nToday, my patience in this journey has been rewarded with a result that will pave the way for all athletes human rights to be protected, she said in a statement.\n\nThe original case between Semenya and tracks governing body based in Monaco was about whether athletes like her  who have specific medical conditions, a typical male chromosome pattern and naturally high testosterone levels  should be allowed to compete freely in womens sports.\n\nThe European courts ruling does not overturn the World Athletics rules that effectively ended Semenyas career running the 800 meters after she won two Olympic and three world titles since emerging on the global stage as a teenager in 2009.\n\nThe judges also did not take up other aspects of the appeal filed by Semenya, who was in court to hear their judgment read. It awarded her 80,000 euros ($94,000) from the state of Switzerland in respect of costs and expenses.\n\nThe key legal point in Semenyas win was that the Swiss Federal Court had not carried out a rigorous judicial review. This was required because Semenya had no choice but to pursue her case through the CASs mandatory and exclusive jurisdiction. the Strasbourg judges ruled.\n\nGoverning bodies of sports oblige athletes and national federations to take their disputes to the sports court in the International Olympic Committees home city Lausanne.\n\nThe court considered, however, that the Federal Supreme Courts review had fallen short of that requirement, it said in a statement.\n\nIn dismissing other elements of the South African runners case, including if she had been discriminated against, the court judged it did not fall within Switzerlands jurisdiction in respect of those complaints.\n\nWorld Athletics, led by its president Sebastian Coe, has said its rules maintain fairness because Semenya has an unfair, male-like athletic advantage from her higher testosterone. Semenya argues her testosterone is a genetic gift.\n\nWorld Athletics and CAS did not immediately respond to the ruling. The IOC declined to comment on a case it is not directly involved in.\n\nThursdays win followed a legal victory from the same court two years ago for Semenya.\n\nThat judgment which said she had faced discrimination opened a way for the Swiss supreme court to reconsider its decision to dismiss her appeal against the CAS verdict in favor of World Athletics.\n\nAt CAS in 2019, three judges ruled 2-1 that discrimination against Semenya was necessary, reasonable and proportionate to maintain fairness in womens track events.\n\nWorld Athletics drew up its rules in 2018 forcing Semenya and other female athletes with Differences in Sex Development to suppress their testosterone to be eligible for international womens events.\n\nFour of the 17 judges filed a partial dissent to the majority opinion, arguing their court should have been able to pronounce on substantive conclusions reached by the CAS that went against Semenya.\n\nWorld Athletics eligibility rules specifically targeted the applicant, since they concerned only the events in which she competed  indeed, the fact that they amounted to a kind of lex Semenya clearly demonstrates the arbitrariness of those regulations as a whole, the four judges wrote.\n\nWe are disappointed that her expectations have not been met, said the dissenting judges, who included the chamber president, Marko Bonjak from Slovenia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10191357/semenya.webp",
            "description": "<p>AP  Two-time Olympic champion runner Caster Semenya won a partial victory at the European Court of Human Rights on Thursday in her seven-year legal fight against track and field’s sex eligibility rules. The court’s 17-judge highest chamber said in a 15-2 vote that Semenya had some of her rights to a fair hearing violated at Switzerland’s Supreme</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/olympic-champ-semenya-did-not-get-a-fair-hearing-in-sex-eligibility-case-human-rights-court-rules/\">Olympic champ Semenya did not get a fair hearing in sex eligibility case, human rights court rules</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Golden Eagles’ PSL promotion aspirations low despite good run",
            "url": "https://www.newzimbabwe.com/golden-eagles-psl-promotion-aspirations-low-despite-good-run/",
            "content": "By Sports Reporter\n\nNorthern Region Division One League title contenders Golden Eagles are keeping their title aspirations low despite a good run in the ongoing campaign.\n\nThe Harare-based side on Wednesday afternoon staged a good comeback against fellow title contenders Harare City, whom they beat 3-1 from behind at Gwanzura Stadium.\n\nSo important was the win that it propelled the Eagles to position 3 on the log with 36 points, five behind log leaders Nombeyaora.\n\nDespite the good run that has seen his side finishing the first round of the season in a convincing position, team head coach Aurther Gurajena is keeping his head low.\n\nProbably the target is we want to beat our last season record, so for now, we are chasing ourselves once we surpass what we did last season, he said.\n\nThe former Flame Lilly and Tenax FC coach, however, added that the season the league is more competitive as compared to previous seasons.\n\nIts quite an exciting season, one of its own kind, very competitive.\n\nWe are looking forward to each and every game as it comes, he added.\n\nNORTHERN REGION SOCCER LEAGUE WEEK 19 Results\n\nWednesday 07 July 2025\n\nFT: Chegutu P. 0-1 Agama\n\nFT: MWOS U19 0-0 Karoi\n\nFT: Ngezi U19 0-1 Nombeyawora\n\nFT: PAM 1-0 Shamva Mine\n\nFT: Harare City. 1-3 Golden Eagles\n\nFT: Black Rhinos. 0-1 Zambezi G&C\n\nFT: Cranborne 1-0 Chy Stars\n\nFT: Chy Rangers. 1-0 Trojan Stars\n\nFT: Ali Sundowns 0-1 Black Mambas\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10170352/golden-eagles.jpeg",
            "description": "<p>By Sports Reporter Northern Region Division One League title contenders Golden Eagles are keeping their title aspirations low despite a good run in the ongoing campaign. The Harare-based side on Wednesday afternoon staged a good comeback against fellow title contenders Harare City, whom they beat 3-1 from behind at Gwanzura Stadium. So important was the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/golden-eagles-psl-promotion-aspirations-low-despite-good-run/\">Golden Eagles’ PSL promotion aspirations low despite good run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid",
            "url": "https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/",
            "content": "By Costa Nkomo\n\nThe cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed.\n\nThe Treasury confirmed in Parliament that the project cost a total of US$114 million  an increase of US$26 million.\n\nWhen questions were raised about the projects cost, the government was quick to attribute the increase to the relocation of families who had been settled close to the project site.\n\nExperts have, however, drawn comparisons with regional markets such as South Africa and Botswana, where constructing a similar project would typically cost around US$45 million.\n\nWhile many are still trying to make sense of the initial US$88 million figure, Finance Minister Professor Mthuli Ncube further shocked lawmakers by revealing during a Question and Answer session in Parliament on Wednesday that the project had actually consumed an additional US$26 million, not included in the original budget.\n\nEmakhandeni-Luveve MP Decent Bajila raised the issue in Parliament, requesting that Ncube clarify the full cost of the Trabablas Interchange.\n\nI asked the Minister of Finance, Economic Development and Investment Promotion to brief the House on the total cost of the Trabablas Interchange Project and to clarify whether the funding source was a loan from the private sector or the International Monetary Funds (IMFs) Special Drawing Rights facility, Bajila said.\n\nResponding, Ncube said: The cost of Trabablas Interchange was driven by our initial loan arrangement of the order of US$88 million, which was provided by the Consortium of Contractors. In terms of what we used from the Special Drawing Rights, we were required to pay a deposit of US$26 million. So, we used US$26 million from the SDRs to pay that deposit and then the rest was structured as a loan from that US$88 million arrangement.\n\nBajila followed up, asking whether the US$26 million was part of the US$88 million total, to which Ncube responded that it was not.\n\nThe US$26 million is in addition, but it was a requirement for accessing the US$88 million that we pay that deposit to access that facility. We think that was a very good arrangement indeed because we have been able to complete the piece of infrastructure, said Ncube.\n\nDangamvura Chikanga MP Prosper Mutseyami then pressed Ncube for an explanation on what had caused the additional US$26 million in project costs.\n\nMay the Hon. Minister explain to the House as to what caused the additional US$26 million, bearing in mind that the US$88 million had been budgeted to cover the whole construction of the interchange, he asked.\n\nNcube attributed the extra cost to the relocation of residents living near the construction site.\n\nThe cost of relocating, for example, relocating some of the residents that we relocated to create space, for developing this piece of infrastructure. There were some unexpected escalations of that cost, which then pushed us towards increasing the budget by another US$26 million that I have referred to, Ncube said.\n\nMutseyami was not satisfied and posed another follow-up question.\n\nCan you substantiate to the House as to how this supplementary US$26 million would just come about when the budget had already been sorted, then we have extra figures for the situation of adding US$26 million? How do you account that Hon. Minister?\n\nIn response, Ncube said the cost overruns were unforeseen and occurred during the implementation of the project.\n\nKwekwe Mbizo MP Corban Madzivanyika also challenged Ncube, reminding him that the original Trabablas Interchange budget presented to and approved by Parliament did not include the additional US$26 million. He questioned Ncubes authority to spend the extra funds without Parliamentary approval.\n\nMinister, you came and paid another additional US$26 million outside Parliament, where did you get that power to do such? Madzivanyika queried.\n\nHowever, Ncube insisted that, as Finance Minister, he is empowered to handle project budget overruns.\n\nOne did not have to come back to Parliament to be able to exercise the powers that Parliament and the Executive have already awarded or extended to me as Minister of Finance, he responded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10165407/trabablas.jpg",
            "description": "<p>By Costa Nkomo The cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed. The Treasury confirmed in Parliament that the project cost a total of US$114 million – an increase of US$26 million. When questions were raised about the project’s cost,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/\">Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid    </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Mnangagwa in surprise visit to National Assembly",
            "url": "https://www.newzimbabwe.com/mnangagwa-in-surprise-visit-to-national-assembly/",
            "content": "By Anna Chibamu\n\nPresident Emmerson Mnangagwa made an unexpected appearance at Parliament on Wednesday, marking his first visit to the National Assembly outside formal events such as the State of the Nation Address (SONA).\n\nThe unannounced visit did not form part of his usual scheduled engagements.\n\nThank you very much for your intelligence, your Presidency, the President, Dr. E.D. Mnangagwa, and members of the House. In terms of our constitution, Your Excellency, the President, is part of the legislature. So, he has every right, he has every right to come in and sit and follow proceedings accordingly.\n\nAnd he has done that today. There was also another reason why he was around, as he was looking at certain aspects of our parliament building. We were chosen to develop this.\n\nSo, we decided to come in and we welcomed him, said Speaker of Parliament, Jacob Mudenda.\n\nRecently, Mnangagwa made another impromptu visit to Parirenyatwa Group of Hospitals, Sally Mugabe Hospital and NatPharm in Harare to assess the situation of the main referral health institutions in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10084419/ED-in-Parliament.jpeg",
            "description": "<p>By Anna Chibamu President Emmerson Mnangagwa made an unexpected appearance at Parliament on Wednesday, marking his first visit to the National Assembly outside formal events such as the State of the Nation Address (SONA). The unannounced visit did not form part of his usual scheduled engagements. “Thank you very much for your intelligence, your Presidency,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-in-surprise-visit-to-national-assembly/\">Mnangagwa in surprise visit to National Assembly</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Delta Beverages blames high sugar prices, sugar tax for business struggles",
            "url": "https://www.newzimbabwe.com/delta-beverages-blames-high-sugar-prices-sugar-tax-for-business-struggles/",
            "content": "By Anna Chibamu\n\nDelta Beverages (Pvt) Ltd has raised concerns over the excessive local sugar pricing and the sugar tax, saying both factors are undermining the companys competitiveness.\n\nAppearing before the Parliamentary Portfolio Committee on Industry and Commerce on Tuesday, Deltas Finance Director Alex Makamure said the current sugar pricingset at US$900 per metric tonne by Gold Star and US$890 by Tongaat Hulettsis significantly higher than import landed prices.\n\nCurrently, imported sugar is landing at $800/int before adding the 30 surtax. With the added cost of the sugar tax, the impact of the sugar cost is a key determinant of the viability of our business.\n\nThe high cost of sugar is in addition to the recently introduced sugar tax, which is equivalent to another US$100/MT.\n\nAccording to Makamure, prices of sugar-added soft drinks increased by between 15% to 45% following the introduction of the tax in February 2024.\n\nThe highest increases were on cordials such as Mazoe Orange Crush. The process of cordials has been moderated since January 2025 after the surtax was halved to $0.0005/g.\n\nHe said most beverage producers had reported a miscalculated volume performance since February 2024, with most players absorbing the sugar tax by maintaining discounted prices to avoid a volume collapse whilst awaiting the much-needed review of the tax levels by the authorities.\n\nThe duties and surtaxes penalise the manufacturers even when they have no alternative but to access local supplies.\n\nThe Zimbabwe Sugar Association reports that they had in excess of 16,000 tons of carry-over bottler-grade sugar stocks from the 2024 milling season and there will be over 90,000 tons of uncommitted sugar stocks from the 2025 milling season.\n\nMakamure added that the sugar tax further compounds operational challenges, calling for urgent policy reviews to support the local industry.\n\nZimbabwe is a net exporter of sugar and attracts reciprocal tariffs from other countries.\n\nThe main suppliers of refined sugar are StarAfrica (Goldstar Sugars)and Tongaat Hullets (Hippo Valley & Triangle).\n\nAdded Makamure, Over the years, they have failed to meet the quantity and quality requirements.\n\nGiven these challenges, the Industry and Commerce ministry agreed with the bottlers to supplement their requirements from imports.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/25204048/Delta-Beverages.jpg",
            "description": "<p>By Anna Chibamu Delta Beverages (Pvt) Ltd has raised concerns over the excessive local sugar pricing and the sugar tax, saying both factors are undermining the company’s competitiveness. Appearing before the Parliamentary Portfolio Committee on Industry and Commerce on Tuesday, Delta’s Finance Director Alex Makamure said the current sugar pricing set at US$900 per metric tonne</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delta-beverages-blames-high-sugar-prices-sugar-tax-for-business-struggles/\">Delta Beverages blames high sugar prices, sugar tax for business struggles</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        },
        {
            "title": "Students union in fresh row over suspensions at University of Zimbabwe",
            "url": "https://www.newzimbabwe.com/students-union-in-fresh-row-over-suspensions-at-university-of-zimbabwe/",
            "content": "By Staff Reporter\n\nThe Zimbabwe National Students Union (ZINASU) finds itself once again locking horns with university authorities, this time demanding the reinstatement of members suspended from state universities.\n\nThe union is accusing three universities, Midlands State University (MSU), Great Zimbabwe University (GZU) and the University of Zimbabwe (UZ) of what it calls a flagrant violation of both domestic and international human rights law.\n\nThe suspended students stand accused of breaching conduct regulations, allegedly brandishing placards on campus and calling for a resolution to the ongoing lecturers strike.\n\nIn a letter dated 7 July 2025, and served to the students on Tuesday, UZ Vice Chancellor Paul Mapufmo stated that the six had contravened rule 3.1.4 of the Rules of Student Conduct and Discipline, 1984 Ordinance 30, by moving around campus inciting fellow students to join the lecturers protests.\n\nIt was brought to my attention that on the 12th of May 2025 at around 1210 hours, while in the company of Blessing Mtisi, Nodeshar Maingehama, Tafadzwa Katsande Masimba, Tawananyasha Hove and Mtukura Tariro were found holding unlawful demonstration at the University Halls of Residence.\n\nYou were moving one hall of residence to another, one dining hall to another, addressing fellow students and inciting them to join you to hold placards and chant slogans against the University Administration.\n\nAccordingly in light of the seriousness of the allegations detailed above, I have found it necessary to, in terms of section 8 (3) (e) of the University of Zimbabwe Act,[ Chapter 25:16], (the act) to suspend you with immediate effect, from your studies at the University of Zimbabwe indefinitely pending disciplinary hearing against you.\n\nIn response, ZINASU President Emmanuel Sitima issued three key demands, asserting that Mapfumos actions reflect a deliberate and systematic effort to criminalise dissent and suppress the agency of students as political and civic actors.\n\nSuch repressive conduct is not only morally indefensible, but legally unsustainable. The Constitution of Zimbabwe (2013), which stands as the supreme law of the Republic, guarantees the freedom of expression (Section 61), freedom of assembly and association (Section 58), and the right to peaceful demonstration and petition (Section 59), said Sitima.\n\nSitima further insisted that the suspended students must be reinstated immediately and without conditions.\n\nThe immediate and unconditional reinstatement of all students unlawfully suspended or expelled. A thorough and independent investigation into the abuse of university disciplinary procedures for political ends. Firm guarantees from the Ministry of Higher and Tertiary Education affirming the protection of student rights in accordance with the Constitution, he declared.\n\nThe dispute comes as UZ lecturers have been on strike since April, demanding fair wages. At one point, even President Emmerson Mnangagwas spokesman, George Charamba, conceded that the US$230 being offered to lecturers at UZ was a concern, pledging that his boss had approved salary increments.\n\nThe university has responded to the industrial action by suspending protesting lecturers and replacing them with what students are derisively calling virgins in the academic setting, ill-equipped to handle the demands of the job.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181242/Zinasu-5.png",
            "description": "<p>By Staff Reporter The Zimbabwe National Students Union (ZINASU) finds itself once again locking horns with university authorities, this time demanding the reinstatement of members suspended from state universities. The union is accusing three universities, Midlands State University (MSU), Great Zimbabwe University (GZU) and the University of Zimbabwe (UZ) of what it calls a “flagrant</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/students-union-in-fresh-row-over-suspensions-at-university-of-zimbabwe/\">Students union in fresh row over suspensions at University of Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:46",
            "date": "10 Jul 2025"
        }
    ]
}