{
    "news": [
        {
            "title": "Train runs over lifeless man, another killed while lying on rail tracks",
            "url": "https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/",
            "content": "By Staff Reporter\n\nA NATIONAL Railways of Zimbabwe (NRZ) trainon Mondayran over a man who is believed to have already been dead.\n\nThe incident happened atOdzi Siding near the eastern border city of Mutare.\n\nThe NRZ confirmed the incident in a statement.\n\nA man was run over by a train early this morning at Odzi Siding near Mutare. The man was lying lifeless on the tracks and did not respond to the approaching trains sounding horn.\n\nThe train crew suspect the man was already dead by the time he was run over. The man had no identity particulars on him and the scene was attended by ZRP, reads the statement.\n\nIn a separate but similar incident, a man identified as Peter Vengesayi was run over by a train near Zvishavane, Midlands province.\n\nIn yet another tragic incident today, a man died after being run over by a train near Zvishavane.\n\nPeter Vengesayi of Village 1, Zeederburg under Chief Mafala was lying on the tracks when the incident occured. The NRZ extends its condolences to his family, said NRZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/17224403/National-Railways-of-Zimbabwe.jpg",
            "description": "<p>By Staff Reporter A NATIONAL Railways of Zimbabwe (NRZ) train on Monday ran over a man who is believed to have already been dead. The incident happened at Odzi Siding near the eastern border city of Mutare. The NRZ confirmed the incident in a statement. “A man was run over by a train early this morning at Odzi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/\">Train runs over lifeless man, another killed while lying on rail tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Jul 2025"
        },
        {
            "title": "Ladysmith Black Mambazo honoured with prestigious award",
            "url": "https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/",
            "content": "TshisaLive\n\nLadysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence.\n\nThegroup, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing ofumculo wesintu, South Africas indigenous music.\n\nIn their acceptance speech, the group thanked Ukhozi FM for this recognition.\n\nWe stand humbled and honoured. Ukhozi FM celebrated us for the role weve played in nurturing and growingumculo wesintu our indigenous music. From the hills of Ladysmith to stages around the world, weve carried the sounds of our ancestors with pride,said Sibongiseni Tshabalala, the son of the founder of Ladysmith Black Mambazo,JosephTshabalala.\n\nThank you, Ukhozi FM, for this beautiful recognition.Siyabonga,thank you for walking this journey with us.\n\nThe group were among other notable artists  Nothembi Mkhwebane, Ringo and Makhadzi  who graced the stage with captivating performances.\n\nThis year marks 65 years of Ladysmith Black Mambazo in the music industry and to celebrate the milestone they are undertaking a special tour.\n\nAfter wrapping up their US tour and the first instalment of the national tour in Johannesburg, the group have performances lined up in Durban and Cape Town.\n\nIts such an amazing experience to walk in the footsteps of our father, the founder of the group Joseph Shabalala, and all others who founded the group. I have realised that I have been with the group for more than 30 years now, said Sibongiseni.\n\nThis means the legacy of the group is continuing to grow from glory to glory. In a few years from now we will celebrate 70 years, an incredible milestone in the history of music. We thank South Africans , the continent and the world for supporting us throughout this journey.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01014629/black-mambazo.png",
            "description": "<p>TshisaLive Ladysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence. The group, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing of umculo wesintu, South Africa’s indigenous music. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/\">Ladysmith Black Mambazo honoured with prestigious award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Jul 2025"
        },
        {
            "title": "EJWP backs gender policy to advance equality across Zimbabwe",
            "url": "https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) says the recently approved gender policy will go a long way inharnessinggender equality nationwide.\n\nCabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and womens empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives.\n\nIt provides a unified structure for monitoring gender equality and addresses systemic inequalities across various sectors of Zimbabwean society.\n\nSpeaking to NewZimbabwe.com this week, EJWP Executive Director, Margaret Mutsamvi, described the enactment of the blueprint as a giant step.\n\nThe recent Cabinets approval of the National Gender Policy (2025) is a significant milestone in Zimbabwes journey toward gender equality and womens empowerment. This development follows EJWPs submission of an urgent petition on 14 March 2025, calling for the renewal of the policy, which had lapsed in 2021  a gap that threatened to reverse hard-earned gains in gender equity, she said.\n\nThe CSO described the new policy as a foundation for a more inclusive, equitable and gender-responsive Zimbabwe, with clearly defined strategies to address systemic barriers across legal, economic, health, education, climate, and digital spheres.\n\nThe new policy, EJWP said, marks a shift from aspiration to action  offering a renewed national mandate to address entrenched gender disparities.\n\nAs EJWP, we remain deeply committed to supporting the full implementation of this policy, particularly around inclusive economic empowerment and accountability in public resource management. We will continue to monitor progress, engage with duty bearers, and amplify the voices of women, especially those in marginalised and economically excluded communities, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/27052230/Margaret-Mutsamvi.jpg",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) says the recently approved gender policy will go a long way in harnessing gender equality nationwide. Cabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and women’s empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives. It provides</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/\">EJWP backs gender policy to advance equality across Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Jul 2025"
        },
        {
            "title": "With tobacco output record already set, Zimbabwe eyes 400m kg milestone",
            "url": "https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/",
            "content": "Tobacco Reporter\n\nTwo weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this years crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million kg.\n\nDriving the surge is a sharp increase in smallholder participation, government-led reforms, and research-driven innovations. More than 127,000 farmers, 85% of them smallholders, are registered this season, which ensures access to inputs, training, and markets.\n\nDr. Frank Magama, CEO of Kutsaga, Zimbabwes leading tobacco research institute, credited the Tobacco Value Chain Transformation Plan introduced in 2021 for boosting productivity through better farming practices, climate-smart seed varieties, and sustainability initiatives.\n\nOver 80% of our crop was produced under contract, ensuring inputs, technical support, and guaranteed markets, Magama said. While expansion has occurred, what is more exciting is the productivity increase per unit area. With improved post-harvest handling, energy-efficient barns, and better training, the numbers are speaking for themselves.\n\nHe also warned, however, of the risks from global oversupply and stressed the importance of environmental compliance to maintain competitiveness.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31054919/Tobacco-Agriculture.jpg",
            "description": "<p>Tobacco Reporter Two weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this year’s crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/\">With tobacco output record already set, Zimbabwe eyes 400m kg milestone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Jul 2025"
        }
    ]
}