{
    "news": [
        {
            "title": "Motorist knocks dead police officer walking on roadside",
            "url": "https://www.newzimbabwe.com/motorist-knocks-dead-police-officer-walking-on-roadside/",
            "content": "By Staff Reporter\n\nA FEMALE police officer was Saturday knocked dead by a passing vehicle while she was walking, together with her workmates, on the roadside.\n\nThe now deceased police officer was identified as Constable Amanda Katanha stationed at Mazowe Police Station.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nA police officer, Constable Amanda Katanha, stationed at ZRP Mazowe, died on April 12, 2025, after being hit by a Toyota Probox vehicle, registration number AGP 8475, with three passengers on board at around 1840 hours at the 17 kilometre peg along Mazowe-Centenary Road, said Nyathi.\n\nKatanha was walking on the extreme side of the road with two other police officers after knocking off duty from a deployment at Dowkins Farm, Concession.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13181610/Screenshot_20250413-191420_1.jpg",
            "description": "<p>By Staff Reporter  A FEMALE police officer was Saturday knocked dead by a passing vehicle while she was walking, together with her workmates, on the roadside. The now deceased police officer was identified as Constable Amanda Katanha stationed at Mazowe Police Station. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “A</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-knocks-dead-police-officer-walking-on-roadside/\">Motorist knocks dead police officer walking on roadside </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Holy Ten forced off stage after angry fans throw missiles, again!",
            "url": "https://www.newzimbabwe.com/holy-ten-forced-off-stage-after-angry-fans-throw-missiles-again/",
            "content": "By Staff Reporter\n\nZIM hip-hopper HOLY Ten continues to face rejection by fans after his act during Bling 4s album launch was cut short after the crowd started throwing objects at him.\n\nThe Saturday show was to launch Bling 4s new album titled Hosanna, and Holy Ten was a guest artist but the restless Chitungwiza crowd demanded hometown hero Voltz JT, prompting the former to leave stage after sensing danger.\n\nThis is not the first time revellers have subjected Holy Ten to ridicule. Recently, he had to flee a Kariba show with furious fans baying for his blood after reportedly coming late.\n\nDuring the Chitungwiza debacle, the controversial rapper, who has lately aligned himself with ruling party Zanu PF, was forced off stage by a mob which started throwing cans at him. They were chanting NOP Makoni, the album title of his nemesis Voltz JT, which recently won an award at the National Arts Merits Awards (NAMA).\n\nHoly Ten, also known as Mujaya (young man), has been at the centre of controversy over the past few weeks, from an interview that threw jabs at almost every socialite, including his wife, and celebrities like Eubert Angel, Sir Wicknell Chivayo, and Mudiwa Hood, who ultimately filed a police report leading to a warrant of arrest being issued.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/01113948/Holy-Ten.png",
            "description": "<p>By Staff Reporter  ZIM hip-hopper HOLY Ten continues to face rejection by fans after his act during Bling 4’s album launch was cut short after the crowd started throwing objects at him. The Saturday show was to launch Bling 4’s new album titled ‘Hosanna’, and Holy Ten was a guest artist but the restless Chitungwiza</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/holy-ten-forced-off-stage-after-angry-fans-throw-missiles-again/\">Holy Ten forced off stage after angry fans throw missiles, again!</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zanu PF wins Glen View South by-election, unseats ‘dead’ opposition after 25 years",
            "url": "https://www.newzimbabwe.com/zanu-pf-wins-glen-view-south-by-election-unseats-dead-opposition-after-25-years/",
            "content": "By Staff Reporter\n\nZIMBABWES ruling party, Zanu PF has won the Glen View South by-election, marking a major political turning point, grabbing a parliamentary seat traditionally held by the opposition.\n\nZanu PF candidate Tsitsi Tranquility Tawomhera is now the Member of Parliament (MP)-elect after garnering an unassailable 3 404 votes, according to results from the Zimbabwe Electoral Commission (ZEC) constituency elections officer Killian Gambe.\n\nTawomhera shrugged off competition from four other candidates: three independents  Toenderai Chakaredza (993), George Makwangwaidze (681), Tungamirai Madzokere (234)  and National Constitutional Assembly (NCA) candidate Perpetua Mukanda, who scrapped a paltry 77 votes. There were 44 rejected ballots.\n\nVoter apathy characterised the plebiscite, with turnout pegged at 17,2% of Glen View Souths registered voter population of 31 519.\n\nThe seat fell vacancy after the death of Grandmore Hakata.\n\nCommenting on Zanu PFs by-election victory, award-winning journalist and political observer, Hopewell Chinoono blamed the divided opposition for the result, suggesting the alternative is dead.\n\nToday, Glen View is in the hands of Zanu PF for the first time in 25 yearsnot because Zanu PF has done anything fantastic, but because it faces an opposition built around a popular personality, not ideas or a cause.\n\nMany of us think of ourselves as educated, but education is not the certificates we holdit is the ability to use the knowledge we gained from school to think and compute ideas, said Chinoono.\n\nWhat is happening today was predicted on this page in 2022; that without a structured opposition with a Constitution, Zanu PF would pounce.\n\nBut as usual, I was insulted and told about a plan called strategic ambiguity. What happened to the plan?\n\nZanu PF will be in power with a huge majority post 2028 if things remain the way they are. Reality does not hero-worship personalitiesit favours common sense.\n\nThe reality of politics is that if it is hinged on personalities rather than ideas and a cause, the regime becomes stronger because it either buys or immobilises those personalities.\n\nThe MDC survived as long as it did because Morgan Tsvangirai, for the most part, was not threatened by those more educated or more talented than himhe was secure. The pastor is not.\n\nTsvangirai understood the importance of structures and of allowing leaders at various levels to be independent and strong.\n\nWhat you saw in Glen View is the beginning of the total end of the 1999 project, he added.\n\nThe current opposition leaders are the best thing that has ever happened to Zanu PF, Chinoono opined.\n\nWhy would you not want people who are hero-worshipped yet do nothingwho cannot even speak-out about corruption or draconian laws against the citizens?\n\nWhenever you see infighting in Zanu PF, it means there is no opposition to speak of. We are in the worst period Zimbabwe has experienced since 1999. The citizens must be told the truth; 2028 is gone save for a miracle!\n\nThe oppositions emphasis on personalities rather than ideas and causes is a recurring issue that has weakened the opposition and strengthened the regime.\n\nChinoono further stated that the lack of a clear and consistent message from the opposition on critical issues like corruption and draconian laws is a reflection of a failed leadership.\n\nIt is strange that you have adults who defend the mediocrity of their leaders, it is mind boggling as it is sad to watch! It is like watching a man self-harm yet you cant do anything about it! Continue to fool yourselves!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13083854/Screenshot_20250413-092606_1.jpg",
            "description": "<p>By Staff Reporter  ZIMBABWE’S ruling party, Zanu PF has won the Glen View South by-election, marking a major political turning point, grabbing a parliamentary seat traditionally held by the opposition. Zanu PF candidate Tsitsi Tranquility Tawomhera is now the Member of Parliament (MP)-elect after garnering an unassailable 3 404 votes, according to results from the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-wins-glen-view-south-by-election-unseats-dead-opposition-after-25-years/\">Zanu PF wins Glen View South by-election, unseats ‘dead’ opposition after 25 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Jailed AMH journalist sues Justice and Information ministers",
            "url": "https://www.newzimbabwe.com/jailed-amh-journalist-sues-justice-and-information-ministers/",
            "content": "By Staff Reporter\n\nALPHA Media Holdings (AMH) journalist Blessed Mhlanga has sued Justice and Information ministers as well as the Attorney General (AG) over his arrest arguing that it was unconstitutional.\n\nMhlanga is accused of transmitting information containing inciting messages following a press conference held by the former Zanu PF Central Committee member, Blessed Geza.\n\nHe faces allegations of contravening section 164 of the Criminal Law (Codification and Reform) Act [Chapter 9:23], that is Transmission of data message inciting violence or damage to property.\n\nThe senior journalist has been behind bars since his arrest on February 24, 2025, having been denied bail by both the magistrates court on two occasions, and the High Court.\n\nIn the present application Mhlanga complains about the section under which he was charged and feels that it is in contradiction with the Constitution.\n\nThe section violates freedom of expression and freedom of the media as well as section 62 of the Constitution, Access to Information.\n\nSection 61 of the Constitution states that every person has the right to freedom of expression, which includes freedom to seek, receive and communicate ideas and other information, freedom of artistic expression and scientific research a d creativity and academic freedom.\n\nEvery person is entitled to freedom of the media which includes the protection of the confidentiality of Journalists sources on information, reads part of the application.\n\nMhlanga also denied allegations being levelled against him.\n\nTo be clear, this is not an appeal against the proceedings of the lower court. This is a stand-alone challenge on the constitutionality of the controversial statutory provision.\n\nIt is on account of my doubt about the constitutionality of s 164 of the Criminal Code that I petition this honourable court for direct access.\n\nIt appears most prudent and effective for me to raise the constitutional questions that form the basis of this application through the direct access to the Constitutional Court route, as opposed to other options available at law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter ALPHA Media Holdings (AMH) journalist Blessed Mhlanga has sued Justice and Information ministers as well as the Attorney General (AG) over his arrest arguing that it was unconstitutional. Mhlanga is accused of transmitting information containing inciting messages following a press conference held by the former Zanu PF Central Committee member, Blessed Geza.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jailed-amh-journalist-sues-justice-and-information-ministers/\">Jailed AMH journalist sues Justice and Information ministers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Man accidentally stones baby to death during fight with girlfriend",
            "url": "https://www.newzimbabwe.com/man-accidentally-stones-baby-to-death-during-fight-with-girlfriend/",
            "content": "By Staff Reporter\n\nA MASVINGO man will forever regret the day he tried to pelt his lover with a stone but missed the target and hit a baby strapped on her back.\n\nThe murder suspect was identified as 52-year-old Douglas Gwizangwe.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Masvingo arrested Douglas Gwizangwe (52) in connection with a case of murder which occurred on April 9, 2025, at Munangari Village, Shongamiti, Chivi, said Nyathi.\n\nThe suspect hit the victim with a stone on the eye during a fight with his ex-girlfriend, who was carrying the victim on her back.\n\nThe suspect had allegedly intended to hit his ex-girlfriend with the stone but missed her.\n\nThe victim succumbed to the injuries upon admission at Chiredzi Hospital.\n\nMeanwhile, police in Shurugwi are appealing for information which may lead to the arrest of Jimson Pikai Chimba Hlawu, who is being sought in connection with a case of murder in which an artisanal miner died after being stabbed multiple times all over the body with a sharp object at Ash 16 Gold Mine April 10, 2025.\n\nZRP appealed to anyone with information to report at any nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  A MASVINGO man will forever regret the day he tried to pelt his lover with a stone but missed the target and hit a baby strapped on her back. The murder suspect was identified as 52-year-old Douglas Gwizangwe. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-accidentally-stones-baby-to-death-during-fight-with-girlfriend/\">Man accidentally stones baby to death during fight with girlfriend </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "At least 100 people killed in attacks on famine-hit camps in Sudan’s Darfur, UN official says",
            "url": "https://www.newzimbabwe.com/at-least-100-people-killed-in-attacks-on-famine-hit-camps-in-sudans-darfur-un-official-says/",
            "content": "By Associated Press\n\nSUDANS notorious paramilitary group launched a two-day attack on famine-hit camps for displaced people that left more than 100 dead, including 20 children and nine aid workers, in the Darfur region, a U.N. official said Saturday.\n\nThe Rapid Support Forces and allied militias launched an offensive on the Zamzam and Abu Shorouk camps and the nearby city of el-Fasher, the provincial capital of North Darfur province, on Friday, said U.N. Resident and Humanitarian Coordinator in Sudan Clementine Nkweta-Salami.\n\nEl-Fasher is under the control of the military, which has fought the RSF since Sudan descended into civil war two years ago, killing more than than 24,000 people, according to the United Nations, though activists say the number is likely far higher.\n\nThe camps were attacked again on Saturday, Nkweta-Salami said in a statement. She said that nine aid workers were killed while operating one of the very few remaining health posts still operational in Zamzam camp.\n\nThis represents yet another deadly and unacceptable escalation in a series of brutal attacks on displaced people and aid workers in Sudan since the onset of this conflict nearly two years ago, she said.\n\nNkweta-Salami didnt identify the aid workers but Sudans Doctors Union said in a statement that six medical workers with the Relief International were killed when their hospital in Zamzam came under attack on Friday.\n\nThey include Dr. Mahmoud Babaker Idris, a physician at the hospital, and Adam Babaker Abdallah, head of the group in the region, the union said.It blamed the RSF for this criminal and barbaric act.\n\nThe offensive forced about 2,400 people to flee the camps and el-Fasher, according to the General Coordination for Displaced Persons and Refugees, a local group in Darfur.\n\nZamzam and Abu Shouk shelter more than 700,000 people who have been forced to flee their homes across Darfur during past bouts of fighting in the region, Nkweta-Salami said.\n\nLate last month, the Sudanese military regained control over Khartoum, a major symbolic victory in the war. But the RSF still controls most of Darfur and some other areas.\n\nThe two camps are among five areas in Sudan where famine was detected by the Integrated Food Security Phase Classification, IPC, a global hunger monitoring group.\n\nThe war has created the worlds largest humanitarian crisis, with about 25 million people  half of Sudans population  facing extreme hunger.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13063122/15sudan-darfur-add-fzpb-mediumSquareAt3X.jpg",
            "description": "<p>By Associated Press SUDAN’S notorious paramilitary group launched a two-day attack on famine-hit camps for displaced people that left more than 100 dead, including 20 children and nine aid workers, in the Darfur region, a U.N. official said Saturday. The Rapid Support Forces and allied militias launched an offensive on the Zamzam and Abu Shorouk</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/at-least-100-people-killed-in-attacks-on-famine-hit-camps-in-sudans-darfur-un-official-says/\">At least 100 people killed in attacks on famine-hit camps in Sudan’s Darfur, UN official says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Tyla turns heads on magazine cover and hints at a rap revolution",
            "url": "https://www.newzimbabwe.com/tyla-turns-heads-on-magazine-cover-and-hints-at-a-rap-revolution/",
            "content": "By IOL\n\nANOTHER day, another slay, and this time, Tyla is front and centre on the April cover of Nylon magazine, continuing her reign as one of the most stylish stars on the planet.\n\nAt just 23, the South African singer is not only delivering bangers on stage but serving fashion fantasy in every editorial shoot. This latest spread is no different: bold looks, sharp silhouettes, and that effortless cool only she can pull off.\n\nTylas feature comes hot off the heels of an impressive list of magazine covers. In just over a year, shes graced the pages of British Vogue, Elle US, Billboard, Cosmopolitan, BeatRoute, T Magazine from The New York Times, and Dazed.\n\nEach shoot has spotlighted her meteoric rise from Johannesburg girl to global It-girl, never shying away from showcasing her roots.\n\nNylon magazine is considered a cool-girl staple in the fashion and pop culture world not necessarily massive like Vogue or Elle, but highly influential among Gen Z and millennial readers.\n\nIn her interview, Tyla opens up about the whirlwind of fame and how her family is riding the wave alongside her. She shared a funny moment when a fan DMd her with a photo, not of her, but of her mum.\n\nThey ask me for pictures, too, Tyla, her mother told her. Fame, it seems, runs in the family now. But its not all glitz and red carpets.\n\nTyla is taking her artistry seriously and isnt afraid to shake things up.\n\nOne day, youre going to get that Tyla rap song, she teased, hinting that theres much more to her than catchy Amapiano hooks and glossy visuals.\n\nShes taking her time with her next album, wanting to showcase a fuller picture of who she is beyond what people expect.\n\nIm excited to show people that Im more diverse than they think. I want to take my time with my artistry and give whatever feels right for that moment.\n\nWhen asked where shed take fans to understand her music better, she didnt hesitate: the CBD in Johannesburg. Its the chaos, the culture, the sound of taxis, shouting, and local music blaring from every corner that inspired her growing up, and that energy still pulses through her dance tracks.\n\nYou can hear our music playing loud. You can hear our accents, people shouting, taxis driving crazy. I would take people there because that feels like how my dance music feels, I think, she said.\n\nOn the topic of representation, Tyla shared her dreams of seeing African music  pure and unfiltered  become just as global as pop.\n\nI would love to see an African artist even if the artist isnt born and raised on the continent make African music without pop influences, just true African music. I would love to see that be as global as pop music is one day, she said.\n\nNot watered down, not reshaped to fit a Western mould. And even if shes not the one to push it all the way, shes rooted in who she is.\n\nIm an African girl, and Im always going to be, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13061904/In-her-latest-feature-Tyla-opens-up-about-her-Joburg-roots-her-love-for-fashion-and-why-she-s-ready-to-explore-rap-in-her-next-album.webp",
            "description": "<p>By IOL ANOTHER day, another slay, and this time, Tyla is front and centre on the April cover of “Nylon” magazine, continuing her reign as one of the most stylish stars on the planet. At just 23, the South African singer is not only delivering bangers on stage but serving fashion fantasy in every editorial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tyla-turns-heads-on-magazine-cover-and-hints-at-a-rap-revolution/\">Tyla turns heads on magazine cover and hints at a rap revolution</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe-China tobacco expo to be held in third quarter",
            "url": "https://www.newzimbabwe.com/zimbabwe-china-tobacco-expo-to-be-held-in-third-quarter/",
            "content": "By Xinhua\n\nZIMBABWE will hold the first Zimbabwe-China tobacco expo in the third quarter of this year to promote the countrys tobacco, the countrys industry regulatory body, the Tobacco Industry and Marketing Board (TIMB), announced Friday.\n\nThe expo will be held in the capital, Harare, by the TIMB in partnership with the Asia-Europe and Africa Joint Trade and Investment Promotion Association, an international non-governmental organization.\n\nIt is expected to bring together tobacco industry players across all the value chains, such as farmers, merchants, government representatives, and cigarette manufacturers, among other players, to advance cooperation in the tobacco sector.\n\nSpeaking after the signing of a memorandum of understanding between the TIMB and the Tianjin representative office of the association in Harare, Emmanuel Matsvaire, acting chief executive officer of the TIMB, said the expo will bring solutions to challenges facing the local tobacco industry and open up new markets for Zimbabwe.\n\nOur farmers, through the value chain, have some challenges that probably have a solution that is available in China. What we want to do is to bridge the gap between what the farmers are looking for and what the Chinese can offer as a solution, from planting right up to the cigarette production, he said.\n\nThe expo is also expected to unlock opportunities for the local tobacco industry in international markets, as well as bring new technologies, he said.\n\nChina remains a major buyer of Zimbabwes tobacco, consuming about 100 million kg of the countrys tobacco crop each year, said Matsvaire.\n\nThe Chinese ordinarily would account for a third of the total tobacco that will be purchased from this country. We are expecting a crop size of about 280 million kg of tobacco at the end of this year, he said.\n\nHe noted that China Tobacco, through its local subsidiary, Tianze Tobacco Company, has been pivotal in supporting the local tobacco industry through contract farming since the advent of Zimbabwes land reform program of the early 2000s.\n\nLu Zhaofeng, executive president of the association, said the vision of this expo is to promote international trade in the tobacco business between China and Zimbabwe.\n\nThrough this expo, we want to get suppliers of facilities, equipment, and packaging industries to come here to have a look at the local requirements, she said.\n\nTobacco, primarily cultivated by small-scale farmers, is Zimbabwes leading agricultural export and one of the countrys top foreign currency earners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230321/Tobacco-Zimbabwe-e1586276848286.jpg",
            "description": "<p>By Xinhua ZIMBABWE will hold the first Zimbabwe-China tobacco expo in the third quarter of this year to promote the country’s tobacco, the country’s industry regulatory body, the Tobacco Industry and Marketing Board (TIMB), announced Friday. The expo will be held in the capital, Harare, by the TIMB in partnership with the Asia-Europe and Africa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-china-tobacco-expo-to-be-held-in-third-quarter/\">Zimbabwe-China tobacco expo to be held in third quarter </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwean avocado gains traction among Chinese importers",
            "url": "https://www.newzimbabwe.com/zimbabwean-avocado-gains-traction-among-chinese-importers/",
            "content": "By Xinhua\n\nCHINESE importers have positively reviewed the quality and output of Zimbabwean avocados and are committed to helping local farmers tap into the Chinese market, a Chinese trade specialist has said.\n\nSpeaking to Xinhua late Friday in Harare, Zimbabwes capital, Lu Zhaofeng, executive president of the Asia-Europe and Africa Joint Trade and Investment Promotion Association, an international non-governmental organization, expressed optimism that the rising demand from China would drive Zimbabwes avocado exports.\n\nLu, who led a group of Chinese importers to review the avocado industry in Zimbabwe this week, said the avocados excellent quality and high yield have bolstered Chinese buyers confidence that it would make a strong showing and gain a foothold in the Chinese market.\n\nZimbabwe boasts a variety of avocado types, and their flesh is so smooth and delicate. It is a sure bet that Chinese consumers will like them, Lu said.\n\nShe told Xinhua that during this trip, Chinese importers learned more about Zimbabwes avocado industry and the countrys willingness to boost the agricultural sector.\n\nIn September last year, a trade protocol on the export of Zimbabwean avocados was inked during Zimbabwean President Emmerson Mnangagwas state visit to China, which brought joy to Zimbabwean farmers who have always been eager to expand their overseas markets.\n\nNoting that Zimbabwes avocado industry still faces multiple challenges such as climate change, inadequate irrigation and poor transportation, Lu said Chinese importers are willing to provide the much-needed technology and equipment to help local farmers boost their output.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/01/18155817/Avocado.jpg",
            "description": "<p>By Xinhua CHINESE importers have positively reviewed the quality and output of Zimbabwean avocados and are committed to helping local farmers tap into the Chinese market, a Chinese trade specialist has said. Speaking to Xinhua late Friday in Harare, Zimbabwe’s capital, Lu Zhaofeng, executive president of the Asia-Europe and Africa Joint Trade and Investment Promotion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-avocado-gains-traction-among-chinese-importers/\">Zimbabwean avocado gains traction among Chinese importers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        },
        {
            "title": "Ngezi Platinum Stars suffer first defeat of the season",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-stars-suffer-first-defeat-of-the-season/",
            "content": "By Sports Reporter\n\nNGEZI Platinum Stars were Saturday afternoon handed a 2-1 defeat by TelOne F.C to record their first loss of the season.\n\nThe Mhondoro-based side, however, maintained their stay on top of the log with 13 points, two ahead of MWOS who is travelling to Wadzanayi for a date against Herentals F.C.\n\nMadamburo was enjoying its best start in the Premier Soccer League (PSL) football history after picking one draw and four wins in its first five games.\n\nSpeaking after Saturdays match, Ngezi Platinum Stars coach Takesure Chiragwi saluted his boys performance despite ending on the losing end.\n\nOn the road they are some games that are difficult for you, and we have lost but we have to pick ourselves going forward because its a marathon.\n\nI think we have to applaud ourselves despite the result. We played well and our performance can guarantee us a positive result in our next game, he said.\n\nSaturdays result saw TelOne bouncing back to winning ways after losing to Simba Bhora last week.TelOnes seond goal came from their inform striker Washington Navaya, who is now leading the top goalscorers chart with five goals.\n\nNavaya was last month voted the leagues Player of The Month, earning praises from team coach Herbert Maruwa.\n\nWe needed to respond after last weeks defeat and l am happy, we did that.\n\nOf course, our players did what we wanted, Washington Navaya scoring for us again is good, l am happy that he is doing his job.\n\nUsually, he is remaining behind to do some extras and its good to have such kind of players, said Maruwa.\n\nMeanwhile, Manica Diamonds were handed a heavy 4-1 defeat by Simba Bhora at Wadzanayi Stadium while Triangle went down 2-1 to Bikita Minerals at Gibbo Stadium.\n\nAt Rufaro Stadium, Yadah Stars managed to hold money bags Scottland F.C to a 1-1 draw as FC Platinum settled for a 0-0 draw against Green Fuel.\n\nCastle Lager Premier Soccer League Matchday 5 fixtures\n\nHighlanders vs CAPS United (Barboufields Stadium)\n\nHerentals vs MWOS FC (Wadzanayi Stadium).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/05212406/Ngezi-Platinum.jpg",
            "description": "<p>By Sports Reporter NGEZI Platinum Stars were Saturday afternoon handed a 2-1 defeat by TelOne F.C to record their first loss of the season. The Mhondoro-based side, however, maintained their stay on top of the log with 13 points, two ahead of MWOS who is travelling to Wadzanayi for a date against Herentals F.C. Madamburo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-stars-suffer-first-defeat-of-the-season/\">Ngezi Platinum Stars suffer first defeat of the season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "13 Apr 2025"
        }
    ]
}