{
    "news": [
        {
            "title": "19 Hippos die mysteriously in the last three months — ZimParks official",
            "url": "https://www.newzimbabwe.com/19-hippos-die-mysteriously-in-the-last-three-months-zimparks-official/",
            "content": "By Tapiwa Svondo\n\nAT least 19 hippopotamuses have died in the last three months under unclear circumstances in the Sapi Safari Area and another in Chirundu, located in the Mid Zambezi region, Hurungwe district, Mashonaland West.\n\nIn a statement, Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the mysterious deaths of the hippos and indicated that samples have been taken for further investigations.\n\nZimbabwe Parks and Wildlife Management Authority is saddened to report the deaths of 18 hippos in the Sapi Safari Area and one in Chirundu over the last three months.\n\nThe Authority is carrying out investigations with various partners to ascertain the cause of deaths. Samples have been taken and sent for lab testing and we are waiting for the results, said Farawo.\n\nDeaths of the giant mammals in the Mid Zambezi region follows an ecological disaster at Lake Chivero, where hordes of fish species and four rhinos, succumbed to suspected toxic substances spewed into the water body by unknown elements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23164802/hippo_16x9.jpg",
            "description": "<p>By Tapiwa Svondo  AT least 19 hippopotamuses have died in the last three months under unclear circumstances in the Sapi Safari Area and another in Chirundu, located in the Mid Zambezi region, Hurungwe district, Mashonaland West. In a statement, Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson, Tinashe Farawo confirmed the mysterious deaths of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/19-hippos-die-mysteriously-in-the-last-three-months-zimparks-official/\">19 Hippos die mysteriously in the last three months — ZimParks official </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Crisis Coalition commends SADC Troika’s swift action to resolve Mozambique turmoil",
            "url": "https://www.newzimbabwe.com/crisis-coalition-commends-sadc-troikas-swift-action-to-resolve-mozambique-turmoil/",
            "content": "By Staff Reporter\n\nTHE Southern African Development Community (SADC) has been hailed for its timely response to the ongoing political crisis in Mozambique resulting from disputed October elections.\n\nIn a statement, Crisis in Zimbabwe Coalition (CiZC) pat SADC Chairman, President Emmerson Mnangagwa and the organs Troika for swiftly reacting to try and resolve the turmoil in the former Portuguese colony.\n\nCiZC applauds the recent actions taken by SADC, particularly in convening an Extraordinary Summit of Heads of State and Government of the Organ Troika on Sunday, 5 January 2025.\n\nDuring the summit, the Troika acknowledged the gravity of the ongoing post-election insecurity in Mozambique. They highlighted that this instability not only poses a significant threat to national stability but also has far-reaching repercussions for regional trade and security dynamics, said the coalition.\n\nThe Troika expressed deep concern regarding the potential implications of this turmoil on the broader SADC region, which could adversely affect cooperation and unity among member states.\n\nConvening of the summit is said to have followed considerable advocacy and pressure from various regional civil society organisations.\n\nIn December 2024, the Coalition, alongside other regional organizations and coalitions, launched a fact-finding mission in Mozambique. The aim was to assess the situation on the ground and collaboratively urged the SADC to take prompt action by organizing a meeting of the Organ on Politics, Defence and Security Cooperation.\n\nThe emphasis was placed on the urgent necessity for dialogue and conflict resolution within Mozambique. The petition highlighted the importance of SADC leveraging its existing mechanisms, such as the Panel of Elders, to directly engage with various stakeholders, including government representatives and civil society organisations in Mozambique.\n\nIn response to this call for action, SADC demonstrated its responsiveness by mandating the SADC Panel of Elders. This panel, supported by the Ministerial Committee of the Organ (MCO) comprising Troika member statesnamely Malawi, Zambia, and the United Republic of Tanzaniaand the SADC Secretariat, has been empowered to engage with the Government of Mozambique and key opposition leaders to assess and navigate the challenging post-election environment, further said CiZC.\n\nA comprehensive report on findings and recommendations is to be submitted to the Chairperson of the SADC Organ by January 15, 2025.\n\nThe lobby group expressed confidence that a coordinated and multifaceted approach will be deployed to facilitate genuine dialogue among squabbling parties to resolve the crisis in Mozambique.\n\nThis is essential for restoring peace and ensuring long-term stability in the country.\n\nWe applaud the Troikas commitment to the core objectives of SADC, which focus on fostering a peaceful, secure, and prosperous region for all member states.\n\nWe remain hopeful that this initiative represents the beginning of a constructive process that will ultimately lead to a sustainable and peaceful resolution to the current challenges in Mozambique.\n\nCiZC said the Troikas proactive approach in engaging the conflicting parties is a significant advancement towards achieving lasting peace and genuine dialogue.\n\nAs SADC moves forward, it is crucial not only to address the immediate crisis but also to strive for the establishment of sustainable peace that will benefit the entire region.\n\nCiZC is actively coordinating regional solidarity efforts, which are vital in supporting Mozambican civil society. We are committed to promoting constructive and genuine dialogue aimed at achieving a peaceful solution that will facilitate necessary institutional reforms in Mozambique.\n\nThe success of these regional efforts will rely on sustained cooperation between local, regional, and international actors. It is vital to maintain a clear focus on supporting locally-led solutions while simultaneously providing essential external support and solidarity, said the lobby group.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/04041156/2024-10-21T115556Z_2141171617_RC2YOAA9KH7P_RTRMADP_3_MOZAMBIQUE-ELECTION-1729538456.jpg",
            "description": "<p>By Staff Reporter  THE Southern African Development Community (SADC) has been hailed for its timely response to the ongoing political crisis in Mozambique resulting from disputed October elections. In a statement, Crisis in Zimbabwe Coalition (CiZC) pat SADC Chairman, President Emmerson Mnangagwa and the organ’s Troika for swiftly reacting to try and resolve the turmoil</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crisis-coalition-commends-sadc-troikas-swift-action-to-resolve-mozambique-turmoil/\">Crisis Coalition commends SADC Troika’s swift action to resolve Mozambique turmoil</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Cases of respiratory infection HMPV surge in Malaysia following China outbreak",
            "url": "https://www.newzimbabwe.com/cases-of-respiratory-infection-hmpv-surge-in-malaysia-following-china-outbreak/",
            "content": "The Economic Times\n\nHMPV cases are now reportedly rising in Malaysia. In 2024, 327 HMPV cases were reported in the country, a 45% increase compared to 225 cases in 2023.\n\nThis increase comes amidst reports of rising respiratory illnesses in other countries, including China.\n\nHMPV is a respiratory infection caused by a virus in the -Pneumoviridae- family. Symptoms often resemble a common cold, but severe cases can develop into bronchitis or pneumonia.\n\nAccording to the Straits Times, Malaysias Health Ministry urged the public to practice preventive measures, including frequent handwashing with soap, wearing face masks, and covering the mouth and nose when coughing or sneezing.\n\nThe public is advised to proactively take care of their health and prevent infection to others, especially in enclosed and crowded areas, the ministry stated.\n\nThis includes those planning to travel to countries at risk.\n\nHowever, the ministry emphasized that HMPV is not a new disease.\n\nFAQ: Human Metapneumovirus (HMPV)\n\nWhat is Human Metapneumovirus (HMPV)?\n\nDiscovered in 2001, HMPV belongs to the Pneumoviridae family, the same family as respiratory syncytial virus (RSV). It is a respiratory virus that typically causes upper and lower respiratory infections, with symptoms resembling the common cold or flu.\n\nWhy is HMPV in the news?\n\nChina is currently experiencing a surge in HMPV cases, alongside other respiratory illnesses like influenza A, Mycoplasma pneumoniae, and COVID-19.\n\nReports suggest hospitals in some regions are overwhelmed, but Chinese authorities and the World Health Organization (WHO) have not declared a state of emergency.\n\nWho is most at risk from HMPV?\n\nHMPV can affect people of all ages, but the most vulnerable groups include:\n\nChildren under five, particularly infants. Older adults, especially those over 65.\n\nPeople with weakened immune systems or chronic respiratory conditions like asthma or COPD.\n\nHow does HMPV spread?\n\nHMPV spreads through: Respiratory droplets from coughing or sneezing.\n\nClose contact, such as shaking hands or touching someone infected.\n\nContact with contaminated surfaces, followed by touching the mouth, nose, or eyes.\n\nThe virus often circulates seasonally, peaking in late winter and spring in temperate regions.\n\nWhat are the symptoms of HMPV?\n\nAccording to the CDC, symptoms include:\n\nCough and runny or stuffy nose, fever, sore throat, wheezing or shortness of breath in severe cases.\n\nIn more serious cases, it can escalate to bronchitis, pneumonia, or asthma exacerbations.\n\nHow is HMPV diagnosed?\n\nTesting is rare unless symptoms are severe or part of an outbreak. Diagnostic methods include: Nucleic Acid Amplification Test (NAAT): Detects viral genome in respiratory secretions.\n\nImmunofluorescence or Enzyme Immunoassay: Detects viral antigens.\n\nHow can HMPV be prevented?\n\nThe CDC recommends the following precautions:\n\nIs there a treatment for HMPV?\n\nThere is no specific antiviral treatment or vaccine for HMPV. Symptom management includes:\n\nHow does HMPV compare to COVID-19?\n\nBoth HMPV and COVID-19 cause respiratory symptoms such as coughing, fever, congestion, and shortness of breath. They also spread through respiratory droplets.\n\nHMPV: Peaks during winter and spring.\n\nCOVID-19: Spreads year-round due to evolving variants.\n\nPost-COVID-19 lockdowns, surges in HMPV cases have been observed as populations re-expose themselves to respiratory pathogens.\n\nWhen should you seek medical attention?\n\nIs HMPV a new pandemic threat?\n\nNo, HMPV is not a new virus or an imminent pandemic threat. Seasonal surges are common, particularly during the winter months. However, the increase in cases post-COVID-19 restrictions has raised concerns.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/26043159/Coronavirus1.jpg",
            "description": "<p>The Economic Times  HMPV cases are now reportedly rising in Malaysia. In 2024, 327 HMPV cases were reported in the country, a 45% increase compared to 225 cases in 2023. This increase comes amidst reports of rising respiratory illnesses in other countries, including China. HMPV is a respiratory infection caused by a virus in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cases-of-respiratory-infection-hmpv-surge-in-malaysia-following-china-outbreak/\">Cases of respiratory infection HMPV surge in Malaysia following China outbreak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "SADC tasks security arm to safeguard regional trade routes in wake of Mozambique unrest",
            "url": "https://www.newzimbabwe.com/sadc-tasks-security-arm-to-safeguard-regional-trade-routes-in-wake-of-mozambique-unrest/",
            "content": "By newZWire\n\nTHE Southern African Development Community (SADC) has directed its security committee to find ways to protect regional trade routes and energy corridors impacted by ongoing unrest in Mozambique.\n\nThe protests that started after disputed October elections have left hundreds dead and disrupted key trade routes and energy exports to neighbouring countries.\n\nOn Sunday, regional leaders held an Extraordinary Summit of the Organ Troika to discuss the post-election violence in Mozambique.\n\nThe Summit directed the Inter-state Defence and Security Committee to propose measures to protect the regional trade routes, humanitarian corridors, and energy supplies while finding solutions to the political and security challenges in the Republic of Mozambique, SADC said after the meeting.\n\nIn December, businesses in Mozambique met President Filipe Nyusi and asked for escorts to protect trade routes, including the Beira corridor to Zimbabwe.\n\nIn November, SA temporarily closed the Lebombo port of entry, its main border crossing with Mozambique. The Road Freight Association said the disruptions at the ports of entry cost South Africa R10 million a day.\n\nTanzanian President Samia Suluhu Hassan chaired Sundays virtual meeting, also attended by Zambian President Hakainde Hichilema and Malawis Lazarus Chakwera, the other troika members. Nyusi and SADC executive secretary Elias Magosi also attended.\n\nAt the meeting, Hichilema said the conflict is not only affecting the people of Mozambique but also hindering regional trade in critical sectors like energy and transport.\n\nOpposition candidate Venancio Mondlane disputes the election, in which ruling FRELIMO was declared the winner.\n\nThe United Nations Refugee Agency (UNHCR) says more than 2,000 people have fled Mozambique into neighbouring Malawi while another 1,000 have fled to Eswatini.\n\nMondlane, who has been directing the protests from Europe via Facebook, has vowed to return to the country on Thursday. He says he will be inaugurated on January 15 as the countrys legitimate leader.\n\nHowever, divisions have emerged between Mondlane and PODEMO, the party that backed him, over whether opposition MPs should take up their seats in Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/07063850/moza-696x464-1.jpg",
            "description": "<p>By newZWire  THE Southern African Development Community (SADC) has directed its security committee to find ways to protect regional trade routes and energy corridors impacted by ongoing unrest in Mozambique. The protests that started after disputed October elections have left hundreds dead and disrupted key trade routes and energy exports to neighbouring countries. On Sunday,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-tasks-security-arm-to-safeguard-regional-trade-routes-in-wake-of-mozambique-unrest/\">SADC tasks security arm to safeguard regional trade routes in wake of Mozambique unrest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Struggling to repay US$10m, corporate rescue a Beta escape route for troubled brickmaker",
            "url": "https://www.newzimbabwe.com/struggling-to-repay-us10m-corporate-rescue-a-beta-escape-route-for-troubled-brickmaker/",
            "content": "By newZWire\n\nBETA Holdings, one of the countrys biggest brick makers, is going into corporate rescue after production failures left it unable to service loans of nearly US$10 million.\n\nThe companys directors agreed on December 24 to put the company into corporate rescue, an action that would prevent creditors from grabbing the companys assets.\n\nDue to a lack of sufficient working capital to sustain production, the subsidiaries of the company are currently in financial distress.\n\nThe subsidiaries have not produced at optimum levels since April 2023, which has adversely impacted the revenue of the entire group, the company says in a report filed with the Master of the High Court.\n\nThe companys troubles became clear in 2023 when customers suffered worsening delays in the delivery of orders. Beta said it was investing in two plants, in Mt Hampden and Melfort, hoping to increase capacity from 6 million bricks a month to 24 million a month. But thin capital has seen production fall over recent years. In 2023, the company said it was failing to pay workers at Mt Hampden due to unprecedented challenges.\n\nThe company had taken out loans, including from banks, and is failing to pay them off. By November, was had arrears of US$1.2 million on its loans. Says Beta: The company is therefore potentially liable, jointly, and severally, to settle the outstanding balance in the sum of US$9,620,743.25. The potential liability comes at a time when the company is not generating any revenue, which can be used to settle the claim.\n\nThe board believes the company can still be saved, and that given the current construction boom in the country, there is high demand for products manufactured by the company.\n\nCompetition is rising in the brick business, with new, smaller and nimbler players eating away at the market share of dominant brick makers, at a time demand for bricks is strong.\n\nAnother company, Willdale, is selling idle land to raise money for a new plant, which it needs to catch up with thriving competitors. Willdales old plants and high costs have seen it struggle to meet orders from customers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/07053103/Msw6B0N1WIcx6YGJ8PX6WfkDYE7iV9roSUbdpkmL.jpg",
            "description": "<p>By newZWire  BETA Holdings, one of the country’s biggest brick makers, is going into corporate rescue after production failures left it unable to service loans of nearly US$10 million. The company’s directors agreed on December 24 to put the company into corporate rescue, an action that would prevent creditors from grabbing the company’s assets. “Due</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/struggling-to-repay-us10m-corporate-rescue-a-beta-escape-route-for-troubled-brickmaker/\">Struggling to repay US$10m, corporate rescue a Beta escape route for troubled brickmaker</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "City of Harare blocked from demolishing 5,000 houses: Minister says residents be given four months’ notice to recover building materials",
            "url": "https://www.newzimbabwe.com/city-of-harare-blocked-from-demolishing-5000-houses-minister-says-residents-be-given-four-months-notice-to-recover-building-materials/",
            "content": "By Anna Chibamu\n\nLOCAL Government Minister, Daniel Garwe this Monday fumed over demolitions of properties deemed illegal by local councils, which ironically would have inspected and certified construction of same.\n\nGarwe was responding to questions from journalists in Harare relating to local government issues affecting residents countrywide.\n\nQuizzed on the ill-treatment of residents by City of Harare (CoH) which had gained infamy for razing houses for allegedly having been built on undesignated land while others are categorized as illegal structures, the minister said demolitions must be stopped.\n\nGarwe said from now on, any council official who orders demolition will face the wrath of the law.\n\nCourts have also ordered a moratorium on demolitions before giving a four months notice of intention to raze properties.\n\nLately, demolitions would take place as soon as orders to destroy the said illegal structures were given by the courts.\n\nThe minister said Zimbabweans now lack morals and should also consider other peoples efforts and feelings.\n\nHe questioned why local authorities wait until structures are complete, only to destroy them. Without being specific where the moratorium will be applied, Garwe said CoH has been directed to halt the impending demolition of over 5,000 housing units.\n\nStop it as it emerges. Why wait for someone to build and then demolish? Let us be morally correct.\n\nNo 5,000 houses are going to be demolished by the city (Harare) and to make matters worse, who gave them those pieces of land? Is it not the corrupt council officials? Garwe said.\n\nHe added, We are against demolishing. Where were you as a City Father when this piece of land was being sold? We cannot be more stupid than that. Definitely, we cannot, the minister said.\n\nRecently, residents lost homes in Belvedere where CoH demolished several upmarket properties as owners haplessly watched in the presence of the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/07170736/InShot_20241107_185736376-scaled.jpg",
            "description": "<p>By Anna Chibamu LOCAL Government Minister, Daniel Garwe this Monday fumed over demolitions of properties deemed illegal by local councils, which ironically would have inspected and certified construction of same. Garwe was responding to questions from journalists in Harare relating to local government issues affecting residents countrywide. Quizzed on the ill-treatment of residents by City</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-blocked-from-demolishing-5000-houses-minister-says-residents-be-given-four-months-notice-to-recover-building-materials/\">City of Harare blocked from demolishing 5,000 houses: Minister says residents be given four months’ notice to recover building materials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Ugandan president’s son threatens to behead his father’s political rival",
            "url": "https://www.newzimbabwe.com/ugandan-presidents-son-threatens-to-behead-his-fathers-political-rival/",
            "content": "The Business Insider\n\nUGANDAN president Yoweri Musevenis son recently made a distasteful remark about the leader of the countrys ruling opposition, Bobi Wine.General Muhoozi Kainerugaba, son of Ugandas president, made a distasteful remark about the leader of the ruling opposition, Bobi Wine.He stated in a tweet that he wanted to behead the countrys most prominent opposition leader, Bobi Wine.Kainerugaba later apologized for the threat, calling it a joke, but Bobi Wine expressed concerns about the seriousness of the threats.Yoweri Musevenis son, and head of the countrys military, recently relayed via a tweet, that he wanted to behead the countrys most prominent opposition leader.Kainerugaba stated his father, whom he referred to by the title Mzee, was the sole reason opposition leader Bobi Wine was being protected from him.If Mzee was not there, I would cut off his head today, Kainerugaba posted.He had since apologized for the threat, and flagged it off as a joke, noting that sometimes, some comments are meant to be ironic.However, opposition leader, Bobi Wine, who also responded via a tweet, noted that he does not take kindly to such threats.The threat by Musevenis son (who also heads Ugandas military) to behead me is not something I take lightly, given that many have been killed by him and his father, he tweeted.Kainerugabas social media statements should be interpreted as casual remarks and should not be interpreted as representing government policy, the government spokesperson stated.This is hardly the first time the presidents son has made an inflammatory remark, as he had in 2022 threatened to invade Kenya.In light of the recent event, he also followed up his tweet, stating that the opposition should pay him what they owe, before he proceeds to behead him.According to a Reuter report, most people are of the opinion that Muhoozi Kainerugaba is his fathers likely succesor for the presidential seat. His father has been in power since 1986.Bobi Wine, whose real name is Robert Kyagulanyi Ssentamu, is a prominent Ugandan politician, musician, and activist. He has gained significant recognition both in Uganda and internationally for his activism and political ambitions.In 2017, Bobi Wine entered politics by winning a parliamentary seat as the Member of Parliament for Kyadondo East Constituency.His political career quickly gained momentum as he positioned himself as a leader of the opposition against the long-serving Ugandan president Museveni.Bobi Wine ran for president in 2021 as the leader of the National Unity Platform (NUP). His campaign, driven by promises of change and empowerment for young Ugandans, gained widespread support, especially among the youth.While the official results declared Museveni the winner, Bobi Wine and his supporters alleged widespread electoral fraud and irregularities.\n\nUGANDAN president Yoweri Musevenis son recently made a distasteful remark about the leader of the countrys ruling opposition, Bobi Wine.\n\nGeneral Muhoozi Kainerugaba, son of Ugandas president, made a distasteful remark about the leader of the ruling opposition, Bobi Wine.\n\nHe stated in a tweet that he wanted to behead the countrys most prominent opposition leader, Bobi Wine.\n\nKainerugaba later apologized for the threat, calling it a joke, but Bobi Wine expressed concerns about the seriousness of the threats.\n\nYoweri Musevenis son, and head of the countrys military, recently relayed via a tweet, that he wanted to behead the countrys most prominent opposition leader.\n\nKainerugaba stated his father, whom he referred to by the title Mzee, was the sole reason opposition leader Bobi Wine was being protected from him.\n\nIf Mzee was not there, I would cut off his head today, Kainerugaba posted.\n\nHe had since apologized for the threat, and flagged it off as a joke, noting that sometimes, some comments are meant to be ironic.\n\nHowever, opposition leader, Bobi Wine, who also responded via a tweet, noted that he does not take kindly to such threats.\n\nThe threat by Musevenis son (who also heads Ugandas military) to behead me is not something I take lightly, given that many have been killed by him and his father, he tweeted.\n\nKainerugabas social media statements should be interpreted as casual remarks and should not be interpreted as representing government policy, the government spokesperson stated.\n\nThis is hardly the first time the presidents son has made an inflammatory remark, as he had in 2022 threatened to invade Kenya.\n\nIn light of the recent event, he also followed up his tweet, stating that the opposition should pay him what they owe, before he proceeds to behead him.\n\nAccording to a Reuter report, most people are of the opinion that Muhoozi Kainerugaba is his fathers likely succesor for the presidential seat. His father has been in power since 1986.\n\nBobi Wine, whose real name is Robert Kyagulanyi Ssentamu, is a prominent Ugandan politician, musician, and activist. He has gained significant recognition both in Uganda and internationally for his activism and political ambitions.\n\nIn 2017, Bobi Wine entered politics by winning a parliamentary seat as the Member of Parliament for Kyadondo East Constituency.\n\nHis political career quickly gained momentum as he positioned himself as a leader of the opposition against the long-serving Ugandan president Museveni.\n\nBobi Wine ran for president in 2021 as the leader of the National Unity Platform (NUP). His campaign, driven by promises of change and empowerment for young Ugandans, gained widespread support, especially among the youth.\n\nWhile the official results declared Museveni the winner, Bobi Wine and his supporters alleged widespread electoral fraud and irregularities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/26170350/Bobi-Wine.jpg",
            "description": "<p>The Business Insider  UGANDAN president Yoweri Museveni’s son recently made a distasteful remark about the leader of the country’s ruling opposition, Bobi Wine. General Muhoozi Kainerugaba, son of Uganda’s president, made a distasteful remark about the leader of the ruling opposition, Bobi Wine. He stated in a tweet that he wanted to behead the country’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ugandan-presidents-son-threatens-to-behead-his-fathers-political-rival/\">Ugandan president’s son threatens to behead his father’s political rival</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Lake Chivero ecological disaster was due to industrial waste and not raw sewage— Local Government minister",
            "url": "https://www.newzimbabwe.com/lake-chivero-ecological-disaster-was-due-to-industrial-waste-and-not-raw-sewage-local-government-minister/",
            "content": "By Anna Chibamu\n\nGOVERNMENT has disputed claims from certain quarters that hordes of fish and four rhinos that were found dead at Lake Chivero were as a result of human waste or raw sewage discharged into the water reservoir.\n\nAddressing journalists in Harare Monday, Local Government minister Daniel Garwe said human waste is not dangerous and does not cause such a calamity, but the deaths were due to industrial waste being deposited into the lake by some private companies.\n\nSocial media was awash with news that thousands of fish from Lake Chivero were dying due poisoning, but Garwe sought to allay fears and panic among citizens.\n\nThe deaths of the rhinos and the fish were not caused by human waste. I think people lack knowledge there. Human waste is not dangerous.\n\nIt was not caused by human waste, it was caused by industrial waste, and we are working very closely with the Minister of Environment to ensure that the culprits are brought to book as investigations continue, Garwe said.\n\nHe said his ministry had summoned Harare City Mayor Jacob Mafume and the town clerk for a meeting before the end of this week to interrogate and deal with this hazardous industrial waste that was being discharged into Lake Chivero killing wildlife and fish.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18163339/chivero-2.jpeg",
            "description": "<p>By Anna Chibamu GOVERNMENT has disputed claims from certain quarters that hordes of fish and four rhinos that were found dead at Lake Chivero were as a result of human waste or raw sewage discharged into the water reservoir. Addressing journalists in Harare Monday, Local Government minister Daniel Garwe said human waste is not dangerous</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lake-chivero-ecological-disaster-was-due-to-industrial-waste-and-not-raw-sewage-local-government-minister/\">Lake Chivero ecological disaster was due to industrial waste and not raw sewage— Local Government minister </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Government pushes for privatisation of water provision and other services as councils falter",
            "url": "https://www.newzimbabwe.com/government-pushes-for-privatisation-of-water-provision-and-other-services-as-councils-falter/",
            "content": "By Staff Reporter\n\nGOVERNMENT says it is in the process of privatising the provision of public services, including clean potable water, after realising the failure by councils to fulfill their mandates.\n\nAddressing journalists in Harare Monday during a Media Meets Cabinet Ministers interface, Local Government Minister Daniel Garwe said modalities were already underway to regularise the privatisation process.\n\nLast week Friday, we were given the green light to privatise water services. We are now in the process of inviting private sector players, both local and international, to bring proposals, expressions of interest. These are going to be unsolicited bids.\n\nWe want somebody with the capacity to engineer, to procure, to construct and manage the finance. Thats the model that we are working on. Engineering, procurement, construction, management and finance.\n\nThese are unsolicited bids. So, as we speak, weve already received about five expressions of interest from local players and three from international players. So, its work in progress, Garwe said.\n\nHe was hoping that by the end of next week, his ministry would have identified and interviewed all interested players.\n\nBy end of next week, we would have identified the most suitable people that have applied and appointed them, at least signed a Memorandum of Understanding (MoU), and then a Memorandum of Agreement.\n\nWe want by the end of this month to have dealt with the issue of water in Harare, added Garwe.\n\nHe said a lot of purified water was being lost through leakages.\n\nBy the time it reaches a resident, its just a fraction of what has been purified. We are looking at an investor who comes and covers the whole value chain, from purification to distribution to billing and metering.\n\nWe want to move away from the old metre system to digital metre systems, the smart water metering systems. Thats what we are doing, he stated.\n\nGarwe promised that by the end of this month or early February, there will be movement in this regard not in Harare alone but in all urban councils countrywide.\n\nWe are looking at all our cities. We have started, but the invitations are not focused on Harare, they are focused on all the urban cities.\n\nPriority areas are Harare, Bulawayo and Victoria Falls.\n\nBesides the privatisation of water services, government will also privatise all other services such as solid and liquid waste management systems to make sure cases of burst pipes are dealt with once and for all.\n\nChitungwiza and most of Harares suburbs have gone for years with raw sewage flowing in residential areas.\n\nGarwe urged journalists to wait for the Commission of Inquiry to complete its investigations on Harare City regarding some allegations.\n\nLet the Commission do its work and then we can find a way forward, said Garwe.\n\nThe minister also explained that the privatisation of public services in urban councils was not coming at a premium to residents.\n\nTechnology is cheaper. Many people think it is expensive to privatise services, cautioned Garwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Staff Reporter  GOVERNMENT says it is in the process of privatising the provision of public services, including clean potable water, after realising the failure by councils to fulfill their mandates. Addressing journalists in Harare Monday during a ‘Media Meets Cabinet Ministers’ interface, Local Government Minister Daniel Garwe said modalities were already underway to regularise</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-pushes-for-privatisation-of-water-provision-and-other-services-as-councils-falter/\">Government pushes for privatisation of water provision and other services as councils falter </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        },
        {
            "title": "Employee killed at Trabablas Interchange construction site after crane collapse",
            "url": "https://www.newzimbabwe.com/employee-killed-at-trabablas-interchange-construction-site-after-crane-collapse/",
            "content": "By Tapiwa Svondo\n\nA FATAL accident has claimed a life at the Trabablas Interchange construction site after a crane collapsed during de-erection operations.\n\nIn a statement, Tefoma Construction (Pvt) Ltd (Tefoma), expressed its condolences to the family, friends, and colleagues of the unnamed deceased employee.\n\nTefoma Construction (Pvt) Ltd (Tefoma) regrets to report a fatal injury following a mechanical failure during crane de-erection operations at the Trabablas Interchange project site on 6 January 2025.\n\nThe board of directors and management extend their sincere condolences to the deceaseds family, friends, and colleagues, reads the statement.\n\nTefoma Construction, said the incident was caused by a mechanical failure, which led to both the static tower crane and a mobile crane to collapse during the de-erection process.\n\nThe incident occurred during the dismantling of a static tower crane by Manzlink (Pvt) Ltd (Manzlink), our contracted rigging specialist firm.\n\nThe mechanical failure resulted in the collapse of both the static tower crane and the mobile crane being used for the de-erection process, the company said.\n\nPart of the collapsed crane\n\nTefoma, identified the deceased as an employee of Manzlink, and pledged to further investigate into the matter while supporting the bereaved family.\n\nThe deceased was an employee of Manzlink, the specialist subcontracted company at the site. In cooperation with relevant authorities, a full investigation into the incident is currently underway.\n\nTefoma has offered its full support and is working closely with Manzlink, the employer, and the deceaseds family during this difficult time.\n\nThe board of directors and management team remain committed to maintaining the highest safety standards across all our project sites.\n\nThe recently re-named Trabablas Interchange, which was previously known as Mbudzi roundabout, upon completion is expected to have gobbled US$88 million. Initially scheduled to be completed in 2024, the timelines have been further extended to 2025. Trabablas was President Emmerson Mnangagwas wartime nickname.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/07041953/IMG-20250106-WA0082.jpg",
            "description": "<p>By Tapiwa Svondo  A FATAL accident has claimed a life at the Trabablas Interchange construction site after a crane collapsed during de-erection operations. In a statement, Tefoma Construction (Pvt) Ltd (Tefoma), expressed its condolences to the family, friends, and colleagues of the unnamed deceased employee. “Tefoma Construction (Pvt) Ltd (Tefoma) regrets to report a fatal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/employee-killed-at-trabablas-interchange-construction-site-after-crane-collapse/\">Employee killed at Trabablas Interchange construction site after crane collapse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "07 Jan 2025"
        }
    ]
}