{
    "news": [
        {
            "title": "Raila Odinga, who made five runs at Kenya Presidency, dies at 80",
            "url": "https://www.newzimbabwe.com/raila-odinga-who-made-five-runs-at-kenya-presidency-dies-at-80/",
            "content": "Bloomberg\n\nRaila Odinga, who was at the forefront of Kenyan politics for more than three decades and made five unsuccessful runs at the presidency, alleging that he was cheated of victory in every instance, has died. He was 80.\n\nOdinga passed away in India after suffering a heart attack, the Nairobi-based Star newspaper and other Kenyan media outlets reported.\n\nOdinga was the son of Jaramogi Oginga Odinga, who served as Kenyas first vice president in Jomo Kenyattas administration. Considered political royalty in the East African nation, he was wildly popular among his supporters who heeded his calls en masse to demonstrate when he complained about vote rigging.\n\nThe electoral disputes repeatedly triggered ethnic tensions and violence, most notably in 2008, when more than 1,100 people died and about 350,000 were forced to flee their homes. The United Nations and then-South African leader Thabo Mbeki mediated a truce that saw Odinga being appointed prime minister in a coalition government led by President Mwai Kibaki.\n\nOdinga narrowly lost his fifth bid for the presidency to William Ruto in 2022. While the nations highest court upheld the election outcome, Odinga said he had proof the results had been tampered with and called a series of protests against the outcome and rising living costs. Dozens of people died in the ensuing unrest.\n\nThe two men later agreed to work together and members of Odingas party were appointed to the cabinet and other government posts.\n\nRaila Amolo Odinga was born on Jan. 7, 1945, in the western Kenyan town of Maseno. Prior to going into politics, he studied engineering in Germany, lectured at the University of Nairobi and co-founded his own firm.\n\nHe was arrested in 1982 after being accused of participating in an attempted coup led by air force officers to oust President Daniel Arap Moi. He spent six years in prison without trial and was detained twice subsequent to his release. His final incarceration ended in 1991, the year Kenyas constitution was amended to allow multiparty politics.\n\nOdinga helped found the Forum for the Restoration of Democracy and was selected as a lawmaker for the Langata constituency in the capital, Nairobi, in the 1992 election.\n\nHe first stood for the presidency in 1997 as the National Development Partys candidate. Four years later, he merged his party with Mois Kenya African National Union, was elected as its secretary-general and appointed energy minister.\n\nOdinga parted ways with Kanu in 2002, after Moi backed Uhuru Kenyatta to succeed him as party leader, and teamed up with Kibaki, who had mounted a third presidential campaign. Their coalition, the National Rainbow Alliance, won the vote, ending almost four decades of uninterrupted Kanu rule.\n\nKibaki named Odinga as his minister of roads and public works, but the two fell out in 2004 when Odinga accused the president of reneging on a power-sharing deal.\n\nThe Orange Democratic Movement nominated Odinga as its presidential candidate in 2007. It won 99 parliamentary seats, while Kibakis Party of National Unity won just 43. Even so, the official results showed Kibaki won the presidential vote  an outcome that was tainted by allegations of rigging.\n\nThe widespread violence that ensued prevented Odinga from taking power and he had to settle for the post of prime minister, which he held for five years.\n\nOdinga lost the presidential vote to Uhuru Kenyatta in 2013 and again in 2017. The Supreme Court annulled the outcome of the latter contest, citing widespread irregularities. Odinga then boycotted the re-run, saying the conditions werent in place for a fair contest.\n\nThe two men later reconciled and Kenyatta backed Odingas 2022 presidential run, reneging on an undertaking to support Ruto, his then-deputy. Ruto prevailed in the first round, however, and the result stood despite the oppositions legal challenges and protests.\n\nIn February 2025, Odinga stood for election as head of the African Unions executive arm, but lost the contest to Mahamoud Ali Youssouf from Djibouti.\n\nOdinga married his wife Ida in 1973. They had four children.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/16220105/Raila-Odinga.jpeg",
            "description": "<p>Bloomberg Raila Odinga, who was at the forefront of Kenyan politics for more than three decades and made five unsuccessful runs at the presidency, alleging that he was cheated of victory in every instance, has died. He was 80. Odinga passed away in India after suffering a heart attack, the Nairobi-based Star newspaper and other</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raila-odinga-who-made-five-runs-at-kenya-presidency-dies-at-80/\">Raila Odinga, who made five runs at Kenya Presidency, dies at 80</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "15 Oct 2025"
        },
        {
            "title": "Overcrowding, dilapidation, inhumane conditions plague Zimbabwe’s prisons – Parliamentary Report",
            "url": "https://www.newzimbabwe.com/overcrowding-dilapidation-inhumane-conditions-plague-zimbabwes-prisons-parliamentary-report/",
            "content": "By Anna Chibamu\n\nA joint parliamentary report has laid bare conditions in Zimbabwes prisons, exposing chronic overcrowding, dilapidated facilities, inadequate basics, and inhuman treatment of inmates as the most critical challenges facing the Zimbabwe Prisons and Correctional Service (ZPCS).\n\nThe Justice, Legal and Parliamentary Affairs Committee and the Thematic Committee on Human Rights found that most correctional facilities are operating at between 200% and 300% above capacity, with some holding more than triple their intended numbers.\n\nGwanda Prison was holding 210 inmates against a capacity of only 60, representing a staggering 350% overcrowding whilst Chikurubi Maximum Security Prison had 2,689 inmates crammed into facilities designed for 1,114 and Binga Prison had 78 inmates with the holding capacity of 45.\n\nSimilarly, Harare Remand Prison was overcrowded by over 50%, with 1,361 inmates held in a facility meant for 900. Bindura Prison reported 443 inmates versus its capacity of 393, and Marondera stood at 730 inmates for a space meant to accommodate only 358, read part of the report.\n\nThe report revealed that most prison infrastructure remains in a dire state, with many facilities constructed during the colonial era as far back as 1910 and never adequately maintained or expanded to accommodate the growing inmate population. This has led to cramped, unsanitary, and poorly ventilated conditions.\n\nOvercrowding has led to serious human rights and health implications, including inmates sleeping in cramped, poorly ventilated, and leaking cells, strained sanitation systems, insufficient bedding and increased risk of disease transmission, and limited access to healthcare.\n\nWhile commending government for improvements in food and nutrition,noting that inmates are now served three meals a day,the committee highlighted severe shortages of clothing and bedding, which compromise dignity and health, particularly during the winterseason.\n\nAt some prisons, the Committee found inmates wearing torn or worn-out clothes, with some relying on donations from relatives. Additionally, blankets were in critically short supply. Inmates were permitted to bring their own blankets due to a mismatch between inmate numbers and available bedding.\n\nThe report also described the state of prison healthcare as severely under-resourced, undermining the constitutional right of inmates to basic medical care.\n\nAll prisons, including Harare Remand, Hurungwe, Khami, Marondera, Chikurubi, Chipinge, and Gwanda, reported frequent shortages of medication, especially for chronic conditions such as hypertension, diabetes, and mental health disorders. In several instances, inmates were entirely dependent on relatives for the supply of essential medicines, with facilities like Khami and Chikurubi reporting dangerously low supplies.\n\nPsychiatric inmates were said to be particularly affected by the unavailability of medication, worsening their vulnerability.\n\nDespite the challenges, the committee noted that rehabilitation and reintegration efforts are gaining momentum within the ZPCS, with many prisons introducing vocational and academic training programmes,signalling a shift from a punitive to a correctional model.\n\nHowever, lack of digital infrastructure continues to hamper access to justice, with many inmates unable to follow up on appeals or trials due to lack of printing facilities and systemic failure of individuals held on remand for extended periods without trial.\n\nDuring a visit to Harare Remand Prison, the committee also witnessed instances of inhuman treatment of inmates.\n\nInmates were seen sitting on a wet floor, which had recently been cleaned, while Class D inmates, committee members were informed that some inmates had recently been beaten following the escape of two inmates from the prison.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14185956/chikurubhi.jpg",
            "description": "<p>By Anna Chibamu A joint parliamentary report has laid bare conditions in Zimbabwe’s prisons, exposing chronic overcrowding, dilapidated facilities, inadequate basics, and inhuman treatment of inmates as the most critical challenges facing the Zimbabwe Prisons and Correctional Service (ZPCS). The Justice, Legal and Parliamentary Affairs Committee and the Thematic Committee on Human Rights found that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/overcrowding-dilapidation-inhumane-conditions-plague-zimbabwes-prisons-parliamentary-report/\">Overcrowding, dilapidation, inhumane conditions plague Zimbabwe’s prisons – Parliamentary Report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "15 Oct 2025"
        },
        {
            "title": "Opposition calls for forensic audit after leak of US$3.2billion corruption dossier",
            "url": "https://www.newzimbabwe.com/opposition-calls-for-forensic-audit-after-leak-of-us3-2billion-corruption-dossier/",
            "content": "By Costa Nkomo\n\nCitizens Coalition for Change interim leader Jameson Timba has called for a forensic audit following the leak of a corruption dossier alleging that over US$3.2 billion has been looted by controversial business tycoons in Zimbabwe.\n\nThe dossier is believed to be the same document that Vice President Rtd Constantino Chiwenga presented at a recent Zanu-PF Politburo meeting in Harare.\n\nIt implicates controversial tenderpreneur Wicknell Chivayo, Kudakwashe Tagwirei, Delish Nguwaya, Scotland FC owner Pedzai Sakupwanya, and Paul Tungwarara. The document purportedly establishes how these cartels siphon cash from state coffers through fraud and corruption.\n\nIn a statement released Tuesday, Timba called for thorough forensic investigations into government contracts.\n\nAccordingly, I call for: An independent forensic audit of all public contracts linked to the named individuals. Full public accountability for the looting and abuse of state resources, Timba stated.\n\nTimbas call for forensic investigations follows Bikita South MP and then Chairperson of the Budget and Finance Parliamentary Portfolio Committee, Energy Mutodisallegations that Finance Ministry Permanent Secretary George Guvamatanga is demanding bribes worth millions of United States dollars from various government contractors, threatening to withhold payments if his demands are not met.\n\nMutodi further demanded that Parliament summon George Guvamatanga to clear his name, but later retracted his statements.\n\nTimba called for the immediate abandonment of the Agenda 2030, where President Emmerson Mnangagwas loyalists are pushing for him to remain in power until 2030.\n\nMnangagwa has repeatedly declined this offer and insisted he will leave office at the end of his term in 2028.\n\nTimba warned that this notion must be quashed without delay.\n\nAt the same time, the so-called 2030 Agenda to extend the Presidents term must be abandoned in its entirety. Any attempt to alter presidential term limits without a referendum is unconstitutional and illegitimate, he said.\n\nTimba argued that a government mired in corruption forfeits any right to request an extension of its term.\n\nA government under such clouds of corruption cannot seek more years in power. It must instead submit itself to the Constitution and the people.\n\nHe continued, This fight is not merely about term limits; it is about defending our Republic from state capture disguised as stability  and about reaffirming that in Zimbabwe, no one is above the law. Let those who hold power remember: the Constitution was written to protect the people, not to shield the powerful.\n\nAccording to government figures, Zimbabwe is losing US$2 billion annually due to corruption and illicit financial dealings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/03042205/Jameson-Timba.jpg",
            "description": "<p>By Costa Nkomo Citizens Coalition for Change interim leader Jameson Timba has called for a forensic audit following the leak of a corruption dossier alleging that over US$3.2 billion has been looted by controversial business tycoons in Zimbabwe. The dossier is believed to be the same document that Vice President Rtd Constantino Chiwenga presented at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-calls-for-forensic-audit-after-leak-of-us3-2billion-corruption-dossier/\">Opposition calls for forensic audit after leak of US$3.2billion corruption dossier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "15 Oct 2025"
        }
    ]
}