{
    "news": [
        {
            "title": "Mnangagwa in damning admission of government’s failures, pledges to stop the rot",
            "url": "https://www.newzimbabwe.com/mnangagwa-in-damning-admission-of-governments-failures-pledges-to-stop-the-rot/",
            "content": "By Darlington Gatsi\n\nAFTER coming face to face with the crumbling healthcare system under his government, President Emmerson Mnangagwa has said he will put an end to poor service provision.\n\nMnangagwa made these remarks during his opening address at the Central Committee meeting held at the ZANU-PF headquarters on Thursday.\n\nHe acknowledged his governments shortcomings, particularly in the health sector, which is in dire straits.\n\nMeanwhile, there is a qualitative improvement in our education sector, with our young people being sought after worldwide. A clear roadmap for the modernisation of the health sector is now being implemented.\n\nSocial services in all parts of the country must never again be allowed to deteriorate to the levels that I recently witnessed when I toured health facilities here in Harare, said Mnangagwa.\n\nHis comments follow his surprise visits to Harares public referral hospitals last month, where he witnessed the deteriorating state of the healthcare system.\n\nThe government has faced criticism over the neglect and decline of public institutions, to the detriment of ordinary citizens.\n\nMnangagwa challenged the ruling party to spearhead development and improve the livelihoods of Zimbabweans.\n\nAs a revolutionary movement, we have, without doubt, achieved transformational milestones over the last 45 years. The aspirations which saw many sons and daughters of this great land wage a protracted liberation struggle are being achieved, sector by sector. Well done, Zimbabwe. Well done, ZANU-PF. We have every reason to be proud.\n\nHowever, looking into the future, a great responsibility lies with us, as the Peoples Party. Our duty is to create an environment that future generations will be proud of. We must enable our communities, the youth, women, SMEs, and others to be ready for the future, said Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/03202806/mnangagwa-cc.jpeg",
            "description": "<p>By Darlington Gatsi AFTER coming face to face with the crumbling healthcare system under his government, President Emmerson Mnangagwa has said he will put an end to poor service provision. Mnangagwa made these remarks during his opening address at the Central Committee meeting held at the ZANU-PF headquarters on Thursday. He acknowledged his government’s shortcomings,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-in-damning-admission-of-governments-failures-pledges-to-stop-the-rot/\">Mnangagwa in damning admission of government’s failures, pledges to stop the rot   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        },
        {
            "title": "Zimbabwe faces renewed scrutiny over Gukurahundi reconciliation drive",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-renewed-scrutiny-over-gukurahundi-reconciliation-drive/",
            "content": "Channel Africa\n\nZimbabwes attempt to reckon with one of its darkest chapters, the Gukurahundi massacres of the 1980s, is drawing fierce criticism, with questions raised about the legitimacy of the process under President Emmerson Mnangagwas leadership.\n\nThe government says it is moving forward with a judicial and reconciliation programme aimed at addressing long-standing grievances stemming from the mass killings in Matabeleland and the Midlands, which left an estimated 20 000 people dead. But for many survivors and human rights advocates, the effort feels hollow, not least because of who is leading it.\n\nAt the time of the atrocities, Mnangagwa was the Minister of State for National Security, serving under then-President Robert Mugabe. His involvement in the security structures responsible for the crackdown has cast a long shadow over the current initiative.\n\nGeopolitical analyst Aaron Ngambi believes the process is more about optics than accountability.Mnangagwa seems determined to close this chapter, but many view it as an attempt to whitewash the past, Ngambi said in an interview. Its difficult to talk about reconciliation when those accused of complicity are in charge of the process.\n\nThe Gukurahundi killings, carried out by the North Korean-trained Fifth Brigade, targeted members of the Ndebele ethnic group in the aftermath of Zimbabwes independence. The violence has never been properly investigated, and the state has long resisted calls for justice and recognition.\n\nNow, with the renewed focus on the issue, some observers say the timing may be politically motivated, part of a broader effort by Mnangagwa to shape his legacy and consolidate power in the run-up to future elections.\n\nAny reconciliation process that fails to include survivors, civil society and independent investigators will never be seen as credible, Ngambi warned. This moment demands openness, not control.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/19142837/Gukurahundi-Brigade.webp",
            "description": "<p>Channel Africa Zimbabwe’s attempt to reckon with one of its darkest chapters, the Gukurahundi massacres of the 1980s, is drawing fierce criticism, with questions raised about the legitimacy of the process under President Emmerson Mnangagwa’s leadership. The government says it is moving forward with a judicial and reconciliation programme aimed at addressing long-standing grievances stemming</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-renewed-scrutiny-over-gukurahundi-reconciliation-drive/\">Zimbabwe faces renewed scrutiny over Gukurahundi reconciliation drive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        },
        {
            "title": "Mnangagwa appoints new Labour Court judges",
            "url": "https://www.newzimbabwe.com/mnangagwa-appoints-new-labour-court-judges/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed new judges of the Labour Court.\n\nThe judges were successful in the public interviews conducted by the Judicial Service Commission (JSC) last month.\n\nThose who made it to the post include Bianca Makwande, Clever Tsikwa, former magistrate at the Harare courts, Garudzo Ziyaduma, who served as prosecutor, Robin Mzyece, Evidence Gonesi and Motion Jaravani.\n\nIt is hereby notified that His Excellency, the President has, in terms of section 180 (1) of the Constitution of Zimbabwe appointed the persons specified in the Schedule as Judges of the Labour Court, with effect from the date of appointment, said Mnangagwa in the latest government gazette.\n\nThe JSC interviewed 28 candidates.\n\nInitially, the commission received 53 nominations, but following a review, six submissions were invalidated, and two were withdrawn.\n\nOn April 14, 2025, 45 candidates participated in the first-level examination, with 28 qualifying for the final interviews.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13050811/labour-court.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed new judges of the Labour Court. The judges were successful in the public interviews conducted by the Judicial Service Commission (JSC) last month. Those who made it to the post include Bianca Makwande, Clever Tsikwa, former magistrate at the Harare courts, Garudzo Ziyaduma, who served as prosecutor,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-appoints-new-labour-court-judges/\">Mnangagwa appoints new Labour Court judges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        },
        {
            "title": "South Africa’s former deputy president Mabuza dies",
            "url": "https://www.newzimbabwe.com/south-africas-former-deputy-president-mabuza-dies/",
            "content": "South Africas former deputy president, David Mabuza, whohelped bring current President Cyril Ramaphosa to power, has died, the presidency said on Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/03202505/mabuza.jpg",
            "description": "<p>Reuters South Africa’s former deputy president, David Mabuza, who helped bring current President Cyril Ramaphosa to power, has died, the presidency said on Thursday. Mabuza, 64, served as deputy president from 2018 to 2023 and played a key role in ensuring Ramaphosa won the tight 2017 party contest to lead the African National Congress. Details</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-former-deputy-president-mabuza-dies/\">South Africa’s former deputy president Mabuza dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        },
        {
            "title": "Zimbabwe has nationwide blackout as system failure cripples grid",
            "url": "https://www.newzimbabwe.com/zimbabwe-has-nationwide-blackout-as-system-failure-cripples-grid/",
            "content": "Bloomberg\n\nZimbabwe suffered a countrywide electricity outage on Thursday due to a system failure that resulted in loss of generation at its two power stations.\n\nElectricity imports from South Africa, Zambia and Mozambique were also interrupted, the national power utility, Zesa, said in an emailed statement.\n\nRestoration efforts are underway, and power has already been successfully restored to some areas, the utility said. Teams are working to restore power to remaining areas in the shortest possible time, it said.\n\nThe southern African country generates electricity at Hwange Thermal Power Station, which has installed capacity of 1 500 megawatts, and the Kariba Hydro Power plant, with capacity of 1050 megawatts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/21021127/Power-Cuts-1.png",
            "description": "<p>Bloomberg Zimbabwe suffered a countrywide electricity outage on Thursday due to a system failure that resulted in loss of generation at its two power stations. Electricity imports from South Africa, Zambia and Mozambique were also interrupted, the national power utility, Zesa, said in an emailed statement. “Restoration efforts are underway, and power has already been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-has-nationwide-blackout-as-system-failure-cripples-grid/\">Zimbabwe has nationwide blackout as system failure cripples grid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        },
        {
            "title": "I am back with a new ship – Chamisa announces new political movement",
            "url": "https://www.newzimbabwe.com/i-am-back-with-a-new-ship-chamisa-announces-new-political-movement/",
            "content": "By Staff Reporter\n\nFormer Citizens Coalition for Change (CCC) leader Nelson Chamisa on Thursday announced plans to launch a new political movement in a fresh bid to dislodge Zanu PF from power.\n\nChamisa resigned from the CCC in January 2024 citing that his party had been hijacked by Zanu PF leader and President Emmerson Mnangagwa.\n\nThis followed a period of turmoil after self-appointed CCC Secretary-General Sengezo Tshabangu went on a rampage, recalling councillors and members of Parliament, particularly those backing Chamisa and critical of Zanu PF.\n\nTshabangu further barred recalled CCC members from participating in by-elections under the CCC banner, leaving many MPs and councillors out in the cold.\n\nHaving kept a low profile for some time, Chamisa has now begun signalling a return to full-time politics, dispelling the notion that he was done with the political arena.\n\nI want you to know; I am not idle. I am consulting. I am building. I am assembling a new strategy and a citizens team that will carry and pivot this nation unto greatness and stardom, Chamisa wrote on his X account, Thursday.\n\nHe described his departure from the CCC as disembarking from a ship that was leaking and could have jeopardised the democratic project he is striving to realise in Zimbabwe.\n\nI left CCC but not the mission. All because CCC was never the destination. It was just the vehicle meant to take us to the New Zimbabwe. When that vehicle was compromised, it became necessary to step out and prepare a better, cleaner, fit-for-purpose vehicle, he explained.\n\nChamisa further acknowledged the mistakes he made during his time at the helm of the CCC.\n\nOur approach in 2023 was not the same as 2018, because in the fight against oppression, no strategy is cast in stone. This is a battle to save lives and to save a nation. We sometimes miss. We sometimes omit. We commit. We adjust. We correct. We keep moving forward until we win. And win we must.\n\nNone of this would have been possible without you.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/14175939/N4-e1665894694127.png",
            "description": "<p>By Staff Reporter Former Citizens Coalition for Change (CCC) leader Nelson Chamisa on Thursday announced plans to launch a new political movement in a fresh bid to dislodge Zanu PF from power. Chamisa resigned from the CCC in January 2024 citing that his party had been hijacked by Zanu PF leader and President Emmerson Mnangagwa.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-am-back-with-a-new-ship-chamisa-announces-new-political-movement/\">I am back with a new ship – Chamisa announces new political movement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        },
        {
            "title": "Zimbabwe Independent editor Zaba’s bail ruling postponed due to power outage",
            "url": "https://www.newzimbabwe.com/zimbabwe-independent-editor-zabas-bail-ruling-postponed-due-to-power-outage/",
            "content": "By Mary Taruvinga\n\nZimbabwe Independent editor, Faith Zaba, will spend her third night in detention after the presiding magistrate failed to hand down his ruling due to a power outage at the Harare Magistrates Court.\n\nHarare Magistrate Vakayi Chikwekwe said he could not type his ruling before postponing the matter to Friday morning.\n\nZaba is accused of undermining the authority of the President following the publication of a satirical article in the Muckracker column of their weekly newspaper.\n\nThe State represented by Takudzwa Jambawu had told court that they considered her medical condition and were not opposed to the granting of bail.\n\nHaving gone through the documents tendered by the defence and verifying them, these were documents of medical history of the accused and there are no compelling reasons warranting the state to challenge bail, said Jambawu.\n\nWhile making bail submissions, Chris Mhike, representing Zaba said in light of the States concession that there are no compelling reasons warranting the continued detention of the accused, he moves for an order for the release of his client on bail.\n\nWhere an accused has been arrested and detained that person must be released unconditionally or on reasonable conditions unless there are compelling reasons.\n\nWe have no objections to the imposition of the proposed conditions and our client does undertake to refrain from interfering with any of the ongoing investigations.\n\nShe is not a member of the Zimbabwe Republic Police, she is not a daughter of a police officer, nor the mother of a police officer. She therefore has no capacity to interfere with members of the ZRP investigating this case.\n\nThe accused is a fit candidate for bail. She is a mother of two and the solebreadwinner of her family.\n\nIn addition to her children, she also takes care of a niece who is totally dependent on her and also her mother, aged 70.\n\nMhike said Zaba is of fixed abode, adding that she is employed as an editor.\n\nShe needs to go back to work soon after she recuperates from her current ill health.\n\nThe accused before you is an award-winning journalist well respected in Zimbabwe Media, commercial, human rights and philanthropic circles, he said.\n\nCourt was also told of her other colourful accolades in media circles, including being the Secretary General of the Zimbabwe National Editors Forum (ZINEF), a mentor, and a member of the Women in News organisation, as such a responsible person to be trusted with freedom.\n\nThis shows she is a distinguished member of the society, Mhike said.\n\nThe lawyer also said Zaba did not give the police trouble when she was arrested.\n\nShe made every effort to honour the request by the police for her to attend at the police station.\n\nShe voluntarily walked into Harare Central Police Station in the company of her lawyer.\n\nIt is regrettable that the police did not allow her to go home after the recording of her warned and cautioned statement, he said.\n\nCitizens who honour and respect authorities ought to be spared from harsh prison realities. As indicated, the accused is not feeling well and the veracity of that submission is documented.\n\nHowever, Mhike raised a complaint against the police, saying, Our complaint is that the accused was detained overnight even in the face of comprehensive medical documentation confirming that she was on bed rest on the order of a medical doctor.\n\nJambawu said police officers and some of Alpha Media Holdings (AMH) employees are lined up to testify against Zaba.\n\nZaba is represented by Mhike andNontokozo Dube Tachiona.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Mary Taruvinga Zimbabwe Independent editor, Faith Zaba, will spend her third night in detention after the presiding magistrate failed to hand down his ruling due to a power outage at the Harare Magistrates Court. Harare Magistrate Vakayi Chikwekwe said he could not type his ruling before postponing the matter to Friday morning. Zaba is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-independent-editor-zabas-bail-ruling-postponed-due-to-power-outage/\">Zimbabwe Independent editor Zaba’s bail ruling postponed due to power outage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "04 Jul 2025"
        }
    ]
}