{
    "news": [
        {
            "title": "‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid",
            "url": "https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/",
            "content": "IOL\n\nFormer Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movements bold plans to extend President Emmerson Mnangagwas term of office to 2030, warning that the move will end badly for both the president and Zimbabwe.\n\nSpeaking to IOL, Kasukuwere said:He (Mnangagwa) is dreaming and he has set himself up for a gigantic failure. Greediness knows no boundaries, and this will lead to a huge disaster for the country.\n\nEarlier this week,IOL reported that Zanu PF has emboldened its move to push through a proposal allowing Mnangagwa to remain in powerbeyond his current constitutional term, which ends in 2028. The party recently adopted a resolution at its annual conference backing the extension to align with the governments so-called Vision 2030 development agenda.\n\nKasukuwere, once a senior figure in the Zanu PF government led by Robert Mugabe before going into exile during the 2017 military intervention, became one of the most prominent former insiders to condemn the partys Mnangagwa plan publicly.\n\nZanu-PF party has announced plans to begin the process of extendingMnangagwas term of officeby two years  a move that, if successful, would keep him in power until 2030.\n\nThe proposal was formally endorsed at the partys annual national peoples conference in the eastern city of Mutare over the weekend. Delegates instructed government structures to start work on legislation to amend the constitution.\n\nAccording to State-ownedThe Herald, delegates argued that the extension would allow Mnangagwa to complete ongoing national development programmes aligned with the governments Vision 2030 agenda.\n\nThe conference adopted the resolution unanimously, describing it as a step toward ensuring policy continuity and consolidating the gains made under Mnangagwas leadership.\n\nZanu-PFs acting political commissar, Munyaradzi Machacha, toldThe Heraldthat the resolution formed part of the official conference outcomes and would be referred to the partys central committee for consideration.\n\nOur president has demonstrated exceptional leadership in driving national development. The conference agreed he should be supported to continue implementing Vision 2030, Machacha said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/15191341/Kasukuwere.jpg",
            "description": "<p>IOL Former Zanu PF bigwig and cabinet minister Saviour Kasukuwere has rubbished the former liberation movement’s bold plans to extend President Emmerson Mnangagwa’s term of office to 2030, warning that the move will end badly for both the president and Zimbabwe. Speaking to IOL, Kasukuwere said: “He (Mnangagwa) is dreaming and he has set himself up</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/he-is-dreaming-former-zimbabwean-minister-kasukuwere-on-president-mnangagwas-2030-bid/\">‘He is dreaming’: Former Zimbabwean minister Kasukuwere on President Mnangagwa’s 2030 bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        },
        {
            "title": "ZIFA sacks Warriors coach Michael Nees",
            "url": "https://www.newzimbabwe.com/zifa-sacks-warriors-coach-michael-nees/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has dismissed Warriors coach Michael Nees following a string of poor results.\n\nThe association confirmed this in a statement released Wednesday.\n\nThe Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and members of the public that the Executive Committee has resolved to terminate the contract of Mr. Michael Nees with immediate effect.\n\nThe Association takes this opportunity to sincerely thank Mr. Nees for his efforts and contributions to Zimbabwean football during his tenure. His dedication to the game and his service to the national structures are appreciated,readspart of ZIFAs statement.\n\nNees dismissal follows a disappointing run that saw the Warriors fail to register a single win in this years World Cup qualifiers.\n\nDuring his 16 matches in charge, the German coach managed only two victories,both against Namibia in last years Africa Cup of Nations qualifiers.\n\nAlthough Nees contract was originally set to expire in December, ZIFA opted for an early termination.\n\nMeanwhile, the association assured fans that interim technical appointments will be made soon.\n\nZIFA remains firmly committed to strengthening its technical development programs and ensuring continued progress in all areas of the game in line with its reform and restructuring agenda.\n\nFurther information regarding the transition process and interim technical arrangements will be communicated in due course,added ZIFA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has dismissed Warriors coach Michael Nees following a string of poor results. The association confirmed this in a statement released Wednesday. “The Zimbabwe Football Association (ZIFA) wishes to inform all stakeholders and members of the public that the Executive Committee has resolved to terminate the contract of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-sacks-warriors-coach-michael-nees/\">ZIFA sacks Warriors coach Michael Nees</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        },
        {
            "title": "Businessmen Mpofu, Chimombe found guilty of US$7 million fraud",
            "url": "https://www.newzimbabwe.com/businessmen-mpofu-chimombe-found-guilty-of-us7-million-fraud/",
            "content": "By Mary Taruvinga\n\nBusinessmen Moses Mpofu and Mike Chimombe have been found guilty of defrauding the government of US$7 million in a botched Presidential Goats Scheme tender.\n\nThe two, who have been in remand prison for over a year since their arrest in June last year. They return to court on October 31 for sentencing hearing.\n\nIn his ruling, High Court Judge Pisirayi Kwenda said the first accused, Mpofu, shot himself in the foot. He said all he did was in his capacity as a director and that he was directed to do so. So there was no further proof needed by the State.\n\nThe second accused argued that his case was strange because the State closed its case without mentioning how he was involved in the misrepresentation. His closing submission was that the State failed to bring him any closer to the case, insisting that he was implicated merely by association.\n\nKwenda said there was no basis for invoking the doctrine of association, as no law was cited.\n\nWe accepted the submission by the State that Blackdeck was not registered. Was the use of that name meant to deceive? Could it be said the intention was to bring perjury? We believe the name was used to attract some colour, not to deceive the ministry, although different names were used interchangeably, said the judge.\n\nKwenda noted that Mpofus failure to call witnesses affected his credibility and his defence.\n\nHe knew these witnesses were important as he was being charged in his personal capacity. His decision not to call these witnesses was his own, except that one witness had died,which was not verified by production of evidence, the judge said.\n\nWhere a litigant threatens to call witnesses to confirm his defence and later abdicates, the usual inference is there was no intention to call that witness, or that the witness, if called, would not confirm that defence.\n\nKwenda dismissed Mpofus explanation that he changed his mind after realising he was being charged personally, describing it as lame because he knew that from the beginning.\n\nHe explained that a company is a legal fiction: A company is just a person in terms of the law. Its really not a natural person created by God. It being a fiction, you cant touch it. It does not have a brain of its own, so its very difficult to separate the acts of a company from the acts of the person who represents it.\n\nKwenda said a corporate body might be liable, but the State may choose not to use the body. The fact that one is a director gives rise to that liability.\n\nHe added, Mpofu must have been aware of his obligation. He submitted a bid which contained falsified information, so which confirms that he was liable. He should have called witnesses to confirm that he was not involved in the submission, but he did not do so.\n\nKwenda said that where presumption gives rise to criminal liability, the onus is on a litigant to prove that he did not play a part.\n\nRegarding the second accused, Chimombe, the judge said: The second accused person strenuously denied he had much involvement in this scheme. We were faced with a situation where we had a threatened case against his denial. We must resolve that factual dispute, and that can be rectified by reference to the testimony of witnesses.\n\nThe witnesses, John Bhasera and Nhundurwa, said they would attend meetings together. We therefore found that he participated. We did not find his explanation convincing. If he said he attended meetings with Nhundurwa, that would have nothing to do with lobbying for an award for Blackdeck because it had already been awarded.\n\nKwenda rejected the claim that the second accused attended meetings merely to resolve disputes as a member of EEG. There was clearly another reason for this. Why would he be there to attend a business meeting?\n\nIt shows he had a mandate, said the judge.\n\nKwenda concluded: We found that the version of the first accused person,that Chimombe was co-opted to represent the company,is binding. To that extent, we found that the second accused was controlling the affairs of the entity. His liability flows from his participation.\n\nIn January this year, Kwenda, while turning down a bail application by the two business partners, said they risk being jailed for 20 years if convicted.\n\nRegarding the seriousness of the offence, I have looked at the penalty and the presumptive penalty for fraud is 20 years, Kwenda said then, adding that if a fraud involves public funds, the sentence will be severe.\n\nMpofu and Chimombedefrauded the Ministry of Lands of US$7 million after securing a tender using a non-existent firm, Blackdeck Pvt Ltd.\n\nThe two forged a ZIMRA Tax clearance certificate and a NSSA compliance certificate in the name of Blackdeck Private Limited and attached them to a bidding document which they submitted to the Ministry of Lands, Agriculture, Water, Fisheries and Rural Development for a tender for the supply and delivery of goats for the Presidential Goat Pass-on Scheme.\n\nThey misrepresented that the company was in full compliance with ZIMRA and NSSA requirements.\n\nActing on the misrepresentation, the Ministry of Lands contracted Blackdeck Private Limited and they were paid US$7 million.\n\nInvestigations later indicated that the QR code and the reference on the NSSA compliance certificate were issued to a different company. It was further established that Blackdeck Private Limited was deregistered from the NSSA system in January 2016. Further investigations established that Blackdeck Private Limited was not issued with a ZIMRA tax clearance certificate for the year 2021.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga Businessmen Moses Mpofu and Mike Chimombe have been found guilty of defrauding the government of US$7 million in a botched Presidential Goats Scheme tender. The two, who have been in remand prison for over a year since their arrest in June last year. They return to court on October 31 for sentencing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessmen-mpofu-chimombe-found-guilty-of-us7-million-fraud/\">Businessmen Mpofu, Chimombe found guilty of US$7 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        },
        {
            "title": "Rare test win for Zimbabwe in easy defeat of Afghanistan",
            "url": "https://www.newzimbabwe.com/rare-test-win-for-zimbabwe-in-easy-defeat-of-afghanistan/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/22162747/ngarava-richard.jpg",
            "description": "<p>Reuters Zimbabwe quick Richard Ngarava took five wickets to skittle Afghanistan out for 159 in their second innings and win their one-off test by an innings and 73 runs midway through the third day on Wednesday. Zimbabwe, who had only won one of their previous 17 tests, had dismissed the Afghanis for 127 in their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rare-test-win-for-zimbabwe-in-easy-defeat-of-afghanistan/\">Rare test win for Zimbabwe in easy defeat of Afghanistan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        },
        {
            "title": "Free to Worship brings spirit-filled legacy concerts to Australia, headlined by Mathias Mhere",
            "url": "https://www.newzimbabwe.com/free-to-worship-brings-spirit-filled-legacy-concerts-to-australia-headlined-by-mathias-mhere/",
            "content": "By Chipo Sabeta\n\nCelebrated gospel artist Mathias Mhere is set to headline the Free to Worship Legacy Concerts in Australia, a series of worship events bringing together believers from around the world for nights of praise, unity, and celebration.\n\nSupported byDiaspora Insurance, the highly anticipated concerts will be held across three major cities next month: Melbourne on November 7, Sydney on November 8, and Perth on November 9, marking one of the most significant international tours for the Free to Worship movement.\n\nFree to Worship began as a small group of passionate singers united by a common mission: to worship God freely. Over the years, the choir, part of ZAOGA Forward in Faith Ministries International (FIFMI),has grown into a globally recognised ensemble of gifted vocalists and musicians who embody the energy, unity, and faith of FIFs vision.\n\nThrough dedication, teamwork, and steadfast partnerships,including long-standing support from Diaspora Insurance,Free to Worship has transformed from humble beginnings into a global phenomenon. The groups mission is to demonstrate that when people are truly free to worship, lives are changed, hearts are healed, and nations are uplifted.\n\nDiaspora Insurance CEO Jeff Madzingo (left), ZAOGA Forward in Faith Australia Bishop Masaka (centre), and Free to Worship Chairman Tawanda Sarireni (right) were recently pictured at the FIFMI Australia Believers Convention, celebrating the enduring partnership between Diaspora Insurance and Free to Worship.\n\nFor over a decade,Diaspora Insurancehas been a faithful partner of the movement, supporting its efforts to spread hope and faith through music.\n\nKnown for their powerful and spirit-filled concerts, Free to Worship events have become landmark gatherings on the FIF calendar, drawing thousands of worshippers across cities and nations. Each concert brings an atmosphere of revival, joy, and community through original music, dynamic praise, and heartfelt worship that transcends cultures and languages.\n\nWe have been praising God from our humble beginnings until now, when we are having sold-out shows, said Chairman Tawanda Sarireni. With Free to Worship concerts selling out and packing arenas over three consecutive years, there has been a longing to see the group live by many overseas fans.\n\nFree to Worship\n\nBeyond the stage, Free to Worship also serves as a training ground for young believers, helping them discover and nurture their God-given musical talents. Many alumni have gone on to inspire others in both local and international ministries, carrying the same anointing and excellence that define the group.\n\nSarireni said the choir continues to unite worship leaders, gospel singers, and instrumentalists from various churches and nations, strengthening the message of unity in faith.\n\nFounded by the late Archbishop Ezekiel Guti, Free to Worship continues to shine as a vessel of praise, reminding believers everywhere that music, faith, and devotion can transform communities and touch nations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/22052508/free-to-worship-3.jpeg",
            "description": "<p>By Chipo Sabeta Celebrated gospel artist Mathias Mhere is set to headline the Free to Worship Legacy Concerts in Australia, a series of worship events bringing together believers from around the world for nights of praise, unity, and celebration. Supported by Diaspora Insurance, the highly anticipated concerts will be held across three major cities next</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/free-to-worship-brings-spirit-filled-legacy-concerts-to-australia-headlined-by-mathias-mhere/\">Free to Worship brings spirit-filled legacy concerts to Australia, headlined by Mathias Mhere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Sustainable Infrastructure Development",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-sustainable-infrastructure-development/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. You spoke on sustainable infrastructure development at the CEOAfrica AnnualRoundtable in Victoria Falls. What is your position on sustainable infrastructure development in the African context, considering that Africa is a low global contributor to world pollution?\n\nVM: Thank you\n\nAs a point of correction, I spoke on legal considerations for unlocking finances for sustainable infrastructure development. My focus was really on the different mechanisms available to unlock finance for funding infrastructure projects in Zimbabwe, the continent and around the world.\n\nTo your question, sustainable development is a global reality despite various individual contrary views on whether it is necessary or fair. There is a plethora of legislation and policy entrenched in financing institutions that fund global development projects. They (the financial institutions) have, as a prerequisite, the condition that the projects be conscious of ESGs, being environmental, social impact and governance considerations.\n\nA debate on its necessity, especially as 54 separate African countries, is in my view, an uphill task and the logical thing will be for each to benefit from the funds available and develop the individual countries for the collective benefit\n\nReporter:Lets then start with the continental position. What legal and financial instruments are available for infrastructure development that is sustainable?\n\nVM: We have a number of funds that promote infrastructure development that are premised on sustainability by taking into consideration the environment and social impacts. An example will be Sustainable Energy Fund for Africa (SEFA), Green Climate Fund and even the African Development Bank also prescribes infrastructure projects to establish sustainability.\n\nThis is not just a continental requirement, even when unlocking global international finance, institutions are guided by the Equator Principles and International Finance Corporation performance standards, which have at their core, requirements for the financing institution to satisfy itself that the projects being funded are environmentally sustainable.\n\nIf we were to also look East, being global financial giants, China in 2021 also implemented the Green Development Guidelines for Overseas Investment and Cooperation and is also considering sustainability in its funding mechanisms.\n\nTo the second part of your question on sustainable infrastructure development, on the continent, we are guided by the African Union Agenda 2063 being a blueprint of Africas structural transformation.\n\nFurther, we also have the Programme for Infrastructure Development (PIDA) with a priority action plan or mandate to give preference to cross-border projects in energy, water and transport, among other things. These projects, as you can see at face value, have serious environmental and social considerations.\n\nThen there is the African Free Trade Organisation, which makes sustainable infrastructure a treaty-based obligation. The harmonisation of the continental laws and individual state laws is now a legal and economic necessity.\n\nReporter: Before discussing what the position in Zimbabwe is, what are the things investors generally consider when investing in infrastructure development?\n\nVM: Well like in every investment transaction, the investor is concerned mainly with whether he or she will attain enforceable rights, whether or not there are predictable timelines within the project and key to all, whether the project has taken into consideration and mitigated against any potential environmental and social impact, allowing maximum protection to the potentially affected.\n\nReporter: What is then our Zimbabwe position in terms of sustainable infrastructure development?\n\nVM: I will reiterate what I said at the CEO roundtable conference, my view is that our laws in terms of sustainable infrastructure development are well developed and competitive on the continent.\n\nSustainability is a constitutional, legislative and policy question in Zimbabwe as it is covered by all pillars of the prescriptive and guidance laws in our country.\n\nOur weakness is that the laws are fragmented and found in various statutes that address the different areas where sustainability is a question. Although the Environmental Management Act is the overarching legislation, aligning with the prescriptive terms of our constitution, other legislation like your Water Act, Electricity Act, ZIDA and many other have sustainability considerations.\n\nThe National Development Strategy 2, commencing in 2026, has put sustainable development goals at the core of its policy.\n\nCountries like Kenya have managed to amalgamate these laws into a single reference legislation, making them more attractive to sustainable infrastructure development financing. Although we have a National Climate Policy, our National Climate Management Bill, which will harmonise these laws, is going through the legislative processes with the objective of having a national reference point.\n\nReporter: Would you then advise that ESGs be part of all sustainable infrastructure development plans for investors? If yes, what would your reasons be?\n\nVM: With the risk of sounding like a broken record, international finance can mostly be accessed by companies that can show project environmental and social impacts, including mitigation and remediation options.\n\nIt therefore widens the areas where the developer can access development finance.\n\nInclusion of ESG considerations future proofs projects because most African countries, with Zimbabwe included, are incorporating or perfecting the laws that deal with climate issues.\n\nReporter: Thank you, Mr Madzima. We have to end here because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. You spoke on sustainable</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-sustainable-infrastructure-development/\">Legal Discussions with Vengai Madzima: Sustainable Infrastructure Development   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        },
        {
            "title": "TIGERE moves to expand property portfolio",
            "url": "https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/",
            "content": "By Alois Vinga\n\nTigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million.\n\nThe REIT said the proposed acquisitions are subject to unitholder approval and will be fully funded through the issuance of 770.5 million new Tigere REIT units.\n\nThis marks Tigere REITs second acquisition since its initial public offering (IPO), following the successful purchase of Highland Park Phase 2. The move aligns with the funds strategy of securing high-quality, income-generating real estate assets supported by long-term, US dollar-denominated leases, a key driver for stable returns and capital growth.\n\nThe total acquisition consideration reflects the combined net asset value (NAV) of the target properties. Upon completion, Tigere REITs total units in issue will increase to 1.84 billion, with the newly issued units representing 41.8% of the enlarged unit base.\n\nThe implied issuance price per unit for the transaction stands at US$3.26 cents, representing a 2.536% premium over Tigere REITs NAV per unit of US$3.18 as of June 30, 2025.\n\nThe bulk of the transaction involves the Greenfields Retail Centre, acquired on a leasehold basis. The property, whose development began in December 2024, features 54 tenants across 14,000m of gross lettable area (GLA) and is currently fully occupied.\n\nTigere REIT said the acquisitions will further strengthen its portfolio of high-quality retail assets, supporting consistent returns and sustainable long-term growth for investors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21180820/greenfields-retail.jpg",
            "description": "<p>By Alois Vinga Tigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million. The REIT said the proposed acquisitions are subject to unitholder approval</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/\">TIGERE moves to expand property portfolio</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "23 Oct 2025"
        }
    ]
}