{
    "news": [
        {
            "title": "Golden Eagles’ PSL promotion aspirations low despite good run",
            "url": "https://www.newzimbabwe.com/golden-eagles-psl-promotion-aspirations-low-despite-good-run/",
            "content": "By Sports Reporter\n\nNorthern Region Division One League title contenders Golden Eagles are keeping their title aspirations low despite a good run in the ongoing campaign.\n\nThe Harare-based side on Wednesday afternoon staged a good comeback against fellow title contenders Harare City, whom they beat 3-1 from behind at Gwanzura Stadium.\n\nSo important was the win that it propelled the Eagles to position 3 on the log with 36 points, five behind log leaders Nombeyaora.\n\nDespite the good run that has seen his side finishing the first round of the season in a convincing position, team head coach Aurther Gurajena is keeping his head low.\n\nProbably the target is we want to beat our last season record, so for now, we are chasing ourselves once we surpass what we did last season, he said.\n\nThe former Flame Lilly and Tenax FC coach, however, added that the season the league is more competitive as compared to previous seasons.\n\nIts quite an exciting season, one of its own kind, very competitive.\n\nWe are looking forward to each and every game as it comes, he added.\n\nNORTHERN REGION SOCCER LEAGUE WEEK 19 Results\n\nWednesday 07 July 2025\n\nFT: Chegutu P. 0-1 Agama\n\nFT: MWOS U19 0-0 Karoi\n\nFT: Ngezi U19 0-1 Nombeyawora\n\nFT: PAM 1-0 Shamva Mine\n\nFT: Harare City. 1-3 Golden Eagles\n\nFT: Black Rhinos. 0-1 Zambezi G&C\n\nFT: Cranborne 1-0 Chy Stars\n\nFT: Chy Rangers. 1-0 Trojan Stars\n\nFT: Ali Sundowns 0-1 Black Mambas\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10170352/golden-eagles.jpeg",
            "description": "<p>By Sports Reporter Northern Region Division One League title contenders Golden Eagles are keeping their title aspirations low despite a good run in the ongoing campaign. The Harare-based side on Wednesday afternoon staged a good comeback against fellow title contenders Harare City, whom they beat 3-1 from behind at Gwanzura Stadium. So important was the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/golden-eagles-psl-promotion-aspirations-low-despite-good-run/\">Golden Eagles’ PSL promotion aspirations low despite good run</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        },
        {
            "title": "Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid",
            "url": "https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/",
            "content": "By Costa Nkomo\n\nThe cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed.\n\nThe Treasury confirmed in Parliament that the project cost a total of US$114 million  an increase of US$26 million.\n\nWhen questions were raised about the projects cost, the government was quick to attribute the increase to the relocation of families who had been settled close to the project site.\n\nExperts have, however, drawn comparisons with regional markets such as South Africa and Botswana, where constructing a similar project would typically cost around US$45 million.\n\nWhile many are still trying to make sense of the initial US$88 million figure, Finance Minister Professor Mthuli Ncube further shocked lawmakers by revealing during a Question and Answer session in Parliament on Wednesday that the project had actually consumed an additional US$26 million, not included in the original budget.\n\nEmakhandeni-Luveve MP Decent Bajila raised the issue in Parliament, requesting that Ncube clarify the full cost of the Trabablas Interchange.\n\nI asked the Minister of Finance, Economic Development and Investment Promotion to brief the House on the total cost of the Trabablas Interchange Project and to clarify whether the funding source was a loan from the private sector or the International Monetary Funds (IMFs) Special Drawing Rights facility, Bajila said.\n\nResponding, Ncube said: The cost of Trabablas Interchange was driven by our initial loan arrangement of the order of US$88 million, which was provided by the Consortium of Contractors. In terms of what we used from the Special Drawing Rights, we were required to pay a deposit of US$26 million. So, we used US$26 million from the SDRs to pay that deposit and then the rest was structured as a loan from that US$88 million arrangement.\n\nBajila followed up, asking whether the US$26 million was part of the US$88 million total, to which Ncube responded that it was not.\n\nThe US$26 million is in addition, but it was a requirement for accessing the US$88 million that we pay that deposit to access that facility. We think that was a very good arrangement indeed because we have been able to complete the piece of infrastructure, said Ncube.\n\nDangamvura Chikanga MP Prosper Mutseyami then pressed Ncube for an explanation on what had caused the additional US$26 million in project costs.\n\nMay the Hon. Minister explain to the House as to what caused the additional US$26 million, bearing in mind that the US$88 million had been budgeted to cover the whole construction of the interchange, he asked.\n\nNcube attributed the extra cost to the relocation of residents living near the construction site.\n\nThe cost of relocating, for example, relocating some of the residents that we relocated to create space, for developing this piece of infrastructure. There were some unexpected escalations of that cost, which then pushed us towards increasing the budget by another US$26 million that I have referred to, Ncube said.\n\nMutseyami was not satisfied and posed another follow-up question.\n\nCan you substantiate to the House as to how this supplementary US$26 million would just come about when the budget had already been sorted, then we have extra figures for the situation of adding US$26 million? How do you account that Hon. Minister?\n\nIn response, Ncube said the cost overruns were unforeseen and occurred during the implementation of the project.\n\nKwekwe Mbizo MP Corban Madzivanyika also challenged Ncube, reminding him that the original Trabablas Interchange budget presented to and approved by Parliament did not include the additional US$26 million. He questioned Ncubes authority to spend the extra funds without Parliamentary approval.\n\nMinister, you came and paid another additional US$26 million outside Parliament, where did you get that power to do such? Madzivanyika queried.\n\nHowever, Ncube insisted that, as Finance Minister, he is empowered to handle project budget overruns.\n\nOne did not have to come back to Parliament to be able to exercise the powers that Parliament and the Executive have already awarded or extended to me as Minister of Finance, he responded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10165407/trabablas.jpg",
            "description": "<p>By Costa Nkomo The cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed. The Treasury confirmed in Parliament that the project cost a total of US$114 million – an increase of US$26 million. When questions were raised about the project’s cost,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/\">Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid    </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        },
        {
            "title": "Mnangagwa in surprise visit to National Assembly",
            "url": "https://www.newzimbabwe.com/mnangagwa-in-surprise-visit-to-national-assembly/",
            "content": "By Anna Chibamu\n\nPresident Emmerson Mnangagwa made an unexpected appearance at Parliament on Wednesday, marking his first visit to the National Assembly outside formal events such as the State of the Nation Address (SONA).\n\nThe unannounced visit did not form part of his usual scheduled engagements.\n\nThank you very much for your intelligence, your Presidency, the President, Dr. E.D. Mnangagwa, and members of the House. In terms of our constitution, Your Excellency, the President, is part of the legislature. So, he has every right, he has every right to come in and sit and follow proceedings accordingly.\n\nAnd he has done that today. There was also another reason why he was around, as he was looking at certain aspects of our parliament building. We were chosen to develop this.\n\nSo, we decided to come in and we welcomed him, said Speaker of Parliament, Jacob Mudenda.\n\nRecently, Mnangagwa made another impromptu visit to Parirenyatwa Group of Hospitals, Sally Mugabe Hospital and NatPharm in Harare to assess the situation of the main referral health institutions in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10084419/ED-in-Parliament.jpeg",
            "description": "<p>By Anna Chibamu President Emmerson Mnangagwa made an unexpected appearance at Parliament on Wednesday, marking his first visit to the National Assembly outside formal events such as the State of the Nation Address (SONA). The unannounced visit did not form part of his usual scheduled engagements. “Thank you very much for your intelligence, your Presidency,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-in-surprise-visit-to-national-assembly/\">Mnangagwa in surprise visit to National Assembly</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        },
        {
            "title": "Delta Beverages blames high sugar prices, sugar tax for business struggles",
            "url": "https://www.newzimbabwe.com/delta-beverages-blames-high-sugar-prices-sugar-tax-for-business-struggles/",
            "content": "By Anna Chibamu\n\nDelta Beverages (Pvt) Ltd has raised concerns over the excessive local sugar pricing and the sugar tax, saying both factors are undermining the companys competitiveness.\n\nAppearing before the Parliamentary Portfolio Committee on Industry and Commerce on Tuesday, Deltas Finance Director Alex Makamure said the current sugar pricingset at US$900 per metric tonne by Gold Star and US$890 by Tongaat Hulettsis significantly higher than import landed prices.\n\nCurrently, imported sugar is landing at $800/int before adding the 30 surtax. With the added cost of the sugar tax, the impact of the sugar cost is a key determinant of the viability of our business.\n\nThe high cost of sugar is in addition to the recently introduced sugar tax, which is equivalent to another US$100/MT.\n\nAccording to Makamure, prices of sugar-added soft drinks increased by between 15% to 45% following the introduction of the tax in February 2024.\n\nThe highest increases were on cordials such as Mazoe Orange Crush. The process of cordials has been moderated since January 2025 after the surtax was halved to $0.0005/g.\n\nHe said most beverage producers had reported a miscalculated volume performance since February 2024, with most players absorbing the sugar tax by maintaining discounted prices to avoid a volume collapse whilst awaiting the much-needed review of the tax levels by the authorities.\n\nThe duties and surtaxes penalise the manufacturers even when they have no alternative but to access local supplies.\n\nThe Zimbabwe Sugar Association reports that they had in excess of 16,000 tons of carry-over bottler-grade sugar stocks from the 2024 milling season and there will be over 90,000 tons of uncommitted sugar stocks from the 2025 milling season.\n\nMakamure added that the sugar tax further compounds operational challenges, calling for urgent policy reviews to support the local industry.\n\nZimbabwe is a net exporter of sugar and attracts reciprocal tariffs from other countries.\n\nThe main suppliers of refined sugar are StarAfrica (Goldstar Sugars)and Tongaat Hullets (Hippo Valley & Triangle).\n\nAdded Makamure, Over the years, they have failed to meet the quantity and quality requirements.\n\nGiven these challenges, the Industry and Commerce ministry agreed with the bottlers to supplement their requirements from imports.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/25204048/Delta-Beverages.jpg",
            "description": "<p>By Anna Chibamu Delta Beverages (Pvt) Ltd has raised concerns over the excessive local sugar pricing and the sugar tax, saying both factors are undermining the company’s competitiveness. Appearing before the Parliamentary Portfolio Committee on Industry and Commerce on Tuesday, Delta’s Finance Director Alex Makamure said the current sugar pricing set at US$900 per metric tonne</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delta-beverages-blames-high-sugar-prices-sugar-tax-for-business-struggles/\">Delta Beverages blames high sugar prices, sugar tax for business struggles</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        },
        {
            "title": "Lithium smuggling rampant as Zimbabwe fails to end corruption",
            "url": "https://www.newzimbabwe.com/lithium-smuggling-rampant-as-zimbabwe-fails-to-end-corruption/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published by theGlobal Press Journal.\n\nHARARE, ZIMBABWE  In 2023, Peter, a truck driver, was approaching a border checkpoint between Zimbabwe and Mozambique. He had little reason to question what was in his trucks sealed container  hed transported shipments for this Chinese-owned company before.\n\nWe just thought everything was in order, he says.\n\nBut rather than chrome, the mineral listed on the containers paperwork, inspectors found raw lithium. By law, unprocessed lithium shouldnt leave Zimbabwe without written permission from the minister of mines and mining development. Peter didnt have that. Border officials impounded the truck and trailer  worth more than US$50,000  for a year. Drape Trucking, the company where Peter works, recovered it after paying a US$5,000 fine.\n\nZimbabwe, which boasts Africas largest lithium reserves, is poised to help meet global demand in the race to secure green energy and develop advanced technology. Its production pales in comparison to powerhouses like Australia and Chile, but the country is still among the top-eight producers of the mineral, producing 1,200 tons in 2021 alone.\n\nBut as demand grows, so does illegal trading. In Zimbabwe, some companies mislabel shipments or underreport the quality and quantity of lithium exports. Border officials  either unaware or complicit  allow the shipments to slip through, undermining efforts to regulate one of Zimbabwes most valuable exports.\n\nPeter asked that Global Press Journal use only his first name, and he did not share the name of the company responsible for the shipping containers contents. He provided the name of the owner of the company, but Global Press Journal was not able to verify the involvement of anyone by that name in the industry.\n\nTendai, a former border agent, says hes accepted bribes to allow lithium shipments to pass through the border. Tendai confirmed the incident involving Peter and says he was arrested and fined for his role. Like many other sources who spoke to Global Press Journal for this article, he asked not to use his full name for fear of losing his job.\n\nIn 2022, Zimbabwe banned the export of raw lithium to curb smuggling and extract more value, since the law would force mining companies to process lithium domestically. Since then, some of the largest lithium mining companies in the country, such as Arcadia and Bikita Minerals, have set up processing operations.\n\nData on whether these regulations have generated more revenue is hard to find. Official records show that the countrys lithium production capacity surged by 230% between 2022 and 2023. Most of the product ends up in China, which controls 90% of Zimbabwes mining sector. Even so, the ban has done little to contain lithium smuggling across Zimbabwes porous borders.\n\nThe regulations are ineffective, says Gorden Moyo, director of the Public Policy and Research Institute of Zimbabwe. Officials, including members of security services, who collude with politicians and foreign governments, particularly China, facilitate illegal exports, he says.\n\nNomsa Jane Moyo, the general manager at the Minerals Marketing Corporation of Zimbabwe, a parastatal group that inspects exports, says the organization closely monitors mining at all stages to ensure that companies export the quantities and qualities they declare. They intercept those who skirt the law, she says.\n\nThe government seized 22 lithium shipments in 2023 and 23 in 2024. Some were seized before reaching the borders; others were flagged by officials at the Forbes border post, between Zimbabwe and Mozambique, and the Beitbridge border post, between Zimbabwe and South Africa.\n\nA sign marks the entrance to Prospect Lithium Zimbabwes processing plant in Goromonzi. Despite government efforts to curb smuggling, former border officials say companies conceal high-grade lithium and bribe authorities to export unprocessed minerals. Most of the countrys lithium ends up in China and Hong Kong. Credit: Linda Mujuru, GPJ Zimbabwe\n\nAccording to the Minerals Marketing Corporation, in 2023, the country sold a total of 769,086 metric tons of lithium, valued at US$794 million and produced by two main lithium mining companies, Prospect Lithium Zimbabwe and Bikita Minerals. Two-thirds of these minerals went to either China (59%) or Hong Kong (7%), according to United Nations trade data.\n\nBut these figures dont reflect the true volume of lithium leaving Zimbabwe, says Tendai, the former border agent. Lithium export permits are issued with a fixed limit for how much a company can export, so companies often underreport, he says.\n\nIt all starts at the mines, where officials claim to closely monitor activities, says Tatenda, an employee at Prospect Lithium Zimbabwe who asked that Global Press Journal use only his first name for fear of losing his job.\n\nTatenda says the company undervalues high grades of lithium. And while the ministry of mines carries out inspections, he says, the high-quality lithium is concealed beneath lower-value ore to mislead inspectors.\n\nGlobal Press Journal made several attempts to speak to Prospect Lithium Zimbabwe. Officials indicated that they would comment but did not respond to subsequent requests.\n\nNomsa Jane Moyo, from the Minerals Marketing Corporation, says the lithium quality tests theyve carried out at Prospect Lithium Zimbabwe meet all legal requirements.\n\nTendai, the former border agent, says the mining companies sometimes bypass shipment records by bribing not only border officials but also officers from the Zimbabwe Revenue Authority or the Minerals Marketing Corporation of Zimbabwe and others within the export chain.\n\nThe Zimbabwe Revenue Authority did not respond to multiple requests for an interview, and Nomsa Jane Moyo did not respond to allegations of corruption within the Minerals Marketing Corporation.\n\nCorruption facilitates smuggling, but some border officials dont always know what theyre inspecting, says Levious Chiukira, a customs and trade consultant at Gleam Customs and Clearing Agency.\n\nI worked as a customs official for years, yet I cannot differentiate between petalite and lepidolite, both of which are forms of lithium, he says. [The revenue authority] does not employ geologists, and there is no institutional capacity to address this knowledge gap.\n\nPiles of lithium at a mine in Mutoko. Zimbabwe banned the export of unprocessed lithium in 2022, but weak enforcement and corruption have allowed smuggling to continue. Credit: Linda Mujuru, GPJ Zimbabwe\n\nExporters exploit the regulatory gaps, Gorden Moyo says. While corruption is punishable by law in China, when they operate abroad, they act with impunity.\n\nThe government hasnt helped. Contracts between the state and investors are not accessible to the public, according to a report by the Africa Policy Research Institute. It erodes public trust, says Tafara Chiremba, an environmentalist at the Zimbabwe Environmental Lawyers Association.\n\nBecause of the smuggling, Chiremba says, its China, not Zimbabwe, that benefits from the countrys wealth of lithium.\n\nLinda Mujuruis a Reporter-in-Residence based in Harare, Zimbabwe. A renowned international reporter and public speaker, she has spent nearly a decade covering human rights, the mining sector, the economy, and public health. She holds an MBA from Midlands State University and both masters and bachelors degrees in Journalism and Media Studies from the National University of Science and Technology in Zimbabwe. Linda is one of Global Presss most widely read and syndicated journalists. In 2023, she won the Community Champion Award from the Institute for Nonprofit News for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09211731/01_GPJNews_Zimbabwe_LM_LithiumSmuggling_42_L.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by the Global Press Journal. HARARE, ZIMBABWE — In 2023, Peter, a truck driver, was approaching a border checkpoint between Zimbabwe and Mozambique. He had little reason to question what was in his truck’s sealed container — he’d transported shipments for this Chinese-owned company before.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lithium-smuggling-rampant-as-zimbabwe-fails-to-end-corruption/\">Lithium smuggling rampant as Zimbabwe fails to end corruption</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        },
        {
            "title": "‘Shoot in the leg’ – Kenyan leader orders police to curb violent protests",
            "url": "https://www.newzimbabwe.com/shoot-in-the-leg-kenyan-leader-orders-police-to-curb-violent-protests/",
            "content": "BBC\n\nKenyas President William Ruto has ordered police to shoot protesters targeting businesses in the legs, ensuring they are incapacitated but not killed.\n\nThe UN and human rights groups have accused the police of using excessive force in the recent wave of anti-government protests  31 people were killed on Monday, according to a state-run body.\n\nAnyone caught burning another persons business or property should be shot in the leg, hospitalised, and later taken to court. Dont kill them, but ensure their legs are broken, the president said.\n\nHe further warned his political rivals against sponsoring and using violent protests and unlawful means to forcibly remove him from power.\n\nIn addition to the 31 deaths, more than 100 people were injured and about 532 arrested in the protests which hit the capital Nairobi and other major cities, said the Kenya National Commission on Human Rights (KNCHR).\n\nThe Kenya police says that 11 people died.\n\nThe UN said it was deeply troubled by the killings and criticised the Kenyan police for using lethal ammunition against protesters.\n\nBut in an address on Wednesday, Ruto defended the police action, saying an attack on security forces would be a declaration of war against the country.\n\nKenya cannot and will not be ruled through threats, terror, or chaos. Not under my watch, the president said, vowing to firmly deal with those behind the protests.\n\nHe said any change of government was only possible through the ballot and not through protests, urging his opponents to wait for the 2027 general elections.\n\nThis country will not be destroyed by a few people who are impatient and who want a change of government using unconstitutional means. It is not going to happen, Ruto added.\n\nFormer Deputy President Rigathi Gachagua has denied claims that the opposition was planning to overthrow Ruto.\n\nNobody wants you out of government unconstitutionally. We want to face you on the ballot in August 2027, so just relax, said Gachagua, who was elected alongside Ruto in 2022 but was impeached last year after the pair fell out.\n\nThere has been rising tension in the country since the death of blogger Albert Ojwang in police custody last month brought people back onto the streets, a year after young protesters stormed parliament angered by a wave of tax rises.\n\nRising economic challenges have fanned anger in a country where youth unemployment and the quality of jobs remain significant concerns.\n\nRuto acknowledged the youth unemployment crisis in the country but said the job challenges had existed long before he came to power in 2022. He said that his administration was the first to take deliberate steps to address it.\n\nThe 58-year-old leader questioned why some Kenyans have been more critical and confrontational towards his administration compared to previous governments.\n\nWhy cause all the chaos during my time? Ruto asked rhetorically, warning against ethnic politics.\n\nYou can call me whatever names you want to call me, but I will make sure there is peace and stability in Kenya.\n\nMondays protests were intended to commemorate Kenyas decades-long struggle for democracy but they quickly escalated into deadly clashes in 17 out of the countrys 47 counties, local media reported.\n\nMany of those demonstrating chanted Ruto must go and wantam, meaning one term, a popular rallying call demanding President Ruto leave office.\n\nIna statement issuedon late Tuesday, the KNCHR said the sharp rise in the death toll was deeply troubling.\n\nThe KNCHR strongly condemns all human rights violations and urges accountability from all responsible parties, including police, civilians and all other stakeholders, it added.\n\nThe commission also documented widespread looting and destruction of both public and private property by unidentified individuals.\n\nAmong those killed was a 12-year-old pupil who was hit by a stray bullet while at home in Kiambu, in the outskirts of the capital, local media reported.\n\nIt is very concerning that these latest incidents come barely two weeks after more than 15 protesters were reportedly killed and many more injured in Nairobi and other parts of Kenya on 25 June, said Ravina Shamdasani, spokesperson for the UN High Commissioner for Human Rights.\n\nLethal ammunition, rubber bullets, tear gas, and water cannons were used, Shamdasani added.\n\nAt least two hospitals were damaged after unidentified attackers raided the facilities and stole medical equipment and harassed staff, Reuters news agency reported.\n\nReligious and rights groups have demanded a prompt and independent investigation into the killings, destruction of property and arbitrary arrests.\n\nOpposition leaders on Tuesday accused the government of deploying unmarked police vehicles to transport armed gangs to perceived opposition strongholds during the protests.\n\nThey called for a national boycott of all businesses affiliated with President Rutos administration, accusing his government of deploying state-sponsored violence and extrajudicial killings on Kenyans.\n\nThis regime is hostile. It cannot be reasoned with. It must be resisted. We will not rest. We will not retreat. We will not surrender, the opposition said in a joint statement.\n\nKenyas Chief Justice Martha Koome has cautioned the country against the increasingly violent protests, saying they risked the nations democratic fabric.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/26151833/ruto.png",
            "description": "<p>BBC Kenya’s President William Ruto has ordered police to shoot protesters targeting businesses in the legs, ensuring they are incapacitated but not killed. The UN and human rights groups have accused the police of using excessive force in the recent wave of anti-government protests – 31 people were killed on Monday, according to a state-run</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shoot-in-the-leg-kenyan-leader-orders-police-to-curb-violent-protests/\">‘Shoot in the leg’ – Kenyan leader orders police to curb violent protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        },
        {
            "title": "Parirenyatwa hospital renovations begin, govt aims for world-class standards",
            "url": "https://www.newzimbabwe.com/parirenyatwa-hospital-renovations-begin-govt-aims-for-world-class-standards/",
            "content": "By Thandiwe Garusa\n\nTHE government has begun renovations at Parirenyatwas Mbuya Nehanda Maternity Hospital and Adlam House, a student nurses accommodation facility.\n\nThe renovations followed President Emmerson Mnangagwas visits to Parirenyatwa and Sally Mugabe public referral hospitals after a public outcry over their dilapidated states.\n\nAfter the visit, presidential spokesperson George Charamba acknowledged the dire state of Zimbabwes public hospitals, highlighting infrastructure decay, policy gaps and systematic overload.\n\nSoon after, a private company, which is being funded by the government, began renovations at Parirenyatwa Hospital.\n\nSpeaking during a tour of the hospital, Minister of Health Douglas Mombeshora said Parirenyatwa Hospital will be modernised to meet world-class standards.\n\nWe are looking at renovations taking place at two places, the Adlam House which is accommodation for student nurses.\n\nAs you may have realised, there was a lot of damage to the infrastructure on the roof, the ceilings to the floors to the sewer reticulation and the water system\n\nWe hope by the beginning of September, the first block will be through and here where we are is Mbuya Nehanda Maternity Hospital, also there was a lot of work needed to be done or still needs to be done because nothing much has taken place.\n\nMombeshora said they had to move some patients using the maternity ward to allow renovations to take place.\n\nHe added thatpreliminary assessments are underway to develop a comprehensive plan for renovating the hospital into a modern facility equipped with new medical equipment.\n\nNext will be the main hospital, it will be done in phases because we cannot close the whole hospital.\n\nAlready, some preliminary work is being done to assess the damages so that a comprehensive plan is brought forward for implementation.\n\nWe cannot say of a time frame as we speak because the assessment has not been completed yet.\n\nWe hope we will be able to come up with a new look hospital, modern, comparable with any other hospital in the world and we are also looking at bringing in new equipment, new beds, new theatre equipment, new X rays, new CT scans, everything should be working by the time we start operating in the new facility, he said.\n\nMnangagwas government has long neglected general hospitals, which now face crumbling infrastructure, medicine shortages, costly patient care and poor wages that have led to low staff morale and a massive brain drain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09202034/pari-renovations.jpeg",
            "description": "<p>By Thandiwe Garusa THE government has begun renovations at Parirenyatwa’s Mbuya Nehanda Maternity Hospital and Adlam House, a student nurses’ accommodation facility. The renovations followed President Emmerson Mnangagwa’s visits to Parirenyatwa and Sally Mugabe public referral hospitals after a public outcry over their dilapidated states. After the visit, presidential spokesperson George Charamba acknowledged the dire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parirenyatwa-hospital-renovations-begin-govt-aims-for-world-class-standards/\">Parirenyatwa hospital renovations begin, govt aims for world-class standards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:44",
            "date": "10 Jul 2025"
        }
    ]
}