{
    "news": [
        {
            "title": "Lloyd Mutasa admits MWOS FC lacked depth in Premier League Title chase",
            "url": "https://www.newzimbabwe.com/lloyd-mutasa-admits-mwos-fc-lacked-depth-in-premier-league-title-chase/",
            "content": "By Sports Reporter\n\nMWOS FC head coach Lloyd Mutasa says his teams lack of squad depth cost them the 2025 Castle Lager Premier Soccer League title, despite an impressive campaign that saw themat thetop of the logfor several weeks.\n\nThe Norton-based side currently sits third on the log with 55 points, six behind leaders Scottland FC, with only three matches remaining in the season.\n\nMWOS FCs faint title hopes were dashed last Saturday after a 1-0 loss to rivals Scottland FC, a result that effectively ended their championship pursuit.\n\nDespite falling short, MWOS have enjoyed a remarkable debut season in the top flight  spending more than ten weeks at the summit and going on a 16-match unbeaten run.\n\nReflecting on the campaign, Mutasa said the teams lack of adequate preparation before the season began played a major role in their late slip.\n\nFoundation is important. You know, pre-season and the kind of players you recruit will determine how you play, said Mutasa.\n\nThese guys punched above their weight because, if you look at our depth compared to other teams, there is a huge difference. We tried as much as we could, but we only stretched this far.\n\nMWOS FCs promotion to the Premier Soccer League was confirmed in February 2025, barely a month before the new season began. The club had finished second to Scottland in the Northern Region Division One League, and secured its top-flight berth by purchasing ZPC Hwanges PSL status.\n\nMutasa said the team is now focused on winning the Chibuku Super Cup, aiming to cap off their impressive season with silverware.\n\nMWOS face Triangle United in the semi-finals of the tournament at Ngoni Stadium on Saturday. Victory would see them progress to the final, where they will meet either Dynamos or Highlanders.\n\nConsidering the efforts put in place by management and our fans, I think we will try as much as possible to win the Chibuku Super Cup, as hard as it might be, added Mutasa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/22060943/lloyd-mutasa.jpg",
            "description": "<p>By Sports Reporter MWOS FC head coach Lloyd Mutasa says his team’s lack of squad depth cost them the 2025 Castle Lager Premier Soccer League title, despite an impressive campaign that saw them at the top of the log for several weeks. The Norton-based side currently sits third on the log with 55 points, six behind leaders Scottland</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lloyd-mutasa-admits-mwos-fc-lacked-depth-in-premier-league-title-chase/\">Lloyd Mutasa admits MWOS FC lacked depth in Premier League Title chase</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Sustainable Infrastructure Development",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-sustainable-infrastructure-development/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. You spoke on sustainable infrastructure development at the CEOAfrica AnnualRoundtable in Victoria Falls. What is your position on sustainable infrastructure development in the African context, considering that Africa is a low global contributor to world pollution?\n\nVM: Thank you\n\nAs a point of correction, I spoke on legal considerations for unlocking finances for sustainable infrastructure development. My focus was really on the different mechanisms available to unlock finance for funding infrastructure projects in Zimbabwe, the continent and around the world.\n\nTo your question, sustainable development is a global reality despite various individual contrary views on whether it is necessary or fair. There is a plethora of legislation and policy entrenched in financing institutions that fund global development projects. They (the financial institutions) have, as a prerequisite, the condition that the projects be conscious of ESGs, being environmental, social impact and governance considerations.\n\nA debate on its necessity, especially as 54 separate African countries, is in my view, an uphill task and the logical thing will be for each to benefit from the funds available and develop the individual countries for the collective benefit\n\nReporter:Lets then start with the continental position. What legal and financial instruments are available for infrastructure development that is sustainable?\n\nVM: We have a number of funds that promote infrastructure development that are premised on sustainability by taking into consideration the environment and social impacts. An example will be Sustainable Energy Fund for Africa (SEFA), Green Climate Fund and even the African Development Bank also prescribes infrastructure projects to establish sustainability.\n\nThis is not just a continental requirement, even when unlocking global international finance, institutions are guided by the Equator Principles and International Finance Corporation performance standards, which have at their core, requirements for the financing institution to satisfy itself that the projects being funded are environmentally sustainable.\n\nIf we were to also look East, being global financial giants, China in 2021 also implemented the Green Development Guidelines for Overseas Investment and Cooperation and is also considering sustainability in its funding mechanisms.\n\nTo the second part of your question on sustainable infrastructure development, on the continent, we are guided by the African Union Agenda 2063 being a blueprint of Africas structural transformation.\n\nFurther, we also have the Programme for Infrastructure Development (PIDA) with a priority action plan or mandate to give preference to cross-border projects in energy, water and transport, among other things. These projects, as you can see at face value, have serious environmental and social considerations.\n\nThen there is the African Free Trade Organisation, which makes sustainable infrastructure a treaty-based obligation. The harmonisation of the continental laws and individual state laws is now a legal and economic necessity.\n\nReporter: Before discussing what the position in Zimbabwe is, what are the things investors generally consider when investing in infrastructure development?\n\nVM: Well like in every investment transaction, the investor is concerned mainly with whether he or she will attain enforceable rights, whether or not there are predictable timelines within the project and key to all, whether the project has taken into consideration and mitigated against any potential environmental and social impact, allowing maximum protection to the potentially affected.\n\nReporter: What is then our Zimbabwe position in terms of sustainable infrastructure development?\n\nVM: I will reiterate what I said at the CEO roundtable conference, my view is that our laws in terms of sustainable infrastructure development are well developed and competitive on the continent.\n\nSustainability is a constitutional, legislative and policy question in Zimbabwe as it is covered by all pillars of the prescriptive and guidance laws in our country.\n\nOur weakness is that the laws are fragmented and found in various statutes that address the different areas where sustainability is a question. Although the Environmental Management Act is the overarching legislation, aligning with the prescriptive terms of our constitution, other legislation like your Water Act, Electricity Act, ZIDA and many other have sustainability considerations.\n\nThe National Development Strategy 2, commencing in 2026, has put sustainable development goals at the core of its policy.\n\nCountries like Kenya have managed to amalgamate these laws into a single reference legislation, making them more attractive to sustainable infrastructure development financing. Although we have a National Climate Policy, our National Climate Management Bill, which will harmonise these laws, is going through the legislative processes with the objective of having a national reference point.\n\nReporter: Would you then advise that ESGs be part of all sustainable infrastructure development plans for investors? If yes, what would your reasons be?\n\nVM: With the risk of sounding like a broken record, international finance can mostly be accessed by companies that can show project environmental and social impacts, including mitigation and remediation options.\n\nIt therefore widens the areas where the developer can access development finance.\n\nInclusion of ESG considerations future proofs projects because most African countries, with Zimbabwe included, are incorporating or perfecting the laws that deal with climate issues.\n\nReporter: Thank you, Mr Madzima. We have to end here because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. You spoke on sustainable</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-sustainable-infrastructure-development/\">Legal Discussions with Vengai Madzima: Sustainable Infrastructure Development   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        },
        {
            "title": "An ungrateful man – Mwonzora slams Mnangagwa as MDC opposes ZANU PF’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/an-ungrateful-man-mwonzora-slams-mnangagwa-as-mdc-opposes-zanu-pfs-2030-agenda/",
            "content": "By Staff Reporter\n\nMOVEMENT for Democratic Change (MDC) leader Douglas Mwonzora has described President Emmerson Mnangagwa as an ungrateful man, as Zanu PFs controversial push to extend the presidents tenure beyond 2028 continues to face mounting opposition.\n\nDespite Mnangagwa publicly rejecting the idea of a term extension beyond the constitutionally mandated two terms, Zanu PF has been spearheading a plan to amend the Constitution to enable him to remain in power.\n\nThe ruling party is reportedly seeking to amend Section 91(2), which bars Mnangagwa from running for a third term, and Section 328(7), which prevents a sitting president from benefiting from such an amendment.\n\nAddressing the media in Harare recently, Mwonzora stopped short of saying Mnangagwa has overstayed his welcome at the helm of the country.\n\nWhy should we give President Mnangagwa who is 83 with another term? He has been Minister since 1980 and he has been President, first completing the tenure of President Mugabe and the two terms that he has been given. He needs to be an ungrateful man to seek anything beyond that, said Mwonzora.\n\nAt the just-ended Zanu PF Peoples Conference in Mutare, the ruling party resolved to fast-track constitutional amendments that would allow Mnangagwa to continue his tenure beyond 2028.\n\nMwonzora said the country has seen no tangible improvement under Mnangagwas leadership, who took over from long-time ruler Robert Mugabe following the 2017 military coup.\n\nThere is nothing special that we have received from his presidency at all. Zimbabweans continue wallowing in poverty, although they say that there is economic development in Zimbabwe. Average Zimbabweans have become poorer. Some Zimbabweans cannot afford a meal a day every day and there is a lot of unemployment, so why should we have a term? said Mwonzora.\n\nAccording to a leaked corruption dossier allegedly authored by Vice President Constantino Chiwenga, Zanu PF is plotting to smuggle a document into Parliament titled the Breaking Barriers Initiative (BBI), which seeks to postpone elections and extend the tenure of the National Assembly until 2030.\n\nThe BBI is reportedly being packaged as a national stability project aimed at helping Zimbabwe move away from the toxic cycle of elections.\n\nMwonzora, however, warned against tampering with the 2013 Constitution, which was overwhelmingly endorsed by citizens in a national referendum.\n\nMDC was an active participant in the drafting of the constitution and it heard the views of the people of Zimbabwe. The people of Zimbabwe want a limited term. Somebody rules the country, is given a second term if possible, then they go home. So we remain opposed to the so-called 2030 agenda, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter MOVEMENT for Democratic Change (MDC) leader Douglas Mwonzora has described President Emmerson Mnangagwa as “an ungrateful man,” as Zanu PF’s controversial push to extend the president’s tenure beyond 2028 continues to face mounting opposition. Despite Mnangagwa publicly rejecting the idea of a term extension beyond the constitutionally mandated two terms, Zanu PF</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-ungrateful-man-mwonzora-slams-mnangagwa-as-mdc-opposes-zanu-pfs-2030-agenda/\">An ungrateful man – Mwonzora slams Mnangagwa as MDC opposes ZANU PF’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        },
        {
            "title": "TIGERE moves to expand property portfolio",
            "url": "https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/",
            "content": "By Alois Vinga\n\nTigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million.\n\nThe REIT said the proposed acquisitions are subject to unitholder approval and will be fully funded through the issuance of 770.5 million new Tigere REIT units.\n\nThis marks Tigere REITs second acquisition since its initial public offering (IPO), following the successful purchase of Highland Park Phase 2. The move aligns with the funds strategy of securing high-quality, income-generating real estate assets supported by long-term, US dollar-denominated leases, a key driver for stable returns and capital growth.\n\nThe total acquisition consideration reflects the combined net asset value (NAV) of the target properties. Upon completion, Tigere REITs total units in issue will increase to 1.84 billion, with the newly issued units representing 41.8% of the enlarged unit base.\n\nThe implied issuance price per unit for the transaction stands at US$3.26 cents, representing a 2.536% premium over Tigere REITs NAV per unit of US$3.18 as of June 30, 2025.\n\nThe bulk of the transaction involves the Greenfields Retail Centre, acquired on a leasehold basis. The property, whose development began in December 2024, features 54 tenants across 14,000m of gross lettable area (GLA) and is currently fully occupied.\n\nTigere REIT said the acquisitions will further strengthen its portfolio of high-quality retail assets, supporting consistent returns and sustainable long-term growth for investors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21180820/greenfields-retail.jpg",
            "description": "<p>By Alois Vinga Tigere Property Fund (Tigere REIT) has announced plans to expand its portfolio through the acquisition of two prime retail properties, the Greenfields Retail Centre and Phase 1 of the Zimre Park Retail Centre, for a combined value of approximately US$25.1 million. The REIT said the proposed acquisitions are subject to unitholder approval</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-moves-to-expand-property-portfolio/\">TIGERE moves to expand property portfolio</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        },
        {
            "title": "DNC bus that killed 43 people was unroadworthy, overloaded and speeding – Limpopo Premier",
            "url": "https://www.newzimbabwe.com/dnc-bus-that-killed-43-people-was-unroadworthy-overloaded-and-speeding-limpopo-premier/",
            "content": "IOL\n\nLimpopo Premier Dr Phophi Ramathuba has describedthe deadly N1 bus crash that claimed 43 livesas a preventable disaster and an act of criminal negligence, following revelations that the vehicle was overloaded, unroadworthy and speeding when it plunged down a steep embankment near Louis Trichardt last week.\n\nOn Monday, Ramathuba met with the families and relatives of the deceased at Siloam Hospital in the Vhembe District, where she extended her condolences and expressed solidarity with those mourning the loss of their loved ones. Addressing the gathering, she said the tragedy was not an unavoidable act of fate but the result of lawlessness and greed within the cross-border transport industry.\n\nThe victims  mostly Zimbabwean and Malawian nationals  were travelling home when the bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and injuring 40 others.\n\nAccording to a technical report by the Road Traffic Management Corporation (RTMC), the bus was operating without meeting roadworthiness standards, carried passengers beyond its legal limit and was travelling at an unsafe speed along a mountainous route. Ramathuba said such conditions made the tragedy not just an accident, but a crime against humanity.\n\nThe government will not allow lives to be lost due to greed, lawlessness and disregard for human life, she said. We condemn reckless driving, non-compliance with transport regulations, and the operation of unroadworthy vehicles. The law must take its course, and those responsible must be held accountable.\n\nLimpopo Premier Dr Phophi Ramathuba\n\nRamathuba also commended the emergency services and hospital staff who responded to the scene, saying their swift action saved lives under difficult and dangerous conditions. Our rescue teams risked their own lives to retrieve bodies and transport survivors to safety. Their commitment gave dignity to the deceased and comfort to the grieving, she said.\n\nThe Limpopo government has partnered with the diplomatic missions of Zimbabwe and Malawi to identify and repatriate the deceased. Forensic teams have completed postmortem examinations and begun DNA testing to ensure accurate identification of remains.\n\nFamilies of the victims were provided with counselling and logistical support as they began the painful process of identifying their loved ones.\n\nThe tragedy has reignited concerns over South Africas road safety record and the persistent operation of unsafe, overloaded cross-border buses. Transport experts and activists have long warned that weak enforcement and corruption in vehicle inspections allow dangerous operators to remain on the road, turning long-distance routes into death corridors.\n\nFor many families, the loss goes beyond the immediate grief  it also means the loss of breadwinners who had been working in South Africa to support relatives in neighbouring countries.\n\nEvery life lost on our roads is a blow to a family, a community, and to our shared humanity, Ramathuba said.\n\nAs the province continues to assist with repatriations and investigations, the premier urged all road users to prioritise safety and accountability.\n\nLife has no duplicate, she said.\n\nEvery journey must begin with responsibility. Let us not wait for another disaster to remind us of the value of a single human life.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14083758/dnc-bus.webp",
            "description": "<p>IOL Limpopo Premier Dr Phophi Ramathuba has described the deadly N1 bus crash that claimed 43 lives as “a preventable disaster” and “an act of criminal negligence,” following revelations that the vehicle was overloaded, unroadworthy and speeding when it plunged down a steep embankment near Louis Trichardt last week. On Monday, Ramathuba met with the families</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-that-killed-43-people-was-unroadworthy-overloaded-and-speeding-limpopo-premier/\">DNC bus that killed 43 people was unroadworthy, overloaded and speeding – Limpopo Premier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        },
        {
            "title": "French ex-president Sarkozy goes to jail over Gaddafi money",
            "url": "https://www.newzimbabwe.com/french-ex-president-sarkozy-goes-to-jail-over-gaddafi-money/",
            "content": "BBC\n\nNicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi.\n\nNot since World War Two Nazi collaborationist leader Philippe Ptain was jailed for treason in 1945 has any French ex-leader gone behind bars.\n\nSarkozy, who was president from 2007-2012, has appealed against his jail term at La Sant prison, where he will occupy a small cell in the its isolation wing.\n\nMore than 100 people applauded and shouted Nicolas! as he left his villa in the exclusive 16th district of Paris, holding his wife Carla Bruni-Sarkozy by the hand.\n\nHis son Louis, 28, had appealed to supporters for a show of support, while another son, Pierre, called for a message of love  nothing else, please.\n\nNicolas Sarkozy, 70, was driven through the entrance of the notoriously overcrowded 19th-Century prison in the Montparnasse district south of the River Seine at 09:40 local time (07:40 GMT), while dozens of police officers cordoned off most of the surrounding streets.\n\nHe continues to protest his innocence in the highly controversial Libyan money affair and posted a message on X as he was driven to the jail, saying: I have no doubt. Truth will prevail. But how crushing the price will have been.\n\nWith unwavering strength I tell [the French people] it is not a former president they are locking up this morning  it is an innocent man, he wrote. Do not feel sorry for me because my wife and my children are by my side but this morning I feel deep sorrow for a France humiliated by a will for revenge.\n\nMoments after Sarkozy entered jail, his lawyer Christophe Ingrain said a request for his release had been filed. Nothing justified his imprisonment, said Mr Ingrain, adding: Hell be inside for at least three weeks or a month.\n\nSarkozy has said he wants no special treatment at La Sant prison, although he has been put in its isolation section for his own safety as other inmates are infamous drugs dealers or have been convicted for terror offences.\n\nSarkozys cell in the prisons isolation wing is believed to be on the top floor and will measure between 9-11 sq m (95-120 sq ft). There had earlier been talk of him serving his term in the another wing for vulnerable people, where other VIPs have been jailed in the past.\n\nHe will have a toilet, a shower, a desk, a small electric hob and a small TV, for which he will have to pay a monthly 14 (12) fee, and the right to a small fridge.\n\nThe former president has the right to receive information from the outside world and family visits as well as written and phone contact.\n\nBut he is in effect in solitary confinement, allowed just one hour a day for exercise, by himself in the wings segregated courtyard.\n\nConditions of detention in an isolation wing are pretty hard, La Sant ex-deputy head Flavie Rault told BFMTV. You are alone, all the time. The only contact you have is with prison staff. You never come across another detainee for security reasons and theres a type of social isolation which makes life difficult.\n\nAt the end of last week, Sarkozy was received at the lyse Palace by President Emmanuel Macron, who told reporters on Monday it was normal that on a human level I should receive one of my predecessors in that context.\n\nMacron stressed on Tuesday that it was not his role to comment on or criticise judicial decisions, but he said it was normal that for many in France the sight of a president jailed by this judicial decision would provoke comment.\n\nIn a further measure of official support for the ex-president, Justice Minister Grald Darmanin said he would go to visit him in prison as part of his role in ensuring Sarkozys safety and the proper functioning of the jail.\n\nI cannot be insensitive to a mans distress, he added.\n\nEver since he left office in 2012, Sarkozy has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.\n\nLate next month, Frances highest administrative court will give its verdict on Sarkozys appeal against a six-month jail term in another illegal campaign financing case known as the Bygmalion affair.\n\nAhead of his arrival at La Sant prison, Sarkozy gave a series of media interviews, telling La Tribune: Im not afraid of prison. Ill keep my head held high, including at the prison gates.\n\nSarkozy has always denied doing anything wrong in a case involving allegations that his 2007 presidential campaign was funded by millions of euros in Libyan cash.\n\nThe former centre-right leader was cleared of personally receiving the money but convicted of criminal association with two close aides, Brice Hortefeux and Claude Guant, for their role in secret campaign financing from the Libyans.\n\nThe two men both had talks with Gaddafis intelligence chief and brother-in-law in 2005, a meeting arranged by a Franco-Lebanese intermediary called Ziad Tiakeddine, who died in Lebanon shortly before Sarkozys conviction.\n\nAs he lodged an appeal, Sarkozy is still considered innocent but he has been told he must go to jail in view of the exceptional seriousness of the facts.\n\nSarkozy said he would take two books with him into prison, a life of Jesus by Jean-Christian Petitfils and the Count of Monte Cristo, Alexandre Dumass classic story of a man wrongly imprisoned who escapes to wreak vengeance on his prosecutors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/21173512/sarkozy.webp",
            "description": "<p>BBC Nicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi. Not since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945 has any French ex-leader gone</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/french-ex-president-sarkozy-goes-to-jail-over-gaddafi-money/\">French ex-president Sarkozy goes to jail over Gaddafi money</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        },
        {
            "title": "Zimbabwe faces intensified power cuts as ZESA shuts down Hwange Unit 8 for 10 days",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-intensified-power-cuts-as-zesa-shuts-down-hwange-unit-8-for-10-days/",
            "content": "By Staff Reporter\n\nZimbabweans are set to endure worsening power cuts after ZESA Holdings announced that Hwange Power Stations Unit 8 has been taken off the grid for 10 days due to a technical fault,further straining the countrys already fragile electricity supply.\n\nThe shutdown comes at a time when Unit 3 has been offline since September 10 for statutory maintenance, which is expected to be completed by October 24.\n\nAs of October 21, the Zimbabwe Power Company (ZPC) was generating 1,296MW, far below the countrys peak demand of around 2,000MW.\n\nIn a statement released Tuesday, ZESA said Unit 8 will remain out of service for 10 days to allow for restoration work.\n\nZESA Holdings wishes to inform its valued stakeholders that Hwange Unit 8 has been taken off the grid due to a technical fault. The unit will be out of service for 10 days while restoration work is carried out.\n\nDuring this outage, Hwange Unit 7 will remain in operation, generating 335MW to support system stability, the statement read.\n\nThe utility added that power generation at Kariba South has been increased to help mitigate the temporary shortfall.\n\nGeneration at Kariba South Power Station has also been ramped up, with careful management of water allocations, to help compensate for the temporary shortfall.\n\nWe sincerely apologise for any inconvenience this may cause and appreciate your understanding as we work to restore the unit to service.\n\nUrban areas across Zimbabwe have already been experiencing up to 20 hours of load-shedding daily, a situation expected to worsen during the Unit 8 shutdown period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>By Staff Reporter Zimbabweans are set to endure worsening power cuts after ZESA Holdings announced that Hwange Power Station’s Unit 8 has been taken off the grid for 10 days due to a technical fault, further straining the country’s already fragile electricity supply. The shutdown comes at a time when Unit 3 has been offline since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-intensified-power-cuts-as-zesa-shuts-down-hwange-unit-8-for-10-days/\">Zimbabwe faces intensified power cuts as ZESA shuts down Hwange Unit 8 for 10 days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "22 Oct 2025"
        }
    ]
}