{
    "news": [
        {
            "title": "Ndebele King Bulelani responds to Minister Garwe’s uncivil letter – urges respect and dialogue",
            "url": "https://www.newzimbabwe.com/ndebele-king-bulelani-responds-to-minister-garwes-uncivil-letter-urges-respect-and-dialogue/",
            "content": "By Leopold Munhende\n\nNdebele King Bulelani Khumalo has responded in a dignified manner to Local Government Minister Daniel Garwes rude letter that disparaged his officeanddescribedhim as a charlatan.\n\nGarwe had been angered by King Bulelanis visit to Bulawayo Mayor David Coltart last week.\n\nKing Bulelani is a descendant of King Mzilikazi, who foundeduMthwakazi, a name used to refer to the Ndebele nation, having fled north from Zulu King Shaka to present-day Bulawayo during theuMfecaneera.\n\nGarwes dismissive letter not only generated interest amongst Zimbabweans, it angered a large section of the Ndebele-speaking community who have recognised King Bulelanis reign since his coronation in 2018.\n\nHis Majesty King Bulelani Lobengula kaMzilikazi holds a deeply rooted ancestral and cultural position within the hearts of the uMthwakazi people, as a direct descendant of King Lobengula, and ultimately of King Mzilikazi, the founder of the Ndebele nation, read a statement from King Bulelani.\n\nHis role is not political but restorative, cultural, and symbolicaimed at uniting Mthwakazi descendants across Southern Africa and the diaspora through heritage, identity, and community development.\n\nHis Majestys visit to Bulawayo was in no way a political event or an act of defiance. It was a private and dignified cultural pilgrimage to the historical heartland of the Ndebele peoplea journey marked by mutual respect, peaceful engagement, and cultural significance.\n\nKing Bulelanis presence at Town House was at the behest of Coltart, who had invited him for a meeting wherein they discussed the honouring of certain culturally important days and historically significant sites around Bulawayo.\n\nGarwe responded after images of Coltart and the King were sent on X.\n\nHe went on to express shock, disgust, claimed the Ndebele throne was defunct, described King Bulelani as self-styled and urged Bulawayo not to recognise him.\n\nAdded King Bulelani in response: We respectfully urge public officials to exercise caution, decorum, and cultural sensitivity when speaking on matters of heritage and traditional leadership.\n\nDismissive language or threats of arrest directed at a traditional and cultural figurewhose mission is reconciliation, unity, and empowermentdo not reflect the spirit of Ubuntu or the values enshrined in Pan-Africanism.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29061714/coltart-bulelani.jpeg",
            "description": "<p>By Leopold Munhende Ndebele King Bulelani Khumalo has responded in a dignified manner to Local Government Minister Daniel Garwe’s rude letter that disparaged his office and described him as a ‘charlatan.’ Garwe had been angered by King Bulelani’s visit to Bulawayo Mayor David Coltart last week. King Bulelani is a descendant of King Mzilikazi, who founded uMthwakazi, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ndebele-king-bulelani-responds-to-minister-garwes-uncivil-letter-urges-respect-and-dialogue/\">Ndebele King Bulelani responds to Minister Garwe’s uncivil letter – urges respect and dialogue</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "HSTV taken to court for broadcasting Geza’s press conference",
            "url": "https://www.newzimbabwe.com/hstv-taken-to-court-for-broadcasting-gezas-press-conference/",
            "content": "By Mary Taruvinga\n\nAlpha Media Holdings (AMH)s Heart and Soul TV was on Monday arraigned before the court accused of transmitting data carrying incitement messages following its coverage of a press conference bywar veteranBlessed Geza.\n\nThe company representative, Olga Muteiwa, appeared before Harare magistrate Learnmore Mapiye, who placed the company on remand despite protestations by its lawyer, Beatrice Mtetwa.\n\nHSTV challenged its placement on remand, arguing that the facts of the offence do not disclose a criminal offence.\n\nThe State insisted that HSTV was correctly charged before the court ruled in its favour.\n\nTo this end, Mtetwa gave notice to file an application for direct access to the Constitutional Court on Wednesday.\n\nWhile challenging placement on remand, Mtetwa told the court that a similar scenario once took place during the 2017 military coup era, but AMH and its reporter Blessed Mhlanga, currently locked up over the same allegations the company is facing, was never arrested.\n\nMtetwa also said the media had rights and should be protected by the law and the courts, and not get intimidated for doing their work freely as provided by the law.\n\nThe said statements that are said to have constituted an offence relate to comments supplied in a peaceful manner.\n\nThe accused person is a duly registered company and conducts its business in terms of articles of memorandum of association and in terms of the law in particular section 61 of the Constitution, it is obliged to disseminate information in a free fair balanced manner, it must give voice to all political opinion and this is inalienable rights confined in Constitution and the court cannot place accused on remand for exercising a constitutional right, Mtetwa submitted.\n\nShe said placing the company on remand would infringe upon the rights of the Zimbabwean people.\n\nThere is no doubt that the freedom of expression is coupled with right to be free.\n\nIt is recognised and entrenched in every international regional human rights instrument.\n\nThe press should be in fact allowed, particularly by the court, to report with a balance, fair, objective and factual reporting of what is going on in society.\n\nThe public has the right to information and dissemination can be done without the company, she said.\n\nGiving reference to the 2017 incident, Mtetwa said Mhlanga disseminated similar information on November 9, 2017, regarding then-President Emmerson Mnangagwas dismissal.\n\nThe journalist who covers a story at ZBC similar to this one as Blessed Mhlanga and the information published by NewsDay on 9 November 2017, that Emmerson has just been fired and fled the country and is in South Africa, he made very clear what he was doing to report what was happening.\n\nHe also wrote that Mnangagwa said he was going nowhere and that he further said Mugabe will leave Zanu PF within two weeks.\n\nMnangagwa was speaking to the Zimbabweans, the same way Blessed Geza was speaking to the Zimbabweans through HSTV and Blessed Mhlanga.\n\nMhlanga was not prosecuted for disseminating what Mnangagwa said during that time and the NewsDay was not prosecuted for publishing what Mnangagwa said because section 61 of the Constitution is clear on freedom of the media.\n\nBut now they are calling for the same to be prosecuted, she said.\n\nMtetwa said HSTV simply conveyed the views of interviewed individuals and should not face prosecution.\n\nWhat was disseminated by the accused company consists of topical political discourse that the people of Zimbabwe are entitled to know in the same way they were entitled to receive similar political discourse of Mnangagwa on November 2017.\n\nFor these reasons, we have absolutely no reason to place the accused company on remand for observing its duty.\n\nJournalists, with respect your worship, would immediately be in self-censorship in fear of prosecution, and also media companies will also fear to publish opposing material in fear of prosecution.\n\nJournalism is not different from practice of law; they can disseminate information that they cannot agree with, just like a lawyer represents an accused whose actions they may not agree with, Mtetwa concluded.\n\nChirenje maintained that there are several aspects not disputed by the defencethat Mhlanga is an employee of HSTV and that they disseminated the statements made by Blessed Geza.\n\nNow, reasonable suspicion is already there, and nothing has been said against these issues.\n\nWe also have evidence that links the accused to the commission of the offence, so if reasonable suspicion is there to satisfy the State, the company should be placed on remand. Section 61 does not in any way exonerate the accused in court. There are limitations on section 61, and nothing was said on the limitations.\n\nTransmission of data messages of incitement does not in any way favour him in light of the limitations in section 61, Chirenje said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/01/16135841/Mtetwa-e1610805561445.jpg",
            "description": "<p>By Mary Taruvinga Alpha Media Holdings (AMH)’s Heart and Soul TV was on Monday arraigned before the court accused of transmitting data carrying incitement messages following its coverage of a press conference by war veteran Blessed Geza. The company representative, Olga Muteiwa, appeared before Harare magistrate Learnmore Mapiye, who placed the company on remand despite protestations by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hstv-taken-to-court-for-broadcasting-gezas-press-conference/\">HSTV taken to court for broadcasting Geza’s press conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "UZ lecturers press on with strike despite govt’s assurances to end salary stalemate",
            "url": "https://www.newzimbabwe.com/uz-lecturers-press-on-with-strike-despite-govts-assurances-to-end-salary-stalemate/",
            "content": "By Darlington Gatsi\n\nDESPITE assurances by President Emmerson Mnangagwas spokesperson that the government would address their grievances, University of Zimbabwe (UZ) lecturers say they have not noted any engagement and will continue with their industrial action.\n\nUZ lecturers are at loggerheads with the institution and the government over poor remuneration, which they argue has been eroded by inflation and the skyrocketing cost of living.\n\nLast week, presidential spokesperson George Charamba promised to escalate the lecturers grievances to the relevant authorities, but the Association of University Teachers (AUT) has stated that there has been no engagement from the government.\n\nNothing has changed since the comment alleged to be from presidential spokesperson Mr Charamba. Even that communicationwe are still waiting for it to come formally. Nothing as yet. Hence, we are still in the trenches. The strike is indefinite, AUT spokesperson Obvious Vengeyi told NewZimbabwe.com.\n\nLecturers are demanding that their salaries be pegged at US$2,250, which they argue is on par with other higher education institutions in the region.\n\nThey are also bemoaning incapacitation, which has forced them to use personal resources to conduct lessons.\n\nIn a show of defiance, the lecturers have withdrawn from attending meetings, invigilating and marking examinations.\n\nIn an earlier statement, the lecturers said they had been frustrated by the slow pace of the government and UZ in addressing their plight.\n\nDespite prolonged engagement over 18 months, the employer and the minister have failed to meet AUTs demands or make any reasonable alternative offer, resulting in the issuance of a Certificate of No Settlement.\n\nThe dispute remains unresolved, and lecturers and their families are languishing in extreme poverty, with a net monthly salary of less than US$250 and ZiG 6,000a sum from which the employer harshly and unfairly expects employees to subsidise it by providing personal property as tools of work, including laptops, smartphones, data, and transport to and from work, read the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24103947/UZ-strike-8-scaled.png",
            "description": "<p>By Darlington Gatsi DESPITE assurances by President Emmerson Mnangagwa’s spokesperson that the government would address their grievances, University of Zimbabwe (UZ) lecturers say they have not noted any engagement and will continue with their industrial action. UZ lecturers are at loggerheads with the institution and the government over poor remuneration, which they argue has been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-lecturers-press-on-with-strike-despite-govts-assurances-to-end-salary-stalemate/\">UZ lecturers press on with strike despite govt’s assurances to end salary stalemate </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "Rwanda confirms talks with US about taking in migrants",
            "url": "https://www.newzimbabwe.com/rwanda-confirms-talks-with-us-about-taking-in-migrants/",
            "content": "BBC\n\nRwanda is in the early stage of talks with the Trump administration to accept migrants deported by the US, the East African countrys Foreign Affairs Minister Olivier Nduhungirehe has said.\n\nHis comments come after US Secretary of State Marco Rubio said last month that Washington was actively searching for countries that would take in some of the most despicable human beings.\n\nNduhungirehe said the talks were not new to us as Rwanda had previously agreed to accept migrants deported by the UK.\n\nHowever, the UK abandoned the scheme, which faced numerous legal challenges, after Sir Keir Starmers Labour government took office last July.\n\nSpeaking to Rwandan TV on Sunday, Nduhungirehe said the government was in the spirit of giving another chance to migrants who have problems across the world.\n\nNduhungirehe added that the talks with the US were continuing, and it was too early to predict their outcome.\n\nSince coming to office in January, US President Donald Trump has focused on speeding up the removal of undocumented migrants, with the promise of mass deportations.\n\nIn February, El Salvador offered to take in criminals deported from the US, including those with US citizenship, and house them in its mega-jail.\n\nSalvadorean President Nayib Bukele said his government would do so in exchange for a fee.\n\nPanamaand Costa Rica have also taken in migrants deported from the US.\n\nLast week an unnamed Rwandan official told the Washington Postthat the country was open to taking in more migrants expelled from the US, after having accepted an Iraqi in March.\n\nThe official added that talks with the US started shortly after Trumps inauguration in January.\n\nRwanda has previously been criticised for its human rights record, including the risk that those sent to the East African nation could be deported again to countries where they may face danger.\n\nHowever, Rwanda says it is a safe place for refugees.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/05175859/rwanda-minister-olivier.webp",
            "description": "<p>BBC Rwanda is in the “early stage” of talks with the Trump administration to accept migrants deported by the US, the East African country’s Foreign Affairs Minister Olivier Nduhungirehe has said. His comments come after US Secretary of State Marco Rubio said last month that Washington was “actively searching” for countries that would take in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rwanda-confirms-talks-with-us-about-taking-in-migrants/\">Rwanda confirms talks with US about taking in migrants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "POSB partners with Zimnat General Insurance to offer insurance services",
            "url": "https://www.newzimbabwe.com/posb-partners-with-zimnat-general-insurance-to-offer-insurance-services/",
            "content": "By Staff Reporter\n\nThe Peoples Own Savings Bank (POSB) has announced astrategic partnership withZimnatGeneralInsurance to provide an extensive range of bancassurance services. Through this collaboration, POSB is now offering various insurance services underwritten byZimnat, thereby enhancing the banks service portfolio and providing customers with convenient access to essential insurance services.\n\nUnderthispartnership,POSB is now offering motor vehicle insurance, both third-party and comprehensive coverage. Customers can nowpay for theirZimnatmotor vehicle insurance premiums andrenew their ZINARA and ZBC radio licenses through POSB.\n\nAdditionally, POSB is also offering a Hospital Cash Planthrough the same partnership, providing financial support to customers duringhospitalisation, allunderwritten byZimnatInsurance.\n\nThe Hospital Cash Plan is designed to provide customers with a daily cash benefit duringhospitalisation, helping to cover incidental expenses and alleviate financial stress during recovery. This plan is part of POSBs commitment to offering practical and valuable financial solutions to its customers.\n\nPOSB andZimnatGeneralInsurance are committed to expanding their bancassurance offerings. Other insurance services are currently in the pipeline, ensuring that customers will have access to a comprehensivepackageof insurance and financial services tailored to their needs, under one roof.\n\nThis partnershipwithZimnatGeneral Insuranceallows us to provide convenient and accessible insurance solutions, ensuring that our customers can manage their financial needs under one roof, saidGarainashe Changunda, Chief Executive Officer of POSB. We are dedicated to continuously enhancing our service offerings and meeting the ever-evolving needs of our customers. As we celebrate our 120thanniversary, we reaffirm our dedication to a customer-centric approach, leveraging partnerships and innovation to rapidly transform customer experiences and continue our legacy of innovation and inclusivity.\n\nZimnatis excitedto collaborate with POSB, a resilient bank with an extensive network, including in some remote parts of the country, to bring our widely sought-after insurance services to a broader audience, saidMrs.Betty Chiware Togarasei,CEO ofZimnatGeneralInsurance, This partnership aligns with our mission toempower prosperity andprovide innovative and reliable insurance solutions to the people of Zimbabwe. We look forward to a successful and mutually beneficial collaboration that benefits our customers and strengthens our communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19061838/Screenshot-2025-03-19-at-08.16.46.png",
            "description": "<p>By Staff Reporter The People’s Own Savings Bank (POSB) has announced a strategic partnership with Zimnat General Insurance to provide an extensive range of bancassurance services. Through this collaboration, POSB is now offering various insurance services underwritten by Zimnat, thereby enhancing the bank’s service portfolio and providing customers with convenient access to essential insurance services.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/posb-partners-with-zimnat-general-insurance-to-offer-insurance-services/\">POSB partners with Zimnat General Insurance to offer insurance services</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "Guess who? Fans speculate on Marc Jacobs’ Met Gala celebrity silhouettes",
            "url": "https://www.newzimbabwe.com/guess-who-fans-speculate-on-marc-jacobs-met-gala-celebrity-silhouettes/",
            "content": "IOL\n\nIt is that time of the year again, when fashion and creativity take centre stage.\n\nTheMet Galais here, and social media has been buzzing with celebrities setting the streets of New York alight with their sizzling fashion looks in preparation for the iconic event.\n\nInterestingly, renowned fashion designer Marc Jacobs has revealed the silhouette of celebrities he will be dressing for the Met Gala on May 5 at the Metropolitan Museum of Art in New York City, sparking speculation among fans on social media about who the mysterious silhouettes might be.\n\nJacobs has been making waves with his Met Gala 2025 teasers, releasing silhouettes of the five celebrities he will be dressing for the event.\n\nFans are going wild, trying to guess who the mystery celebrities might be based on the silhouettes.\n\nSome popular guesses include Cynthia Erivo; fans seem to be fairly confident that Erivo might be one of the celebrities dressed by Jacobs. Known for his bold fashion looks, American-Nigerian modelWisdom Kayeis also on the list.\n\nCynthia Erivo to the far right, said X user @AbigailJoyFloat.\n\n@NaomiAfterDark commented: Wisdom Kaye far right I suspect \n\nJacobs decision to release these silhouettes has created a buzz around the Met Gala, leaving fans eagerly awaiting the big reveal.\n\nThis years Met Gala theme is Superfine: Tailoring Black Style, and Jacobs designs are expected to fit right in with the celebration of Black fashion heritage and identity.\n\nThe show will feature garments, artworks, and photographs highlighting Black designers who have long been overlooked. The Met Galas host committee includes a star-studded lineup of notable figures from various fields.\n\nThe co-chairs of this years gala include Colman Domingo, Lewis Hamilton, A$AP Rocky, Pharrell Williams, and Anna Wintour, with LeBron James serving as honorary chair.\n\nThe host committeefeatures a diverse range of talented individuals, including actors, artists, athletes, designers, filmmakers, musicians, and writers. Some of the committee members are seasoned rapper Andr 3000, actress Ayo Edebiri, Doechii andSouth African sensation Tyla, to name a few.\n\nWhat is the Met Gala?\n\nThe Met Gala, formally known as the Costume Institute Benefit, is an annual fundraising event for the Metropolitan Museum of Arts Costume Institute.\n\nIt is a night where celebrities as well as fashion icons gather to showcase their well-thought-out, exquisite and often flashy garments inspired by the theme.\n\nThe event will be livestreamed onVoguesplatform at 6pm Eastern (12am, Tuesday in South African Standard Time), hosted by singer Teyana Taylor, producer La La Anthony, and comedian Ego Nwodim, with internet star Emma Chamberlain handling red-carpet interviews as the correspondent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/05180206/Screenshot-2025-05-05-at-19.01.42.png",
            "description": "<p>IOL It is that time of the year again, when fashion and creativity take centre stage. The Met Gala is here, and social media has been buzzing with celebrities setting the streets of New York alight with their sizzling fashion looks in preparation for the iconic event. Interestingly, renowned fashion designer Marc Jacobs has revealed the silhouette</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/guess-who-fans-speculate-on-marc-jacobs-met-gala-celebrity-silhouettes/\">Guess who? Fans speculate on Marc Jacobs’ Met Gala celebrity silhouettes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "Zimbabwe adapts to use technology in agriculture",
            "url": "https://www.newzimbabwe.com/zimbabwe-adapts-to-use-technology-in-agriculture/",
            "content": "By Daniel Itai | Connecting Africa\n\nIn recent years Zimbabwe has been implementing more agritech solutions and climate-smart technologies to counter challenges impacting the agricultural sector.\n\nIn November 2021, Zimbabwe launched theNational AgriTech Strategy 2021-2025aimed at digitalizing the farming ecosystem and improving evidence-based decision making for African farmers.\n\nAccording to Farmonaut, a satellite-based crop health monitoring startup, solar-powered irrigation systems haveboosted crop yields by 30%in Zimbabwe.\n\nWithin the last decade, the Southern African country has experienced four drought seasons resulting in erratic crop outputs and the death of livestock, making the adoption of smart agriculture solutions a necessity.\n\nAlthough the government has made calls for the adoption of smart agriculture, access to it and the know-how is still limited to a few farmers who are mainly into commercial farming due to the high cost of acquiring equipment such as drones, solar panels and lithium batteries.\n\nOver the past two decades, the country has been battered with constant power cuts, which have inadvertently led to irregular water supplies affecting communal and commercial farmers.\n\nIn 2020 the government also launched the Intwasa/Pfumvudza program, a climate-smart agriculture model designed to help smallholder farmers improve crop productivity under adverse weather conditions. As a result, the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development has been training farmers to use and implement drone technology in farming, which enables precision agriculture, feed surveillance, field mapping and chemigation.\n\nIn 2023, the government gave the green light to the use of climate-smart seeds such as maize, sorghum, millets, rice, soyabeans, sunflowers and cotton, which adapt to changing climatic conditions.\n\nSpeaking to Connecting Africa, Blessing Phiri, co-founder of agritech company Agriacres, said Zimbabwe has been shifting to renewable energy, solar boreholes, off-grid storage and precision farming.\n\nTo date, several farmers are now using mobile apps, USSD platforms, drones and satellite imaging whilst others have started implementing the central node system or IoT [Internet of Things] sensors and already some have started to yield results especially those engaging in outsourcing precision services, Phiri said.\n\nIn addition, Olga Nhari founder and national coordinator of Women in Agriculture Union (WAU), said the adoption of smart agriculture in Zimbabwe was a significant milestone, especially for female farmers.\n\nWomen farmers are increasingly using mobile apps, precision farming tools, and climate-smart agriculture technologies to enhance their productivity and decision-making. These tools help them monitor crop health, optimize water usage, and predict weather patterns, ultimately improving their yields and livelihoods, Nhari said.\n\nNhari further highlighted that agritech was playing a pivotal role in helping women farmers adapt to climate-related challenges through the aid of weather forecasting systems, soil moisture sensors, and crop monitoring platforms.\n\nSince Zimbabwe got its independence in 1980, there have been variouscontestationson whether Zimbabwe has ever truly been the breadbasket of Africa, a title thegovernment wants to reclaim.\n\nUntil 2001, Zimbabwe had been assigned the responsibility of crop production, food, agriculture and natural resources within the Southern African Development Community (SADC).\n\nIn 2022, the country recorded its highest output of maize, the countrys staple food, securing2.28 million tonsof maize.\n\nZimbabwe requires 2.2 million tons of maize annually, with 1.8 million tons for human consumption and 400,000 tons for livestock feed. This year, the country is targeting an output of 2.7 million tons of maize.\n\nNational Council of Chiefs President Chief Mtshane Khumalo told the Herald Online that communities that planted early this year under the Intwasa/Pfumvudza programare expecting a bumper harvest.\n\nThe Ministry of Lands, Agriculture, Fisheries, Water and Rural Development is targeting aUS$3.4 billionlivestock sector by end of 2025. It aims to double the national herd, which currently stands at 5.7 million, to 11 million by 2030 through the development of drought-tolerant livestock breeds courtesy of climate-smart breeding strategies.\n\nIn an interview with Connecting Africa, Wendy Zvakawapano, co-founder of Wenashe Farms  a regenerative and climate-smart agribusiness  said Zimbabwes agricultural sector is increasingly embracing technology-driven solutions to improve productivity, adapt to climate change, and work around challenges like power cuts and erratic rainfall.\n\nOur hydroponics units allow us to produce up to three to four times more yield per square meter than traditional soil farming, using 90% less water. In addition, integrating biogas systems has cut our energy costs, not only for our farming operations, but for our employees as well, Zvakawapano said.\n\nOverall, technology adoption has not only increased output, but also reduced input costs, minimized post-harvest losses, and improved climate resilience, especially among forward-thinking agripreneurs and cooperatives.\n\nClive Munakandafa, vice-chairperson of Zimbabwe Commercial Farmers Union for Matabeleland North, said given the countrys increasing exposure to extreme weather patterns, technology plays a crucial role in sustaining the agricultural sectors productivity.\n\nUsing these smartphone applications, sensors, drones, smart irrigation techniques and equipment, farmers are then able to plan their water application schedules based on weather forecasts and adapt as required by the prevailing situations, Munakandafa told Connecting Africa.\n\nAll these advancements have been designed to revolutionize the sector and ensure better yields and harvests under the ever-changing climatic conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/05170705/Male_farmer_agritech_1.jpeg",
            "description": "<p>By Daniel Itai | Connecting Africa In recent years Zimbabwe has been implementing more agritech solutions and climate-smart technologies to counter challenges impacting the agricultural sector. In November 2021, Zimbabwe launched the National AgriTech Strategy 2021-2025 aimed at digitalizing the farming ecosystem and improving evidence-based decision making for African farmers. According to Farmonaut, a satellite-based crop health</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-adapts-to-use-technology-in-agriculture/\">Zimbabwe adapts to use technology in agriculture</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "March 31 protests: Judge blasts State for mishandling case of locked-up suspects",
            "url": "https://www.newzimbabwe.com/march-31-protests-judge-blasts-state-for-mishandling-case-of-locked-up-suspects/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Esther Muremba on Monday had no kind words for the State after it emerged that the prosecution is yet to record witness statements a month after the 95 were locked up.\n\nThe 95 are accused of staging protests against President Emmerson Mnangagwa on March 31. Last month one Munyaradzi Mazhiri was granted bail, and the remaining 94 are seeking bail at the High Court after they were denied bail by a Harare magistrate.\n\nIn their appeal, the suspects, through their lawyer Jeremiah Bamu, said they were involved in a dragnet arrest as they had nothing to do with the protests.\n\nAppearing for the National Prosecuting Authority (NPA)Charles Muchemwa conceded that the lower court erred when it denied the accused bail.\n\nCornered by the judge, he also admitted that prosecuting the suspects might be a challenge.\n\nThe judge fumed, Out of 95, there are only 15 statements by arresting details explaining where the accused were arrested.\n\nIf we are to proceed to trial, what evidence are you going to use against them? It shows that you have nothing in your docket.\n\nHow can you have a whole lot of people in custody withoutwitnesses, so that after two yearsyou say then withdraw chargesagainst them after they have rotted in prison, is the State being fair? she asked.\n\nMuchemwa responded, We might be facing difficulties in prosecuting them. That will be a mammoth task.\n\nHe also agreed that there is nothing that differentiates Mazhiri, who was granted bail by Justice Philipa Philips, and all the other accused.\n\nThe prosecutor also conceded that the magistrate court failed toconsider affidavitswhich weredisposed of by the accusedbefore being denied bail.\n\nJudgment was reserved to this Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133558/march-3.png",
            "description": "<p>By Mary Taruvinga High Court judge Justice Esther Muremba on Monday had no kind words for the State after it emerged that the prosecution is yet to record witness statements a month after the 95 were locked up. The 95 are accused of staging protests against President Emmerson Mnangagwa on March 31. Last month one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protests-judge-blasts-state-for-mishandling-case-of-locked-up-suspects/\">March 31 protests: Judge blasts State for mishandling case of locked-up suspects</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "Police make significant arrest of robbery syndicate in Polokwane, stolen phones sent to Zimbabwe",
            "url": "https://www.newzimbabwe.com/police-make-significant-arrest-of-robbery-syndicate-in-polokwane-stolen-phones-sent-to-zimbabwe/",
            "content": "The Star\n\nSouth Africa  In a breakthrough against rising crime, police have arrested five suspects  including a foreign national  believed to be behind a spate of bold and violent robberies that have gripped Polokwanes central business district.\n\nLimpopo police spokesperson Colonel Malesela Ledwaba stated that several businesses in Polokwane were targeted in armed robberies, with cash stolen, between March and April.\n\nIt is reported that between March and April 2025, Polokwane was experiencing an increase in business robberies daily, wherein the shopkeepers and customers were robbed of an undisclosed amount of cash and cellphones at gunpoint.\n\nHe added that detectives traced the suspects to the Ga-Makibela section and Moletjie village under the Seshego policing area, where three suspects were arrested. They then moved to Polokwane CBD, where the fourth suspect was apprehended.\n\nThe suspects later led officers to Ext 75 in the Westernburg policing area, where a black pellet firearm, resembling a real firearm and believed to have been used in the robberies, was recovered\n\nLedwaba further stated that during interviews at Polokwane SAPS, it became clear that the suspects were involved in multiple robberies targeting three food outlets, two supermarkets, several pharmacies, a bakery, and a boutique, leading to the apprehension of a fifth suspect.\n\nFurther investigations led the team to Polokwane, where a Zimbabwean national, who was found in possession of three stolen cellphones and was subsequently arrested, he added.\n\nThe recovered cellphones and pellet firearm, loaded with four blank rounds, were seized. Preliminary investigations revealed that some of the stolen cellphones had already been sent to Zimbabwe.\n\nLedwaba added that a case of possession of suspected stolen property has been opened, and the four other arrested suspects have been positively linked to nine business robbery cases.\n\nAll five suspects are expected to appear before the Polokwane Magistrates Court on May 5, facing charges of business robbery and possession of suspected stolen property.\n\nActing provincial commissioner of Limpopo, Major General Manala, praised the initiative and dedication of the police team. We commend the involved team for their tireless efforts in restoring safety and ensuring that the perpetrators are behind bars, Manala remarked, reaffirming the provinces commitment to tackling the rising tide of crime head-on.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/06035044/SA-Police.png",
            "description": "<p>The Star South Africa – In a breakthrough against rising crime, police have arrested five suspects — including a foreign national — believed to be behind a spate of bold and violent robberies that have gripped Polokwane’s central business district. Limpopo police spokesperson Colonel Malesela Ledwaba stated that several businesses in Polokwane were targeted in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-make-significant-arrest-of-robbery-syndicate-in-polokwane-stolen-phones-sent-to-zimbabwe/\">Police make significant arrest of robbery syndicate in Polokwane, stolen phones sent to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        },
        {
            "title": "We have been saying this for years! – Machakaire’s call for redress of collapsing public health sector stirs up a storm",
            "url": "https://www.newzimbabwe.com/we-have-been-saying-this-for-years-machakaires-call-for-redress-of-collapsing-public-health-sector-stirs-up-a-storm/",
            "content": "By Staff Reporter\n\nYouth Empowerment Minister Tinoda Machakaire stirred the pot, Monday with his plea to President Emmerson Mnangagwa to urgently address the collapsing health care system.\n\nMachakaires admission that public hospitals are in desperate need of attention from Mnangagwa drew both praise and criticism.\n\nI visited one of our public health institutions this morning to see a relative and left deeply concerned by the conditions I witnessed. What I saw was deeply movinga clear indication that many of our people are facing serious challenges. The growing public outcry over our healthcare system is not an exaggeration; it reflects the difficult experiences of many citizens, Machakaire posted on his social media pages.\n\nHowever, critics of Mnangagwas government and the Zanu PF party were far from sympathetic.\n\nFormer Mt Pleasant Member of Parliament and renowned lawyer Fadzayi Mahere had harsh words for the cabinet minister, arguing that Mnangagwas entire government should admit failure and resign en masse.\n\nSo, when we will be raising alarm about the dilapidated state of the public health system, do you think we will be lying? Are you only concerned now because it has affected you directly? Do you ever raise these issues with Minister Mombeshora in your cabinet meetings? Do you finally accept that Zanu Patriotic Front has destroyed the public health system?, commented Mahere.\n\nWith respect, anyone who pretends not to have known about the crisis in the public health sector all along arikunyepedzera kuzungaira. Ministers and senior Govt officials know but they dont care.\n\nThey wont act unless they can directly cash in on the crisis with apic.twitter.com/4UkjFUVjhD\n\n Fadzayi Mahere (@advocatemahere)May 5, 2025\n\nMahere added: Would you concede that Mnangagwa has failed to deliver on his promise of quality healthcare for all? You have nobody else but yourselves to blame since you have been in power for 45 years. Mauraya nyika. What a mess! All of you must resign.\n\nHuman rights and democracy activist Freeman Chari also gave Machakaire a piece of his mind, labelling Mnangagwas government officials morons who have invested in propaganda tactics rather than fixing the problems in the health sector.\n\nThese people are morons. For years we have been saying hospitals are deathtraps, and Nick Mangwana would send a cameraman to take a picture of a single bed somewhere and claim things are well. A few weeks ago Pinjisi died begging for Pain Eeze and they posted a shelf with ARVs in Gwanda claiming all is well. People have been arrested for saying this, Chari wrote on his X account on Monday.\n\nThese pple are morons. For years we have been saying hospitals are deathtraps, and@nickmangwanawould send a cameraman to take a picture of a single bed somewhere & claim things are well. A few weeks ago Pinjisi died begging for Pain Eeze & they posted a shelf with ARVs inpic.twitter.com/KCqdjAlUhk\n\n Freeman (@freemanchari)May 5, 2025\n\nHe added: Next, some moron will post potholes in Victoria Falls and say baba Munangagwa road yashata Yet we have been talking about this for ten years and being castigated for it. This is why I say, when the time comes show no mercy! This whole situation felt like a case of closing the stable door after the horse has bolted.\n\nOne X user, MaZwangendaba, said that every time ordinary citizens raise concerns about poor public health services, they are often laughed at and scoffed at by Zanu Patriotic Front and some government officials, as if they are barking up the wrong tree.\n\nKana tichitaura tinonzi tirimadununu and labelled puppets of the west. They tell us its because of sanctions we asked for. I am glad you have seen what we will be talking about. Open the eyes of your comrades, she said.\n\nFormer Cabinet Minister Walter Mzembi, who himself may not be entirely off the hook considering his past role as a government official, echoed this sentiment. He said Machakaires acknowledgement of the dire situation in Zimbabwes public hospitals could be the first step towards tackling the long-standing health problems.\n\nA rare official acknowledgement of the dire situation in our Health Sector, this kind of public honesty is what solves our challenges, he wrote on his X account Monday.\n\nA rare official acknowledgement of the dire situation in our Health Sector , this kind of public  honesty is what solves our challenges@edmnangagwahttps://t.co/qVvj8Nyufc\n\n Dr Walter Mzembi (@waltermzembi)May 5, 2025\n\nFormer Local Government Minister Saviour Kasukuwere, who is also in self-imposed exile, said Machakaire had shown courage and bravery, qualities needed to tackle national problems.\n\nWe commend Minister Machakaire for his bold honesty and compassion. His recent statement highlights what many Zimbabweans already know: our public healthcare system is in crisis, and urgent action is needed. This is not just about politics. Its about people. About dignity. About saving lives, she said.\n\nSome even warned Machakaire that he might be skating on thin ice, potentially facing dismissal from the government for speaking the truth.\n\nI pray and hope you dont get fired for telling the truth about the disaster that is in our hospitals. Its so pathetic that our government has been focusing on things that should not be prioritised and leaving our Healthcare to decay, said one X user who identified as African Academia.\n\nIt appears Mnangagwas government is on an admission of failure overdrive after George Charambas recent admission that University of Zimbabwe lecturers on strike have a genuine grievance, pledging to take the matter up.\n\nThis comes after Machakaires urgent call for Mnangagwa to look into the collapsing health sector, suggesting a potential shift in how the government is handling public concerns.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on-e1746463851506.jpg",
            "description": "<p>By Staff Reporter Youth Empowerment Minister Tinoda Machakaire stirred the pot, Monday with his plea to President Emmerson Mnangagwa to urgently address the collapsing health care system. Machakaire’s admission that public hospitals are in desperate need of attention from Mnangagwa drew both praise and criticism. “I visited one of our public health institutions this morning</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-have-been-saying-this-for-years-machakaires-call-for-redress-of-collapsing-public-health-sector-stirs-up-a-storm/\">We have been saying this for years! – Machakaire’s call for redress of collapsing public health sector stirs up a storm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "06 May 2025"
        }
    ]
}