{
    "news": [
        {
            "title": "President Mnangagwa urges national development support on Heroes Day",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-urges-national-development-support-on-heroes-day/",
            "content": "Xinhua\n\nZimbabwean President Emmerson Mnangagwa on Monday urged citizens to support national development in honor of the fallen heroes during the liberation struggle while addressing the 45th Heroes Day celebration in Harare, the countrys capital.\n\nMnangagwa noted that to immortalize the sacrifices made by war heroes and heroines who lost their lives during the liberation struggle against colonial rule, the government is spearheading various economic development projects nationwide to enhance the quality of life for citizens.\n\nIndependence in 1980 brought about political independence, while the struggle for the economy remains ongoing, said Mnangagwa, adding that in honor of those who sacrificed their lives for the liberation of the country, all Zimbabweans should equally play a leading role in spurring economic growth.\n\nDespite challenges characterized by the effects of illegal sanctions, fluctuating international mineral commodity prices, and a fluid global trade environment, our economy is demonstrating remarkable resilience, said Mnangagwa.\n\nThe countrys bumper harvest in wheat, maize, and traditional grains, record levels in tobacco production, along with the rebound growth of the national herd and increased milk production, are testament to the hard work and perseverance of Zimbabweans, he said.\n\nWe, thus, celebrate farmers and stakeholders in the agriculture sector, who continue to be worthy custodians of the land which our heroes and heroines paid for with their precious blood, he added.\n\nHe said notable growth has also been recorded in the iron and steel sector, cement production, and food processing, among others.\n\nAs a nation richly endowed with mineral resources, we are determined to ensure that these translate into economic benefits for all citizens and empowerment of host communities, Mnangagwa added.\n\nHeroes Day is a public holiday in Zimbabwe, annually observed on the second Monday of August to pay tribute to fallen heroes.\n\nSenior government officials, diplomats, and families of fallen heroes also took part in the activity at a gathering at the National Heroes Acre, where honors and awards were conferred on living and departed heroes for their outstanding accomplishments in Zimbabwe.\n\nZimbabwean President Emmerson Mnangagwa addresses the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\nZimbabwean President Emmerson Mnangagwa (C) bows to a monument during the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\nPeople take part in the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12052650/ED-heroes.jpeg",
            "description": "<p> Xinhua Zimbabwean President Emmerson Mnangagwa on Monday urged citizens to support national development in honor of the fallen heroes during the liberation struggle while addressing the 45th Heroes Day celebration in Harare, the country’s capital. Mnangagwa noted that to immortalize the sacrifices made by war heroes and heroines who lost their lives during the liberation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-urges-national-development-support-on-heroes-day/\">President Mnangagwa urges national development support on Heroes Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "12 Aug 2025"
        },
        {
            "title": "Kourtney Kardashian-Baker shuts down pregnancy speculation with a side of sass",
            "url": "https://www.newzimbabwe.com/kourtney-kardashian-baker-shuts-down-pregnancy-speculation-with-a-side-of-sass/",
            "content": "IOL\n\nAmerican reality TV star, Kourtney Kardashian-Baker, has once again shut down rumours that she has a bun in the oven.\n\nThe Poosh founder shared a carousel of images on Instagram last Friday, giving fans a glimpse of her holiday-filled life with her family, when a fan commented that there are rumours that Kardashian-Baker is expecting another child.\n\nThe fan wrote: RUMOURS HAVE IT THAT YOURE PREGNANT KOURTNEY.\n\nThe 46-year-old clapped back and replied, Eating pancakes and jumping off cliffs, hinting that she would not be doing such strenuous activities if she were indeed pregnant, because that could harm her and the baby.\n\nPlay Video\n\nThis is not the first time that the media personality was rumoured to be expecting her second child with Travis Baker.\n\nJust last month, the mother of four was rumoured to be pregnant after she shared pictures from her holiday in Italy and included a picture of her in a bikini, which prompted fans to comment on her body, saying that she is expecting again.\n\nThe Lemme co-founder replied: Or breastfeeding, eating gelato, focaccia, pasta, not working out and living my best damn life, baby!\n\nThe Kardashians star and her husband welcomed Rocky, their first child together, in November 2023.\n\nShe also has three older children with her ex, Scott Disick: sons Mason, 15, Reign, 10, and daughter Penelope, 13.\n\nKardashian-Baker is by far the only celebrity to have been open about herpostpartumbody and not conforming to the snap-back culture that has gained popularity among celebrity moms and has also created certain notions and expectations for new moms.\n\nIn 2024, the reality TV starpenned a heart-warming letter to all the moms out thereabout the pressures of bouncing back after pregnancy.\n\nShe wrote: Dear new mommies, your body is beautiful at all stages. During pregnancy, as we are glowing and growing, postpartum, as we are healing and shrinking, and then that period I find the hardest as our bodies are still adjusting.\n\nShe added, And if youre breastfeeding, thats a whole other part of it. I try to be kind to myself as my body finds a new normal. The pressure put on us to bounce back when everything is new and different isnt realistic. Life is beautiful, you are beautiful.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12052432/kourtney-kardashian.webp",
            "description": "<p>IOL American reality TV star, Kourtney Kardashian-Baker, has once again shut down rumours that she has a bun in the oven. The Poosh founder shared a carousel of images on Instagram last Friday, giving fans a glimpse of her holiday-filled life with her family, when a fan commented that there are rumours that Kardashian-Baker is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kourtney-kardashian-baker-shuts-down-pregnancy-speculation-with-a-side-of-sass/\">Kourtney Kardashian-Baker shuts down pregnancy speculation with a side of sass</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "12 Aug 2025"
        },
        {
            "title": "Mars rock found in Niger sells for millions in New York – now the country wants answers",
            "url": "https://www.newzimbabwe.com/mars-rock-found-in-niger-sells-for-millions-in-new-york-now-the-country-wants-answers/",
            "content": "BBC\n\nBrazen! It is brazen! Prof Paul Sereno says down the phone line from Chicago.\n\nHe makes no effort to disguise his anger that a rare meteorite from Mars discovered two years ago in the West African nation of Niger ended up being auctioned off in New York last month to an unnamed buyer.\n\nThe palaeontologist, who has close connections with the country, believes it should be back in Niger.\n\nThis millions-of-years-old piece of the Red Planet, the largest ever found on Earth,fetched $4.3m (3.2m) at Sothebys. Like the buyer, the seller was kept anonymous.\n\nBut it is unclear if any of this money went to Niger.\n\nFragments of extraterrestrial material that have made their way to Earth have long inspired reverence among humans  some ending up as religious objects, others as curiosities for display. More recently, many have become the subject of scientific study.\n\nThe trade in meteorites has been compared to the art market, with aesthetics and rarity affecting the price.\n\nAt first, there was a sense of awe surrounding the public display of this extraordinary Martian find  less than 400 of the 50,000 meteorites discovered have been shown to come from our planetary neighbour.\n\nThe photographs taken at Sothebys of the 24.7kg (54lb) rock  appearing in the lights to glow silver and red  compounded this feeling.\n\nBut then some people started asking questions about how it ended up under the auctioneers hammer.\n\nNot least the government of Niger itself, which,in a statement, expressed doubts about the legality of its export, raising concerns about possible illicit international trafficking.\n\nReuters The meteorite, seen here in close-up, travelled some 225 million kilometres before crashing down to Earth\n\nSothebys strongly disputes this, saying the correct procedures were followed, but Niger has now launched an investigation into the circumstances of the discovery and sale of the meteorite, which has been given the scientific and unromantic name NWA 16788 (NWA standing for north-west Africa).\n\nLittle has been made public about how it ended up at a world-renowned auction house in the US.\n\nAnItalian academic articlepublished last year said that it was found on 16 November 2023 in the Sahara Desert in Nigers Agadez region, 90km (56 miles) to the west of the Chirfa Oasis, by a meteorite hunter, whose identity remained undisclosed.\n\nMeteorites can fall anywhere on Earth, but because of the favourable climate for preservation and the lack of human disturbance, the Sahara has become a prime spot for their discovery. People scour the inhospitable landscape stretching across several countries in the hope of finding one to sell on.\n\nAccording to the Italian article, NWA 16788, was sold by the local community to an international dealer and was then transferred to a private gallery in the Italian city of Arezzo.\n\nThe University of Florences magazine described the person as an important Italian gallery owner.\n\nA team of scientists led by Giovanni Pratesi, mineralogy professor at the university, was able to examine it to learn more about its structure and where it came from. The meteorite was then briefly on display last year in Italy, including at the Italian Space Agency in Rome.\n\nIt was next seen in public in New York last month, minus two slices that stayed in Italy for more research.\n\nSothebys said that NWA 16788 was exported from Niger and transported in line with all relevant international procedures.\n\nAs with everything we sell, all relevant documentation was in order at each stage of its journey, in accordance with best practice and the requirements of the countries involved.\n\nA spokesperson added that Sothebys was aware of reports that Niger is investigating the export of the meteorite and we are reviewing the information available to us in light of the question raised.\n\nProf Sereno, who founded the organisation NigerHeritage a decade ago, is convinced Nigerien law was broken.\n\nThe academic with the University of Chicago, who has spent years uncovering the countrys vast deposits of dinosaur bones in the Sahara, campaigns to get Nigers cultural and natural heritage  including anything that has fallen from outer space  returned.\n\nA stunning museum on an island on the River Niger that runs through the capital, Niamey, is being planned to house these artefacts.\n\nInternational law says you cannot simply take something that is important to the heritage of a country  be it a cultural item, a physical item, a natural item, an extraterrestrial item  out of the country. You know weve moved on from colonial times when all this was okay, Prof Sereno says.\n\nA series of global agreements, including under the UNs cultural organisation Unesco, have tried to regulate the trade in these objects. But,according to a 2019 studyby international law expert Max Gounelle, when it comes to meteorites, while they could be included, there remains some ambiguity about whether they are covered by these agreements. It is left to individual states to clarify the position.\n\nNiger passed its own law in 1997 aimed at protecting its heritage.\n\nProf Sereno points to one section with a detailed list of all the categories included. Mineralogical specimens are mentioned among the art works, architecture and archaeological finds but meteorites are not specifically named.\n\nIn its statement on the Sothebys sale, Niger admitted that it does not yet have specific legislation on meteorites  a line that the auction house also pointed out. But it remains unclear how someone was able to get such a heavy, conspicuous artefact out of the country without the authorities apparently noticing.\n\nAFP via Getty Images Meteorite hunters, like this one in Morocco, search the landscape for the space rocks\n\nMorocco has faced a similar issue with the huge number of meteorites  more than 1,000  found within its borders, which include a part of the Sahara.\n\nMore than two decades ago the country experienced what author Helen Gordon described as a Saharan gold rush, fuelled in part by laxer regulations and a more stable political environment than some of its neighbours.\n\nIn her recent book The Meteorites, she wrote that Morocco was one of the worlds greatest exporters of space rocks.\n\nProf Hasnaa Chennaoui Aoudjehane has spent much of the past 25 years trying to hold on to some of that extraterrestrial material for her country.\n\nIts a part of us, its a part of our heritage its part of our identity and its important to be proud of the richness of the country, the geologist tells the BBC.\n\nThe professor is not against the trade in meteorites but has been instrumental in the introduction of measures aimed at regulating the business. She admits though that the new rules have not been entirely successful in stemming the flow of the meteorites.\n\nIn 2011, Prof Chennaoui was responsible for gathering material in the desert from an observed meteorite fall that turned out to be from Mars.\n\nLater named the Tissint meteorite, it weighed 7kg in all, but now she says only 30g remain in Morocco. Some of the rest is in museums around the world, with the biggest piece on display in Londons Natural History Museum.\n\nReflecting on the fate of Nigers Martian meteorite, she says she was not surprised as it is something that Im living with for 25 years. Its a pity, we cannot be happy with this, but its the same state in all our countries.\n\nProf Sereno hopes that the Sothebys sale will prove a turning-point  firstly by motivating the Nigerien authorities to act and secondly if it ever sees the light of day in a public museum, [the museum] is going to have to deal with the fact that Niger is openly contesting it.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12051021/meteorite.webp",
            "description": "<p>BBC “Brazen! It is brazen!” Prof Paul Sereno says down the phone line from Chicago. He makes no effort to disguise his anger that a rare meteorite from Mars discovered two years ago in the West African nation of Niger ended up being auctioned off in New York last month to an unnamed buyer. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mars-rock-found-in-niger-sells-for-millions-in-new-york-now-the-country-wants-answers/\">Mars rock found in Niger sells for millions in New York – now the country wants answers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "12 Aug 2025"
        },
        {
            "title": "CAF approves National Sports Stadium for category two matches",
            "url": "https://www.newzimbabwe.com/caf-approves-national-sports-stadium-for-category-two-matches/",
            "content": "By Sports Reporter\n\nThe Confederation of African Football (CAF) has approved Zimbabwes National Sports Stadium to host category two international games.\n\nThis was revealed on Monday by the African football mother board, provided an update on homologated and non-homologated stadia around the continent.\n\nAlthough the National Sports Stadium is not yet in category one to host the Warriors international games, the ground qualified under category two, where it can host under-23, 20 and 17 AFCON qualifiers\n\nThe giant stadium is currently having a facelift so that it can host category one games. Bucket seats were fully furnished and new electronic turnstiles fitted.\n\nHowever, a few areas still need to tick the boxes when it comes to required standards, such as ablution facilities, changing rooms, among others.\n\nZimbabwe last hosted an international game on home ground in 2021 before it was banned by FIFA in 2022. Since its re-admission, the Warriors are yet to play a match on home soil.\n\nMeanwhile, the approval of the National Sports Stadium to host category two games means that CAF Champions League representatives Simba Bhora can play their home games at the National Sports Stadium.\n\nThe Shamva-based side is set to play Nsingizi Hotspurs from Eswatini in the first round of the preliminary stages next month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12045621/national-sports-stadium.jpg",
            "description": "<p>By Sports Reporter The Confederation of African Football (CAF) has approved Zimbabwe’s National Sports Stadium to host category two international games. This was revealed on Monday by the African football mother board, provided an update on homologated and non-homologated stadia around the continent. Although the National Sports Stadium is not yet in category one to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caf-approves-national-sports-stadium-for-category-two-matches/\">CAF approves National Sports Stadium for category two matches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "12 Aug 2025"
        },
        {
            "title": "Woman killed for turning down love proposal",
            "url": "https://www.newzimbabwe.com/woman-killed-for-turning-down-love-proposal/",
            "content": "By Staff Reporter\n\nTWO youths from Redcliff in Kwekwe have been arrested for fatally assaulting a 40-year-old woman for turning down advances from one of them.\n\nThe now deceased was identified as Rosemary Diana.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Kwekwe arrested Thembinkosi Ndlovu (22) and Nkosinomusa Moyo (24) in connection with a case of murder which occurred on August 10, 2025, at a bar at Mutegude Shops, Redcliff where Rosemary Diana (40) died, said Nyathi.\n\nThe suspects attacked the victim after she had rejected Moyos romantic advances.\n\nNdlovu struck the victim with a cooking stick allover the body while Moyo stabbed her with a knife on the back, added Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter TWO youths from Redcliff in Kwekwe have been arrested for fatally assaulting a 40-year-old woman for turning down advances from one of them. The now deceased was identified as Rosemary Diana. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in Kwekwe arrested Thembinkosi Ndlovu (22) and Nkosinomusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-killed-for-turning-down-love-proposal/\">Woman killed for turning down love proposal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "12 Aug 2025"
        },
        {
            "title": "UN experts urge Zimbabwe to make gender equality ‘lived reality’",
            "url": "https://www.newzimbabwe.com/un-experts-urge-zimbabwe-to-make-gender-equality-lived-reality/",
            "content": "APA News\n\nUnited Nations experts have called on Zimbabwe to take urgent action against child marriage and teenage pregnancy, warning that entrenched patriarchal norms continue to undermine the rights and futures of millions of girls.\n\nConcluding a formal visit, the UN Working Group on discrimination against women and girls urged the government to invest in girls education, safety and rights, stating that gender equality must become a lived reality rather than a constitutional aspiration.\n\nGender equality must be more than a promise on paper  it must become a lived reality for every woman and girl in Zimbabwe, the group said.\n\nThe experts noted that despite the governments efforts, persistent discrimination and entrenched patriarchal norms continue to deny girls their fundamental rights and limit their future opportunities.\n\nZimbabwe must actively confront and eradicate patriarchal attitudes that undervalue girls, creating a society which nurtures their potential as future leaders, innovators and changemakers.\n\nDespite the enactment of the Marriages Act (2022), which criminalises child marriage and sets 18 as the legal minimum age, no prosecutions have been recorded.\n\nThe experts revealed that 1.4 million women in Zimbabwe were married before age 18 and 241,000 before 15.\n\nTeenage pregnancy remains high at 23 percent, with 43 percent of adolescents becoming sexually active before 18.\n\nThe experts noted that girls face stigma, misinformation and limited access to youth-friendly reproductive health services, while many are forced to leave school, undermining their long-term well-being and independence.\n\nThey also raised alarm over child sexual abuse and gender-based violence, particularly affecting girls left behind by migrant parents, those with disabilities and members of religious sects.\n\nCalling for stronger enforcement and public awareness, the working group urged the Harare authorities to expand trauma-informed training for law enforcement and the judiciary, and to adequately fund shelters and one-stop centres, which they described as essential services and a core state responsibility.\n\nThe experts stressed the need to ensure that gender equality is embraced as a societal value that benefits all.\n\nGender equality is not a zero-sum goal  men and boys also stand to benefit significantly from a more just and equal society, they said.\n\nThe final report of the visit will be presented to the UN Human Rights Council in June 2026.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04025833/Teenage-Pregnancy.png",
            "description": "<p>APA News United Nations experts have called on Zimbabwe to take urgent action against child marriage and teenage pregnancy, warning that entrenched patriarchal norms continue to undermine the rights and futures of millions of girls. Concluding a formal visit, the UN Working Group on discrimination against women and girls urged the government to invest in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-experts-urge-zimbabwe-to-make-gender-equality-lived-reality/\">UN experts urge Zimbabwe to make gender equality ‘lived reality’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "12 Aug 2025"
        }
    ]
}