{
    "news": [
        {
            "title": "You can not aspire to wear second-hand clothes – Harare Mayor says following government ban on their import and sale",
            "url": "https://www.newzimbabwe.com/you-can-not-aspire-to-wear-second-hand-clothes-harare-mayor-says-following-government-ban-on-their-import-and-sale/",
            "content": "By Staff Reporter\n\nWHILE the government has faced backlash over the ban on the importation and sale of second-hand clothing in cities, Harare Mayor Jacob Mafume has backed the move, saying the capital cannot be turned into a city of bales.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, earlier this week reaffirmed a ban on second-hand clothes, known asbhero,alongside night vending.\n\nSpeaking during a full council session on Thursday, Mafume stated that Harare cannot be sustained by second-hand clothes.\n\nIt is a serious dichotomy. We can not have a society that aspires to wear second-hand clothes. It is a serious oxymoron; we have cotton we can not make new clothes. So we wait for the cotton to be exported and clothes to be manufactured, and they are worn before we wear them.\n\nOn the other hand, we have some in our midst wearing second-hand clothes. We must assist each other as a society. We need to deal with it in a sensitive manner, but at the same time, we can not sustain a city based on second-hand clothes.\n\nDespite their importation ban by the Zimbabwe Revenue Authority (ZIMRA), second-hand clothes have provided relief for cash-strapped individuals due to their affordability.\n\nThe ban on the importation of second-hand clothes was implemented by ZIMRA in 2015, but due to porous borders, they continue to flood the streets, being sold at cheaper prices.\n\nIn Harare, second-hand clothes are also sold at night, a practice the government is also banning.\n\nThe Combined Harare Residents Association (CHRA) has since condemned the move as autocratic, particularly in an economy reliant on the informal sector.\n\nThe Combined Harare Residents Association (CHRA) notes with deep concern the position taken by the Ministry of Local Government on banning the selling of second-hand clothing and street vending\n\nThis intervention by the Ministry of Local Government is a clear reflection of the failure of the implementation of devolution within the local authority, the decision was made from an autocratic position\n\nThe City of Harare has to run the operations within the City in accordance with Section 264 of the Constitution, the procedure should be done in accordance with the Constitution.\n\nThe informal sector has for years been complementing the formal sector as there has been an emergence of formal businesses operating 24/7 in the CBD over the years, reads the statement by CHRA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19190808/Vendors-14-scaled.jpg",
            "description": "<p>By Staff Reporter WHILE the government has faced backlash over the ban on the importation and sale of second-hand clothing in cities, Harare Mayor Jacob Mafume has backed the move, saying the capital cannot be turned into a “city of bales”. The Minister of Local Government and Public Works, Daniel Garwe, earlier this week reaffirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-can-not-aspire-to-wear-second-hand-clothes-harare-mayor-says-following-government-ban-on-their-import-and-sale/\">You can not aspire to wear second-hand clothes – Harare Mayor says following government ban on their import and sale</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "08 Aug 2025"
        },
        {
            "title": "Doctors Without Borders calls for urgent action as anti-migrant groups block access to essential medical care for foreigners in South Africa",
            "url": "https://www.newzimbabwe.com/doctors-without-borders-calls-for-urgent-action-as-anti-migrant-groups-block-access-to-essential-medical-care-for-foreigners-in-south-africa/",
            "content": "By Thandiwe Garusa\n\nDOCTORS Without Borders (MSF) in South Africa has raised serious concerns over the ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring countrys already overstretched public resources.\n\nThe targeted foreigners includeZimbabweans, who make up a large portion of undocumented immigrants.\n\nHowever,evensome ofthoseZimbabweanswho are legally living and working in South Africa are also being denied access to healthcare.\n\nAnti-migrant groups have camped outside dozens of clinics and hospitals in Gauteng, preventing non-South Africans from entering public health facilities to seek medical care regardless of their legal documentation status.\n\nIn a statement issued Thursday, MSF warned that the lives of pregnant women, children, people living with HIV, and chronic patients are now at risk, with some having gone weeks without the medication they need, urging authorities to put an end to the xenophobic acts.\n\nDoctors Without Borders (MSF) is deeply concerned by the persistent and systematic physical blocking of non-South Africans from accessing healthcare, including pregnant women, people living with HIV, chronic patients and children, particularly in Gauteng and KwaZulu-Natal.\n\nWe call for immediate action by the National Department of Health (NDoH) and relevant Provincial Departments of Health to guarantee the right of access to healthcare for all, as enshrined in the countrys Constitution and the National Health Act, the statement reads.\n\nMSF also noted that some patients who tried to retrieve their medical files from clinics in an effort to seek care elsewhere were unsuccessful, leaving them uncertain about their next steps.\n\nOthers, lacking prescriptions to refill their medication, are now unable to purchase the medicine they need from pharmacies.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa DOCTORS Without Borders (MSF) in South Africa has raised serious concerns over the ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring country’s already overstretched public resources. The targeted foreigners include Zimbabweans, who make up a large portion of undocumented immigrants. However, even some of those Zimbabweans who are legally</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctors-without-borders-calls-for-urgent-action-as-anti-migrant-groups-block-access-to-essential-medical-care-for-foreigners-in-south-africa/\">Doctors Without Borders calls for urgent action as anti-migrant groups block access to essential medical care for foreigners in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "08 Aug 2025"
        },
        {
            "title": "Socialite Enchantress in court over witchcraft claims – blames ‘malicious fabrication’ on bitter former maid",
            "url": "https://www.newzimbabwe.com/socialite-enchantress-in-court-over-witchcraft-claims-blames-malicious-fabrication-on-bitter-former-maid/",
            "content": "By Mary Taruvinga\n\nSocial media personality Melody Natalie Mhandu, popularly known as Enchantress, was on Thursday hauled before a Mbare magistrate accused of casting a spell on her former friend Tatenda Butau.\n\nMhandu (34) was charged with engaging in practices commonly associated with witchcraftas defined in section 98 (i) of the Criminal Law Codification and Reform Act Chapter 9.23.\n\nShe was released unconditionally after briefly appearing in court.\n\nThe state alleged that on August 4 and at Churu Farm, Mhandu unlawfully committed the offence by writing Tatendas name and others on a red cloth which she wrapped around a knife and sprinkled snuff powder before burying it under amuhachatree in a bid to cast a spell on her.\n\nAccording to State papers, Mhandu did this with the help of a traditional healer, Christine Matashu, also known as Manjenjenje.\n\nHer former helper, Elizabeth Mharirire, wrote a statement telling the court that Mhandu asked her to accompany her to see Manjenjenje when the ritual was performed.\n\nMharirire said she later found snuff powder in her room and bathroom before confronting Mhandu about it.\n\nThe two had an altercation before she told Mhandu that she could no longer work for her, given the circumstances.\n\nThe maid later told Butau that her former employer had bewitched her.\n\nShe then accompanied her and her boyfriend to the spot where Mhandu allegedly performed the rituals.\n\nButau dug up the cloth and knife before she confronted Mhandu.\n\nThe matter was also reported to the police.\n\nMhandu denies the allegations.\n\nThrough her lawyer, Mhandu said she was never at Churu Farm on August 4 as alleged.\n\nShe will specifically deny putting Tatenda Butaus name or any other name for that purpose on a red cloth as alleged or at all.\n\nShe will deny having wrapped any red cloth with a dagger and snuff powder and burying it underground as alleged or at all.\n\nShe will deny having any intention to harm or realising the real risk or possibility of harming any person as alleged or at all.\n\nShe will tell the court that she does not know any ritualist by whatever name. She never visited any either alone or with any other person as alleged or at all.\n\nShe did not cast any spell on anyone as alleged or at all, read her defence outline.\n\nThe lawyer said his client will tell the court that the charges are a malicious fabrication of a vindictive former maid who is manipulating the current bad blood between the accused and the complainant.\n\nThe former maid had been relieved of her duties and is bitter about it.\n\nMhandu also said Butau filed the current report as a social media blitz against her and for the purpose of countering a report she made against her at Highlands Police Station on 4 August 2025 under RRB Number 6440490.\n\nShe will also state that the allegations against her do not amount to any practice associated with witchcraft.\n\nFurther, the allegations are vague and embarrassing. They are only meant as a public show for the purposes of causing embarrassment and humiliation of the accused, said the lawyer, praying that the court returns a verdict of not guilty and acquits her of any wrongdoing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07153744/mhandu.png",
            "description": "<p>By Mary Taruvinga Social media personality Melody Natalie Mhandu, popularly known as Enchantress, was on Thursday hauled before a Mbare magistrate accused of casting a spell on her former friend Tatenda Butau. Mhandu (34) was charged with engaging in practices commonly associated with witchcraft as defined in section  98 (i) of the Criminal Law Codification and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/socialite-enchantress-in-court-over-witchcraft-claims-blames-malicious-fabrication-on-bitter-former-maid/\">Socialite Enchantress in court over witchcraft claims – blames ‘malicious fabrication’ on bitter former maid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "08 Aug 2025"
        },
        {
            "title": "WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says",
            "url": "https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/",
            "content": "AP\n\nWhatsApp has taken down 6.8 million accounts that were linked to criminal scam centers targeting people online around the world, its parent companyMetasaid this week.\n\nThe account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts tocrack down on scams. In a Tuesday announcement, Meta said it was also rolling new tools on WhatsApp to help people spot scams  including a new safety overview that the platform will show when someone who is not in a users contacts adds them to a group, as well as ongoing test alerts to pause before responding.\n\nScams arebecoming all too commonand increasingly sophisticated in todays digital world  withtoo-good-to-be-trueoffers and unsolicited messages attempting to steal consumers information or money filling our phones, social media and other corners of the internet each day. Meta noted that some of the most prolific sources of scams are criminal scam centers, which oftenspan from forced laboroperated by organized crime  and warned that such efforts often target people on many platforms at once, in attempts to evade detection.\n\nThat means that a scam campaign may start with messages over text or a dating app, for example, and then move to social media and payment platforms, the California-based company said.\n\npointed to recent scam efforts that it said attempted to use its own apps  as well as TikTok, Telegram and AI-generated messages made using ChatGPT  to offer payments for fake likes, enlist people into a pyramid scheme and/or lure others into cryptocurrency investments. Meta linked these scams to a criminal scam center in Cambodia  and said it disrupted the campaign in partnership with ChatGPT makerOpenAI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07033548/Whatsapp-1.webp",
            "description": "<p>AP WhatsApp has taken down 6.8 million accounts that were “linked to criminal scam centers” targeting people online around the world, its parent company Meta said this week. The account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts to crack down on scams. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/\">WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "08 Aug 2025"
        }
    ]
}