{
    "news": [
        {
            "title": "Implats seeks meeting with Mnangagwa over Zimbabwe forex rules",
            "url": "https://www.newzimbabwe.com/implats-seeks-meeting-with-mnangagwa-over-zimbabwe-forex-rules/",
            "content": "MiningMX\n\nIMPALA Platinum (Implats) is seeking a meeting with Zimbabwean president Emmerson Mnangagwa to discuss foreign exchange retention rules that make it increasingly difficult for the miner to invest in the southern African country.\n\nThe Reserve Bank of Zimbabwe recently increased the amount of dollar receipts it retains, which potentially increases the cost of goods and services that have to be procured in the local currency.\n\nWe are concerned about the need for increased access to forex by the Zimbabwean government. It is something that needs to be discussed between our company and the government, said Nico Muller, CEO of Implats.\n\nIt is something that is on the agenda for us to have a discussion with the finance minister [Mthuli Ncube] as well as the principle [Mnangagwe]. It is not something I want to scrub under the carpet.\n\nImplats 85% owned Zimplats borrowed money in order to pay for capital goods because the cash it was receiving from the dollar receipts fell short, said Meroonisha Kerber, Implats CFO in a presentation of the firms interim results on Thursday.\n\nFrom an efficiency point of view it makes sense to borrow there [in Zimbabwe] as well as from a discipline perspective because, as we have said, all our operations have to fund all of their own capital, she said.\n\nImplats said earlier today that it was assessing its portfolio in the event that poor platinum group metal prices persisted. Muller identified the firms Canadian mine Lac des Iles (Impala Canada) and Marula as the most vulnerable assets.\n\nLac des Iles would be run down as the firm had last year targeted its high margin ounces, reducing its reserve life. Regarding Marula, a decision has to be made in two years regarding a second phase expansion which would access up to 24 years of reserves. It first, however, had to become cash flow positive, said Muller.\n\nMuller said most of the cost cuts, including job losses, had been done with little now to reduce in overall corporate overheads. We are now at portfolio decisions, he said. There were several shafts in the firms flagship Rustenburg division that were also sailing close to the wind, he told media earlier in the day.\n\nImplats has invested heavily in the processing capacity of its Zimplats. Said Muller: We have always been positive about our investment orientation with regards to Zimbabwe. We do believe the Great Dyke offers the best available resource out there.\n\nWe have had a very constructive, healthy, long-standing relationship with the government and that has not necessarily changed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/15101253/IMG_20230614_124141-scaled.jpg",
            "description": "<p>MiningMX IMPALA Platinum (Implats) is seeking a meeting with Zimbabwean president Emmerson Mnangagwa to discuss foreign exchange retention rules that make it increasingly difficult for the miner to invest in the southern African country. The Reserve Bank of Zimbabwe recently increased the amount of dollar receipts it retains, which potentially increases the cost of goods</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/implats-seeks-meeting-with-mnangagwa-over-zimbabwe-forex-rules/\">Implats seeks meeting with Mnangagwa over Zimbabwe forex rules</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Komani: Police nab bus driver en route to Zimbabwe with millions worth of abalone",
            "url": "https://www.newzimbabwe.com/komani-police-nab-bus-driver-en-route-to-zimbabwe-with-millions-worth-of-abalone/",
            "content": "Komani Karoo Express\n\nKomani police arrested a 48-year-old bus driver in the Komani CBD on Sunday, February 23, while en route to Zimbabwe. The driver was found in possession of 26 boxes of abalone valued at R2 million.\n\nReporting on the incident, police spokesperson Captain Yolisa Mgolodela stated that the Queenstown dog unit (K9) received information about a bus from East London heading to Zimbabwe with tower batteries.\n\nAccording to her, following this tip-off, the bus was intercepted in the Komani CBD and searched.\n\nUpon searching, five solar batteries worth R25,000, six solar panels valued at R12,000, four tower batteries worth R160,000, inverters worth R200,000, and 10 boxes of medication were also recovered, she added.\n\nThe 48-year-old driver of the bus was arrested on charges of possession of abalone, suspected stolen property, contravention of the Medicines Act 101 of 1965, contravention of the Marine Living Resources Act 18 of 1998, and damage to essential infrastructure.\n\nThe suspect is expected to appear before the Komani Magistrates Court today, February 25.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06135746/Handcuffs.jpg",
            "description": "<p>Komani Karoo Express Komani police arrested a 48-year-old bus driver in the Komani CBD on Sunday, February 23, while en route to Zimbabwe. The driver was found in possession of 26 boxes of abalone valued at R2 million. Reporting on the incident, police spokesperson Captain Yolisa Mgolodela stated that the Queenstown dog unit (K9) received</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/komani-police-nab-bus-driver-en-route-to-zimbabwe-with-millions-worth-of-abalone/\">Komani: Police nab bus driver en route to Zimbabwe with millions worth of abalone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Zimbabwean cataract patients regain sight through “Bright Journey” program",
            "url": "https://www.newzimbabwe.com/zimbabwean-cataract-patients-regain-sight-through-bright-journey-program/",
            "content": "Xinhua\n\nWith her vision restored after a successful cataract surgery, 80-year-old Mariya Sangare beamed with joy as she prepared to embrace a new chapter in life, thanks to a team of Chinese doctors.\n\nI can now see everything clearly. There is nothing I cannot see, Sangare said at the official launch of the Bright Journey program on Wednesday at the Parirenyatwa Group of Hospitals in Harare, the capital of Zimbabwe.\n\nSangare is one of 600 Zimbabwean patients benefiting from the China-aided program, which provides free cataract surgeries.\n\nA team of 12 specialists from Chinas Hunan Provincial Peoples Hospital has been carrying out the surgeries under the program, which began on Feb. 12. The Chinese doctors are highly skilled, and we are very happy, Sangare said.\n\nFor patients like Sangare, whose lives were hindered by blurred vision, the initiative offers a renewed sense of independence and hope.\n\nThis initiative has helped me a lot. My grandchildren can now eat peanut butter from the peanuts I grow. I could not farm this year because of my cataracts, she said.\n\nCosmas Chipengo, a 25-year-old recipient of the surgery, said restoring his eyesight means he can now return to work after seven months.\n\nI want to thank the Chinese doctors because we could not afford the medical expenses. This program has done a great thing for us, he told Xinhua.\n\nZimbabwean Minister of Health and Child Care Douglas Mombeshora said that preventable blindness from cataracts remains a major public health issue in the country, but the Bright Journey program is helping address the challenge.\n\nThis moment represents not merely the commencement of a medical project, but the beginning of a bright journey, an important initiative that seeks to restore sight to 600 Zimbabweans, empowering them to reclaim their autonomy and reintegrate fully into society, Mombeshora said.\n\nAccording to the World Health Organization, an estimated 125,000 people in Zimbabwe were living with blindness in 2021, with 62,500 cases caused by cataracts. Due to the high cost of treatment, many low-income individuals, particularly in rural areas, are unable to access care, leading to preventable blindness.\n\nSpeaking at the launch, Chinese Ambassador to Zimbabwe Zhou Ding said that the program not only reflects Chinas commitment to global health cooperation but also strengthens the deep and enduring friendship between China and Zimbabwe.\n\nThis year marks both the 45th anniversary of diplomatic relations between China and Zimbabwe and the 40th anniversary of their medical cooperation.\n\nWith the launch of this program, we add another milestone to our anniversary celebrations, Zhou said.\n\nThe impact of the program extends beyond restoring sight as it enhances Zimbabwes medical expertise in eye surgeries and fosters knowledge exchange between Chinese and Zimbabwean medical professionals, the ambassador added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/27163602/chinese-doctor.png",
            "description": "<p>Xinhua With her vision restored after a successful cataract surgery, 80-year-old Mariya Sangare beamed with joy as she prepared to embrace a new chapter in life, thanks to a team of Chinese doctors. “I can now see everything clearly. There is nothing I cannot see,” Sangare said at the official launch of the “Bright Journey”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-cataract-patients-regain-sight-through-bright-journey-program/\">Zimbabwean cataract patients regain sight through “Bright Journey” program</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Son loses case against parents over move to Africa",
            "url": "https://www.newzimbabwe.com/son-loses-case-against-parents-over-move-to-africa/",
            "content": "BBC\n\nA 14-year-old boy has lost a court case he brought against his own parents after they moved him from London to Ghana to go to boarding school.\n\nThe boy, described in court as shy, articulate, a keen cook and footballer, said his parents had tricked him into going to Africa, saying it was to visit a sick relative.\n\nHe said had he known he was being sent to boarding school there would have been no way I would have agreed to it.\n\nBut the High Court in London also heard his parents were worried he was being groomed into criminal activity.\n\nIn a written statement to the court, he said: I feel like I am living in hell. I really do not think I deserve this and I want to come home, back to England, as soon as possible.\n\nIn his judgement, High Court judge Mr Justice Hayden said he recognised that this is, in many ways, both a sobering and rather depressing conclusion.\n\nHe said that he was satisfied that the parents wish for their son to move to Ghana was driven by their deep, obvious and unconditional love.\n\nThe boy was at risk of suffering greater harm returning to the UK, he said.\n\nHe said that the boys parents believe and in my judgement with reason that their son has at very least peripheral involvement with gang culture and has exhibited an unhealthy interest in knives.\n\nThe boys father told the judge the couple did not want their son to be yet another black teenager stabbed to death in the streets of London.\n\nThe boy, who had lived in the UK since birth, said he was mocked and never settled in at the school in Ghana.\n\nHe said he could also barely understand what was going on and I would get into fights.\n\nThe boy wrote that he was so scared and desperate that he emailed the British High Commission in Accra as well as contacting the charity Children and Family Across Borders, who it is believed put him in touch with lawyers at the International Family Law Group.\n\nI am from London, England, and I want to go back home, he wrote.\n\nHe said he had been mistreated at the school, adding: Im begging to go back to my old school.\n\nHowever the High Court heard that the boys parents had sent him because they feared for his safety in London.\n\nIn a statement, his mother said sending him to Africa was not a punishment but a measure to protect him.\n\nShe referred to the murder of Kelyan Bokassa, the 14-year-old boy who was stabbed to death on a bus in Woolwich in January. That was every parents worst nightmare, she said.\n\nShe said she did not believe her son would survive in the UK and did not want to be part of her sons destruction.\n\nRebecca Foulkes, representing the boys father, said the boy met 11 of the points on a checklist produced by the childrens charity NSPCC to indicate whether a child might have joined a gang or was being criminally exploited.\n\nThat included being absent from school, having unexplained money, buying new things, and carrying weapons.\n\nShe said it was not only the parents who were worried.\n\nHis school claimed it had suspicions about him engaging in criminal activities and had observed him in expensive clothes and with mobile phones.\n\nThe boy said he had never been part of a gang, nor involved in gangs in any way. He said he does not know anyone involved in a gang and he does not carry a knife.\n\nHe acknowledged in his statements that my behaviour wasnt the best and said he thought that was the reason his parents sent him to Africa.\n\nThe case centred on the question of parental responsibility, and whether the parents acted unlawfully by sending their son to boarding school without his consent.\n\nIn a statement issued after the judgement, his parents said: This has been a really difficult time for us all.\n\nThey added: Our priority has always been protecting our son and our focus now is on moving forward as a family.\n\nJames Netto from the International Family Law Group, who represented the boy, said the court judgement had been a real shock to the teenager.\n\nHe was obviously incredibly disappointed, incredibly upset and is considering his next steps carefully.\n\nThe boys barrister, Deirdre Fottrell KC, pointed out the school was not simply far from home  but a completely different jurisdiction.\n\nThe boy wrote that his education was suffering. He felt the Ghanaian classes were not as challenging as those in his English school, and he had been out of formal education entirely since last summer, studying online.\n\nHe wrote: I want to have an education again and grow up like a normal person. I feel like my brain is hurt here. I feel like now I am dumber than people I used to be smarter than.\n\nThe boys father has recently visited him in Africa, and he told the court that he and his son had got on well.\n\nHe said he would like his son to remain in Ghana, and said they visited a different boarding school where the boy could be considered for a place.\n\nThe father said they were both very impressed.\n\nHowever, questioned by Ms Fottrell, he acknowledged there was no place in that school until September, and that his son had not said he wanted to go there.\n\nThe boys solicitor said he had recently seen a rise in similar cases where teenagers were trying to return to the UK.\n\nTeenagers are often placed in exceptionally challenging or vulnerable situations, and are now beginning to turn to the court for protection, Mr Netto said.\n\nHe said he had seen cases where in their parents eyes young people were falling in with the wrong crowd or are adopting what their parents see as unorthodox or challenging behaviours.\n\nFollowing the judgement, he added: We have already received enquiries from young people in exactly the same situation as this young man.\n\n",
            "image_url": null,
            "description": "<p>BBC A 14-year-old boy has lost a court case he brought against his own parents after they moved him from London to Ghana to go to boarding school. The boy, described in court as shy, articulate, a keen cook and footballer, said his parents had tricked him into going to Africa, saying it was to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/son-loses-case-against-parents-over-move-to-africa/\">Son loses case against parents over move to Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "You cannot be on national duty every week – ministers under fire for evading Parliament, failing to respond to policy questions",
            "url": "https://www.newzimbabwe.com/you-cannot-be-on-national-duty-every-week-ministers-under-fire-for-evading-parliament-failing-to-respond-to-policy-questions/",
            "content": "By Anna Chibamu\n\nA number of cabinet ministers are under fire for not participating in Parliament business, a concern that has been raised by Speaker Jacob Mudenda.\n\nDuring Wednesdays Question and Answer (Q &A) session, Mudenda revealed that quite a number of cabinet ministers had given apologies on the pretext of being on national duty, something he said should be investigated.\n\nThe Q & A session is one of the most important Parliament business schedules where the public gets answers to policy questions asked by their constituency representatives (MPs) from cabinet ministers.\n\nIn recent years, cabinet ministers and the two VPs have evaded the session, leaving citizens without crucial information needed for developments sake.\n\nSeveral MPs have raised their concerns since the previous Parliament until now (10th Parliament), with the Speaker at one point having threatened to report culprits to President Emmerson Mnangagwa.\n\nAfter listening to this, there are quite clear apologies that have been very consistent to you. And my suspicion is that these ministers who make apologies cannot be on national duty every week.\n\nI am therefore directing the truck and the staff to make a proper analysis of those ministers who have been consistently telling their apologies, said Mudenda.\n\nHe added, And such apologies do not seem to answer that, actually. And where you have deputy ministers, again, consistently accepting themselves as an apology, that cannot be accepted. Second, in terms of the Constitution, Provisional Section 107, Subsection 2, it is very clear that every Vice President, minister, and deputy minister must attend parliament and parliamentary committees in order to answer questions concerning matters for which he or she is collectively or individually responsible.\n\nChiwenga and Mohadi rarely come to Parliament during the Q and A session.\n\nHe went on, The challenges government is facing and what government is doing about those challenges. And that erodes public trust in the government of the day. We cannot afford to miss that golden opportunity.\n\nWe should not. And above all, it is the taxpayer who shoulders the responsibilities of us being in our offices. And that must be respected.\n\nThe Speaker highlighted that some important written questions had not been answered since 2024 to date.\n\nSaid Mudenda, And the apology must be taken sooner rather than later. Thats the first observation. The second observation is that when His Excellency addressed the cabinet, the 25th cabinet session, he made a very telling statement in which he was appealing to all the ministers and their deputies to perform in terms of their contribution on this.\n\nI have been analysing questions, written questions, which have not been attended to. And I will go through them. A question to the Minister of Industry and Commerce (Mangaliso Ndlovu). One question has been outstanding since the beginning of the programme.\n\nThen we have three questions outstanding from the Minister of Lands, Agriculture, Fisheries, Water, and Rural Development. Outstanding since 27 November 2024 up to February 2012, 2025.\n\nThen we have six questions that have not been attended to by the honourable Minister of Health and Childcare (Douglas Mombeshora) from 16 October 2024 to 12 February 2025. Another six questions that have not been attended to since 16 October 2024 from the Minister of Public Services and Social Welfare up to 12 February 2025.\n\nThen we have 11 questions that have not been attended to by the Minister of Finance, Economic Development and Investment Promotion (Mthuli Ncube) from 16 October 2024 right up to 12 February 2025.\n\nAnd so all the questions are outstanding. I have analysed them, and then the Minister of Finance has seven questions outstanding, prepared since 16 October 2024 up to 12 February 2025.\n\nThree questions meant for Foreign Affairs Ministers then Fredrick Shava now headed by Amon Murwa) prepared from 30 October 2024 up to 12 February 2025.\n\nThere were three questions for the Minister of Local Government and Public Works ( Daniel Garwe)\n\nAs he continued with his list, Mudenda said he was doing this analysis in order to demonstrate that Parliament owes it to the public.\n\nWe owe it to Parliament that these questions of national interest must be dealt with and give the opportunity for other ministers, again as I said, to shine on government policy and indicate to the world that something is happening in spite of the Secretarys concerns.\n\nl hope and trust I will not be forced to analyse again such reports.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/13200646/Jacob-Mudenda-.jpg",
            "description": "<p>By Anna Chibamu A number of cabinet ministers are under fire for not participating in Parliament business, a concern that has been raised by Speaker Jacob Mudenda. During Wednesday’s Question and Answer (Q &A) session, Mudenda revealed that quite a number of cabinet ministers had given apologies on the pretext of being on national duty,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-cannot-be-on-national-duty-every-week-ministers-under-fire-for-evading-parliament-failing-to-respond-to-policy-questions/\">You cannot be on national duty every week – ministers under fire for evading Parliament, failing to respond to policy questions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Africa’s medical system risks ‘collapse in next few years’, warns health leader",
            "url": "https://www.newzimbabwe.com/africas-medical-system-risks-collapse-in-next-few-years-warns-health-leader/",
            "content": "Health services in Africaare at risk of collapse in the next few years due to soaring chronic diseases, a senior public health leader has warned.\n\nForeign aid to Africa has been focused on infectious diseases, leaving conditions such as cancer and diabetes to escalate, said Dr Githinji Gitahi, group CEO of Amref Health Africa.\n\nIn sub-Saharan Africa, non-communicable diseases (NCDs), including hypertension, diabetes and heart diseaseaccountedfor 37% of deaths in 2019, up from 24% in 2000. They areforecast to becomethe leading cause of death in the region by 2030  driven by factors such as unhealthy western-style diets, less active lifestyles and air pollution.\n\nAid is not charity and will inevitably follow donor countries own interests such as stopping infectious diseases that could spread overseas, said Gitahi, who called for Africas leaders to step up their own work on controlling NCDs.\n\nGitahi spoke to the Guardian at the Global NCD Alliance Forum in Kigali,Rwanda, earlier this month, a gathering of more than 700 delegates from 89 countries.\n\nThe challenge is vast, according to Gitahi. Africa has a big risk of collapse of health systems in the next few years because of NCDs [] 50% of all admissions in a typical African hospital are NCDs, yet 80% of NCD care is out of pocket. And governments dont have money to actually take care of NCDs.\n\nThe blame lies with multinational corporations chasing profits, he said, and with governments failing to bring in regulations to put a brake on their activities. Politicians think about the next election, he said. This issue is about the next generation.\n\nGitahi, from Kenya, said global health and foreign aid spending had historically focused on diseases that could affect the donors themselves.Less than 3%of development spending for health goes to NCDs.\n\nThat is why there is so much focus on TB, HIV, because when you keep HIV low in Kenya, you keep it out of your country because people travel, and people carry diseases, he said. But for cancer, for hypertension, for diabetes  thats non-infectious.\n\nThe people who should care about that are their governments because [NCDs] are taking away people from active social and economic participation. Because the governments dont have enough money [] it is likely to continue being a neglected problem.\n\nThe forums delegates were meeting as a result of decisions by the US administration tofreeze much of its overseas aid spendingand to issue stop work orders to current programmes. Amrefs work has been affected, Gitahi said.\n\nWe do about $250m [197m] of work a year [] about $50m of that is actually US government partnerships, he said, in areas including maternal and child health, HIV work and laboratory and health system strengthening.\n\nSome Amref staff have been placed on unpaid leave, Gitahi said, though he was optimistic that some of the work will restart after the90-day review period announced by Donald Trumps officials.\n\nWe hope that at the end of it, they will continue with programming, as they say, thats aligned to their foreign policy, but actually protects communities and community lives and protects Americans themselves, Gitahi said. I keep saying aid is not charity. Aid is strategic investment by a country to protect its own internal interests. Thats what it has always been.\n\nAfrican governments will need to become more efficient and to tackle corruption, he suggested, and to embrace taxation of unhealthy goods, such as tobacco, alcohol and sugar, with the proceeds earmarked for health programmes. They will also need to work on the prevention of ill health, Gitahi said, suggesting they copy and paste regulations from western countries that ban things such as the advertising of foods high in sugar, salt or fat to children.\n\nUS funding accounts for half of all development assistance in Africa, he said, or $6.5bn out of $13bn. African governments will not be able to completely replace lost funding, Gitahi said, because their economies are not large enough. It may mean reframing goals to provide universal health care to cover 100% of the poor rather than the entire population.\n\nAfrica cannot raise enough money from its fiscal space, from its GDP, to actually take care of all social services, he said. Africa needs solidarity.\n\nIn the end, the international community should see that solidarity was important for global security, he said. When you have a weak health system in any country, it is like having an insecure airspace in any country. That [poses] a risk to the entire world.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/27185628/Screenshot-2025-02-27-at-20.56.02.png",
            "description": "<p>The Guardian Health services in Africa are at risk of “collapse in the next few years” due to soaring chronic diseases, a senior public health leader has warned. Foreign aid to Africa has been focused on infectious diseases, leaving conditions such as cancer and diabetes to escalate, said Dr Githinji Gitahi, group CEO of Amref Health</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africas-medical-system-risks-collapse-in-next-few-years-warns-health-leader/\">Africa’s medical system risks ‘collapse in next few years’, warns health leader</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Gene Hackman and his wife found dead at their home",
            "url": "https://www.newzimbabwe.com/gene-hackman-and-his-wife-found-dead-at-their-home/",
            "content": "BBC\n\nOscar-winning US actor Gene Hackman, his wife Betsy Arakawa, and their dog have been found dead at their home in Santa Fe, New Mexico.\n\nIn a wide-ranging career spanning more than six decades, Hackman won two Academy Awards for his work on The French Connection and Unforgiven.\n\nA statement from the Santa Fe County Sheriff in New Mexico said: We can confirm that both Gene Hackman and his wife were found deceased Wednesday afternoon at their residence on Sunset Trail.\n\nThis is an active investigation  however, at this time we do not believe that foul play was a factor.\n\nHackman was 95, and his wife  a classical pianist  63.\n\nHe won the best actor Oscar for his role as Jimmy Popeye Doyle in William Friedkins 1971 thriller The French Connection, and another for best supporting actor for playing Little Bill Daggett in Clint Eastwoods Western film Unforgiven in 1992.\n\nA relative latecomer to Hollywood, Hackmans breathrough came in his thirties, when he was nominated for an Oscar for portraying Buck Barrow in 1967s Bonnie and Clyde  opposite Warren Beatty and Faye Dunaway  and again for I Never Sang for My Father in 1970.\n\nBoth films saw him recognised in the supporting actor category. He was also nominated for best leading actor in 1988 for playing the agent in Mississippi Burning.\n\nThe Santa Fe County Sheriffs office said: On 26 February, 2025, at approximately 1:45pm, Santa Fe County Sheriffs deputies were dispatched to an address on Old Sunset Trail in Hyde Park where Gene Hackman, his wife Betsy Arakawa, and a dog were found deceased.\n\nMuch-celebrated actor Hackman played more than 100 roles in total, including supervillain Lex Luthor in the Christopher Reeve-starring Superman movies in the 1970s and 1980s.\n\nHackman acted opposite many Hollywood heavyweights including Al Pacino in 1973s Scarecrow, Gene Wilder in 1974s Young Frankenstein and Warren Beatty and Diane Keaton in 1981s Reds.\n\nHe also starred in the hit movies Runaway Jury, Wes Andersons The Royal Tenenbaums and Francis Ford Coppolas The Conversation.\n\nCoppola led the tributes to the late star on Thursday, calling him a great artist.In a statement posted on Instagram,the director wrote: Gene Hackman a great actor, inspiring and magnificent in his work and complexity. I mourn his loss, and celebrate his existence and contribution.\n\nValerie Perrine, who featured alongside Hackman in Superman (1978) as his characters on-screen girlfriend Eve Teschmacher, described the late actor as a genius and one of the greatest to grace the silver screen.\n\nShe posted on X: His performances are legendary. His talent will be missed. Goodbye my sweet Lex Till we meet again.\n\nStar Trek actorGeorge Takei postedthat we have lost one of the true giants of the screen.\n\nGene Hackman could play anyone, and you could feel a whole life behind it, he wrote. He could be everyone and no one, a towering presence or an everyday Joe. Thats how powerful an actor he was. He will be missed, but his work will live on forever.\n\nSlumdog Millionaire star Anil Kapoor also called Hackman a genius performer. A true legend whose legacy will live on,he wrote.\n\nAs well as his Oscar wins, Hackman also collected two Baftas, four Golden Globes and a Screen Actors Guild Award.\n\nHe took a comedic turn playing a conservative senator in 1996s The Birdcage alongside Robin Williams and Nathan Lane, who starred as a gay couple.\n\nHis last big-screen appearance came as Monroe Cole in Welcome to Mooseport in 2004, after which he stepped back from Hollywood for a quieter life in New Mexico.\n\nBorn in California in 1930, Hackmans family moved frequently, and after lying about his age at 16, he enlisted in the US Marine Corps serving for four-and-a-half years.\n\nHe was stationed in China, Hawaii and Japan before being discharged in 1951.\n\nFollowing his military service, Hackman lived and worked in a variety jobs in New York, and studied journalism and television production at the University of Illinois, before deciding to drop out and move back to California to pursue his childhood acting dream.\n\nHe joined the Pasadena Playhouse in California, where he befriended a young Dustin Hoffman.\n\nI suppose I wanted to be an actor from the time I was about 10, maybe even younger than that, Hackman once said. Recollections of early movies that I had seen and actors that I admired like James Cagney, Errol Flynn, those kind of romantic action guys.\n\nWhen I saw those actors, I felt I could do that. But I was in New York for about eight years before I had a job. I sold ladies shoes, polished leather furniture, drove a truck.\n\nI think that if you have it in you and you want it bad enough, you can do it.\n\nHe added that he wanted to act but had always been convinced that actors had to be handsome.\n\nThat came from the days when Errol Flynn was my idol. Id come out of a theatre and be startled when I looked in a mirror because I didnt look like Flynn. I felt like him.\n\nHackman moved back to New York in 1963, performing in Off-Broadway productions  including at the Music Box Theatre for the comedy Any Wednesday  and smaller TV roles.\n\nBut he began to really make his name in the 1970s, becoming a leading man as New York City detective Jimmy Popeye Doyle in The French Connection.\n\nFrom then on he became a fixture on the big screen in the likes of 1972 disaster film The Poseidon Adventure.\n\nHe also appeared in Children From Their Games at the former Morosco Theatre, Poor Richard at Helen Hayes Theatre and The Natural Look at Longacre Theatre, before later returning in 1992 to perform Death And The Maiden at the Brooks Atkinson Theatre.\n\nHackman and his first wife, Faye Maltese, were together for 30 years and raised three children before getting divorced in 1986.\n\nIn his later years, he and his second wife, Betsy stayed out of the spotlight, but made a rare public appearance together at the 2003 Golden Globe Awards, where he won the Cecil B. deMille award.\n\nIn 2008 he told Reuters that despite the lack of any official announcement, he was not going to act any longer.\n\nIve been told not to say that over the last few years, in case some real wonderful part comes up, but I really dont want to do it any longer.\n\nHe also explained he was focusing his attentions away from the big screen and towards his quieter, calmer passion for writing novels.\n\nI was trained to be an actor, not a star. I was trained to play roles, not to deal with fame and agents and lawyers and the press, he once said.\n\nIt really costs me a lot emotionally to watch myself on-screen. I think of myself, and feel like Im quite young, and then I look at this old man with the baggy chins and the tired eyes and the receding hairline and all that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/27165159/gene-hackman.webp",
            "description": "<p>BBC Oscar-winning US actor Gene Hackman, his wife Betsy Arakawa, and their dog have been found dead at their home in Santa Fe, New Mexico. In a wide-ranging career spanning more than six decades, Hackman won two Academy Awards for his work on The French Connection and Unforgiven. A statement from the Santa Fe County</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gene-hackman-and-his-wife-found-dead-at-their-home/\">Gene Hackman and his wife found dead at their home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Every day that passes perpetuates his suffering for doing his work – lawyer says as journalist Mhlanga’s bail ruling is postponed again",
            "url": "https://www.newzimbabwe.com/every-day-that-passes-perpetuates-his-suffering-for-doing-his-work-lawyer-says-as-journalist-mhlangas-bail-ruling-is-postponed-again/",
            "content": "By Staff Reporter\n\nThe bail ruling in the case Alpha Media Holdings (AMH) journalist Blessed Mhlanga is accused of transmitting information that incites violence or damage to property, has been postponed to Friday 12 pm by stand-in Magistrate Marewanazvo Gofa.\n\nGofa deferred the ruling, citing that Magistrate Farai Gwatima, who is presiding over Mhlangas case is absent, attending to a bereavement.\n\nMhlanga was arrested on Monday after presenting himself at the Harare Central Police Station in the company of his lawyer, Chris Mhike.\n\nHe is charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23.\n\nThe charges relate to him granting an interview to Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza had issued press briefings through AMH broadcaster HSTv, calling for President Emmerson Mnangagwa to resign from office immediately. Mhlanga is the head of HSTv.\n\nMhike said he is disappointed in the postponement of the bail ruling, which means his client, Mhlanga, will spend another night in jail for doing his journalistic work.\n\nWe are disappointed with this development because every day that passes with this journalist in custody is an elongation or perpetuation of his suffering, suffering for doing his work as a journalist, said Mhike.\n\nWe sympathise with the circumstances of the magistrate, but we remain deeply aggrieved by the fact that the time in which our client is in custody has been made longer, so we wait with hope that when we come back tomorrow (February 28) Blessed will find his liberty once again.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled.jpg",
            "description": "<p>By Staff Reporter The bail ruling in the case Alpha Media Holdings (AMH) journalist Blessed Mhlanga is accused of transmitting information that incites violence or damage to property, has been postponed to Friday 12 pm by stand-in Magistrate Marewanazvo Gofa. Gofa deferred the ruling, citing that Magistrate Farai Gwatima, who is presiding over Mhlanga’s case</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/every-day-that-passes-perpetuates-his-suffering-for-doing-his-work-lawyer-says-as-journalist-mhlangas-bail-ruling-is-postponed-again/\">Every day that passes perpetuates his suffering for doing his work – lawyer says as journalist Mhlanga’s bail ruling is postponed again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "WATCH: Teen girl goes missing following dispute with mother; family appeals for help in locating her",
            "url": "https://www.newzimbabwe.com/watch-teen-girl-goes-missing-following-dispute-with-mother-family-appeals-for-help-in-locating-her/",
            "content": "By Tapiwa Svondo\n\nA Seke family is appealing for help in locating their 16-year-old daughter after she left home on January 23 after a dispute with her mother and has not returned since.\n\nLillian Manjore told NewZimbabwe.com that her teen daughter Mercy Morlean Mandividze had visited her workplace in Greendale when a dispute ensued over the latters messages to her boyfriend.\n\nMercy is16 years old, I couldnt find her since the 23rd of January and she was staying with my sister here in Besa, Seke, learning at Eagle Private Secondary, and she had written her form 4 but hadnt taken her results.\n\nShe had been here for 3 days and I told her she might have failed because shes also someone who doesnt have a passion for school but we had agreed that she do a catering course and she was accepted at Makoni. The purpose of her visit was to collect the cash for her course, Manjore said.\n\nShe has since quit her job in Greendale so she can focus on finding her missing daughter.\n\nMercy Morlean has been missing for over a month now.\n\nI then asked to use my daughters phone since my phones battery had died.While I was using the phone, I saw messages received from a boy. It was around 9 pm and she was already sleeping, she added.\n\nManjore says she reprimanded Mercy the following morning before leaving for work adding that she had barred her from interacting with the same boy in the past and had even asked school authorities to intervene in the matter.\n\nWhen she returned home for lunch she summoned Mercy who then left and has not been seen since.\n\nAt lunchtime, I came back again and told her that I needed to sit down and talk to her, I assume she thought I wanted to beat her and she just left the house without saying anything. She was not even wearing shoes, and had no money, the distraught mother added.\n\nMercy was last seen wearing a blue top, jacket, and floral skirt. Her hair was plaited with black and maroon braids.\n\nLillian has tried all possible ways of looking for her daughter by going to the police station but they havent found her yet.\n\nManjore has filed a missing persons report with the police and has looked for her daughter at shopping centres, and enquired with her friends and even prophets but with no luck.\n\nShe pleaded, Iam kindly appealing for assistance in locating my daughter. If she sees this news coverage I want her to know that I did not reprimand her because I hate her but because I care and love her.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/27101751/Screenshot-2025-02-27-at-12.17.21.png",
            "description": "<p>By Tapiwa Svondo A Seke family is appealing for help in locating their 16-year-old daughter after she left home on January 23 after a dispute with her mother and has not returned since. Lillian Manjore told NewZimbabwe.com that her teen daughter Mercy Morlean Mandividze had visited her workplace in Greendale when a dispute ensued over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-teen-girl-goes-missing-following-dispute-with-mother-family-appeals-for-help-in-locating-her/\">WATCH: Teen girl goes missing following dispute with mother; family appeals for help in locating her</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        },
        {
            "title": "Former Zimbabwe Rugby Union president Aaron Jani dies",
            "url": "https://www.newzimbabwe.com/former-zimbabwe-rugby-union-president-aaron-jani-dies/",
            "content": "By Sport Reporter\n\nFormer Zimbabwe Rugby Union president Aaron Janihasdied aged 55.\n\nJani passed away on Wednesday morning after battling cancer for some time.\n\nRated one of the best administrators ever in the rugby fraternity, he led the union as president from 2017 to May 2024.\n\nHe also served at Rugby Africa as the Treasurer.\n\nJani was one of the first black players to play for the Sables in the early 90s before he retired and continued to serve the game as an administrator.\n\nIn a condolence message, the Zimbabwe Rugby Union described him as a visionary leader who helped the game to grow.\n\nAaron was a towering figure in our sporta leader, a visionary, and a passionate advocate for rugby in Zimbabwe and beyond.\n\nJani was a Sable, living for the game, and his passing marks one of the saddest days in Zimbabwe Rugby.\n\nHis unwavering dedication during his tenure as ZRU President brought stability, growth, and pride to our community, leaving an indelible mark on the Sables, junior rugby, and womens rugby development.\n\nOn behalf of the entire ZRU family, we extend our deepest sympathies to Aarons loved ones during this difficult time.\n\nHis legacy will forever inspire us as we continue to build on the foundation he so tirelessly strengthened, read part of ZRU message.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/17055951/Aaron-Jani-scaled-e1605592830868.jpg",
            "description": "<p>By Sport Reporter Former Zimbabwe Rugby Union president Aaron Jani has died aged 55. Jani passed away on Wednesday morning after battling cancer for some time. Rated one of the best administrators ever in the rugby fraternity, he led the union as president from 2017 to May 2024. He also served at Rugby Africa as the Treasurer.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-zimbabwe-rugby-union-president-aaron-jani-dies/\">Former Zimbabwe Rugby Union president Aaron Jani dies </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "28 Feb 2025"
        }
    ]
}