{
    "news": [
        {
            "title": "Mliswa slams Charamba over handling of Geza protests",
            "url": "https://www.newzimbabwe.com/mliswa-slams-charamba-over-handling-of-geza-protests/",
            "content": "By Staff Reporter\n\nOutspoken former legislator Temba Mliswa has lashed out at Presidential Spokesperson George Charamba, accusing him of mishandling the controversy surrounding the planned but ultimately failed October 17 protests called by war veteran Blessed Geza.\n\nAhead of the protests, a fake statement purportedly from Vice President (Rtd) Constantino Chiwenga condemning the demonstrations circulated on social media.\n\nCharamba responded by emphasising the misuse of government stationery, while admitting that the letter carried a well-intentioned message.\n\nAbuse of government stationery: Kindly note that the message below, however well-intentioned, has been pasted on government stationery, without the knowledge, involvement, or sanction of the Department of Presidential Communications, to which the original stationery belongs, Charamba posted on his X account.\n\nMliswa, however, accused Charamba of deliberately deflecting attention from the more pressing issue,the protests themselves.\n\nHis solution was to evade the greater matter of the contents of the letter and instead lavish disproportionate amounts of self-righteous anger on the abuse of government stationery, Mliswa wrote on X on Thursday.\n\nHe added that Charambas response betrayed his palaver with power on both ends,for now with ED and for the future with a clique embedded within the system.\n\nPeople were worried about the demonstration and messages around it more than that paper! His failure to leverage on this ended up as a sanctioning of the demonstration, he said.\n\nMliswa also questioned Charambas apparent reluctance to strongly denounce the planned protests, saying this was out of character for a Presidential Spokesperson.\n\nAnyone familiar with his conduct and antics through his multiple ghost accounts could clearly pick out the dragging of feet. While cause existed to restrain abuse of government communication channels, an even greater cause of existential importance called for more. He offered none! he said.\n\nMliswa further accused Charamba of acting like a social media bully, using pseudo accounts to attack opponents,behavior he said was unbecoming of a Presidential Spokesperson and damaging to President Emmerson Mnangagwas image.\n\nOver time, as DCS, he has simply become a wild bully without professional decorum in public engagements, encapsulated by incessant insults of Dununu against any contrary thought or individual.\n\nIts shocking behaviour for someone who is the Presidential Spokesperson and should have drawn government censure long ago, as it brings the President and the Office into disrepute. The absence of such has seemingly emboldened him to grow even coarser into the grating maverick around whom many tiptoe, fearful of getting a revolting rant.\n\nWe cant have a Presidential Spokesperson who is toxic and personal in his engagements, tarnishing the name and standing of the President. These are the kinds of things which the Chief Secretary should bring to the President, Mliswa added.\n\nMliswas criticism comes shortly after he accused Charamba of sleeping on duty, claiming exiled former minister Jonathan Moyo was doing a better job defending Mnangagwa on the controversial 2030 presidential term limit debate.\n\nIn response to the repeated attacks, Charamba dismissed Mliswa as irrelevant, saying he was not worth engaging.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/27194900/Temba-Mliswa-e1604439481467.jpg",
            "description": "<p>By Staff Reporter Outspoken former legislator Temba Mliswa has lashed out at Presidential Spokesperson George Charamba, accusing him of mishandling the controversy surrounding the planned but ultimately failed October 17 protests called by war veteran Blessed Geza. Ahead of the protests, a fake statement purportedly from Vice President (Rtd) Constantino Chiwenga condemning the demonstrations circulated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-slams-charamba-over-handling-of-geza-protests/\">Mliswa slams Charamba over handling of Geza protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "DNC bus accident: Government allocates US$197,000 for victims as repatriation process begins",
            "url": "https://www.newzimbabwe.com/dnc-bus-accident-government-allocates-us197000-for-victims-as-repatriation-process-begins/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT has set aside nearly US$197,000 to cover the medical and repatriation costs for Zimbabwean victims of the Limpopo bus accident, which killed 44.\n\nThe victims, Zimbabweans and Malawians, were travelling back home when the DNC bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and injuring 40 others, the victims. One more person succumbed to injuries in the hospital, bringing the death toll to 44.\n\n36 Zimbabweans died and 13 remain hospitalised in South Africa, with three in a critical condition.\n\nPreliminary investigations have revealed that the accident was due to brake failure and overloading of the bus, which was carrying 91 passengers with only a 62-seater capacity.\n\nPresident Emmerson Mnangagwa has since declared the bus accident a national disaster.\n\nPresenting a ministerial statement in the National Assembly recently, the Deputy Minister of Local Government and Public Works, Benjamin Kabikira, said the repatriation will be conducted in batches beginning on Friday.\n\nThe positive identification of all deceased was completed on the 20th of October, 2025, with the ZRP forensic team present to assist with the fingerprint screening and verification. In cases involving deceased children, DNA samples were collected from both the deceased and their next of kin for accurate identification.\n\nThen, on the death registration and documentation, all required documentation, including the death certificates and burial orders, are being processed to facilitate repatriation.\n\nThe repatriation to Zimbabwe is anticipated to begin in batches from Friday, 24th October 2025, pending the completion of all formal processes. A mass memorial service will be held in Beitbridge when the bodies arrive in Zimbabwe, said Kabikira.\n\nKabikira added that US$197,000 has been set aside to assist the victims.\n\nSecondly, we have dispatched a bus with next of kin or relatives from the National Disaster Management Centre, Harare, to the Beitbridge route to South Africa, for identification of the bodies. Zimbabwean nationals, that is next of kin without valid passports, were granted temporary passage into South Africa for the sole purpose of identifying the deceased.\n\nA list of names for the next of kin and national IDs was submitted to South African Immigration in advance to ensure smooth border processing. As a Ministry, post mortems were completed on Friday, the 17th of October, 2025 and the physical identification was also completed as of 20 October at Siloam Hospital.\n\nAs an intervention, the department of Civil Protection requested the Ministry of Transport and Infrastructural Development and Zim Borders for a waiver of border charges for the hearses and bus carrying the bodies and families of the bereaved. The budget for intervention and coordination of the disaster is as follows: We are anticipating using a total amount of US$197,940 or ZWG5,340,930. 3 in the coordination and intervention of the disaster, said Kabikira.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus-e1760778980550.png",
            "description": "<p>By Darlington Gatsi GOVERNMENT has set aside nearly US$197,000 to cover the medical and repatriation costs for Zimbabwean victims of the Limpopo bus accident, which killed 44. The victims, Zimbabweans and Malawians, were travelling back home when the DNC bus veered off the N1 North near Louis Trichardt on 13 October, killing 43 passengers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-accident-government-allocates-us197000-for-victims-as-repatriation-process-begins/\">DNC bus accident: Government allocates US$197,000 for victims as repatriation process begins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "South Africa’s Road Accident Fund says foreigners may claim compensation — if they comply with Immigration Act",
            "url": "https://www.newzimbabwe.com/south-africas-road-accident-fund-says-foreigners-may-claim-compensation-if-they-comply-with-immigration-act/",
            "content": "By Jonisayi Maromo, IOL\n\nThe Road Accident Fund (RAF) has confirmed thatvictims and families affected by the Limpopo bus disaster that killed and injured dozens of Zimbabwean and Malawian nationalsare entitled to lodge claims for compensation  but theres a legal catch that could determine who actually gets paid.\n\nResponding to IOL, the RAF said that while all victims of the tragic DNC Coaches crash near Makhado have the right to apply for compensation under the Road Accident Fund Act, any potential payouts will depend on the outcome of investigations and on each claimants legal status in South Africa.\n\nVictims and/or families of last weeks bus crash in Limpopo are entitled to lodge claims according to the Road Accident Fund Act, [but] each claim will still have to be assessed on its own merit, the RAF told IOL.\n\nIt is not accurate that the RAF is liable for all or any accidents. Before the RAF can be liable, there must be an establishment of the fact that the accident was wrongfully caused.\n\nThe bus, which was travelling from Gqeberha (Port Elizabeth) to Harare, plunged off an embankment near Makhado (Louis Trichardt) on 12 October, killing more than 40 people and leaving many passengers critically injured.\n\nThe vehicle was licensed to carry 61 passengers, but investigators from the Road Traffic Management Corporation (RTMC) found that it was carrying more than 90 people, mostly Zimbabweans and Malawians returning home.\n\nThe Zimbabwean government has since stepped in to assist its citizens  pledging to repatriate the remains of those who died, cover hospital costs for the injured, and coordinate with South African authorities. Malawian officials are conducting similar efforts to identify and assist their nationals.\n\nThe RAFs intervention comes amid public speculation that the fund is automatically liable for compensation to foreign nationals injured or killed on South African roads.\n\nHowever, the agencys statement makes clear that liability must first be established under Section 3 of the RAF Act, which stipulates that compensation can only be paid for loss or damage wrongfully caused by the driving of a motor vehicle.\n\nThat means that each claim will have to be individually investigated  including who was at fault, whether the driver or bus company was negligent, and whether the vehicle was legally roadworthy.\n\nUntil the claims are lodged with the RAF, we implore everyone concerned to allow the relevant authorities to conclude their investigations before any pronouncements are made on the liability of the RAF, the Fund told IOL.\n\nThe RAF also introduced a crucial legal caveat that could prevent some victims  particularly those without valid documentation  from receiving compensation.\n\nThe RAF as an organ of state is obliged to comply with section 42 of the Immigration Act, which prohibits the aiding and abetting of illegal foreigners, the Fund said.\n\nWhere the RAFs liability is established, the payment of compensation must not contravene any other law such as the Immigration Act.\n\nIn practice, this means that while foreign nationals are not excluded from lodging claims, undocumented migrants may face legal barriers if their compensation would be deemed to aid or abet an illegal presence in the country.\n\nLegal experts say this clause could become a flashpoint in the coming weeks, as lawyers for victims test whether the RAF can lawfully withhold payments based on immigration status.\n\nDespite its legal caution, the RAF extended condolences to those affected, saying it sympathizes with the families of those injured and deceased in the accident and pledges to support them through the claims process.\n\nThe agency urged survivors and families to make contact through its call centre (087 820 1111), WhatsApp line (071 605 4707), or emailcontactcentre@raf.co.za.\n\nThe Limpopo tragedy has reignited debate about the rights of foreign nationals in South Africa  especially when it comes to access to public compensation funds.\n\nAnti-immigrant groups have criticised the idea of South African taxpayers compensating non-citizens, while rights advocates argue that the RAFs mandate applies to all persons injured or killed on South African roads, regardless of nationality.\n\nThe outcome of the Limpopo case could set an important legal and moral precedent, testing the intersection of immigration law, human rights, and public compensation.\n\nAuthorities from the Road Traffic Management Corporation and Limpopo Transport Departmentare continuing investigations into the crash. Early findings point to excessive speed, overloading, and poor vehicle maintenance as likely contributing factors.\n\nFor now, survivors and families are being advised to gather identity documents, medical records, and accident reports to prepare their claims  a process that could take months to resolve.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/14083758/dnc-bus.webp",
            "description": "<p>By Jonisayi Maromo, IOL The Road Accident Fund (RAF) has confirmed that victims and families affected by the Limpopo bus disaster that killed and injured dozens of Zimbabwean and Malawian nationals are entitled to lodge claims for compensation — but there’s a legal catch that could determine who actually gets paid. Responding to IOL, the RAF said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-road-accident-fund-says-foreigners-may-claim-compensation-if-they-comply-with-immigration-act/\">South Africa’s Road Accident Fund says foreigners may claim compensation — if they comply with Immigration Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "Cannabis boom in South Africa and Zimbabwe is good for wealthy investors, bad for small farmers",
            "url": "https://www.newzimbabwe.com/cannabis-boom-in-south-africa-and-zimbabwe-is-good-for-wealthy-investors-bad-for-small-farmers/",
            "content": "The Conversation\n\nCannabis is booming as an ingredient in everything fromsupplementary oils, inflammation-reducingskin creams, lip balms tohealth drinksand gummy sweets that promise to reduce anxiety and pain and promote relaxation.\n\nThe global legal cannabis market is todayworth aboutUS$69.78 billion, and this will skyrocket toUS$216.76 billion by 2033.\n\nBut is this boom benefiting indigenous cannabis farmers in southern Africa? Theyd been growing the plant for hundreds of years before colonial authorities criminalised it in the early 1900s. Rural people continued to grow it illicitly after that, relying on its medicinal properties.\n\nFor many rural households in southern Africa today, cannabis pays for the familys food,education,and other necessities.\n\nIn South Africa, cannabis wasprohibitedunder different laws since1928. In neighbouring Zimbabwe, theDangerous Drugs Actcriminalised cannabis in 1955, and this continued after independence.\n\nBut in 2018, this changed. South Africas Constitutional Courtdecriminalisedprivate use and limited private cultivation for personal consumption, while Zimbabweregulatedthe cultivation of cannabis for medicinal and industrial purposes.\n\nWe are social scientists who research cannabis and development in Africa. We interviewed a wide range of people, from political leaders to illicit growers to cannabis lobbyists and non-governmental organisations to technical people involved in the industry, such as greenhouse installers. We wanted touncoverthe challenges small-scale cannabis farmers faced after cannabis was decriminalised.\n\nOur researchfoundthat cannabis reform has continued old patterns of unfairness. For example, we found that medicinal cannabis production is currently an exclusive business which only well off businesses can participate in. Farmers who traditionally cultivated cannabis and sold it when it was still illegal have not been included in the new cannabis industry.\n\nIf these problems are not solved, the potential of cannabis to be a tool for development in Zimbabwe and South Africa will remain unfulfilled.\n\nSouth Africas move towards legalisation was not triggered by the government but by the courts. The 2018 Constitutional Court rulingfound thatcriminalising private cannabis use violated the constitutional right to privacy. The state couldnt show a good enough reason to interfere with adults doing private things like smoking cannabis by consent, as long as no one else was being harmed.\n\nThis decision created a ripple effect. It ignited public debate about personal freedoms. It also sparked discussion about whether cannabis could help redress historical injustices, create jobs, and boost economies in rural areas where the plant has long been cultivated.\n\nSince then, however, reform has been slow and uneven. The government passed theCannabis for Private Purposes Act in 2024. This sets out the amounts of cannabis that individuals can possess and grow. However, most commercial trade is in the tightly regulated medical and hemp sectors (hemp beingCannabis sativawith very low levels of THC, the active psychoactive cannabanoid). Trade in cannabis outside these sectors is mainly prohibited.\n\nAlso, small-scale farmers  many of whom have cultivated cannabis for generations  face high barriers to entering the legal market. To set up a medicinal cannabis business in South Africa needs alicencefrom the health products regulatory authority. The cannabis farm has to meet high quality standards, and comply with strict manufacturing and agricultural practices. Cannabis farms are also inspected regularly.\n\nMedicinal cannabis businessesestimatethat R3 million to R5 million (US$173,000 to US$289,000) is needed to start a farm. This high cost sidelines the very communities that kept the cannabis industry going when the plant was banned.\n\nZimbabwes reform took a different route. The government legalised cannabis cultivation in 2018, but only for medicinal and industrial purposes. Recreational use remains illegal.\n\nThe governments motivation was for cannabis to complement tobacco as an important cash crop. Officials projected abillion-dollar industrygeared mainly towards exporting cannabis.\n\nIn practice, though, only wealthy investors can afford to set up cannabis export businesses. For example, a five-year medicinal cannabislicence costsUS$50,000. On top of that, cannabis farmers must paysubstantial annualinspection fees and licence renewal fees.\n\nOur research also found that the cost of greenhouses prevents small-scale farmers from starting cannabis businesses. Medicinal cannabis farmers are required to use greenhouses to control temperatures, humidity, pests and contamination. A greenhouse installer we interviewed said one of their cheaper versions cost US$220,000 for a five-hectare plot.\n\nUnsurprisingly, the main people who have benefited from cannabis law reform have been established local business people andforeign investors. Small-scale cannabis farmers  the backbone of Zimbabwes cannabis trade for decades  remain excluded. Many continue togrow it illicitly. This sustains domestic illegal markets and means these small farmers dont benefit from the promised green gold.\n\nIn both countries, corporate capture of the cannabis industry is looming. Well-capitalised companies, often with international backing, are able to afford the costs of meeting regulatory standards. They also have the funds to sell cannabis on the export market. If the cannabis industry is taken over by corporations, profits will be concentrated in a narrow elite rather than growers on the ground.\n\nBoth countries are also struggling with the contradiction between reforming cannabis laws and international drug controls which still classify cannabis as a prohibited substance. This complicates efforts to develop export markets and creates uncertainty for investors.\n\nExcluding smallholder farmers whove farmed cannabis for decades perpetuates inequality. It also undermines the sustainability of reform, because illicit markets will continue to thrive if ordinary cultivators see no benefit in moving to the legal sector. More inclusive models are possible. These could include tiered licensing systems with lower fees for small-scale farmers.\n\nCannabis producer co-operatives can also enable their participation, as is the casein Morocco.\n\nCommunities and commercial investors should partner to strengthen one another. They can form joint ventures where communities provide labour and knowledge of local climatic conditions and cannabis varieties while investors provide funds and ensure regulatory compliance.\n\nThese ventures would recognise the contribution of traditional cultivators while still ensuring cannabis quality and safety in the legal market.\n\nThe next phase of reform in both countries must focus on including small-scale farmers. Laws must be passed to balance the commercial opportunities that come from selling cannabis with the rights and livelihoods of small-scale cultivators.\n\nSenior research associate, Centre of Criminology, University of Cape Town\n\nTeaching Associate, School of Social Sciences, Cardiff University\n\nThis article was originally published inThe Conversation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23074415/cannabis-boom.jpg",
            "description": "<p>The Conversation Cannabis is booming as an ingredient in everything from supplementary oils, inflammation-reducing skin creams, lip balms to health drinks and gummy sweets that promise to reduce anxiety and pain and promote relaxation. The global legal cannabis market is today worth about US$69.78 billion, and this will skyrocket to US$216.76 billion by 2033. But is this boom benefiting indigenous</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cannabis-boom-in-south-africa-and-zimbabwe-is-good-for-wealthy-investors-bad-for-small-farmers/\">Cannabis boom in South Africa and Zimbabwe is good for wealthy investors, bad for small farmers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "UK police arrest three men on suspicion of spying for Russia",
            "url": "https://www.newzimbabwe.com/uk-police-arrest-three-men-on-suspicion-of-spying-for-russia/",
            "content": "Agencies\n\nPolice in the United Kingdom have arrested three men on suspicion of assisting Russias foreign intelligence service, as tensions between a key ally of Ukraine in the war and Moscow continue to simmer.\n\nThe Metropolitan Police said on Thursday the men  aged 44, 45 and 48  were arrested from west and central London under the 2023 National Security Act on suspicion of assisting a foreign intelligence service.\n\nThey said the country in question isRussia, according to The Associated Press news agency.\n\nThose addresses, along with another, are currently being searched, with counterterrorism police leading the investigation, they said.\n\nBritish authorities allege that Russia is conducting an increasingly boldcampaignof espionage, sabotage and cyber-interference against the United Kingdom.\n\nWere seeing an increasing number of who we would describe as proxies being recruited by foreign intelligence services, and these arrests are directly related to our ongoing efforts to disrupt this type of activity, said Commander Dominic Murphy, head of counterterrorism policing in London.\n\nThe developments came as six men were being sentenced for their part in an arson attack on Ukraine-linked businesses in east London last year. Prosecutors said it had been ordered by the Russian mercenary group Wagner.\n\nThe ringleader, Dylan Earl, was the first person convicted under the National Security Act, which gives prosecutors powers to put spying suspects on trial in a wider set of circumstances.\n\nLast week, the head of the UKs MI5 security service, Ken McCallum, alleged that Russia is committed to causing havoc and destruction.\n\nIn the last year, we and the police have disrupted a steady stream of surveillance plots with hostile intent aimed at individuals [whom] Russian leaders perceive as their enemies, he said.\n\nThe Kremlin has denied accusations that it is involved in any such acts of sabotage, saying the British government repeatedly blames Russia for anything bad that happens in the UK.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23201037/new-scotland-yard.webp",
            "description": "<p>Agencies Police in the United Kingdom have arrested three men on suspicion of assisting Russia’s foreign intelligence service, as tensions between a key ally of Ukraine in the war and Moscow continue to simmer. The Metropolitan Police said on Thursday the men – aged 44, 45 and 48 – were arrested from west and central</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-police-arrest-three-men-on-suspicion-of-spying-for-russia/\">UK police arrest three men on suspicion of spying for Russia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "Culture as Capital: Fungai Zvirawa’s mission to transform Zimbabwe’s creative sector",
            "url": "https://www.newzimbabwe.com/culture-as-capital-fungai-zvirawas-mission-to-transform-zimbabwes-creative-sector/",
            "content": "By Takudzwa Nyambi, Glamour South Africa\n\nOver the past few years weve witnessed a renaissance on the continent when it comes to African culture and creativity. Fashion houses reference Accra streetwear in Paris runways. Amapiano is the unofficial soundtrack of Berlin clubs. Nollywood stars are headlining Netflix features.\n\nAccording to a 2023 UNESCO report, Africas film and audiovisual sector already employs around five million people and generates $5 billion annually. With proper investment, the broader cultural and creative industries could pull in $20 billion a year and create 20 million jobs. This is soft power and real economic transformation.\n\nAfricas creative future wont be written in isolation. Marcus Garvey once envisioned a global Black network, the diaspora and continent working hand in hand. A century later, that vision is finding its feet in people like Fungai Zvirawa, the Zimbabwean advertising executive who built her chops in London boardrooms only to bring them back to Harare, determined to stitch together a local industry that could stand tall on the global stage.\n\nI was raised in South East London by two fiercely patriotic Zimbabwean parents, she recalls. Like many immigrants, I had my share of go back to your country. But instead of breaking me, those words reminded me that I did have a country. That sense of belonging became her compass. The moment crystallized in 2002 when she watched Robert Mugabe address the UN. Politics aside, his message of sovereignty and youth empowerment struck something deep within me. It was a reminder I had a home, a heritage, and a responsibility.\n\nAfter nearly three decades abroad, Fungai Zvirawa returned, stumbling at first, but eventually planting firm roots. It took me four attempts as a returnee to really break ground, she admits. There have been incredible wins and an equal share of losses, but thats the reality of building in Africa. She shares about keeping it simple, embracing culture, and resisting the urge to impose a foreign mindset.\n\nThat mindset birthed Khaya Defero, her cultural events company, and Rogue & Associates, her boutique ad agency. Khaya Defero has staged RSVP, AGW, The Big Chill, and Zimdaba, experiences designed to elevate the very idea of what Zimbabwean hospitality and show business could look like. When I began curating events in Harare, I realised there was no real separation between the celebrity and fan, no true culture of hospitality that elevated talent. Through these platforms, we changed that.\n\nShes also helped shepherd multi-award-winning talents like Shingai and ShaSha, bridging the tricky gap between diaspora fame and local relevance. Many artists who succeed abroad struggle to reconnect at home. The balance is always authenticity, keeping Zimbabwean creativity intact, while packaging it in ways that resonate globally and locally.\n\nThat same dual vision threads through her leadership roles as President of the Zimbabwe Association of Accredited Practitioners in Advertising (ZAAPA) and CEO of the Zimbabwe Music Awards (ZIMA). For her, the two industries arent as far apart as people assume. Advertising and music are two sides of the same coin. In advertising, we shape narratives that move markets. In music, we shape narratives that move people.\n\nIf that sounds like the voice of a seasoned operator, its because Zvirawa has been navigating and leading in male-dominated spaces for decades. When you show up prepared, deliver, and stay true to your values, respect eventually follows, even if it takes longer than it should.\n\nWhat makes her tick is the idea of rebranding Zimbabwe through creativity. Zimbabwes greatest resource is its people and their creativity. Im in the business of exporting that, our music, our ideas, our artistry. Its a project both ambitious and pragmatic to put Zimbabwean work in front of global audiences, and watch assumptions shift.\n\nIn her next chapter, Zvirawa is betting on technology as a force for transformation. She has invested in Black Mobile, a Pan-African mobile value-added services company with a footprint in Zimbabwe, South Africa, Nigeria, Kenya, Botswana, and Zambia.\n\nFor me, this is about future-proofing Africas creative economy. Our artists, brands, and storytellers need platforms that are homegrown, designed with our realities at the core, yet powerful enough to scale globally. Black Mobile represents that opportunity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/01055945/WhatsApp-Image-2024-04-30-at-16.24.28-e1714539609546.jpeg",
            "description": "<p>By Takudzwa Nyambi, Glamour South Africa Over the past few years we’ve witnessed a renaissance on the continent when it comes to African culture and creativity. Fashion houses reference Accra streetwear in Paris runways. Amapiano is the unofficial soundtrack of Berlin clubs. Nollywood stars are headlining Netflix features. According to a 2023 UNESCO report, Africa’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/culture-as-capital-fungai-zvirawas-mission-to-transform-zimbabwes-creative-sector/\">Culture as Capital: Fungai Zvirawa’s mission to transform Zimbabwe’s creative sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "IVF test could misjudge embryo health, study finds",
            "url": "https://www.newzimbabwe.com/ivf-test-could-misjudge-embryo-health-study-finds/",
            "content": "BBC\n\nResearchers have raised concerns about the reliability of a widely used IVF screening method, which checks for chromosomal abnormalities.\n\nScientists at the Loke Centre for Trophoblast Research, University of Cambridge, said the test, used in many fertility clinics for IVF, was likely to overestimate the number of embryos with abnormalities.\n\nThe treatment is often offered to older women or women with a history of miscarriage or failed IVF cycles.\n\nHowever, scientists believed the test could be picking up errors in cells that would form in the placenta, rather than those that had developed in the embryos.\n\nThe test, known as pre-implantation genetic testing for aneuploidy (PGT-A), is designed to screen embryos before implantation.\n\nWhen abnormalities were detected, the embryo may be deemed inviable and discarded, so patients may undergo another cycle of treatment, which can be costly.\n\nButnew researchsuggested that some of the abnormalities detected by the tests may not be relevant to the embryos viability.\n\nLooking to better understand the development of the embryo at its early stage, Cambridge researchers and the Francis Crick Institute developed a new, state-of-the-art method to watch embryos live in high resolution.\n\nIt used fluorescent tagging to track cell division in 3D.\n\nAbnormalities arise at a relatively late stage of the embryos development and appear in the outer layer of the blastocyst.\n\nThe blastocyst develops into the placenta, and it is from this layer that biopsies were taken for pre-genetic testing.\n\nFirst author Dr Ahmed Abdelbaki, a postdoctoral researcher at the Loke Centre, said it was the first time the imaging technique had been used, and it allowed them to see what was happening.\n\nIt meant that we could watch the embryos as they developed over a two-day period, the longest continuous time that this process has been observed.\n\nCo-author Professor Ben Steventon from the Department of Genetics at the University of Cambridge said: Its proof of the power of direct observation to uncover unexpected findings in human biology.\n\nThe embryos in the study were donated by families who had successful pregnancies.\n\nProfessor Kathy Niakan, director of the Loke Centre and chair of Cambridge Reproduction, said her team was now studying cells in the inner cell layer, which forms the fetus.\n\nMuch more basic research is needed to inform future clinical practice and improve rates of assisted conception, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/13080322/baby-feet.jpg",
            "description": "<p>BBC Researchers have raised concerns about the reliability of a widely used IVF screening method, which checks for chromosomal abnormalities. Scientists at the Loke Centre for Trophoblast Research, University of Cambridge, said the test, used in many fertility clinics for IVF, was likely to overestimate the number of embryos with abnormalities. The treatment is often</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ivf-test-could-misjudge-embryo-health-study-finds/\">IVF test could misjudge embryo health, study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        },
        {
            "title": "Essex care worker jailed for sex offences at hospital",
            "url": "https://www.newzimbabwe.com/essex-care-worker-jailed-for-sex-offences-at-hospital/",
            "content": "Echo News\n\nA healthcare assistant has been jailed for engaging in sexual activity with a vulnerable patient while working at a secure mental health unit.\n\nNelson Ncube, 57, of Gratian Close, Highwoods, Colchester, appeared at Ipswich Crown Court for sentencing on Tuesday after admitting two counts of engaging in sexual activity with a person with a mental disorder while being a care worker.\n\nThe offences took place between late 2020 and early 2023 at a mental health hospital in Colchester, where Ncube was employed as a healthcare assistant.\n\nThe victim was detained under the Mental Health Act and described as acutely unwell during the period of abuse.\n\nThe court heard that Ncube was assigned to long shifts, sometimes lasting up to 12 hours, and responsible for observing the woman, whose room was adjacent to the nurses station and under camera surveillance.\n\nHowever, there were blind spots in areas such as a storage area and patient toilets.\n\nNcube took the patient to these locations, where the offending occurred.\n\nProsecutor details revealed that the behaviour began with unexpected physical contact before escalating to overtly sexual acts.\n\nThe court heard that Ncube requested and exchanged explicit photographs with the woman.\n\nIn a victim impact statement, the woman described the deep psychological impact of Ncubes abuse while she was sectioned and under his care.\n\nHow dare you, she told the defendant from the witness box as he kept his eyes to the ground in the dock.\n\nThe victim added: Very often you were part of the team restraining me. It must have been very clear to you I was intensely unwell.\n\nShe added: I felt ashamed, unclean and embarrassed.\n\nBut with my improved strength and sense of self worth a feeling of clarity arrived  it was not my fault or responsibility, it was wholly yours.\n\nJudge Richard Kelly told Ncube he had shown a warped sense of responsibility by suggesting the victim initiated the conduct.\n\nNcube, previously of good character, was sentenced to four years and nine months imprisonment.\n\nHe expressed remorse through his barrister, who said he felt nothing but shame and guilt for his actions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23200301/nelson-ncube.jpg",
            "description": "<p>Echo News A healthcare assistant has been jailed for engaging in sexual activity with a vulnerable patient while working at a secure mental health unit. Nelson Ncube, 57, of Gratian Close, Highwoods, Colchester, appeared at Ipswich Crown Court for sentencing on Tuesday after admitting two counts of engaging in sexual activity with a person with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/essex-care-worker-jailed-for-sex-offences-at-hospital/\">Essex care worker jailed for sex offences at hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "24 Oct 2025"
        }
    ]
}