{
    "news": [
        {
            "title": "IMF says Zim highly dollarised as local industry calls for further disinflation",
            "url": "https://www.newzimbabwe.com/imf-says-zim-highly-dollarised-as-local-industry-calls-for-further-disinflation/",
            "content": "IOL\n\nThe International Monetary Fund (IMF) says Zimbabwes economy remains highly dollarised, with any de-dollarisation policies needing gradual implementation while the Confederation of Zimbabwe Industries has called for further disinflation strategies into 2026 to correct pricing and manage stubbornly high inflation.\n\nZimbabwe is pushing for an end to the use of US Dollars across the economy by 2030, coinciding with a possible two year extension of President Emmerson Mnangagwas rule originally scheduled to end in 2028. Mnangagwas party, Zanu PF party has resolved to extend the Zimbabwean leaders tenure and to end dollarisation by 2030.\n\nHowever, the IMF has said in an interview that Zimbabwe remains highly dollarized with any confidence in a local currency needing to be built through credible fiscal and monetary policies, a strengthened FX market, and the absence of quasi-fiscal operations such as providing subsidies or financing government programsoutside of the budgetframework.\n\nThe Zimbabwe Gold (ZiG) local currency Zimbabwe says is backed by foreign currency reserves is largely shunned by locals for transactions. The IMF said Zimbabwe has to ringfence any de-dollarisation efforts by a stable policy environment that will accrue confidence for the local unit of exchange.\n\nConfidence in macro-economic policy and the currency is reinforced by a predictable, rules-based policy environment and progress on economic governance.Advancing these reformsalongside clear, consistent economic policy implementationwould help anchor expectations and bolster confidence, the IMFs chief of mission to Zimbabwe,Wojciech Stanislaw Maliszewski, said by email.\n\nThe Confederation of Zimbabwe Industries (CZI) has called for further disinflation strategies over the next few months. It argued that inflation should be lowered further.\n\nAn inflation rate of 30% is still too high, calling for more disinflation strategies into 2026.The policy target is to have an annual ZiG inflation of 30% by December 2025, said Cornelius Dube, chief economist for the CZI.\n\nAccording to the IMF, theReserve Bank of Zimbabwe (RBZ)has been tighteningits policy stancesince September last year afterhalting monetary financing. This had helpedtolower inflationfrom elevated highs while also easingexchange-rate pressures.\n\nThe gap between official and parallel market rates narrowed, and ZiG inflation declined by mid-2025, though the economy remains highly dollarized, said Maliszewski.\n\nFor the month of October, Zimbabwes inflation in ZiG local currency dropped to32.7%aftershedding 50 percentage points from a rate of 82.7% in the month of September 2025. on the other hand, the USD month-on-month inflation for October 2025 increased to 0.3% from a rate of 0% in the month of September2025.11.4\n\nThe CZI has explained that thismeansthatprices in USD terms remained stable as the observed increase is minimal.\n\nHowever, CZI believes that when the de-dollarisation programme gets rolled out, the inflation differential between ZiG and USD will matter in the decision of which currency to usein transactions.\n\nUSD price stability would make the USD attractive as both a transaction and savings currency. ZiG stability has to be sustainable for a very long time before it can also be considered a close substitute to the USD, said Dube.\n\nThis comes as ZimbabwesUSD year-on-year inflationhas continued on adeclining trend which started in July 2025.\n\nIn October 2025,ZimbabwesUSD inflation declined to 13% fromthe13.4% registered in the month of September. However, a 13% USD inflation is still very high, as it means that savings in USD lost about 13% purchasing power between October 2024 and October 2025, said the CZI.\n\nWith the USD being the main savings currency, it is critical for its inflation to remain very low if savings are to be protected.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>IOL The International Monetary Fund (IMF) says Zimbabwe’s economy remains highly dollarised, with any de-dollarisation policies needing gradual implementation while the Confederation of Zimbabwe Industries has called for further disinflation strategies into 2026 to correct pricing and manage stubbornly high inflation. Zimbabwe is pushing for an end to the use of US Dollars across the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-says-zim-highly-dollarised-as-local-industry-calls-for-further-disinflation/\">IMF says Zim highly dollarised as local industry calls for further disinflation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "06 Nov 2025"
        },
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "06 Nov 2025"
        },
        {
            "title": "ZWG to strengthen further in fourth quarter of 2025 – Finance Minister",
            "url": "https://www.newzimbabwe.com/zwg-to-strengthen-further-in-fourth-quarter-of-2025-finance-minister/",
            "content": "By Alois Vinga\n\nFINANCE Minister, Mthuli Ncube, says the local ZWG currency is set to strengthen further in the Fourth Quarter of the year as demand rises for periodical tax settlements.\n\nSince last year, the central bank has implemented a restrictive monetary policy aimed at anchoring price, currency, and exchange rate stability. The approach involves maintaining a high bank policy rate, currently at 35%,to curb speculative borrowing, which has been a major driver of excess liquidity and illicit parallel market activity.\n\nTo this end, the exchange rate premium has remained stable for a period in excess of one year, which has seen annual inflation receding by more than 50% to 32,7%.\n\nSpeaking to parliamentarians in Bulawayo Wednesday, Ncube said the local unit is poised to strengthen further as the year comes to an end.\n\nFourth quarter taxes are expected to increase demand for ZiG, and the appreciation of the exchange rate. In the outlook, exchange rate stability is envisaged, underpinned by the broad acceptance of the ZiG and the continued implementation of prudent fiscal and monetary policies by the Government, Ncube said.\n\nHe attributed the obtaining stability, which has seen the exchange rate maintaining a premium of US$1: ZWG 26.68 to the aggressive policies employed to ring fence the currency.\n\nThe parallel market exchange rate premium has remained stable, falling to below 25% in August 2025, aligning with other countries, including Kenya and Zambia, he said.\n\nNcube said the strategy for accelerated building of foreign currency reserves is bearing fruit following the introduction of the ZiG, which has seen total foreign currency reserves increasing from below US$300 million in April 2024 to over US$900 million by September 2025, targeting US$1 billion by December 2025.\n\nZimbabwe is accumulating both gold and USD reserves which are expected to fully cover both ZiG reserve money and deposits.\n\nAdded Ncube, Inflation is projected to average 61.3% in 2025, end the year at 22.8%, and decline to single-digit levels by 2027, supported by continued exchange rate stability and prudent fiscal and monetary policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>By Alois Vinga FINANCE Minister, Mthuli Ncube, says the local ZWG currency is set to strengthen further in the Fourth Quarter of the year as demand rises for periodical tax settlements. Since last year, the central bank has implemented a restrictive monetary policy aimed at anchoring price, currency, and exchange rate stability. The approach involves</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-to-strengthen-further-in-fourth-quarter-of-2025-finance-minister/\">ZWG to strengthen further in fourth quarter of 2025 – Finance Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "06 Nov 2025"
        },
        {
            "title": "Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story",
            "url": "https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/",
            "content": "By Alois Vinga\n\nFinance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs.\n\nThe World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and US$12,535. In an ideal setting, this level of income would reflect improved living standards for ordinary citizens through equitable distribution of national wealth.\n\nAddressing delegates at the 2026 Pre-Budget Seminar in Bulawayo on Wednesday, Ncube painted a rosy picture of Zimbabwes economy, adding that most citizens are already spending above the daily threshold associated with middle-income economies.\n\nSo, the minimum GNI per capita should be US$4,500 per person, and this is an annual figure. That means that you ought to be able to spend on any given day no less than US$12 per person. Currently, on average, with the GNI per capita of US$3,300, that implies that we are spending US$9 per day, Ncube said.\n\nHe attributed the progress to the successful implementation of the National Development Strategy 1 (NDS1), which he said drove the economy to an average growth rate of 5.6% between 2021 and 2025, surpassing the official target of 5.2%, buoyed by increased infrastructure development. Ncube added that the economy is forecast to expand by 6.6% this year.\n\nHis statement, however, contrasts sharply with the lived reality of many Zimbabweans. The majority of the working population continues to earn less than US$250 per month, while a significant portion of the labour force operates in the informal sector, struggling to meet daily needs amid rising inflation and a weakening local currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga Finance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs. The World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/\">Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "06 Nov 2025"
        },
        {
            "title": "Govt acquires Monomotapa Hotel to cut costs for parliamentarians",
            "url": "https://www.newzimbabwe.com/govt-acquires-monomotapa-hotel-to-cut-costs-for-parliamentarians/",
            "content": "By Alois Vinga\n\nGovernment has officially acquired the historic Monomotapa Hotel to serve as a dedicated lodging facility for Members of Parliament, in a move aimed at curbing expenditure.\n\nFinance Minister Professor Mthuli Ncube made the announcement, describing the acquisition as a strategic step towards increasing efficiency and reducing the financial burden associated with parliamentary operations.\n\nThe move, he explained, will provide MPs with a convenient and cost-effective alternative to expensive private accommodation during parliamentary sessions and national events.\n\nThe governments acquisition of the Monomotapa Hotel underscores our ongoing commitment to improving the welfare of our Parliamentarians while also addressing the broader issue of fiscal responsibility. This initiative is not just about cutting costs, but about ensuring that public funds are used wisely, allowing for more resources to be directed toward national priorities, said Ncube.\n\nAlthough no current figures were provided, a 2013 report highlighted the high cost of hosting MPs in Harare, revealing that sitting allowances, accommodation, and travel expenses for Parliamentarians could easily exceed US$200,000 per week when both Houses were in session. With fuel allowances, travel stipends, and hotel bills, the financial burden had become unsustainable.\n\nThe decision to repurpose Monomotapa Hotel for government use is expected to deliver significant savings, which could be redirected to other national development priorities, thereby improving both efficiency and public service delivery.\n\nThe hotels previous owner, African Sun Limited, sold the property as part of a broader strategy to consolidate its portfolio, a move that reshapes the local hospitality sector. With its prime location and storied past, the hotels new role as a government facility is likely to redefine Harares hospitality landscape and spark debate over the balance between tourism, state infrastructure, and public service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga Government has officially acquired the historic Monomotapa Hotel to serve as a dedicated lodging facility for Members of Parliament, in a move aimed at curbing expenditure. Finance Minister Professor Mthuli Ncube made the announcement, describing the acquisition as a strategic step towards increasing efficiency and reducing the financial burden associated with parliamentary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-acquires-monomotapa-hotel-to-cut-costs-for-parliamentarians/\">Govt acquires Monomotapa Hotel to cut costs for parliamentarians</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "06 Nov 2025"
        },
        {
            "title": "Tanzanian jailed 15 years for drug trafficking in Zimbabwe",
            "url": "https://www.newzimbabwe.com/tanzanian-jailed-15-years-for-drug-trafficking-in-zimbabwe/",
            "content": "By Staff Reporter\n\nA TANZANIANhas been sentenced to an effective 15 years imprisonment following his conviction by a Zimbabwean court for drug trafficking.\n\nThe offender, Sleiman Amour (44), appeared at the Bulawayo High Court for unlawful possession of methamphetamine.\n\nThe State case was that on October 23, 2025, police officers manning a roadblock at the 18km peg along Bulawayo-Plumtree road stopped a South African-registered Mann truck heading towards Plumtree.\n\nIt was further heard that the police requested the Tanzanian driver to produce a temporary import permit and he failed, forcing the cops to search the vehicle. As this was happening, Amour, who was a passenger in the truck, led officers to the loading box where there were lunch boxes wrapped in foil and loaded among bags of beans. He opened one of the boxes and started eating spaghetti in a bid to divert their attention.\n\nSome of the officers conducted a further search, leading to the discovery of more boxes containing methamphetamine hidden in a specially designed compartment on the roof of the truck.\n\nSensing danger, the driver and another passenger fled the scene, but the offender was arrested before he could escape. The truck was subsequently seized and forfeited to the State.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said drug misuse and trafficking in harmful substances were destroying lives and communities across the country hence the need for stiffer sentences against peddlers.\n\nCases like this highlight the serious consequences of choosing the drug trade over honest living. Let this be a warning to all, the law is watching and the courts are taking a firm stance, the NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A TANZANIAN has been sentenced to an effective 15 years’ imprisonment following his conviction by a Zimbabwean court for drug trafficking. The offender, Sleiman Amour (44), appeared at the Bulawayo High Court for unlawful possession of methamphetamine. The State case was that on October 23, 2025, police officers manning a roadblock at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanzanian-jailed-15-years-for-drug-trafficking-in-zimbabwe/\">Tanzanian jailed 15 years for drug trafficking in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:31",
            "date": "06 Nov 2025"
        }
    ]
}