{
    "news": [
        {
            "title": "Kadoma man acquitted of love-triangle murder after two years behind bars",
            "url": "https://www.newzimbabwe.com/kadoma-man-acquitted-of-love-triangle-murder-after-two-years-behind-bars/",
            "content": "By Mary Taruvinga\n\nA Kadoma man accused of stabbing another miner to death in a suspected love triangle has been acquitted after the High Court ruled that police bungled investigations and relied on genuine but mistaken witnesses.\n\nJustice Philda Muzofa cleared Mashoko Midzi of murdering Stanly Mpofu, who was stabbed four times and died at Chimwendo Compound, Battlefields, on December 23, 2022.\n\nMidzi had been arrested in dramatic fashion, shot twice by police who claimed he attacked them with a machete. But in a damning judgment, the court said there was no proof he resisted arrest or carried the alleged weapon.\n\nThe evidence placed before us established police high-handedness when they arrested the accused, Justice Muzofa ruled. Of all the strange evidence placed before us, the following can take the prize Surely how can two police officers contradict each other on such a pertinent issue unless nothing of this sort happened?\n\nAccording to the State, Mpofu had clashed with Midzi earlier that day at a canteen where they argued over Beatrice Chinamasa, a young cook who had just started working there. Chinamasa later confirmed she was dating Mpofu, but said she never saw Midzi that day and did not know he was allegedly interested in her.\n\nWitness Agatha Sibanda, Mpofus aunt and the canteen owner, told the court she saw Midzi chasing her drunken nephew before he collapsed, bleeding heavily. But the judge found her evidence unreliable.\n\nHer evidence was that she saw his clothes. That is weak identification, said Justice Muzofa. Jeans and gumboots are common clothes in the mining communities for men. We conclude that Agatha was a genuine but mistaken witness.\n\nMidzi insisted from the start that he was innocent, saying he spent the night drinking beer at Fambai Bar with friends and relatives. He raised this alibi in his warned-and-cautioned statement just days after the killing.\n\nThe court criticised investigators for failing to properly test that defence. It was within the polices capacity to record statements from Moyo Mine, the accuseds companions or someone from Fambai Bar. They did not, the judge said. The alibi remained intact.\n\nAlthough the State had raised a strong suspicion that Midzi may have killed Mpofu, the judge stressed that suspicion was not enough.\n\nThe standard of proof in criminal cases is proof beyond a reasonable doubt, she ruled. In this case, the evidence raised many unanswered questions, leading to doubt. In such instances, the matter is resolved by giving the accused the benefit of doubt.\n\nMidzi was acquitted and walked free after more than two years of fighting the charge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A Kadoma man accused of stabbing another miner to death in a suspected love triangle has been acquitted after the High Court ruled that police bungled investigations and relied on “genuine but mistaken” witnesses. Justice Philda Muzofa cleared Mashoko Midzi of murdering Stanly Mpofu, who was stabbed four times and died at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadoma-man-acquitted-of-love-triangle-murder-after-two-years-behind-bars/\">Kadoma man acquitted of love-triangle murder after two years behind bars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        },
        {
            "title": "Tendayi Nyeke’s star-studded ‘Loved Out’: where real life meets comedy gold",
            "url": "https://www.newzimbabwe.com/tendayi-nyekes-star-studded-loved-out-where-real-life-meets-comedy-gold/",
            "content": "IOL\n\nThis month, a chaotic and hilarious comedy, starring several South African A-listers, is scheduled for release in cinemas.\n\nLoved Out starringSomizi Mhlongos daughter,Bahumi Mhlongoand veteran actressKhabonina Qubeka, tells a story that many can relate to: love is important, but self-love is vital.\n\nThe movie is slated for a September 26 release and is written, directed and produced by Tendayi Nyeke.\n\nUnder the direction of Tendayi Nyeke, Loved Out tells a story that many can relate to  love is important, but self-love is vital. Image:Supplied.\n\nDespite her ambition and drive to run her family restaurant, she often finds herself in the role of caretaker for her mother,Gloria, played byQubeka.\n\nGlorias wild behaviour often complicates Ruvas dreams, making the journey to success a comedic rollercoaster.\n\nLoved Out explores the idea that love for others, for our passions and places, isnt enough to make us whole unless we nurture self-love, shares Nyeke.\n\nShe continues: It showcases the struggles we go through when trying to grow personally while the people we love might seem to be standing in our way.\n\nThe movie is inspired by Nyekes own journey when she moved to South Africa from Zimbabwe nearly ten years ago.\n\nFaced with economic difficulties and grief, she started observing others coping with hardship and the absurd situations that arose; she decided to blend these experiences into a unique story.\n\nDespite my dreams, goals and the love I shared with others, external pressures made it incredibly difficult to thrive. I observed how people around me, including my own family, struggled to make sense of their circumstances, and how influential people like religious figures or those with more resources would take advantage of such crises.\n\nThrough this experience, I found humour in the absurdity of how some find opportunities in others struggles. Loved Out was born from my attempt to navigate a world that wasnt easily accommodating my dreams, drawing from characters I know, aspects of myself, and things I cherish to create this cinematic world.\n\nNyeke said the movie tackles parent-child relationships, the pursuit of dreams and self-love.\n\nWe look at the nuance and complexity of parent-child dynamics, specifically portrayed through the mother-daughter relationship between Bahumi and Khaboninas characters. Parent-child relationships have many layers that can hurt such a bond.\n\nBut its not always easy to talk about. It exposes the struggle a child may face in finding their own voice, particularly in cultures where challenging elders is not encouraged. The film questions what happens when these elders become chaotic and suffocating.\n\nThe film explores the difficult decisions one must make to achieve their dreams, and how far we are willing to go to fulfil our ambitions and finally, self-love. We often seek validation from relationships and careers, so they end up defining our identity.\n\nThis theme explores what it truly means to love oneself, even when the results are not the desired outcome for those around you.\n\nKhabonina Qubeka. Image: Supplied.\n\nNyeke adds that Loved Out is about finding joy and humour even in tough times, echoing the resilience many Africans possess.\n\nLoved Out offers a comedic reflection of ourselves.As an African person, I appreciate our ability to find humour even in the most challenging situations. Instead of being crippled by adversity, we often find a way out by embracing the hilarious and crazy aspects of life.\n\nI hope this movie brings joy, humanity and beauty to audiences, allowing them to see themselves and others, laugh and process their own experiences through art.\n\nWorking with a talented ensemble cast, including Tumi Morake, Ayakha Ntunja and Marcus Mabusela, Nyeke expressed her gratitude for the support and expertise of the cast.\n\nShe notes how privileged she felt to work with such talented women in telling this female-driven story.\n\nA scene from Loved Out. Image: Supplied.\n\nWorking with incredible talents Khabonina Qubeka and Tumi Morake was an incredible honour. I was initially intimidated as a first-time director, but they were incredibly generous with their expertise, humour and willingness to go the extra mile.\n\nI learned an immense amount from them and felt incredibly blessed to be supported by such formidable women who championed a female-led story.\n\nNyekes vision for the film extends beyond entertainment; she hopes Loved Out will become a catalyst for dialogue between mothers and daughters, encouraging them to talk about difficult subjects through its engaging narrative.\n\nI invite mothers and daughters who struggle with difficult conversations to watch this film together at the movies and use it as a catalyst for dialogue. I invite couples, friends and families to come and be part of the conversation.\n\nUltimately, I want people to experience a wide range of wonderful and sometimes challenging emotions in community, because community makes us better.\n\nWatch the trailer below.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/18054040/loved-out-scene.png",
            "description": "<p> IOL This month, a chaotic and hilarious comedy, starring several South African A-listers, is scheduled for release in cinemas. “Loved Out” starring Somizi Mhlongo‘s daughter, Bahumi Mhlongo and veteran actress Khabonina Qubeka, tells a story that many can relate to: love is important, but self-love is vital. The movie is slated for a September 26 release and is written,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tendayi-nyekes-star-studded-loved-out-where-real-life-meets-comedy-gold/\">Tendayi Nyeke’s star-studded ‘Loved Out’: where real life meets comedy gold</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe Central Bank deputy says time for dollar debate is over",
            "url": "https://www.newzimbabwe.com/zimbabwe-central-bank-deputy-says-time-for-dollar-debate-is-over/",
            "content": "Bloomberg\n\nZimbabweansshould focus more on their gold-backed currency thats set to become the sole legal tender by 2030 and less on how to phase out dollar use, according to the central banks deputy governor.\n\nWe should talk about mono-currency, the time to talk about de-dollarization is over,Innocent Matshesaid at an annual finance ministry conference Wednesday held in Bulawayo, the nations second largest city. We should think about our own currency, not on how to get rid of another currency.\n\nInnocent Matshe Photographer: Cynthia R Matonhodze/Bloomberg\n\nThe comments underscore the authorities resolve to adopt the ZiG  short for Zimbabwe Gold  as the sole currency, replacing the US dollar, which has been used for transactions since 2009.\n\nThe central bank earlier this month outlined steps needed before the local unit can be fully adopted. These included building sufficient foreign currency reserves and slashing annual inflation from 94% to single digits.\n\nThe ZiG wasintroducedin April 2024, marking the southern African nations sixth effort to stand up a viable local currency after previous efforts failed amid sky-high inflation and collapsing values on foreign exchange markets.\n\nSigns of improving sentiment toward the ZiG include a slowdown in the rate at which it is exchanged for US dollars, said Matshe, citing banking data. Currently, the ZiG accounts for about 40% of transactions in the economy\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Zimbabweans should focus more on their gold-backed currency that’s set to become the sole legal tender by 2030 and less on how to phase out dollar use, according to the central bank’s deputy governor. “We should talk about mono-currency, the time to talk about de-dollarization is over,” Innocent Matshe said at an annual finance ministry conference Wednesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-central-bank-deputy-says-time-for-dollar-debate-is-over/\">Zimbabwe Central Bank deputy says time for dollar debate is over</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        },
        {
            "title": "Avenues Clinic lays off 50 workers, accused of targeting unionised staff",
            "url": "https://www.newzimbabwe.com/avenues-clinic-lays-off-50-workers-accused-of-targeting-unionised-staff/",
            "content": "By Alois Vinga\n\nThe prestigious Avenues Clinic in Harare has begun a retrenchment exercise that will result in the layoff of 50 employees, according to insiders, who allege that this move is aimed at targeting unionised workers.\n\nThe private, multi-disciplinary hospital, a flagship facility of Medical Investments Limited (MIL), now risks being drawn into a major labour dispute.\n\nSources close to the developments toldNewZimbabwe.comthis week that the exercise appeared highly questionable.\n\nA total of 50 workers have since been served with Notices to retrench by the employer. Finer details on the reasons behind the job cuts and terminal benefits to be paid remain unclear. What boggles the mind is that the workers have since been placed on paid leave while the organisation has moved swiftly to replace some of the targeted workers, one insider said on condition of anonymity.\n\nAnother source alleged that the retrenchments disproportionately affected staff who were members of trade unions.\n\nOver and above all these shortcomings, we need to understand why the company has hurriedly replaced the affected workers in some sections, while others have been replaced through outsourcing services like cleaning. Among those recruited recently are allegations that they were warned against being unionised as a condition of service, the source claimed.\n\nThe affected employees are now expecting a reasonable termination package as they argue that the employers decision has nothing to do with the inability to pay salaries.\n\nWhen contacted for comment, MIL general manager Sibusisiwe Ndlovu neither confirmed nor denied the allegations, instead referringNewZimbabwe.comto the internal communications department, which had not responded by the time of publication.\n\nHowever, a letter seen byNewZimbabwe.com,dated September 16, 2025, and signed by Ndlovu, confirmed the institutions decision to retrench some staff. The letter, addressed to one affected employee (name withheld), reads in part:\n\nWe wish to advise you that your position has been affected by the restructuring exercise, therefore, you are among members of staff who will be retrenched. The intended retrenchment will take effect from the fourteenth day after the date of receiving this letter.\n\nEngagements with you shall commence soon, and it is our hope that a retrenchment agreement will be reached to facilitate an expeditious conclusion of this in a manner which is fair and transparent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/18062948/avenues-clinic.jpg",
            "description": "<p>By Alois Vinga The prestigious Avenues Clinic in Harare has begun a retrenchment exercise that will result in the layoff of 50 employees, according to insiders, who allege that this move is aimed at targeting unionised workers. The private, multi-disciplinary hospital, a flagship facility of Medical Investments Limited (MIL), now risks being drawn into a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/avenues-clinic-lays-off-50-workers-accused-of-targeting-unionised-staff/\">Avenues Clinic lays off 50 workers, accused of targeting unionised staff</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        },
        {
            "title": "NPA bows to pressure as Chinese nationals found with cocaine face deportation",
            "url": "https://www.newzimbabwe.com/npa-bows-to-pressure-as-chinese-nationals-found-with-cocaine-face-deportation/",
            "content": "By Staff Reporter\n\nTHE National Prosecuting Authority (NPA) has succumbed to public pressure as it is in the process of deporting nine Chinese nationals who were found in possession of cocaine.\n\nThe nine Chinese nationals escaped jail with a US$150 fine, a judgement which riled the public.\n\nHarare magistrate Vakayi Chikwekwe ruled that the quantity of cocaine that the nine Chinese were in possession of was insignificant, justifying the ruling.\n\nIn a statement, NPA said the Chinese nationals are awaiting deportation for violating the countrys laws.\n\nThe NPAZ is committed to ensuring that all individuals are held accountable for their actions in accordance with the laws of Zimbabwe, regardless of their nationality or status.\n\nFurthermore, the NPAZ can confirm that the nine individuals are currently awaiting deportation. We will continue to work tirelessly to combat the scourge of dangerous drugs, as it poses a significant threat to the well-being of our nation, read the statement.\n\nThe leniency of the judgement was castigated, with Zimbabwean government accused of being too soft on the Chinese with whom they have a good relationship.\n\nIn comparison, being found in possession of drugs in China is met with a harsher punishment, in some cases death penalty.\n\nNPA said the judicial system will be tightened against individuals found in drug peddling.\n\nThe NPAZ is taking concrete and decisive steps to ensure future prosecutions for drug-related offences are handled with the utmost efficiency and effectiveness.\n\nHenceforth, all Public Prosecutors have been instructed to prefer the correct charges in all drug-related cases, and ensure that they aggressively pursue stiffer sentences in court, to secure penalties that truly reflect the seriousness of these offences.\n\nThis stance is a direct reflection of the direction that Zimbabwe has taken to combat drug abuse, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17162838/cocaine.jpg",
            "description": "<p>By Staff Reporter THE National Prosecuting Authority (NPA) has succumbed to public pressure as it is in the process of deporting nine Chinese nationals who were found in possession of cocaine. The nine Chinese nationals escaped jail with a US$150 fine, a judgement which riled the public. Harare magistrate Vakayi Chikwekwe ruled that the quantity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/npa-bows-to-pressure-as-chinese-nationals-found-with-cocaine-face-deportation/\">NPA bows to pressure as Chinese nationals found with cocaine face deportation </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe’s richest man plans to build five new AI factories across Africa",
            "url": "https://www.newzimbabwe.com/zimbabwes-richest-man-plans-to-build-five-new-ai-factories-across-africa/",
            "content": "Business Insider Africa\n\nZimbabwean billionaire Strive Masiyiwa has announced plans to build five artificial intelligence (AI) factories across Africa within the next year, as part of a $720 million investment through his company Cassava Technologies.\n\nThe factories are expected to be built in South Africa, Nigeria, Kenya, Egypt and Morocco.\n\nMasiyiwa said the goal is to give major African markets access to their own advanced AI infrastructure, reducing reliance on overseas cloud providers.\n\nHe described the plan as part ofCassavas Sovereign AI Cloud strategy, which aims to allow African countries to host and run their own AI systems locally.\n\nOur AI factory provides the infrastructure for innovation to scale, empowering African businesses, start-ups, and researchers with access to cutting-edge AI infrastructure. Now they dont have to look beyond Africa to get it, he said.\n\nMasiyiwa, who isworth about $1.3 billion, is known for building Econet Wireless into one of Africas largest telecom groups.\n\nIn recent years, he has expanded Cassava from telecoms into cloud computing, fintech, cybersecurity andartificial intelligence.\n\nThefirst AI factory is already under developmentin South Africa and will run on 3,000 Nvidia graphics processing units (GPUs).\n\nCassava says much of this computing power has already been reserved by African researchers and developers.\n\nCompany officials said the new facilities will help close a major gap in Africas digital economy.\n\nOnly about 5% of African AI talent currently has access to the high-performance computing power needed to train advanced AI models.\n\nBuilding local infrastructure could allow more African researchers to develop homegrown tools in sectors like finance, education, health and agriculture.\n\nCassava also plans to link the AI factories to its wider digital network, which includes Africa Data Centres, Liquid Intelligent Technologies, and Liquid C2.\n\nThese companies already provide data storage, internet connectivity and cybersecurity services across the continent.\n\nEarlier this year, Cassava launched a dedicated AI business unit and signed partnerships with global tech firms including Microsoft, AWS, Google and Anthropic to support African developers.\n\nAnalysts say the push could helpAfrica compete in the fast-growing global AI industrywhile keeping sensitive data on the continent.\n\nIt could also reduce costs for local startups and governments, who often pay high fees to store and process data overseas.\n\nIf completed on schedule, all five factories are expected to be operational by late 2026, positioning Cassava as one of the biggest builders of AI infrastructure in Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/03054027/Strive-Masiyiwa.jpg",
            "description": "<p>Business Insider Africa Zimbabwean billionaire Strive Masiyiwa has announced plans to build five artificial intelligence (AI) factories across Africa within the next year, as part of a $720 million investment through his company Cassava Technologies. Strive Masiyiwa, Zimbabwean billionaire, will invest $720 million to establish five AI factories across Africa. These facilities, built in part</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-richest-man-plans-to-build-five-new-ai-factories-across-africa/\">Zimbabwe’s richest man plans to build five new AI factories across Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        },
        {
            "title": "Ex-CIO boss Isaac Moyo appointed Zimbabwe’s ambassador to the United Arab Emirates",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-isaac-moyo-appointed-zimbabwes-ambassador-to-the-united-arab-emirates/",
            "content": "By James Muonwa\n\nFORMER director-general of the dreaded Central Intelligence Organisation (CIO), Isaac Annanias Moyo, has been appointed the countrys ambassador plenipotentiary to the United Arab Emirates (UAE).\n\nThrough an Extraordinary Government Gazette dated September 17, 2025, Chief Secretary to the Office of the President and Cabinet (OPC), Martin Rushwaya announced Moyos deployment.\n\nIt is hereby notified that His Excellency the President has, in terms of section 110 (2)(i) as read with section 204 of the Constitution of Zimbabwe Amendment (No.20) Act 2013, appointed Isaac Annanias Moyo as Ambassador Extraordinary and Plenipotentiary to United Arab Emirates, reads the notice.\n\nBefore assuming the CIOs top post after the 2017 military-assisted operation that ushered Mnangagwa to the presidency, Moyo was Zimbabwes ambassador to South Africa. He was eventually removed as CIO boss under unexplained circumstances.\n\nMeanwhile, President Mnangagwa has also made three other ambassadorial appointments through the same gazette.\n\nDavid Douglas Hamadziripi, who was ambassador to South Africa, has been shunted to the United States of America and will be replaced by Lovemore Mazemo.\n\nPatrick Ronald Mutasa has been named the countrys new representative to Cuba, a nation which has enjoyed long-standing cordial bilateral relations with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08185755/isaac-moyo.jpg",
            "description": "<p>By James Muonwa FORMER director-general of the dreaded Central Intelligence Organisation (CIO), Isaac Annanias Moyo, has been appointed the country’s ambassador plenipotentiary to the United Arab Emirates (UAE). Through an Extraordinary Government Gazette dated September 17, 2025, Chief Secretary to the Office of the President and Cabinet (OPC), Martin Rushwaya announced Moyo’s deployment. “It is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-isaac-moyo-appointed-zimbabwes-ambassador-to-the-united-arab-emirates/\">Ex-CIO boss Isaac Moyo appointed Zimbabwe’s ambassador to the United Arab Emirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "18 Sep 2025"
        }
    ]
}