{
    "news": [
        {
            "title": "R. Kelly’s sex trafficking conviction upheld",
            "url": "https://www.newzimbabwe.com/r-kellys-sex-trafficking-conviction-upheld/",
            "content": "A federal appeals court on Wednesday upheld R. Kellys sex trafficking and racketeering conviction, saying extensive evidence supported keeping the former R&B superstar behind bars for decades.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29105643/R-Kelly.png",
            "description": "<p>Reuters A federal appeals court on Wednesday upheld R. Kelly’s sex trafficking and racketeering conviction, saying extensive evidence supported keeping the former R&B superstar behind bars for decades. The 2nd U.S. Circuit Court of Appeals in Manhattan rejected Kelly’s claims that federal prosecutors failed to prove he led a racketeering scheme where he recruited women</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/r-kellys-sex-trafficking-conviction-upheld/\">R. Kelly’s sex trafficking conviction upheld</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Implats production falls as challenges mount in PGM market",
            "url": "https://www.newzimbabwe.com/implats-production-falls-as-challenges-mount-in-pgm-market/",
            "content": "Business Report\n\nImpala Platinums (Implats) production for the six months to December 2024 fell 4% to 1.8 million 6E ounces while its expects earnings for the interim period are expected to plunge despite sales volumes increasing by 5%, on the back of lower capital expenditures and expectations of a less rosy platinum group metals (PGM) outlook.\n\nImplats toldBusiness Reportlast month that it expected the PGM market to remain challenging over the near term.\n\nPGM miners are battling sustained weakness in prices of the commodity, prompting many of them to institute cost rationalisation that has included retrenchments and capital expenditure cuts.\n\nDespite restructuring operations and instituting retrenchments, interim group unit costs per 6E ounce for Implats are expected to increase by 3% to R20 900 on a stock-adjusted basis.\n\nAdditionally, moderating input inflation and labour savings were bolstered by rand appreciation on the translated dollar cost base of Zimplats in Zimbabwe and Impala Canada, said the company on Tuesday.\n\nImplats headline earnings and headline earnings per share for the half year to December are expected to be lower by between 40% and 49% at between R1.65 billion and R1.95bn, and between 184 cents and 217 cents per share, respectively.\n\nHeadline earnings for the period decreased primarily due to lower rand revenue arising from an 8% retracement in achieved rand revenue per 6E ounce sold, Implats said in a trading update Tuesday.\n\nLower dollar pricing was compounded by the strengthening rand exchange rate, which more than offset the benefit of improved refined and saleable output, higher sales volumes and strong cost controls achieved in the period.\n\nThe lower earnings performance of the company for the period comes against the backdrop of a fall in capital expenditure. It said that the commissioning of various projects during the half-year meant capital expenditure fell to R4bn due to lower levels of growth and replacement capital as projects neared completion.\n\nEarnings before interest, tax, depreciation and amortisation for the half year amounted to R6.5bn.\n\nOur expectation is that the physical market will improve further over time with an improved macro outlook, ongoing supply responses and a more pragmatic auto electrification outlook, Johan Theron, spokesperson for Implats toldBusiness Reportby email recently.\n\nHowever, the near term could remain bumpy for some time.\n\nIn terms of production, Implats output fell 4% to 1.82 million 6E ounces. Impala Rustenburg increased production by 2% to 687 000 stock-adjusted 6E ounces while Impala Bafokeng production amounted to 254 000 6E ounces in concentrate, benefiting from improved efficiencies at Styldrift.\n\nProduction from Marula remained challenged by constrained mining flexibility and organisational restructuring implemented in the period, with 6E concentrate production declining 10% to 101 000 ounces.\n\nThe Zimbabwean unit of Implats, Zimplats, saw its 6E production in matte decrease by 15% to 280 000 ounces. This has been attributed to accumulation of concentrates during the commissioning of the expanded smelter complex at Selous.\n\nAt Impala Canada, 6E concentrate volumes reduced by 20% weaker to 116 000 ounces, reflecting revised operating parameters and lower underground grade for the company.\n\nWhile Two Rivers recorded a 1% increase in 6E in concentrate production to 153 000 ounces, the companys Mimosa JV with Sibanye-Stillwater in Zimbabwe raised 6E in concentrate volumes for the period by 3% to 129 000 ounces, despite challenges presented by power outages that are hobbling producers in the country.\n\nImplats ended the half year period under review with excess inventory of about 375 000 6E ounces although sales volumes quickened 5% to 1.77 million 6E ounces. This was inclusive of saleable production from Impala Canada and Impala Bafokeng.\n\nThe softer US dollar basket pricing was compounded by appreciation in the rand exchange rate and group sales revenue decreased to circa R23 800 per 6E ounce sold, explained the company.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13045621/Implats-told-Business-Report-last-month-that-it-expected-the-PGM-market-to-remain-challenging-over-the-near-term-Picture-Supplied.webp",
            "description": "<p>Business Report Impala Platinum’s (Implats) production for the six months to December 2024 fell 4% to 1.8 million 6E ounces while its expects earnings for the interim period are expected to plunge despite sales volumes increasing by 5%, on the back of lower capital expenditures and expectations of a less rosy platinum group metals (PGM)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/implats-production-falls-as-challenges-mount-in-pgm-market/\">Implats production falls as challenges mount in PGM market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Forced Rehabilitation for Drug Offenders in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-forced-rehabilitation-for-drug-offenders-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss what parents or guardians can do when faced with children on drugs who require rehabilitation. What are the general requirements to qualify for rehabilitation?\n\nVM: Thank you\n\nIt is necessary to start by stating that rehabilitation comes in two forms, voluntary or involuntary. Though voluntary rehabilitation is uncommon because it presupposes that the drug user has accepted he or she has a problem he or she wants to solve, which is normally halfway down the road to recovery, it also makes the process easier for the guardians or family members and the drug user to ensure he is placed in rehabilitation.\n\nThe common position is the drug user will be in denial of the fact that they may need rehabilitation. The drug user, in most instances, does not think that they have a drug problem.\n\nSecondly, the requirements differ for 25-year-old drug users who are legally independent and children below the age of majority.\n\nReporter:You are correct to raise those points, let us start with the qualification for rehabilitation for adults or 25-year-old children.\n\nVM: The test to qualify for rehabilitation as an adult drug offender, is the same test that is used for mental disorder. The drug user must pose a danger to themselves and/ or others or that they have lost complete ability to take care of themselves due to a psychological impairment. This may be exhibited by a complete failure to maintain hygiene, eat or even worse, suicidal thoughts.\n\nThe common thing however is that these drug offenders normally start committing petty crimes, especially in the home. Parents hardly report these because they recognize that their child is under some form of sickness.\n\nThe alternative is that the petty crimes are reported to the police creating a criminal record, this criminal route is available for inebriates who have committed offences as a result of habitual intoxication. The courts may view this history of crimes committed as a result of intoxication and order rehabilitation.\n\nReporter: Should a guardian or family be of the mind that the drug user qualifies for rehabilitation, what can they do?\n\nVM: It is critical to understand that our constitution guarantees every persons freedom and that the freedom should not be arbitrarily taken from them. It follows therefore that the rehabilitation process must be sanctioned by the courts who weigh whether it is just to place the drug user in rehabilitation.\n\nAn order to place a person in forced rehabilitation is issued by a Magistrate who considers, among other alternatives, whether a person should be placed in forced rehabilitation after reviewing medical certification from two practitioners, one of whom must be a psychiatrist or government medical officer.\n\nThe Magistrate also considers whether the medical evidence meets the statutory threshold of mental disorder and imposes measures that are commensurate with the action imposed.\n\nReporter: What if the drug user/addict is causing harm to himself, is there another quicker option to rehabilitation that is not through criminal courts?\n\nVM: Our law permits emergency detention for 72 hours on the basis of a single medical practitioners certification where there is imminent harm to the patient. The medical practitioner will be required to present a report to the Magistrate within 24 hours for the Magistrate to decide whether the detention can be extended via a reception order.\n\nA failure to obtain the authority from the Magistrate within 72 hours renders the detention unlawful and the drug user qualifies for immediate release.\n\nReporter: Does the same apply to child offenders?\n\nVM: With children, guardians must demonstrate that the rehabilitation is necessary, in the best interest of the child and is the least restrictive on the child by giving examples of prior interventions.\n\nThe opinion of the child matters, especially those above 16, their opinions are considered. The starting point is the wariness of the judiciary to separate the child from its environment of love and care. The proposed rehabilitation is not supposed to disturb a stable environment, the educational needs of the childet cetera.\n\nThe main difference between adult forced rehabilitation and that for children is that the guardian or parent plays a critical role in determining whether forced rehabilitation should occur\n\nReporter: Thank you, Mr. Madzima we have to end here, because of our time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor atwww.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/15161941/Drug-Use-e1623770429846.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.  Reporter: Welcome back Mr. Madzima, this week we want to discuss what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-forced-rehabilitation-for-drug-offenders-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Forced Rehabilitation for Drug Offenders in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "In default for 25 years, Zimbabwe struggles to feed its citizens",
            "url": "https://www.newzimbabwe.com/in-default-for-25-years-zimbabwe-struggles-to-feed-its-citizens/",
            "content": "Bloomberg\n\nWe couldnt harvest anything from our field. Even the melons failed to grow, Bekezela Dube, a 32-year-old mother of four, told United Nations Assistant Secretary-General for Climate, Reena Ghelani, on a visit to the remote rural area of Maphisa.After more than two decades of economic turmoil, many Zimbabweans cant affordimported food. And fatigue has set in among humanitarian donors.\n\nThat leaves multilateral lenders and development finance institutions as the countrys best hope for feeding roughly half its population. Yet unlike other countries including neighboring Zambia, which has already received $1 billionfrom the World Bankand the International Monetary Fund to replenish its food supplies and hydropower-dependent energy system Zimbabwe is locked out of adding to its debt.\n\nZimbabwes creditors include the World Bank, the African Development Bank, the European Investment Bank and the Paris Club, all of which have declined to provide emergency funds. The IMF said it is bound by rules that preclude it from making loans to a country already in default to related organizations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13044443/maize-drought.jpeg",
            "description": "<p>Bloomberg  Over the last quarter century, Zimbabwe has failed to pay $21 billion in debt. Now, as the country struggles with the impact of a once-in-a-generation drought, ordinary Zimbabweans are paying the price. A prolonged hot and dry spell caused by the El Niño weather phenomenon has ravaged southern Africa, withering crops and leaving 26</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-default-for-25-years-zimbabwe-struggles-to-feed-its-citizens/\">In default for 25 years, Zimbabwe struggles to feed its citizens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "U.S funding cuts threaten HIV prevention efforts in Zimbabwe as truck-stop clinics suspend operations – Parliament urges govt to look for alternative support models",
            "url": "https://www.newzimbabwe.com/u-s-funding-cuts-threaten-hiv-prevention-efforts-in-zimbabwe-as-truck-stop-clinics-suspend-operations-parliament-urges-govt-to-look-for-alternative-support-models/",
            "content": "By Thandiwe Garusa\n\nTHE temporary closure of truck-stop clinics across Zimbabwe, following a recent cessation of USAID funding has raised alarm over a potential surge in HIV cases among high-risk populations, particularly long-distance truck drivers and sex workers.\n\nThese clinics have played a vital role in providing HIV prevention, testing, and treatment services in border towns and high-traffic areas.\n\nHowever, they have been temporarily closed due to the implementation of U.S. President Donald Trumps America First policy.\n\nSpeaking in a parliamentary session Tuesday, Member of Parliament for Hwange West Vusumuzi Moyo urged the Ministry of Health to take immediate action and look for alternative funding sources to ensure vulnerable communities continue to receive the necessary support in the fight against HIV/AIDS.\n\nWithout funding for laboratory tests, HIV counselling and antiretroviral medications, many truck drivers and sex workers who rely on these clinics may not have access to crucial HIV-related healthcare services. In turn, this could result in an increase in undiagnosed HIV cases and the lack of consistency of the ART adherence, both of which contribute to higher transmission rates, he said.\n\nWith funding cuts, the sustainability of these services is at risk and the impact could be felt in high HIV prevalence, decreased access to care and return to higher transmission rates.\n\nTo mitigate these effects, it is essential to explore and implore the Ministry of Health to seek alternative funding models and to strengthen our local healthcare system to ensure that the vulnerable population continues to receive the support they need in the fight against HIV/AIDS.\n\nMeanwhile, Population Solutions for Health (PSH) New Start Centres have temporarily halted services for patients on ART and those seeking PrEP refills.\n\nApproximately 1.2 million Zimbabweans benefit from the U.S Presidents Emergency Plan for AIDS Relief (PEPFAR), and over 1,600 public hospitals and clinics have received training and technical support from the US government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12194913/truck-stop-clinic.webp",
            "description": "<p>By Thandiwe Garusa THE temporary closure of truck-stop clinics across Zimbabwe, following a recent cessation of USAID funding has raised alarm over a potential surge in HIV cases among high-risk populations, particularly long-distance truck drivers and sex workers. These clinics have played a vital role in providing HIV prevention, testing, and treatment services in border</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-funding-cuts-threaten-hiv-prevention-efforts-in-zimbabwe-as-truck-stop-clinics-suspend-operations-parliament-urges-govt-to-look-for-alternative-support-models/\">U.S funding cuts threaten HIV prevention efforts in Zimbabwe as truck-stop clinics suspend operations – Parliament urges govt to look for alternative support models</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "The Hills Luxury Golf Estate: Teeing Off in Style in 2026",
            "url": "https://www.newzimbabwe.com/the-hills-luxury-golf-estate-teeing-off-in-style-in-2026/",
            "content": "IN just over a year, the wait will be over for golf enthusiasts. The Hills Luxury Golf Estates golf course will partially open in July 2026, with a soft launch allowing golfers to experience the challenging and beautiful course. The official opening of the golf course is slated for December 2026, when all 18 holes and facilities will be fully operational.\n\nThis highly anticipated world-class golf estate promises to revolutionize the citys golfing scene and set a new standard for luxury living.\n\nAs the construction of the golf course gathers momentum, excitement is building among golf enthusiasts, luxury seekers, and investors.\n\nThe Hills Luxury Golf Estate is a master-planned live, work, shop and play community that combines world-class golfing, luxurious living, and breathtaking views.\n\nRoad construction that leads to the residential side of the estate is already underway and expected to be complete by April ahead of the construction of the first villa and townhouse this May.\n\nThe 18-hole championship golf course, designed by renowned golf course architect, Peter Matkovich, promises to deliver an unforgettable golfing experience. With its lush green fairways, sparkling water features, and majestic baobab trees, this golf course is set to become one of the best in Zimbabwe.\n\nThe estates luxurious homes, designed by award-winning global architects, are a masterclass in elegance and sophistication. With spacious floor plans, high ceilings, and expansive windows, these stunning residences offer breathtaking views of the surrounding landscape.\n\nResidents will enjoy access to a range of world-class amenities, including a state-of-the-art clubhouse, swimming pool, gym, and spa. The Hills Luxury Golf Estate is more than just a residential development; its a game-changer for Harares economy.\n\nThe project is creating hundreds of jobs, both during construction and in the long term, contributing significantly to the local economy. The influx of tourists and golf enthusiasts will also boost local businesses, such as hotels, restaurants, and retail outlets.\n\nWe are thrilled to bring this world-class development to Harare, said Ken Sharpe, CEO of WestProp, the developers behind The Hills Luxury Golf Estate.\n\nOur goal is to create a luxurious lifestyle community that not only offers an unparalleled golfing experience but also contributes to the growth and development of Harares economy.\n\nMark your calendars for July 2026 and get ready to tee off in style at The Hills Luxury Golf Estate!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13045345/Screenshot-2025-02-13-at-06.53.02.png",
            "description": "<p>IN just over a year, the wait will be over for golf enthusiasts. The Hills Luxury Golf Estate’s golf course will partially open in July 2026, with a soft launch allowing golfers to experience the challenging and beautiful course. The official opening of the golf course is slated for December 2026, when all 18 holes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-hills-luxury-golf-estate-teeing-off-in-style-in-2026/\">The Hills Luxury Golf Estate: Teeing Off in Style in 2026</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "ZB US$2,7 million heist suspect challenges money laundering allegations",
            "url": "https://www.newzimbabwe.com/zb-us27-million-heist-suspect-challenges-money-laundering-allegations/",
            "content": "By Staff Reporter\n\nDenis Madondo, one of the suspects in the US$2,7 million ZB heist has challenged the State for prosecuting him on money laundering charges yet he was acquitted of robbing the bank.\n\nHe argued that it was illogical for the State to prosecute him over the same money involved in a case he had been cleared of wrongdoing.\n\nMadondo said this when his trial commenced before Harare magistrate Taurai Manuwere.\n\nIn the present case, the State alleges that Madondo went on a spending spree using the robberyloot.\n\nThe state alleges that he bought a Mercedes Benz worth US$9,000 and that he was found in possession of US$62,500.\n\nProsecutors said he failed to explain his source of funds.\n\nMadondo denied the allegations.\n\nHe said the facts being relied on by the State were the same as those in the robbery case which he was acquitted of.\n\nThis time around, the property is included as an exhibit in the present case of money laundering where it is suspected again that it was acquired through the commission of an unknown crime.\n\nThus, insofar as the US$62,500.00 cash is concerned, the alleged act in both offences against me remains the same as that of possessing cash suspected to have been acquired through commission of a crime.\n\nThe foregoing facts clearly indicate that, if the money laundering trial is to be allowed, I would be tried for an offence in respect of an act for which I previously have been acquitted on the merits, the act being my conduct of having in my possession the US$62,500 cash and the silver E320 Mercedes suspected to have been acquired through commission of crime, Madondo argued.\n\nMadondo was arrested together with Tendai Zuze, Never Mwamuka and Shadreck Njowa for the alleged offence where US$2,7 million which was meant to be delivered to several ZB bank branches in Chinhoyi vanished.\n\nZuze was acquitted last year by the High Court on the basis that the States evidence to link him to the crime was insufficient.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/16054829/ZB-BANK-1.jpg",
            "description": "<p>By Staff Reporter Denis Madondo, one of the suspects in the US$2,7 million ZB heist has challenged the State for prosecuting him on money laundering charges yet he was acquitted of robbing the bank. He argued that it was illogical for the State to prosecute him over the same money involved in a case he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zb-us27-million-heist-suspect-challenges-money-laundering-allegations/\">ZB US$2,7 million heist suspect challenges money laundering allegations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zimbabwe isn’t yet ready for a sole currency, finance chief says",
            "url": "https://www.newzimbabwe.com/zimbabwe-isnt-yet-ready-for-a-sole-currency-finance-chief-says/",
            "content": "Bloomberg\n\nZimbabwes Finance Minister Mthuli Ncube said the southern African nation needs to regain access to credit lines before it can adopt the ZiG as its sole currency.\n\nWe need a few things in place before the nation can have a mono currency, including making progress on restructuring $21 billion in debt, Ncube said. The nation has been locked out of capital markets since 1999 after defaulting on its debt.\n\nClearing the arrears would allow us to access balance of payments support, in terms of credit lines to support Zimbabwes reserve position, deal with demand by importers and defend the currency, Ncube said.\n\nThe ZiG, short for Zimbabwe Gold, was introduced in April to replace the dollar as the nations main transacting currency, after several previous attempts failed.\n\nThe new currency has faced setbacks including a 43% devaluation in September and calls for it to be abandoned.\n\nTo support the currency the central bank has spent more than $400 million and significantly tightened liquidity.\n\nAn International Monetary Fund team is in the country until February 13 to determine whether to place Zimbabwe on a so-called staff-monitored program, a crucial to for the nation to secure a debt overhaul.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>Bloomberg Zimbabwe’s Finance Minister Mthuli Ncube said the southern African nation needs to regain access to credit lines before it can adopt the ZiG as its sole currency. “We need a few things in place” before the nation can have a mono currency, including making progress on restructuring $21 billion in debt, Ncube said. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-isnt-yet-ready-for-a-sole-currency-finance-chief-says/\">Zimbabwe isn’t yet ready for a sole currency, finance chief says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Kalisto Pasuwa appointed Malawi head coach",
            "url": "https://www.newzimbabwe.com/kalisto-pasuwa-appointed-malawi-head-coach/",
            "content": "By Sport Reporter\n\nCelebrated Zimbabwean football coach Kalisto Pasuwa has been appointed the head coach for Malawis mens football team.\n\nNicknamed Manabundu, Pasuwa has signed a two-year contract which will see him leading The Flames until 2027.\n\nThe former Dynamos coachs substantive appointment comes after he led the side from November last year onaninterim basis.\n\nThe Football Association of Malawi (FAM) has today unveiled former FCB Nyasa Big Bullets Coach Kalisto Pasuwa as the new Malawi Mens Senior National Team Head Coach.\n\nThe Zimbabwean will be in charge of the Flames for two years, the football association said in a statement.\n\nPasuwa enjoyed a huge success as the head coach for Malawi football giants Nyasa Big Bullets.\n\nAt Nyasa, he won four consecutive league titles and several silverware before parting ways with the side in December 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12135744/Kalisto-Pasuwa.webp",
            "description": "<p>By Sport Reporter Celebrated Zimbabwean football coach Kalisto Pasuwa has been appointed the head coach for Malawi’s men’s football team. Nicknamed Manabundu, Pasuwa has signed a two-year contract which will see him leading The Flames until 2027. The former Dynamos coach’s substantive appointment comes after he led the side from November last year on an interim basis.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kalisto-pasuwa-appointed-malawi-head-coach/\">Kalisto Pasuwa appointed Malawi head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        },
        {
            "title": "Zanu PF factional war: Police hunt for Geza; say he faces theft, incitement of public violence, insulting President charges",
            "url": "https://www.newzimbabwe.com/zanu-pf-factional-war-police-hunt-for-geza-say-he-faces-theft-incitement-of-public-violence-insulting-president-charges/",
            "content": "By Costa Nkomo\n\nThe Zimbabwe Republic Police (ZRP) has said it wants to question Blessed Runesu Geza, the outspoken war veteran opposing the 2030 agenda who faces four counts of criminal charges.\n\nThe charges include vehicle theft, undermining President Emmerson Mnangagwa, and inciting public violence.\n\nGeza, known as Bombshell, has been something of a thorn in the Presidents side.\n\nThis development follows a series of press conferences held by Geza and a group of Zanu PF war veterans, where they called for Mnangagwas resignation. They accuse the Zanu-PF leader of overseeing rampant corruption and nepotism, and of plotting to extend his term beyond the constitutionally mandated limit.\n\nGeza also turned his fire on the First Lady, Auxilia Mnangagwa, accusing her of wasting state resources on what he deems unnecessary tours around the country.\n\nConstitutional experts such as Professor Lovemore Madhuku have long maintained that such a term extension is legally impossible.\n\nWhile Mnangagwa himself has publicly pledged to step down at the end of his term in 2028, critics warn that this is simply his modus operandi  giving the impression of heading one way while veering sharply in another.\n\nThey point to his continued silence on the matter, failing to quash those who advocate for a term extension, as further evidence.\n\nMnangagwas term concludes in 2028, yet some of his allies and party members persist in calling for him to remain in power until 2030.\n\nGeza, a Zanu-PF Central Committee member, delivered his most recent press conference on Monday, urging Zimbabweans to prepare for a national shutdown as calls for Mnangagwas resignation grow louder, the tide is turning with the public.\n\nWe implore you to resign peacefully. If you dont resign in peace, people will use the constitution to exercise their right to push you out of office, Geza said.\n\nGeza also warned the police that if they dared to beat or shoot demonstrators protesting against Mnangagwa, the public would hold them accountable in their own neighbourhoods.\n\nIn response, police spokesperson Commissioner Paul Nyathi issued a statement on Wednesday, asserting that Geza faces charges of insulting Mnangagwa and inciting public violence.\n\nTheft allegations as defined in Section 113 of the Criminal Law Codification and Reform Act, Chapter 9: 23. The suspect stole and disposed of three vehicles belonging to a complainant without his consent.\n\nHe is also facing two counts of contravening Section 33 (2) (a) (ii) of the Criminal Law Codification and Reform Act, Chapter 9: 23, Undermining the Authority of or insulting the President,' Nyathis statement reads.\n\nCommissioner Nyathi further stated that Geza had incited the public to commit violence, violating the Criminal Code and Reform Act.\n\nOne count of contravening Section 187 of the Criminal Law Codification and Reform Act, Chapter 9:23, Incitement to commit public violence, Nyathi said.\n\nNyathi also cautioned that anyone found harbouring Geza or assisting him in evading police questioning would be equally liable for arrest and prosecution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12134842/geza.jpg",
            "description": "<p>By Costa Nkomo The Zimbabwe Republic Police (ZRP) has said it wants to question Blessed Runesu Geza, the outspoken war veteran opposing the “2030 agenda”  who faces four counts of criminal charges. The charges include vehicle theft, undermining President Emmerson Mnangagwa, and inciting public violence. Geza, known as Bombshell, has been something of a thorn</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-factional-war-police-hunt-for-geza-say-he-faces-theft-incitement-of-public-violence-insulting-president-charges/\">Zanu PF factional war: Police hunt for Geza; say he faces theft, incitement of public violence, insulting President charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "13 Feb 2025"
        }
    ]
}