{
    "news": [
        {
            "title": "US plays downs claims Hamas is violating ceasefire deal over hostage remains",
            "url": "https://www.newzimbabwe.com/us-plays-downs-claims-hamas-is-violating-ceasefire-deal-over-hostage-remains/",
            "content": "BBC\n\nThe US has downplayed claims that Hamas is violating the ceasefire deal with Israel by not returning all the bodies of dead hostages.\n\nOnly nine of the 28 dead hostages have been returned, with Hamas saying it needs time and specialised equipment to recover the others from the ruins of Gaza.\n\nThe latest wo bodies returned on Wednesday have been identified as Inbar Hayman and Sgt Maj Muhammad al-Atresh, the Israel Defense Forces said early on Thursday.\n\nThe row over the return of dead hostages has led Israel to limit promised aid supplies to Gaza, but two senior advisers to US President Donald Trump have said plans to demilitarise the Strip and build a new transitional government are under way.\n\nIn an update on the implementation of Trumps 20-point peace plan, the advisers told reporters that the US government did not so far believe Hamas had broken the agreement by not retrieving more remains.\n\nThe advisers argued that Hamas had acted in good faith by returning all living hostages and was working with various interlocutors to find and return the remains of the others.\n\nHamass armed wing said in a statement it was committed to the deal but had returned all the bodies of hostages it was able to reach.\n\nOne senior US adviser said the recovery of all the bodies could take weeks because of the level of destruction in Gaza.\n\nHe said rewards might be offered for Gazan civilians who gave information and that Turkish experts were expected to join the search.\n\nConfirming the return of two more deceased hostages on Thursday, the IDF said Hayman was 27 when she was killed by Hamas on 7 October 2023 at the Nova festival. Her body was taken into the Gaza Strip.\n\nSgt Maj al-Atresh, who was 39, fell in combat on the same day, the IDF said.\n\nHamas is required to fulfill its part of the agreement and make the necessary efforts to return all the hostages to their families and to a dignified burial, it added.\n\nIn a statement, the Hostages Families Forum said: The families of the hostages and of those released embrace the families of Inbar Hayman and Muhammad al-Atresh, whose loved ones came home yesterday for proper burial in Israel.\n\nAlongside the grief and the understanding that their hearts will never be whole, the return of Inbar and Muhammad, may their memories be a blessing, brings some measure of comfort to families who have lived with agonising uncertainty for over two years.\n\nWe will not rest until all 19 hostages are brought home.\n\nHamas is required to return all 28 dead hostages as part of thefirst phase of the Gaza peace plan.\n\nBut Hamass armed wing said in a statement the remaining bodies require significant efforts and specialised equipment to search for and retrieve, and we are making a great effort to close this file.\n\nEarlier, Israel said it would not compromise on hostage returns, saying the mission is not complete.\n\nIsraels defence minister said he had instructed the IDF to prepare a comprehensive plan to defeat Hamas in Gaza in the event of a renewal of the war.\n\nAfter meeting senior generals on Wednesday, Israel Katz said the military must be prepared to act if Hamas refuses to implement the peace plan.\n\nThe latest repatriations came after Israel said one of four bodies returned by Hamas on Tuesday was not one of the missing hostages.\n\nUN humanitarian chief Tom Fletcherhas urged Israel to immediately open all border crossings into Gazafor humanitarian aid, as called for in the ceasefire plan.\n\nIn a post on X, Fletcher said Hamas must make strenuous efforts to return all the bodies of the deceased hostages.\n\nHe added: As Israel has agreed, they must allow the massive surge of humanitarian aid  thousands of trucks a week  on which so many lives depend, and on which the world has insisted.\n\nHe called for a genuine, practical, problem-solving approach to removing remaining obstacles and said withholding aid from civilians is not a bargaining chip.\n\nTrumps ceasefire plan, which both Israel and Hamas accepted, envisaged the handover of all 48 hostages would be completed by noon on Monday. Hamas returned all the 20 living hostages on Monday.\n\nBut the US-brokered ceasefire agreement appears to acknowledge that Hamas and other Palestinian factions may not have been able to find all hostage remains before the initial deadline on Monday.\n\nUnder the agreement, Israel also agreed to hand over the bodies of 15 Palestinians in return for every deceased Israeli hostage.\n\nSo far, Israel has returned the bodies of 90 Palestinians in exchange for the Israeli hostages remains.\n\nMeanwhile in Gaza, residents report growing concern about the durability of the ceasefire  and food prices have surged as Palestinians stockpile food.\n\nTraders and suppliers in the enclave have been hoarding food items to create shortages and drive up profits, fearing that the war could resume, local residents told the BBC.\n\nEvery time we start to feel safe, new threats appear, and we fear the war will start all over again, says mother-of-six Neven Al-Mughrabi, a displaced resident from Gaza who lives in Khan Younis.\n\nI lost my house in Gaza City, I decided to stay here with my family because I dont trust the ceasefire and were sick of displacement.\n\nShe added that a trader in Khan Youniss main market said demand for flour, oil and sugar had surged within hours. Despite the sudden rise of prices by about 30%, people are buying as if they dont trust the calm will last long, everyone is afraid aid will stop, Neven says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16070756/gaza.webp",
            "description": "<p>BBC The US has downplayed claims that Hamas is violating the ceasefire deal with Israel by not returning all the bodies of dead hostages. Only nine of the 28 dead hostages have been returned, with Hamas saying it needs time and specialised equipment to recover the others from the ruins of Gaza. The latest wo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-plays-downs-claims-hamas-is-violating-ceasefire-deal-over-hostage-remains/\">US plays downs claims Hamas is violating ceasefire deal over hostage remains</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        },
        {
            "title": "Zimbabwe’s Nate Landman sets franchise tackles record for the Los Angeles Rams",
            "url": "https://www.newzimbabwe.com/zimbabwes-nate-landman-sets-franchise-tackles-record-for-the-los-angeles-rams/",
            "content": "ESPN\n\nZimbabwesNate Landmanset a franchise tackles record for theLos Angeles Ramsin their 17-3 win over theBaltimore Ravensas Week 6 saw African players dominate on defense.\n\nTheSeattle SeahawksJaxon Smith-Njigbawas the one shining light on offense this week, but after coming flying out of the blocks at the start of the season, wide receivers with ties to the continent generally had a more quiet round.\n\nArguably more than any before, this week showed that the NFLs attempts to grow the sport in Africa are bearing fruit  both in terms of developments on and off the field.\n\nThe impenetrable Landman  born in Harare  set a Rams franchise record with 17 total tackles in their win over the Ravens, including a quarterback hit and eight solo tackles.\n\nA convert from rugby, former Colorado Buffaloes linebacker Landman had arguably the best game of his American football career in the Rams win. His defining moment came on the stroke of half-time, as he contributed to two crucial stops within 10 yards of the end zone, as well as another earlier tackle in the same drive which saw the Rams held up over the course of eight plays.\n\nAt the time, the scores were deadlocked at 3-3. The Rams defense, led by Landman, prevented the Ravens from taking control at a crucial point in the game. In the third quarter, the Rams themselves took charge and never looked back.\n\nWhat a stop by our guys, really buckling up there,Landman told Tom Bradyfor Fox Sports after the legendary quarterback selected him as his LFG Player of the Game. Thats the pride of the defense right there, how you play goal line, and we rose up to the occasion. Way to set the tone for the rest of the game.\n\nSmith-Njigba, who has ties to Sierra Leone through his grandfather, is on a run where everything he touches turns to gold  and much of what he touches turns to touchdowns.\n\nThe wide receiver scored a 61-yard touchdown in the Seattle Seahawks 20-12 win over theJacksonville Jaguars. It came at a crucial time, too, as the Seahawks had been 6-3 behind midway through the second quarter before he crept in behind the defense and latched onto aSam Darnoldpass.\n\nAlthough Landman walks away with Africas MVP honors this week as far as we are concerned, Smith-Njigba is the most likely candidate from the continent to be in the running for NFL MVP a the end of the season.\n\nSmith-Njigba made a total of eight catches for 162 yards. Although there were many other moments worth celebrating from players with ties to Africa in week 6  notably a hugely impressive 72-yard kick return fromKene Nwangwu(ties to Nigeria) in theNew York Jets defeat to theDenver Broncos there was ultimately nobody who could top Smith-Njigba in terms of a notable single play.\n\nHonorable mentions\n\nUchenna Nwosu who has family ties to Nigeria  got 1.5 sacks for the Seahawks in their win over the Jaguars.\n\nNigeria-born duoDavid OnyemataandRuke Orhorhoroeach picked up a sack as theAtlanta Falconsupset theBuffalo Bills24-14.Charles Omenihu who has ties to Nigeria through his parents  got one for theKansas City Chiefsas they gained a crucial 30-17 win over theDetroit Lions.\n\nEyioma Uwazurike who also has parental ties to Nigeria  made a sack for the Denver Broncos in their narrow win over the New York Jets.\n\nOdafe Oweh raised in a Nigerian household in New Jersey  also had a memorable Sunday as he got a sack on debut for theLos Angeles Chargersin their 29-27 win over theMiami Dolphins. Oweh was recently traded from the Baltimore Ravens.\n\nWeek 6 was one to remember for African-born players, with few if any that can compare in recent memory. Landman (born in Zimbabwe), Onyemata, Orhorhoro (both born in Nigeria) and Paye (born in Guinea) all had performances to remember.\n\nThere was a crucial development off the field, too, as Nigerian International Player Pathway (IPP) Program standout Basil Chijioke CJ Okoye was officially signed to the Baltimore Ravens active roster from their practice squad shortly before his third straight NFL regular season appearance.\n\nOkoye and the Ravens may have ended up on the losing side against Landmans Rams, but he  just as much as the Zimbabwean  will remember the weekend for years to come.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16070248/nate-landman.jpeg",
            "description": "<p>ESPN Zimbabwe’s Nate Landman set a franchise tackles record for the Los Angeles Rams in their 17-3 win over the Baltimore Ravens as Week 6 saw African players dominate on defense. The Seattle Seahawks‘ Jaxon Smith-Njigba was the one shining light on offense this week, but after coming flying out of the blocks at the start of the season, wide receivers with ties</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-nate-landman-sets-franchise-tackles-record-for-the-los-angeles-rams/\">Zimbabwe’s Nate Landman sets franchise tackles record for the Los Angeles Rams</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        },
        {
            "title": "Zimbabwe reaffirms commitment to gender equality at Global Leaders’ Meeting on Women",
            "url": "https://www.newzimbabwe.com/zimbabwe-reaffirms-commitment-to-gender-equality-at-global-leaders-meeting-on-women/",
            "content": "Xinhua\n\nZimbabwes participation in the Global Leaders Meeting on Women is a testament to its unwavering commitment to advancing gender equality and womens empowerment, a senior government official said Tuesday.\n\nMavis Sibanda, permanent secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, told Xinhua in a written interview that the forum provides a platform for knowledge exchange, enabling Zimbabwe to learn from global best practices in advancing gender equality and womens empowerment, as well as to share its own experiences and innovations.\n\nAccording to Sibanda, the meeting also presents Zimbabwe with an opportunity to further strengthen bilateral and multilateral partnerships in promoting gender equality and womens empowerment.\n\nThis renewed global dialogue provides a platform for nations to reaffirm their dedication to implementing the Beijing Declaration and to advancing the 2030 Agenda for Sustainable Development, particularly Goal 5: Achieve gender equality and empower all women and girls, she said.\n\nZimbabwe is represented at the meeting by Minister of Women Affairs, Community, Small and Medium Enterprises Development Monica Mutsvangwa.\n\nSibanda said the minister highlighted the progress Zimbabwe has made over the years, from establishing gender-responsive institutions and policies that promote womens participation in leadership and decision-making, to investing in womens economic empowerment.\n\nMeasures such as expanding education and training opportunities for girls and young women, and promoting women-owned enterprises through dedicated funding mechanisms and entrepreneurial support programs, were also mentioned, she added.\n\nThese measures demonstrate Zimbabwes commitment to global development frameworks such as the Beijing Platform for Action and the United Nations Sustainable Development Goals, particularly Goal 5, Sibanda said.\n\nSince the adoption of the Beijing Declaration and Platform for Action, Zimbabwe has made substantial progress in implementing its provisions through policy reforms, institutional frameworks, and gender-sensitive programming, she added.\n\nThe global meeting, Sibanda noted, underscores the urgent need for collective international action to close persistent gender gaps and ensure that women are placed at the center of sustainable development efforts.\n\nIt further highlights the importance of international cooperation in formulating and implementing policies that empower women politically, socially and economically across all regions, she said.\n\nSibanda added that the global meeting holds profound significance as it marks the 30th anniversary of the landmark 1995 Fourth World Conference on Women in Beijing.\n\nThe conference, she said, laid the groundwork for the global advancement of gender equality and womens rights through the Beijing Declaration and Platform for Action, which continues to serve as a key guiding framework for gender equality initiatives worldwide.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16065506/monica.jpeg",
            "description": "<p>Xinhua Zimbabwe’s participation in the Global Leaders’ Meeting on Women is a testament to its unwavering commitment to advancing gender equality and women’s empowerment, a senior government official said Tuesday. Mavis Sibanda, permanent secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, told Xinhua in a written interview that “the forum</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-reaffirms-commitment-to-gender-equality-at-global-leaders-meeting-on-women/\">Zimbabwe reaffirms commitment to gender equality at Global Leaders’ Meeting on Women</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        },
        {
            "title": "DNC bus accident: Police want owner of medication found at crash scene to come forward",
            "url": "https://www.newzimbabwe.com/dnc-bus-accident-police-want-owner-of-medication-found-at-crash-scene-to-come-forward/",
            "content": "IOL\n\nThe South African Police Service (SAPS) in Limpopo has launched an official inquiry following the discovery of bottles appearing to be medication atthe site of the horrific bus crash on the N1 freeway near Makhado, which killed 43 people on Sunday.\n\nThe provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, confirmed that an inquiry docket has been opened by Makhado police in the Vhembe district to investigate the discovery. The bottles of medication were found on the accident scene, a few kilometres outside Makhado.\n\nThe inquiry comes as police explore potential contraventions of the countrys drug laws. According to the SAPS statement, Section 22A of the Medicines and Related Substances Act in South Africa makes it a crime to possess certain scheduled medicines without proper authorization.\n\nProvincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe. Image: SAPS\n\nLegally, someone is only permitted to possess and carry the quantity of medicine you have been prescribed by an authorized prescriber. Carrying a large quantity of medicine without exception is illegal, provincial police spokesperson, Colonel Malesela Ledwaba said.\n\nWhile the lawful owner of the medication has not yet been identified, police are treating the find seriously as their investigation into the cause of the fatal crash continues.\n\nThe tragedy occurred on Sunday, October 13, when a cross-border bus, reportedly travelling from Gqeberha to Zimbabwe and Malawi, veered off the mountainous road on the N1 and plunged down an embankment. The death toll rose to 43, with scores of other passengers injured.\n\nAlthough for now the lawful owner of the bottles of medication is not yet identified to get the explanation regarding its origin, the police have, in the meantime, opened an inquiry for further investigation, said Ledwaba.\n\nAnyone or the lawful owner of the medication is requested to contact the nearest police, call the SAPS toll-free number 08600 10111 or use the My SAPS App.\n\nVisuals seen on television news channels showed bottles of what appears to be BronCleer spewed among the luggage at the crash scene. The images and videos have sparked outrage, with many social media users accusing foreign nationals of looting South Africas health system.\n\nOn Tuesday,IOL reported that health authorities have moved to quash viral social media claims that South Africas public healthcare system is distributing BronCleer, a codeine-based cough syrup, insisting the medication is strictly controlled and only available through private or illegal channels.\n\nThe clarification comes amid a police bust in Kimberley that uncovered a stash of unregistered medicines  including BronCleer  being sold unlawfully by unlicensed operators.\n\nCity of Tshwanes MMC for Health Services, Tshegofatso Mashabela, has dismissed claims circulating on social media about public healthcare facilities in South Africa distributing BronCleer, a codeine-based cough syrup.\n\nMashabela clarified that BronCleer is a controlled substance and not included in the official formularies or procurement lists of any government hospitals or clinics.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL The South African Police Service (SAPS) in Limpopo has launched an official inquiry following the discovery of bottles appearing to be medication at the site of the horrific bus crash on the N1 freeway near Makhado, which killed 43 people on Sunday. The provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, confirmed that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-accident-police-want-owner-of-medication-found-at-crash-scene-to-come-forward/\">DNC bus accident: Police want owner of medication found at crash scene to come forward</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        },
        {
            "title": "Strathaven nurse guilty of cold-blooded murder, court rules she planned to kill sleeping husband",
            "url": "https://www.newzimbabwe.com/strathaven-nurse-guilty-of-cold-blooded-murder-court-rules-she-planned-to-kill-sleeping-husband/",
            "content": "By Mary Taruvinga\n\nA High Court has found a Harare nurse, Bridget Makaza, guilty of deliberately shooting her husband three times as he slept in their Strathaven home, in what the judge described as a calculated act of vengeance fueled by jealousy and deceit.\n\nJusticeEmelia Muchawa, sitting with assessors Mhandu and Barwa, ruled that Makaza planned and executed the murder of her husband, Macloud Zvavovaviri Mapanga, in May 2018 before fabricating a fake robbery to conceal the crime.\n\nThe accused unlawfully and with intent to kill, executed her husband while he slept, Justice Muchawa said in a damning finding. She aimed at the upper part of his body and delivered three fatal shots on the shoulders and neck, then staged an armed robbery to cover her tracks.\n\nThe court heard that the accused used a .38 Amadeo Rossi revolver with an erased serial number, which she had smuggled into Zimbabwe from South Africa after claiming she travelled there to buy medication.\n\nAccording to the State, on the night of May 14, 2018, the accused waited until her husband was asleep before firing three bullets, two in the shoulders and one grazing the neck. She then screamed Thief! Thief!, claiming robbers had broken in and stolen US$12,000.\n\nProsecutor B. Murevanhema said, There were no robbers. There was no break-in. The story was a fabrication to mask premeditated murder.\n\nPolice investigations uncovered inconsistencies in her story. The house had no signs of forced entry, and the firearm, gloves and metal objects were later recovered from a swampy area in Belvedere after the accused led detectives to the spot.\n\nThe nurse initially went to Mabelreign Police Station to lodge a false report of armed robbery. After being arrested and granted bail, she fled the country through South Africa and remained on the run until her re-arrest in December 2024 when she returned to Zimbabwe, claiming she missed her children.\n\nDuring the rial, the accused claimed she shot her husband in self-defence, saying he had accused her of witchcraft and attempted to attack her with the same gun.\n\nThe gun went off during a scuffle. I never intended to kill him, she told the court, further alleging years of abuse and marital rape.\n\nHowever, the judge dismissed her account as a lame and incredible fabrication, noting that forensic evidence showed the gun could not have discharged accidentally.\n\nA revolver requires deliberate trigger pressure. It cannot fire itself, said forensic expert Admire Mutizwa, whose testimony was pivotal in discrediting the self-defence claim.\n\nEvidence showed that Mapanga had multiple wives, up to eight, a fact the accused never accepted. While the court acknowledged possible emotional and sexual abuse, it found no credible proof of sustained physical violence.\n\nThe accused lied to everyone, the police, the neighbours, and even the court, Justice Muchawa noted. She lived a lie from the night of the shooting until her arrest. Her story about robbers was a deliberate deceit to obstruct justice.\n\nThe court concluded that Makaza procured the murder weapon in South Africa, smuggled it into Zimbabwe, and waited for an opportune moment to kill her husband.\n\nShe was methodical. She retrieved the gun while her husband was asleep and fired at close range, the judge said. Her conduct before, during, and after the murder shows beyond doubt that this was a planned execution.\n\nThe court found her guilty of murder with actual intent.\n\nSentencing is expected to follow.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A High Court has found a Harare nurse, Bridget Makaza, guilty of deliberately shooting her husband three times as he slept in their Strathaven home, in what the judge described as a calculated act of vengeance fueled by jealousy and deceit. Justice Emelia Muchawa, sitting with assessors Mhandu and Barwa, ruled that Makaza</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/strathaven-nurse-guilty-of-cold-blooded-murder-court-rules-she-planned-to-kill-sleeping-husband/\">Strathaven nurse guilty of cold-blooded murder, court rules she planned to kill sleeping husband </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        },
        {
            "title": "Fighting Winky D made him bigger – Mliswa urges government to embrace dancehall star",
            "url": "https://www.newzimbabwe.com/fighting-winky-d-made-him-bigger-mliswa-urges-government-to-embrace-dancehall-star/",
            "content": "By Darlington Gatsi\n\nOutspoken former legislator Temba Mliswa says the government and dancehall sensation Winky D should smoke a peace pipe, arguing that continued hostility towards the artist has only amplified his influence and popularity.\n\nWinky D, one of Zimbabwes most socially conscious musicians, has often clashed with authorities over his politically charged lyrics.\n\nTensions peaked in 2023 when government banned his music from state media following the release of his album Eureka Eureka, which featured songs tackling corruption, inequality, and social injustice.\n\nThe album drew the wrath of the government, which muzzled his music, and in the process, drew criticism from Human Rights Watch.\n\nMliswa says it is high time that the government collaborates with Winky D on its initiatives, particularly anti-drug abuse campaigns.\n\nI have always admired Winky D and the manner he goes about his business. He is one of the clean artists whom Gvt should engage to advance the message against drug abuse.\n\nThe ruling party must work with him and one can imagine the impact of engaging him with Jah Prayzah in this campaign, said Mliswa.\n\nWinky D has never shied away from using music as a conduit for speaking truth to power and castigating social ills.\n\nMliswa further commended Winky D for remaining steadfast amid the onslaught from the government.\n\nIts now clear that in trying to fight him they have only managed to make him bigger. My only issue is that he should be more accessible. Otherwise, he has managed to weather attacks, remaining focused, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04200421/WhatsApp-Image-2025-08-04-at-14.33.19-1-e1760592751566.jpeg",
            "description": "<p>By Darlington Gatsi Outspoken former legislator Temba Mliswa says the government and dancehall sensation Winky D should “smoke a peace pipe,” arguing that continued hostility towards the artist has only amplified his influence and popularity. Winky D, one of Zimbabwe’s most socially conscious musicians, has often clashed with authorities over his politically charged lyrics. Tensions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fighting-winky-d-made-him-bigger-mliswa-urges-government-to-embrace-dancehall-star/\">Fighting Winky D made him bigger – Mliswa urges government to embrace dancehall star</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        },
        {
            "title": "Man jailed 23 years for fatal New Year’s Day stabbing",
            "url": "https://www.newzimbabwe.com/man-jailed-23-years-for-fatal-new-years-day-stabbing/",
            "content": "By Mary Taruvinga\n\nA New Years Day beer-drinking confrontation at Old Pumula Shopping Centre turned deadly when Thembelenkosini Mlotshwa fatally stabbed Khulekani Mjaho with an AK-47 press-button knife, an act the High Court ruled was deliberate and executed with actual intent to kill.\n\nJustice Ngoni Nduna, sitting at the Bulawayo High Court convicted Mlotshwa of murder with actual intent and sentenced him to 23 years in prison, ruling that his conduct was cold, callous and intentional.\n\nThe accused stabbed the deceased so heavily that the knife penetrated deeply into the body, Justice Nduna said. There can be no other conclusion which can be sustained on the facts of this case other than that the accused intentionally caused the death of the deceased.\n\nAccording to the court record, the fatal incident occurred on January 1, 2025, when both men were drinking beer at Old Pumula Shopping Centre in Bulawayo.\n\nWitnesses testified that after being struck with a plastic chair by the deceased during a confrontation, Mlotshwa pulled out a knife from his person and stabbed Mjaho once in the abdomen before fleeing the scene.\n\nMjaho later died in the hospital. The post-mortem report listed the cause of death as haemorrhagic shock, abdominal visceral injury, and callous stabbing.\n\nMlotshwa denied intending to kill, claiming the deceased was the aggressor who attacked him first and that the stabbing occurred accidentally as he tried to disarm Mjaho.\n\nBut the court dismissed his version as difficult to comprehend and inconsistent with the eyewitness accounts.\n\nThe witnesses observed the accused taking out the knife and stabbing the deceased before running away, the judge said. It was in the morning and visibility was very good such that the witnesses could not have been mistaken on what they saw.\n\nNduna said the nature and depth of the stab wound, and the fact that it was aimed at a vital organ, proved intent.\n\nIn pursuance of the assault, one stab wound was inflicted  the degree of force and depth of the wound was severe, he ruled. The accused deliberately aimed at that part of the body and fled the scene upon landing the knife. That shows his intention to achieve the death of the deceased.\n\nThe judge noted that Mlotshwa could not claim drunkenness as mitigation because the murder occurred early in the morning and there was no evidence he was intoxicated.\n\nIn imposing a 23-year prison term, Nduna said the crime was aggravated by the use of a weapon and by the fact that the victim was a young father of two.\n\nThe deceased had a wife and children who are now without a father, the judge said. There is nothing in the commission of the offence which invites the court to mercy. The accused was armed and ready to use the knife.\n\nWhile emphasising that punishment must be fair and just instead of savage or draconian, the judge said mercy could not outweigh the gravity of taking another life.\n\nIt must not be lost that another human being was killed, Nduna said. There, a sentence of 25 years would have been fair, but for the mitigation outlined above, 23 years imprisonment is just.\n\nThe murder weapon was forfeited to the State for destruction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/03185920/Bloody-Knife.jpg",
            "description": "<p>By Mary Taruvinga A New Year’s Day beer-drinking confrontation at Old Pumula Shopping Centre turned deadly when Thembelenkosini Mlotshwa fatally stabbed Khulekani Mjaho with an AK-47 press-button knife, an act the High Court ruled was deliberate and executed “with actual intent to kill.” Justice Ngoni Nduna, sitting at the Bulawayo High Court convicted Mlotshwa of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-23-years-for-fatal-new-years-day-stabbing/\">Man jailed 23 years for fatal New Year’s Day stabbing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "16 Oct 2025"
        }
    ]
}