{
    "news": [
        {
            "title": "PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season",
            "url": "https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/",
            "content": "By Sports Reporter\n\nPremier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign.\n\nThe decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare.\n\nZIFA had initially proposed increasing the number of participating teams from 18 to 20, but PSL clubs went further, opting for a 22-team league next year.\n\nAs a result, all eight teams that were facing relegation this season will survive, while the four regional division champions will be promoted to the topflight, bringing the league to 22 clubs.\n\nIn a statement PSL revealed that the league will be trimmed back to 20 teams in 2027.\n\nThe PSL resolved to suspend relegation for the 2025 season.\n\nThe League will accommodate the newly promoted teams, resulting in an expanded league of twenty-two teams for a transitional period during the 2026 season.\n\nAfter the conclusion of the 2026 season, the League will revert to the proposed twenty team format beginning in the 2027 season, read part of PSL statement.\n\nThe move is meant to help ZIFA adopt a National First Division League which will feed the topflight league.\n\nIn addition, the PSL proposed a phased approach to the implementation of the National First Division League with the possibilities of it being fully operational within the next three years, PSL added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18152309/psl-zim-1-e1763479504235.jpg",
            "description": "<p>By Sports Reporter Premier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign. The decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare. ZIFA had initially proposed increasing the number of participating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/\">PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "18 Nov 2025"
        },
        {
            "title": "Cloudflare outage disrupts X, ChatGPT and other parts of the internet",
            "url": "https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/",
            "content": "The Verge\n\nCloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage thats taking down sites across the web. Users encountered error messages when trying to access X,ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs of recovery.\n\nMany sites displayed an error message saying Please unblock challenges.cloudflare.com to proceed. On Cloudflaresstatus page, the most recent update from the company at 9:34AM ET says:\n\nWeve deployed a change which has restored dashboard services. We are still working to remediate broad application services impact.\n\nIn a statement toThe Verge, Cloudflare spokesperson Jackie Dutton says the company noticed a spike in unusual traffic to one of its services starting at 6:20AM ET, causing some traffic passing through Cloudflares network to experience errors. Dutton adds, We do not yet know the cause of the spike in unusual traffic. We are all hands on deck to make sure all traffic is served without errors. The company is also planning to investigate the cause of the unusual spike in traffic.\n\nOther online services, including Indeed, Grindr, Uber, Canva, Spotify, NJ Transit,League of Legends, and Archive of Our Own, experienced issues during the outage, while digital outlets likeAxios,The Information, andPoliticoalso went down.\n\nThe Cloudflare outage comes less than a month after a hugeAmazon Web Services crash took downFortnite, Alexa, Snapchat, and other services, which was followed by issues atMicrosoft Azure that brought Xbox offlinefor hours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18150503/cloudflare.jpeg",
            "description": "<p>The Verge Cloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage that’s taking down sites across the web. Users encountered error messages when trying to access X, ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/\">Cloudflare outage disrupts X, ChatGPT and other parts of the internet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "18 Nov 2025"
        },
        {
            "title": "Zimbabwe’s miners spending a paltry US$11 million on exploration",
            "url": "https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/",
            "content": "By Alois Vinga\n\nA mineral asset valuation expert has raised alarm over Zimbabwes mining sectors paltry US$11 millionannual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more.\n\nMining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical and geochemical methods. It is the first and most critical stage of mining, involving mapping, surveys and exploratory drilling to identify potential ore bodies before mining decisions are made.\n\nSpeaking toNewZimbabwe.comon the sidelines of the inaugural Zimbabwe Gold Investment Conference on Monday, Ernst & Young Associate Partner Dr Godknows Njowasaid Zimbabwes exploration spending remains far too low.\n\nErnst & Young Associate Partner Dr Godknows Njowa\n\nIn terms of exploration, Zimbabwe spends only 0.2% of annual global exploration expenditure, and within Africa, we contribute just 2%. Yet Africas total share is around 9%, he said.\n\nSo this shows that in Zimbabwe, we are not spending enough money on exploration. During my presentation, I gave the example of Canada, which is the highest spender in the world at about 20% of the annual global exploration budget.\n\nNjowa warned that Zimbabwe continues to lose opportunities, saying the country has the potential to double its current gold outputif it adequately explores and develops new deposits.\n\nFor decision makers,both government and private sector,more money must be allocated to exploration. Gold mining companies globally are making super profits because prices are at levels not seen in the past 30 or 40 years.\n\nSo some of that money should be reinvested into exploration. You need to spend between US$50 and US$80 per ounceof what you produce on exploration, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga A mineral asset valuation expert has raised alarm over Zimbabwe’s mining sector’s paltry US$11 million annual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more. Mining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/\">Zimbabwe’s miners spending a paltry US$11 million on exploration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "18 Nov 2025"
        },
        {
            "title": "In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds",
            "url": "https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/",
            "content": "The Globe and Mail\n\nThe documentaryMbira Talks, about a Zimbabwean-Canadian musicians relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Eds department store in the background.\n\nThe lights went out in that building in 2016, and it was torn down a year later. Director Adrienne Amato originally planned to make a film about Stella Chiweshe, the pioneering rebel queen of the instrument, often referred to as a thumb piano because of the metal tines affixed to a wooden board that are struck by the first digits of the human hand.\n\nLogistics sabotaged the film on Chiweshe, who died in 2023 at age 76. Amato, who is white and was born in Zimbabwe when it was still under British rule as Rhodesia, immigrated to Toronto in 1977. After Chiweshes death, she shifted her focus to Mutamba. Still, the documentary, which premieres online and at the South African Film Festival in Toronto on Monday, took years to make, mostly because of money.\n\nIts very specific what gets funding these days, said the filmmaker, who joined Mutamba on a video call. Unless you have a celebrity in your doc or its a whodunnit crime thing, its a difficult landscape for making documentaries these days.\n\nAmato did not have a celebrity in her film, but she and Mutamba did have one on their side. Canadian indie-pop star Leslie Feist donated her frequent-flier miles for the trip to Africa by Amato, Mutamba and cinematographer Tess Girard. She also helped pay for the digging of a well at the Ubuntu Learning Village, the educational and community hub Mutamba co-founded in rural Zimbabwe.\n\nMutamba came to Canada more than 20 years ago to study economics at Trent University in Peterborough, Ont. The self-described village human finds Toronto too loud and crowded. In 2007, longing for a connection with his homeland, he took up the mbira, a ceremonial instrument tied to traditions of the Shona culture.\n\nThe late Chiweshe called the mbira a telephone to the spirits of people, water, trees and birds. Deeming it subversive, Rhodesias white authorities and Christian missionaries banned the instrument. The mbira is part of Mutambas educational mission involving food sovereignty, arts and cultural reclamation.\n\nIm intrigued by the power of community, he said. People are searching for it. Were all searching for village.\n\nFormer Toronto landmark Honest Eds can be seen across the street from Mutamba in a still from the documentary.Supplied\n\nMutamba is both a facilitator and a searcher himself. He longs for home, but Toronto is where he earns a living as co-director of Bloom Consulting, specializing in strategic planning, conflict mediation and psychotherapy. Canadas wealthy biggest city is his hunting place, where money is made to be used in Zimbabwe.\n\nThe mbira is more popular in Western Canada than in its eastern counterpart  Vancouver Island is the hotbed. Though the instrument is foreign to Canada, Mutamba believes its effect is universal.\n\nIt provokes certain emotions, he said. It is in the body. Its beyond the otherness. It is a sound that is human.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18051030/rainos-mutamba-mbira-canada.jpg",
            "description": "<p>The Globe and Mail The documentary Mbira Talks, about a Zimbabwean-Canadian musician’s relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Ed’s department store in the background. The lights went</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/\">In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "18 Nov 2025"
        },
        {
            "title": "ZimbosAbantu’s solar-powered mobile clinics deliver healthcare to villages in rural Zimbabwe",
            "url": "https://www.newzimbabwe.com/zimbosabantus-solar-powered-mobile-clinics-deliver-healthcare-to-villages-in-rural-zimbabwe/",
            "content": "Hackster\n\nRemoteness from care is a major challenge to health services worldwide. Half of the worlds population resides in rural areas, but only 36% of the global nursing workforce lives there. This means infant mortality, maternal death, and poor health outcomes are much prevalent in rural areas than in urban locations.\n\nTelehealth (healthcare delivery via electronic means) has helped in overcoming some barriers, but it requires internet access. One in three people globally will still live in a rural area by 2050, and there is a critical need for healthcare access solutions that are built to work in rural areas.\n\nIn rural Zimbabwe, a person who is sick might walk 15 to 20 kilometres to reach a clinic.ZimbosAbantu a social enterprise in Harare, Zimbabwes capital has a fleet of mobile clinics that offer medical services to vulnerable populations in the rural and peri-urban areas of the city. Its goal is to reduce the distance that women, youth, and children walk to access primary healthcare from 15km to 3km.\n\nZimbosAbantu roughly translates to Zimbabwean people. It operates five mobile clinics, offering services like dental care, maternal health, immunisation, eye care, and nutrition education.\n\nEach mobile clinic has a wind turbine and solar panels generating enough power for a 190-litre vaccine freezer. They are equipped with examination rooms, vital monitoring machines, diagnostic kits, and medications. They operate 12 hours a day and are staffed full-time by health professionals. Each clinic serves an average of 18-20 patients per day, or about 1000 patients per month.\n\nThe social enterprise was founded by Chiedza and Tawanda Mushawedu in 2021. Chiedza serves as the organizations executive director and previously worked for a private hospital. While working there, she saw people suffering from undiagnosed chronic conditions and dying from treatable conditions, simply because care was out of reach.\n\nZimbosAbantu offers a subsidised healthcare scheme to solve affordability disparities. Men, women, and youth are organized in groups of 10 or 20, and each member pays about $3 every month for access to healthcare, drugs, and other benefits. About 1,000 people are currently enrolled in the scheme.\n\nRemoteness from care is a wide-scale problem that needs a similarly-sized solution. ZimbosAbantu has recently added more vehicles to its fleet and expanded its operations to a second province. In a conversation with Africa Business Radio, Chiedza admits that there is still a large gap to be addressed, and ZimbosAbantu is a drop in the ocean. She emphasizes the need for investors and partners to help expand the organizations reach and impact.\n\nZiplineis another company working to improve medical access in Africa, but with autonomous drones.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18050427/zimbosabantu.jpg",
            "description": "<p>Hackster Remoteness from care is a major challenge to health services worldwide. Half of the world’s population resides in rural areas, but only 36% of the global nursing workforce lives there. This means infant mortality, maternal death, and poor health outcomes are much prevalent in rural areas than in urban locations. Telehealth (healthcare delivery via</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbosabantus-solar-powered-mobile-clinics-deliver-healthcare-to-villages-in-rural-zimbabwe/\">ZimbosAbantu’s solar-powered mobile clinics deliver healthcare to villages in rural Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "18 Nov 2025"
        },
        {
            "title": "Brendan Galloway injury update as Plymouth Argyle defender set to get all clear",
            "url": "https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/",
            "content": "Plymouth Live\n\nPlymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday.\n\nThe 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria in another friendly international last Thursday, which was played in Saudi Arabia.\n\nGalloway started the match at the Prince Abdullah Al-Faisal Stadium in Jeddah but was substituted in the 84th minute as he made his seventh appearance for Zimbabwe.\n\nGalloway will be assessed by Argyles medical department on his return to Home Park from international duty later this week.\n\nThe friendly internationals against Algeria and Qatar, under newly-appointed head coach Mario Marinica, are Zimbabwes final games before they compete at the 2025 Africa Cup of Nations in Morocco at the end of December.\n\nZimbabwe have been drawn in Group B and will play games against Egypt on December 22, South Africa on December 26 and Angola on December 29.\n\nWith Galloway expected to be included in the Warriors squad for the tournament, he is likely to miss a few matches for Argyle over the Christmas and New Year period.\n\nArgyle are bottom of League One and did not have a game at the weekend because of international call-ups, including that of Galloway, while Port Vale moved up one position to 22nd after a 0-0 draw at home to Wycombe Wanderers.\n\nPilgrims boss Tom Cleverley was among the crowd at Vale Park as he took the opportunity to get a first-hand glimpse of Darren Moores Valiants.\n\nIt was a result which moved the Staffordshire side a point clear of the Pilgrims, but they have now played one more match than them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/18042712/Brendan-Galloway.png",
            "description": "<p>Plymouth Live Plymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday. The 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/\">Brendan Galloway injury update as Plymouth Argyle defender set to get all clear</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "18 Nov 2025"
        }
    ]
}