{
    "news": [
        {
            "title": "Why are you always making noise on the internet? Aren’t you supposed to be kuMasowe? – Sonja takes a dig at ex-hubby Wicknell Chivayo",
            "url": "https://www.newzimbabwe.com/why-are-you-always-making-noise-on-the-internet-arent-you-supposed-to-be-kumasowe-sonja-takes-a-dig-at-ex-hubby-wicknell-chivayo/",
            "content": "By Staff Reporter\n\nCONTROVERSIAL businessman, Wicknell Chivayos ex-wife Sonja Madzikanda has hit back after he claimed their marriage broke down mainly because she could not get along with his late mother and siblings.\n\nHis younger sister, Moreblessing popularly known as Moe andSonja have in the past bashed each other on social media platforms.\n\nChivayo parted ways with Sonja, the mother of his two children several months ago after seven years of marriage.\n\nThe former couple has been trending on social media after he flaunted his new girlfriend Lulu Muteke whom he plans to marry next year.\n\nIn response to a letter directed to him on social media Chivayo however said he has not stopped looking after Sonja for the sake of his kids and recently splashed R2 million sponsoringtheir vacation inVietnam and Japan.\n\nHe added that he gave his ex-wife US$ 100,000 for shopping and to share with her family members, the same amount he revealed will be the bride price he will pay for Lulu.\n\nLeaving my ex-wife was undoubtedly one of the MOST DIFFICULT decisions I have ever had to make in my life. Not only because I was used to her presence, but I love my children John and Minana INCREDIBLY. However, our marriage faced IRRECONCILABLE differences that made it impossible to continue. She struggled to get along with my family, including my DEAR late mother and all my 6 sisters, and the constant fighting became too overwhelming for me. It reached a point where I felt that the person I was fighting for was not making an effort to support me when the world had turned its back on me. This made the marriage IRRETRIEVABLY broken down. Despite these challenges, she remains a GREAT mother and a good person, and I continue to look after her exceptionally well and respect her as such.\n\nWe now co-parent very well and I ensure that my children are well taken care of. Women are good at playing the victim and will never publicly acknowledge a mans efforts. For instance, I recently paid TWO MILLION rand for their Christmas holiday, where they travelled to Vietnam and Japan and on top of that, I gave her an additional ONE HUNDRED THOUSAND DOLLARS USD cash for their shopping and for her to share with her family, reads part of his post.\n\nSonja took no time to respond, lashing out at her ex-husband for always making noise on the internet adding that they had not seen each other in 7 months.\n\nIn a series of Instagram stories, she said, I dont care who you marry. Marry and move on\n\nRespect your business partners, respect the offices you go in. Why are you always making noise on the internet? Arent you supposed to at church? Arent you supposed to be at kuMasowe?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31171605/wicknell.png",
            "description": "<p>By Staff Reporter CONTROVERSIAL businessman, Wicknell Chivayo’s ex-wife Sonja Madzikanda has hit back after he claimed their marriage broke down mainly because she could not get along with his late mother and siblings. His younger sister, Moreblessing popularly known as Moe and Sonja have in the past bashed each other on social media platforms. Chivayo parted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-are-you-always-making-noise-on-the-internet-arent-you-supposed-to-be-kumasowe-sonja-takes-a-dig-at-ex-hubby-wicknell-chivayo/\">Why are you always making noise on the internet? Aren’t you supposed to be kuMasowe? – Sonja takes a dig at ex-hubby Wicknell Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe abolishes Death Penalty, prisoners on death row to be sentenced afresh",
            "url": "https://www.newzimbabwe.com/zimbabwe-abolishes-death-penalty-prisoners-on-death-row-to-be-sentenced-afresh/",
            "content": "By Tapiwa Svondo\n\nPresident Emmerson Mnangagwa has signed into law the Death Penalty Abolition Act.\n\nZimbabwe currently has over 60 prisoners on death row who will now have their sentences commuted. The last execution in the country was nearly two decades ago in 2005.\n\nParliament had pushed to amend the Criminal Law Code, Criminal Procedure Law and theDefence Act which allowed the death penalty in cases of murder committed under aggravatingcircumstances.\n\nInternational bodies such as Amnesty International have called for the removal of the death penalty, arguing it violates the right to life.\n\nMnangagwa had sinceexpressed he is against capital punishment, sharing his own experience when his death sentence for blowing up a train during the 1960s war was commuted to 10 years in prison.\n\nAbolition of death penalty Notwithstanding any other law  no court shall impose sentence of death upon a person for any offence, whenever committed, but instead shall impose whatever other competent sentence is appropriate in the circumstances of the case;\n\nthe Supreme Court shall not confirm a sentence of death imposed upon an appellant, whenever that sentence may have been imposed, but instead shall substitute whatever other competent sentence is appropriate in the circumstances of the case: no sentence of death, whenever imposed, shall be carried out, reads part of the act.\n\nAdditionally, any death sentence given by a military court will automatically change to a life sentence in a civilian prison, with a non-release period of 20 years.\n\nEvery sentence of death that a military court lawfully imposes under this Act is automatically commuted to a sentence of imprisonment for life in a civilian prison (subject to a non-release period of twenty years, or such lesser non-release period as the court martial may specify); and upon the sentence of the military court being confirmed by the confirming authority in terms of section 63, be referred without delay (and without the need to lodge a formal appeal) to the Court Martial Appeal Court for confirmation or, where the Appeal Court so deems it fit in the interests of justice, for resentencing or for disposal in such other manner as the Appeal Court deems to be fit in the interests of justice.\n\nFor the avoidance of doubt it is declared that the provisions of this Act bearing on the death penalty shall have full force with effect from the date when any state of public emergency is declared in terms of section 113 of the Constitution, up to the date when such declaration lapses or ceases to have effect in terms of section 113(4) of the Constitution (whether in the interim the declaration has been renewed or not).\n\nThe Commissioner-General of the Prisons and Correctional Service shall do everything within their respective competences to ensure that, as soon as practicable after the fixed date, every prisoner under sentence of death is brought before the High Court to be sentenced afresh for the offence for which the death sentence was imposed upon him or her.\n\nIn Africa, 24 countries including Zambia have fully abolished the death penalty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/15180901/ED.jpg",
            "description": "<p>By Tapiwa Svondo President Emmerson Mnangagwa has signed into law the Death Penalty Abolition Act. Zimbabwe currently has over 60 prisoners on death row who will now have their sentences commuted. The last execution in the country was nearly two decades ago in 2005. Parliament had pushed to amend the Criminal Law Code, Criminal Procedure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-abolishes-death-penalty-prisoners-on-death-row-to-be-sentenced-afresh/\">Zimbabwe abolishes Death Penalty, prisoners on death row to be sentenced afresh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Mnangagwa to spend annual vacation in the country due to ‘commitments requiring his attention’",
            "url": "https://www.newzimbabwe.com/mnangagwa-to-spend-annual-vacation-in-the-country-due-to-commitments-requiring-his-attention/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa will be taking his month-long annual leave starting Tuesday 31 December.\n\nHis deputies Kembo Mohadi and Constantino Chiwenga will take turns assuming the role of Acting President.\n\nIn a statement Monday, acting chief secretary George Charamba said Mnangagwa will be in Zimbabwe due to responsibilities that demand his direct involvement, both in his capacity as President and SADC Chairman.\n\nHis Excellency the President, Dr E.D Mnangagwa, starts his month-long annual vacation tomorrow, 31st December, 2024.\n\nHe plans to spend his vacation in the country and will be available for commitments requiring his personal attention, both as State President and as Chairman of the Southern Africa Development Community (SADC).\n\nWhile he is on leave, the two Vice Presidents, Hon K.C.D Mohadi, and Hon. Dr C.G.D.N Chiwenga will stand in for him in that order.\n\nVice President Mohadi will act from 31st December, 2024 to 19th January, 2025. Thereafter, Vice President Chiwenga will act until His Excellency the President resumes duty in early February, Charamba said.\n\nThe president typically takes his yearly vacation in January.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa will be taking his month-long annual leave starting Tuesday 31 December. His deputies Kembo Mohadi and Constantino Chiwenga will take turns assuming the role of Acting President. In a statement Monday, acting chief secretary George Charamba said Mnangagwa will be in Zimbabwe due to responsibilities that demand his direct</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-to-spend-annual-vacation-in-the-country-due-to-commitments-requiring-his-attention/\">Mnangagwa to spend annual vacation in the country due to ‘commitments requiring his attention’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Welshman Ncube threatens Tshabangu with disciplinary action as High Court reserves judgment in latest lawsuit",
            "url": "https://www.newzimbabwe.com/welshman-ncube-threatens-tshabangu-with-disciplinary-action-as-high-court-reserves-judgment-in-latest-lawsuit/",
            "content": "By Staff Reporter\n\nThe High Court has indefinitely reserved its judgement in a matter Citizens Coalition for Change (CCC) leaders who were dismissed from their Parliamentary roles by the secretary general of the party, Sengezo Tshabangu are suing him.\n\nThe urgent High Court application was heard by Justice Neville Wamambo who promised to hand down his judgment on a later date.\n\nThe leaders include the interim party leader, Welshman Ncube and his deputy, Lynette Karenyi Kore, Sesel Zwidzai and Edwin Mushoriwa who filed an application citing their party as the first applicant.\n\nTshabangu recently dismissed the leaders from their parliamentary roles and appointed his selections in their place.\n\nTshabangu, the Speaker of the National Assembly, and Senator Nonhlahla Mlotshwa were cited as respondents in court papers\n\nThe applicants are seeking a court declaration that Tshabangus decisions to oust them from the Standing Rules and Orders Committee (SROC) are unlawful and exceed his constitutional authority.\n\nThey are also challenging Mlotshwas appointment as the CCC chief whip, claiming that such a position is not recognised under Section 151 (2) of the Constitution.\n\nAdditionally, they are contesting the reshuffling of various CCC members across different parliamentary committees to which they were originally assigned.\n\nThey seek an order to prevent the Speaker from announcing these changes in the National Assembly.\n\nIn the application, Ncube said Tshabangu will soon face disciplinary proceedings for what he did.\n\nOn Monday his lawyer Method Ndlovu told the judge that the Speaker quickly acted on Tshabangus actions but ignored several letters from his client.\n\nThere are several letters which were written by the applicants but they were ignored but he was so quick to act on the which was written by the second respondent, Ndlovu said.\n\nNcube said Tshabangu defied an existing court order barring him from recalling party members adding that the reshuffle was as good as recall.\n\nHis actions (Tshabangu) do not represent the collective decision of the CCC.\n\nHe was on a frolic of his own and what he did does not reflect the collective and correct position of the 1 Applicant (CCC).\n\nHe is a non-entity and it is surprising that the Speaker keeps entertaining him instead of the party, Ncube said in his founding affidavit when he filed the lawsuit.\n\nLewis Uriri and Nqobani Sithole representing Tshabangu said the High Court has no jurisdiction to hear Ncubes application.\n\nThe significance of the mootness was never lost. They became aware of their problem on December 16 but they already knew that parliament had accepted that there would be changes.\n\nThe juristic act had already taken place. All the speaker does is that I have to inform them that these changes have been made. They want to interrupt changes which have been made, Uriri said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Staff Reporter The High Court has indefinitely reserved its judgement in a matter Citizens Coalition for Change (CCC) leaders who were dismissed from their Parliamentary roles by the secretary general of the party, Sengezo Tshabangu are suing him. The urgent High Court application was heard by Justice Neville Wamambo who promised to hand down</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/welshman-ncube-threatens-tshabangu-with-disciplinary-action-as-high-court-reserves-judgment-in-latest-lawsuit/\">Welshman Ncube threatens Tshabangu with disciplinary action as High Court reserves judgment in latest lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Mutare man jailed 12 years for robbing villager of bicycle at gunpoint",
            "url": "https://www.newzimbabwe.com/mutare-man-jailed-12-years-for-robbing-villager-of-bicycle-at-gunpoint/",
            "content": "By Staff Reporter\n\nA 30-year-old Mutare man will endure the next 12 years behind bars following his conviction for robbing a villager of his bicycle at gunpoint.\n\nJosiah Saungweme of Bvirindi B under Chief Zimunya was convicted of armed robbery by a Mutare magistrate after a full trial.\n\nThe offender robbed the complainant (17) of his bicycle on the 9th of September 2024 along Marange-22 Miles road.\n\nProsecutors proved that Saungweme pretended to be asking for directions from the complainant who was riding his silver buffalo bicycle before he produced a Blow F92 pistol and demanded the complainants bicycle.\n\nThe complainant surrendered the bicycle. A police report was made, leading to the arrest of the offender, proved the state.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31045151/bicyle.jpg",
            "description": "<p>By Staff Reporter A 30-year-old Mutare man will endure the next 12 years behind bars following his conviction for robbing a villager of his bicycle at gunpoint. Josiah Saungweme of Bvirindi B under Chief Zimunya was convicted of armed robbery by a Mutare magistrate after a full trial. “The offender robbed the complainant (17) of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutare-man-jailed-12-years-for-robbing-villager-of-bicycle-at-gunpoint/\">Mutare man jailed 12 years for robbing villager of bicycle at gunpoint</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Take up fire insurance to boost resilience capacity— IPEC cautions MSMEs amid proliferation of risk-prone ‘densified’ malls, workstations",
            "url": "https://www.newzimbabwe.com/take-up-fire-insurance-to-boost-resilience-capacity-ipec-cautions-msmes-amid-proliferation-of-risk-prone-densified-malls-workstations/",
            "content": "By James Muonwa l Mashonaland West Correspondent\n\nTHE countrys infrastructural landscape is fast transforming itself with the emergence of multi-storey shopping malls mushrooming in all major towns and cities.\n\nAccommodating all sorts of entrepreneurs, grocers, liquor, perfumery and clothing retailers, and electrical appliances traders, among a host of other merchandise, the precincts are densely populated with every inch of space being fully utilised to display wares.\n\nWhilst business owners are flocking to these ambient and conveniently-located malls, they are oblivious to risks of fire associated with the cramped joints while the unregulated use of gas tanks, kettles, jugs and stoves by employees heightens chances of infernos breaking out. In some instances, blazes are triggered by appliances left unattended.\n\nIn recent months, Mashonaland West towns of Chinhoyi and Kadoma have recorded cases of fire outbreaks at business premises resulting in massive loss of property and sources of livelihood particularly for micro-small and medium entrepreneurs (MSMEs).\n\nEarlier in 2024, a complex belonging to an Indian property mogul suspiciously caught fire in Chinhoyi and reduced his tenants electrical appliances and furniture stock to ashes.\n\nMid October, an inferno broke out in central Kadoma and engulfed a local shop opposite Comoil fuel station leaving a devastating trail of destruction resulting in significant business loss.\n\nMore recently, an entire shopping complex situated at Mzimba shopping centre, Coldstream suburb, Chinhoyi, went up in flames and consumed merchandise worth thousands of dollars. The affected units included clothing boutiques, electrical appliances sales, hardware, hair salons, barber shops, canteen, and grocery shops, among others.\n\nMany of the affected business owners were left without anywhere to start after having lost everything in the blaze, thereby raising the need for MSMEs to seriously consider insuring their premises and stock against fire risks.\n\nFire insurance covers damage to property including the roof, walls, and foundation and contents such as furniture and appliances.\n\nInsurance and Pensions Commission (IPEC) public relations manager, Lloyd Gumbo told NewZimbabwe.com MSMEs must take steps to insure premises and merchandise against eventualities such as fires which are now prevalent.\n\nIndeed, cases of fire outbreaks have become prevalent and the commission encourages Micro, Small and Medium-sized Enterprises (MSMEs) to insure their premises and merchandise against the various risks that they face such as fire, flood, theft, or vandalism.\n\nHaving insurance against these risks helps MSMEs to reduce the potential losses and improve their resilience, said Gumbo.\n\nQuizzed on what policy interventions IPEC is pushing for to ensure short-term insurance for the risk of fire and resultant losses thereof are taken up by entrepreneurs, Gumbo hinted a lot is being done.\n\nIn line with the National Financial Inclusion Strategy, IPEC is spearheading insurance inclusion through various initiatives including, the registration of dedicated microinsurance companies, approving microinsurance products, and financial literacy.\n\nIn terms of financial literacy, the commission is collaborating with the Ministry of Women Affairs, Community, and Small and Medium Enterprise Development and the Insurance Council of Zimbabwe (ICZ) in educating ministry officers on the importance of insurance.\n\nThis year, the commission has in collaboration with ICZ trained the Ministrys Provincial and District Business Development Officers on insurance so that they can also train MSMEs in their respective areas, Gumbo told NewZimbabwe.com.\n\nZimbabwe National Organisation of Associations and Residents Trusts (ZNOART) Mashonaland West provincial chairman, Liberty Chitiya said there is a need for strict regulation of the use of premises which should be insured.\n\nWe need authorities to intensify awareness campaigns and for them to be devolved into different sectors of the economy especially the SMEs and household level where fire fighting techniques and equipment are minimum.\n\nThere has been a lack of knowledge on the causes of fire, largely because our buildings are now being used by many different occupiers more than the stipulated number. The local authorities have failed to rein in proper building by-laws resulting in fire accidents.\n\nThe element of insurance is also welcome so that resultant losses by entrepreneurs are absorbed and the livelihoods safeguarded. However, insurance companies need to also tap into the SMEs industry through introducing tailor-made insurance packages given the rising business building occupancies in many CBDs, said Chitiya.\n\nTo demonstrate the huge appetite for this type of insurance, fire premiums are one of the major contributors to foreign currency-denominated insurance revenue.\n\nAccording to the IPEC 2024 first quarter report, the main sources of foreign-currency-denominated insurance revenue for short-term insurers were motor, fire, hail and personal accident contributing a combined 79% of the total insurance revenue.\n\nShort-term insurers reported foreign currency-denominated insurance revenue amounting to US$ 53.18 million for the first quarter ended March 31, 2024.\n\nThe architecture of the short-term insurance industry recorded positive development amid the registration of new players. There were 1,262 registered entities/persons in the short-term insurance industry as of March 31, 2024 as compared to 1,198 the previous year under review. This represented a 5% jump.\n\nShort-term insurers reported insurance revenue amounting to ZW$812.96 billion for the period under review. Nineteen (19) out of twenty (20) short-term insurers reported capitalcapitalisation positions above the minimum capital requirement of ZW$37.5 million during the reporting period.\n\nThe market leaders in terms of consolidated insurance revenue wereZimnat Lion, Nicoz Diamond, Old Mutual Insurance, Alliance Insurance and Cell Insurance with a combined market share of 71%.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31044714/IMG_20240408_100812-scaled.jpg",
            "description": "<p>By James Muonwa l Mashonaland West Correspondent THE country’s infrastructural landscape is fast transforming itself with the emergence of multi-storey shopping malls mushrooming in all major towns and cities. Accommodating all sorts of entrepreneurs, grocers, liquor, perfumery and clothing retailers, and electrical appliances traders, among a host of other merchandise, the precincts are densely populated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/take-up-fire-insurance-to-boost-resilience-capacity-ipec-cautions-msmes-amid-proliferation-of-risk-prone-densified-malls-workstations/\">Take up fire insurance to boost resilience capacity— IPEC cautions MSMEs amid proliferation of risk-prone ‘densified’ malls, workstations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe now accommodating 85,000 Chinese nationals exploiting resources under the guise of investments – Cross",
            "url": "https://www.newzimbabwe.com/zimbabwe-now-accommodating-85000-chinese-nationals-exploiting-resources-under-the-guise-of-investments-cross/",
            "content": "By Staff Reporter\n\nZimbabwean economist Eddie Cross has expressed concern over how natural resources worth billions of dollars are being looted to China yet there is no real investment that benefits locals.\n\nIn a blog titled What is the Chinese Motivation in Zimbabwe, Cross said he had learnt that Zimbabwe now accommodates 85,000 Chinese nationals accusing them of exploiting Zimbabweans and their resources.\n\nAlthough the Chinese have invested millions into Zimbabwe, incidences of abuse on locals by some of them and exploitation continue to mar their partnership and development efforts.\n\nCross also expressed concern about how the Chinese are leaving behind a trail of environmental destruction which will take generations to heal.\n\nWe have the best Chrome deposits in the world, 9 billion tonnes of it worth a conservative US$100 trillion. We have enormous Lithium reserves and they are loaded with other critical minerals that are in fact worth more than the Lithium and we do not understand what that means.\n\nWe applaud them because shortly we will be exporting 5 million tonnes of lithium concentrate a year to China, worth perhaps US$4 billion in new export earnings, four times our famous tobacco crop, but missing the fact that it might contain other metals and minerals worth many times more.\n\nA quarter of our gold output goes to China and we have no idea about how they are doing that or what is involved, but the evidence of open cast mining, large investments in milling and extracting machinery for the small-scale mining industry here which is among the most important in the world, is everywhere.\n\nThey ignore environmental regulations and leave behind a moonscape of countryside that looks like a World War 1 battlefield.They are exploiting our finest coal reserves for their smelters and steel production, even exporting their surplus, he wrote.\n\nSeveral Chinese-owned companies are accused of destroying communities as the scramble for lithium and other valuable minerals intensifies in Zimbabwe.\n\nThey are alleged to be violating environmental laws, with government officials criticised for turning a blind eye to their operations.\n\nAreas such as the once scenic Boterekwa in the Shurugwi district, which is facing significant environmental damage due to mining operations being undertaken by a Chinese company.\n\nCross also highlighted that the Chinese also focus on infrastructure development that benefits them in their large-scale investments so theyachieve their goals.\n\nThere is little or no value addition except for the primary production phase. There are no plans to invest in a Lithium refinery to produce a product suitable for use in the production of batteries. Even the steel plant is only producing steel billets for export to China for conversion into finished product. International sanctions may force them to produce steel for sale to manufacturers in the West but for the time being they are producing a product for export in primary form.\n\nRight now, the decision by the Zimbabwe Government not to maintain power subsidies on electricity going to their furnaces is forcing the Chinese companies to invest in coal-based power production.\n\nThey are doing so at a cost of US$600,000 per megawatt with the objective of meeting their own needs at about US$6 cents per Kilowatt, one-third of the current ZESA tariff which is necessary because the new Chinese built power station at Hange cost three times per Megawatt than what their own plant will cost. To achieve those sorts of outcomes they will have to secure coal at rock-bottom prices, while they supply ZESA at three times the cost.\n\nThis is a very concerning situation and the question for us as a nation, is what do we do about it.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26023525/Chinese-Mining-Operations.png",
            "description": "<p>By Staff Reporter Zimbabwean economist Eddie Cross has expressed concern over how natural resources worth billions of dollars are being looted to China yet there is no real investment that benefits locals. In a blog titled “What is the Chinese Motivation in Zimbabwe”, Cross said he had learnt that Zimbabwe now accommodates 85,000 Chinese nationals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-now-accommodating-85000-chinese-nationals-exploiting-resources-under-the-guise-of-investments-cross/\">Zimbabwe now accommodating 85,000 Chinese nationals exploiting resources under the guise of investments – Cross</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Shahidi, Bennett star as Afghanistan draw Zimbabwe Test",
            "url": "https://www.newzimbabwe.com/shahidi-bennett-star-as-afghanistan-draw-zimbabwe-test/",
            "content": "AFP\n\nAfghanistanveteran Hashmatullah Shahidi andZimbabwerookie Brian Bennett starred as the first Test was drawn after a rain-shortened final day in Bulawayo on Monday.\n\nShahidi claimed an Afghan record 246 runs at the end of a marathon innings while spinner Bennett took five wickets.\n\nZimbabwe made 586 and 142-4 to lead Afghanistan by 29 runs at stumps after the tourists posted 699. Both first innings scores were national records.\n\nWith Zimbabwe 88-4 in their second innings and 25 runs behind, batting stability was required and the unbeaten partnership of veterans Sean Williams (35) and Craig Ervine (22) provided it.\n\nShahidi departed after being trapped leg before by Bennett, whose 5-95 were the best figures among the six-man Zimbabwe attack.\n\nThe 30-year-old left-hand batter faced 474 balls in 694 minutes, and struck 21 fours at Queens Sports Club in the southwestern city.\n\nHis partnerships with Rahmat Shah (364 runs) and Afsar Zazai (211) ensured Afghanistan took a 113-run first innings lead.\n\nThe previous highest Test score of Shahidi was 200 not out, also against Zimbabwe, in Abu Dhabi three years ago.\n\nBefore the exit of Shahidi, wicketkeeper Zazai claimed a maiden Test century, hitting 113 before being caught at backward point by substitute Johnathan Campbell.\n\nThe fall of Shahidi triggered a collapse with the final six Afghanistan wickets going for just 20 runs in four overs as the off spin of Bennett wreaked havoc.\n\nBennett, a 21-year-old appearing in only his second Test, twice took wickets from successive balls only to be deprived of hat-tricks on both occasions.\n\nHe also shone with the bat, making 110 not out in the first innings after Zimbabwe captain Ervine won the toss.\n\nBatting a second time, Zimbabwe put on 73 runs before an outside edge from Joylord Gumbie (24) allowed Shahidi to make a simple catch in the slips.\n\nThe fall of the wicket was followed almost immediately by mid-afternoon rain that led to a one hour delay.\n\nTest debutant Ben Curran, a son of deceased former Zimbabwe coach Kevin Curran and brother of England internationals Tom and Sam, made 41 before being run out.\n\nGumbie, Curran and Takudzwanashe Kaitano (5) fell in the space of 14 balls, with spinner Zahir Khan taking two wickets, and Dion Myers(4) was bowled by teenage spinner Allah Ghazanfar.\n\nBrief scores\n\nZimbabwe 586 in 135.2 overs and 142-4 in 34 overs (Ben Curran 41, Sean Williams 35 not out, Craig Ervine 22 not out; Zahir Khan 2-43) v Afghanistan 699 in 197 overs (Hashmatullah Shahidi 246, Rahmat Shah 234, Afsar Zazai 113; Brian Bennett 5-95)\n\nResult: Match drawn\n\nToss: Zimbabwe\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31040652/FILE-Zimbabwe-made-586-and-142-4-to-lead-Afghanistan-by-29-runs-at-stumps-after-the-tourists-posted-699-Both-first-innings-scores-were-national-records-Picture-AFP-Jekesai-Njikizana.webp",
            "description": "<p>AFP Afghanistan veteran  Hashmatullah Shahidi and Zimbabwe rookie Brian Bennett starred as the first Test was drawn after a rain-shortened final day in Bulawayo on Monday. Shahidi claimed an Afghan record 246 runs at the end of a marathon innings while spinner Bennett took five wickets. Zimbabwe made 586 and 142-4 to lead Afghanistan by 29 runs at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shahidi-bennett-star-as-afghanistan-draw-zimbabwe-test/\">Shahidi, Bennett star as Afghanistan draw Zimbabwe Test</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe extends retirement age for civil servants, uniformed forces",
            "url": "https://www.newzimbabwe.com/zimbabwe-extends-retirement-age-for-civil-servants-uniformed-forces/",
            "content": "By Thandiwe Garusa\n\nThe government has increased the retirement age for civil servants and uniformed forces by an additional five years, effective 1 January 2025.\n\nAccording to Statutory Instrument (SI) 197 of 2024, dated 30 December 2024, the retirement age for civil servants has been raised from 65 to 70.\n\nHowever, at the age of 60, they still have the choice to retire early, provided they submit a three-month notice.\n\nbefore the effective date, may have a pensionable age of sixty-five years with option to retire at seventy-years on full pension: Provided that any retirement after the year of sixty-fifth anniversary and before the seventieth anniversary shall be deemed to be early retirement; or on or after the effective date, shall have a pensionable age of seventy years.\n\nA member may, on giving three months notice of retirement be permitted by the commission to retire before pensionable age at any time after attaining the age of sixty, part of the SI reads.\n\nAgain in SI 198 of 2024 cited as the Defence (Regular Force) (Non-Commissioned Members) (Amendment) Regulations, 2024 (No. 8), the retirement age for regular soldiers is now 55, up from 50.\n\nA member can extend to 60 and 65 years if they are a war vet.\n\nA permanent member shall, whatever the length of his or her pensionable service, retire on attaining the age of fifty-five years: Provided that if the minister, on the recommendation of the commander, considers that it is desirable in the public interest, he or she may allow that member to continue to serve for a period of five years until he or she attains the age of sixty years; or if that member is allowed to continue to serve in terms of paragraph (a), the commander may, on giving twelve months written notice to the member of his or her intention to do so, require him or her to retire before he or she has served that period, part of the SI reads.\n\nMeanwhile, the President in a Statutory Instrument 201 of 2024 has also increased pensionable service for police from 20 to 30 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051503/zdf-3.jpeg",
            "description": "<p>By Thandiwe Garusa The government has increased the retirement age for civil servants and uniformed forces by an additional five years, effective 1 January 2025. According to Statutory Instrument (SI) 197 of 2024, dated 30 December 2024,  the retirement age for civil servants has been raised from 65 to 70. However, at the age of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-extends-retirement-age-for-civil-servants-uniformed-forces/\">Zimbabwe extends retirement age for civil servants, uniformed forces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        },
        {
            "title": "Zimbabwe invites power-storage bids to ease supply crisis",
            "url": "https://www.newzimbabwe.com/zimbabwe-invites-power-storage-bids-to-ease-supply-crisis/",
            "content": "Bloomberg\n\nZimbabwes power-transmission company has invited bids for companies to install energy-storage units as part of measures to ease crippling energy shortages.\n\nZimbabwe Electricity Transmission & Distribution Co. wants battery-storage units installed on four sites that will provide at least three hours of 600 megawatts each in peak hours, it said in a statement in a government notice.\n\nThe southern African nation faces an energy shortfall that often triggers rolling blackouts to balance supply and demand. The worst drought in four decades has compounded the crisis, cutting supplies from hydropower plants. Several miners rely on imported power from neighboring Mozambique to operate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/13202907/power-plant.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s power-transmission company has invited bids for companies to install energy-storage units as part of measures to ease crippling energy shortages. Zimbabwe Electricity Transmission & Distribution Co. wants battery-storage units installed on four sites that will provide at least three hours of 600 megawatts each in peak hours, it said in a statement in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-invites-power-storage-bids-to-ease-supply-crisis/\">Zimbabwe invites power-storage bids to ease supply crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 Dec 2024"
        }
    ]
}