{
    "news": [
        {
            "title": "University of Zimbabwe docks salaries of striking lecturers",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-docks-salaries-of-striking-lecturers/",
            "content": "By Darlington Gatsi\n\nTHE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution.\n\nThe lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwes soaring cost of living.\n\nWhile UZ has remained silent on the strike, it has retaliated by withholding salaries from the defiant lecturers, who are steadfast in their demand for a return to pre-2018 wages of US$2,250 per month for junior staff  up from the current US$230.\n\nObvious Vengeyi, spokesperson for the Association of University Teachers (AUT), condemned the salary deductions as an attempt to force an end to the strike.\n\nOf course, it is an act of trying to force our members to return to work for the US$230 they initially rejected. Its a way of arm-twisting certain members of our community to resume teaching.\n\nMany here who have not been paid have resolved that, whether they receive the US$230 or not, they will not return. The majority of us have not been paid  yes. But we remain committed. Until junior lecturers get US$2,250, we will not go back to class, said Vengeyi.\n\nThe universitys latest move follows its hiring of adjunct lecturers last month to fill gaps left by the striking staff.\n\nHowever, the AUT has dismissed this as futile, claiming most replacements lack the qualifications to teach at a university level.\n\nThere is no teaching happening at the university. No supervision is taking place. A few scabs have been hired to replace sort of  the lecturers on strike, said Vengeyi further.\n\nThe prolonged strike has disrupted examinations, with planned sittings facing further delays, potentially derailing the academic year.\n\nLast month, six students were arrested after staging flash protests demanding the lecturers return, signalling the growing unrest on campus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09165523/1000639185-scaled.jpg",
            "description": "<p>By Darlington Gatsi  THE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution. The lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwe’s soaring cost of living. While UZ has remained silent on the strike, it has retaliated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-docks-salaries-of-striking-lecturers/\">University of Zimbabwe docks salaries of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "11 Jun 2025"
        },
        {
            "title": "Fame doesn’t shake me! – Ex-Mommy Club star Nunurai",
            "url": "https://www.newzimbabwe.com/fame-doesnt-shake-me-ex-mommy-club-star-nunurai/",
            "content": "Daily Sun\n\nNUNURAI Mudarikwa left a lasting impression on fans during her stint in The Mommy Club.\n\nThe show, celebrated for its bold and outspoken cast, quickly became a Mzansi favourite.\n\nKnown for speaking her mind, Nunurai quickly gained attention and fame for her candid approach and unfiltered opinions.\n\nWhile some viewers praised her honesty and confidence, others were more critical.\n\nStill, her presence on the show made her one of its most talked-about personalities.\n\nDespite the attention and growing fan base, Nunurai says fame has never gone to her head.\n\nSometimes, fame is overwhelming, but its nothing I cant handle.\n\nI dont consider myself a full-blown celebrity, she told Daily Sun.\n\nThe Zimbabwean-born, South African-based businesswoman insists that the world of fame hasnt changed who she is.\n\nIve always been grounded. I know who I am and what I stand for.\n\nAlthough her time in The Mommy Club put her in the public eye, Nunurai has no plans to continue with TV, for now.\n\nI dont think youll be seeing more of me on TV anytime soon.\n\nNunurai shared what shes been up to since stepping away from the cameras.\n\nIve been focused on my business. Outside of The Mommy Club, Im a full-blown businesswoman.\n\nI literally work 12-hour days  Im all about building and growing my brand, she said.\n\nNunurai stated that she is fully dedicated to her entrepreneurial pursuits.\n\nShe says the hustle keeps her grounded and fulfilled.\n\nI love what I do, and for now, thats where my energy is going.\n\nDespite fame, Nunurai remains focused, driven, and unapologetically on and off the screen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10195652/nunurai.jpeg",
            "description": "<p>Daily Sun NUNURAI Mudarikwa left a lasting impression on fans during her stint in The Mommy Club. The show, celebrated for its bold and outspoken cast, quickly became a Mzansi favourite. Known for speaking her mind, Nunurai quickly gained attention and fame for her candid approach and unfiltered opinions. While some viewers praised her honesty</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fame-doesnt-shake-me-ex-mommy-club-star-nunurai/\">Fame doesn’t shake me! – Ex-Mommy Club star Nunurai</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "11 Jun 2025"
        },
        {
            "title": "“We are working under impossible conditions, we cannot continue like this” – nurses plead with govt to prioritise public health sector",
            "url": "https://www.newzimbabwe.com/we-are-working-under-impossible-conditions-and-cannot-continue-like-this-nurses-plead-with-govt-to-prioritise-public-health-sector/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Nurses Association (ZINA) has made a desperate appeal to the government to urgently address the situation in public hospitals, saying they are working under impossible conditions which are endangering lives.\n\nGovernment has for years continued to neglect public hospitals, which are the largest providers of healthcare services in the country.\n\nPublic hospitals across Zimbabwe lack basic medical supplies, with patients being left topurchase their ownor referred to private hospitals where charges are beyond the reach of many.\n\nIn a statement Tuesday, ZINA president Enock Dongo said the governmenthas failed the health sector.\n\nAs nurses, we are working under impossible conditions. We are forced toimprovise daily just to preserve life. But we cannot continue like this. The systemhas failed, and the suffering is unbearable.\n\nWe call on the government of Zimbabwe to urgently prioritise the health sector.Equip hospitals. Support nurses. Save lives. This situation must be addressedwithout delay, Dongo said.\n\nDongo also said public hospitals do not have blankets for patients in this winter season andsome wards do not have windows.\n\nFacilities are deteriorating fast. There are no blankets in many wards as weapproach winter. Some hospitals do not even have proper windows.\n\nX-ray departments are not functioning. Diagnostic centres are almost non-existent.Basic lab services are unavailable.\n\nNurses are unable to conduct essential tests, and the sick are being referred to private hospitals that they cannot afford. They remain in public wards, in pain, waiting, suffering, Dongo added.\n\nRecently, Health Minister Douglas Mombeshora admitted that Zimbabwes biggest referral public hospital, Parirenyatwa, is in a bad state after a tour following a public outcry.\n\nThe situation at Parirenyatwa is a reflection of all public hospitals in the country.\n\nOver the years, health workers have submitted numerous petitions and staged protests calling for urgent government intervention; however, the authorities have taken little to no action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on-e1746463851506.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Nurses Association (ZINA) has made a desperate appeal to the government to urgently address the situation in public hospitals, saying they are working under “impossible conditions” which are endangering lives. Government has for years continued to neglect public hospitals, which are the largest providers of healthcare services in the country.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-working-under-impossible-conditions-and-cannot-continue-like-this-nurses-plead-with-govt-to-prioritise-public-health-sector/\">“We are working under impossible conditions, we cannot continue like this” – nurses plead with govt to prioritise public health sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "11 Jun 2025"
        },
        {
            "title": "Schoolchildren swept away as heavy floods and snow hit South Africa",
            "url": "https://www.newzimbabwe.com/schoolchildren-swept-away-as-heavy-floods-and-snow-hit-south-africa/",
            "content": "BBC\n\nA minibus carrying schoolchildren has been swept away by heavy flooding in South Africa, a spokesperson for the Eastern Cape provincial government has told the BBC.\n\nKhuselwa Rantjie said it was unclear how many children were on the bus, but three had so far been found alive. Rescue efforts had been suspended as night had fallen and would resume on Wednesday, she added.\n\nIn a separate incident, the bodies of seven people carried away by flood water have been found in the provinces OR Tambo district.\n\nSouth Africa has been hit by heavy snow, rains and gale force winds that have claimed the lives of a further five people in a road accident, and have left nearly 500,000 homes without electricity.\n\nThe Eastern Cape  the birthplace of anti-apartheid icon Nelson Mandela  has been worst-affected by the icy conditions, along with KwaZulu-Natal province.\n\nThe bad weather has forced the closure of some major roads in the two provinces to avoid further casualties.\n\nThis is a devastating reminder of natures force. We urge everyone to exercise extra caution in areas prone to flooding, Eastern Cape premier Oscar Mabuyane said in a statement.\n\nFive people died when a minibus taxi overturned near the coastal city of East London, with the driver saying he had lost control as he was trying to avoid a fallen tree, Eastern Cape transport department spokesperson, Unathi Binqose, told the BBC.\n\nTwo people were injured in the accident, he added.\n\nState power utility Eskom said that almost 300,000 homes had been hit by electricity cuts in 14 towns and villages in Eastern Cape.\n\nA further 196,000 homes in 24 areas in KwaZulu-Natal were also experiencing power cuts, Eskom spokesperson Daphne Mokwena told the BBC.\n\nKwaZulu-Natal Transport Minister Siboniso Duma said that heavy snow had led to lorries being stuck on roads, causing huge congestion.\n\nGrader machines have been stationed on worst-affected roads to clear snow before it reached more than 30cm (12in) in depth.\n\nMeteorologist Lehlohonolo Thobela also warned of strong winds and heavy waves at sea, making navigation for ships difficult.\n\nBoth Eastern Cape and KwaZulu-Natal are along the coast.\n\nSouth Africa regularly receives snowfall during its winter months, from June through August, with temperatures diving below 0C (32F).\n\nThere is also regular flooding and scientists say that climate change is causing heavier rainfall in the region.\n\nFlash floods and overflowing rivers between 30 April and 2 Maycaused significant damage to about 4,500 homes, and left 18 people injured.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10195937/SA-Snow.webp",
            "description": "<p>BBC A minibus carrying schoolchildren has been swept away by heavy flooding in South Africa, a spokesperson for the Eastern Cape provincial government has told the BBC. Khuselwa Rantjie said it was unclear how many children were on the bus, but three had so far been found alive. Rescue efforts had been suspended as night</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/schoolchildren-swept-away-as-heavy-floods-and-snow-hit-south-africa/\">Schoolchildren swept away as heavy floods and snow hit South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "11 Jun 2025"
        },
        {
            "title": "Warriors crash out of 2025 COSAFA Cup tournament",
            "url": "https://www.newzimbabwe.com/warriors-crash-out-of-2025-cosafa-cup-tournament/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens football team, Tuesday crashed out of the 2025 COSAFA Cup tournament despite beating Mozambique 3-1.\n\nThe Warriors were cost by goal difference as they finished on the same number of points (4) as group winners South Africa.\n\nZimbabwe finished with a zero on goal difference as Tuesdays 3-1 win cancelled Saturdays 2-0 defeat to South Africa, which eventually finished with a plus one goal difference after playing a nil-all draw against Mauritius.\n\nTuesdays match was Zimbabwes best since the start of the tournament last week as they managed to register their only win at the tournament,at the same time ending a goal drought that had prevailed from matchday one.\n\nFC Platinums Thandowenkosi Ngwenya was the hero for Zimbabwe as he walked away with a brace, which gave the side a 2-1 halftime lead.\n\nNgwenya struckfirst in the 26thminute, before completing his brace from the spot in the 32ndminute.\n\nMozambique proved not to be a pushover, thanks to Leonel Calsao, who scored a consolation goal four minutes later in the 36thminute.\n\nSecond was largely dominated by Zimbabwe, who were in search of more goals to increase their chances of qualifying, but still they found it difficult to break Mozambiques backline.\n\nThe Warriors finally penetrated through Mozambiques defence in stoppage time to seal the match 3-1, but it was not enough to see them progress.\n\nAccording to tournament rules, only the top team from each of the four groups will progress to the semi-finals, and South Africa made it through.\n\nCOSAFA Group A final standings\n\nSouth Africa = 4 pts, +1goal difference\n\nZimbabwe = 4 pts, 0goal difference\n\nMozambique = 4pts, -1 goal difference\n\nMauritius = 3 pts, 0 goal difference\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10181018/WhatsApp-Image-2025-06-10-at-18.27.10.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s football team, Tuesday crashed out of the 2025 COSAFA Cup tournament despite beating Mozambique 3-1. The Warriors were cost by goal difference as they finished on the same number of points (4) as group winners South Africa. Zimbabwe finished with a zero on goal difference as Tuesday’s 3-1 win</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-crash-out-of-2025-cosafa-cup-tournament/\">Warriors crash out of 2025 COSAFA Cup tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "11 Jun 2025"
        }
    ]
}