{
    "news": [
        {
            "title": "I have been robbed 73 days of my life – says journalist Mhlanga",
            "url": "https://www.newzimbabwe.com/i-have-been-robbed-73-days-of-my-life-says-journalist-mhlanga/",
            "content": "By Darlington Gatsi\n\nALPHA Media journalist Blessed Mhlanga breathed a sigh of relief when he walked through the corrugated iron gate of Harare Central Remand Prison on Wednesday night.\n\nMhlanga had spent 73 days in pre-trial detention after being arrested on charges of transmitting data inciting violence after airing a press conference by war veteran Blessed Geza.\n\nAfter three failed attempts, Mhlanga was finally granted bail on Tuesday afternoon by High Court Judge Justice Gibson Mandaza.\n\nHowever, an error in his bail paperwork saw him being released on Wednesday night.\n\nMhlanga broke down while narrating his experiences in prison.\n\nI was not supposed to be here in the first placeit is general knowledge. After 72 days of having my freedom robbed, I am indifferent. I think you have heard this over and over again. Describing the conditions I endured in words is really impossible.\n\nThis place is hell, but the prison officers are doing their best to keep it functioning with no resources. I have to check with my doctors, as I have been unwell, he said.\n\nMhlanga was caught in the midst of ZANU-PFs factional battles, in which Geza challenged President Emmerson Mnangagwa.\n\nWhile in custody, Mhlanga was denied the opportunity to sit for his university examinations.\n\nDespite enduring over three months behind bars, Mhlanga said he remains unshaken.\n\nI have been made aware of a statement suggesting that the reason I am out is because there is justice in this country. I am worried about that statement.\n\nSection 277 of the Criminal Law (Codification and Reform) Act is clear on how people who work for an organisation, if it is being charged, must be treated. It establishes how to charge corporates or juridical persons, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08033843/WhatsApp-Image-2025-05-07-at-20.56.36.jpeg",
            "description": "<p>By Darlington Gatsi ALPHA Media journalist Blessed Mhlanga breathed a sigh of relief when he walked through the corrugated iron gate of Harare Central Remand Prison on Wednesday night. Mhlanga had spent 73 days in pre-trial detention after being arrested on charges of transmitting data inciting violence after airing a press conference by war veteran</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-have-been-robbed-73-days-of-my-life-says-journalist-mhlanga/\">I have been robbed 73 days of my life – says journalist Mhlanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "WATCH: Citizens are very happy with service delivery in hospitals – says Health Ministry tells Parliament, refuses to admit healthcare system is deteriorating",
            "url": "https://www.newzimbabwe.com/watch-citizens-are-very-happy-with-service-delivery-in-hospitals-says-health-ministry-tells-parliament-refuses-to-admit-healthcare-system-is-deteriorating/",
            "content": "By Anna Chibamu\n\nHEALTH and Child Care deputy minister Sleiman Kwidini, Wednesday told Parliament that citizens are very happy with the service delivery in public hospitals, dismissing concerns raised over the collapsing sector as just social media.\n\nKwidini was speaking during a question-and-answer session in the National Assembly.\n\nThis follows Youth Empowerment Minister Tinoda Machakaires plea on social media for President Emmerson Mnangagwa to make time and see firsthand the dire state of public hospitals.\n\nZimbabwes healthcare system has collapsed over the years, suffering a massive brain drain, lack of equipment, poor conditions and demotivated workers among several other issues.\n\nDespite petitions to the government for an urgent redress and protests by healthcare professionals, there has been little to no action, with hospitals now becoming death traps.\n\nZanu PF Chivi South MP Felix Maburutse sought clarification from Kwidini regarding what Machakaire wrote on X (Twitter) about the situation in government health institutions.\n\nSocial media is portraying a negative picture of the status of our healthcare. May the minister update the House on the government policies and programmes that have been done so far and the roadmap in improving healthcare? Maburutse said.\n\nResponding to the MP, Kwidini said, On the part of the social media, indeed, people on social media always talk about what is not happening in the ministry but as the ministry, we are doing wonders since 2018, to make sure the citizens receive quality care.\n\nWhat we are doing is only known by the patients, not the social media participants. As we speak right now, our citizens are very happy with the service delivery that we are giving. As we speak, in the first 100 days said Kwidini before being interrupted by oppositionlegislator Charlton Hwende.\n\nHe must just concentrate on responding to the legitimate issues that people are raising, said Hwende.\n\nThe deputy minister proceeded amid interjections from the opposition bench.\n\nI was on the way to say the complaints were coming from social media. No actual person has come to the Ministry to complain directly to the Minister.\n\nNevertheless, as we speak and as I said, the ministry has improved a lot in terms of service delivery. As we speak, from the first 100 days of the first quarter of 2025, we managed to change some hospital equipment in the sixty-three districts; that is, x-ray machines, theatre beds and so forth.\n\nWe are working on other equipment that will be installed as soon as possible, Kwidini told the August House.\n\nKwidini added that the ministry had tried its best, working hand in hand with the Finance ministry to make sure all medicines and other sundries were availed.\n\nHe also gave the excuse that Zimbabwe does not produce or manufacture most of the drugs and sundries.\n\nWhen we place orders, they are sourced out of the country. They take three to six months to be supplied but I assure this House that in the shortest period of time, we will see improvements.\n\nEverything is now well known that our social media is attacking the Ministry of Health, especially on issues of visitors, not the beneficiaries of the treatment like the patients, he added.\n\nKwidini even assured the acting Speaker Tshuma that if people moved around asking patients who were receiving treatment at government health centres, they were very happy with the service which they were receiving.\n\nOther MPs differed with Kwidinis response.\n\nWe know what is in these hospitals. There is growing inequality. Most people who cannot access quality health services are those who cannot afford.\n\nSo, the societal differences are born out of poverty for most people who go to our hospitals and are told that you have to go and buy a bandage, you have to go and get this medicine, they cannot afford it, Marondera Central MP Caston Matewusaid.\n\nThe acting speaker, Joseph Tshuma dismissed the opposition MP saying, if the source of the complaints is from the media, print or whatever and is not verifiable, that cannot be regarded as a source of information.\n\nIf it was based on social media or any other media source, that cannot be debated as a verifiable source, said Tshuma.\n\nHowever, Tshuma was challenged by Mbizo MP C. Madzivanyika.\n\nIf we say we cannot rely on social media to validate issues of national interest, I do not think it is sustainable Mr. Speaker.\n\nThe Minister of Youth raised this issue of problems in the hospitals on his Twitter account and the Minister of Health and Child Care used the Twitter account to respond.\n\nTwitter has verified accounts and unverified accounts. The Minister of Health and Child Cares Twitter account has a blue tick, which indicates that it is a verified account. The same applies to Hon. Machakaires X handles. Above all, Mr. Speaker, can we be furnished with the Order that says social media is not acceptable?\n\nThe matter was not concluded as Tshuma told the house that the matter could only be resolved with both ministers present in Parliamentfor further interrogation and verification purposes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on-e1746463851506.jpg",
            "description": "<p>By Anna Chibamu HEALTH and Child Care deputy minister Sleiman Kwidini, Wednesday told Parliament that citizens are “very happy” with the service delivery in public hospitals, dismissing concerns raised over the collapsing sector as just “social media”. Kwidini was speaking during a question-and-answer session in the National  Assembly. This follows Youth Empowerment Minister Tinoda Machakaire’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-citizens-are-very-happy-with-service-delivery-in-hospitals-says-health-ministry-tells-parliament-refuses-to-admit-healthcare-system-is-deteriorating/\">WATCH: Citizens are very happy with service delivery in hospitals – says Health Ministry tells Parliament, refuses to admit healthcare system is deteriorating</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "ZIFA president not happy with slow pace of NSS renovations",
            "url": "https://www.newzimbabwe.com/zifa-president-not-happy-with-slow-pace-of-nss-renovations/",
            "content": "By Sports Reporter\n\nZIFA president Nqobile Magwizi is not pleased with the slow pace of renovations at the National Sports Stadium (NSS).\n\nHe said this Wednesday during a tour to assess the giant facility by Special Adviser to the President responsible for Monitoring and Implementation of Government programs, Jorum Gumbo, Minister of Sports, Anselem Sanyatwe and Minister of State for Harare Province, Charles Tavengwa.\n\nAlthough bucket seats have been installed in the stadium, a number of areas which CAF recommended are yet to be attended to.\n\nThese include flood lights, improvement of the water reticulation system, electronic screens and others.\n\nI think the progress is positive.\n\n Im not entirely happy because we would want to use this stadium as soon as possible, said Magwizi.\n\nZimbabwes football national teams have been playing all FIFA-sanctioned games in foreign countries.\n\nMagwizi added that they are hoping the NSS will be ready to host international games by September, when the Warriors will be back in action for the 2026 World Cup Qualifiers.\n\nOur next match is for the national team, the mens, in September, and we definitely must play here.\n\nWe have to play here, we cannot afford another match where our national teams are playing outside.\n\nWe are obviously grateful to the government for the support theyve been given in ensuring that at least the bucket seats are in place.\n\nThe government has been working with its private partners to make sure that we have seen this development, as we can all witness.\n\nBut theres a lot more that needs to be done. We need to make sure that the pitch is ready for match, added Magwizi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter ZIFA president Nqobile Magwizi is not pleased with the slow pace of renovations at the National Sports Stadium (NSS). He said this Wednesday during a tour to assess the giant facility by Special Adviser to the President responsible for Monitoring and Implementation of Government programs, Jorum Gumbo,  Minister of Sports, Anselem Sanyatwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-president-not-happy-with-slow-pace-of-nss-renovations/\">ZIFA president not happy with slow pace of NSS renovations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "‘Tyranny threatening future of journalism’— MISA regional chair",
            "url": "https://www.newzimbabwe.com/tyranny-threatening-future-of-journalism-misa-regional-chair/",
            "content": "By Staff Reporter\n\nTHE media across the world is increasingly losing its ability to play the watchdog role amid a clampdown on journalists by repressive governments, a Media Institute of Southern Africa (MISA) top official has said.\n\nTyranny, he said, has managed to silence the media from exposing malfeasance and other vices, fearing consequences. Resultantly, journalists have chosen to refrain from covering such stories or toed the line of rogue leaders.\n\nAddressing delegates at the Regional World Press Freedom Day commemorations held in Johannesburg, South Africa, this Wednesday, MISA Regional Chairperson Jeremias Langa said the journalism profession is under renewed threats.\n\nLadies and gentlemen, we gather this year to commemorate World Press Freedom Day, albeit belatedly, during a time when journalism confronts both old and new challenges, Langa said.\n\nI do not want to sound pessimistic, but I want to begin by saying that we are in unprecedented times, in which the very future of journalism is at stake.\n\nThe rise of right-wing movements in the West and the ongoing assault against the media in the United States do not bode well for the future of independent journalism.\n\nWhere the media once stood strong against tyranny, we are increasingly witnessing it recoil and toe the line of the leaders.\n\nThis is ominous not just for freedom of the press but also for democracy, which the global order has been trying to build for the past several decades.\n\nIt wasnt perfect, but at least we were working toward something we believed would give us a chance to prosper.\n\nTurning to emerging issues in the Southern African region, Langa, a Mozambican national, said in his own country, journalism was heavily threatened.\n\nIn my country, Mozambique, we witnessed shocking attacks on the media following the 2024 elections. While elections are often accompanied by violence, nothing could prepare us for the extensive assault on journalists.\n\nDevelopments in Zimbabwe did not evade Langas lenses, highlighting the arrest of Alpha Media Holdings Heart and Soul Television (HStv) journalist Blessed Mhlanga as a sore thumb.\n\nIn neighbouring Zimbabwe, Alpha Media Holdings senior journalist Blessed Mhlanga had spent over 70 days in prison before being granted bail on 6 May 2025.\n\nMhlanga is facing two counts of contravening Section 164 of the Criminal Law (Codification and Reform) Act, which addresses transmitting data messages inciting violence or damage to property.\n\nLanga noted that in Zambia, the government recently approved two cyber laws that may enable extensive surveillance on citizens, undermining the right to privacy.\n\nThis has a chilling effect on freedom of expression and the media. Such laws have been used in other jurisdictions to target political opponents, journalists, and activists.\n\nI could continue, ladies and gentlemen, illustrating how we have regressed over the past year as a region.\n\nThe MISA regional chairperson also focused on the impact of Artificial Intelligence (AI) on society, and the media specifically.\n\nWe have seen in the past few years that new technologies possess revolutionary potential for transforming our methods and enhancing the efficiency of our work.\n\nHowever, in our context, there is a genuine reason to fear that AI may be utilised to reproduce misinformation, spread disinformation, amplify online hate speech, and facilitate new forms of censorship.\n\nThe COVID-19 experience demonstrated how quickly our governments enact laws and regulations that facilitate surveillance under the guise of cybersecurity.\n\nWithin days of lockdowns being introduced, most countries in the region had enacted laws that promoted surveillance. Such laws remained in place, despite the pandemic showing signs of ebbing.\n\nWhile AI is still nascent in Southern Africa, it is imperative that we adopt a multi-stakeholder approach to developing guidelines on the technologys adoption, while simultaneously reaffirming our universal commitment to freedom of expression and press freedom.\n\nDuring his address, Langa rhetorically asked if the media was operating freely in pursuit of its mandate to inform, educate and entertain.\n\n I would like to ask whether we, as journalists, are truly reporting in a brave new world, or in a now scary and uncertain new world.\n\nI hope we will all leave with solid takeaways on the next concrete steps we urgently need to take to improve our situation, Langa noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07194641/jeremiasl.misa_-825x510-1.jpg",
            "description": "<p>By Staff Reporter THE media across the world is increasingly losing its ability to play the watchdog role amid a clampdown on journalists by repressive governments, a Media Institute of Southern Africa (MISA) top official has said. Tyranny, he said, has managed to silence the media from exposing malfeasance and other vices, fearing consequences. Resultantly,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tyranny-threatening-future-of-journalism-misa-regional-chair/\">‘Tyranny threatening future of journalism’— MISA regional chair</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "Industry hints at tough times ahead as ZWG yearly inflation hits 85%",
            "url": "https://www.newzimbabwe.com/industry-hints-at-tough-times-ahead-as-zwg-yearly-inflation-hits-85/",
            "content": "By Alois Vinga\n\nTHE Confederation of Zimbabwe Industries (CZI) says current ZWG inflationary trends are not going hand in hand with market interventions, hinting at tough times if combative measures are not employed on time.\n\nThe industry lobby group has also blamed the decision taken by authorities, which resulted in devaluing the ZWG currency, for triggering the high local currency yearly inflation rates.\n\nThe Reserve Bank of Zimbabwe (RBZ) embraced the ZWG currency in April 2024, presenting it as the countrys final solution to decades-long currency problems. On inception, the RBZ governor, Dr John Mushayavanhu, described the ZWG as both a minerals and foreign currency reserves-backed currency.\n\nAbout five months later, the ZWG had suffered heavy market bruises against the US$ on both the parallel and formal market, forcing the central bank to order a 43% devaluation overnight.\n\nIn its latest inflation tracker, CZI decried the April 2025 ZWG annual inflation rate of 85,7 %, which was blamed on the RBZs devaluation directive.\n\nThe high ZWG inflation largely reflects cumulative shocks that drove month-on-month inflation in 2024. A significant factor was the September 2024 exchange rate devaluation, which substantially increased the ZiG Consumer Price Index (CPI) and, in turn, elevated annual inflation compared to April 2024 levels, the industry grouping said.\n\nThe high ZiG annual inflation, CZI said, poses challenges for businesses, particularly due to its impact on interest rates. To achieve a positive real interest rate, lending rates would need to be set around 85%, making borrowing difficult for businesses.\n\nConversely, interest rates below the inflation rate may encourage speculative borrowing. Effective monetary policy will require a delicate balance to mitigate these adverse effects, said Industry.\n\nThe business grouping said that as a result, the parallel market premium started showing an upward trend on the 17th of April 2025 as the ZWG depreciated on the parallel market despite still being stable on the official market.\n\nBy comparing the period 01 to 29 March 2025 with 01 to 29 April 2025, CZI contends data shows that the premium has slightly increased from an average of 25% to 28%, respectively.\n\nAn increasing parallel market premium distorts price signals to both businesses and consumers. The recent announcement that gold coins are now available was expected to absorb any pressure for ZWG to depreciate, as holders of ZWG can realise a higher value from buying gold coins at a time when gold prices are increasing.\n\nThus, the expectation was that the parallel market premium would actually shrink rather than increase, the industry added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga THE Confederation of Zimbabwe Industries (CZI) says current ZWG inflationary trends are not going hand in hand with market interventions, hinting at tough times if combative measures are not employed on time. The industry lobby group has also blamed the decision taken by authorities, which resulted in devaluing the ZWG currency, for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industry-hints-at-tough-times-ahead-as-zwg-yearly-inflation-hits-85/\">Industry hints at tough times ahead as ZWG yearly inflation hits 85%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "Opposition calls for investigations into Chivayo’s source of wealth",
            "url": "https://www.newzimbabwe.com/opposition-calls-for-investigations-into-chivayos-source-of-wealth/",
            "content": "By Alois Vinga\n\nFORMER legislator and opposition activist, Amos Chibaya, has called for a probe into businessman Wicknell Chivayos source of wealth, which he says is long overdue.\n\nThe controversial tenderpreneur has made headlines splurging on popular figures in Zimbabwe, including artists and church leaders.\n\nChivayo also finds himself mired in tender scandals in the country, raising suspicions that he could be benefiting illegally from taxpayers money.\n\nSpeaking to NewZimbabwe.com on the sidelines of the recent Zimbabwe Congress of Trade Unions organised Workers Day event, Chibaya raised quiried Chivayos source of wealth at a time when many workers were struggling to make ends meet.\n\nI am sure you took note of the fact that the 2025 ZCTU theme talks about ending corruption. On the issue of corruption, I do support the team from ZCTU. You can see that Chivayo is busy distributing vehicles, giving people money and all. But the question is, where is that money coming from? Sadly, there is no investigation whatsoever, no arrest whatsoever, he said.\n\nChibaya said the national resources must be shared equally among all citizens, as opposed to just the elite benefiting, as is the case. He said under the current setup, many workers are reeling in poverty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/12034606/Wicknell-Chivayo.png",
            "description": "<p>By Alois Vinga FORMER legislator and opposition activist, Amos Chibaya, has called for a probe into businessman Wicknell Chivayo’s source of wealth, which he says is long overdue. The controversial tenderpreneur has made headlines splurging on popular figures in Zimbabwe, including artists and church leaders. Chivayo also finds himself mired in tender scandals in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-calls-for-investigations-into-chivayos-source-of-wealth/\">Opposition calls for investigations into Chivayo’s source of wealth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "Pair jailed 40 years each for double murder, dumping victims’ bodies in village well",
            "url": "https://www.newzimbabwe.com/pair-jailed-40-years-each-for-double-murder-dumping-victims-bodies-in-village-well/",
            "content": "By Staff Reporter\n\nTHE High Court sitting in Bulawayo has sentenced two men to 40 years imprisonment each for the gruesome killing of two Mphoeng villagers in October 2023.\n\nAccused persons, Modiri Dube (27) and Methuli Ncube (28), both of Mphoeng, appeared in court for two brutal murders committed on the night of October 31, two years ago.\n\nDube and Ncube were convicted on both counts and sentenced to 20 years imprisonment for each count, making them 40 years each in total.\n\nTheir accomplice Lucky Mpofu is still at large.\n\nCircumstances were that the pair, along with their partner-in-crime, were drinking beer with Milton Moyo (25) and Bhekinkosi Ncube (24) at Manyondo Bar in Ingwizi before luring them to Mpofus homestead.\n\nWhilst at the homestead, one or both accused persons struck Moyo on the chest with an unknown object, leading to his instant death. Assailants then connived to dump the now deceaseds body into the village well.\n\nCourt heard that, fearing that Bhekinkosi would report the murder, the trio fatally attacked him with a brick and a stitching needle, before disposing of his body in the same well.\n\nThe grim discovery of the two corpses was made days later, following a strong stench of rotting human flesh emanating from the well, while other villagers complained of an unusual taste of the water.\n\nPolice were notified and, on November 4, 2023, attended the scene and retrieved the decomposing bodies from the well.\n\nSubsequent investigations by police led to the arrest of Dube and Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter THE High Court sitting in Bulawayo has sentenced two men to 40 years’ imprisonment each for the gruesome killing of two Mphoeng villagers in October 2023. Accused persons, Modiri Dube (27) and Methuli Ncube (28), both of Mphoeng, appeared in court for two brutal murders committed on the night of October 31,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pair-jailed-40-years-each-for-double-murder-dumping-victims-bodies-in-village-well/\">Pair jailed 40 years each for double murder, dumping victims’ bodies in village well</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "Chirewa returns to Wolves as Huddersfield loan deal ends",
            "url": "https://www.newzimbabwe.com/chirewa-returns-to-wolves-as-huddersfield-loan-deal-ends/",
            "content": "By Sports Reporter\n\nZimbabwe international midfielder Tawanda Chirewa is returning to Wolverhampton Wanderers as Huddersfields loan deal ends.\n\nThe 21-year-old midfielder was loaned to Huddersfield in January on a five-month loan deal, which expires end of this month.\n\nUpdating on Chirewa loan deal and others, Huddersfield posted, We have today confirmed our 2024/25 Retained List, with 10 players who have First Team appearances set to depart the Club at the conclusion of their contracts.\n\nHaving spent the 2024/25 season at the John Smiths Stadium on loan, Callum Marshall, Nigel Lonwijk, Joe Hodge, and Tawanda Chirewa will all return to their parent clubs with our thanks and best wishes for the future.\n\nChirewas parent club, Wolves, is home to Warriors vice-captain Marshall Munetsi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06050701/chirewa.webp",
            "description": "<p>By Sports Reporter Zimbabwe international midfielder Tawanda Chirewa is returning to Wolverhampton Wanderers as Huddersfield’s loan deal ends. The 21-year-old midfielder was loaned to Huddersfield in January on a five-month loan deal, which expires end of this month. Updating on Chirewa loan deal and others, Huddersfield posted, “We have today confirmed our 2024/25 Retained List,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chirewa-returns-to-wolves-as-huddersfield-loan-deal-ends/\">Chirewa returns to Wolves as Huddersfield loan deal ends</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "Toyota Hilux GD-6 recovered in Zimbabwe after a woman was robbed in Botswana",
            "url": "https://www.newzimbabwe.com/toyota-hilux-gd-6-recovered-in-zimbabwe-after-a-woman-was-robbed-in-botswana/",
            "content": "IOL\n\nThe Botswana Police Service (BPS) working in collaboration with the Zimbabwe Republic Police (ZRP) has recovered a Toyota Hilux GD-6 bakkie in Zimbabwe after it was stolen in Botswana.\n\nIn a statement, spokesperson for theBotswana Police Service, Assistant Commissioner Near Bagali said the security cooperation with the Zimbabwe Republic Police continues to yield positive results.\n\nThe owner of a Toyota Hilux GD-6, valued at over P590,000 (almost R790,000) was in distress after three unknown men robbed her and stole it at Matsiloje village, the BPS embarked on investigations to locate it and arrest the perpetrators, said Bagali.\n\nActing on information that it (the bakkie) might have crossed into the Republic of Zimbabwe, they promptly shared information with their counterparts and a joint investigation ensued.\n\nFollowing an intensive search, ZRP successfully recovered the vehicle in Figtree, Zimbabwe.\n\nThe two security organs are currently in hot pursuit of the criminals who are still at large, while plans are underway to return the vehicle to Botswana, said Bagali.\n\nBotswana Police Service would like to profoundly thank the Zimbabwe Republic Police for their unwavering commitment to combat cross-border and transnational organised crime. This case has demonstrated the true spirit and testament of excellent bilateral relations between the two neighbours.\n\nLast year,IOL reported that police in Limpopo arrested a 29-year-old man for possession of a suspected stolen vehicle, a bakkie which was reported stolen in Garsfontein, east of Pretoria.\n\nThe white Toyota Hilux GD-6 double cab was en route to the Beitbridge border post, where police believe it would be smuggled out of the country.\n\nFollowing on information and diligent investigative work, members of the provincial murder and robbery, and the tracking team working jointly with private security company intercepted the vehicle next to Peter Mokaba Stadium in Polokwane, provincial police spokesperson in Limpopo, Colonel Malesela Ledwaba said at the time.\n\nThe vehicle, reported stolen from Garsfontein in Gauteng, was allegedly set to be illegally exported out of South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07202813/Screenshot-2025-05-07-at-21.26.31.png",
            "description": "<p>IOL The Botswana Police Service (BPS) working in collaboration with the Zimbabwe Republic Police (ZRP) has recovered a Toyota Hilux GD-6 bakkie in Zimbabwe after it was stolen in Botswana. In a statement, spokesperson for the Botswana Police Service, Assistant Commissioner Near Bagali said the security cooperation with the Zimbabwe Republic Police continues to yield positive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/toyota-hilux-gd-6-recovered-in-zimbabwe-after-a-woman-was-robbed-in-botswana/\">Toyota Hilux GD-6 recovered in Zimbabwe after a woman was robbed in Botswana</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        },
        {
            "title": "Black smoke signals no pope elected in first conclave vote",
            "url": "https://www.newzimbabwe.com/black-smoke-signals-no-pope-elected-in-first-conclave-vote/",
            "content": "Black smoke billowed from the chimney of the Sistine Chapel on Wednesday evening, signalling an inconclusive first vote by cardinals locked in the Sistine Chapel in aconclave to elect a new popeto guide the Roman Catholic Church.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/07203408/sistine-chapel.webp",
            "description": "<p>Reuters Black smoke billowed from the chimney of the Sistine Chapel on Wednesday evening, signalling an inconclusive first vote by cardinals locked in the Sistine Chapel in a conclave to elect a new pope to guide the Roman Catholic Church. Thousands of faithful gathered in St. Peter’s Square waiting for smoke to pour from a narrow</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/black-smoke-signals-no-pope-elected-in-first-conclave-vote/\">Black smoke signals no pope elected in first conclave vote</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "08 May 2025"
        }
    ]
}