{
    "news": [
        {
            "title": "Mnangagwa dangles US$2 billion loan facility to farmers",
            "url": "https://www.newzimbabwe.com/mnangagwa-dangles-us2-billion-loan-facility-to-farmers/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has revealed that the government will unveil US$1.98 billion over a period of 10 years as a loan facility for farmers to install productivity boosters, countering effects of climate change.\n\nProductivity booster is an irrigation package designed to cover one hectare of irrigated land per farmer. Containing pumps, pipes, sprinklers, and related equipment, these productivity booster kits are meant to assist farmers in handling the challenges posed by climate change.\n\nSpeaking at thelaunch of the productivity booster kit programme in Mazowe on Monday, Mnangagwa said the equipment will be made available to tobacco smallholder farmers.\n\nMy Government plans to allocate US$1.98 billion over 10 years as a loan for the Productivity Booster Kit Programme. Additionally, five banks have committed to providing additional working capital.\n\nThe Productivity Booster Kits will also be made available to smallholder tobacco farmers, to localise the procurement of farming equipment and other aspects of the tobacco value chain, said Mnangagwa.\n\nA total of 10,000 farmers have been targeted to benefit from the first phase of the programme, with each receiving US$6,000 for the acquisition of the productivity booster kits.\n\nAccording to Mnangagwa, as a result of the kits, A1 farmers are estimated to contribute US$6.14 billion to the agricultural sector GDP from the envisaged production of 10 million tons per year.\n\nThe productivity kits are earmarked to alleviate the country from the consequences of climate change.\n\nMnangagwa further said the target is to irrigate more than 400,000 hectares of land by 2030.\n\nThe devastating effects of the El Nio-induced drought during the 2023/2024 season, among other experiences, have shown us the urgent need to climate-proof agriculture. To this end, we have set for ourselves an ambitious and achievable target to develop 496,000 hectares of land under irrigation by 2030, with over 350,000 hectares under summer cereal production, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has revealed that the government will unveil US$1.98 billion over a period of 10 years as a loan facility for farmers to install productivity boosters, countering effects of climate change. Productivity booster is an irrigation package designed to cover one hectare of irrigated land per farmer. Containing pumps, pipes,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-dangles-us2-billion-loan-facility-to-farmers/\">Mnangagwa dangles US$2 billion loan facility to farmers    </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "26 Aug 2025"
        },
        {
            "title": "High Court slaps Chinese miner with ban in mine dispute",
            "url": "https://www.newzimbabwe.com/high-court-slaps-chinese-miner-with-ban-in-mine-dispute/",
            "content": "By Mary Taruvinga\n\nThe Chinhoyi High Court has barred Beijing Broadtec Investments (Pvt) Ltd from carrying out any mining operations at the contested Mukovo 12 Mine in Mashonaland West Province, blasting the Chinese firms conduct as unlawful and a threat to the late Josphat Mutiziras estate.\n\nJustice Philda Muzofa, granting a provisional order, interdicted the company together with its employees and/or agents and/or assignees from mining or interfering with the estates rights, pending the outcome of an appeal lodged with the Minister of Mines.\n\nThe applicant has been on the mining location for over five years and has obviously heavily invested in the mining entity, Muzofa said.\n\nEven if there are no mining rights since they were suspended, in my view, the applicant still has the residual rights to protect its interests in the property.\n\nThe executor of the estate, Elmon Mutizira, approached the court after Beijing Broadtec allegedly violently invaded Mukovo 12 on June 27, evicted workers, vandalised equipment, and deployed guards at the site.\n\nJustice Muzofa tore into the miners defence that its presence at Mukovo 12 was merely for security purposes, stressing that the company had no lawful rights to protect under its EPO (Exclusive Prospecting Order).\n\nIf the 1st respondent is a law-abiding citizen, why would it resist such an order to prohibit activities at Mukovo 12? the judge asked. It has no mining rights to protect and no right to post security at Mukovo 12.\n\nThe court also dismissed Broadtecs attempt to block the application on the dirty hands doctrine after accusing Mutizira of trying to sneak out of mine dumps. There are no dirty hands to speak of, Justice Muzofa ruled. It is incomprehensible that 1st respondent insisted that the applicant must not be heard until it purged its contempt, yet there was nothing to purge.\n\nFinding the balance of convenience tilted in favour of the estate, Muzofa ruled that without the interdict, the applicant stands to lose his equipment to vandalism. If the 1st respondent continues to conduct mining activitiesthe applicant stands to lose the value of minerals.\n\nThe order effectively freezes all activity at Mukovo 12 until the Minister of Mines determines Mutiziras pending appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The Chinhoyi High Court has barred Beijing Broadtec Investments (Pvt) Ltd from carrying out any mining operations at the contested Mukovo 12 Mine in Mashonaland West Province, blasting the Chinese firm’s conduct as unlawful and a threat to the late Josphat Mutizira’s estate. Justice Philda Muzofa, granting a provisional order, interdicted the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-slaps-chinese-miner-with-ban-in-mine-dispute/\">High Court slaps Chinese miner with ban in mine dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "26 Aug 2025"
        },
        {
            "title": "MacG and Robot Boi make waves with their cameos on ‘Shaka iLembe’",
            "url": "https://www.newzimbabwe.com/macg-and-robot-boi-make-waves-with-their-cameos-on-shaka-ilembe/",
            "content": "TimesLive\n\nThe latest episode of Mzansi MagicsShaka iLembehas fans buzzing with excitement after Mac G and Robot Boi made their unexpected cameos on the show.\n\nThe two stars took to their timeline to reflect on their experiences.\n\nQWAAAAAABE.Liyabonga iLobot Madoda, Robot Boi, who did a monologue in Zulu, captioned the post showcasing images from the set of the hit show.\n\nMacG also recounted his experience on the latest episode ofPodcast and Chill.\n\nThe podcaster revealed that they shot their scenes from 9am to 5pm under the scorching hot sun while wearing g-strings.\n\nHe went on to say that with this having been his acting debut, he had new-found respect for thespians.\n\nWe shot the whole day. The sun was crazy. We were standing in the sun the whole day, he said.The energy was different. Its a different atmosphere, you feel like youre back in those days. I felt Zulu by the end of the day. When I got there, I had a fade. It took an hour for them to put [faux] hair on. That was a hard day of work.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/25202222/shaka-ilembe-macg-robotboi.jpg",
            "description": "<p>TimesLive The latest episode of Mzansi Magic’s Shaka iLembe has fans buzzing with excitement after Mac G and Robot Boi made their unexpected cameos on the show. The two stars took to their timeline to reflect on their experiences. “‘QWAAAAAABE’. Liyabonga iLobot Madoda,” Robot Boi, who did a monologue in Zulu, captioned the post showcasing images from the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/macg-and-robot-boi-make-waves-with-their-cameos-on-shaka-ilembe/\">MacG and Robot Boi make waves with their cameos on ‘Shaka iLembe’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "26 Aug 2025"
        }
    ]
}