{
    "news": [
        {
            "title": "IOC: Zimbabwe’s Kirsty Coventry aiming to make history",
            "url": "https://www.newzimbabwe.com/ioc-zimbabwes-kirsty-coventry-aiming-to-make-history/",
            "content": "DW\n\nKirsty Coventry will make sporting history if she is electedpresident of the International Olympic Committee (IOC)at its General Assembly on Thursday (March 20,2025). She would be the first woman and first person from Africa to head the IOC.\n\nShe would also be the youngest since Pierre de Coubertin, the founding father of the modernOlympic Games. The Frenchman founded the IOC in 1894 and took over the presidency two years later at the age of 33.\n\nCoventry, a 41-year-old former world-class swimmer fromZimbabwe, has always had a strong will and vision.\n\nWhen I was 9 years old, I told my dad I wanted to go to the Olympics and win gold. He told me it would be a rough road ahead, he explained how difficult it was just to make the Olympic team let alone win a medal, but he believed in me, she wrote in a Facebook post a few years ago.\n\nAt the age of 20, she made her dream come true. At the 2004 Games in Athens, Coventry won the gold medal in the 200-meter backstroke. Four years later, in 2008 in Beijing, she won gold again. In addition to those two gold medals, she collected four Olympic silver medals and one bronze. This makes Coventry Africas most successful female Olympian of all time. The only African who has had more success at the Olympics is long-distance runner Tirunesh Dibaba of Ethiopia  who won three gold medals (and two bronze).\n\nI have been to five Olympic Games, won seven individual Olympic medals, broken multiple world records and had one of the best World Championship careers of all time, Coventry wrote on her Linkedin profile.\n\nHowever, none of this is as important as what this success did and can do for others. It united my country where divisions caused by economic and political turmoil were crippling it, and it gave hope to people who thought their circumstances prevented them from following their dreams.\n\nWhile still an active swimmer, Coventry was elected to the IOC Athletes Commission in 2013. She represented the interests of athletes for eight years, including three years as chairperson. More recently, she has been a member of the IOC Executive Board.\n\nThe increased influence of the Zimbabwean has raised hopes in Africa that the Summer Olympics could be hosted on the African continent for the first time.\n\nAlthoughSouth AfricaandEgypthave expressed their interest, Coventry has played down such expectations.\n\nThe interest is there and now we need to ensure that were working closely with all of these countries that are interested so that they fully understand the magnitude of the Olympic Games, she said.\n\nThe countries of Africa, Coventry said in a Q&A session organized by the Association of International Sports Journalists (AIPS), should really strategically look from the African Union point of view on how we can develop through the All Africa Games our infrastructure that can then be followed up and used by an Olympic Games bid.\n\nCoventry knows from experience just how tough such political processes can be. She has been Zimbabwes Minister of Sport since 2018. She says she now has definitely a thicker skin than she used toas an athlete.\n\nWhen asked whether she thinks trans women should be allowed to compete in womens competitions, she was evasive.\n\n100% it is necessary to find a solution, Coventry said. I think that we as the IOC have to take a little bit more of a leadership role.\n\nThe Zimbabwean also avoided going too far out on a limb on another hot topic before the IOC election: the possibility of Russian and Belarusian athletes competing at the Olympics.\n\nI think above anything else its our duty as the IOC to ensure that all athletes can participate at the Games, she said. Thats going to look different for a number of different athletes but at the end of the day I do believe that we need to find a holistic way of sadly dealing with athletes from conflict areas.\n\nShe was speaking in light of her experience competing for Zimbabwe at a time when the country was in political turmoil and under international sanctions.\n\nIt could have been very easy for the international community to not allow us to take part. I look at (it) and say what would my life be today? I am grateful that I was not held accountable for what the leaders and governments were doing.\n\nKirsty Coventry is not only a sports administrator and politician, but also a mother. She gave birth to her second daughter less than six months ago. Her eldest is six years old.\n\nBy the time she was one year old, she had already been to 10 different countries around the world, Coventry said.\n\nI have an incredible network of support from my husband and family. This is a normal way of life for us. I think its a good way to show that women are just as capable as men even if we are to be expected to be full-time mothers, wives, daughters etc.\n\nWe still have a lot of work to do, and I am excited about leading this movement, Coventry said of gender equality. Women are ready to lead. I look at it as an opportunity to push through boundaries so that when my two girls are growing up, they dont have the same boundaries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/20081424/Kirsty-Coventry.jpg",
            "description": "<p>DW Kirsty Coventry will make sporting history if she is elected president of the International Olympic Committee (IOC) at its General Assembly on Thursday (March 20,2025). She would be the first woman and first person from Africa to head the IOC. She would also be the youngest since Pierre de Coubertin, the founding father of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ioc-zimbabwes-kirsty-coventry-aiming-to-make-history/\">IOC: Zimbabwe’s Kirsty Coventry aiming to make history</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Brace for AI-related labour challenges – govt",
            "url": "https://www.newzimbabwe.com/brace-for-ai-related-labour-challenges-govt/",
            "content": "By Alois Vinga\n\nTHE Public Service, Labour and Social Welfare Secretary Simon Masanga has bemoaned the challenges triggered by the emergingArtificial Intelligence technologies on the back of calls for stakeholders to brace for the new environment.\n\nAI is the science and engineering of creating intelligent machines, particularly computer programs, that can perform tasks requiring human intelligence.\n\nIt aims to enable machines to demonstrate human-like reasoning and capabilities, including autonomous decision-making, speech recognition, pattern recognition, and problem-solving.\n\nIndustry experts have described the developments as the catapult to achieving the 4thIndustrial Revolution (4IR).\n\nSpeaking to stakeholders at the Zimbabwe-Namibia bilateral exchange program held in the City of Bulawayo recently, Masanga addressedthe emerging AI challenges in the labour market.\n\nThe world of work is rapidly changing, influenced by technological advancements, global pandemics like Covid 19 and climate change. The advent of AI and automation is reshaping traditional employment structures, raising concerns about job security, fair wages and protection of workers rights.\n\nAs AI continues to permeate into workplaces new forms of labour disputes may arise necessitating adaptative and forward-looking dispute resolution mechanisms that account for algorithm decision making, data privacy and equitable access to opportunities, he said.\n\nSpeaking at a different event during the same week, UN resident coordinator, Edward Kallon said AI presents both opportunities and threats.\n\nUnited Nations resident coordinator Edward Kallon said AI was a key driver of the fourth industrial revolution.\n\nIn view of these realities, countries across the globe are increasingly positioning themselves to take full advantage of opportunities presented by these technological innovations and in particular, artificial intelligence, to advance their respective national development agendas and, consequently, transform the lives of their citizens.\n\nIt is, however, also true that as transformative as these technologies are, there are many risks associated with them, both inherent and overt, that cannot be overlooked and hence must be addressed by countries to ensure the development and application of AI systems in both the public and private sectors are ethically compliant, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18041635/Secretary-for-Public-Service-Labour-and-Social-Welfare-Mr-Simon-Masanga.jpg",
            "description": "<p>By Alois Vinga THE Public Service, Labour and Social Welfare Secretary Simon Masanga has bemoaned the challenges triggered by the emerging Artificial Intelligence technologies on the back of calls for stakeholders to brace for the new environment. AI is the science and engineering of creating intelligent machines, particularly computer programs, that can perform tasks requiring human</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brace-for-ai-related-labour-challenges-govt/\">Brace for AI-related labour challenges – govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Chiredzi Town Council launches blitz on illegal vendors",
            "url": "https://www.newzimbabwe.com/chiredzi-town-council-launches-blitz-on-illegal-vendors/",
            "content": "By Staff Reporter\n\nThe Chiredzi Town Council has announced plans to launch an operation to remove informal vendors who have set up makeshift stalls and tuck shops in unauthorized locations.\n\nIn an urgent notice, the Town Secretary Wesley Kauma, said the operation is supported by various law enforcement agencies.\n\nThere has been a rise in illegal business operations, which has become a big issue in our town. Many informal traders and vendors have set up makeshift stalls and tuck-shops in unauthorized areas. Chiredzi Town Council has provided vendors and traders with designated areas to freely conduct their businesses, as a way to have organized and regulated business transactions and operations, the notice reads.\n\nKauma added that the illegal vendors and unauthorized businesses pose health risks and cause congestion in the town.\n\nVendors and traders failure to operate from their designated spaces has resulted in unsightly landscapes around the town, exposure to health risks and disruption of normal business operations as well as traffic flow.\n\nFurthermore, these illegal activities have gone on to deprive licensed businesses of business opportunities, wrote Kauma.\n\nThis operation aims to restore order through enforcement of by-laws, provision of designated trading areas and continued engagement with various stakeholders.\n\nThe government last week ordered all local authorities to remove illegal vendors from the central business districts. They have however stay put citing the high unemployment rate and economic crisis have forced them to turn to vending.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/02041722/Vendors.jpg",
            "description": "<p>By Staff Reporter The Chiredzi Town Council has announced plans to launch an operation to remove informal vendors who have set up makeshift stalls and tuck shops in unauthorized locations. In an urgent notice, the Town Secretary Wesley Kauma, said the operation is supported by various law enforcement agencies. “There has been a rise in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiredzi-town-council-launches-blitz-on-illegal-vendors/\">Chiredzi Town Council launches blitz on illegal vendors </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "We are ready to deal with you – State Security Minister says ahead of planned protests",
            "url": "https://www.newzimbabwe.com/we-are-ready-to-deal-with-you-state-security-minister-says-ahead-of-planned-protests/",
            "content": "By Staff Reporter\n\nMINISTER of State for National Security Lovemore Matuke has sent a chilling warning to war veterans and other groups plotting protests against President Emmerson Mnangagwa saying they are ready to deal with them decidedly.\n\nDisgruntled Zimbabwe National Liberation War Veterans Association (ZNLWVA) members last week notified police that they will be staging a protest on March 20 to demand accountability from the government and draw attention to the countrys economic crisis which they attribute to weak leadership, corruption and favouritism.\n\nMatuke, who oversees the Central Intelligence described the planned protests asbaseless social media chatter from the diaspora, warning security detailsare prepared to respond if any take place.\n\nHe was speaking at the groundbreaking ceremony of Zishumbe Clinic in Masvingo North constituency held over the weekend.\n\nThere are rumours that there are planned protests at the end of this month and we want to let you know there is nothing like that.\n\nIt is just social media noise from the people in the diaspora and if there are any planned protests, we want to warn you that we are ready and we will be waiting to deal with such.\n\nOur leadership is united and we are following our only leader President Emmerson Mnangagwa and we are pushing for 2030 because we have seen his work, he said.\n\nThe 2030 agenda has further divided the ruling Zanu PF party, into two distinct factions. A faction loyal to Mnangagwa is advocating for the suspension of the 2028 elections to allow him to remain in power until 2030 and the other, believed to be aligned to Vice President Constantino Chiwenga, pushing for adherence to the constitutional term limits.\n\nWhile Mnangagwa has called himself a constitutionalist who will not remain in power beyond the constitutionally stipulated two terms, he has not publicly rebuked those pushing for his stay.\n\nZNLWVA is among those against Mnangagwas third term and is backing outspoken war veteran Blessed Geza who has been publicly criticising the 2030 agenda.\n\nGeza has gone into hiding after police launched a manhunt for him on four charges, including inciting public violence and defying the Presidents authority.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18034639/matuke.png",
            "description": "<p>By Staff Reporter MINISTER of State for National Security Lovemore Matuke has sent a chilling warning to war veterans and other groups plotting protests against President Emmerson Mnangagwa saying they are ready to deal with them decidedly. Disgruntled Zimbabwe National Liberation War Veterans Association (ZNLWVA) members last week notified police that they will be staging</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-ready-to-deal-with-you-state-security-minister-says-ahead-of-planned-protests/\">We are ready to deal with you – State Security Minister says ahead of planned protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "We have a target on our back – Ndiraya",
            "url": "https://www.newzimbabwe.com/we-have-a-target-on-our-back-ndiraya/",
            "content": "By Darlington Gatsi\n\nSINCE Scottland made their Castle Lager Premier Soccer League (PSL) debut at Rufaro Stadium, they have been met with hostility.\n\nThe hostility partly stems from the team having raided the traditional giants of their valuable players in a spending spree during the transfer period.\n\nThe disdain also emanates from Scottlands proprietor, Pedzisai Scott Sakupwanyas controversial clinching of the Mabvuku parliamentary seat.\n\nFootball fans in Harare have, in the past three matches, thronged Rufaro Stadium to support every team that plays against Scottland.\n\nA Scottland defeat is met with jubilation, as was the case on Friday when Ngezi Platinum defeated the new boys 1-0.\n\nOn the field of play, PSL clubs summon strength and fighting spirit when playing against the star-studded Scottland, which boasts of Khama Billiat and Walter Musona among several national team players.\n\nScottland coach Tonderai Ndiraya said his team is playing with a target on its back, with every team out to prove themselves against them.\n\nI think we saw it when we played our first match here. We saw that it was going to be a very long season for us. It looks like we are becoming a team to beat. Every match is going to be very difficult for us.\n\nIt is our first season in the league but it has come with a lot of pressure from the fans and we have to be strong mentally to a level where we can resist some of the pressure that is being thrown at us, said Ndiraya.\n\nDespite having seasoned players in its ranks, Scottland began the campaign on a low, needing an own goal to secure a victory against Triangle. Scottland then convincingly beat CAPS United 2-0 in the following encounter.\n\nNgezi Platinum then handed Scottland their first defeat in the league with a 1-0 victory. The defeat miffed Sakupwanya who left the stadium 30 minutes after the encounter as he struggled to terms with the result.\n\nNdiraya, albeit seeing light on the upside, said Scottland has to be up for a gruelling challenge in the PSL.\n\nThe good thing is people are coming to watch the games and partly because of the players we have in our team. When you have such a good team then every team wants to beat you. All the people will come and want to watch the match. We have to be mentally strong to walk the journey, said Ndiraya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/03194742/Tonderai-Ndiraya.jpeg",
            "description": "<p>By Darlington Gatsi SINCE Scottland made their Castle Lager Premier Soccer League (PSL) debut at Rufaro Stadium, they have been met with hostility. The hostility partly stems from the team having raided the traditional giants of their valuable players in a spending spree during the transfer period. The disdain also emanates from Scottland’s proprietor, Pedzisai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-have-a-target-on-our-back-ndiraya/\">We have a target on our back – Ndiraya </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Seven of 15 land barons who invaded former Minister Kagonye’s farm jailed",
            "url": "https://www.newzimbabwe.com/seven-of-15-land-barons-who-invaded-former-minister-kagonyes-farm-jailed/",
            "content": "By Staff Reporter\n\nSeven land barons who landed in the dock on allegations of invading former cabinet minister, Petronella Kagonyes farm have been jailed six months each.\n\nThe seven are Bamusi Magaisa, Philip Kambuto, Joel Madziva, Isaac Wikiseni, Togarepi Mudzudza, Shelly Chapwanya and Tatenda Ndlovu.\n\nThey were convicted after a full trial and will serve five months effective after part of their sentence was suspended conditionally.\n\nKagonye nailed the group while giving her victim impact statement telling Harare magistrate Ruth Moyo that the accused caused her a lot of stress to the extent that she lost a lot of weight.\n\nOur infrastructure was vandalised so we need to start again, we have to fork out some money again to demolish all the illegal structures they built.\n\nOur companys reputation was tainted, and now we are not getting any tenders to develop stands. We have lost a lot of money paying lawyers and my reputation as a Ruwa resident was also ruined by this case, Kagonye told the court.\n\nSome of the suspects arrested together with the seven are being tried in different courts.\n\nKagonye sued the group for invading her Cloverdale Farm in Ruwa has commenced before Harare magistrate Ruth Moyo.\n\nAccording to Kagonye, the land was lawfully allocated to Glorious Properties through an offer letter issued by the Ministry of Local Government.\n\nKagonye said the ministryalso provided an approved layout, a development permit, and confirmation from the Surveyor General.\n\nThe prosecution proved that the accused illegally invaded the land sometime in May 2024.\n\nSometime between May 8, 2024, and now, the accused pegged and allocated stands to desperate land seekers without any authority.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/25055851/HON-KAGONYE-PETRONELLA.jpg",
            "description": "<p>By Staff Reporter Seven land barons who landed in the dock on allegations of invading former cabinet minister, Petronella Kagonye’s farm have been jailed six months each. The seven are Bamusi Magaisa, Philip Kambuto, Joel Madziva, Isaac Wikiseni, Togarepi Mudzudza, Shelly Chapwanya and Tatenda Ndlovu. They were convicted after a full trial and will serve</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seven-of-15-land-barons-who-invaded-former-minister-kagonyes-farm-jailed/\">Seven of 15 land barons who invaded former Minister Kagonye’s farm jailed </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mafume promises ZIFA 40 hectares of land to build stadium",
            "url": "https://www.newzimbabwe.com/mafume-promises-zifa-40-hectares-of-land-to-build-stadium/",
            "content": "By Sport Reporter\n\nHarare Mayor Jacob Mafume on Monday said the city council will avail 40 hectares of land to the Zimbabwe Football Association (ZIFA) for the development of Highglen Stadium.\n\nZIFA president Nqobile Magwizi had paid a courtesy call to the mayor to discuss issues around football infrastructure.\n\nThe City of Harare is being criticised for failing to maintain Rufaro Stadium which is one of the two homologated venues in the capital, the other one being Magayas Heart Stadium in Waterfalls.\n\nCouncil has failed to maintain sports facilities like the City Sports Centre, Gwanzura Stadium, Zimbabwe grounds and Dzivarasekwa Stadium which are in a deplorable state.\n\nSpeaking after the meeting meeting on Monday Harare Mayor Jacob Mafume said the city council will alsocollaborate on developing Rufaro stadium so it meets FIFA standards.\n\nWe are keen to avail to ZIFA one of our sports grounds which we wanted to develop, a 40-hectare HighGlen stadium.\n\nThe stadium is in our master plan and we are willing to avail it, also we want to work with the ZIFA on Rufaro stadium so that it meets required FIFA standards, said Mafume.\n\nThe council will also lease one of its sports clubs for ZIFAs proposed headquarters.\n\nMagwizi said working with the City of Harare is a key step in developing the game.\n\nWe are grateful we have an opportunity that you have presented to us.\n\nOur idea is to be a well-governed institution and we are more than ready to embrace these facilities you want to avail to us, said Magwizi.\n\nUpon the reopening of Rufaro stadium last year, Mafume promised that by year-end the facility would be meeting CAF-required standards to host international games.\n\nHe again vowed to start renovations at Gwanzura stadium in Highfields but it remains a white elephant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18030751/mafume-magwizi.jpg",
            "description": "<p>By Sport Reporter Harare Mayor Jacob Mafume on Monday said the city council will avail 40 hectares of land to the Zimbabwe Football Association (ZIFA) for the development of Highglen Stadium. ZIFA president Nqobile Magwizi had paid a courtesy call to the mayor to discuss issues around football infrastructure. The City of Harare is being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mafume-promises-zifa-40-hectares-of-land-to-build-stadium/\">Mafume promises ZIFA 40 hectares of land to build stadium</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Mthuli Ncube pins hope on AfCFTA in the face of global protectionism",
            "url": "https://www.newzimbabwe.com/mthuli-ncube-pins-hope-on-afcfta-in-the-face-of-global-protectionism/",
            "content": "By Alois Vinga\n\nFINANCE and Economic Development Minister, Mthuli Ncube believes the Africa Continental Free Trade Area (AfCFTA) is the only buffer for economies to shield their gains in the face of rising global uncertainty and protectionism.\n\nAFCFTA,the worlds largest free trade area, aims to boost intra-African trade, stimulate economic growth, and promote regional integration by eliminating tariffs and non-tariff barriers among participating African countries.\n\nAddressing delegates at the 57th Session of the Conference of African Ministers of Finance, Planning, and Economic Development, Ncube said over the past year, the global economic landscape has shifted significantly, characterized by rising geopolitical tensions and increased trade protectionism, which have heightened the importance of regional trade blocs.\n\nHe said the tariff escalations and evolving trade restrictions threaten to further marginalize African economies, making it essential for Africa to accelerate its regional integration agenda.\n\nAfCFTA serves as our most powerful blueprint for addressing these global challenges. With a market of 1.4 billion people and a combined GDP exceeding $3.4 trillion, the AfCFTA offers a critical pathway for Africa to build resilience, reduce dependence on external markets, and drive sustainable industrialization.\n\nYet, despite its potential to boost intra-African trade by 45% by 2045, implementation remains uneven due to structural barriers, inadequate infrastructure, and limited access to trade finance, Ncube said.\n\nNcube implored the conference to seize the opportunity to adopt bold, transformative actions to accelerate the implementation of the AfCFTA and establish Africa as a key player in the reconfiguration of global trade.\n\nHe said enhancing regional value chains and trade infrastructure is critical while strengthening production and supply chains in key sectorsincluding agriculture, manufacturing, and serviceswill maximize value addition and reduce Africas reliance on raw commodity exports.\n\nWe must act decisively to deepen our regional integrationnot just defensively, but as a proactive strategy to harness Africas economic potential. The success of the AfCFTA relies on strong political will, coordinated implementation, and the complete mobilization of financial and technical resources, added Ncube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga FINANCE and Economic Development Minister, Mthuli Ncube believes the Africa Continental Free Trade Area (AfCFTA) is the only buffer for economies to shield their gains in the face of rising global uncertainty and protectionism. AFCFTA, the world’s largest free trade area, aims to boost intra-African trade, stimulate economic growth, and promote regional integration</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mthuli-ncube-pins-hope-on-afcfta-in-the-face-of-global-protectionism/\">Mthuli Ncube pins hope on AfCFTA in the face of global protectionism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Zimbabwean domestic worker flees after burning elderly woman’s mouth with household detergent",
            "url": "https://www.newzimbabwe.com/zimbabwean-domestic-worker-flees-after-burning-elderly-womans-mouth-with-household-detergent/",
            "content": "IOL\n\nSouth Africa  A 75-year-old Glenwood woman was assaulted and burnt with a household detergent by her domestic worker of eight and a half years, following a confrontation over missing items from her safe.\n\nThis incident has sparked concerns about elderly safety and employment verification practices.\n\nBrad Nathanson, owner of Brad Nathanson Investigations saidhe believed the 45-year-old domestic worker had since fled to her home in Zimbabwe.\n\nIt had beenalleged that the elderly woman confronted her domestic worker when she found two items missing from her safe.\n\nNathanson said that the domestic worker had attacked the elderly woman when her guard was down.\n\nHe said the woman had advised her domestic worker to go home and consider returning the stolen items.\n\nShe arrived a few days later and tricked the elderly woman into opening the safe by suggesting they look for the missing items.\n\nAs the woman turned her back on the domestic worker, she was grabbed from behind. She was bound and gagged and dragged through to the kitchen where another cloth was stuffed into her mouth. The cloth contained one or another detergent which burned her mouth and throat, said Nathanson.\n\nHe said the woman was in hospital receiving treatment.\n\nNathanson said that these crimes were becoming common, especially with domestic workers who become like family.\n\nShe was with my client for many years. She even took care of her sick daughter, who passed away a few months ago. They knew each other well and she clearly trusted her domestic worker, said Nathanson.\n\nHe said that he had seen many cases of the elderly being attacked by their domestic workers.\n\nIts common in the Indian community for domestic workers to attack their employers. They know Indians have expensive jewellery like gold, so they target them.\n\nThey go as far as to demand 18ct jewellery when they are robbing them because they know the older Indian ladies always have expensive gold. The elderly can get very hurt just because their domestic workers want their valuables, said Nathanson.\n\nHe said that at times, domestic workers could be treated badly by their employers.\n\nThe employers think that the domestic workers are silly and dont notice their valuables. So they then bide their time. They leave them alone at home for hours and in that time they search for things to steal.It doesnt matter how someone speaks to you, you cannot rob them, said Nathanson.\n\nHe said the elderly need to be cautious of who they hire.\n\nNot everyone you employ as a domestic worker would have good intentions. You need to be careful because once they are over the border with your valuables, the chances are you will never be able to recover them.\n\nMany times you see that employers dont have details about their domestic workers. They just take them off the street and pay them for a days work. That is dangerous, said Nathanson.\n\niFacts, a provider of employee screening services, warned that doing background checks on employees were vital.\n\nRecently, we have read of people being attacked and murdered by their domestic workers and others who have stolen considerable money and items of great value.\n\nDomestic staff can be perceived as members of the family. This level of trust can cause families to underestimate the possibility that a disgruntled or untrustworthy employee might become a risk to the family by sharing information with syndicates, simply stealing to improve their lifestyle, or, sadly, going as far as to harm the family.\n\nThus, the hiring decision regarding the domestic service provider demands great care and caution, and often, people are guided by emotions and skip the essential background checks, saidiFactson their website.\n\nThey said some families took the word of agencies that the domestic worker had been checked.\n\nWhen a person is appointed to work in your home, it is strongly recommended that you ask for a copy of the background check.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/17154041/A-woman-s-mouth-was-burned-after-her-domestic-worker-gagged-her-with-a-cloth-soaked-in-household-detergent.webp",
            "description": "<p>IOL South Africa – A 75-year-old Glenwood woman was assaulted and burnt with a household detergent by her domestic worker of eight and a half years, following a confrontation over missing items from her safe. This incident has sparked concerns about elderly safety and employment verification practices. Brad Nathanson, owner of Brad Nathanson Investigations said he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-domestic-worker-flees-after-burning-elderly-womans-mouth-with-household-detergent/\">Zimbabwean domestic worker flees after burning elderly woman’s mouth with household detergent</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        },
        {
            "title": "Drama as unidentified youths disrupt war veterans press conference",
            "url": "https://www.newzimbabwe.com/drama-as-unidentified-youths-disrupt-war-veterans-press-conference/",
            "content": "By Staff Reporter\n\nThe Zimbabwe National Liberation War Veterans Association (ZNLWVA) press conference in Bulawayo was disrupted by a group of unidentified men who claimed they had booked the same venue for their business.\n\nThe group, which refused to identify themselves, claimed to be from Youth Connect.\n\nWe are not here to provoke anyone, but we are here for our own meeting. We have our own business to attend to, just like you, said the man leading the group.\n\nZNLWVA chairman Ethan Mathibela stated that they had notified the police about the press conference and received approval.\n\nWe have clearance from the police headquarters. I personally delivered the letter, which was accepted by the Commissioner General. Now, I am seeing these guys here, Mathibela said.\n\nAfter the press conference was disrupted, the war veterans moved outside, where Mathibela continued addressing the media under police supervision.\n\nDuring this time, one of the individuals who had disrupted the press conference grabbed Mathibelas ZNLWA branded cap. The man was taken away by police.\n\nMeanwhile, ZNLWVA has notified the police that it will hold a protest this Thursday to draw attention to the economic crisis, demand government accountability, and push for economic freedom, as well as an end to corruption, tribalism, nepotism, and poor governance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/17114027/Ethan-Mathibela-1-1-scaled.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe National Liberation War Veterans Association (ZNLWVA) press conference in Bulawayo was disrupted by a group of unidentified men who claimed they had booked the same venue for their business. The group, which refused to identify themselves, claimed to be from Youth Connect. “We are not here to provoke anyone, but</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drama-as-unidentified-youths-disrupt-war-veterans-press-conference/\">Drama as unidentified youths disrupt war veterans press conference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "18 Mar 2025"
        }
    ]
}