{
    "news": [
        {
            "title": "‘Historic victory for reproductive justice’ – health group hails High Court ruling recognising mental health in abortion law",
            "url": "https://www.newzimbabwe.com/historic-victory-for-reproductive-justice-health-group-hails-high-court-ruling-recognising-mental-health-in-abortion-law/",
            "content": "By Mary Taruvinga\n\nThe High Court has delivered a landmark ruling declaring parts of Zimbabwes restrictive abortion law unconstitutional, siding with the Community Working Group on Health (CWGH) and Member of Parliament Nyasha Batitsa, who brought the challenge with human-rights lawyer Tendai Biti.\n\nJustice Sylvia Chirawu-Mugomba ruled that the Termination of Pregnancy Act, enacted in 1977, unlawfully excludes mental-health risk as a ground for lawful termination and fails to protect women with mental disabilities from pregnancies resulting from sexual exploitation.\n\nThe statutory omission creates a discriminatory regime, the judge wrote, adding that forcing women to carry pregnancies that cause grave mental-health consequences violates their rights to dignity, equality, humane treatment, bodily autonomy, and health. She stressed that the Constitution recognises health as physical, mental, and psychological well-being.\n\nCourt sides with CWGH and Batitsa\n\nCWGH and Batitsa had challenged section 4(a) and the definition of unlawful intercourse in section 2(1), arguing the law ignored modern constitutional and medical understanding of health and erased the vulnerability of institutionalised mental-health patients who cannot legally consent to sex.\n\nIn their filing, they argued: Section 4(a) unlawfully confines lawful termination to threats to physical health, ignoring that health includes mental and psychological well-being. They also warned that excluding pregnancies arising from sexual exploitation of mental-health patients fails to safeguard the dignity and bodily integrity of a particularly vulnerable group.\n\nJustice Chirawu-Mugomba agreed, finding that the law erased their lack of capacity to consent and, as a consequence, denied them access to lawful termination even in circumstances amounting to abuse.\n\nThe Court declared the offending provisions unconstitutional, but suspended the declaration for 18 months and referred the matter to the Constitutional Court for confirmation.\n\nA shift in Zimbabwes reproductive-rights landscape\n\nThe ruling marks what the Court described as a move away from a narrow, biomedical model of abortion focused only on physical survival, toward a constitutional model grounded in dignity, equality, and holistic health.\n\nThe Courts effects-based analysis, drawing on comparative jurisprudence from South Africa and Canada, recognised mental health as an integral component of the constitutional right to health, and held that statutory frameworks must evolve with contemporary medical understanding.\n\nCWGH welcomes historic victory\n\nThe Community Working Group on Health welcomed the judgment, calling it a breakthrough for women whose suffering has long been invisible under the law.\n\nThis is a historic victory for reproductive justice, CWGH said in response to the ruling. The Court has affirmed that mental-health endangerment must be recognised alongside physical risk, and that women with mental disabilities are entitled to equal protection from sexual exploitation and its consequences.\n\nThe organisation said the decision creates a clear mandate for Parliament, health authorities, and civil society to ensure abortion services are accessible and responsive to the realities of women living with mental disabilities.\n\nNext steps for Parliament\n\nOnce the Constitutional Court confirms the ruling, Parliament will be required to amend the Termination of Pregnancy Act to include mental-health risk as a lawful ground for termination and expand the definition of unlawful intercourse to include sexual exploitation of mental-health patients, conduct already criminalised under the Mental Health Act.\n\nWith the judgment now on record, legal observers say Zimbabwe has taken a decisive step toward modernising reproductive-health law in line with constitutional values and regional obligations under the Maputo Protocol, CEDAW, and the African Charter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/22115253/abortion-law-.jpg",
            "description": "<p>By Mary Taruvinga The High Court has delivered a landmark ruling declaring parts of Zimbabwe’s restrictive abortion law unconstitutional, siding with the Community Working Group on Health (CWGH) and Member of Parliament Nyasha Batitsa, who brought the challenge with human-rights lawyer Tendai Biti. Justice Sylvia Chirawu-Mugomba ruled that the Termination of Pregnancy Act, enacted in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/historic-victory-for-reproductive-justice-health-group-hails-high-court-ruling-recognising-mental-health-in-abortion-law/\">‘Historic victory for reproductive justice’ – health group hails High Court ruling recognising mental health in abortion law</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "21 Nov 2025"
        },
        {
            "title": "Civil service is collapsing – Senate calls for immediate increase in workers’ salaries",
            "url": "https://www.newzimbabwe.com/civil-service-is-collapsing-senate-calls-for-immediate-increase-in-workers-salaries/",
            "content": "By Darlington Gatsi\n\nThe Senate is piling pressure on the government to urgently review civil servants salaries and align them with regional standards, arguing that this is critical to rescuing the collapsing public sector.\n\nFor years, unions representing government workers have been calling for salaries to be restored to 2018 levels, when the lowest-paid employees earned the equivalent of about US$400. Economic shocks and inconsistent policies have eroded earnings, prompting a mass exodus of skilled professionals seeking better opportunities abroad.\n\nSenator Sithabisiwe Moyo recently tabled a motion in the Upper House demanding an immediate and comprehensive solution to address the worsening plight of government workers.\n\nThe situation on the ground is not fair. Our civil servants are suffering. Our teachers, nurses, clerks and other civil servants are living in poverty while struggling to do their jobs. For example, the average Zimbabwean teacher earns about 350 per month, which is not enough to pay rent or buy food, said Moyo.\n\nShe further urged the government to consider a 50% salary increase and to prioritise restoring wages to the 2018 standard.\n\nThe civil service is collapsing, Hon. President, we must give civil servants a salary increment now, approve an emergency salary increase so that the teachers, nurses and other civil servants earn enough to survive. A 50% increase would do, we must restore their salaries to that of the US dollar era value of 2019 and this should be a top priority, said Moyo.\n\nThe deteriorating working environment in public institutions has fuelled widespread disgruntlement among civil servants, undermining service deliveryparticularly for low-income communities that rely heavily on government services.\n\nMoyo cautioned against politicising the crisis.\n\nThe whole country is watching our civil servants; we are not asking for charity or politics, only the dignity of a living salary and support in order for them to do their work.\n\nTeachers want to teach, nurses want to do their work, all other civil servants want to deliver their duties efficiently, but how can they if they are hungry? We must not allow our Public Service to collapse. Children are travelling long distances to school because of a shortage of schools nearby. We owe the future generation because their future depends on us, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/28170228/zimbabwe-civil-servants-strike.webp",
            "description": "<p>By Darlington Gatsi The Senate is piling pressure on the government to urgently review civil servants’ salaries and align them with regional standards, arguing that this is critical to rescuing the collapsing public sector. For years, unions representing government workers have been calling for salaries to be restored to 2018 levels, when the lowest-paid employees</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/civil-service-is-collapsing-senate-calls-for-immediate-increase-in-workers-salaries/\">Civil service is collapsing – Senate calls for immediate increase in workers’ salaries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "21 Nov 2025"
        },
        {
            "title": "Just In: Trucks pile up on Harare-Masvingo highway, block flow of traffic",
            "url": "https://www.newzimbabwe.com/just-in-trucks-pile-up-on-harare-masvingo-highway-block-flow-of-traffic/",
            "content": "By Leopold Munhende\n\nTHREE trucks have piled up on the Harare to Masvingo highway, 12km towards Featherstone, towards Chivhu.\n\nNo official statement has been shared yet about the accident which occurred right on the bridge that crosses Ngezi River, a few metres from Chiwashira School turnoff.\n\nDrivers are being instructed to use an old road just nearby as the highway is completely blocked.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20131649/IMG-20251120-WA0044.jpg",
            "description": "<p>By Leopold Munhende THREE trucks have piled up on the Harare to Masvingo highway, 12km towards Featherstone, towards Chivhu. No official statement has been shared yet about the accident which occurred right on the bridge that crosses Ngezi River, a few metres from Chiwashira School turnoff. Drivers are being instructed to use an old road</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-trucks-pile-up-on-harare-masvingo-highway-block-flow-of-traffic/\">Just In: Trucks pile up on Harare-Masvingo highway, block flow of traffic</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "21 Nov 2025"
        }
    ]
}