{
    "news": [
        {
            "title": "ZIFA’s hunt for new Warriors coach begins",
            "url": "https://www.newzimbabwe.com/zifas-hunt-for-new-warriors-coach-begins/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has begun its hunt for a new Warriors coach, following the sacking of German tactician Michael Nees last week.\n\nCalls for applications for the vacant post were advertised by ZIFA on Monday, with a CAF Pro license being the minimum requirement.\n\nSources at ZIFA told New Zimbabwe.com that the association is not planning to settle for a local coach, but prefer one Europe.\n\nWith less than two months before the 2025 AFCON finals start, ZIFA is expected to complete the recruitment process next week to give the incoming coach time to prepare for the continental tournament.\n\nIn the last seven years, the association has hired seven coaches, among them five locals and two foreigners.\n\nNees was fired for posting poor results, as he only managed two wins in the 14 games he was in charge.\n\nHe however, helped Zimbabwe qualify for the upcoming AFCON finals, which was a part of his goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has begun its hunt for a new Warriors coach, following the sacking of German tactician Michael Nees last week. Calls for applications for the vacant post were advertised by ZIFA on Monday, with a CAF Pro license being the minimum requirement. Sources at ZIFA told New Zimbabwe.com</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifas-hunt-for-new-warriors-coach-begins/\">ZIFA’s hunt for new Warriors coach begins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        },
        {
            "title": "Cameroon’s 92-year-old President Paul Biya re-elected to eighth term, opposition reports gunfire",
            "url": "https://www.newzimbabwe.com/cameroons-92-year-old-president-paul-biya-re-elected-to-eighth-term-opposition-reports-gunfire/",
            "content": "Cameroons PresidentPaul Biyawas re-elected to an eighth term with 53.66% of the vote, official results showed on Monday, raising the prospect of confrontations with supporters of the main opposition candidate who has claimed victory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/23000209/Paul-Biya.jpg",
            "description": "<p>Reuters Cameroon’s President Paul Biya was re-elected to an eighth term with 53.66% of the vote, official results showed on Monday, raising the prospect of confrontations with supporters of the main opposition candidate who has claimed victory. After the results were announced by the Constitutional Council, opposition challenger Issa Tchiroma Bakary wrote on Facebook that gunfire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cameroons-92-year-old-president-paul-biya-re-elected-to-eighth-term-opposition-reports-gunfire/\">Cameroon’s 92-year-old President Paul Biya re-elected to eighth term, opposition reports gunfire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        },
        {
            "title": "From Zimbabwe to Bay of Plenty: Family builds future on truffle farm",
            "url": "https://www.newzimbabwe.com/from-zimbabwe-to-bay-of-plenty-family-builds-future-on-truffle-farm/",
            "content": "NZ Herald\n\nZimbabwean couple Nikki and Lance Dodd met at university in Cape Town, South Africa, where she was studying interior design and he was studying horticulture. Their future plans were abruptly halted by the start of political unrest in Zimbabwe, leading to a long journey searching for a place to call home.\n\nWe are both from farming backgrounds and after university we intended to return to my parents farm in Zimbabwe and diversify from tobacco into berries and stone fruit, says Lance.\n\nThen we got the call in early 2000 saying dont come home, get a job. Both family farms had been requisitioned by the Zimbabwean Government and with no farms to go back to, everything was lost for both families.\n\nBy the early 2000s, Nikkis mum, dad, sister and two brothers had emigrated to New Zealand. Lances family went overseas but his father remains in Zimbabwe.\n\nA few fresh starts\n\nI followed Lance, and we went to the UK on an ancestral visa as we both had UK grandparents, says Nikki. It gave us the space to earn over there and work out what to do next.\n\nThis path led them back to Africa in 2003. Lance worked for a British company on a Kenyan flower farm that exported to Europe.\n\nThe couple had two children Hayley (now 17) and Matthew (now 14) and enjoyed living on a 20,000ha game farm with 200-300ha set aside for the flowers. They describe it as beautiful and remained there for 10 years until political unrest between Kenya, Somalia and Sudan made life dangerous once more and the family left the country.\n\nWe had visited my family in New Zealand several times over the years, so it made sense to come here. They lived a safe and peaceful life with their families, says Nikki.\n\nNikki in the truffire training Indie the springer spaniel pup to hunt for truffles. Photo / Supplied\n\nThe Dodds moved to the Bay of Plenty in 2012, with Lance finding work in the kiwifruit packhouses and later working in a management role.\n\nIts hard starting again from scratch, but we knew we had finally found somewhere safe and around family and where we could finally put down roots, says Lance.\n\nA place of their own\n\nThe couple began looking at lifestyle properties where they could live, work and give their children a rural life similar to the one they experienced when young.\n\nWhen Lance first saw a truffle farm near Te Puke for sale it was out of budget, but he noticed it again 10 months later and the price was now within reach.\n\nLance looked at it with a friend and before he even had time to tell us, hed put an offer on and approached the bank for finance! says Nikki.\n\nThe property was an 8ha block where previous owners Maureen and Colin Binns had established a truffle farm and ran truffle tasting tours to teach people about an almost mystical fungus, the black Prigord truffle.\n\nLance saw the possibilities and luckily so did his family when they visited for the first time. They moved in December 2024.\n\nAs well as the truffiere, we have an idyllic 3.5ha of QEII covenanted New Zealand bush and a crystal-clear waterway, which Maureen and Colin looked after so well. We are certainly happy to take over their legacy and have plans to resurrect the 8km of walkways through the forest and share the beauty with others, says Lance.\n\nHaving never seen a truffle before buying the property, its been a steep learning curve for Nikki and Lance. Despite being four hours drive away, Maureen and Colin have returned several times to pass on their wisdom and knowledge, something the Dodds are hugely grateful for.\n\nThis included using truffles for culinary delights and how to train a dog to hunt for truffles.\n\nSix-month-old springer spaniel Indie is doing well and Nikki says that she already goes into the truffiere and finds truffles.\n\nShe still rushes a bit but Im finding it amazing to be forming a strong bond with a dog and learning to read her, says Nikki.\n\nHayley Dodd with pet piglet Piggywig. Photo / Supplied\n\nHayley has a pet pig and Lance is interested in seeing if he can train it to truffle hunt as pigs are traditionally used for that role in Europe.\n\nOther animals include three cows, 12 sheep for mowing, 18 chickens and beehives from a local beekeeper.\n\nBy July 2025, Lance had committed to working fulltime on their property. Alongside the summer and winter truffle seasons and the summer truffle tours, the couple intend to grow exotic mushrooms such as oyster, shiitake and enoki to provide a consistent, year-round income.\n\nAfter being caught up in turbulent times overseas, the family has finally found peace and a home to call their own.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064937/DOD-FAMILY.jpg",
            "description": "<p>NZ Herald Zimbabwean couple Nikki and Lance Dodd met at university in Cape Town, South Africa, where she was studying interior design and he was studying horticulture. Their future plans were abruptly halted by the start of political unrest in Zimbabwe, leading to a long journey searching for a place to call home. “We are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-zimbabwe-to-bay-of-plenty-family-builds-future-on-truffle-farm/\">From Zimbabwe to Bay of Plenty: Family builds future on truffle farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        },
        {
            "title": "Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’",
            "url": "https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/",
            "content": "By Mary Taruvinga\n\nComedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 for making the President laugh.\n\nThis comes a few daysafter President Emmerson Mnangagwa personally handed hima brand-new Ford Raptor.\n\nIn a lengthy social media post, Chivayo said the cash gift was a small token of appreciation for the comedians talent and humour.\n\nFor a young comedian to make the President of the Republic laugh is never a small achievement!His Excellencys words  Ndafara newe mfana  set you apart. Ukafadza President, neniwo unenge wandifadza and wafadza nyika yese!\n\nThe controversial tenderpreneur, known for showering public figures with luxury cars and cash gifts, told Comic Elder to collect US$150,000 from his lawyer Sikhumbuzo Mpofu andbuy a decent house.\n\nFor safety, the money can be transferred directly to your preferred bank account, Chivayo added. Or my lawyer can facilitate the purchase of your desired house and transfer it into your name. The choice is entirely yours.\n\nComic Elderscharacters,including Anna Mugwaku, Obvious Mututu, Alfred Mweya, Nichodimas Chigovanyika, and Potipher Zvombo, have become household favourites.\n\nChivayos lavish spending on public figures landed him in a corruption dossier reportedly authored by Vice President Constantino Chiwenga, calling for investigations into possible siphoning of state funds through dubiously awarded tenders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064152/comic-elder.jpg",
            "description": "<p>By Mary Taruvinga Comedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 “for making the President laugh.” This comes a few days after President Emmerson Mnangagwa personally handed him a brand-new Ford Raptor. In a lengthy social</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/\">Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        },
        {
            "title": "South Africa boosts deportations amid jobs crisis, minister says",
            "url": "https://www.newzimbabwe.com/south-africa-boosts-deportations-amid-jobs-crisis-minister-says/",
            "content": "Bloomberg\n\nSouth Africa is pushing to deport more undocumented migrants who compete with citizens for jobs in an economy with one of the highest unemployment rates globally, the minister overseeing the program said.\n\nThe nation is a neglected part of the global migration story, with the contestation between foreigners and locals for positions becoming a real tinderbox, Home Affairs Minister Leon Schreiber said in an interview on Bloomberg Television Friday. Weve deported 51,000 people in the last year  thats more than France and Germany combined. If we had more resources, wed be doing more of that.\n\nSouth Africa has the continents most industrialised economy and sees a constant influx of job seekers from neighbouring countries, including Zimbabwe and Mozambique. But with the unemployment rate running at 33.2%, tensions between locals and foreigners run high. About 8.4 million people are eligible to work yet dont have jobs.\n\nIn 2008, about 60 people died and 50 000 were displaced in a wave of xenophobic violence, with foreigners blamed for everything from unemployment to poor government services.\n\nThere were similar riots in 2015 and again in 2019, when President Cyril Ramaphosa was forced to apologize to other African nations who were appalled by the treatment of their citizens. Local media recently reported on incidents of foreigners being chased away from health clinics by angry residents.\n\nSouth Africa is managing the situation responsibly, said Schreiber, who is a member of the Democratic Alliance, the second-biggest member of the countrys 10-party governing coalition.\n\nWere anchoring what we do in the rule of law to make sure that we also protect social cohesion, even as we enhance our enforcement operations, he said.\n\nA so-called government of national unity was formed in June last year, when the ruling African National Congress failed to secure a parliamentary majority in a national vote for the first time since apartheid ended in 1994. The ANC and DA have since clashed repeatedly over policy and appointments, raising doubts over whether the alliance will remain intact.\n\nWere in a better space now than we were initially, Schreiber said, adding that disputes are quite normal in any society with a coalition government.\n\nThe coalition succeeded in navigating a budget impasse and with a new fiscal cycle about to begin, Schreiber said hes hopeful any differences can be resolved in a less public and destructive way.\n\nIf we can succeed in that, I think that builds another layer of confidence that we actually are working pretty well together, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23051938/leon-schreiber.jpg",
            "description": "<p>Bloomberg South Africa is pushing to deport more undocumented migrants who compete with citizens for jobs in an economy with one of the highest unemployment rates globally, the minister overseeing the program said. The nation “is a neglected part of the global migration story,” with the contestation between foreigners and locals for positions becoming “a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-boosts-deportations-amid-jobs-crisis-minister-says/\">South Africa boosts deportations amid jobs crisis, minister says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        },
        {
            "title": "Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final",
            "url": "https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/",
            "content": "By Sports Reporter\n\nHARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals.\n\nDembares ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time.\n\nSundays win gave Dynamos a chance to defend the Chibuku Super Cup, which they won in 2023 and 2024.\n\nDynamos took a first-half lead, thanks to Emmanuel Jalais 15th-minute strike.\n\nHowever, Bosso came back in the second half with determination and focus, which saw them score an equaliser in the 68th minute through Melikhaya Ncube.\n\nAfter playing a one-all draw in regulation time, the match headed straight for penalty shootouts, where they scored all their spot kicks, taking advantage of Bosso, who missed their fourth kick through Prince Ndlovu.\n\nDynamos coach Kelvin Kaindu could not hide his happiness as he praised his charges performance.\n\nIm happy; if you look, there is an improvement in how we are keeping possession as a team.\n\nOur performance was good; even in penalty shootouts, we proved to be the best, and I have to praise the boys, said Kaindu.\n\nDynamos will now play Triangle FC in the final, which is scheduled for next month on a date to be announced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter HARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals. Dembare’s ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time. Sunday’s win gave Dynamos a chance to defend</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/\">Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        },
        {
            "title": "Zimbabwe calls for unconditional removal of Western sanctions",
            "url": "https://www.newzimbabwe.com/zimbabwe-calls-for-unconditional-removal-of-western-sanctions/",
            "content": "Xinhua\n\nZimbabweans on Saturday marked Anti-Sanctions Day in Harare, the countrys capital, calling for the unconditional removal of Western sanctions imposed on the country over two decades ago.\n\nThe SADC Anti-Sanctions Day, commemorated on Oct. 25, was established by the Southern African Development Community (SADC), a 16-member regional organization, in 2019 as a collective regional initiative to denounce the sanctions, which were imposed on Zimbabwe following the countrys land reform program that redistributed land from minority white farmers to indigenous black Zimbabweans.\n\nIn his keynote address at the event, Zimbabwean President Emmerson Mnangagwa called for the complete and unconditional removal of the sanctions, saying that the country remains resolute in developing in the face of the illegal sanctions.\n\nThrough sanctions, some Western countries sought to punish us for asserting our sovereignty and pursuing equal economic development for the benefit and prosperity of the people of our beloved motherland, Zimbabwe, Mnangagwa said at the event, which was widely attended by government officials, members of the diplomatic community, business leaders, and Zimbabweans from all walks of life.\n\nMnangagwa said that despite the negative effects and other challenges and shocks such as climate change-induced droughts and public health emergencies, the national economy has been on a positive growth trajectory.\n\nOver the years, we have made tremendous progress in our efforts to promote a self-sufficient and food-secure nation. Comprehensive people-centered programs and projects have been put in place to enhance our agricultural productivity. Climate-proofing our agriculture has seen the country attain food self-sufficiency, he said.\n\nMnangagwa said that in navigating the path toward sustainable economic development, Zimbabwe requires access to flexible and reliable lines of credit, which are hindered by sanctions.\n\nRegrettably, the illegal economic sanctions have fundamentally disrupted the ability of our country to access global lines of credit. To ensure the continuity of our developmental agenda, my administration has adopted home-grown, innovative development financing models to drive our country forward, said the president.\n\nDespite the challenges posed by the sanctions, the country remains committed to multilateralism and international cooperation toward the realization of global peace, security, justice and equitable development, he added.\n\nMartin Zharare, executive director of Citizens Against Economic Sanctions, an anti-sanctions lobby group, said sanctions should be removed unconditionally as they impede economic growth.\n\nThe people of Zimbabwe stand with the governments position and say we are not going to support any initiative to have sanctions removed with conditions. We are standing firm to say the sanctions must be removed unconditionally, Zharare said.\n\nThe United States imposed sanctions on Zimbabwe in 2001 through the Zimbabwe Democracy and Economic Recovery Act, which restricted multilateral financing to the country.\n\nIn March last year, former U.S. President Joe Biden signed an executive order terminating the Zimbabwe sanctions program that had been in force since 2003 but immediately imposed sanctions on 11 individuals, including Mnangagwa and Vice President Constantino Chiwenga, over alleged human rights abuses and corruption under the Global Magnitsky Human Rights Accountability Act.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/26054937/Sanctions-10.png",
            "description": "<p>Xinhua Zimbabweans on Saturday marked Anti-Sanctions Day in Harare, the country’s capital, calling for the unconditional removal of Western sanctions imposed on the country over two decades ago. The SADC Anti-Sanctions Day, commemorated on Oct. 25, was established by the Southern African Development Community (SADC), a 16-member regional organization, in 2019 as a collective regional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-calls-for-unconditional-removal-of-western-sanctions/\">Zimbabwe calls for unconditional removal of Western sanctions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 Oct 2025"
        }
    ]
}