{
    "news": [
        {
            "title": "Harare City Council “keen to interview” controversial socialite Malloti for breaking clamp in viral video",
            "url": "https://www.newzimbabwe.com/harare-city-council-keen-to-interview-controversial-socialite-malloti-for-breaking-clamp-in-viral-video/",
            "content": "By Staff Reporter\n\nThe City of Harare has said it is keen to interview controversial socialite Malloti following a viral video in which she broke a clamp affixed on her Nissan Note along Kwame Nkrumah Avenue in the Central Business District (CBD).\n\nIn the viral video, Malloti born Namatai Bhobho is seen moving her car back and forth in an attempt to dislodge the clamp, ultimately succeeding but causing damage to the cars front bumper.\n\nAs she was driving away, a man in civilian clothes is seen picking up the broken clamp and aiming it at Mallotis cars windscreen, breaking it.\n\nAfter the incident, Malloti took to her Instagram saying, These people clamped me at 4 PM, where should I have gone at that time to pay for the fine?\n\nI am loaded with badness in my real life, its better to get a screen for $70 than to give these people even a dollar. Its not about money, I just refused to be weighed down and wasting my time. First thing tomorrow morning is replacing the screen; as long as these people havent eaten my money, its a win for me.\n\nHowever, in a statement, the City of Harare said the man who damaged her windscreen is not an employee adding that they were keen to interview the owner of the car as breaking a clamp affixed on a car is an offence.\n\nWe have taken note of the video of a blue motor vehicle Registration number AGG7256 which had been clamped by our parking marshals in the Central Business District.\n\nThe vehicle is seen being driven back and forth and in the process breaking the clamp. The video further shows a man in civilian attire throwing a piece of the broken clamp on the windscreen of the speeding car. The City wishes to put the following on record:\n\nThe man who is seen throwing the metal object at the car is not a member or an employee of the City of Harare.\n\nThe breaking of a clamp affixed on a motor vehicle by an authorised officer is an offence.\n\nConsequently Harare Traffic Enforcement Unit is keen to interview the owner of the motor vehicle registration number AGG 7256 in connection with the breaking of a clamp, the notice reads.\n\nMembers of the public are encouraged to comply with the Harare (Clamping and Tow) bylaw 2005 which states that the release of clamped vehicles is upon payment of prescribed fines.\n\nMalloti made headlines earlier this year following revelations that she has been on the South African Police Services (SAPS) wanted list since 2017.\n\nAccording to SAPS records, a warrant of arrest for one Namatai Bhobhowho is facing charges of armed robberywas issued on January 19, 2018, at the Wynberg Magistrate Court in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26150458/malloti.jpg",
            "description": "<p>By Staff Reporter  The City of Harare has said it is keen to interview controversial socialite Malloti following a viral video in which she broke a clamp affixed on her Nissan Note along Kwame Nkrumah Avenue in the Central Business District (CBD). In the viral video, Malloti born Namatai Bhobho is seen moving her car</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-keen-to-interview-controversial-socialite-malloti-for-breaking-clamp-in-viral-video/\">Harare City Council “keen to interview” controversial socialite Malloti for breaking clamp in viral video</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Shumaira Mheuka makes EPL debut for Chelsea",
            "url": "https://www.newzimbabwe.com/shumaira-mheuka-makes-epl-debut-for-chelsea/",
            "content": "By Sport Reporter\n\nWarriors prospect Shumaira Mheuka finally made his English Premier Soccer League debut for Chelsea on Tuesday night, in the teams 4-0 win over Southampton.\n\nMheuka(17)came in for Enzo Fenandes in the 90th minute when his side was leading 4-0.\n\nThe forward managed a shot on target, only to be denied by Southampton goalkeeper Aaron Ramsdale.\n\nBorn to Zimbabwean parents, Mheuka is the son of former Zimbabwe Saints player Malcolm Mheuka who is now based in the United Kingdom.\n\nThe promising youngster joined Chelsea in July last year and is a regular in the junior sides.\n\nMheuka stands a chance to represent both Zimbabwe and England at international level as he holds citizenship for both countries.\n\nAlready Mheuka has managed 6 appearances for the England Under 19 side, scoring two goals in the process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26140745/FB_IMG_1740555066048.jpg",
            "description": "<p>By Sport Reporter Warriors prospect Shumaira Mheuka finally made his English Premier Soccer League debut for Chelsea on Tuesday night, in the team’s 4-0 win over Southampton. Mheuka (17) came in for Enzo Fenandes in the 90th minute when his side was leading 4-0. The forward managed a shot on target, only to be denied by Southampton</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shumaira-mheuka-makes-epl-debut-for-chelsea/\">Shumaira Mheuka makes EPL debut for Chelsea</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "OK Zimbabwe fires top management; ropes in former CEO Zireva in turnaround strategy",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-fires-top-management-ropes-in-former-ceo-zireva-in-turnaround-strategy/",
            "content": "By Alois Vinga\n\nLISTED retail giant, OK Zimbabwe has fired its top management with immediate effect in a development which has seen former CEO Willard Zireva bouncing back.\n\nThis comes shortly after the top retailers operations hit an all-time low, with most supermarket shelves running empty. The situation has since improved following a bailout extended to the supermarket chain by its key partners.\n\nOn the back of the recovery, OK Zimbabwe announced that it had sacked its top three managers.\n\nWith immediate effect, the company announces the following changes: the conclusion of voluntary separation agreements with the following Directors; CEO Maxen Phillip Karombo; Chief Financial Officer  Phillimon Mushosho; and Supply Chain Director Knox Mupaya, the company secretary Margaret Munyuru said in a statement.\n\nThe management board also moved to reappoint its retired old guard back into office who includes, CEO Willard Vimbai Zireva, CFO Alex Edgar Siyavora and Supply Chain Director, Muzvidzwa Richard Chingaira.\n\nThe board would like to acknowledge the outgoing Executive team for their service through this challenging period, and to welcome back the team reposed with the remit to stabilize and turn the business around over the next six months whilst the company engages in the process to identify the executive replacements, added Munyuru.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26141438/zireva.jpg",
            "description": "<p>By Alois Vinga LISTED retail giant, OK Zimbabwe has fired its top management with immediate effect in a development which has seen former CEO Willard Zireva bouncing back. This comes shortly after the top retailer’s operations hit an all-time low, with most supermarket shelves running empty. The situation has since improved following a bailout extended</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-fires-top-management-ropes-in-former-ceo-zireva-in-turnaround-strategy/\">OK Zimbabwe fires top management; ropes in former CEO Zireva in turnaround strategy  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "More woes for Zimbabwe, Africa as UK, Netherlands announce cuts on aid fund",
            "url": "https://www.newzimbabwe.com/more-woes-for-zimbabwe-africa-as-uk-netherlands-announce-cuts-on-aid-fund/",
            "content": "By Leopold Munhende\n\nPRESSURE to deliver is expected to mount on Zimbabwe and other African governments following decisions by the United Kingdom (UK) and Netherlands to significantly cut international aid, in moves that could impact health, education and development sectors.\n\nDescribed as a painful choice, funding to UKAID will now be cut to 0.3% of the countrys GDP from 0.5% so as to finance a yearly increase of 13.4 billion in military funding.\n\nThe decision, announced by UK Prime Minister Keir Starmer seeks to create enough funds for increased expenditure of the former colonial powers defence.\n\nMeant to ensure Britain is adequately funded to respond to Russian President Vladimir Putin, cutting of the aid budget comes barely a month after American President Donald Trump all but stopped USAID operations across the globe.\n\nThe absence of USAID and UKAID could halt operations in the health and education sectors.\n\nThat is not an announcement I am happy to make, Starmer said in Parliament.\n\nWe will do everything we can to return to a world where that is not the case, and rebuild a capability on development, but at times like this the defence and security of the British people must always come first.\n\nThat is the number one priority of this government.\n\nRussia is currently locked in a war with Ukraine following the latters decision to join Americas group of allies, NATO.\n\nPutin threw northern Europe into war in protest, arguing agreements entered into at the end of the cold war for NATO and the European Union (EU) not to expand eastwards were not being respected.\n\nAccording to the UK governments official website, UKAID was supposed to help over two million women and babies access essential maternal and neo-natal healthcare, whilst supporting the government of Zimbabwe to prepare for future epidemics and pandemics.\n\nDespite not being a member, Zimbabwe has benefitted over 31 million from the UKs Commonwealth Office (FCDO) between 2024 and 2025.\n\nOver a million women and children have accessed UKAID funded or maintained hospitals and clinics across the country, with more notable investments across Africas health sector.\n\nIt has also deposited cash to millions who are at risk of hunger.\n\nAcross the globe, over 9.8 million have been assisted, directly or through civil society organisations (CSOs) since funding to UKAID started in 2014.\n\nNetherlands, which has always been a key funder of various sectors within Zimbabwes waning economy, said Tuesday, whatever programme they fund should now benefit them directly.\n\nAll the programmes we fund must contribute directly to our own interests: promoting trade, enhancing security and reducing migration, said the Netherlands Minister for Foreign Trade and Development, Reinette Klever.\n\nFunds, initially earmarked for CSOs will, according to Klever, be redirected to North Africa and the Middle East where they will be used to strengthen security, prevent people from moving to Netherlands and seeking asylum there.\n\nZimbabwean, and most African health institutions are generally poorly funded. Their education sector also thrives on the benevolence of Western development partners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26101957/img_1_1740562310905.jpg",
            "description": "<p>By Leopold Munhende PRESSURE to deliver is expected to mount on Zimbabwe and other African governments following decisions by the United Kingdom (UK) and Netherlands to significantly cut international aid, in moves that could impact health, education and development sectors. Described as a ‘painful choice,’ funding to UKAID will now be cut to 0.3% of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-woes-for-zimbabwe-africa-as-uk-netherlands-announce-cuts-on-aid-fund/\">More woes for Zimbabwe, Africa as UK, Netherlands announce cuts on aid fund</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Blessed Mhlanga: Why his arrest is unlawful and State-facilitated abduction",
            "url": "https://www.newzimbabwe.com/blessed-mhlanga-why-his-arrest-is-unlawful-and-state-facilitated-abduction/",
            "content": "By Delaney Phiri I University of London\n\nThe recent move by Zimbabwe police to take Mr Blessed Mhlanga, a well-known journalist, into custody without following due process is and ought to be understood for what it is. That move, at the very least, can be said to be an unlawful arrest and, at the very worst, it is and should be understood as a State-facilitated abduction!\n\nBy definition, abduction is the act of taking someone away by force or deception; which is precisely the case here. The said Mr Mhlanga was taken by force, under the guise of bogus charges which do not hold even an ounce water (deception). In circumstances where a journalist conducts an interview with a person of interest, the journalist cannot be held responsible for the views of the interviewee.\n\nSecondly, and more interestingly, the said Mr Mhlanga is not an independent journalist; he is not the owner of the said media house. He is merely an agent of the company, who was acting in the course of his employment. As such, it does not follow that he can personally be liable for the alleged wrongful conduct on behalf of the media house he is employed by. The principle of vicarious liability immediately kicks in under these circumstances.\n\nBlessed Mhlanga at the Harare courts on Tuesday\n\nIn furtherance of the above, there are directors, persons who signed off on the production and broadcasting of the said interview and, against that back drop, a question has to be asked  are they also being prosecuted? If the answer to that question is not in the affirmative then, surely, the charges cannot be said to be genuine and or a bona fide investigation leading to a just outcome; they are simply bogus.\n\nAnother point or consideration; an arrest on the basis that the interviewee shared some opinions which may have been a breach of certain acts in the criminal codification brings to surface the fact that the rule of law isnt necessarily adhered to in the said jurisdiction. It is a well-known and established principle of law that everyone is entitled to the presumption of innocence. And, if we are to be true to this principle, it does not follow that a journalist can be arrested on suspicion that the interviewee shared opinions that may be argued to have been incitement of violence and or undermining the office of the President.\n\nThe States averement would be that the journalist amplified remarks by the interviewee and, in so doing, can be said to have aided and abetted the accused. However, before the interviewer is even considered for liability, there needs to be a determination on the question of whether or not the remarks made by his guest were in, and of themselves, criminal in nature.\n\nA decision has to be made by a competent court of law. In circumstances where that determination has NOT been made, any proceedings against the journalist are, at the very least, premature and lack any basis at law and hence the assertion that this is a State-facilitated abduction!\n\nThe fact that an abduction has been made by State agents using State resources and hiding behind the law does not, in fact, change what this is; it is still an abduction. It remains an abduction and should be addressed and understood as such. To call this an arrest sanitises and legitimises the said abduction. There is no basis at law for this so-called arrest. Journalism is not a crime, an unlawful arrest as a means to intimidate the journalist is accurately called an abduction.\n\nIn opposing bail, or in refusing to do the right thing, the State incompetently argued that Mr Mhlanga could not be released on bail on the basis that, inter alia, the equipment used has not been ceased. Therefore, the likelihood of him committing similar offences is high. What the State immured in its arguments is the fact that, the said equipment does not belong to the journalist but is the property of the company he works for.\n\nThis argument exposes the fact that, the aim of opposing bail is not a bona fide objection in the interest of justice but rather selective persecution of the journalist. Firstly, if the equipment is out there and the concern is he may have access to it, why not order the company to restrict him from access to the said equipment?\n\nSecondly, the argument that he may interfere with potential witnesses who are his junior colleagues further proves he acted in the course of his employment and the absence of any claims by his employer that he acted outside the ambit of his employment further solidifies the fact that he acted in the course of his employment and if there is any case to answer then the company is answerable.\n\nThis misplaced and overzealous persecution of a journalist is one example of malicious prosecution to instil fear into all journalists. Release Blessed Mhlanga! We condemn State-facilitated abductions!!\n\nSound of Justice!! Delaney Phiri lecturer at the University of London.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26061950/Blessed-Mhlanga.png",
            "description": "<p>By Delaney Phiri I University of London The recent move by Zimbabwe police to take Mr Blessed Mhlanga, a well-known journalist, into custody without following due process is and ought to be understood for what it is. That move, at the very least, can be said to be an unlawful arrest and, at the very</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blessed-mhlanga-why-his-arrest-is-unlawful-and-state-facilitated-abduction/\">Blessed Mhlanga: Why his arrest is unlawful and State-facilitated abduction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Mighty Warriors eye return leg victory against Angola",
            "url": "https://www.newzimbabwe.com/mighty-warriors-eye-return-leg-victory-against-angola/",
            "content": "By Sport Reporter\n\nZimbabwe senior womens football team is hoping for a positive outcome on Wednesday when they host Angola at Lucas Moripe stadium in South Africa in a Womens Africa Cup Of Nations (WAFCON) qualifier second-leg match.\n\nHaving suffered a 2-1 defeat in Luanda last week, Zimbabwe will be hoping to overcome their counterparts with a wider margin to keep their hopes of playing next years WAFCON alive.\n\nThe winner between Zimbabwe and Angola will play Malawi in the final qualifying round.\n\nMighty Warriors coach Sithethelelwe Sibanda says she is expecting a positive outcome.\n\nI am hopeful that with what we have done, we are going to be much better than what we were in the first leg.\n\nAlso I am just hoping that everyone shows the positivity we saw at training, she said.\n\nZimbabwe last beat Angola in 2019 during the Womens COSAFA Cup tournament, when they picked a 4-1 win.\n\nThe Mighty Warriors are expected to have a huge fan backing as two buses ferried supporters from Zimbabwe to South Africa.\n\nMighty Warriors captain Emmaculate Msipa added, We prepared very well for the second leg, and the coaches have done their part meaning it is now up to us.\n\nWe are going to play to the best of our abilities and try to utilise every chance, so we will see how it will go on the pitch.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/19060302/Sithethelewe-Kwinji-15-Sibanda-Pic-ZIFA.jpg",
            "description": "<p>By Sport Reporter Zimbabwe senior women’s football team is hoping for a positive outcome on Wednesday when they host Angola at Lucas Moripe stadium in South Africa in a Women’s Africa Cup Of Nations (WAFCON) qualifier second-leg match. Having suffered a 2-1 defeat in Luanda last week, Zimbabwe will be hoping to overcome their counterparts</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-eye-return-leg-victory-against-angola/\">Mighty Warriors eye return leg victory against Angola</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "How Mablanyo transformed Wolves star Munetsi into a midfielder",
            "url": "https://www.newzimbabwe.com/how-mablanyo-transformed-wolves-star-munetsi-into-a-midfielder/",
            "content": "By Sport Reporter\n\nYears back, Dynamos coach Lloyd Mablanyo Chigowehad a chance to coach Marshall Munetsi in the mens Under 17 national team.\n\nI gotto know Munetsi when Iwas coach for Zimbabwe under 17, we got him from Ali Sundowns in Mabvuku.\n\nBy then he was just a defender, playing as a centre back, Mablanyo recalled in an interview.\n\nLloyd Mablanyo Chigowe\n\nHaving been impressed by Munetsi in national team colours, Mablanyo then signed him at Blue Rangers, a division one side he was leading back then.\n\nWhen I formed Blue Rangers as head coach, I then signed him (Munetsi).\n\nI saw a lot of potential inthe boy when he was in the national team because he had a big frame.\n\nBy then he was 17 and I took him to a Division One, played him week in, week out.\n\nBecause he was still fragile, I had to push him into the midfield, a role he occupies today, that is box-to-box play.\n\nSo when the Blue Rangers project folded, Irecommended him to Friendly Academy, Mablanyo added.\n\nAs fate would have it, Munetsi was part of the Friendly Academy team that went for a tour to South Africa where he was spotted by FC Cape Town, a lower division club that eventually signed him in 2015.\n\nDestined for greatness, Munetsi in 2016 was signed by South African giants Orlando Pirates.\n\nAt the Buccaneers, the 28-year-old utility player spent three seasons before he was eventually sold to French Ligue 1 side Stade Reims in 2019.\n\nAt Reims the Warriors vice captain spentfour seasons, making more than 300 appearances before he was snatched in January by English Premier Soccer League side Wolverhampton Wanderers in a S$ 20 million deal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>By Sport Reporter Years back, Dynamos coach Lloyd “Mablanyo” Chigowe had a chance to coach Marshall Munetsi in the men’s Under 17 national team. “I got to know Munetsi when I was coach for Zimbabwe under 17, we got him from Ali Sundowns in Mabvuku. “By then he was just a defender, playing as a centre back,” Mablanyo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-mablanyo-transformed-wolves-star-munetsi-into-a-midfielder/\">How Mablanyo transformed Wolves star Munetsi into a midfielder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "African countries urged to mobilise alternative funding for HIV, TB and malaria prevention amid financing crisis",
            "url": "https://www.newzimbabwe.com/african-countries-urged-to-mobilise-alternative-funding-for-hiv-tb-and-malaria-prevention-amid-financing-crisis/",
            "content": "By Staff Reporter\n\nSOUTHERN African Development Community (SADC) health ministers have called upon governments to mobilize alternative funding sources to sustain critical health programs, including HIV, tuberculosis (TB), and malaria prevention, treatment and control.\n\nSADC held a two-day virtual extraordinary meeting of health ministers last week to address critical health challenges facing the SADC region.\n\nAddressing a post-cabinet media briefing Tuesday, information minister Jenfan Muswere said SADC health ministers endorsed key health initiatives to address the challenges.\n\nIn addition, member states were urged to mobilise alternative fundingthrough public-private partnerships and domestic resource mobilisationfor critical health programmes, including HIV, TB and malariaprevention, treatment and control.\n\nThe Meeting also endorsed the SADC TB Strategic Plan, expansion of the E8 Malaria Elimination Initiative to all 16, SADC Member States under the auspices of SADC, a project to accelerate the implementation and investment into the SADC Sexual and Reproductive Health and Rights (SRHR) strategy, the feasibility study on the establishment of a Southern Africa Health Organisation and the establishment of the SADC Pooled Procurement Services (SPPS) as an Autonomous Special Purpose Vehicle under the principle of subsidiarity, Muswere said.\n\nThis comes at a time when the region is facing funding shortages following an executive order freezing almost all United States foreign aid in line with President Donald Trumps America First.\n\nOver 50 African countries have been benefiting from the U.S Presidents Emergency Plan for AIDS Relief which provided critical HIV/AIDS treatment and prevention.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12194913/truck-stop-clinic.webp",
            "description": "<p>By Staff Reporter SOUTHERN African Development Community (SADC) health ministers have called upon governments to mobilize alternative funding sources to sustain critical health programs, including HIV, tuberculosis (TB), and malaria prevention, treatment and control. SADC  held a two-day virtual extraordinary meeting of health ministers last week to address critical health challenges facing the SADC region.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-countries-urged-to-mobilise-alternative-funding-for-hiv-tb-and-malaria-prevention-amid-financing-crisis/\">African countries urged to mobilise alternative funding for HIV, TB and malaria prevention amid financing crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "Master H’s EP: A story of ghetto tears and existential strife",
            "url": "https://www.newzimbabwe.com/master-hs-ep-a-story-of-ghetto-tears-and-existential-strife/",
            "content": "By Darlington Gatsi\n\nZimdancehall sensation Hillary Marufu, popularly known as Master H, has picked up where he left off last year with the release of an Extended Play (EP).\n\nMaster H continues to solidify his status as one of the most sought-after Zimdancehall artists, even as the genre shows signs of waning in popularity compared to emerging genres such as Hip Hop.\n\nThe EP features four tracks: Bhoo Zvokuti, Ghetto Tears, Bum Bum Figa in which he ropedin Anika, and Dancehall Time featuring JamaicanmusicianCapleton.\n\nBhoo Zvokuti, which features Nutty O and Freeman, along with Ghetto Tears, continues Master Hs exploration of hardship.\n\nHardship has been a recurring theme in some of Master Hs more mature compositions, standing in contrast to his usual party-centric tracks.\n\nBho Zvokuti serves as a continuation of Master Hs 2023 release, Zvirimo Mumoyo. The song delves into his personal battles and the demons of poverty.\n\nThe new release, a blend of three great musical voices, celebrates the hardships of ZvirimoMumoyothose whose dreams are manifesting, albeit at a slow pace.\n\nThe songs visuals depict a young man in the high-density suburbs who, despite the hardships, is driven by ambition.\n\nThe protagonist is a reflection of Master H himself, who endured hurdles such as drug abuse and a lack of opportunity before making his breakthrough in the music scene.\n\nThe song resonates with the majority of young people who navigate a life born out of hardship and struggle. The ghetto setting paves the way for Ghetto Tears.\n\nGhetto Tears portrays hardship once again, with strife at the core of its message. It offers a raw and introspective perspective on the lives of young people.\n\nMaster H, himself a product of the ghetto, has taken it upon himself to be the voice of striving young people. He interrogatespoverty that is rife in the ghetto which has seen many failing to acquire basics.\n\nThe intertwining themes of the three songs, each carrying a deeper meaning, are a testament to Master Hs lyrical prowess.\n\nAnchored in hardship, the three tracks carry a message of hope despite the struggles.\n\nOverall, the EP showcases Master Hs versatility as an artist, blending his signature party anthems with deeper, more reflective narratives.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27024548/IMG-20250126-WA0020.jpg",
            "description": "<p>By Darlington Gatsi Zimdancehall sensation Hillary Marufu, popularly known as Master H, has picked up where he left off last year with the release of an Extended Play (EP). Master H continues to solidify his status as one of the most sought-after Zimdancehall artists, even as the genre shows signs of waning in popularity compared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/master-hs-ep-a-story-of-ghetto-tears-and-existential-strife/\">Master H’s EP: A story of ghetto tears and existential strife</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        },
        {
            "title": "ZimTrade implores local companies to tap into the US$144,3 billion agrochemicals global industry",
            "url": "https://www.newzimbabwe.com/zimtrade-implores-local-companies-to-tap-into-the-us1443-billion-agrochemicals-global-industry/",
            "content": "By Alois Vinga\n\nTRADE Promotion agency, ZimTrade has implored local players to pursue strategic partnershipsandtap into the US$144billion agrochemicals global industry potential.\n\nAccording to the agency, the SADC market alone imported US$4,4 billion worth of agrochemicals in 2023, up from US$2,7 billion in 2019.\n\nCOMESA imports showed similar growth, climbing to US$4,9 billion in 2023 from US$3,1 billion in 2019.Africas agrochemical market is highly competitive, with imports dominated by countries such as China, Morocco, and Russia.\n\nZimtrade data shows that China alone accounted for US$2.2 billion in exports to African countries in 2023, followed by Morocco at US$1,1 billion and Russia at US$816 million with regional players like South Africa and Egypt, exporting US$685 million and US$563 million, respectively.\n\nThis competitive environment underscores the need for Zimbabwean companies to carve out a niche, potentially focusing on innovative, eco-friendly agrochemicals or leveraging proximity to regional markets to reduce logistical costs.\n\nAnalysis of bilateral trade data between African countries reveals that specific product categories present significant opportunities for Zimbabwean exporters, said ZimTrade.\n\nThe agency said mineral or chemical fertilizers containing nitrogen, phosphorus, and potassium (NPK) dominate regional demand, with imports in African markets reaching US$1,4 billion in 2022. Similarly, products like insecticides, herbicides, and fungicides  essential for improving crop yields, saw imports of US$296 million within African markets in 2023.\n\nThe global and regional agricultural sectors are expanding, and the demand for agrochemicals continues to rise, presenting Zimbabwe with a unique opportunity to tap into these markets and drive export-led growth.\n\nCloser to home, ZimTrade said the demand for fertilizers and crop protection products is growing across Southern Africa due to the regions reliance on agriculture as a key economic activity with the potential for export growth being high particularly in countries such as Zambia, Malawi, and Mozambique, which are all experiencing an increase in agricultural activity.\n\nAs demand for fertilizers and crop protection products increases in these countries, Zimbabwean companies are well-positioned to capitalize on this growth by offering cost-effective solutions that cater to the specific agricultural needs of each market, the agency added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26010536/agrochemicals.webp",
            "description": "<p>By Alois Vinga TRADE Promotion agency, ZimTrade has implored local players to pursue strategic partnerships and tap into the US$144 billion agrochemicals global industry potential. According to the agency, the SADC market alone imported US$4,4 billion worth of agrochemicals in 2023, up from US$2,7 billion in 2019. COMESA imports showed similar growth, climbing to US$4,9 billion in 2023</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimtrade-implores-local-companies-to-tap-into-the-us1443-billion-agrochemicals-global-industry/\">ZimTrade implores local companies to tap into the US$144,3 billion agrochemicals global industry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "26 Feb 2025"
        }
    ]
}