{
    "news": [
        {
            "title": "President Mnangagwa urges national development support on Heroes Day",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-urges-national-development-support-on-heroes-day/",
            "content": "Xinhua\n\nZimbabwean President Emmerson Mnangagwa on Monday urged citizens to support national development in honor of the fallen heroes during the liberation struggle while addressing the 45th Heroes Day celebration in Harare, the countrys capital.\n\nMnangagwa noted that to immortalize the sacrifices made by war heroes and heroines who lost their lives during the liberation struggle against colonial rule, the government is spearheading various economic development projects nationwide to enhance the quality of life for citizens.\n\nIndependence in 1980 brought about political independence, while the struggle for the economy remains ongoing, said Mnangagwa, adding that in honor of those who sacrificed their lives for the liberation of the country, all Zimbabweans should equally play a leading role in spurring economic growth.\n\nDespite challenges characterized by the effects of illegal sanctions, fluctuating international mineral commodity prices, and a fluid global trade environment, our economy is demonstrating remarkable resilience, said Mnangagwa.\n\nThe countrys bumper harvest in wheat, maize, and traditional grains, record levels in tobacco production, along with the rebound growth of the national herd and increased milk production, are testament to the hard work and perseverance of Zimbabweans, he said.\n\nWe, thus, celebrate farmers and stakeholders in the agriculture sector, who continue to be worthy custodians of the land which our heroes and heroines paid for with their precious blood, he added.\n\nHe said notable growth has also been recorded in the iron and steel sector, cement production, and food processing, among others.\n\nAs a nation richly endowed with mineral resources, we are determined to ensure that these translate into economic benefits for all citizens and empowerment of host communities, Mnangagwa added.\n\nHeroes Day is a public holiday in Zimbabwe, annually observed on the second Monday of August to pay tribute to fallen heroes.\n\nSenior government officials, diplomats, and families of fallen heroes also took part in the activity at a gathering at the National Heroes Acre, where honors and awards were conferred on living and departed heroes for their outstanding accomplishments in Zimbabwe.\n\nZimbabwean President Emmerson Mnangagwa addresses the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\nZimbabwean President Emmerson Mnangagwa (C) bows to a monument during the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\nPeople take part in the 45th Heroes Day celebration in Harare, capital of Zimbabwe, on Aug. 11, 2025. (Photo by Shaun Jusa/Xinhua)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12052650/ED-heroes.jpeg",
            "description": "<p> Xinhua Zimbabwean President Emmerson Mnangagwa on Monday urged citizens to support national development in honor of the fallen heroes during the liberation struggle while addressing the 45th Heroes Day celebration in Harare, the country’s capital. Mnangagwa noted that to immortalize the sacrifices made by war heroes and heroines who lost their lives during the liberation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-urges-national-development-support-on-heroes-day/\">President Mnangagwa urges national development support on Heroes Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "12 Aug 2025"
        },
        {
            "title": "Kourtney Kardashian-Baker shuts down pregnancy speculation with a side of sass",
            "url": "https://www.newzimbabwe.com/kourtney-kardashian-baker-shuts-down-pregnancy-speculation-with-a-side-of-sass/",
            "content": "IOL\n\nAmerican reality TV star, Kourtney Kardashian-Baker, has once again shut down rumours that she has a bun in the oven.\n\nThe Poosh founder shared a carousel of images on Instagram last Friday, giving fans a glimpse of her holiday-filled life with her family, when a fan commented that there are rumours that Kardashian-Baker is expecting another child.\n\nThe fan wrote: RUMOURS HAVE IT THAT YOURE PREGNANT KOURTNEY.\n\nThe 46-year-old clapped back and replied, Eating pancakes and jumping off cliffs, hinting that she would not be doing such strenuous activities if she were indeed pregnant, because that could harm her and the baby.\n\nPlay Video\n\nThis is not the first time that the media personality was rumoured to be expecting her second child with Travis Baker.\n\nJust last month, the mother of four was rumoured to be pregnant after she shared pictures from her holiday in Italy and included a picture of her in a bikini, which prompted fans to comment on her body, saying that she is expecting again.\n\nThe Lemme co-founder replied: Or breastfeeding, eating gelato, focaccia, pasta, not working out and living my best damn life, baby!\n\nThe Kardashians star and her husband welcomed Rocky, their first child together, in November 2023.\n\nShe also has three older children with her ex, Scott Disick: sons Mason, 15, Reign, 10, and daughter Penelope, 13.\n\nKardashian-Baker is by far the only celebrity to have been open about herpostpartumbody and not conforming to the snap-back culture that has gained popularity among celebrity moms and has also created certain notions and expectations for new moms.\n\nIn 2024, the reality TV starpenned a heart-warming letter to all the moms out thereabout the pressures of bouncing back after pregnancy.\n\nShe wrote: Dear new mommies, your body is beautiful at all stages. During pregnancy, as we are glowing and growing, postpartum, as we are healing and shrinking, and then that period I find the hardest as our bodies are still adjusting.\n\nShe added, And if youre breastfeeding, thats a whole other part of it. I try to be kind to myself as my body finds a new normal. The pressure put on us to bounce back when everything is new and different isnt realistic. Life is beautiful, you are beautiful.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/12052432/kourtney-kardashian.webp",
            "description": "<p>IOL American reality TV star, Kourtney Kardashian-Baker, has once again shut down rumours that she has a bun in the oven. The Poosh founder shared a carousel of images on Instagram last Friday, giving fans a glimpse of her holiday-filled life with her family, when a fan commented that there are rumours that Kardashian-Baker is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kourtney-kardashian-baker-shuts-down-pregnancy-speculation-with-a-side-of-sass/\">Kourtney Kardashian-Baker shuts down pregnancy speculation with a side of sass</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "12 Aug 2025"
        },
        {
            "title": "ZimUK Business Chamber to host inaugural Diaspora Trade and Investment Indaba in Harare",
            "url": "https://www.newzimbabwe.com/zimuk-business-chamber-to-host-inaugural-diaspora-trade-and-investment-indaba-in-harare/",
            "content": "By Own Correspondent\n\nThe ZimUK Business Chamber (ZimUKBC), a UK-based business network with strong connections across the United Kingdom, Zimbabwe, Southern Africa, and internationally, will host its inaugural Diaspora Trade and Investment Indaba in Harare, Zimbabwe, on 21 and 22 August 2025 at the Hyatt Regency Harare, The Meikles.\n\nThis landmark gathering will bring together UK-based investors, Zimbabwean business leaders, government officials, trade partners, and industry experts to explore and strengthen trade and investment relations between Zimbabwe and the United Kingdom. The event will mark the launch of an annual initiative designed to foster long-term partnerships that promote sustainable economic growth and development.\n\nZimUKBCs primary mission is to connect people in business, facilitate peer networking, support enterprise growth, and empower small and medium-sized businesses to reach their full potential. With members drawn largely from Zimbabwe and Southern Africa, the organisation supports businesses across diverse sectors including health and social care, retail, agro-business, manufacturing, finance, services, and technology.\n\nIt also serves as a powerful voice in policy discussions, ensuring that the interests of its members are heard at the highest levels. The Trade and Investment Indaba will serve as a platform to promote Zimbabwes untapped potential, encourage joint ventures between UK investors and Zimbabwean SMEs, and showcase opportunities across industries such as agriculture, mining, manufacturing, tourism, infrastructure, finance, technology, and logistics.\n\nIn convening this event, ZimUKBC will work closely with key national agencies and institutions, including the Zimbabwe Investment and Development Agency (ZIDA), ZimTrade, the Zimbabwe National Chamber of Commerce (ZNCC), and the Confederation of Zimbabwe Industries (CZI), all of which share the vision of expanding exports, attracting foreign investment, and fostering bilateral trade.\n\nThe Indaba will feature high-level business-to-business networking sessions, thought-provoking presentations, and a celebratory gala dinner to mark the launch of this new tradition. Distinguished guests will include a senior trade and investment official from the British Embassy in Zimbabwe, adding to the significance of the occasion.\n\nKennedy Mwedziwendira, Chairman and Founder of ZimUKBC, expressed his excitement about the event, describing it as a pivotal moment for diaspora-driven investment and trade.\n\nThis Indaba will be a pivotal platform to build meaningful partnerships between UK investors and Zimbabwean businesses, particularly within the diaspora community. We are excited to establish it as an annual event that accelerates investment, trade, and sustainable economic growth, he said. The ZimUK Business Chamber sees this first gathering as the foundation for stronger economic bridges between Zimbabwe and the United Kingdom, with the potential to contribute significantly to the countrys development while opening new opportunities for UK investors in one of Africas most promising markets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/11205916/zimbabwe-connecting-people.jpg",
            "description": "<p>By Own Correspondent The ZimUK Business Chamber (ZimUKBC), a UK-based business network with strong connections across the United Kingdom, Zimbabwe, Southern Africa, and internationally, will host its inaugural Diaspora Trade and Investment Indaba in Harare, Zimbabwe, on 21 and 22 August 2025 at the Hyatt Regency Harare, The Meikles. This landmark gathering will bring together</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimuk-business-chamber-to-host-inaugural-diaspora-trade-and-investment-indaba-in-harare/\">ZimUK Business Chamber to host inaugural Diaspora Trade and Investment Indaba in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "12 Aug 2025"
        },
        {
            "title": "UN experts urge Zimbabwe to make gender equality ‘lived reality’",
            "url": "https://www.newzimbabwe.com/un-experts-urge-zimbabwe-to-make-gender-equality-lived-reality/",
            "content": "APA News\n\nUnited Nations experts have called on Zimbabwe to take urgent action against child marriage and teenage pregnancy, warning that entrenched patriarchal norms continue to undermine the rights and futures of millions of girls.\n\nConcluding a formal visit, the UN Working Group on discrimination against women and girls urged the government to invest in girls education, safety and rights, stating that gender equality must become a lived reality rather than a constitutional aspiration.\n\nGender equality must be more than a promise on paper  it must become a lived reality for every woman and girl in Zimbabwe, the group said.\n\nThe experts noted that despite the governments efforts, persistent discrimination and entrenched patriarchal norms continue to deny girls their fundamental rights and limit their future opportunities.\n\nZimbabwe must actively confront and eradicate patriarchal attitudes that undervalue girls, creating a society which nurtures their potential as future leaders, innovators and changemakers.\n\nDespite the enactment of the Marriages Act (2022), which criminalises child marriage and sets 18 as the legal minimum age, no prosecutions have been recorded.\n\nThe experts revealed that 1.4 million women in Zimbabwe were married before age 18 and 241,000 before 15.\n\nTeenage pregnancy remains high at 23 percent, with 43 percent of adolescents becoming sexually active before 18.\n\nThe experts noted that girls face stigma, misinformation and limited access to youth-friendly reproductive health services, while many are forced to leave school, undermining their long-term well-being and independence.\n\nThey also raised alarm over child sexual abuse and gender-based violence, particularly affecting girls left behind by migrant parents, those with disabilities and members of religious sects.\n\nCalling for stronger enforcement and public awareness, the working group urged the Harare authorities to expand trauma-informed training for law enforcement and the judiciary, and to adequately fund shelters and one-stop centres, which they described as essential services and a core state responsibility.\n\nThe experts stressed the need to ensure that gender equality is embraced as a societal value that benefits all.\n\nGender equality is not a zero-sum goal  men and boys also stand to benefit significantly from a more just and equal society, they said.\n\nThe final report of the visit will be presented to the UN Human Rights Council in June 2026.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04025833/Teenage-Pregnancy.png",
            "description": "<p>APA News United Nations experts have called on Zimbabwe to take urgent action against child marriage and teenage pregnancy, warning that entrenched patriarchal norms continue to undermine the rights and futures of millions of girls. Concluding a formal visit, the UN Working Group on discrimination against women and girls urged the government to invest in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-experts-urge-zimbabwe-to-make-gender-equality-lived-reality/\">UN experts urge Zimbabwe to make gender equality ‘lived reality’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "12 Aug 2025"
        }
    ]
}