{
    "news": [
        {
            "title": "There is enough ZWG supply – RBZ says as traders flag banknotes shortages",
            "url": "https://www.newzimbabwe.com/there-is-enough-zwg-supply-rbz-says-as-traders-flag-banknotes-shortages/",
            "content": "By Alois Vinga\n\nThe Reserve Bank of Zimbabwe (RBZ) says adequate stocks of ZWG notes are available to meet the current trade demands across the key economic sectors.\n\nThe announcements come at a time when the majority of citizens outside the capital of Harare have never felt the texture of the ZWG notes. In provinces such as Bulawayo and the Midlands, up to Beitbridge, traders have resorted to the use of US$ and the South African Rand as change due to the scarcity of ZWG notes.\n\nEven in Harare, citizens continue to struggle to access the local unit in hard cash for transactional purposes. As a result, the ZWG accessibility problems, which characterised the local unit since its launch on April 5 2024 have persisted for more than a year, prompting analysts to blame such a tight grip for the eroding confidence in the currency.\n\nIn a recent statement, RBZ governor Dr John Mushayavanhu said he had noted concerns coming from the transacting public relating to the availability of ZWG cash and its usage, particularly from areas outside Harare.\n\nThe RBZ wishes to advise that usage of the local currency, ZWG, has improved significantly in the economy. Precisely, the proportion of local currency settlements on the National Payment System from ZWG7,86 billion in April 2024 to ZWG56,8 billion (43%) as at May 30 2025. In tandem, the Reserve Bank has been disbursing adequate cash to banks in line with demand.\n\nAs at June 12 2025, the total ZWG deposits in the economy amounted to about ZWG16 billion, of which over ZWG207 million was cash held by banks, which meets optimal requirements and is sufficient to support daily deposits and withdrawals by the public, he said.\n\nMushayavanhu said the central bank is currently working with banking institutions to ensure the wider availability and distribution of ZWG cash through banking halls and Automated Teller Machines (ATMs).\n\nThe prevailing currency and exchange rate stability , coupled with measures being taken by the government to increase the usage of ZWG in the economy is expected to result in increased usage of the local currency in both electronic and physical form, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>By Alois Vinga The Reserve Bank of Zimbabwe (RBZ) says adequate stocks of ZWG notes are available to meet the current trade demands across the key economic sectors. The announcements come at a time when the majority of citizens outside the capital of Harare have never felt the texture of the ZWG notes. In provinces</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/there-is-enough-zwg-supply-rbz-says-as-traders-flag-banknotes-shortages/\">There is enough ZWG supply – RBZ says as traders flag banknotes shortages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:48",
            "date": "18 Jun 2025"
        },
        {
            "title": "Too many areas requiring urgent attention – presidential spokesperson says following Mnangagwa’s visit to public referral hospitals",
            "url": "https://www.newzimbabwe.com/too-many-areas-requiring-urgent-attention-presidential-spokesperson-says-following-mnangagwas-visit-to-public-referral-hospitals/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwas spokesperson George Charamba, has acknowledged the dire state of Zimbabwes public hospitals, highlighting infrastructure decay, policy gaps and systematic overload.\n\nCharamba was speaking following Mnangagwas visit to Zimbabwes main referral hospitals, Parirenyatwa and Sally Mugabe, on Monday. The visits follow public outcry over the dysfunctional state of public hospitals.\n\nMnangagwas government has long neglected general hospitals, which now face crumbling infrastructure, medicine shortages, costly patient care and poor wages that have led to low staff morale and a massive brain drain.\n\nOur role as Presidential staffers was to note areas requiring immediate, medium and long-term interventions, and they were just too many, in order to help shape effective health delivery policy.\n\nIt was clear from the visit that the whole health delivery hierarchy needed attention. Failures at basic primary levels like clinics, municipal clinics and district hospitals transmitted themselves all the way to referral hospitals, leading to a system which is creaking from an overload, disrepair and fresh investments.\n\nInterventions have got to be systemic, a lack which in fact explains the rise of top-notch private care-givers who are a ringing antipode to massive failures in the public health system, Charamba wrote on his X account.\n\nZimbabwes referral hospitals are overloaded and overwhelmed, as most primary care clinics are incapacitated and unable to handle even basic health issues.\n\nThe presidential spokesmanalso said Mnangagwa witnessed the Parirenyatwa Hospitals Mbuya NehandaMaternity Wing operating without curtains or heating, compromising patient privacy and comfort.\n\nMany wards do not have enough blankets, and most have broken windows.\n\nCharamba added thatthere are serious administrative inefficiencies across the Ministries of Finance, Local Government, and Health that urgently require a more hands-on approach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17060121/ed-hospital-scaled.jpeg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa’s spokesperson George Charamba, has acknowledged the dire state of Zimbabwe’s public hospitals, highlighting infrastructure decay, policy gaps and systematic overload. Charamba was speaking following Mnangagwa’s visit to Zimbabwe’s main referral hospitals, Parirenyatwa and Sally Mugabe, on Monday. The visits follow public outcry over the dysfunctional state of public hospitals.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/too-many-areas-requiring-urgent-attention-presidential-spokesperson-says-following-mnangagwas-visit-to-public-referral-hospitals/\">Too many areas requiring urgent attention – presidential spokesperson says following Mnangagwa’s visit to public referral hospitals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:48",
            "date": "18 Jun 2025"
        },
        {
            "title": "Zimbabwe, South Africa, Botswana sign treaty to boost cross-border conservation, livelihoods",
            "url": "https://www.newzimbabwe.com/zimbabwe-south-africa-botswana-sign-treaty-to-boost-cross-border-conservation-livelihoods/",
            "content": "By Thandiwe Garusa\n\nBOTSWANA, South Africa, and Zimbabwe have signed a treaty to establish the Greater Mapungubwe Transfrontier Conservation Area, aiming atpromotingcross-border environmental conservation, cultural heritage protection, and sustainable socio-economic development.\n\nThe countries will work together to protect nature and cultural heritage in the Greater Mapungubwe area, while also improving peoples lives through conservation and sustainable development.\n\nSpeaking during a post-cabinet media briefing on Tuesday, Information Minister Jenfan Muswere said the people in the Greater Mapungubwe Transfrontier Conservation Area share common values, interests, and cultural ties and are therefore working together to create strategies that support both community well-being and environmental conservation.\n\nThe objective of the Treaty is to establish the Greater Mapungubwe\n\nTransfrontier Conservation Area for the promotion of collaborative conservation of the environment and shared natural and cultural heritage resources for the benefit of people in the Transfrontier Conservation Area.\n\nOwing to shared values, interests and cultures among the people in the Greater Mapungubwe Transfrontier Conservation Area, the governments of Botswana, South Africa and Zimbabwe are coming together to develop models for enhancing livelihoods and conservation efforts.\n\nThe Treaty will promote ecosystem integrity, biodiversity conservation, cultural heritage resource management and sustainable socio-economic development across international boundaries.\n\nThe Greater Mapungubwe Transfrontier Conservation Area will comprise the following areas: the Northern Tuli Game Reserve, in Botswana; the Mapungubwe National Park and World Heritage Site in South Africa; and the Tuli Circle Safari Area, Maramani and other surrounding Wildlife Management Areas in Zimbabwe.\n\nCommunities in the Greater Mapungubwe area face major problems like human-wildlife conflicts, climate change effects, and limited job or income options for locals.\n\nMeanwhile, according to authorities, in Zimbabwe, 300 people were killed in human-wildlife conflicts nationwide between 2019 and 2023, with recent reports indicating that 18 people were killed in this years first quarter alone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17201737/Mapungubwe-rock-formation-and-baboons-1024x640-1.jpg",
            "description": "<p>By Thandiwe Garusa BOTSWANA, South Africa, and Zimbabwe have signed a treaty to establish the Greater Mapungubwe Transfrontier Conservation Area, aiming at promoting cross-border environmental conservation, cultural heritage protection, and sustainable socio-economic development. The countries will work together to protect nature and cultural heritage in the Greater Mapungubwe area, while also improving people’s lives through conservation and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-south-africa-botswana-sign-treaty-to-boost-cross-border-conservation-livelihoods/\">Zimbabwe, South Africa, Botswana sign treaty to boost cross-border conservation, livelihoods</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:48",
            "date": "18 Jun 2025"
        },
        {
            "title": "Uganda leader signs new law allowing military trials for civilians",
            "url": "https://www.newzimbabwe.com/uganda-leader-signs-new-law-allowing-military-trials-for-civilians/",
            "content": "BBC\n\nUgandas President Yoweri Museveni has signed into law an amendment that will allow, once again, civilians to be tried in a military court under certain circumstances.\n\nA previous law permitting such trials was ruled unconstitutional by the Supreme Court in January.\n\nBefore that ruling,civilians could be taken to a military tribunal if they had been found with military equipmentlike guns or army uniforms. Activists had complained that the law was used to persecute government critics.\n\nParliamentarians passed the amendment last month amid a heavy police presence and a boycott by opposition lawmakers, who argued that it violated the ruling by the countrys highest court.\n\nIn January, the judges said that the military courts were neither impartial nor competent to exercise judicial functions, the International Society for Human Rights reported at the time.\n\nThe amendment appears to try and address some of the issues.\n\nIt says that those presiding over the tribunals should have relevant legal qualifications and training. It also says that while performing their legal functions they should be independent and impartial.\n\nBut civilians can still be transferred if found with military hardware.\n\nThe law will deal decisively with armed violent criminals, deter the formation of militant political groups that seek to subvert democratic processes, and ensure national security is bound on a firm foundational base. If it aint broke, dont fix it!, army spokespersonCol Chris Magezi wrote on X after the bill was passed by MPs.\n\nBut opposition leader Bobi Wine said the law would be used against him and others.\n\nAll of us in the opposition are being targeted by the act, he told the AFP news agency.\n\nThe Uganda Law Society, a professional body that represents the countrys lawyers, has said it will challenge the constitutionality of the amendment.\n\nFor years, activists had argued that the military courts were being used by the government to silence dissidents, with people alleging that evidence had been planted.\n\nIf you are a political opponent then they will find a way of getting you under the military court and then you know your fate is sealed once there, justice will never visit your door, human rights lawyer Gawaya Tegulle told the BBCs Focus on Africa podcast in February.\n\nHe added that people can spend years in detention on remand as the courts await decisions from senior military figures, which may never come, and those who are tried and found guilty face harsher penalties than in civilian courts.\n\nA recent high-profile case followed Novembers arrest of long-time leading opposition figure Kizza Besigye. He was picked up in neighbouring Kenya, taken across the border and then charged in a military court with possession of pistols and attempting to purchase weapons abroad, which he denied.\n\nThose charges were dropped, and replaced with others, when his case was transferred to a civilian court following the Supreme Court ruling.\n\nMuseveni, who has been in power since 1986,described the verdict as the wrong decision, adding that the country is not governed by the judges. It is governed by the people.\n\nHe hadpreviously defended the use of military courtssaying that they dealt with the rampant activities of criminals and terrorists that were using guns to kill people indiscriminately.\n\nHe said that civilian courts were too busy to handle these gun-wielding criminals quickly.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/15204718/Yoweri-Museveni-1.webp",
            "description": "<p>BBC Uganda’s President Yoweri Museveni has signed into law an amendment that will allow, once again, civilians to be tried in a military court under certain circumstances. A previous law permitting such trials was ruled unconstitutional by the Supreme Court in January. Before that ruling, civilians could be taken to a military tribunal if they had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uganda-leader-signs-new-law-allowing-military-trials-for-civilians/\">Uganda leader signs new law allowing military trials for civilians</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:48",
            "date": "18 Jun 2025"
        },
        {
            "title": "AMH journalist Blessed Mhlanga’s trial in false start again",
            "url": "https://www.newzimbabwe.com/amh-journalist-blessed-mhlangas-trial-in-false-start-again/",
            "content": "By Staff Reporter\n\nThe trial of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, accused of transmitting data messages inciting violence, failed to start again on Tuesday after the presiding magistrate failed to show up due to poor health.\n\nMagistrate Learnmore Mapiye is presiding over the hearing with Mhlanga now jointly charged with his employer, Heart & Soul TV (HSTv), a subsidiary of AMH.\n\nTrial is now expected to begin on July 17.\n\nMhlanga and his employer are being charged under Section 164 of the Criminal Law (Codification and Reform) Act, but were arrested separately.\n\nThe journalist was arrested in February this year and spent 72 days in pretrial detention.\n\nHe was granted US$500 bail by High Court Judge Justice Gibson Mandaza on his third freedom bid.\n\nMhlanga landed in the dock after HSTV published a press conference by Zanu PF war veteran Blessed Geza, who was calling for President Emmerson Mnangagwas resignation. Geza is currently in hiding.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26061950/Blessed-Mhlanga.png",
            "description": "<p>By Staff Reporter The trial of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, accused of transmitting data messages inciting violence, failed to start again on Tuesday after the presiding magistrate failed to show up due to poor health. Magistrate Learnmore Mapiye is presiding over the hearing with Mhlanga now jointly charged with his employer, Heart</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amh-journalist-blessed-mhlangas-trial-in-false-start-again/\">AMH journalist Blessed Mhlanga’s trial in false start again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:48",
            "date": "18 Jun 2025"
        },
        {
            "title": "Explosion at fireworks factory in central China kills nine and injures 26",
            "url": "https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/",
            "content": "AFP\n\nAn explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident.\n\nThe blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run China National Radio (CNR) said.\n\nAs of 9:00 am on Tuesday, nine people were dead and 26 injured, CNR said, citing a rescue command centre.\n\nRescue work at the scene was ongoing, CNR reported, noting a complicated situation and the risk of additional explosions hampering response efforts.\n\nAdding to the challenge, the site was in a mountainous area with no large water source, it added.\n\nDuring more than 20 hours of uninterrupted and continuous rescue, the rescue team used remote-controlled water cannons to extinguish the fire, the report said.\n\nState news agency Xinhua also said Tuesday that the Ministry of Emergency Management had sent a working team to Hunan to oversee the rescue.\n\nEfforts must be made to ascertain the cause of the explosion as soon as possible and to hold those responsible accountable, the ministry said, according to Xinhua.\n\nIndustrial accidents are fairly common in China due to vague regulations and lax safety standards.\n\nLast month, an explosion at a chemical plant in the eastern province of Shandong killed at least five people.\n\nIn 2015, blasts at warehouses containing flammable chemicals in the port city of Tianjin killed more than 170 people and injured 700 others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17092806/Screenshot-2025-06-17-at-10.27.17.png",
            "description": "<p>AFP An explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident. The blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/\">Explosion at fireworks factory in central China kills nine and injures 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:48",
            "date": "18 Jun 2025"
        }
    ]
}