{
    "news": [
        {
            "title": "Mom ashamed of six-year-old daughter’s disability strangles her to death",
            "url": "https://www.newzimbabwe.com/mom-ashamed-of-six-year-old-daughters-disability-strangles-her-to-death/",
            "content": "By Staff Reporter\n\nA HWANGE woman has been arrested for killing her six-year-old daughter, who was living with a disability.\n\nMelody Mwiinde (23) confessed to strangling her daughter inorder to end the embarrassment endured from mocking by community members over the minors disability.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn April 25, 2025, police in Hwange arrested Melody Mwiinde (23) in connection with a case of murder which occurred on April 23, 2025, at Mujimba 9, Siabuwa.\n\nThe suspect allegedly killed her daughter (6) by hanging her with an electrical cable from a tree branch. The body was dumped in a disused hut, said Nyathi.\n\nThe suspect allegedly confessed that she killed the victim because people were mocking her for keeping a disabled child who had been disowned by her father, the police spokesman added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12224313/Murder.jpg",
            "description": "<p>By Staff Reporter A HWANGE woman has been arrested for killing her six-year-old daughter, who was living with a disability. Melody Mwiinde (23) confessed to strangling her daughter inorder to end “the embarrassment” endured from mocking by community members over the minor’s disability. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mom-ashamed-of-six-year-old-daughters-disability-strangles-her-to-death/\">Mom ashamed of six-year-old daughter’s disability strangles her to death </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "EU commits to promote Zimbabwe’s private sector",
            "url": "https://www.newzimbabwe.com/eu-commits-to-promote-zimbabwes-private-sector/",
            "content": "By Alois Vinga\n\nTHE European Union (EU) delegation in Zimbabwe has expressed deeper commitment to partner with the countrys private sector through the provision of intermediate lending facilities.\n\nIn a statement delivered to mark the Zimbabwe International Trade Fair (ZITF) for the 2025 edition, the Western bloc reaffirmed its commitment to work hand-in-hand with the private sector.\n\nThe diplomatic mission said the total amount of financing extended to Zimbabwean commercial banks by EU financial institutions (European Investment Bank) and Proparco over the past three years amounts to 90 million comprising intermediate credit facilities, portfolio guarantees, and trade finance.\n\nThe partnership between the EU and Zimbabwean banks is a prime example of the collective efforts to create jobs, promote financial inclusion and ultimately contribute to sustainable economic growth.\n\nWe are excited to return to ZITF this year with a strengthened focus on private sector engagement. Private sector engagement is vital to every economy. Through our Global Gateway strategy, the EU has placed business development at the core of economic development, job creation and prosperity, EU Ambassador Jobst von Kirchmann said.\n\nThe bloc said the EU-Zimbabwe Economic Partnership Agreement (EPA) and the EUs Global Gateway offers yet another framework for increased trade and investment for local companies who have the possibility to export to the EU on a 100% duty-free, quota-free basis.\n\nThe agreement offers Zimbabwean companies the possibility to modernise and transform their manufacturing processes through the importation of machinery duty-free from Europe, while allowing Zimbabwean companies to export duty-free and tariff-free to the EU.\n\nWith a trade volume of US$ 700 million and a positive trade balance in favour of Zimbabwe, this is a significant area of cooperation as the EU represents Zimbabwes fifth-largest trading partner and number one destination for horticultural exports.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/11193140/Photo-de-Jobst-von-Kirchmann-juin-2021.jpg",
            "description": "<p>By Alois Vinga THE European Union (EU) delegation in Zimbabwe has expressed deeper commitment to partner with the country’s private sector through the provision of intermediate lending facilities. In a statement delivered to mark the Zimbabwe International Trade Fair (ZITF) for the 2025 edition, the Western bloc reaffirmed its commitment to work hand-in-hand with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eu-commits-to-promote-zimbabwes-private-sector/\">EU commits to promote Zimbabwe’s private sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "Thabani Gonye retained as Zimbabwe Olympics Committee president",
            "url": "https://www.newzimbabwe.com/thabani-gonye-retained-as-zimbabwe-olympics-committee-president/",
            "content": "By Sports Reporter\n\nTHABANI Gonye has been retained as the Zimbabwe Olympics Committee (ZOC) president after winning an election Sunday afternoon.\n\nGonye polled a total of 15 votes, three more than Ringisai Mapondera, who managed 12 at the Quadrennial General Meeting held in the capital, Harare.\n\nHis re-election will see Gonye leading the committee for the next four years, putting his name in the history books as one of the few presidents to go for more than one term.\n\nZOCs executive has former ZBC sports journalist Merit Munzwembiri and Fedrick Ndlovu as the two vice presidents.\n\nSeveral prominent figures in sports administration have made it into the new executive as board members including former ZIFA spokesperson Xolisani Gwesela and former Zimbabwean Long Distance runner Abel Chimukoko.\n\nNew ZOC Executive\n\nThabani Gonye  President\n\nFedrick Ndlovu- Vice President\n\nMerit Munzwembiri  Vice President\n\nBoad Members\n\nXolisani Gwesela, Abel Chimukoko, Tawanda Sithole, Lizzie Mupure, Charmaine Chamboko, Edson Chirowodza and Abigail Mnikwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27151305/Screenshot_20250427-160619_1.jpg",
            "description": "<p>By Sports Reporter THABANI Gonye has been retained as the Zimbabwe Olympics Committee (ZOC) president after winning an election Sunday afternoon. Gonye polled a total of 15 votes, three more than Ringisai Mapondera, who managed 12 at the Quadrennial General Meeting held in the capital, Harare. His re-election will see Gonye leading the committee for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thabani-gonye-retained-as-zimbabwe-olympics-committee-president/\">Thabani Gonye retained as Zimbabwe Olympics Committee president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "King Kandoro to Host 15th UK Zimbabwe Achievers Awards; Diaspora Insurance among key partners",
            "url": "https://www.newzimbabwe.com/king-kandoro-to-host-15th-uk-zimbabwe-achievers-awards-diaspora-insurance-among-key-partners/",
            "content": "By UK Correspondent\n\nLONDON: Acclaimed Zimbabwean comedian and media personality King Kandoro has been officially announced as the host of the 15th Annual Zimbabwe Achievers Awards (ZAA) UK.\n\nThe glamorous awards will take place on Saturday, 17 May 2025 at the prestigious Grand Hotel Birmingham, located at 1 Church St, Birmingham B3 2FE, UK.\n\nNow celebrating a major milestone, the ZAA UK continues to shine a spotlight on Zimbabwean excellence in the diaspora, recognising outstanding achievements across business, the arts, sports, community leadership, and more.\n\nAcclaimed Zimbabwean comedian and media personality King Kandoro\n\nWith King Kandoros signature humour and vibrant energy, this years ceremony is set to be both inspiring and unforgettable.\n\nIm honoured to be part of this incredible event that continues to uplift and recognise Zimbabwean talent across the globe, said King Kandoro.\n\nWere going to laugh, reflect, and celebrate those raising our flag high.\n\nThis years headline partner is Ultra Healthcare, part of GMT Network Ltd, whose support highlights a continued commitment to community empowerment and excellence.\n\nOther key sponsors include Mukuru,Diaspora Insurance, and Remitly, whose ongoing support makes this platform possible for Zimbabweans around the world.\n\nReflecting on the landmark occasion, Dr. Ted Nyatanga, Global Chairman of the Zimbabwe Achievers Awards, said Fifteen years on, ZAA remains a vital platform for celebrating and empowering our people.\n\nIn a world that often overlooks our stories, its important that we continue to recognise each other as a community  to say we see you, we honour you, and we stand with you. That spirit of Ubuntu is what keeps us connected, inspired and proud of who we are.\n\nVoting is now open and will close on Wednesday, 30 April 2025.\n\nNyatanga encouraged members of the public to visit the official ZAA website to cast their votes and support individuals and organisations making an impact both locally and globally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27083132/King-Kandoro-2.png",
            "description": "<p>By UK Correspondent LONDON: Acclaimed Zimbabwean comedian and media personality King Kandoro has been officially announced as the host of the 15th Annual Zimbabwe Achievers Awards (ZAA) UK. The glamorous awards will take place on Saturday, 17 May 2025 at the prestigious Grand Hotel Birmingham, located at 1 Church St, Birmingham B3 2FE, UK. Now</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-kandoro-to-host-15th-uk-zimbabwe-achievers-awards-diaspora-insurance-among-key-partners/\">King Kandoro to Host 15th UK Zimbabwe Achievers Awards; Diaspora Insurance among key partners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "‘l don’t listen to Winky D’s music and we didn’t ban his music on State radio stations’— Nick Mangwana",
            "url": "https://www.newzimbabwe.com/l-dont-listen-to-winky-ds-music-and-we-didnt-ban-his-music-on-state-radio-stations-nick-mangwana/",
            "content": "By Staff Reporter\n\nINFORMATION Ministry Permanent Secretary, Nick Mangwana has claimed that government has not, at any given time, ordered a ban on Winky Ds songs being played on State-controlled radio stations.\n\nBorn Wallace Chirimuko, Winky D, has faced intense scrutiny ever since the release of his album Eureka Eureka, which features tracks like Ibotso and Dzimba Dzamabwe, alongside his latest 2025 songs Kudhakwa and Propaganda which all remain blacklisted from the State media.\n\nMangwana revealed these statements during an interview with DJ Ollah 7 stating his personal aversion to Winky Ds songs stating he finds them not original questioning the legitimacy of an artist, who uses Jamaican intonation.\n\nDo you wanna have this conversation?, I find nothing original in that. I dont understand someone who comes from Zimbabwe, stays in Zimbabwe, grew up in Zimbabwe and tries to talk Patwa, because Patwa was only spoken by the slaves.\n\nPatwa also came along during the times they spent in the plantations and thats the only language they could speak.\n\nEven in Jamaica its spoken but those who didnt learn, so why would someone from Zimbabwe speak Patwa?. I love something which is authentic, yes I love reggae I will listen to reggae, I love dancehall I will listen to the real dancehall, then when we are in Zimbabwe I want to listen to something that is Zimbabwean.\n\nIm not a fan but I dont say what he does is bad, but for my taste Im not a fan, said Mangwana\n\nOllah posed a question that the people, or rather the government, portray Winky D as someone who fights the government through his word play in songs and there was a time that radio stations stopped playing his songs.\n\nIf he fights it, would he win? When was it? Was I the Permanent Secretary? Because if I was the Permanent Secretary we are the ones who can do that but we never did that and we dont know it.\n\nWe dont even talk about him, somebody is out there trying to earn a living, we allow them to earn a living. Our lives are not defined on binary lines, that its either you are for or against or you are pro Zanu PF, no it doesnt define our lives, we are human beings first, Zimbabweans second and then whatever follows, said Mangwana.\n\nFurthermore, Mangwana dismissed that the government and the traditional media doesnt do propaganda.\n\nThey are wrong, we dont do propaganda, traditional media doesnt do propaganda, what it does is it gives information of course in any information giving you certain ideals that you are promoting and certain agendas that you would want to push but thats not propaganda.\n\nIts just like right now if we call someone to come and talk about anti-drugs, is he giving anti-drugs propaganda? So, if we come and talk about the beauty of the Second Republic, we are not giving propaganda we are just making you see that the Second Republic is something else, argued Mangwana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/08090848/ZimFest-18.png",
            "description": "<p>By Staff Reporter INFORMATION Ministry Permanent Secretary, Nick Mangwana has claimed that government has not, at any given time, ordered a ban on Winky D’s songs being played on State-controlled radio stations. Born Wallace Chirimuko, Winky D, has faced intense scrutiny ever since the release of his album Eureka Eureka, which features tracks like “Ibotso”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-dont-listen-to-winky-ds-music-and-we-didnt-ban-his-music-on-state-radio-stations-nick-mangwana/\">‘l don’t listen to Winky D’s music and we didn’t ban his music on State radio stations’— Nick Mangwana</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "President Mnangagwa spokesperson Charamba admits UZ lecturers’ grievances are justified",
            "url": "https://www.newzimbabwe.com/president-mnangagwa-spokesperson-charamba-admits-uz-lecturers-grievances-are-justified/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas spokesman, George Charamba, has conceded that University of Zimbabwe (UZ) lecturers, currently picketing and protesting outside the campus gates over what they describe as slave wages, have legitimate grievances that need addressing.\n\nCharamba has pledged to personally intervene.\n\nThrough their union representative, the Association of University Teachers (AUT), the academic staff at UZ have presented a compelling argument regarding their inadequate salaries and appalling working conditions.\n\nThe staff describe their dire financial situation as incapacitated, rendering them unable to perform their duties effectively. They feel like they are running on empty.\n\nWriting on his X account under the pseudonym Jamwanda 2, Charamba acknowledged the credibility of the lecturers cause, stating it warrants immediate attention.\n\nFrankly our university lecturers have a genuine grievance. I will take it up! Charamba declared.\n\nSelf-exiled former Higher and Tertiary Education Minister Professor Jonathan Moyo did not mince his words, accusing the government and UZ management of colluding to condemn lecturers to poverty. He branded their poor wages a national disgrace. He said the current state of affairs is a recipe for disaster.\n\nThe university authorities and the ministry cannot escape the indictment that their inability to redress the situation is a shocking administrative failure and abuse of duty, which has resulted in an intolerable violation of the human dignity of the academic staff at state universities, Moyo wrote on his X feed Friday.\n\nNot only is this a national embarrassment, but it is also a threat to the countrys economic interests with national security implications, Moyo added.\n\nMoyo, who previously championed Science, Technology, Engineering, and Mathematics (STEM) policy implementation as Minister of Higher and Tertiary Education, further stated that it is entirely impossible for Zimbabwe to develop economically without adequate support for academic staff across state universities, who are naturally implementing STEM initiatives at tertiary institutions.\n\nIt would be impossible for Zimbabwe to defeat the enemies of the people, namely; hunger, poverty, disease, ignorance and corruption without the kind of intellectual property that can only come from higher education; particularly but not only through Science, Technology, Engineering and Mathematics (STEM), Moyo wrote.\n\nWhile the UZ academic staff have been languishing in enforced poverty due to the unilateral slashing of their salaries in 2018, the AUT alleges that the UZ management has simultaneously awarded itself lavish packages, including luxury cars and hefty US dollar perks, whilst prioritising non-essential projects at the expense of the welfare and working conditions of the academic staff.\n\nThey said the UZ management seem to be living in a different world.\n\nThe current reduced salary of US$230 includes a local currency component, averaging ZWG 6,000 to 8,000, which amounts to less than US$200.\n\nThe lecturers strike is continuing outside the UZ campus premises, with numbers visibly increasing by the day.\n\nThe AUT members are vowing to continue with the protest until the government and UZ management find a lasting solution.\n\nNewZimbabwe.com understands that all academic services have been suspended at UZ as lecturers continue to demand their pre-October 2018 salaries of US$2,250.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24104115/UZ-strike-10-scaled.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa’s spokesman, George Charamba, has conceded that University of Zimbabwe (UZ) lecturers, currently picketing and protesting outside the campus gates over what they describe as slave wages, have legitimate grievances that need addressing. Charamba has pledged to personally intervene. Through their union representative, the Association of University Teachers (AUT), the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-mnangagwa-spokesperson-charamba-admits-uz-lecturers-grievances-are-justified/\">President Mnangagwa spokesperson Charamba admits UZ lecturers’ grievances are justified</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "Zimbabwe dismisses UK legislators’ criticism over journalist Blessed Mhlanga’s continued detention",
            "url": "https://www.newzimbabwe.com/zimbabwe-dismisses-uk-legislators-criticism-over-journalist-blessed-mhlangas-continued-detention/",
            "content": "By Staff Reporter\n\nZIMBABWEs government has brushed off criticism from British legislators threatening punitive measures over the continued detention of journalist Blessed Mhlanga, describing the pressure as emotional overreach that holds no weight domestically.\n\nLiberal Democrats peer Lord Jonathan Oates\n\nResponding to Liberal Democrats peer Lord Jonny Oates demand for international consequences, Ministry of Information Permanent Secretary Nick Mangwana said emotional expressions in foreign Parliaments carry little weight here in Zimbabwe.\n\nConversations or emotional overreaches in foreign legislatures count very little here, Mangwana wrote on his official X account.\n\nOates demanded that the United Kingdom (UK) government makes it clear to Mnangagwa and the Zanu PF government that normal relations between the former colonial power and Zimbabwe will not resume as long as basic rights such as those of the media were continuously disrespected.\n\nThis comes at a time when President Emmerson Mnangagwas wife Auxilia will be speaking at a summit scheduled to take place in London come June.\n\nFirst Lady Auxillia Mnangagwa\n\nOates also urged his peers, who will be participating at the summit, to confront and challenge Auxilia over Mhlangas incarceration and her husbands reported bid to extend his term in office.\n\nOn top of that, Zimbabwean rights activists based in the UK are planning protests outside the venue of the First Ladies of African Impact and Resilience (FLAIR) summit, where Auxillia will be speaking.\n\nMeanwhile, journalist Mhlanga has now spent 60 days in pretrial detention for interviewing war veteran, Blessed Geza, seeking President Mnangagwas immediate ouster.\n\nHe was arrested after broadcasting the interview and accused of transmitting data messages that incite violence or damage to property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/26191811/Nick-Mangwana.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE’s government has brushed off criticism from British legislators threatening punitive measures over the continued detention of journalist Blessed Mhlanga, describing the pressure as emotional overreach that holds no weight domestically. Responding to Liberal Democrats peer Lord Jonny Oates demand for international consequences, Ministry of Information Permanent Secretary Nick Mangwana said emotional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-dismisses-uk-legislators-criticism-over-journalist-blessed-mhlangas-continued-detention/\">Zimbabwe dismisses UK legislators’ criticism over journalist Blessed Mhlanga’s continued detention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "Warriors midfielder Tawanda Maswanhise scoops Motherwell Goal of The Season accolade",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-tawanda-maswanhise-scoops-motherwell-goal-of-the-season-accolade/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Tawanda Maswanhise Saturday night received Motherwell Goal of The Season accolade at the clubs end of season awards.\n\nMaswanhises goal in the Scottish Premeir League against Rangers in a match that ended 2-2 on December 29, 2024, got the highest number of votes from the clubs fans ahead of all other goals scored at the club during the season.\n\nThe 22-year-old Zimbabwean international is enjoying life at Motherwell, as he managed to score five goals and assisted three from 27 matches in the just ended campaign.\n\nMaswanhise joined Motherwell in August coming from Leicester and has been a key player for the side.\n\nDuring the campaign he was voted clubs Player of The Month twice, making his debut season one of the best.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/24090858/Tawanda-Maswanhise.jpg",
            "description": "<p>By Sports Reporter  WARRIORS midfielder Tawanda Maswanhise Saturday night received Motherwell Goal of The Season accolade at the club’s end of season awards. Maswanhise’s goal in the Scottish Premeir League against Rangers in a match that ended 2-2 on December 29, 2024, got the highest number of votes from the club’s fans ahead of all</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-tawanda-maswanhise-scoops-motherwell-goal-of-the-season-accolade/\">Warriors midfielder Tawanda Maswanhise scoops Motherwell Goal of The Season accolade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "CAPS United finally win; Simba Bhora and MWOS share spoils",
            "url": "https://www.newzimbabwe.com/caps-united-finally-win-simba-bhora-and-mwos-share-spoils/",
            "content": "By Sports Reporter\n\nCAPS United ended its four-match winless run with an unconvincing 1-0 win over Yadah at Rufaro Stadium Saturday.\n\nThe Green Machine had to thank second half substitute Rodwell Chinyengete, who scored in the 80th minute to secure maximum points for his side.\n\nMakepekepes goal was a relief for the teams technical team, which was reportedly given an ultimatum to win two games, including this particular one.\n\nSaturdavs victory was CAPS Uniteds first win at Rufaro, their second of the season, a win at Green Fuel Arena against Triangle last month being the first one.\n\nWe had gone for a long time without maximum points and today unlike other games we managed to capitalize.\n\nWe are happy the boys gave their all, the amount of work and commitment on the pitch was excellent.\n\nAs a technical department our objective has always been the same, We still have a dream to catch up with top team and we will make sure we push the boys to do so, said CAPS United assistant coach Tonderai Marume after the match.\n\nMakepekepe win propelled them out of the relegation zone as they are now on position 14 with seven points, two ahead of bottom-placed Kwekwe United, which has five points.\n\nMeanwhile, league newcomers MWOS FC maintained their stay on top of the log after managing a nill all draw away at Wadzanayi Stadium against defending champions Simba Bhora.\n\nThe result saw MWOS extending its unbeaten run in the ongoing campaign to matchday nine at the same time registering its seventh clean sheet.\n\nPremierSoccer League Matchday 8 Results\n\nFriday\n\nHerentals 1-0 Green Fuel\n\nSaturdayYadah 0-1 CAPS UnitedSimba Bhora 0-0 MWOSManica Diamonds 1-1 Chicken InnTel One 1-1 HighlandersFC Platinum 1-1 TriangleZPC Kariba 0-0 ScottlandBikita Minerals 1-1 Ngezi PlatinumSundayDynamos vs Kwekwe United.\n\nSaturday\n\nYadah 0-1 CAPS United\n\nSimba Bhora 0-0 MWOS\n\nManica Diamonds 1-1 Chicken Inn\n\nTel One 1-1 Highlanders\n\nFC Platinum 1-1 Triangle\n\nZPC Kariba 0-0 Scottland\n\nBikita Minerals 1-1 Ngezi Platinum\n\nSunday\n\nDynamos vs Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/07190603/thumbnail_William-Manondo-right-celebrating-after-opening-the-scoring-for-Caps-United-at-the-National-Sports-Stadium-on-Friday.jpeg",
            "description": "<p>By Sports Reporter CAPS United ended its four-match winless run with an unconvincing 1-0 win over Yadah at Rufaro Stadium Saturday. The Green Machine had to thank second half substitute Rodwell Chinyengete, who scored in the 80th minute to secure maximum points for his side. Makepekepe’s goal was a relief for the team’s technical team,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caps-united-finally-win-simba-bhora-and-mwos-share-spoils/\">CAPS United finally win; Simba Bhora and MWOS share spoils</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        },
        {
            "title": "Andy Rinemhota’s Cardiff City relegated",
            "url": "https://www.newzimbabwe.com/andy-rinemhotas-cardiff-city-relegated/",
            "content": "By Sports Reporter\n\nANDY Rinemhotas Cardiff City was Saturday relegated from the English Championship League after playing a goalless draw against West Brom.\n\nCardiff became the first side to be relegated to the third tier and will only know the other two teams to join them on the final matchday next week.\n\nOf the 45 games that Rinemhotas side has played this season, they only managed to pick nine wins, losing 19 and drawing 17.\n\nThe Bluebirds relegation to English League One put Rinemhotas future at the club in jeopardy with his contract set to expire this June.\n\nAlthough the club is yet to speak on its plans for most players, especially the chop from the Championship, a lot of factors will be considered by Rinemhota if he is to stay.\n\nThe Zimbabwean international joined Cardiff in July 2022 on a three-year contract coming from Reading FC.\n\nRinemhota was one of the instrumental players for the Bluebirds this season, hence was nominated for the clubs Player of The Season gong.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29195506/Andy-Rinomhota-1.png",
            "description": "<p>By Sports Reporter ANDY Rinemhota’s Cardiff City was Saturday relegated from the English Championship League after playing a goalless draw against West Brom. Cardiff became the first side to be relegated to the third tier and will only know the other two teams to join them on the final matchday next week. Of the 45</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/andy-rinemhotas-cardiff-city-relegated/\">Andy Rinemhota’s Cardiff City relegated</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "27 Apr 2025"
        }
    ]
}