{
    "news": [
        {
            "title": "Why Zimbabweans rue plan to ditch US dollar?",
            "url": "https://www.newzimbabwe.com/why-zimbabweans-rue-plan-to-ditch-us-dollar/",
            "content": "The East African\n\nZimbabwes plans to drop the US dollar in five years is already causing jitters in an economy that has suffered nearly two decades of currency volatility and bouts of record hyperinflation.\n\nHarare has set 2030 as the target to stop using the US dollar, which has been the dominant foreign currency for the past 16 years, after it was forced to abandon its own.\n\nZimbabwe first announced on August 6, 2024 that its Cabinet had approved a roadmap to adopt the Zimbabwe Gold (ZiG) as the sole currency. The gold-backed ZiG was launched last year, the countrys sixth attempt at mooting a stable currency in 25 years.\n\nThe central bank concedes that businesses are nervous about the plan to return to a mono-currency regime, so much that banks are now avoiding long-term lending beyond that date.\n\nJohn Mushayavanhu, Reserve Bank of Zimbabwe (RBZ) governor, said he would announce a comprehensive de-dollarisation roadmap in November, in what is seen as a desperate attempt to calm nerves.\n\nDr Mushayavanhu said the roadmap would focus on the need to preserve foreign currency accounts and the existing US dollar-denominated contracts, with considerations made to ensure business continuity and certainty.\n\nThe central bank says it is working on modernising the ZiG banknotes with re-designing and producing improved banknotes to increase the acceptance of the new currency.The roadmap will undoubtedly encapsulate the need to maintain the current stability, preserve the foreign currency accounts and existing USD-dominated contracts, Dr Mushayavanhu said as he presented the 2025 mid-term monetary policy statement.\n\nConsideration will always be made to ensure that there is business continuity and certainty.The Confederation of Zimbabwe Industries (CZI), the countrys largest business grouping with membership from the manufacturing, trade, transport, information technology, education and professional services, said the success of the de-dollarisation strategy would hinge on controlling inflation.Low levels of inflation will help build trust in the currency, which might also encourage greater usage of ZiG in transactions, CZI said. This could also boost the likelihood of a gradual de-dollarisation process leading to a ZiG mono-currency regime by 2030. The high annual inflation level creates pricing uncertainty, making it difficult for businesses to set prices, forecast costs or even negotiate contracts.\n\nThe team advised the authorities to urgently introduce measures to increase demand for the ZiG and institute other reforms if the de-dollarisation plan is to succeed.The mission emphasised the need to continue strengthening the monetary and foreign currency market framework in line with IMF staff recommendations, said Wojciech Maliszewski, head of the IMF team.\n\nThis should be complemented by measures to enhance the demand for ZiG in the domestic economy- most notably, increasing the share of Treasurys operations (revenues and expenditures) in ZiG. To reduce any uncertainty weighing on financial intermediation, the authorities should provide more clarity on the implications of the transition plan, including clarifying that the use of a mono-currency will be limited to domestic transactions, allowing for bank deposits to remain dominated in both currencies.\n\nOver a year since the introduction of the ZiG, the country is still heavily reliant on the US dollar, with the central bank indicating that only 40 percent of transactions are in local currency.\n\nEconomic analysts say the new currency is being undermined by the same factors that thwarted previous efforts to re-establish a sole currency. These include a lack of confidence in the banking sector and the local economy, as well as the large scale of the unregulated informal economy, which according to the World Bank is the largest in the world.\n\nJohn Lagat, Imara Asset Management CEO, said the ZiG was destined for extinction just like the other currencies before it because it was being rendered irrelevant by the market.There is so little ZiG around  thanks to the very tight monetary policy  that it is easier simply to use US dollar cash or bank cards. We continue to believe that way too much time and energy is spent on dealing with and discussing the ZiG, despite its limited use, that it would be better simply to scrap it and move on, he said.\n\nHe added that the ZiG was largely used in Harare while in the southern parts of the country people favoured the South African rand.On our recent travels around, it would appear that the South African rand is the favoured currency in the southern parts of Zimbabwe, whilst the US dollar is king further north. Indeed, it is only in the capital Harare that the ZiG is used to any extent. The civil servants continue to receive part of their remuneration in ZiG, which they attempt to spend in the formal shops since the formal economy has no use for it.\n\nAccording to the IMF, only four out of 85 countries that were surveyed during the 1980 to 2001 period succeeded in de-dollarisation, which makes Zimbabwes attempt to return to a mono-currency regime an uphill task.\n\nZimbabwe started facing acute currency problems in 1997 when the local dollar crashed dramatically that year after Robert Mugabes regime paid unbudgeted pensions to former fighters of the countrys liberation struggle.\n\nThe crisis deepened when Zimbabwe sent troops to the Democratic Republic of Congo to protect Laurent Kabilas under siege regime.\n\nA chaotic land reform programme that began in the year 2000 proved to be the final nail on the coffin for the local currency as it led to the countrys international isolation and economic collapse.\n\nBy the time Mugabes government abandoned the Zimbabwe dollar in 2009 when the inflation rate peaked at 79.6 billion percent in mid-November. Hyperinflation only ended after the adoption of the US dollar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>The East African Zimbabwe’s plans to drop the US dollar in five years is already causing jitters in an economy that has suffered nearly two decades of currency volatility and bouts of record hyperinflation. Harare has set 2030 as the target to stop using the US dollar, which has been the dominant foreign currency for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-zimbabweans-rue-plan-to-ditch-us-dollar/\">Why Zimbabweans rue plan to ditch US dollar?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        },
        {
            "title": "Harare City Council threatens to evict Mbare flats residents",
            "url": "https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/",
            "content": "By Staff Reporter\n\nDESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in.\n\nHarare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted.\n\nIn a notice dated June 18 2025, the director of housing, Addmore Nhekairo gave the residents an ultimatum to settle the arrears the City Council is owed by the residents.\n\nPlease be advised that since you have ignored various reminders and notices to clear the outstanding rental arrears, you are hereby served with a final notice to pay the outstanding amount or vacate the property to avoid continuous prejudice to council.\n\nYou are advised to settle your obligations within 14 days from date of receipt of this final notice. Failure to pay monthly rentals is a serious breach of the agreement of lease which mandates City of Harare to evoke the conditions of lease and recover holding costs from the same.\n\nNotwithstanding the availability or none of the lease agreement, council shall not be prejudiced in its rights to recover holding costs from the lessee for breach of mutual understanding, read the notice.\n\nThe notice comes on the back of Harare City, on the drive to recover money it is being owed by tenants leasing their properties.\n\nHowever, in Mbare, Harare City is under pressure to renovate the flats which are becoming uninhabitable.\n\nLast year, the High Court ordered Harare City Council to renovate the flats to match decent living standards. The City fathers have appealed the judgement.\n\nIn an interview with NewZimbabwe.com, Combined Harare Residents Association (CHRA) director, Ruben Akili, said the deplorable living conditions have dissuaded tenants from paying their rentals.\n\nThese are the same flats which we had a court order for renovations. As you are aware all the flats in Mbare were supposed to be renovated. The situation in Mbare is unacceptable sewer is gushing all over and many things are just happening and many things are happening.\n\nFrom CHRAs perspective is that some residents are paying and some are not paying. Local Authority should address the fundamental problems that speaks to the reasons why residents are not paying, said Akili.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Staff Reporter DESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in. Harare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/\">Harare City Council threatens to evict Mbare flats residents </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        },
        {
            "title": "Govt seizes over 4,000 units of fake goods, prosecutes 419 businesses in nationwide smuggling crackdown",
            "url": "https://www.newzimbabwe.com/govt-seizes-over-4000-units-of-fake-goods-prosecutes-419-businesses-in-nationwide-smuggling-crackdown/",
            "content": "By Thandiwe Garusa\n\nA total of 3,779 businesses have been inspected nationwide, resulting in 419 prosecutions and the seizure of more than4,000 substandard products, as authorities intensify a crackdown on smuggling and consumer rights violations.\n\nThe Ministry of Industry and Commerce says it has been carrying out surprise inspections on businesses and prosecuting offenders for selling counterfeit goods, underweight products, using multi-tier pricing, and other unfair practices.\n\nRecently, the ministrys officials, together with the Standards Association of Zimbabwe (AZ) conducted a survey which revealed that nearly 50% of groceries being sold from tuck shops and vending stalls are fake and potentially hazardous to health.\n\nIn a statement on Wednesday, the Ministry of Commerce and Industry said over 3,000 businesses have been inspected nationwide and over 400 have been prosecuted in order to protect consumers and promote fair trade.\n\nA nationwide crackdown on smuggling is underway and it involves impromptu inspections on businesses to ensure compliance with regulations.\n\nOffenders who exploit consumers through unfair practices including; selling counterfeit products, delivering underweight goods, imposing multi-tier pricing schemes, and using inadequate labelling, among other deceptive dealings, are being prosecuted.\n\nThe Ministry is pleased to inform the public that to date, a cumulative total of 3779 businesses have been inspected with 419 prosecutions finalised. A total of 402 compliance notices have been issued and 4,816 units of various substandard products were seized, the statement reads.\n\nThe ministry also warned businesses against violating the Consumer Protection Act (2019), which is administered to protect consumers and ensure that businesses adhere to fair and ethical practices.\n\nMeanwhile, due to economic hardships, most citizens buy groceries from tuck shops where they are cheaper compared to supermarkets.\n\nSome of these products are smuggled from neighbouring countries, South Africa and Zambia, while some are being illegally produced locally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26164728/tuckshop.gif",
            "description": "<p>By Thandiwe Garusa A total of 3,779 businesses have been inspected nationwide, resulting in 419 prosecutions and the seizure of more than 4,000 substandard products, as authorities intensify a crackdown on smuggling and consumer rights violations. The Ministry of Industry and Commerce says it has been carrying out surprise inspections on businesses and prosecuting offenders for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-seizes-over-4000-units-of-fake-goods-prosecutes-419-businesses-in-nationwide-smuggling-crackdown/\">Govt seizes over 4,000 units of fake goods, prosecutes 419 businesses in nationwide smuggling crackdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        },
        {
            "title": "When Governance Fails, People Die – Who Should Be Held Accountable?",
            "url": "https://www.newzimbabwe.com/when-governance-fails-people-die-who-should-be-held-accountable/",
            "content": "By Dr Richard Dune\n\nResuscitation mistakes are not just clinical errors  they are leadership failures that demand urgent action\n\nAction should be taken.  Coroner Darren Stewart OBE\n\nThe tragic death of 74-year-old Kathleen Gregory at Beccles Care Home should haunt every health and social care leader in the UK. She choked on her lunch and was not resuscitated  the attending paramedic wrongly assumed she was not for resuscitation after misreading her ReSPECT form.\n\nThe coroners Prevention of Future Deaths Report makes it plain: unless leaders fix the governance failures that led to this, more people will die unnecessarily.\n\nWeve been here before. During COVID-19, some providers issued blanket Do Not Attempt Cardiopulmonary Resuscitation (DNACPR) notices without consulting patients or families. Investigations revealed:\n\nDecisions made withoutMental Capacity Actcompliance\n\nStaff assuming all care home residents were DNACPR\n\nPoor understanding of DNACPR and ReSPECT in real emergencies.\n\nThese are not isolated oversights  they are systemic governance failures.\n\nIt is fashionable for executives and boards to talk about lessons learned after tragedies. But heres the truth: if your governance system fails, its not just the frontline staff at fault  its you.\n\nLeaders control:\n\nWhether policies and procedures are current and accessible\n\nWhether statutory and mandatory training is scenario-based and relevant\n\nWhether staff have real-time access to secure document repositories for emergency care plans\n\nWhether digital compliance systems and Learning Management Systems (LMS) track workforce competence.\n\nIf these are missing, its a leadership choice, not an accident.\n\nTheMental Capacity Act 2005,Human Rights Act 1998,Equality Act 2010, and CQC Regulations are not guidelines  they are legal obligations. Failure to meet them risks breaching human rights as well as professional and organisational reputations.\n\nIf someone in your care dies tomorrow due to a DNACPR or resuscitation error:\n\nCan you prove your governance framework was watertight?\n\nCan you show your policies were up to date, accessible, and audited?\n\nCan you evidence that your staff were trained, competent, and supported?\n\nIf the answer is no, then the gap is not just operational  its moral.\n\nModern regulatory compliance software can integrate:\n\nSecure policy storage with version control\n\nLMSand Training Management System (TMS) functions to ensurestatutory and mandatory trainingis completed and tracked\n\nAudit dashboards to identify risks before they become tragedies.\n\nIf leaders still rely on paper and memory systems in 2025, they are gambling with lives.\n\nWe can no longer pretend that fatal mistakes like those in the Beccles case are just human error. They are the predictable result of leadership and governance gaps.\n\nIn health and social care, accountability starts at the top.\n\nIf leaders dont enforce compliance, invest in training, and deploy the right systems, they are complicit in the failures that follow.\n\nThe sector doesnt need more apologies  it needs boardrooms that act before the coroner does.\n\nAs Founder & CEO of The Mandatory Training Group, I led the development of ComplyPlus, our regulatory compliance management software designed to stop governance failures before they happen.\n\nLearn howComplyPluscan help your organisation centralise policies, track training, and make the right decisions under pressure.\n\nOriginally published onThe Mandatory Training Groupwebsite.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13171051/When-Governance-Fails-People-Die-Who-Should-Be-Held-Accountable-ComplyPlus%E2%84%A2-Dr-Richard-Dune-.jpg",
            "description": "<p>By Dr Richard Dune Resuscitation mistakes are not just clinical errors – they are leadership failures that demand urgent action “Action should be taken.” – Coroner Darren Stewart OBE The tragic death of 74-year-old Kathleen Gregory at Beccles Care Home should haunt every health and social care leader in the UK. She choked on her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/when-governance-fails-people-die-who-should-be-held-accountable/\">When Governance Fails, People Die – Who Should Be Held Accountable?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        },
        {
            "title": "33 million women grow food on plots in sub-Saharan Africa. Greener farming can boost their earnings – study",
            "url": "https://www.newzimbabwe.com/33-million-women-grow-food-on-plots-in-sub-saharan-africa-greener-farming-can-boost-their-earnings-study/",
            "content": "Lesley Hope| The Conversation\n\nThere are33 million smallholder farmersin sub-Saharan Africa, making up 80% of the total farmer population. These farmers cultivate small plots of land of less than two hectares and dont make much money, as they generally sell their produce in local markets. They usually lack the funds needed to process their crops into a product that could sell for a higher price, and they struggle to get into supply chains where they could sell for higher prices. Agricultural economist Lesley Hopehas researched what is neededfor women smallholder farmers to switch toagroecology environmentally friendly farming that works with nature  and develop thriving businesses at the same time.\n\nWomen make upover halfof sub-Saharan Africas 33 million smallholder farmers. They dont just grow crops  they also work in agroprocessing (making crops into other products) and marketing. Women farmers generally havedeep-rooted knowledgeof local ecosystems, traditional farming and ways to grow and store seeds. However, theycannot easily accessproductive resources such as land, agricultural equipment or finance.\n\nThis is why a set of farming practices that use natural inputs at a lower cost can help women smallholder farmers to build more productive farms. For example, agroecology involves environmentally friendly practices that include:\n\nAgroecology also supports local markets and a shorter chain for food from the farm to the table. In this way it reduces peoples dependency on buying food at prices that are influenced by the global market. It also means that smallholder farmers do not rely on the global market for purchase of fertilisers and pesticides for their production activities.\n\nAnother advantage of using agroecology is that livestock, fruit trees and several different crops can be farmed at the same time. This means farmers do not need to buy nearly as much as they can often grow enough to feed their families. A diverse food systemalso copes betterwith climate change.\n\nAgroecology also offers women the opportunity to create:\n\nAgroecology already falls in line with women farmers practice of backyard farming. It encourages women to use that expertise to feed their families a wider variety of foods and sell the surplus.\n\nAgroecology is practised all over Africa. In east Africa (Uganda, Tanzania)women-led cooperativesgrow organic coffee.\n\nFor example, organic farming practices based on traditional knowledge are common inKenya and other parts of east Africa. In southern Ethiopia, Burkina Faso, Senegal, Ghana and Niger,agroforestryis widely practised.\n\nSmallholder farmers in Zimbabwe and Zambia practiseconservation agriculture, an environmentally friendly farming approach that improves and maintains soil health and productivity by not disturbing or digging the soil, and by sowing a layer of different permanent cover crops.\n\nIn Cameroon, integrated pest management strategies likebiopesticidesand pest-resistant crop varieties are common. Biopesticides are types of pesticides made from natural extracts. They are environmentally friendly and have no negative impact.\n\nIn Senegal, women agroecologists have become influential and able to attract funding to improve their farms. Women inMali and Ghanaproduce bioenergy and seeds fromJatropha curcas, a plant that treats infections and muscle pain.\n\nAgroecology is also practised in South Africa, where women smallholder farmersplant trees with cropsto reduce water pollution.\n\nDespite this, many women smallholder farmers are stillseen as farmers wives, rather than farmers in their own right, and dont get the support they should.\n\nFirst, as this years president of theGroup of 20 most powerful nations, South Africa could use its position to influence policies that support the transition to agroecology. These include investing in agroecological markets, supporting womens businesses, and protecting womens rights through giving them more access to productive resources.\n\nAgroecology is a must in the current era where climate change makes it difficult to grow enough food for everyone. Given that many African women are already involved in agriculture, it makes sense for them to lead the move to agroecology.\n\nThese steps need to be taken:\n\n(1) Women farmers need to be connected to customers. Dedicated agroecological market infrastructure must be set up where women farmers can sell their crops. This can include markets for cooperatives and digital platforms that are designed around women farmers needs.\n\n(2) Once theyre connected to the market, the women farmers must get support to successfully compete with other businesses. Philanthropies and development agencies can support community-based and gender-sensitive processing hubs such as millers, driers and organic packaging. These are critical to support the women farmers to fully transition to agroecology.\n\n(3) Produce needs to becertified as organicwith an agroecological product label. This increases the markets that women smallholder farmers can sell to, and builds consumer trust. Organic certification projects can be set up by the government, philanthropic organisations, development agencies, non-governmental organisation and other groups interested in empowering women smallholder farmers through agroecology.\n\nLesley Hope\n\nLecturer: Department of Agricultural and Resource Economics, School of Agriculture and Technology, University of Energy and Natural Resources\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13161719/Screenshot-2025-08-13-at-17.16.41.png",
            "description": "<p>Lesley Hope | The Conversation There are 33 million smallholder farmers in sub-Saharan Africa, making up 80% of the total farmer population. These farmers cultivate small plots of land of less than two hectares and don’t make much money, as they generally sell their produce in local markets. They usually lack the funds needed to process their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/33-million-women-grow-food-on-plots-in-sub-saharan-africa-greener-farming-can-boost-their-earnings-study/\">33 million women grow food on plots in sub-Saharan Africa. Greener farming can boost their earnings – study</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        },
        {
            "title": "Premier Minerals says Zulu Project impressive",
            "url": "https://www.newzimbabwe.com/premier-minerals-says-zulu-project-impressive/",
            "content": "By Alois Vinga\n\nAIM-listed concern, Premier African Minerals, says the progress noted so far at Zulu Lithium Mine is quite impressive, noting positive indications at hand.\n\nThe company is currently undertaking a mining venture in Western Zimbabwe, with the second phase of a plant test run underway at its Lithium and Tantalum project in the Same Region.\n\nIn a statement, the concern expressed gratitude over the latest developments as well as input from the recently appointed MD.We continue to deal with optimisation and commissioning issues as would normally be expected and continue to see promising results with each step forward.The knowledge and information being accumulated and the assistance and input from a very senior OEM team and our newly appointed Managing Director, Graham Hill, is all expected to combine in supporting this process underway at present, said the company.\n\nPremier said the test run is designed to ensure that the plant meets the required spodumene specifications. The company anticipates the plant to reach a sustained steady-state of operation, enabling Zulu to target overall plant availability of 22 days per month, as was originally projected as the required availability to meet target production levels.\n\nDuring the next seven days, we expect to be able to take a final decision on how soon, if at all, the purchase of the secondary spodumene float section should proceed, said Premier.\n\nAt the same time, plans are progressing with the two remaining plant issues requiring longer-term solutions, the replacement of the original OEM-supplied sorters that are not fit for purpose and completion of the tantalum recovery circuit. In regard to the tantalum circuit, we have had interest from several parties seeking to purchase tantalum and potentially assisting with the cost of the circuit.\n\nPremier has struggled to keep its spodumene production plant operating optimally since it set it up some two years ago.\n\nAs a result, it missed the target to make the first spodumene shipment to Chinese offtaker, Canmax Technologies (Canmax), by March 2023.\n\nThree months later, it declared force majeure, but Canmax contested the declaration and demanded repayment of the $35mn it provided to Premier to build the processing plant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16124629/Premier-African-Minerals-Zimbabwe.jpeg",
            "description": "<p>By Alois Vinga AIM-listed concern, Premier African Minerals, says the progress noted so far at Zulu Lithium Mine is quite impressive, noting positive indications at hand. The company is currently undertaking a mining venture in Western Zimbabwe, with the second phase of a plant test run underway at its Lithium and Tantalum project in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/premier-minerals-says-zulu-project-impressive/\">Premier Minerals says Zulu Project impressive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        },
        {
            "title": "Grammy-winning Afropop star Tems: ‘Women are not respected in the industry’",
            "url": "https://www.newzimbabwe.com/grammy-winning-afropop-star-tems-women-are-not-respected-in-the-industry/",
            "content": "BBC\n\nNigerian Afropop star Tems has told the BBC people dont really respect women in her industry.\n\nThe two-time Grammy award-winner told the BBC that at the start of her career, she struggled to be taken seriously.\n\nI realised that theres always a cost. Theres always a price that you pay. And a lot of those prices I wasnt willing to pay and there wasnt a lot of options, Tems said.\n\nAfropop has gained immense global popularity over the past decade, but despite this growth it remains notoriously male-dominated.\n\nThe industrys so-called Big Three  Burna Boy, Davido and Wizkid  are all male  while their female counterparts, such asTiwa SavageandYemi Alade, have spoken out about the barriers they face because of their gender.\n\nEarlier this year, Tems hit out following negative comments about her body, which were made online after a video of her performing was posted onto X.\n\nShe wrote on the social media platform: Its just a body, I will add and lose weight. I never once hid my body, I just didnt feel the need to prove or disprove anyone. The more you dont like my body the better for me actually.\n\nTems told the BBC she wants to change the way women see themselves in music, and hopes to achieve this through her new platform, The Leading Vibe Initiative.\n\nThe project aims to provide opportunities for young women throughout Africas music industries.\n\nI promised myself that if I get to a place where I can do more, I will make this initiative for women like me and maybe make it easier for women to access platforms and access a wider audience and success, Tems said.\n\nThe initiative kicked off on Friday in Tems hometown, Lagos. Vocalists, songwriters and producers were invited to a series of workshops, masterclasses and panel discussions, all with the aim of developing skills and connections.\n\nAsked what advice she would give to young women wanting to crack the industry, she said: I think its important to have an idea of what you want for yourself, what your brand is, whats your boundary.\n\nWhat are the things that you wouldnt do for fame and the things that you would do?\n\nTems, who has scored hits with the likes ofLove Me JejeandFree Mind, said anyone trying to break into the industry must be passionate about their craft.\n\nIts not everybody that sings that loves music. If I wasnt famous, I would still be doing music. I would be in some kind of jazz club randomly on a Friday night, she said.\n\nBut this is far from Tems reality. Five years on from her debut EP, she has collaborated with the likes of Beyonc and Rihanna, racked up more than 17m monthly listeners on Spotify and headlined international festivals.\n\nAnd next month, she will be supporting British band Coldplay during their sold-out run of gigs at the UKs Wembley Stadium.\n\nTems puts her success down to being authentic and audacious.\n\nEven when people tell you to change your sound, change your style, you look at them and you say: No. If it meant me not being signed, I was okay not being signed. I went to a couple of places that didnt sign me and I was okay with that, she said.\n\nMusic is not Tems only passion  she is an avid football fan and recently became part-owner of US football club San Diego FC.\n\nI never imagined myself owning or being in an ownership of any football team, she said, adding that her brother initially got her into the sport.\n\nTems joined San Diegos ownership with Pave Investments, a West African private investment firm which also helped raise funds for theNBA-linked African Basketball League.\n\nTems involvement with San Diego gives her hope that people can be bold enough to try things that nobody ever thought was possible.\n\nShe said: I dont see myself as just a singer, just a musician, just an artist. Im much more than that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13091413/tems.webp",
            "description": "<p>BBC Nigerian Afropop star Tems has told the BBC “people don’t really respect women” in her industry. The two-time Grammy award-winner told the BBC that at the start of her career, she struggled to be taken seriously. “I realised that there’s always a cost. There’s always a price that you pay. And a lot of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/grammy-winning-afropop-star-tems-women-are-not-respected-in-the-industry/\">Grammy-winning Afropop star Tems: ‘Women are not respected in the industry’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "14 Aug 2025"
        }
    ]
}