{
    "news": [
        {
            "title": "South Africa’s top diplomat in France found dead near Paris hotel",
            "url": "https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/",
            "content": "BBC\n\nSouth Africas ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC.\n\nMthethwa, 58, was reported missing by his wife on Monday evening, after a worrying message from him, the Paris prosecutors office said.\n\nHe had booked a room on the 22nd floor of the high-rise hotel, whose security window was forced open, it added.\n\nThe circumstances around his death are unclear at this stage, and an investigation has been opened, the Paris prosecutors office said, adding that a duty magistrate was going to the scene.\n\nMthethwa was a high-ranking member of the African National Congress, the party that brought in democratic rule in 1994 with Nelson Mandela as South Africas first black president.\n\nHe had been serving as South Africas ambassador to Paris since December 2023, and had previously been in government as police minister and also arts and culture minister.\n\nHe was a close ally of former President Jacob Zuma and was implicated in what is known in South Africa as the state capture inquiry, which looked into allegations of high-level corruption during Zumas presidency.\n\nIn a statement, South Africas Foreign Minister Ronald Lamola hailed Mthethwa as a distinguished servant of the nation.\n\nI have no doubt that his passing is not only a national loss but is also felt within the international diplomatic community, he added.\n\nLamola confirmed that the circumstances around Mthethwas death were being investigated by the French authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30181743/nathi-mtetwa.webp",
            "description": "<p>BBC South Africa’s ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC. Mthethwa, 58, was reported missing by his wife on Monday evening, after a “worrying message from him”, the Paris prosecutor’s office said. He had booked a room on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/\">South Africa’s top diplomat in France found dead near Paris hotel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Diaspora Insurance partners global firm Homeland International in groundbreaking move",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-partners-global-firm-homeland-international-in-groundbreaking-move/",
            "content": "By Staff Reporter\n\nDiaspora Insurancehas entered into a strategic partnership with global repatriation services company Homeland International to launch a new insurance product tailored for Africans living abroad.\n\nThe Homeland International Diaspora Funeral Cash Plan (HIDFCP) has been developed to provide financial assistance to Africans in the diaspora during bereavement, addressing the limitations of traditional travel insurance and funeral plans, which often fail to cover the full costs of repatriation and tend to carry high monthly premiums.\n\nEdwin Tsvere, Channels Director forDiaspora Insurance, hailed the collaboration, describing it as a major step forward in serving the African diaspora community.\n\nI believe this collaboration with Homeland International is highly beneficial and effectively addresses the needs of the African diaspora community. The seamless integration of services from both companies provides much-needed peace of mind and support during difficult times.\n\nThe commitment to understanding and serving the specific requirements of Africans living abroad, while ensuring their final wishes are respected in their homeland, is truly commendable. This partnership exemplifies excellent customer focus and operational efficiency, making a significant positive impact on those it serves, said Tsvere.\n\nThe HIDFCP stands out for its early release of funds upon proof of death, disbursed in a currency of choice. The service will cover more than 20 African nationalities residing in the United Kingdom, the European Union, Middle East, the United States, Australia, Canada, and other regions.\n\nSamuel Tester, Homeland International Operations Director\n\nSamuel Tester, Operations Director at Homeland International, also expressed delight in the partnership.\n\nWe are proud to partner with Diaspora Insurance to bring this essential product to the African diaspora, said Tester.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30132849/Dr-Edwin-Tsvere-Channels-Director.png",
            "description": "<p>By Staff Reporter Diaspora Insurance has entered into a strategic partnership with global repatriation services company Homeland International to launch a new insurance product tailored for Africans living abroad. The Homeland International Diaspora Funeral Cash Plan (HIDFCP) has been developed to provide financial assistance to Africans in the diaspora during bereavement, addressing the limitations of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-partners-global-firm-homeland-international-in-groundbreaking-move/\">Diaspora Insurance partners global firm Homeland International in groundbreaking move</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Boost your affiliate success with 1win: automation, tools & smart strategies",
            "url": "https://www.newzimbabwe.com/boost-your-affiliate-success-with-1win-automation-tools-smart-strategies/",
            "content": "In todays competitive affiliate landscape, efficiency is everything. The 1win Affiliate platform has positioned itself as a forward-thinking solution for partners who want to save time and maximize results. By embracing automation tools and simplified dashboards, affiliates can manage campaigns more easily, track performance in real time, and focus on creative growth instead of manual work. This modern approach makes it possible to scale quickly without sacrificing quality.\n\nFor new partners wonderinghow to get the 1win affiliate program, the process is designed to be straightforward and transparent. Signing up takes only a few steps, after which users gain access to a wide range of built-in automation features. These tools reduce repetitive tasks and offer insights that help affiliates improve targeting, conversion rates, and retention, creating a strong foundation for long-term success.\n\nAnother advantage of the 1win Affiliate platform lies in its collection of tools designed to streamline communication and reporting. Automated alerts, detailed analytics, and customizable dashboards allow partners to stay informed at every stage of their campaigns. This level of clarity not only saves time but also improves decision-making, ensuring that strategies are based on accurate data rather than guesswork.\n\nFinally, the platform supports affiliates with helpful tips and best practices to maximize results. From built-in resources to personalized guidance, 1win Affiliate encourages partners to use data creatively and test new ideas with confidence. This balance of automation and support gives marketers the freedom to innovate while keeping their operations organized and efficient.\n\nModern affiliate marketing thrives on technology, and 1win Affiliate takes this seriously by offering a diverse ecosystem of tools built to simplify everyday tasks. From automated bots to advanced redirection systems, these technologies allow partners to manage multiple campaigns with precision. By combining smart tracking with seamless integration, affiliates can see exactly where their traffic comes from, how it performs, and where improvements are needed.\n\nThe backbone of this system lies in its ability to collect and process data in real time. Rather than relying on outdated reports, affiliates gain instant access to performance insights. This empowers them to react quickly to market shifts, optimize campaigns on the fly, and secure higher conversion rates. With such capabilities, bots, trackers, and redirects become more than just toolstheyre strategic assets that enhance decision-making.\n\nBeyond these tools, 1win Affiliate also focuses on making setup and configuration as user-friendly as possible. Even those new to affiliate marketing can quickly grasp the essentials of each feature. This simplicity reduces the learning curve while still maintaining the depth needed by advanced marketers who require granular control.\n\nFinally, the combination of these technologies creates an environment where affiliates can innovate rather than simply manage. With bots automating tasks, trackers delivering insights, and redirects guiding traffic efficiently, partners have the flexibility to test new strategies, scale campaigns, and ultimately earn more. This holistic approach ensures every tool contributes directly to measurable growth.\n\nRunning affiliate campaigns can quickly become overwhelming when repetitive tasks dominate your schedule. In the 1win Affiliate platform, the focus is on minimizing routine and freeing up time for strategic planning. By implementing automation, smart analytics, and centralized tools, partners can streamline operations and concentrate on activities that actually drive revenue. This shift not only reduces manual labor but also lowers the risk of errors and missed opportunities.\n\nEfficiency also comes from clarity. When affiliates can see all their data, communications, and campaign statuses in one place, they gain the ability to act decisively. The platforms design brings together reporting, traffic management, and optimization features, ensuring partners spend less time navigating between tools and more time fine-tuning their campaigns. Below is a clear breakdown of how different methods inside 1win Affiliate help cut routine and increase efficiency:\n\nThis table illustrates the practical tools and techniques that move affiliates away from manual workflows. Each feature is designed to handle a specific operational pain point, from reporting to link management, freeing up hours that can be reallocated to testing and innovation.\n\nMoreover, by combining these methods, affiliates create a self-reinforcing cycle of improvement. Less time spent on routine means more capacity to analyze trends, improve content, and experiment with new acquisition channels. This proactive mindset is crucial for staying ahead of competitors and sustaining growth over the long term.\n\nFinally, the focus on reducing routine is not just about convenienceits a strategy for building resilience. When the platform handles the repetitive groundwork, affiliates can devote their energy to high-level decisions that have a direct impact on profitability. In this way, 1win Affiliate transforms everyday work into a streamlined system built for progress.\n\nThe journey through 1win Affiliates automation tools, tracking systems, and efficiency boosters highlights a platform built for modern marketers. By combining advanced technologies with user-friendly interfaces, it empowers partners to save time, reduce routine tasks, and focus on higher-value strategies. This approach transforms affiliate marketing from a labor-heavy process into a streamlined, results-driven system.\n\nThrough the integration of bots, trackers, redirects, and real-time analytics, affiliates gain a comprehensive view of their campaigns. Instead of juggling multiple dashboards and manual reports, they can make faster, data-backed decisions. This clarity leads to improved performance, stronger conversions, and a clear path to scaling operations without sacrificing control.\n\nThe emphasis on reducing routine work also nurtures creativity. With automation handling the repetitive aspects, affiliates are free to experiment with new offers, refine their messaging, and explore innovative acquisition channels. This shift from maintenance to innovation ultimately builds long-term competitive advantages.\n\nLooking ahead, the success of any affiliate marketer depends on adaptability and efficiency. 1win Affiliate demonstrates how thoughtful technology, paired with actionable insights, can deliver both. By embracing these tools and practices, partners position themselves for sustained growth and a more profitable future in the dynamic affiliate marketing space.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30133511/Screenshot-2025-09-30-at-14.31.56.png",
            "description": "<p>Streamlining success with 1win affiliate automation In today’s competitive affiliate landscape, efficiency is everything. The 1win Affiliate platform has positioned itself as a forward-thinking solution for partners who want to save time and maximize results. By embracing automation tools and simplified dashboards, affiliates can manage campaigns more easily, track performance in real time, and focus</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boost-your-affiliate-success-with-1win-automation-tools-smart-strategies/\">Boost your affiliate success with 1win: automation, tools & smart strategies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Minister Marian Chombo escapes jail as High Court dismisses contempt case",
            "url": "https://www.newzimbabwe.com/minister-marian-chombo-escapes-jail-as-high-court-dismisses-contempt-case/",
            "content": "By Mary Taruvinga\n\nMashonaland West Provincial Affairs Minister and Zanu PF legislator Marian Chombo has been spared jail after the High Court struck down a contempt of court application against her.\n\nJustice Joel Mambara struck down the bid by Cubs Den Consolidated (Pvt) Ltd, which sought to have Chombo,the former wife of ex-Finance Minister Ignatius Chombo,together with businessman Tawoneyi Nyazema and Stephen Mutamba jailed for allegedly defying a court order to vacate leased commercial premises.\n\nThe judge ruled the application fatally defective, finding that the provisional order central to the dispute was never personally served on the respondents.\n\nOur courts have long insisted on strict compliance with the personal-service requirement in contempt proceedings, Justice Mambara said. Failure to serve an order affecting liberty personally renders the proceedings defective.\n\nThe court further noted that the Deputy Sheriff had not attempted to enforce the August 22 provisional order authorising eviction, meaning there was no evidence that Chombo and her co-respondents wilfully defied the court.\n\nIn fact, the applicants admit that no service took place, the judge said. Without proof of a breached obligation, no contempt can be found.\n\nThe urgent chamber application, filed by MD Hungwe Attorneys, was therefore struck off the roll with costs.\n\nChombo, who is also a Member of Parliament, was represented by Advocate Zikiti and T. Serengwa of the Civil Division.\n\nThe case stemmed from a dispute over commercial premises leased by Cubs Den Consolidated, which accused Chombo, Nyazema, and Mutamba of unlawfully occupying and interfering with its operations. Although the court issued a provisional order in August barring the trio from the property, the failure to serve and enforce that order ultimately undermined the contempt case.\n\nThe ruling comes as a relief for Chombo, who had faced the possibility of imprisonment if found guilty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/28050901/WhatsApp-Image-2023-11-28-at-07.01.46-e1701148160606.jpeg",
            "description": "<p>By Mary Taruvinga Mashonaland West Provincial Affairs Minister and Zanu PF legislator Marian Chombo has been spared jail after the High Court struck down a contempt of court application against her. Justice Joel Mambara struck down the bid by Cubs Den Consolidated (Pvt) Ltd, which sought to have Chombo, the former wife of ex-Finance Minister Ignatius</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-marian-chombo-escapes-jail-as-high-court-dismisses-contempt-case/\">Minister Marian Chombo escapes jail as High Court dismisses contempt case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Supreme Court revives US$455k farm feud appeal",
            "url": "https://www.newzimbabwe.com/supreme-court-revives-us455k-farm-feud-appeal/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has granted Fernicary Farm (T/A Rutendo Farm) a lifeline in its bitter multimillion-dollar dispute with Des Monies Farm (Pvt) Ltd, reinstating an appeal against a High Court order that awarded US$455,000 in compensation for farm improvements.\n\nJustice George Chiweshe, sitting in chambers, ruled that although Rutendo Farm had failed to meet procedural timelines, its case carried reasonable prospects of success, allowing the appeal to proceed.\n\nAlthough the delay in complying with the infringed rule is not inordinate, the explanation for such delay is not plausible. However, I am of the view that the intended appeal has reasonable prospects of success. It is for that reason that the application must succeed, Chiweshe said.\n\nThe case dates back to 2019, when Rutendo Farm leased its property to Des Monies Farm for a term of eight years, expiring in 2027. The lease collapsed amid disputes, leading to a Deed of Settlement in which the tenant agreed to vacate but would be compensated for improvements, including road repairs, fencing, water reticulation, irrigation maintenance and refurbishment of the main house.\n\nWhen compensation was not paid, Des Monies Farm sued, and in 2022 the High Courts Commercial Division ordered Rutendo Farm to pay US$455,000, dismissing claims it had not consented to the improvements. The court said the landlord had been kept informed and never objected.\n\nRutendo Farm appealed, arguing the improvements were never properly approved, no valuation report was produced, and some of the claimed amounts such as US$150,000 for bush clearance, were operational costs, not improvements. However, it missed deadlines in serving its notice of appeal, causing the case to be deemed abandoned until this latest ruling.\n\nThe High Court award of US$455,000, convertible to local currency at the interbank rate, remains in dispute. If Rutendo Farm succeeds on appeal, Des Monies Farm could lose its compensation for the contested farm developments.\n\nThe Supreme Courts ruling means the appeal will now be heard on its merits, setting the stage for a decisive judgment in this commercial farming dispute.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has granted Fernicary Farm (T/A Rutendo Farm) a lifeline in its bitter multimillion-dollar dispute with Des Monies Farm (Pvt) Ltd, reinstating an appeal against a High Court order that awarded US$455,000 in compensation for farm improvements. Justice George Chiweshe, sitting in chambers, ruled that although Rutendo Farm had failed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-revives-us455k-farm-feud-appeal/\">Supreme Court revives US$455k farm feud appeal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Kaitano Tembo appointed Assistant Coach, as Nees names Warriors squad for upcoming World Cup Qualifiers",
            "url": "https://www.newzimbabwe.com/kaitano-tembo-appointed-assistant-coach-as-nees-names-warriors-squad-for-upcoming-world-cup-qualifiers/",
            "content": "By Staff Reporter\n\nFormer SuperSport United and Sekhukhune United coach Kaitano Tembo has been appointed assistant coach of the Warriors.\n\nHis appointment was confirmed on Tuesday during the announcement of the Warriors squad for the upcoming FIFA World Cup qualifiers against South Africa and Rwanda.\n\nTembo, a Warriors legend who is currently unattached to any club, will begin his duties during the upcoming international break. His selection comes on the recommendation of head coach Michael Nees.\n\nMeanwhile, Scotland-based midfielder Khama Billiat has been recalled to the national team after missing the last round of international fixtures.\n\nIn other changes, Finland-based midfielder Prosper Padera and Greece-based striker Tino Kadewere were dropped from the squad.\n\nWarriors Squad for Upcoming International Fixtures:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/05145535/Kaitano-Tembo.png",
            "description": "<p>By Staff Reporter Former SuperSport United and Sekhukhune United coach Kaitano Tembo has been appointed assistant coach of the Warriors. His appointment was confirmed on Tuesday during the announcement of the Warriors squad for the upcoming FIFA World Cup qualifiers against South Africa and Rwanda. Tembo, a Warriors legend who is currently unattached to any</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaitano-tembo-appointed-assistant-coach-as-nees-names-warriors-squad-for-upcoming-world-cup-qualifiers/\">Kaitano Tembo appointed Assistant Coach, as Nees names Warriors squad for upcoming World Cup Qualifiers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "PSL slaps Yadah FC board member Muvadi with one-year ban, US$4,000 fine for assaulting goalkeeper",
            "url": "https://www.newzimbabwe.com/psl-slaps-yadah-fc-board-member-muvadi-with-one-year-ban-us4000-fine-for-assaulting-goalkeeper/",
            "content": "By Sports Reporter\n\nThe Premier Soccer League (PSL) has banned Yadah FC board member Spencer Muvadi after finding him guilty of assaulting the teams goalkeeper, Godknows Gurure.\n\nThe incident occurred on August 22 at The Heart Stadium following Yadahs 32 defeat to Ngezi Platinum Stars.\n\nAccording to sources, Muvadi accused Gurure of manipulating the outcome of the match, leading to the physical altercation.\n\nIn its ruling, the PSL disciplinary committee banned Muvadi from all top-flight football activities for one year and ordered him to pay a fine of US$4,000.\n\nMr Muvadi was found guilty of breaching the PSL Rules and Regulations, and the Committee has imposed a fine of US$4,000 (Four Thousand Dollars), together with the costs of the hearing.\n\nIn addition, Muvadi has been banned for a period of one year from conducting football business for Yadah FC or any other club participating in the Premier Soccer League, including holding any official position.\n\nHe was further barred from attending any matches under the jurisdiction of the Premier Soccer League for the same period, read part of the PSL statement.\n\nIn addition to Muvadis sanction, Yadah FC was also fined US$5,000 for contravening league regulations.\n\nYadah FC were also found guilty of contravening the PSL Rules and Regulations and were fined a sum of US$5,000 (Five Thousand Dollars), together with the costs of the hearing, which must be paid within fifteen days from the date of judgment, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30131941/spencer-muvadi-yadah.jpeg",
            "description": "<p>By Sports Reporter The Premier Soccer League (PSL) has banned Yadah FC board member Spencer Muvadi after finding him guilty of assaulting the team’s goalkeeper, Godknows Gurure. The incident occurred on August 22 at The Heart Stadium following Yadah’s 3–2 defeat to Ngezi Platinum Stars. According to sources, Muvadi accused Gurure of manipulating the outcome</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-slaps-yadah-fc-board-member-muvadi-with-one-year-ban-us4000-fine-for-assaulting-goalkeeper/\">PSL slaps Yadah FC board member Muvadi with one-year ban, US$4,000 fine for assaulting goalkeeper</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Wheelbarrows as ambulances, drink cans as scalpels: The desperation of giving birth in Epworth",
            "url": "https://www.newzimbabwe.com/wheelbarrows-as-ambulances-drink-cans-as-scalpels-the-desperation-of-giving-birth-in-epworth/",
            "content": "By Thandiwe Garusa\n\nAN empty drink can has become a makeshift surgical tool in the poverty-stricken community of Epworth where a traditional birth attendant, Tapiwa Vhinya, uses it to cut umbilical cords during home deliveries.\n\nWith no access to surgical blades, cord clamps, sterile strings or tapes, she improvises with whatever is at hand, tying cords with ordinary draw threads. It is a dangerous practice, yet one many women turn to because hospital births are beyond their reach.\n\nLocals call Vhinya (34) Ambuya Va52, a nickname she has earned from the 52 babies shehas deliveredin Epworth, a high-density suburb about 12 kilometres southeast of Zimbabwes capital, Harare, since she started in 2019.\n\nIn an interview with NewZimbabwe.com, the traditional birth attendant said she has delivered most of these children with her bare hands, as neither she nor the expectant mother have access to surgical gloves.\n\nWe live in a poor community where most people are unemployed and can barely afford to put food on the table, so most of these women are turned back home from the local (Epworth clinic) as they cannot afford it.\n\nI have delivered most of these babies, touching blood with my bare hands as I do not have access to gloves.\n\nI use empty drink cans to cut the umbilical cord and draw threads to tie the babys cord after cutting it and that is the biggest challenge I have been facing since I started, Vhinya said.\n\nVhinya does not have a proper delivery room for the home births she attends. Most of them take place outside, exposed to the elements. Despite the risks and the effort involved, she does not charge the mothers she helps. Instead, she receives small tokens of appreciation often just a bottle of milk and a bar of soap. According to tradition, the milk is used to wash her eyes, as it is believed failure to do so could eventually cause blindness, while the soap is meant for cleaning her clothes after the deliveries.\n\nEpworths traditional birth attendant Tapiwa Vhinya\n\nAt the local clinic, women are required to bring their own delivery supplies: ten pairs of gloves, surgical blades, cord clamps, linen savers, cotton, methylated spirit, and other essentials.\n\nIn addition, before admission, expectant mothers must pay a registration fee of US$45 for a normal delivery, along with an extra US$40 to cover the cost of an ambulance should complications require transfer to a larger hospital.Without the supplies or the fees, women are simply turned away.\n\nSeveral women who spoke to this publication said these steep costs and requirements are what force them into the hands of traditional midwives, despite the dangers of home deliveries.\n\nMary David (19), a young mother whose 11-month-old baby was delivered by Vhinya, recalled her ordeal:They wanted a lot of money that I did not have, I did not even have enough preparation for the child, even food to eat here at home so hospital delivery was not an option.\n\nCorruption and mistrust of nurses\n\nSome women who spoke to NewZimbabwe.com raised serious corruption allegations against nurses from the local hospital, saying they demand bribes for you to get help with ill treatment meted out to those who refuse to pay.\n\nRuvimbo Nyakawuru (27), who also had two of her babies with Vhinyas assistance, said she wanted to avoid ill treatment by nurses.\n\nRuvimbo Nyakawuru (27) had two of her babies with Vhinyas assistance.\n\nI gave birth to my first child in a hospital and after that experience, I vowed to never go back there again.\n\nIf you do not pay the nurse a little something for  a drink, even when you are in pain and require attention, they will ignore you and speak to you rudely, in my case, they even told me thatkana usingade kubhadhara hameno hako, mwana wacho ndewako akafa hameno(if you do not want to pay, we do not care, the child is yours).\n\nI saw women giving birth on their own whilst in hospital, Nyakawuru said.\n\nRuvimbo Nyakawuru (27), had two of her babies with Vhinyas assistance.\n\nNoster Chitiva (49) also weighed in, saying the women are treated according to how they look and how much they have paid.\n\nThe nurses treat their patients according to how you look, if you have given them some money for drinks and it is totally different for those who would have paid something.\n\nIf you do not have the money, you suffer, she added.\n\nThis has led to some women deliberately avoiding going to the clinic, even when they can afford it, citing ill treatment by nurses.\n\nFor Freddie Zenda (46), his wife was initially helped by Vhinya to deliver their second-born child as it was an emergency, but their decision to use her services for their third child was intentional.\n\nWhen my wife went into labour the first time, things were really tight and I did not have money for maternity registration at the clinic, so we settled for Ambuya Va52.\n\nHowever, for the second baby, we simply chose her because of the good care we had received the first time as compared to what we had to go through at the clinic during the birth of our first child.\n\nBirths in wheelbarrows\n\nTransport remains one of the biggest barriers for women seeking safe deliveries.\n\nIn some cases, expectant mothers in labour are pushed in wheelbarrows for as far as three kilometres because their families cannot afford to hire cars or ambulances.\n\nSamuel Chigwesa, a father of three, recalled how his wife went into emergency labour even after the family had managed to raise the hospital registration fee.I had managed to raise the required money for hospital delivery, however, my wife got into an emergency labour and I did not have time and money to hire a car and the available option was carrying her to the hospital in a wheelbarrow and she ended up giving birth as we were about to leave.\n\nMost people here cannot afford to hire a car and they end up having to be carried to the hospital in a wheelbarrow, which can take up to an hour, he said.\n\nThe clinic is about 3 kilometres away from Epworth Ward 1.\n\nChigwesa added that in many cases, women give birth on the way, unable to reach the hospital in time, making the journey both painful and dangerous for mothers and their newborns.\n\nMost of these women give birth before they even get to the hospital, Chigwesa added.\n\nWhile home deliveries are common in communities like Epworth, they often come with serious complications.\n\nVhinya said one of the most difficult cases she faced was delivering a baby who had long died inside the mothers womb, suspected to be due to high blood pressure.\n\nThe child came out in pieces; it had long died inside and turned black in colour. It was a scary experience.\n\nThe mother never went for antenatal visits at the hospital; she was just living like nothing was happening and these are some of the challenges we face, she said.\n\nIn another case, Vhinya described delivering a baby in an abnormal position, with one leg emerging first, a situation that would normally require an emergency caesarean section.\n\nIt was a very difficult childbirth, but we managed, she added.\n\nBesides the childbirth process, these women also struggle to obtain documentation for their babies.\n\nIf you give birth at home, getting to have a birth record or baby card will be the worst nightmare as the officials will give you a difficult time, another Epworth resident added.\n\nA child health card\n\nIsheanesu Chirisa, the Women and Law in Southern Africa (WLSA) National Director, said poor maternal healthcare in Zimbabwe requires government action to remove financial barriers, improve access, and integrate traditional birth attendants with skilled medical care.\n\nPoor maternal health care remains a huge stumbling block for most women in Zimbabwe, particularly in marginalised communities.\n\nTo ensure that women in marginalised communities like Epworth have access to safe maternal healthcare, strategies by the government should focus on removing financial barriers, improving health system accessibility, and adaptability, including investing in integrating traditional attendants with skilled healthcare, Chirisa said.\n\nThe situation in Epworth mirrors the reality of home births across many Zimbabwean communities, highlighting the broader crisis of access to healthcare as a fundamental human right.\n\nZimbabwes Constitution enshrines this right: Section 76 guarantees every citizen access to basic healthcare services, including reproductive health, while Section 81 provides special protection for children, affirming their entitlement to healthcare.\n\nBeyond its national laws, Zimbabwe is also bound by international commitments. As a signatory to treaties such as the International Covenant on Economic, Social and Cultural Rights (ICESCR) and the Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW), the state carries an obligation to ensure equitable, non-discriminatory access to maternal health services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29181947/Tapiwa-Vhinya-demonstrates-how-she-uses-a-draw-thread-and-empty-can-for-childbirth.png",
            "description": "<p>By Thandiwe Garusa AN empty drink can has become a makeshift surgical tool in the poverty-stricken community of Epworth where a traditional birth attendant, Tapiwa Vhinya, uses it to cut umbilical cords during home deliveries. With no access to surgical blades, cord clamps, sterile strings or tapes, she improvises with whatever is at hand, tying</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wheelbarrows-as-ambulances-drink-cans-as-scalpels-the-desperation-of-giving-birth-in-epworth/\">Wheelbarrows as ambulances, drink cans as scalpels: The desperation of giving birth in Epworth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        },
        {
            "title": "Intersex persons drag government to court in historic rights case",
            "url": "https://www.newzimbabwe.com/intersex-persons-drag-government-to-court-in-historic-rights-case/",
            "content": "By Mary Taruvinga\n\nFor the first time in Zimbabwes history, intersex persons have taken the government to court, demanding legal recognition of their rights and protection from decades of systemic exclusion.\n\nThe High Court application, filed under case number HCH4743/25, seeks a declaratory order compelling the state to officially recognise intersex people as a distinct category under Zimbabwean law.\n\nAmong their demands are the introduction of a third sex marker on birth certificates, IDs, and passports, procedures to amend sex markers on documents, and a ban on non-consensual, non-essential surgeries on intersex minors. They also want full access to rights such as dignity, education, healthcare, and equality under the Constitution.\n\nThe case has seven applicants, including two minors denied education and social services because their documents did not reflect their lived realities. One adult applicant was subjected to irreversible surgery as a child, leaving them with lifelong health complications and mismatched identity papers.\n\nThe minors are being represented by their legal guardians.\n\nThe Health Law and Policy Consortium (HLPC) and the Intersex Community of Zimbabwe (ICoZ) have also joined the case as institutional applicants. Cited as respondents are the Registrar-General, the Ministers of Home Affairs, Health, and Justice, and the Attorney General.\n\nIn his founding affidavit, Tinashe Mundawarara, HLPC board chairperson, argued that failure to issue accurate identity documents violates childrens constitutional rights.\n\nSection 81 (1)(c) specifically guarantees every child the right to a birth certificate, he said. By failing to ensure that intersex children are issued birth certificates that reflect their unique biological reality, the respondents deny them a fundamental right and create barriers to accessing essential services such as healthcare and education.\n\nHLPC programs coordinator Dorcas Chitiyo added: This case seeks to address the systematic legal and administrative failures that have perpetuated exclusion, discrimination and harm against intersex persons in Zimbabwe.\n\nICoZ director Kudakwashe Murisa said intersex people have endured silence and invisibility for too long.\n\nThis case is historic. For the first time, the Zimbabwean legal system is being challenged to recognise the rights of intersex individuals as equal human beings under the Constitution, they said.\n\nMurisa stressed that the matter goes beyond individual struggles.\n\nThis case is not just about one individual. It is about an entire community that has been made invisible for too long. It is about ensuring that no intersex child will endure what so many others have suffered in silence.\n\nAs an intersex person, Murisa described the personal toll of mismatched documents: Being intersex, I have to explain myself each time I want to use my identity documents. This is because they dont match with the sex I was assigned at birth.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29182429/INTERSEX.png",
            "description": "<p>By Mary Taruvinga For the first time in Zimbabwe’s history, intersex persons have taken the government to court, demanding legal recognition of their rights and “protection from decades of systemic exclusion.” The High Court application, filed under case number HCH4743/25, seeks a declaratory order compelling the state to officially recognise intersex people as a distinct</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/intersex-persons-drag-government-to-court-in-historic-rights-case/\">Intersex persons drag government to court in historic rights case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 Sep 2025"
        }
    ]
}