{
    "news": [
        {
            "title": "‘We are a passionately multiracial team’: Zimbabwe return to England transformed",
            "url": "https://www.newzimbabwe.com/we-are-a-passionately-multiracial-team-zimbabwe-return-to-england-transformed/",
            "content": "The Guardian\n\nTwenty-two years is a long time, even in a sport that measures its games in days and its history in centuries. The last time England played a Test match against Zimbabwe, in 2003, Rob Key was in the middle order instead of the managing directors job, Jimmy Anderson was a 20-year-old tearaway playing in his very first series, and the England and WalesCricketBoard was just about to launch the worlds very first professional Twenty20 tournament. Zimbabwean cricket has changed, too. Back then the team was in the earliest stages of a transformation that was meant to turn cricket from a minority game, played by the small white population, into a sport that better represented the whole country.\n\nThey have been hard years, riven by player strikes, political interference, maladministration and a miserable drop-off in results. The team temporarily withdrew from Test cricket, suspended their domestic competition and were repeatedly censured by the International Cricket Council. They lost so many players through emigration to England, Australia, South Africa and New Zealand, that even now you could build a hell of a good Zimbabwean squad out of people who are making a living overseas. And yet, at the end of it all, the process was, by one important measure, a success. The squad that came on tour in 2003 was majority white, the team that has come this year is majority black.\n\nDespite all the politics, despite all the chaos that weve been through, cricket is now a national game, says David Coltart, supported by an overwhelming majority of Zimbabweans, black and white and other races. Coltart is the elected mayor of Bulawayo, a white man elected in a mostly black city. He has spent his life navigating the bitter, heated, complicated politics of his country. He has been fighting for the Zimbabwe he believes in ever since the 1990s, first as a founding member of the Movement for Democratic Change and a key figure in the opposition to Robert Mugabe, then as minister for education and sport in Morgan Tsvangirais coalition government.\n\nMore than five million people have emigrated from the country in that time. Coltart is one of the ones who stayed. I believe in Zimbabwe with a passion, he says, I believe in its people and its future, and I believe it is a country worth fighting for.\n\nWhen Andy Flower and Henry Olonga made their public protest against the death of democracy in their country in 2003, it was Coltart they asked to help draft their statement. My sadness is that Henry and Andy didnt stay in the country, he says, because they remain hugely influential figures. Its not a criticism. I understand why they felt compelled to leave. But we need figures like them. He mourns Heath Streak, who did stay, butwho died in 2023. Heath provided inspiration to people on both sides of the argument. He was a white man who was fluent in Ndebele, and who attracted a lot of sympathy and affection from a lot of black people, and yet he remained an inspirational people for white farmers whod been dispossessed of their land.\n\nFor Coltart, the Zimbabwean team is emblematic of the society it represents. We punch above our weight. Which is why he believes transformation had to happen.\n\nIt was very necessary, Coltart says. Cricket in Zimbabwe 30 years ago was a minority sport. If you just looked at the crowds they were, relatively speaking, very few black people in them. Even aside from the principle of the matter, that situation was completely unsustainable. He just wishes it had been done differently. He makes a comparison with the redistribution of land, and the violent farm takeovers which were the cause of so much pain, grief and injustice in the 2000s. The land holdings were unjust, he says, But we could have done it without violence. Now, there wasnt violence in cricket, but I think that when you look at the dreadful collapse of cricket in 2004, that could have been avoided.\n\nWhen Zimbabwe stopped playing Test cricket, Coltart helped lead the campaign to restore it. In government he spent a lot of time lobbying the English to start playing fixtures against his country again. The ECB turned its back on the country, even after the end of the Mugabe regime. It was only when Richard Gould took over as the chief executive of the ECB that things finally changed. They disregarded us and while I understand the reasons, Ive never felt that England should not be playing Zimbabwe, Coltart says. Although Im a strident critic of the Zimbabwean regime, Ive always believed in the power of sport to bridge divides.\n\nEven now, he would be against a boycott of Afghan cricket on similar grounds. Because if the players and the board members themselves are trying to do the right thing but are being constrained by the government, then youve got to support them and encourage them, not boycott them. Use the game, the opportunities it provides, to build relations, and to hold them to higher standards.\n\nHe is still trying to do that in his own country now, as mayor. Bulawayo has just won the right to host theStreet Child Cricket World Cup. But Coltart is deeply concerned about the way the sport is being run. Theres still far too much politics involved in Zimbabwe Cricket, in the running of the organisation, and even in the selection policies. I still fear that were not spending the money that we get as best we should. Im a politician, but I dont think politicians should be anywhere near cricket administration. I would rather see people whose primary attribute is a great passion for cricket being involved in the running of the sport. Id like to see our best players from the past dominating the selection panel, black and white.\n\nStill, he beams when he thinks that Zimbabwe are going to play a Test at Trent Bridge this week. Despite the politics, despite the abuse of the rule of law and corruption in the country, all the concerns that I have regarding the government, the vast majority of Zimbabweans are united. Its a wonderful country and you will see that in our cricket, we are a passionately multiracial team, and thats a wonderful projection of our country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/20065233/Screenshot-2025-05-20-at-07.50.47.png",
            "description": "<p>The Guardian Twenty-two years is a long time, even in a sport that measures its games in days and its history in centuries. The last time England played a Test match against Zimbabwe, in 2003, Rob Key was in the middle order instead of the managing director’s job, Jimmy Anderson was a 20-year-old tearaway playing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-a-passionately-multiracial-team-zimbabwe-return-to-england-transformed/\">‘We are a passionately multiracial team’: Zimbabwe return to England transformed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Dawn Richard’s shocking account follows Cassie Ventura’s testimony in P Diddy trial",
            "url": "https://www.newzimbabwe.com/dawn-richards-shocking-account-follows-cassie-venturas-testimony-in-p-diddy-trial/",
            "content": "IOL\n\nLast week,Cassandra Cassie Venturaprovided harrowing details against music mogulSean Diddy Combsin her explosive court testimony in his sex trafficking trial.\n\nThe nearly 20-hour testimony over four days unveiled information, including alleged physical and sexual abuse, along with coercive tactics used to drag her into drug-fueled sex parties known as freak offs over more than a decade.\n\nVenturaoutlined a history of violence and manipulation, detailing how Combs allegedly exerted control over her through threats and intimidation.\n\nThe singer described incidents that highlighted the purported toxic environment created by Combs, painting a picture of a relationship marked by fear and turmoil.\n\nOnce her testimony came to an end, formermusical group Danity Kanemember Dawn Richard took the stand to provide a harrowing account of a violent incident she witnessed back in 2009.\n\nAccording to Richard, Combs erupted into a fit of rage, demanding to know where his breakfast was and subsequently physically assaulted Ventura.\n\nHe came downstairs screaming, belligerent, asking where his food was, and proceeded to hit her over the head, kicked her and beat her to the ground in front of us, Richard testified.\n\nRichard said she was in the kitchen with Ventura, who was cooking eggs, when Combs came and asked where his eggs were. He then took the skillet with the eggs, tried to hit her, and she fell to the ground, Richard said.\n\nShe said it seemed like Ventura dropped to the ground because she anticipated the hit: She went into the fetal position.\n\nCombs then dragged Ventura upstairs by her hair and with his arm around her neck, Richard said. She recalled hearing glass breaking and yelling from upstairs.\n\nRichard, who worked with Combs from 2004 to 2011, shared that fear prevented her from intervening or contacting authorities at the time.\n\nI was scared to do anything in fear of what that might mean for me, too, she admitted.\n\nRichard testified that the following day, Combs summoned her and another woman who witnessed the incident into a recording studio, where he allegedly dismissed the incident as mere passion, warning them that people go missing if they talk.\n\nRichard, now 42 years old, later filed a lawsuit against Combs, accusing him of sexual battery, harassment and false imprisonment.\n\nAlthough Combss defence team claimed they were unaware of Richards intentions to discuss the skillet incident, prosecutors said that they had informed the defence about it back in March.\n\nThe trial continues with Combs facing serious charges, including sex trafficking, conspiracy racketeering and engaging in prostitution, to which he has pleaded not guilty.\n\nThe trial resumed on Monday, May 19, with Richard expected to continue her testimony.\n\nThe trial, slated to span approximately eight weeks, will hear from more women whose identities will remain anonymous.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>IOL Last week, Cassandra “Cassie” Ventura provided harrowing details against music mogul Sean “Diddy” Combs in her explosive court testimony in his sex trafficking trial. The nearly 20-hour testimony over four days unveiled information, including alleged physical and sexual abuse, along with coercive tactics used to drag her into drug-fueled sex parties known as “freak offs” over more</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dawn-richards-shocking-account-follows-cassie-venturas-testimony-in-p-diddy-trial/\">Dawn Richard’s shocking account follows Cassie Ventura’s testimony in P Diddy trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Police in Limpopo intercept stolen Toyota vehicles valued at R1.4 million en route to Zimbabwe",
            "url": "https://www.newzimbabwe.com/police-in-limpopo-intercept-stolen-toyota-vehicles-valued-at-r1-4-million-en-route-to-zimbabwe/",
            "content": "IOL\n\nPolice in Limpopo have announced a significant breakthrough with the recovery of two vehicles, valued at approximately R1.4 million, which were destined to be smuggled out of South Africa.\n\nProvincial police spokesperson, Brigadier Hlulani Mashaba said the vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on Sunday.\n\nIn a co-ordinated anti-smuggling operation involving SAPS Anti-Smuggling Team, Tshimollo Security and Investigation, and Reflex Anti-Hijacking Security, the officers intercepted a Toyota Hilux GD-6 double cab on the R101 near Polokwane weighbridge. During the stop, one male suspect fled into nearby bushes, while two female suspects attempted to escape but were apprehended after a foot chase, said Mashaba.\n\nThe women aged 19 and 20 were arrested, and are facing charges of possession of a suspected stolen motor vehicle.\n\nPreliminary investigations confirmed that the vehicle was stolen on 16 May 2025 in the Garsfontein policing area in Pretoria East, Gauteng.\n\nIn a separate but related intelligence-driven operation, Mashaba said officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101 road, which was also en route to the Beitbridge port of entry.\n\nInvestigations revealed that this vehicle had been reported stolen at the Wierdabrug (City of Tshwane) policing area on Friday. The driver, a 34-year-old undocumented foreign national, was arrested, said Mashaba.\n\nThe two women who were found with the stolen Toyota Hilux are scheduled to appear before the Polokwane Magistrates Court on Tuesday.\n\nOn the other hand, the man who was found with the stolen Toyota Corolla Cross will appear before the Mokopane Magistrates Court on Tuesday.\n\nAn undocumented man was found driving a stolen Toyota Corolla Cross towards Beitbridge port of entry. Image: SAPS\n\nMeanwhile,provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebehas commended the operational teams for their relentless efforts, which resulted in the recovery of the stolen vehicles.\n\nLast week,IOL reported that members of Provincial Anti-Smuggling Team in Limpopo intercepted a suspected stolen whiteToyota Corolla Crossvehicle intended to be smuggled to neighbouring Zimbabwe.\n\nAt the time, Colonel Malesela Ledwaba, said the sport utility vehicle was about to be smuggled out of South Africa through an illegal crossing in the Limpopo River.\n\nPolice received intelligence information about the vehicle that was driven along Malales Drift heading to the banks of the Limpopo River and operationalised on it, he said.\n\nAt about 6am, the vehicle fitting the description was spotted in the bushes while attempting to cross the Limpopo river to Zimbabwe. Police tried to stop it but sped off and got stuck in the sand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/20062952/Screenshot-2025-05-20-at-07.27.52.png",
            "description": "<p>IOL Police in Limpopo have announced “a significant breakthrough” with the recovery of two vehicles, valued at approximately R1.4 million, which were destined to be smuggled out of South Africa. Provincial police spokesperson, Brigadier Hlulani Mashaba said the vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-in-limpopo-intercept-stolen-toyota-vehicles-valued-at-r1-4-million-en-route-to-zimbabwe/\">Police in Limpopo intercept stolen Toyota vehicles valued at R1.4 million en route to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Limpopo police nab man with stolen SUV linked to smuggling operation",
            "url": "https://www.newzimbabwe.com/limpopo-police-nab-man-with-stolen-suv-linked-to-smuggling-operation/",
            "content": "The Star\n\nMembers of the Provincial Flying Squad in Limpopo have apprehended a 31-year-old man found in possession of a stolen vehicle.\n\nPolice spokesperson Brigadier Hlulani Mashaba said that on May 16, while conducting routine patrols, the Limpopo Provincial Flying Squad received a tip-off about a grey Toyota Cross SUV that had been stolen in Pretoria Central, Gauteng, earlier this month.\n\nHe stated that the stolen SUV was suspected to be en route to Zimbabwe for smuggling, travelling at high speed along the N1 South.\n\nPolice launched a targeted operation and eventually located the vehicle outside Polokwane. When officers tried to stop it, the driver sped off, resulting in a high-speed pursuit.\n\nA car chase ensued until the vehicle was intercepted at Nirvana robots. It was searched, and police suddenly discovered a damaged tracking device removed from the vehicle.\n\nMashaba added that the 31-year-old suspect failed to produce valid documentation proving ownership of the vehicle when stopped by officers.\n\nHe was immediately arrested on the spot for possession of a suspected stolen motor vehicle, he confirmed.\n\nMashaba further stated that the suspect is set to make a formal court appearance at the Polokwane Magistrates Court on May 19, where the charges of possession of a suspected stolen motor vehicle will be formally presented.\n\nAuthorities will seek to ensure that due legal process is followed as the investigation continues, and the court will determine the next steps regarding bail and further proceedings. He said.\n\nMeanwhile, the Provincial Commissioner of Limpopo, Lieutenant General Thembi Hadebe, has praised the police for the recovery of the stolen vehicle and urged them to continue in their concerted efforts to deal with cross-border crimes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/20062516/Screenshot-2025-05-20-at-07.24.36.png",
            "description": "<p>The Star Members of the Provincial Flying Squad in Limpopo have apprehended a 31-year-old man found in possession of a stolen vehicle. Police spokesperson Brigadier Hlulani Mashaba said that on May 16, while conducting routine patrols, the Limpopo Provincial Flying Squad received a tip-off about a grey Toyota Cross SUV that had been stolen in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/limpopo-police-nab-man-with-stolen-suv-linked-to-smuggling-operation/\">Limpopo police nab man with stolen SUV linked to smuggling operation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Zimparks infrastructure in bad state; officials call for govt funding",
            "url": "https://www.newzimbabwe.com/zimparks-infrastructure-in-bad-state-officials-call-for-govt-funding/",
            "content": "By Anna Chibamu\n\nTHE Zimbabwe Parks and Wildlife Management Authority (Zimparks) says the departments infrastructure is in a dilapidated state, which has negatively impacted domestic tourism.\n\nGiving oral evidence to the Parliamentary Portfolio Committee on Tourism and Hospitality Industry recently, Zimparks Director Commercial Services, Nomsa Chitsaka, said poor road networks, dilapidated accommodation infrastructure, insufficient funding and a poor regulatory framework have all contributed to the low figures in domestic tourism.\n\nChitsaka said poor road networks, such as the Bulawayo-Victoria Falls highway, deter tourists and limit access to the countrys tourismdestinations.\n\nChitsaka reported that other roads leading to smaller Parks such as Chivero Recreational Park and Umfurudzi Park were also in a bad state, yet they fall outside the purview of ZimParks.\n\nThe state of National Parks accommodation infrastructure lags behind that of the private sector, diminishing their appeal as tourism destinations, hence they negatively impact the overall tourist experience.\n\nEfforts of renovation have been impacted by the procurement process, where the tender process in time time-consuming and the prices are inflated from the normal amounts that private operators incur,Chitsaka said.\n\nAdding to the challenges is the poor funding and provision of resources by the Treasury.\n\nInsufficient funding and resources constrain our ability to maintain parks and support tourism development.\n\nTourism is the key source of revenue to fund all the operations within the ZIMPARKS operations, but due to the current state of the infrastructure, it has been a challenge,\n\nDue to financial constraints, it is now difficult for the authority to renovate the tourism infrastructure and meet other related expenses. As of now, some of the linens are tattered, some furniture is broken, and some infrastructure is in dire need of renovations, she added.\n\nShe told the Committee that the current renovations that are being made were from the little funds from the dilapidated infrastructure.\n\nIt is important to take note that 2019 occupancy is higher than 2024, whilst the 2024 arrivals are higher than 2019.\n\nThis substantiates the fact that the market is slowly neglecting the Zimparks accommodation, and this is mainly due to the state of the product, said Chitsaka.\n\nChitsaka highlighted that the regulatory framework was not in order, as the Procurement Regulatory Authority of Zimbabwe (PRAZ) framework posed operational challenges for Small Business Units (SBUs) within National Parks, such as Tshabalala Refreshment Centre, the Kariba Refreshment Centre, the Zambezi Rock Pool, and Rhodes Nyanga Hotel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18163502/chivero-entrance.jpeg",
            "description": "<p>By Anna Chibamu THE Zimbabwe Parks and Wildlife Management Authority (Zimparks) says the department’s infrastructure is in a dilapidated state, which has negatively impacted domestic tourism. Giving oral evidence to the Parliamentary Portfolio Committee on Tourism and Hospitality Industry recently, Zimparks Director Commercial Services, Nomsa Chitsaka, said poor road networks, dilapidated accommodation infrastructure, insufficient funding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-infrastructure-in-bad-state-officials-call-for-govt-funding/\">Zimparks infrastructure in bad state; officials call for govt funding</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "BBC uncovers child sex abuse in South Africa’s illegal mines",
            "url": "https://www.newzimbabwe.com/bbc-uncovers-child-sex-abuse-in-south-africas-illegal-mines/",
            "content": "BBC\n\nThis story contains details that some people may find distressing.\n\nThe most shocking thing for Jonathan, who had endured six gruelling months living and working underground in an abandoned South African gold mine, was the abuse he witnessed being meted out to children.\n\nSome are recruited for cheap labour, but others are brought in specifically for sex, campaigners say.\n\nJonathan, now in his late 20s, had migrated to South Africa from a nearby country on the promise of making easy money working in one of its dozens of disused mines, closed by multinationals because they were no longer commercially viable.\n\nWe are protecting his full identity as he fears reprisals from the vicious criminal gangs that run the illegal mining industry for speaking to the media.\n\nDetails of what the young people were going through emerged after the death of dozens of illegal miners near the town of Stilfontein late last year when the mine was blockaded by police.\n\nIn a calm and steady voice, Jonathan describes the heat, long hours and limited food and sleeping options which took a toll on his body.\n\nBut an enduring memory is what happened to the underage miners in the shaft where he worked.\n\nI used to see these kids in the mine  teenagers actually, 15, 17-year-olds.\n\nOthers used to take advantage of them sometimes. It was a little bit scary, and I wasnt comfortable with it.\n\nHe said they were raped by adult miners who promised to give them some of the gold they found in exchange for sex.\n\nIf that kid is desperate for money, he will take the risk.\n\nJonathan describes how the children would approach teams of miners for protection but that team would have conditions.\n\nSex was also used as punishment if the teenagers failed to complete a task for their team.\n\nJonathan says the children in the mine where he worked were all foreign and did not realise what they were getting themselves into.\n\nAFP Illegal miners enter abandoned mines through disused shafts, often descending kilometres and not able to leave for months\n\nMining researcher and activist Makhotla Sefuli backs this up.\n\nHe says criminal gangs specifically target children to work in illegal mines across South Africa.\n\nMany of them are abducted from neighbouring countries and trafficked. They are enticed by baseless promises of finding them employment in the formal mining industry.\n\nTheir passports are confiscated when they get to South Africa It is common knowledge that these young boys are being abused, Mr Sefuli says.\n\nThe BBC has spoken to miners who worked in at least two other illegal mines who told us they saw children being abused in the shafts where they were working.\n\nTshepo, not his real name, says he saw older men forcing young boys to have sex with them underground.\n\nIn some instances, they did it for the money. Some are recruited solely for that purpose, because of the financial incentives that will come with the practice of maybe trading sex underground.\n\nHe adds that the abuse deeply affected the children.\n\nThey change their behaviour patterns and have trust issues. They dont want you to get close to them, because they feel that they can no longer trust anyone.\n\nSouth Africas illegal mining industry made global headlines last year following a standoff between police and miners at the Buffelsfontein gold mine, near the town of Stilfontein in the North West Province.\n\nThe authorities had been trying to curb illegal mining, which the government said cost South Africas economy $3.2bn (2.6bn) in lost revenue last year.\n\nThey launched an operation called Vala Umgodi, or seal the hole, in December 2023, promising to take a tough stance on the gangs.\n\nAs part of the operation, the police limited the amount of food and water that went down the Stilfontein mine to, as one minister put it, smoke out the illegal miners. Officials said the men were refusing to come out for fear of being arrested.\n\nSoon footage began to emerge from within the mine showing dozens of emaciated men begging to be rescued, as well as rows of body bags. Eventually a court ordered the authorities to save the men.\n\nAmong those brought up were many who said they were underage, but as a number of them were migrants without documents confirming how old they were, the authorities carried out medical tests to get an estimate.\n\nThrough this, the Department of Social Development (DSD) confirmed that 31 of the rescued Stilfontein miners were found to be children. They were all Mozambicans nationals and in November, 27 of them were repatriated.\n\nSave the Children South Africa helped translate some of the interviews between the underage miners and the rescue workers.\n\nThey went through trauma, because some of them also saw others being sexually exploited, the charitys CEO Gugu Xaba tells the BBC.\n\nJust the feeling that they may not come out of there destroyed those children mentally.\n\nThe adult miners would start by grooming them, by acting like they like them.\n\nShe says the children were then made to perform sexual acts on the adults and they were then raped, days after day.\n\nYou find that the adult will have three or four of them that they are doing the same thing to.\n\nBBC Most children are trafficked in order to be used as sex slaves. And youve got a pimp who is taking the money, Gugu Xaba, CEO, Save the Children South Africa\n\nMs Xaba says mining gangs recruit children because they are easier to manipulate and cheaper.\n\nChildren dont understand when you say: Ill pay you 20 rands ($1; 0.80) per day. The adults sometimes refuse to work, but children find themselves with no choice. So its easier to use a child to do the work. Its easier to take a child whos kind of voiceless and to bring them down there.\n\nBeyond being exploited financially, she says there are gangs that recruit children specifically for sex.\n\nMany illegal miners spend months underground, rarely going up to the surface. Markets spring up underground to provide them with anything they need.\n\nMost children are trafficked in order to be used as sex slaves. And youve got a pimp who is taking the money, and it means every day this child is used as a commercial sex worker.\n\nThe BBC asked the police and the DSD whether anyone would be charged over the sexual abuse allegations. They did not respond to our requests.\n\nA source working on the Stilfontein miners cases said many of the children did not want to testify.\n\nMeanwhile, the illegal mining industry continues to thrive.\n\nAnd with an estimated 6,000 vacant mines potentially available to explore, it is a business that is unlikely to end anytime soon, leaving thousands of vulnerable children at risk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/20063751/illegal-mine.webp",
            "description": "<p>BBC This story contains details that some people may find distressing. The most shocking thing for Jonathan, who had endured six gruelling months living and working underground in an abandoned South African gold mine, was the abuse he witnessed being meted out to children. Some are recruited for cheap labour, but others are brought in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bbc-uncovers-child-sex-abuse-in-south-africas-illegal-mines/\">BBC uncovers child sex abuse in South Africa’s illegal mines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Police flags nearly 300 rogue motorists in Harare; issue seven-day ultimatum",
            "url": "https://www.newzimbabwe.com/police-flags-nearly-300-rogue-motorists-in-harare-issue-seven-day-ultimatum/",
            "content": "By Costa Nkomo\n\nThe Zimbabwe Republic Police (ZRP) has flagged nearly 300 motorists caught flouting traffic light regulations in Harares Central Business District (CBD).\n\nThe sting was made possible by a new, technologically advanced traffic monitoring system, aimed at bringing order to the countrys roads.\n\nLast May, the Cabinet gave the nod to the engagement of Vitronic Machine Vision Middle East, a Dubai-based firm specialising in Smart Traffic Management Systems.\n\nThe promise, then, was that this technology would help curb road rule violations by leveraging cutting-edge capabilities to optimise traffic flow, bolster safety, and improve the overall efficiency of the nations transport network.\n\nThe ZRP appears to have confined its initial efforts to the capital.\n\nIn a statement released Monday, National Police Spokesperson Commissioner Paul Nyathi appealed to the 290 motorists with listed vehicle registration numbers to cooperate with the police over the next seven days, without specifying the consequences should they fail to present themselves at Mkushi Police Academy (formerly Morris Depot).\n\nThe Zimbabwe Republic Police has embraced the Electronic Traffic Management System and is appealing for cooperation from 290 motorists with the listed vehicle registration numbers to assist in the ongoing investigations, Nyathi stated.\n\nThe motorists or vehicle owners are urged to fully cooperate and assist in the maintenance of law and order in the country by reporting to the police within the next seven days.\n\nThe police have emphasised their determination to bring an end to the anarchy on Zimbabwes roads, imploring motorists to abide by the Highway Code.\n\nThe Zimbabwe Republic Police reiterates that with the advent of technology in policing, the days of reckless driving by motorists are coming to an end, Nyathi added. Drivers are reminded to be law-abiding citizens and collectively contribute towards road safety.\n\nSimilar traffic monitoring systems have been adopted by various countries, including Morocco, Rwanda, the United Arab Emirates, Saudi Arabia, France, and Germany.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Costa Nkomo The Zimbabwe Republic Police (ZRP) has flagged nearly 300 motorists caught flouting traffic light regulations in Harare’s Central Business District (CBD). The sting was made possible by a new, technologically advanced traffic monitoring system, aimed at bringing order to the country’s roads. Last May, the Cabinet gave the nod to the engagement</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-flags-nearly-300-rogue-motorists-in-harare-issue-seven-day-ultimatum/\">Police flags nearly 300 rogue motorists in Harare; issue seven-day ultimatum   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Muzarabani moves to IPL, replaces South African bowler Ngidi",
            "url": "https://www.newzimbabwe.com/muzarabani-moves-to-ipl-replaces-south-african-bowler-ngidi/",
            "content": "By Sports Reporter\n\nZimbabwean pace bowler Blessing Muzarabani has joined Royal Challengers Bengaluru (RCB) in the Indian Premier League (IPL).\n\nMuzarabani (28) joins as a replacement for South African fast bowler Lungi Ngidi, who is returning home for national team commitments.\n\nMuzarabani has previouslyplayed in the Caribbean Premier League and the Pakistan Super League.\n\nHe is currently in United Kingdom where he is with the Chevrons for the upcoming Test match against England, which is scheduled to run from May 22 to 25 at Trent Bridge.\n\nThe move marks Muzarabanis reunion with Chevrons legend Andy Flower, who is currently coaching RCB. RCB have already qualified for the IPL play-offs, which begin on 29 May.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/24094459/Blessing-Muzarabani.png",
            "description": "<p>By Sports Reporter Zimbabwean pace bowler Blessing Muzarabani has joined Royal Challengers Bengaluru (RCB) in the Indian Premier League (IPL). Muzarabani (28) joins as a replacement for South African fast bowler Lungi Ngidi, who is returning home for national team commitments. Muzarabani has previously played in the Caribbean Premier League and the Pakistan Super League. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/muzarabani-moves-to-ipl-replaces-south-african-bowler-ngidi/\">Muzarabani moves to IPL, replaces South African bowler Ngidi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "Tanganda Tea Company wins a US$41,800 claim against its debtor",
            "url": "https://www.newzimbabwe.com/tanganda-tea-company-wins-a-us41800-claim-against-its-debtor/",
            "content": "By Mary Taruvinga\n\nTanganda Tea Company has won a US$41,816 claim against businessman Darlington Matsitukwa following a protracted legal battle dating back to 2018.\n\nMatsitukwa was refusing to pay the amount in foreign currency, arguing that the company waived its right to get the money in foreign currency by initially accepting ZW$5,876 he paid towards settling the debt.\n\nHe also argued that the 2019 legal changes in payment of foreign debts changed everything and he was entitled to pay the amount in local cuurency.\n\nHowever, High Court judge Justice Faith Mushure ruled in favour of Tanganda Tea Company, ruling that Matsitukwa should pay US$41,816.\n\nMushure said the beneficiary of a statutory right is at liberty to waive such an entitlement conferred by the law for his or her benefit.\n\nThe provision is essentially an exception clause to the general position that contractual obligations valued in USD immediately before the effective date, that is February 22 2019, were to be paid in RTGS dollars at parity or at a one-as-to-one rate.\n\nOnce a debt satisfies the jurisdictional facts that establish a foreign obligation, such a debt, by operation of the law, is excluded from the ambit of s133 of 2019, she said.\n\nWhile the court observed that it would be commercially unacceptable to attempt to settle any foreign loan or obligation in local currency, it also issued a critical rider that the parties involved may mutually agree to settle the foreign loan or obligation in local currency.\n\nIt is clear in my view that when the appellants allegedly waived their rights, they were not aware of the rights and legal implications. It took the hearing and the decision of this court to identify and confirm the rights.\n\nIn the present matter, the plaintiff cannot approbate and reprobate in relation to the repayment of the initial ZW$5,876 in local currency, said the judge.\n\nThe judge said the amount was deducted from the capital sum and cannot be repaid in foreign currency again due to plaintiffs initial acceptance of the same.\n\nIn the final analysis, it is my finding that the claim partly succeeds.\n\nThe principle of a waiver does not apply as a defence to the repayment of the outstanding US$41,616. The facts do not establish the existence of a tacit agreement between the parties in this regard.\n\nThe court then declared the debt of US$47,493 as a foreign obligation.\n\nUS$5,876 was deducted from the amount and Matsitukwa was ordered to liquidate the judgment debt of US$41,616.\n\nTanganda Tea Company was ordered to restitute Matsitukwa the ZW$41,616 he paid.\n\nThe background is that in January 2018 Tanganda Tea company and Matsitukwa entered into an agreement in which the company was to sell tea products worth US$47.493 to the latter for resale in Malawi.\n\nMatsitukwa was given the products but did not pay.\n\nThe company then sued him in a mattter that was heard by the High Court and only ZW$5,876 was recovered.\n\nMatsitukwa then made two separate payments of ZW$16,000 and ZW$25,717 to the Trust Account of Tanganda Tea Companys lawyers, thereby extinguishing the debt before 22 November 2019.\n\nTanganda then refused to accept the payments insisting that it was a foreign debt and should have been settled in USD.\n\nThe parties then agreed that that indeed the debt is a foreign debt and should have been paid in USD.\n\nThe point of departure is whether the initial payment in ZWL and its acceptance extinguished the obligation to pay the debt in USD.\n\nMatsitukwa argued that Tanganda Tea Company waived its right to have payment of its debt in USD.\n\nHe argued that following the issuance of the judgement under HC10306/18, a writ of execution was duly issued, resulting in ZWL5,876 being realised from him.\n\nHe further argued that in trying to recover the outstanding balance, the company issued summons for civil imprisonment against him.\n\nMatsitukwa urged the court to note the deduction of the ZWL payment from the principal sum of US$47,483 by the company leaving thebalance at USD$41,616 which it claimed in the summons for civil imprisonment under HC6686/19.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga Tanganda Tea Company has won a US$41,816 claim against businessman Darlington Matsitukwa following a protracted legal battle dating back to 2018. Matsitukwa was refusing to pay the amount in foreign currency, arguing that the company waived its right to get the money in foreign currency by initially accepting ZW$5,876 he paid towards</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanganda-tea-company-wins-a-us41800-claim-against-its-debtor/\">Tanganda Tea Company wins a US$41,800 claim against its debtor</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        },
        {
            "title": "RTG in refurb breakthrough, revenue hits US$8,7 million",
            "url": "https://www.newzimbabwe.com/rtg-in-refurb-breakthrough-revenue-hits-us87-million/",
            "content": "By Alois Vinga\n\nTOP hospitality concern, Rainbow Tourism Group (RTG) has undertaken major refurbishment exercises which will go a long way insustainingthe market share.\n\nPresenting a trading update for the quarter ended March 31 2025, RTG company secretary, Tapiwa Mari, said the just-ended period saw major facelifts pushing through milestones.\n\nThe group conducted the refurbishment of its three properties during the months of January and February 2025. The refurbishment works saw the New Ambassador Hotels guest rooms undergoing a comprehensive refurbishment, including the full replacement of furniture and fittings, as well as the upgrading of bathrooms with contemporary fixtures and enhanced amenities, aimed at delivering a refreshed and modern guest experience, he said.\n\nMari said the Victoria Falls Rainbow Hotel completion reached 50% of room refurbishments, finalising the full hotel upgrade.\n\nAt the AZambezi River Lodge, refreshing guest rooms with updated furnishings, lighting and enhanced amenities. The total investment for these refurbishments was US$1 million.\n\nAn analysis of the groups performance shows revenues increased by 2% to US$8.7 million, up from US$8.5 million recorded in Q1 2024 driven by an increase in conference volumes, particularly in city hotels, underscoring robust demand for meetings and events.\n\nNotably, this performance was achieved despite refurbishment related disruptions at three hotels; the New Ambassador Hotel, AZambezi River Lodge and Victoria Falls Rainbow Hotel.\n\nThe Group is strategically positioned to benefit from the continued recovery and growth of leisure tourism in the Victoria Falls market, as well as the expansion of conferencing activity in urban centres. The Groups portfolio has recently expanded with the acquisition of Montclair Resort & Conference in the Eastern Highlands, Mari said.\n\nIn the period ahead, the group is strategically positioned to benefit from the continued recovery and growth of leisure tourism in the Victoria Falls market, as well as the expansion of conferencing activity in urban centers on the back of a recently expanded portfolio following the acquisition of Montclair Resort & Conference in the Eastern Highlands.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/25170112/Tapiwa-mari.webp",
            "description": "<p>By Alois Vinga TOP hospitality concern, Rainbow Tourism Group (RTG) has undertaken major refurbishment exercises which will go a long way in sustaining the market share. Presenting a trading update for the quarter ended March 31 2025, RTG company secretary, Tapiwa Mari, said the just-ended period saw major facelifts pushing through milestones. “The group conducted the refurbishment</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rtg-in-refurb-breakthrough-revenue-hits-us87-million/\">RTG in refurb breakthrough, revenue hits US$8,7 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 May 2025"
        }
    ]
}