{
    "news": [
        {
            "title": "Defence Minister to pay US$25,000 compensation to 2018 August 1 shooting victim",
            "url": "https://www.newzimbabwe.com/defence-minister-to-pay-us25000-compensation-to-2018-august-1-shooting-victim/",
            "content": "By Thandiwe Garusa\n\nDEFENCE Minister Oppah Muchinguri has been ordered to pay US$25,000 in compensation to Zakeo Mutimutema, a victim of the 2018 August 1 army shootings.\n\nMutimutema sustained serious eye injuries from shattered glass caused by bullets fired by soldiers during the 2018 post-election protests following a delay in releasing the Presidential poll results by the Zimbabwe Electoral Commission.\n\nHe worked for the Zimbabwe Congress of Trade Unions (ZCTU) and live shots were fired at a building which housed their offices.\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR), which helped Mutimutema sue Muchinguri, Cultural Heritage Minister Hon. Kazembe Kazembe, and ZRP Commissioner-General Stephen Mutamba for damages, said the victim was initially awarded ZWL$295,000 in November 2020, which was unpaid and lost value due to inflation.\n\nThe labour law specialist had to undergo three unsuccessful eye surgeries to remove fine glass particles that pierced his eyes after a bullet fired by soldiers shattered glass windows at his ZCTU offices.\n\nMutimutema, who was represented by Obey Shava of ZLHR, had initially been awarded ZWL$295,000 as damages in November 2020 as damages for pain and suffering, medical expenses and general damages which Muchinguri, Kazembe and Mutamba had reneged on paying.\n\nThe labour law specialist had to file an application wherein he amended his summons, arguing that the compensation award had been significantly eroded by inflation.\n\nOn Tuesday 29 July 2025, Mutimutema was a relieved man after Muchinguri agreed to pay the labour law specialist US$25,000 as compensation for damages for current and future medical expenses, pain and suffering and general damages, ZLHR said.\n\nAt least six people were shot dead by soldiers during the protest.\n\nA Commission of Inquiry, chaired by former South African President Kgalema Motlanthe and appointed by President Emmerson Mnangagwa to probe the post-election violence, recommended that government should compensate all the victims of the shootings and prosecute perpetrators.However, there has been no prosecution of perpetrators.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/13122619/oppah-kazembe-e1712810265882.jpg",
            "description": "<p>By Thandiwe Garusa DEFENCE Minister Oppah Muchinguri has been ordered to pay US$25,000 in compensation to Zakeo Mutimutema, a victim of the 2018 August 1 army shootings. Mutimutema sustained serious eye injuries from shattered glass caused by bullets fired by soldiers during the 2018 post-election protests following a delay in releasing the Presidential poll results</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defence-minister-to-pay-us25000-compensation-to-2018-august-1-shooting-victim/\">Defence Minister to pay US$25,000 compensation to 2018 August 1 shooting victim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:54",
            "date": "31 Jul 2025"
        },
        {
            "title": "Emmanuel Mandiranga returns to Zim PSL, joins Manica Diamonds",
            "url": "https://www.newzimbabwe.com/emmanuel-mandiranga-returns-to-zim-psl-joins-manica-diamonds/",
            "content": "By Sports Reporter\n\nFormer Dynamos and CAPS United forward Emmanuel Mandiranga has joined Manica Diamonds as part of its mid-season transfer signings.\n\nMandiranga is making his return to the Zimbabwe Premier Soccer League since 2022.\n\nThe 29-year-old forward was in Mozambique, where he played for UD Songo since 2023.\n\nAlthough details of his contract have not been revealed, NewZimbabwe.com understands that Mandiranga started to train with the Mutare-based side on Tuesday.\n\nMeanwhile, Manica Diamonds has released midfielder Issa Sadiki on loan to Chicken Inn FC.\n\nSadiki joined the club in January from Dynamos, but he unfortunately struggled to make it into the team.\n\nManica Diamonds is one of the relegation candidates in the league, currently on position 16 on the log with 23 points, 13 ahead of the bottom-placed Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30192628/emmanuel-mandiranga.jpg",
            "description": "<p>By Sports Reporter Former  Dynamos and CAPS United forward Emmanuel Mandiranga has joined Manica Diamonds as part of its mid-season transfer signings. Mandiranga is making his return to the Zimbabwe Premier Soccer League since 2022. The 29-year-old forward was in Mozambique, where he played for UD Songo since 2023. Although details of his contract have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/emmanuel-mandiranga-returns-to-zim-psl-joins-manica-diamonds/\">Emmanuel Mandiranga returns to Zim PSL, joins Manica Diamonds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:54",
            "date": "31 Jul 2025"
        },
        {
            "title": "Invictus Energy’s Cabora Bassa venture to be awarded National Project status",
            "url": "https://www.newzimbabwe.com/invictus-energys-cabora-bassa-venture-to-be-awarded-national-project-status/",
            "content": "By Alois Vinga\n\nINVICTUS Energy, the Australian company developing and exploring gas deposits in northern Zimbabwe, is set to be awarded the National Project status for its Cabora Bassa venture.\n\nThe Cabora Bassa project is a significant oil and gas exploration project in Zimbabwes Cabora Bassa basin, which aims to unlock the basins potential for natural gas and condensate, with the Mukuyu gas field being a key focus.\n\nInvictus is also working towards pilot production, including a gas-to-power project for the Eureka Gold Mine, and is also exploring potential for regional gas markets.\n\nPresenting a quarterly report this week, Invictus Energy announced the possibility of being awarded a National Project status.\n\nIn June the Zimbabwe Minister of Finance identified the Cabora Bassa Project as one in line for receiving National Project Status (NPS)  a significant milestone for the company. Once formalised, the NPS would recognise the projects potential to generate broad-based economic benefits, attract foreign investment, and create employment opportunities, said the company.\n\nInvictus is currently finalising formalities required for the official granting of NPS, which will unlock a range of fiscal and non-fiscal incentives, including duty exemptions, expedited permitting, and streamlined access to critical infrastructure and services.\n\nAs a gesture of appreciation for the Invictus Energy potential, the Mutapa Investment Fund (MIF) recently injected US$5 million to accelerate the projects exploration activities, including flow testing, drilling, and seismic surveys, as Invictus transitions from exploration to development.\n\nDuring the quarter, Invictus Energy continued to progress discussions with a number of prospective farm-in and strategic partners for participation in the future development of the Cabora Bassa Project. These parties include established industry operators and investment groups with the capacity to provide both strategic capital and substantial technical and operational capabilities.\n\nTheir expertise aligns with the Companys forward program, which aims to unlock a new resource base through high-impact exploration while advancing the appraisal and potential commercialisation of the Mukuyu gas field.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/31124125/Invictus-Energy.jpeg",
            "description": "<p>By Alois Vinga INVICTUS Energy, the Australian company developing and exploring gas deposits in northern Zimbabwe, is set to be awarded the National Project status for its Cabora Bassa venture. The Cabora Bassa project is a significant oil and gas exploration project in Zimbabwe’s Cabora Bassa basin, which aims to unlock the basin’s potential for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/invictus-energys-cabora-bassa-venture-to-be-awarded-national-project-status/\">Invictus Energy’s Cabora Bassa venture to be awarded National Project status</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:54",
            "date": "31 Jul 2025"
        }
    ]
}