{
    "news": [
        {
            "title": "Scottland F.C salvage a point against Highlanders at Barbourfields",
            "url": "https://www.newzimbabwe.com/scottland-f-c-salvage-a-point-against-highlanders-at-barbourfields/",
            "content": "By Sports Reporter\n\nMTHOKOZISI Msebes 92nd goal was all Scottland needed to walk away with a point against Highlanders at Barbourfields Sunday afternoon in a match that ended in a 1-1 draw.\n\nThe result saw Highlanders registering a second consecutive draw following a 2-2 away outcome against Green Fuel a fortnight ago.\n\nBosso had a good first half show, which saw then creating several chances, only to be denied by Scottlands resolute back line led by Peter Muduwa, an ex-Highlanders player.\n\nComing back to the second half Scottland seemed hungrier for a goal, with team coach Tonderai Ndiraya introducing star players Khama Billiat and Walter Musona in the 67th minute.\n\nThe duo, however, did not make much impact after failing to create chances upfront.\n\nHighlanders goal came in the 82nd minute, thanks to Andrew Mbeba, who delivered a direct free kick.\n\nThe visitors did not stay behind for too long after Msebe headed on target to pick a point for his side.\n\nCommenting after the match, Highlanders coach Kelvin Kaindu said, I am a bit dissapointed. Our tactics didnt work as planned.This is how we drew again the last game.\n\nWith a bit of luck, we could have won, and with such an atmosphere l honestly think we should have won.\n\nHaving salvaged a point, Scottland coach Ndiraya applauded his boys for the performance.\n\nI think it was a good game. It was 50/50 in the second half; we were a bit better. We came back, and we should a good character to pick this point.\n\nThis is a new team, so coming here to Barbourfields to pick a point is a good thing, Ndiraya said.\n\nSundays outcome left Scottland on seven points after four games, while Highlanders are on five points from as many games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/28165838/WhatsApp-Image-2025-02-28-at-18.58.14.jpeg",
            "description": "<p>By Sports Reporter MTHOKOZISI Msebe’s 92nd goal was all Scottland needed to walk away with a point against Highlanders at Barbourfields Sunday afternoon in a match that ended in a 1-1 draw. The result saw Highlanders registering a second consecutive draw following a 2-2 away outcome against Green Fuel a fortnight ago. Bosso had a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-f-c-salvage-a-point-against-highlanders-at-barbourfields/\">Scottland F.C salvage a point against Highlanders at Barbourfields</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Britain’s Got Talent golden buzzer Linda Mudzenda on emotional reason she wants to win the show",
            "url": "https://www.newzimbabwe.com/britains-got-talent-golden-buzzer-linda-mudzenda-on-emotional-reason-she-wants-to-win-the-show/",
            "content": "The Mirror\n\nSinger Linda Mudzenda stopped theBritains Got Talentjudges in their tracks with an emotional performance that earned her the shows seventh golden buzzer.\n\nZimbabwe-born Linda blew everyone away as she belted out You Say by Lauren Daigle. JudgeAlesha Dixon who frequently hit the Top 10 in the noughties with girl group Mis-Teeq  was so moved she sent Linda straight into the finals. The 21-year-old childrens support worker dedicated the performance to mum Susan, saying she wants to win so she can give her a better life. She said: The reason Im here, working so hard, is because of my mum.\n\nShe sacrificed a lot for me to live my passion of music. So shes the first person Id thank with the prize money. A lot would go to making sure she can relax for the rest of her life.\n\nLinda grew up in Harare, Zimbabwe, with five siblings  and says life was tough as her mum raised them single-handed. She said: It was hard, but my mum managed to take care of us and do everything. I cant say it was good, but we got through it.\n\nSo being on the stage, it was a relief for me. It was a joy I didnt have for the past two months. I almost got depressed, but managed to conquer it. Thats why it was emotional for me.\n\nLinda with mum Susan, who says she wants to win BGT for her mum\n\nSince then, she says, things are on the up. Now everythings OK at work, I managed to find a place to stay and my health is a bit better.\n\nI was diagnosed with the pre-diabetic condition. Im on a diet. I have a cyst on my left side  Im still yet to see if they can do an operation. So Im in a good space. BGT came at the right time.\n\nAnd she says judge Alesha had some touching words of advice for her. Linda revealed: Alesha did come on the stage after hitting the buzzer. She did tell me that I deserved it. I deserved to be part of the show, and it was all worth it for me to be there.\n\nLinda admits that she has had her sights set on appearing on theITVtalent show since childhood. She said: I watched BGT onYouTubeall the time growing up. When people used to ask me what I dream of doing when I grow up, I used to say to be part of Britains Got Talent. Despite being all the way in Zimbabwe, I always believed Id move to the UK and make it happen.\n\nLindas first memory of singing was alongside her sisters in church at the age of 10. At 16 she started collaborating professionally with Gospel artists around theworld. She also writes her own music and will release her first single this autumn.\n\nShe said: Winning BGT and getting recognised internationally would be a huge dream come true. It would allow me to grow my audience, release more songs and potentially tour with my own sound, she said.\n\nLinda joins other golden buzzers Vinnie McKee (Simon Cowell), Will Burns (Ant and Dec), Stacey Leadbeatter (KSI), Olly Pearson (Amanda Holden), and the group The Blackouts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30132202/linda-mudzenda.jpg",
            "description": "<p>The Mirror Singer Linda Mudzenda stopped the Britain’s Got Talent judges in their tracks with an emotional ­performance that earned her the show’s seventh golden buzzer. Zimbabwe-born Linda blew everyone away as she belted out You Say by Lauren Daigle. Judge Alesha Dixon – who frequently hit the Top 10 in the noughties with girl group Mis-Teeq</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/britains-got-talent-golden-buzzer-linda-mudzenda-on-emotional-reason-she-wants-to-win-the-show/\">Britain’s Got Talent golden buzzer Linda Mudzenda on emotional reason she wants to win the show</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Why British boarding schools are so eager to open in Nigeria",
            "url": "https://www.newzimbabwe.com/why-british-boarding-schools-are-so-eager-to-open-in-nigeria/",
            "content": "By BBC\n\nFOR many years, well-off Nigerians have sent their children to prestigious British boarding schools  but now some of those institutions are setting up campuses in Africas most populous nation.\n\nLast year, Charterhouse launched a primary school in the city of Lagos and will open a secondary school this September.\n\nRugby School will also begin offering secondary education in September. Other well-known institutions, such as Millfield, Wellington School and Harrow, are also exploring opportunities in Nigeria.\n\nThis obviously all comes with a price tag for Nigerian parents  but the countrys well-heeled elite have historically sent their children to the UK for secondary education, drawn to the British curriculums rigour, prestige and global opportunities.\n\nIm actually excited about it, says Karima Oyede, a British-Nigerian management consultant, whose son is currently in year 10 at Rugby in the UK but will be moving to its Lagos school in September.\n\nHer family has been meaning to relocate to Nigeria for a while but has not done so earlier because of the childrens education.\n\nHaving the opportunity to experience the British system in his country of origin is the best of both worlds, she says.\n\nNigeria already has a proliferation of private schools but high-quality, internationally recognised education within the country will appeal to many parents, particularly those who wish to preserve their childrens cultural identity.\n\nAfrican parents love the fact that they are giving their children international standing so they can compete with their counterparts in any other part of the world, but they dont want their children to lose their African-ness, says Ijay Uwakwe-Okoronkwo, the founder of Nkuzhi Learning Foundation in Nigerias capital, Abuja.\n\nThe educational consultant, who advises parents and schools on international boarding options, explains the more relaxed, less respectful attitude children return with after going to school abroad is not always appreciated.\n\nThis cultural dilemma extends to the growing conversation around LGBTQ issues. Same-sex relationships and public displays of affection are illegal in Nigeria and homosexuality is not openly discussed or promoted.\n\nIt is something that the new crop of British schools has taken on board. For example, while Charterhouse UK displays a rainbow flag, the Nigeria school does not.\n\nWere a British independent school but sitting firmly within Nigerian cultural needs, says John Todd, head of Charterhouse Nigeria.\n\nTheres this huge concern about Western cultural views. For parents here, we know its a really big issue. Its a reason parents are worried about the UK schools.\n\nIm not making a judgement  its just the way it is.\n\nBritish institutions in Nigeria have no choice but to follow the law of the land, he acknowledges, adding: We are 100% compliant.\n\nRecognising Nigerias deeply religious society, Charterhouse also permits parents to take their children home from the boarding house for Sunday church services, with the expectation that they return by Monday morning.\n\nThere are several reasons behind the growing interest of prestigious British schools in opening campuses in Nigeria.\n\nWhile regions like the Middle East and China are already saturated with international schools, Africa is relatively virgin territory.\n\nNigeria is the gateway to Africa, and Africa is kind of the last continent for British schools to establish in, says Mark Brooks, an export champion for the UKs Department for Business and Trade.\n\nHe organises annual events in Nigeria where about 20 British schools meet prospective students and parents.\n\nNigeria has an incredible reputation for producing driven, high-achieving students, says Mr Brooks.\n\nThere is no school I work with that hasnt recently had a Nigerian student serve as head boy or deputy head boy. A student may join the sixth form and end up being the head boy within a year.\n\nIve brought hundreds of head teachers to Nigeria over the years, and the word is out in the UK that we need to take Nigeria seriously.\n\nTiming has also proved key, as the cost of sending children to the UK has soared. Just three years ago, the exchange rate of the local currency was 500 naira to 1; now it stands at 2,200 naira.\n\nOn top of that, the Labour government in the UK recently imposed 20% VAT on private school fees.\n\nBeyond tuition, families face additional expenses like flights for both students and visiting parents.\n\nEstablishing these schools in Nigeria allows families to maintain the same standard of education while significantly reducing the financial strain.\n\nThe annual fees at Charterhouse UK, for example, are around 60,000 ($78,000), whereas the fees at its Lagos campus are equivalent to approximately 15,000.\n\nOur main classroom teachers are expatriates, but 90% of the staff are local, says Mr Todd.\n\nBy employing local people in roles such as assistant teachers, administration, finance, human resources, marketing, facilities, security, gardeners, drivers, PAs and secretaries, the school can significantly reduce costs compared to the UK, where labour is much more expensive.\n\nA vast education gap already exists in Nigeria, with many parents opting for private education of varying quality. Many struggle to pay the higher fees rather than sending their children to government schools, which are often free but plagued by poorly trained teachers and frequent strikes.\n\nAs a result, the arrival of British schools may not drastically change Nigerias education system.\n\nHowever, they could pose a threat to established elite schools like the British International School in Lagos and The Regent School in Abuja, which opened in the early 2000s.\n\nSuch schools have long been top choices for those able to pay the annual tuition fees that often reach tens of thousands of dollars.\n\nRugby School Nigeria is coming also to support, develop and learn from the schools currently in Nigeria, says Mr Brooks, who is in charge of the schools marketing.\n\nWe are coming to help with partnerships as well, teacher training, and a whole range of initiatives.\n\nSince January, private school fees in the UK are no longer exempt from VAT\n\nMr Todd believes the Nigerian market is large enough to accommodate all the new schools without threatening existing ones. About 40% of the 200 million population is under 14.\n\nHe expects the greatest impact to be felt in the UK.\n\nWhile Charterhouse UK typically has a long waiting list and should not be affected, less sought-after boarding schools may experience a decline in enrolment owing to the new competition in Nigeria.\n\nInterest in our secondary school is very strong, says Mr Todd. We already have Nigerian parents in the UK sending their children to the Charterhouse in Nigeria for September.\n\nIn fact, reaching out to Nigerians in the UK has been one of their key marketing strategies.\n\nYou get this premier brand at a lower price, and every Nigerian has an aunt or uncle in Lagos who can be a guardian, he adds.\n\nIt could be that this trend extends to British universities. Nigerias tertiary education system faces even greater challenges than its secondary sector, with many students opting to study abroad.\n\nIn 2023, Nigeria ranked among the top 10 countries for UK student visas, according to UK government data.\n\nBut with foreign exchange difficulties and stricter visa regulations, studying abroad is becoming increasingly challenging  and universities that rely on higher international tuition fees appear to be suffering.\n\nEarlier this month, British MP Helen Hayes, chair of the parliamentary Education Committee, acknowledged the UKs higher education sector was in trouble.\n\nDozens of universities are making redundancies and cuts to courses, trying to stay afloat amid uncertainty over where their money is coming from, she said when announcing a session to consider the sectors future.\n\nIf enough Nigerian students can no longer go to the UK to study, British universities may find it profitable to come to them, as they have elsewhere in the world.\n\nIn fact, Nigerias premier university, the University of Ibadan, was established in 1948 as a campus of the University of London, with degrees awarded carrying the same value and prestige.\n\nMs Uwakwe-Okoronkwo believes many Nigerian parents would appreciate this opportunity, as it would allow their children to stay in Nigeria long enough to mature before potentially moving abroad, if they choose to do so.\n\nMany parents are worried about sending their children out of the nest too early, she says.\n\nFor Ms Oyede, whose daughter will also be starting at Rugby School in Lagos come September, the timing of all this could not be better.\n\nShe says the British school opening has already been an incentive to return home.\n\nThe prospect of university opportunities would be a welcome bonus.\n\nAdaobi Tricia Nwaubani is a freelance Nigerian journalist and novelist based in Abuja and London.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30063722/74846370-0b5e-11f0-ac9f-c37d6fd89579.jpg.webp",
            "description": "<p>By BBC FOR many years, well-off Nigerians have sent their children to prestigious British boarding schools – but now some of those institutions are setting up campuses in Africa’s most populous nation. Last year, Charterhouse launched a primary school in the city of Lagos and will open a secondary school this September. Rugby School will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-british-boarding-schools-are-so-eager-to-open-in-nigeria/\">Why British boarding schools are so eager to open in Nigeria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Celebrating Dr. Jonathan Butler: a musical icon’s journey and achievements",
            "url": "https://www.newzimbabwe.com/celebrating-dr-jonathan-butler-a-musical-icons-journey-and-achievements/",
            "content": "By IOL\n\nMUSIC legend and internationally acclaimed South African composer and songwriter Jonathan Butler was recently awarded an honorary doctorate by Stellenbosch University (SU) for his significant contributions to the arts and culture, particularly in his role as a composer, songwriter, and performer.\n\nHe was also recognised for his dedication to creating platforms that ensure access to the arts for young people from marginalised communities.\n\nSpeaking about the momentous occasion, Butler shared the emotional weight he felt as he walked up to the podium to receive his degree.\n\nWalking up to the podium was very overwhelming, he said.\n\nThe thought of this happening to me as a little boy never occurred to me at all. Seeing my family there made it even more emotional, especially considering our experience growing up.\n\nWhat we didnt have in education, we definitely had in music. I felt so incredibly proud. The weight of it all was truly amazing.\n\nButler also reflected on his ongoing work and passion for music, stating that retirement is not a concept he entertains.\n\nRetirement, whats that? To a musician, theres no such thing, he said.\n\nIm always working on new music, and I love giving back to young musicians through masterclasses.\n\nIm also involved with Lelela Charitable Non-Profit, supporting over 5,000 children in Cape Town through the arts and education. Theres no retirement in my world.\n\nOn his ongoing collaboration with other artists, Butler added, Ive written for numerous artists over the years, and collaboration has always been key to my growth as a songwriter. Its about sharing ideas and creating something beautiful together.\n\nIn his acceptance speech, Butler shared, This moment is a dream fulfilled, one that has come through beyond anything I could ever ask, think or imagine. It is a glorious day, one that I will carry in me for the rest of my life.\n\nI stand before you deeply humbled. I am filled with gratitude and joy.\n\nReflecting on his upbringing in South Africa, he spoke about the hardships he faced growing up in Belgravia Estate in Athlone, Cape Town, under the shadow of Apartheid.\n\nAs one of the first artists of colour to be played on South African radio and appear on national television at a time of severe racial segregation, Butlers achievements were groundbreaking.\n\nAs the youngest of 12 children in a family that used music to make ends meet, Butler began touring at the age of seven when he joined a travelling stage show.\n\nHe was later signed to perform on a string of hit recordings, turning him into a local teen idol. His influence grew, and he later became a key voice in the international movement advocating for the release of Nelson Mandela and other political prisoners.\n\nHaving made a name for himself in Africa and the United Kingdom (UK), Butlers breakthrough in the United States came in 1987 when he toured as pop star Whitney Houstons opening act.\n\nThat same year, his Grammy-nominated hit single Lies reached #27 on Billboards Hot 100 chart and peaked at #18 on the UK Official Singles Chart.\n\nHis cover of If Youre Ready (Come Go with Me) with Ruby Turner also made waves in the UK. Over the years, he has released over 28 albums, including several gospel projects, with his track Falling In Love with Jesus being one of his most beloved songs.\n\nDespite his international acclaim, Butler has remained grounded and true to his roots. He is the first Global Entertainment Ambassador for the Lalela Foundation, which provides arts education for at-risk youth in South Africa. Through its arts curriculum and messaging, Lalela directly serves more than 5,000 South African learners per week.\n\nButler continues to make music across multiple genres and tours the world. His latest album, Ubuntu, features a collaboration with iconic artist Stevie Wonder on a cover version of Wonders song Superwoman.\n\nReflecting on his deep connection to South Africa, he expressed his ongoing commitment to young musicians in Cape Town through the non-profit Arts Capital. My heart always longs for my home, he shared. I come back every year to work with young musicians and share stories with them.\n\nTo aspiring musicians, Butler offered a message of hope and determination: To the young Jonathan Butlers out there, look up at the sky and believe that one day, youll take flight into your future. Practice, practice, practice, and always remember where you come from.\n\nAs he proudly accepted the honorary doctorate, Butler concluded, Its a proud moment for me, for my family, and for the community I come from.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30063108/Dr-Jonathan-Kenneth-Butler-at-the-graduation-ceremony.webp",
            "description": "<p>By IOL  MUSIC legend and internationally acclaimed South African composer and songwriter Jonathan Butler was recently awarded an honorary doctorate by Stellenbosch University (SU) for his significant contributions to the arts and culture, particularly in his role as a composer, songwriter, and performer. He was also recognised for his dedication to creating platforms that ensure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/celebrating-dr-jonathan-butler-a-musical-icons-journey-and-achievements/\">Celebrating Dr. Jonathan Butler: a musical icon’s journey and achievements</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Four Zimbabwean nationals sentenced to life for violent robbery spree in South Africa",
            "url": "https://www.newzimbabwe.com/four-zimbabwean-nationals-sentenced-to-life-for-violent-robbery-spree-in-south-africa/",
            "content": "By Tshepo Phagane l SABC\n\nTHE High Court in Pretoria has sentenced four Zimbabwean nationals to life imprisonment for their involvement in a violent robbery spree that resulted in the deaths of SANDF member, Joel Sekano, and an innocent bystander in Brits, North West, in June 2022.\n\nThe robbers, who targeted families seated outside in the evenings, stole cellphones and money.\n\nThe crime escalated when they shot and killed Sekano, followed by the fatal shooting of a bystander at a tavern the following day.\n\nCuthbert Ndlovu Malatjila (22) from Winterveldt, Talent Moyo (31) from Oukasie, James Muzora (26), and Luckson Simbarashe Ruchapu (28) from Mabopane were found guilty of premeditated murder, robbery, and attempted murder.\n\nIn addition to life sentences for the murder of Sekano and an innocent bystander, Edward Karabo Dire, the four men received 15 years imprisonment for four counts of robbery with aggravating circumstances and five years each for three counts of attempted murder.\n\nThe court also imposed further penalties: Malatjila, Muzora, and Moyo were sentenced to a collective 25 years for two counts of possession of unlicensed firearms, and each defendant received 12 months for two counts of possessing ammunition.\n\nMalatjila, Ruchapu, and Muzora were sentenced to 12 months for being in South Africa illegally.\n\nGauteng regional spokesperson for the National Prosecuting Authority (NPA), Lumka Mahanjana, confirmed that these sentences will run concurrently with the life imprisonment terms.\n\nThe tragic incident occurred on June 16, 2022, when Sekano and his friend were standing outside his residence in Masakeng Section, Oukasie, when the four men approached them.\n\nThey robbed the victims of their cellphones and wallets, and during the robbery, Sekanos friend was struck on the head with a firearm, knocking him unconscious. The robbers then fatally shot Sekano and stole his firearm before fleeing the scene.\n\nNational Prosecuting Authority (NPA) spokesperson Lumka Mahanjana says, In court, they pleaded not guilty to the charges. However, the State led compelling evidence. And the four were convicted and later sentenced. The NPA welcomed the sentence and reaffirms its commitment for justice in the protection of South African citizens.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13182325/Pretoria_HighCourt-8440HR_extra_large.jpg",
            "description": "<p>By Tshepo Phagane l SABC  THE High Court in Pretoria has sentenced four Zimbabwean nationals to life imprisonment for their involvement in a violent robbery spree that resulted in the deaths of SANDF member, Joel Sekano, and an innocent bystander in Brits, North West, in June 2022. The robbers, who targeted families seated outside in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-zimbabwean-nationals-sentenced-to-life-for-violent-robbery-spree-in-south-africa/\">Four Zimbabwean nationals sentenced to life for violent robbery spree in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Home Affairs Minister Kazembe threatens to crash acts of ‘terrorism’ and violence",
            "url": "https://www.newzimbabwe.com/home-affairs-minister-kazembe-threatens-to-crash-acts-of-terrorism-and-violence/",
            "content": "By Staff Reporter\n\nHOME Affairs Minister Kazembe Kazembe has reiterated calls for Zimbabweans to desist from participating in planned countrywide protests, saying acts of terrorism will be met with brute force.\n\nThe warning comes in the wake of a deteriorating political situation that has witnessed acts of arson at business premises belonging to Zanu PF-linked tycoons Kuda Tagwirei and Wicknell Chivayo allegedly used as conduits by President Emmerson Mnangagwa to loot the countrys wealth.\n\nAlso, at vocal war veteran Blessed Bombshell Runesu Gezas property in Sanyati, property was torched by unknown assailants. Geza, an expelled Zanu PF Central Committee member, has been leading a crusade opposing Mnangagwas presidential term extension and calling for his immediate exit for alleged failed leadership.\n\nIn a statement, Kazembe said the State security machinery is ready to deal with perpetrators of violence.\n\nThe Government of Zimbabwe unreservedly denounces acts of terrorism and violence which unruly elements, supported by a fringe group living outside the country, intend to perpetrate on individuals and properties, thereby threatening the safety of the general public.\n\nThe countrys security services firmly stand on the side of law and order and will not hesitate to take decisive action.\n\nFollowing stage-managed, acts of arson committed yesterday in Harare and Goromonzi, the Government reassures the nation that police are hard on the spore and are working with various agencies of the State, including the Central Vehicle Registry (CVR), to get to the bottom of the matter, said Kazembe.\n\nFurthermore, the government unreservedly condemns acts of arson in Sanyati today, the law enforcement agency is investigating the matter.\n\nI want to continue to urge and encourage all Zimbabweans to resist any acts of arson and incitement to acts of wanton lawlessness.\n\nThe Home Affairs minister urged citizens to disregard calls to embark on street marches alleging those behind the planned protests were themselves criminals.\n\nMeanwhile, I want to reassure all Zimbabweans that peace prevails in the country today, tomorrow, and thereafter. They should go about their business assured of peace and tranquility in the country. As already stated, the security forces are on the lookout for any elements intent on disrupting our peace.\n\nAbove all, Zimbabweans are warned not be used by criminals who are eyeing for an opportunity to loot from businesses under the guise of planned demonstrations.\n\nHe said Zimbabweans should not be misled by old, recycled videos meant to give context to narratives being fostered by those bent on causing public disorder.\n\nMay I repeat what I said last Thursday that the government has a constitutional mandate to safeguard the security and territorial integrity of this country and security services will not apologise or renege in fulfilling this mandate, said Kazembe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/06/11054816/Home-Affairs-Minister-Kazembe-Kazembe-scaled-e1596081361631.jpg",
            "description": "<p>By Staff Reporter  HOME Affairs Minister Kazembe Kazembe has reiterated calls for Zimbabweans to desist from participating in planned countrywide protests, saying acts of ‘terrorism’ will be met with brute force. The warning comes in the wake of a deteriorating political situation that has witnessed acts of arson at business premises belonging to Zanu PF-linked</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/home-affairs-minister-kazembe-threatens-to-crash-acts-of-terrorism-and-violence/\">Home Affairs Minister Kazembe threatens to crash acts of ‘terrorism’ and violence </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "ZCTU decries globalisation’s impact on workers’ rights",
            "url": "https://www.newzimbabwe.com/zctu-decries-globalisations-impact-on-workers-rights/",
            "content": "THE Zimbabwe Congress of Trade Unions (ZCTU) has bemoaned globalisations impact on workers rights on the back of calls for stakeholders to devise strategies to ease the tide.\n\nSpeaking at the occasion to launch the Association for Labour Practitioners in Zimbabwe (ALPZ) last week, acting ZCTU Secretary General, Runesu Dzimiri said despite the positives derived from globalisation it has presented challenges for the working class.\n\nGlobalisation significantly impacts local labour laws, potentially leading to increased competition and pressure for deregulation. globalisation, characterised by increased international trade and investment, creates a competitive landscape where businesses seek to minimise costs, including labour costs.\n\nThis pressure can lead to demands for deregulation of labour laws, such as weakening minimum wage laws, reducing worker protections, and undermining collective bargaining rights. Companies may relocate production or services to countries with lower labour costs, leading to job losses and economic hardship in developed nations, he said.\n\nDzimiri said globalisation can lead to a race to the bottom where countries compete to attract investment by lowering labour standards, potentially leading to exploitation of workers.\n\nHe charged labour practitioners in the country to ensure the crafting of trade agreements that promote fair labour standards and enforcing labour laws.\n\nThe ZCTU leader said governments can strengthen labour laws and enforcement mechanisms to protect workers rights, including minimum wages, collective bargaining rights, and workplace safety regulations.\n\nRaising public awareness about the impacts of globalisation on labour rights can help to build support for policies that protect workers, added Dzimiri.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/09190825/Granite-mine-Zimbabwe_Alamy_2HJAHWD.jpeg",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) has bemoaned globalisation’s impact on worker’s rights on the back of calls for stakeholders to devise strategies to ease the tide. Speaking at the occasion to launch the Association for Labour Practitioners in Zimbabwe (ALPZ) last week, acting ZCTU Secretary General, Runesu Dzimiri said despite</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zctu-decries-globalisations-impact-on-workers-rights/\">ZCTU decries globalisation’s impact on workers’ rights</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Africa’s debt crisis under-reported: AFRODAD",
            "url": "https://www.newzimbabwe.com/africas-debt-crisis-under-reported-afrodad/",
            "content": "By Mary Taruvinga in Johannesburg\n\nAFRICAN Forum and Network on Debt and Development (AFRODAD) Executive Director Jason Braganza has expressed concern over how challenges arising from debt servicing to international monetary facilities by African countries are going unreported due to lack of information and statistics among other challenges.\n\nBraganza was speaking at the official opening of the 5th edition of the AFRODAD Media Initiative (AFROMedI) held in Sandton, Johannesburg, South Africa recently.\n\nWith half of the continent currently being in debt distress, Braganza said the need to capacitate the media for the benefit of the public and holding authorities accountable.\n\nDespite these very grave economic challenges, the role of media in reporting these challenges and the diversion of much-needed resources to debt servicing is largely going unreported.\n\nLack of information, accompanied by inaccessible debt statistics and public reporting, is undermining the publics ability to interact and play its role in holding government to account.\n\nIn Africa, as of today, more than half of the continent is facing a situation of being in debt distress or at high risk of being in debt distress, he said.\n\nFour countries have already defaulted on their debt: these are Zambia, Chad, Ethiopia, and more recently, Ghana.\n\nAccording to Braganza close to half the continents countries are paying more in debt service interest repayments than on investments in public services such as education, health, water, and sanitation.\n\nThe fifth edition of the AFROMedi was attended by 45 journalists drawn from 31 African countries.\n\nAfrodad is a Pan-African civil society organisation established over 25 years ago with the single objective of advancing African voices on issues of public debts and development finance. We are currently headquartered in Zimbabwe.\n\nThrough this years AFROMedi V, journalists were capacitated to link reparations to global development processes and to prioritise in-depth reporting that advances Africas position on reparative justice with a keen focus on public debt and related issues including taxation, trade, labour, climate finance, and legal elements of debt among others.\n\nAfrodad Executive Director urged journalists to keep in mind how this situation is undermining Africas sovereignty, emancipation from a neo-liberal, private profit-based world order, leaving Africans in a perpetual state of poverty, inequality, and indebtedness.\n\nIt is, therefore, fitting that the African Union theme of 2025 is on reparations and reparative justice for the continent, he said.\n\nSpeaking at the same event, Christian Ayiku, Afrodads Trustee member and Ghanaian economic analyst based in South Africa echoed Braganzas sentiments stating that the current debt crises Africa is facing threatens to reverse years of development gains and historical debt relief efforts.\n\nFrom the African Debt Risk Map, countries like Sudan, Somaliland, Somalia, Ghana, Sao Tome & Principe, Congo Republic, Zambia, Mozambique, Malawi, Zimbabwe, Cameroon, Angola, Central African Republic, South Sudan, Ethiopia, Chad, Eritrea, Djibouti, Gambia, Guinea-Bissau, Sierra Leone, Tunisia and Kenya are struggling from a heavy burden of debt.\n\nThe role of the media in this campaign is crucial as they are empowered to set the agenda that works for the people of the continent, he said.\n\nAFRODAD through AFROMedi, and its partners, has been working with the media to set public debt and linked issues on the agenda as a priority.\n\nThis has also played a key role in democratising the debt discourse, thus giving citizens the power to influence debt policy through electoral choices.\n\nThe media plays a crucial role in shaping public discourse, influencing policy decisions and bringing attention to socio-economic issues.\n\nTherefore, empowering journalists to set an agenda that aims at ensuring accountability and keeping people informed on key processes remains crucial.\n\nIt is important to engage journalists in this process to ensure citizens are informed and engaged.\n\nIn a nutshell, AfroMedi will offer increased capacity to report on debt reparative justice, through humanising the issues, focusing on data-driven reporting, offering historical context of injustice and proffering policy solutions from interviews with technical persons in the civil society space.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30043408/Gm4TGpcXUAA0YhU.jpeg",
            "description": "<p>By Mary Taruvinga in Johannesburg  AFRICAN Forum and Network on Debt and Development (AFRODAD) Executive Director Jason Braganza has expressed concern over how challenges arising from debt servicing to international monetary facilities by African countries are going unreported due to lack of information and statistics among other challenges. Braganza was speaking at the official opening</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africas-debt-crisis-under-reported-afrodad/\">Africa’s debt crisis under-reported: AFRODAD</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "Zanu PF activists’ homes vandalised as intra-party violence escalates amid Mnangagwa’s 2030 agenda push",
            "url": "https://www.newzimbabwe.com/zanu-pf-activists-homes-vandalised-as-intra-party-violence-escalates-amid-mnangagwas-2030-agenda-push/",
            "content": "By Staff Reporter\n\nA WAVE of politically motivated violence rocked in Zvimba West constituency Friday night as unknown assailants targeted the homes of two Zanu PF officials, smashing all their windows.\n\nThe first attack took place at the residence of Gloria Padzarondora, the Vice Chairlady of Manyame Zanu PF District, while the second, occurring just 2km away, targeted Thomas Mapfumo, another district member.\n\nThe coordinated nature of the incidents has heightened fears of escalating political violence in the constituency.\n\nThe victims are part of Zanu PF activists opposed to President Emmerson Mnangagwas 2030 agenda.\n\nA disturbing incident of vandalism occurred last night in Chiyangwa village, Zvimba West constituency, where Gloria Padzarondoras house was targeted.\n\nAll the windows were smashed by a gang of unknown assailants, who then fled the scene in a white twin-cab vehicle.\n\nWhat makes this incident even more concerning is that Padzarondora is a prominent figure in the area, serving as the Vice Chairlady of Manyame Zanu PF District.\n\nHer involvement in the last election, campaigning for Mercy Dinha against Justice Minister Ziyambi Ziyambi, may have contributed to the suspected politically motivated violence, sources told NewZimbabwe.com.\n\nMeanwhile, another district member in Zanu PF Manyame district Thomas Mapfumos house was also vandalised.\n\nAnother disturbing incident of vandalism has occurred in Zvimba West constituency, where Thomas Mapfumos house was targeted, with all windows smashed by unknown assailants.\n\nWhat is even more concerning is that this incident happened on the same night as the vandalism at Gloria Padzarondoras residence, which is approximately 2km away.\n\nThe fact that both incidents occurred on the same night suggests a possible connection or a coordinated effort by the perpetrators.\n\nIt is essential for the authorities to investigate these incidents thoroughly and take necessary measures to prevent such occurrences in the future, sources added.\n\nRecently, another vocal anti-2030 advocate, Gifford Gomwes house and car were destroyed in another attack suspected to have been the genesis of a terror campaign to silence opponents of Mnangagwas push for a third presidential term or suspension of elections due in 2028.\n\nThis comes at a time political tensions in the ruling party Zanu PF are heating up with two factions publicly fighting each other.\n\nOne loyal to Mnangagwa is advocating for the suspension of the 2028 elections to allow him to remain in power until 2030 and the other, believed to be aligned to Vice President Constantino Chiwenga, pushing for adherence to the constitutional term limits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30042037/IMG-20250328-WA0026.jpg",
            "description": "<p>By Staff Reporter A WAVE of politically motivated violence rocked in Zvimba West constituency Friday night as unknown assailants targeted the homes of two Zanu PF officials, smashing all their windows. The first attack took place at the residence of Gloria Padzarondora, the Vice Chairlady of Manyame Zanu PF District, while the second, occurring just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-activists-homes-vandalised-as-intra-party-violence-escalates-amid-mnangagwas-2030-agenda-push/\">Zanu PF activists’ homes vandalised as intra-party violence escalates amid Mnangagwa’s 2030 agenda push</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        },
        {
            "title": "15 perish in weekend road accidents",
            "url": "https://www.newzimbabwe.com/15-perish-in-weekend-road-accidents/",
            "content": "By Staff Reporter\n\nA TOTAL of 15 people died in road accidents on Saturday while several others were injured, the Zimbabwe Republic Police (ZRP) has announced.\n\nThe fatal accidents, according to police spokesperson, Commissioner Paul Nyathi took place in Norton, Chegutu and Mutare.\n\nOne among those who died is an infant.\n\nIn one of the road traffic accidents, seven people were killed while 12 others were injured when a Nissan Caravan kombi with 20 passengers on board veered off the road and overturned before landing on its left side at the 30 kilometre peg along Harare-Bulawayo road at around 1625 hours.\n\nAs a result, three adults and an infant died on the spot while three others succumbed to the injuries upon admission at Norton Hospital, Nyathi said.\n\nAnother accident took place at the 85 kilometre peg along Harare -Bulawayo Road at around 1732 hours.\n\nThree people were killed while two others were injured when a Chevrolet Trail Blazer vehicle with five passengers on board collided with a Toyota Hilux vehicle with seven passengers on board.\n\nThe Chevrolet Trail Blazer vehicle had allegedly tried to overtake the Toyota Hilux vehicle which was turning right.\n\nSubsequently, the Chevrolet Trail Blazer vehicle hit the Toyota Hilux vehicle on the right lamp. The Toyota Hilux vehicle overturned before landing on its left side, Nyathi said.\n\nTwo injured victims were admitted at Chegutu General Hospital.\n\nTwo people were killed while nine others were injured when a Toyota Townace truck with eleven passengers on board veered off the road at a curve along Pickstone-Burn Bank Road, Chegutu at around 1545 hours.\n\nAs a result, all the passengers in the loading box were thrown out of the vehicle.\n\nThe bodies of the victims were taken to Chegutu General Hospital mortuary for post-mortem while the injured are admitted at the same hospital.\n\nIn Mutare, three people were killed when a Volvo haulage truck with three passengers on board veered off the road and overturned before landing on its roof at around 1030 hours along Harare-Mutare road near Wise Owl turn-off.\n\nThe bodies of the victims were taken to Victoria Chitepo Provincial Hospital mortuary for post mortem.\n\nThe police implored motorists to observe all road rules and regulations and exercise extreme caution to safeguard lives on the roads.\n\nDrivers should be patient, observant, avoid speeding and overtaking in situations which are not safe to do so.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/23153441/Mpilo-hospital-CEO-Mabhande-accident.jpeg",
            "description": "<p>By Staff Reporter  A TOTAL of 15 people died in road accidents on Saturday while several others were injured, the Zimbabwe Republic Police (ZRP) has announced. The fatal accidents, according to police spokesperson, Commissioner Paul Nyathi took place in Norton, Chegutu and Mutare. One among those who died is an infant. “In one of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/15-perish-in-weekend-road-accidents/\">15 perish in weekend road accidents  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "30 Mar 2025"
        }
    ]
}