{
    "news": [
        {
            "title": "Norma Mngoma’s ‘Untied’ episode to air on July 15 after court ruling",
            "url": "https://www.newzimbabwe.com/norma-mngomas-untied-episode-to-air-on-july-15-after-court-ruling/",
            "content": "Sowetan Live\n\nShowmax will air the interview with former finance minister Malusi Gigabas ex-wife Nomachule Norma Mngoma in which she speaks about their failed marriage, allegations of infidelity and pornography on July 15.\n\nThe streaming service made the announcement on Thursday, just a day after the court threw out Gigabas application to stop the broadcast of the interview.\n\nNext week, its Norma Mngomas turn in the spotlight, with her episode ofUntiedairing on Tuesday July 15. Shell share her journey through marriage, divorce and how shes found the strength to pick up the pieces and start over, said Showmax publicist Katlego Molubi.\n\nGigaba argued in court papers that Mngomas interview would taint my good name and dignity I have been rebuilding from the past years after [divorce].\n\nIn responding papers, MultiChoice said Mngoma would not be conducting an in-depth TV interview about her marriage to Gigaba for the first time.\n\nThe company said there have been reports about their marital problems and there was a sex tape, and these were circulated online.\n\nUntiedcreator and executive producer at GOATGraeme Swanepoel said: For too long, womens pain has been edited, softened or silenced. This show is about handing the mic back to them, letting them narrate their own healing, their own growth and their own freedom.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/11055542/norma.png",
            "description": "<p>Sowetan Live Showmax will air the interview with former finance minister Malusi Gigaba’s ex-wife Nomachule “Norma” Mngoma in which she speaks about their failed marriage, allegations of infidelity and pornography on July 15. The streaming service made the announcement on Thursday, just a day after the court threw out Gigaba’s application to stop the broadcast</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/norma-mngomas-untied-episode-to-air-on-july-15-after-court-ruling/\">Norma Mngoma’s ‘Untied’ episode to air on July 15 after court ruling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:50",
            "date": "11 Jul 2025"
        },
        {
            "title": "Govt footing Geo Pomona refuse collection bill, not council –  Harare Mayor Mafume says",
            "url": "https://www.newzimbabwe.com/govt-footing-geo-pomona-refuse-collection-bill-not-council-harare-mayor-mafume-says/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor, Jacob Mafume, has said the City Council is not remitting funds to Geo Pomona, despite the company taking over the municipalitys refuse collection mandate under controversial circumstances.\n\nGeo Pomona Waste Management is now responsible for garbage collection in Harare under a deal spearheaded by the Ministry of Local Government and Public Works.\n\nAccording to the initial agreement, the City Council was to pay US$40 per tonne to Geo Pomona for waste disposal, raising questions about the usurping of municipal functions by a private company.\n\nHowever, Mafume has disclosed that the local authority is not paying Geo Pomona, with the government instead footing the costs of refuse collection in Harare.\n\nThe City is not paying anything to Geo Pomona. It has not paid anything. The government is the one that is paying. The issue is, I manage the City, and the City is not paying, and my mandate, as we speak, is to manage City affairs, said Mafume.\n\nThe takeover of refuse collection has drawn criticism towards the Harare City Council, which residents accuse of privatising public services, thereby shifting the payment burden onto them.\n\nMafume, who was once opposed to private partnerships but now appears to be warming up to the idea, is actively seeking organisations or individuals to partner with, as the City Council struggles to fulfil its mandate in Harare.\n\nThe HCC has failed to construct and maintain existing infrastructure, leaving it in a state of dilapidation.\n\nHowever, questions have been raised about the councils sincerity in pursuing public-private partnerships, particularly after a fallout last year with Roadport Private Limited, which nearly led to the company being barred from operating long-distance bus terminals.\n\nMafume attempted to downplay the incident as he embarks on a charm offensive to woo potential partners.\n\nWhen you have a dispute with your partner, it does not mean your marriage is not producing fruits. A Roadport was built and is used by thousands of Harare residents. So, if we have a dispute on one or two issues, it does not mean that everything is lost.\n\nThere is a tendency to highlight the problems you would have faced in an agreement while ignoring everything that has been beneficial, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10172141/geo-pomona.png",
            "description": "<p>By Darlington Gatsi HARARE Mayor, Jacob Mafume, has said the City Council is not remitting funds to Geo Pomona, despite the company taking over the municipality’s refuse collection mandate under controversial circumstances. Geo Pomona Waste Management is now responsible for garbage collection in Harare under a deal spearheaded by the Ministry of Local Government and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-footing-geo-pomona-refuse-collection-bill-not-council-harare-mayor-mafume-says/\">Govt footing Geo Pomona refuse collection bill, not council –  Harare Mayor Mafume says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:50",
            "date": "11 Jul 2025"
        },
        {
            "title": "APEX Travel Zimbabwe: A decade of grit, growth, and guts in entrepreneurship",
            "url": "https://www.newzimbabwe.com/apex-travel-zimbabwe-a-decade-of-grit-growth-and-guts-in-entrepreneurship/",
            "content": "By Anna Chibamu\n\nBorn in 1989 as the youngest and only son in a family of three, Tanaka Tank Mupfurutsa has remained steadfast in his pursuit of business success, undeterred by the unpredictable highs and lows of entrepreneurship.\n\nWhile his siblings have sought opportunities abroad, Mupfurutsa chose to stay in Zimbabwe, founding Apex Travel Zimbabwe, a premier travel and tours operator among other business ventures.\n\nHe continues to navigate the countrys challenging economic terrain with courage and determination, all while supporting his family and building a name for himself in the local business landscape.\n\nAt just 19 years old, he launched Black Bean Investments, a candle and maputi (puffed maize snack) manufacturing company  laying the foundation for a bigger vision.\n\nIn an interview withNewZimbabwe.com, Mupfurutsa shares his successes and sorrows, highlighting the guiding principle behind his resilience: Keep changing. Nothing will work without God in it.\n\nIt was not easy, he said, recalling his encounters with the police after overloading his car with maputi but this did not deter him from achieving his goals.\n\nInstead, they became anecdotes of persistence and hustle.\n\nMupfurutsa invested in his own maputi machines. Scaling up, he was processing tonnes of maize and supplying major retailers.\n\nA milestone came when he landed a contract with Afro Foods, distributing 10,000 packets three times a week to over 15 retail outlets around Harare City. The business later suffered due to the collapse of Afro Foods but he remained undeterred.\n\nWhile pursuing a Business Studies and Computing Science degree at the University of Zimbabwe (graduated 2013), Mupfurutsa co-founded Campus Culture, where he served as finance director.\n\nThe student-led enterprise published magazines, hosted events, and even represented the university in a national ICT innovation competition.\n\nDespite multiple job offers, including from Delta Beverages and Document Support Centre, he chose entrepreneurship  the less-travelled path, and that was the birth of Apex Travel.\n\nApex Travel was formally registered in 2014 as an educational tours company.With unwavering zeal, Mupfurutsa and his team visited over ten schools daily, earning the trust of clients one handshake at a time.\n\nApex Travel grew into a leading brand, known for luxurious and unforgettable school trips. The company revolutionised the industry by offering high-end experiences to studentsluxury coach rides, five-star hotel stays, and fully guided educational experiences.\n\nOne of Apex Travels historic achievements was chartering a full Boeing aircraft through Fly Africa, taking 140 students from Haig Park Primary School to Victoria Falls.\n\nAnother proud moment came when Apex Travel booked out the entire Caribbea Bay Hotel for a school tour. Apex became a household name in schools across Zimbabwe and was known for setting industry trends.\n\nHowever, corruption eventually infiltrated the school tours sector. Demands for backhand commissions made it unsustainable to maintain quality while staying profitable. Mupfurutsa responded with agility, pivoting once more.\n\nThe business expanded rapidly: Apex now included car rental, vehicle tracking, and eventually roadside assistance.\n\nTheir custom vehicle tracking system became a unique product in Zimbabwe. Developed in collaboration with Chinese manufacturers, Apex Trackers now provide features such as live tracking, remote vehicle immobilisation, driver behaviour analytics, geo-fencing, playback history, and microphone surveillance.\n\nApex Travelenforces strict client verification, including fingerprinting and ID capture, which has helped maintain a clean fleet and high customer integrity.\n\nThe car rental fleet grew to include sedans, mid-range SUVs, double cabs, fuel savers, luxury SUVs like the 300 series, and Mercedes-Benz S-Class models.\n\nInterestingly, COVID-19 became a defining period for Apex Travel. Though the travel business paused, car rental surged as companies sought vehicles for restricted local movement.\n\nMupfurutsa reallocated funds from his home construction to fleet expansion, turning a crisis into an opportunity. It was during this time that Apex Travel solidified car rental as its flagship division.\n\nIn addition to that, Mupfurutsa acquired haulage trucks from a distressed seller, further diversifying his assets. With no initial plan, he instinctively knew it was a strategic purchase and it proved fruitful.\n\nHis late father was always the first to test-drive any new vehicle and validate each major acquisition. His passing in February 2023 from cancer was a deep personal loss, but his legacy remains central to Mupfurutsas journey.\n\nMupfurutsas personal resilience was again tested when their nearly completed family home caught fire due to negligence by a caretaker.\n\nDespite the destruction, his father encouraged him to finish the project, calling it the test of time. With support from loyal contractors, some whom refused payment, he rebuilt the house.\n\nToday, Tanaka Mupfurutsa stands tall as a visionary entrepreneur, husband, father, and innovator who continues to grow Apex Travel into one of Zimbabwes most dynamic service providers across travel, logistics, and tech-enabled fleet services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10192849/Apex-Tanaka.png",
            "description": "<p>By Anna Chibamu Born in 1989 as the youngest and only son in a family of three, Tanaka “Tank” Mupfurutsa has remained steadfast in his pursuit of business success, undeterred by the unpredictable highs and lows of entrepreneurship. While his siblings have sought opportunities abroad, Mupfurutsa chose to stay in Zimbabwe, founding Apex Travel Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/apex-travel-zimbabwe-a-decade-of-grit-growth-and-guts-in-entrepreneurship/\">APEX Travel Zimbabwe: A decade of grit, growth, and guts in entrepreneurship</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:50",
            "date": "11 Jul 2025"
        },
        {
            "title": "African Sun in US$18 million transaction agreement for Monomotapa Hotel disposal",
            "url": "https://www.newzimbabwe.com/african-sun-in-us18-million-transaction-agreement-for-monomotapa-hotel-disposal/",
            "content": "By Alois Vinga\n\nTOP hospitality group, African Sun Limited (ASL) has penned a US$18 million transaction agreement for the disposal of Monomotapa Hotel.\n\nThe group has since placed some of its assets like the Great Zimbabwe Hotel, and the Carribea Bay on the market in line with the groups strategy to raise adequate capital to invest in other areas of interest.\n\nIn a recent Cautionary Statement to shareholders, the hospitality group has reached a transactional agreement with the Public Service Pension Fund.\n\nTransactional agreements for the disposal of the Monomotapa Hotel land, buildings, adjacent car park and associated hotel business as a going concern, for US$18 million (plus any applicable VAT), have now been signed subject to the conditions precedent below.\n\nThe transaction involves two parts: Monomotapa Hospitality (Private) Limited, in which the Public Service Pension Fund has an interest, will acquire the hotel business and associated assets, while the Public Service Pension Fund will directly acquire the hotel land, buildings, and car park, as a single, integrated transaction, the group said in a statement.\n\nThe hospitality group is now seekingshareholder approval since the transaction constitutes a Category 1 transaction, which subjects it to an Extraordinary General Meeting (EGM),(for which a detailed circular will shortly be published.\n\nTHE EGM will be convened at a date soon to be announced, as well as seeking approval from the Competition and Tariff Commission (CTC).\n\nShareholders and the investing public are therefore advised to continue exercising caution when dealing with the Companys securities until advised of the conclusion of the said ongoing processes, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga TOP hospitality group, African Sun Limited (ASL) has penned a US$18 million transaction agreement for the disposal of Monomotapa Hotel. The group has since placed some of its assets like the Great Zimbabwe Hotel, and the Carribea Bay on the market in line with the group’s strategy to raise adequate capital to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-in-us18-million-transaction-agreement-for-monomotapa-hotel-disposal/\">African Sun in US$18 million transaction agreement for Monomotapa Hotel disposal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:50",
            "date": "11 Jul 2025"
        },
        {
            "title": "CZI commends easing ZWG inflation rates",
            "url": "https://www.newzimbabwe.com/czi-commends-easing-zwg-inflation-rates/",
            "content": "By Alois Vinga\n\nTHE Confederation of Zimbabwe Industries (CZI) says easing ZWG rates are indicative of the local currencys economic stabilising effect.\n\nThe ZiG month-on-month inflation slightly decreased to settle at 0.3% in the month of June 2025 from 0.9% recorded in the month of May 2025.\n\nThe prolonged period of inflation at rates below 1% since February 2025 generally reflect a ZiG price stabilising economy. In addition, this may also indicate success of monetary policy in restoring price discipline as compared to past experiences with the Zimbabwean dollar (ZWL), said CZI.\n\nThe industry lobby group said the low levels of inflation will help build trust in the currency, which might also encourage greater usage of ZiG in transactions and could also boost the likelihood of a gradual de-dollarisation process leading to a ZiG mono currency regime by 2030.\n\nThe ZiG year-on-year inflation rate slightly increased to settle at 92.5% in the month of June 2025 (Figure 2), gaining 0.4 percentage points from a rate of 92.1% recorded in May 2025. While the month-on-month inflation is showing that inflation is currently under control, the high annual inflation rate reflects historical price instability legacies whose effects are still at play, said CZI.\n\nThe industry lobby group said the high annual inflation level creates pricing uncertainty, making it difficult for businesses to set prices, forecast costs, or even to negotiate contracts.\n\nTherefore, sustaining month-on-month inflation at the current low rates is crucial for eliminating this high annual inflation, which is expected to only start falling in October 2025. Only then will restoring confidence in the ZiG, protecting real incomes, and supporting sustainable economic recovery become more realistic, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>By Alois Vinga THE Confederation of Zimbabwe Industries (CZI) says easing ZWG rates are indicative of the local currency’s economic stabilising effect. The ZiG month-on-month inflation slightly decreased to settle at 0.3% in the month of June 2025 from 0.9% recorded in the month of May 2025. “The prolonged period of inflation at rates below</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-commends-easing-zwg-inflation-rates/\">CZI commends easing ZWG inflation rates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:50",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zimbabwe currency reserves backing ZiG climb to record",
            "url": "https://www.newzimbabwe.com/zimbabwe-currency-reserves-backing-zig-climb-to-record/",
            "content": "Bloomberg\n\nGold and foreign-currency reserves backing Zimbabwes bullion-linked monetary unit rose to a record in June, the central bank said.\n\nThe reserves climbed to $731 million from $639 million in May and $276 million in April last year, when the nation introduced Zimbabwe Gold, the currency known as the ZiG, the central bank said in a statement Wednesday.\n\nYears of economic mismanagement doomed five attempts to create a functioning currency in the southern African nation, with the ZiG replacing the defunct Zimbabwean dollar, which was in freefall.\n\nAuthorities now want the new unit to supersede the US dollar, which since 2009 has functioned as a dual transacting currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Gold and foreign-currency reserves backing Zimbabwe’s bullion-linked monetary unit rose to a record in June, the central bank said. The reserves climbed to $731 million from $639 million in May and $276 million in April last year, when the nation introduced Zimbabwe Gold, the currency known as the ZiG, the central bank said in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-currency-reserves-backing-zig-climb-to-record/\">Zimbabwe currency reserves backing ZiG climb to record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:50",
            "date": "11 Jul 2025"
        }
    ]
}