{
    "news": [
        {
            "title": "Supreme Court resurrects US$8 million chrome feud in Guruve Dyke",
            "url": "https://www.newzimbabwe.com/supreme-court-resurrects-us8-million-chrome-feud-in-guruve-dyke/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has granted chrome miner Monochrome (Pvt) Ltd permission to revive its appeal in a long-running multimillion-dollar mining battle, ruling that the company has bright prospects of success in its US$8.1 million damages claim against rivals Kehrai Investments and Labenmon Investments.\n\nThe judgment, delivered by Justice Chinembiri Bhunu condoned Monochromes procedural delays and extended time for the company to file its appeal against a High Court ruling that dismissed its US$8,173,188 claim.\n\nThe courts are generally loath to punish litigants for the sins of their lawyers unless such conduct is gross and unpardonable. The ends of justice demand that whenever possible, justice be dispensed on the merits rather than on technicalities, Bhunu said.\n\nIn 2018, when Monochrome accused Kehrai and Labenmon of illegally mining alluvial chrome on six of its claims in the Guruve North Dyke Msasa 122 to 127 and sued for damages, representing lost profits.\n\nMonochrome argued that surveys by the Ministry of Mines confirmed encroachment, supported by a geological expert who presented diagrams, pictures, and stockpile estimates of the extracted chrome.\n\nThe defendants denied wrongdoing. Kehrai failed to appear, resulting in a default judgment against it, while Labenmon insisted it mined lawfully under a contract with Kehrai, challenging Monochromes ownership and the scale of damages claimed.\n\nIn 2023, the High Court sided with Labenmon, ruling Monochrome had not proved ownership, the extent of extraction, or the US$8 million loss.\n\nBut Bhunu found that the appeal raises weighty issues, especially after Kehrai capitulated by failing to defend ownership of the disputed claims.\n\nThe applicant has sound and reasonable prospects of success on appeal given that the first respondents ownership of the mining claims has been severely dented by the extant default judgment against it, Bhunu ruled.\n\nThe second respondent is merely riding on the back of the first respondent as the source of its mining rights. That being the case, it is likely to fall with the capitulation of its principal.\n\nThe Supreme Court ordered Monochrome to file its appeal within 10 days, paving the way for a full hearing on the merits of the chrome feud.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has granted chrome miner Monochrome (Pvt) Ltd permission to revive its appeal in a long-running multimillion-dollar mining battle, ruling that the company has “bright prospects of success” in its US$8.1 million damages claim against rivals Kehrai Investments and Labenmon Investments. The judgment, delivered by Justice Chinembiri Bhunu condoned Monochrome’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-resurrects-us8-million-chrome-feud-in-guruve-dyke/\">Supreme Court resurrects US$8 million chrome feud in Guruve Dyke</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "08 Oct 2025"
        },
        {
            "title": "High Court dismisses sex offender’s bid to revive case over ‘crucial witness’",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-sex-offenders-bid-to-revive-case-over-crucial-witness/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an application by convicted sex offender Levison Popi, who sought to review his trial on the grounds that a key defence witness was not called.\n\nJustice Sinabuliso Siziba, sitting at Mutare High Court, ruled that Popis chamber application, filed five months after his conviction, was an afterthought and lacked merit.\n\nThe explanation for the delay is unreasonable. It defies logic why he would obtain advice at that early stage from his inmates and neglect to inquire from his lawyer, Siziba said.\n\nPopi was convicted on 16 December 2024 of attempted indecent assault under Zimbabwes Criminal Law (Codification and Reform) Act. His initial appeal was struck off the roll in March 2025 for being fatally defective.\n\nHe later argued that the trial magistrate had failed to explain his right to call a witness, Alice Nyanjowa, who has since died. Nyanjowa had previously stated that she was present in the room during the alleged incident but did not observe anything concerning the allegations.\n\nBut the judge found no irregularity in the lower court proceedings.\n\nA perusal of the record indicates in no uncertain terms that the applicant was advised by the trial magistrate of his right to adduce evidence on his own and also through his witnesses. He then testified and also called two witnesses, the judge noted.\n\nThe court further stressed that it was Popis choice, not the courts or the prosecutors, to omit the deceased witness from his defence.\n\nThe prosecutor had no duty or right to choose witnesses for the applicant. He called the other witnesses and left out the very witness that he now complains of having been left out, Siziba ruled.\n\nThe application was dismissed with costs.\n\nPopi was arrested in 2024 after he was accused of attempting to indecently assault a woman. Prosecutors alleged that he made unwanted sexual advances that fell short of full assault but still contravened Zimbabwes criminal statutes.\n\nDuring his trial, Popi denied the allegations and presented two witnesses in his defence. However, the court found the complainants testimony credible and convicted him of attempted indecent assault.\n\nOn appeal, his challenge to the conviction was struck off the roll in March 2025. His latest effort, a chamber application seeking to revive the case by relying on the statement of the now-deceased witness, Alice Nyanjowa has now also failed, leaving his conviction intact.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19055619/mutare.png",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an application by convicted sex offender Levison Popi, who sought to review his trial on the grounds that a key defence witness was not called. Justice Sinabuliso Siziba, sitting at Mutare High Court, ruled that Popi’s chamber application, filed five months after his conviction, was “an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-sex-offenders-bid-to-revive-case-over-crucial-witness/\">High Court dismisses sex offender’s bid to revive case over ‘crucial witness’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "08 Oct 2025"
        },
        {
            "title": "Farmer accused of killing two women admits to tossing their bodies into pigsty",
            "url": "https://www.newzimbabwe.com/farmer-accused-of-killing-two-women-admits-to-tossing-their-bodies-into-pigsty/",
            "content": "Sowetan Live\n\nThe Limpopo pig farmer accused of killing two women who were scavenging for food on his property told the court that when he was alerted to the body of one of his victims, he panicked and left the scene until he returned the following day and put it in an empty pigsty.\n\nHe said he had expected the person who accompanied the intruders to come and collect the body. Then when they discovered the second body the following day, he and his employees also put it in a pigsty.\n\nThis is contained in an affidavit of Zachariah Johannes Olivier, which was read out in the Polokwane high court on Tuesday. Olivier denies that he intentionally killed Maria Makgato, 45 and Locadia Ndlovu, 34, in August last year then fed them to the pigs. Ndlovus husband survived the attack.\n\nHe said he had gone to the to spot where the women were shot expecting to see trespassers and he had tried to frighten them by shooting at them.\n\nOlivier, 60, and co-accused William Musora, 50, entered the second day of the trial yesterday. They face charges of murder, attempted murder, employing an illegal immigrant who does not possess a work permit and the possession of an unlicensed firearm.\n\nMusora, a Zimbabwean national, faces a further charge of contravention of the Immigration Act, for being in SA illegally.\n\nOn Monday, in a panicked state, I proceeded to cut up both rifles that were used to shoot the warning shots into pieces, and I disposed of such pieces as I was scared and disgusted with the rifles and what had transpired\n\nZachariah Johannes Olivier, farmer\n\nIn his affidavit, Olivier claims that after the discovery of the two bodies, he panicked and went home before returning the following day to destroy the guns used to shoot the two women.\n\nOn Monday, in a panicked state, I proceeded to cut up both rifles that were used to shoot the warning shots into pieces, and I disposed of such pieces as I was scared and disgusted with the rifles and what had transpired.\n\nI never had any intention of defeating the purpose of the administration of justice. I simply panicked and acted out of an extreme level of shock.\n\nAccording to Olivier, he called the police the following day as I could not deal with the situation any longer.\n\nThe state has since withdrawn charges against another farmworker, Adrian de Wet, 19, who is now a state witness. In his affidavit, Olivier claims that he was with de Wet on the night that the women were shot. De Wet, he claims, also fired shots.\n\nSpeaking to Sowetan outside court, Makgatos grieving mother said she will never forgive those who cut short her daughters life.\n\nWhy did he have to kill my child in such a brutal manner? Why did he not inform the police that people were trespassing on his farm, asked Moyahabo Mokgato.\n\nThe pensioner said she has been battling to take care of her household as well as her late daughters children aged 5, 12, 16 and 22 since Marias death.\n\nAfter they murdered my child, I am now struggling, as I do not work. Im unable to provide for my family.\n\nI cannot forgive them, she said.\n\nDuring proceedings, judge Jane Ngobeni informed the two men that should they be convicted of murder, they face life in prison. If they are first offenders, the sentence wont be less than 15 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08052921/limpopo-pig-farmer.jpg",
            "description": "<p>Sowetan Live The Limpopo pig farmer accused of killing two women who were scavenging for food on his property told the court that when he was alerted to the body of one of his victims, he panicked and left the scene until he returned the following day and put it in an empty pigsty. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/farmer-accused-of-killing-two-women-admits-to-tossing-their-bodies-into-pigsty/\">Farmer accused of killing two women admits to tossing their bodies into pigsty</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "08 Oct 2025"
        },
        {
            "title": "South Africa extends Zimbabwe’s Exemption Permit by 18 months",
            "url": "https://www.newzimbabwe.com/south-africa-extends-zimbabwes-exemption-permit-by-18-months/",
            "content": "By Leopold Munhende\n\nSOUTH Africa has extended the validity of the Zimbabwean Exemption Permit (ZEP) until May 28, 2027.\n\nIntroduced as a means to control the influx of Zimbabwean migrants prior to 2009, the validity of the ZEP has been constantly extended to bar their deportation and allow them work opportunities.\n\nHome Affairs Minister Leon Amos Schreiber announced the extension in a public notice,Ministers Immigration Directive No. 21 of 2025, released this week.\n\nI have decided to extend the validity of the Zimbabwean Exemption Permits (ZEP) until 28 May 2027, read Schreibers directive.\n\nI directed that existing ZEPs shall be deemed to remain valid for an additional 18 months after the current expiry date of 28 November 2025.\n\nThe November 28 expiration date had been set by another extension in November last year, months after a decision to terminate the ZEP was challenged and deemed illegal by the South African High Court.\n\nAccording to a 2022 census, there are a million Zimbabweans in South Africa, with estimates putting the number at five million when considering those who migrate through illegal entry points.\n\nThe one million represented 45% of South Africas immigrant population then.\n\nFleeing economic and political strife, Zimbabweans have for decades found it easy to move to their southern neighbours despite growing discontent.\n\nIllegal openings along the Limpopo border have served millions since the hyperinflation period in the 2000s, when many chose to move down south.\n\nIn April this year, Schreiber appointed an Immigration Advisory Board (IAB) to deliberate on the ZEP and other related matters.\n\nThe IAB is yet to find a permanent solution to the ZEP.\n\nAdded Schreiber: The IAB has met on several occasions and deliberated amongst themselves on the immediate future and a long-term solution for holders of ZEP permits.\n\nCritical stakeholders will need to be part of a consultation process.\n\nAlthough South Africa has generally been proven unfriendly to foreigners, a campaign specifically against migrants without permits is currently dominating its industrial capital, Johannesburg.\n\nReferred to as Operation Dudula, a ragtag unit of vigilantes, they would initially hunt and capture for deportation any undocumented foreigner.\n\nThe group has extended its tentacles in public hospitals where it has barred foreigners from getting medical assistance and public schools where children of foreign nationals are being barred from accessing basic education.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>By Leopold Munhende SOUTH Africa has extended the validity of the Zimbabwean Exemption Permit (ZEP) until May 28, 2027. Introduced as a means to control the influx of Zimbabwean migrants prior to 2009, the validity of the ZEP has been constantly extended to bar their deportation and allow them work opportunities. Home Affairs Minister Leon</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-extends-zimbabwes-exemption-permit-by-18-months/\">South Africa extends Zimbabwe’s Exemption Permit by 18 months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "08 Oct 2025"
        },
        {
            "title": "Government slashes business licence fees",
            "url": "https://www.newzimbabwe.com/government-slashes-business-licence-fees/",
            "content": "By Alois Vinga\n\nIn a bold move to improve the ease of doing business, the government has embarked on a sweeping reform of the countrys licensing framework, aimed at cutting bureaucratic inefficiencies and aligning with global best practices.\n\nThe latest efforts are designed to lower operational costs, reduce redundant charges, and simplify procedures, positioning Zimbabwe as a more attractive destination for both local and foreign investors.\n\nSpeaking at a Post-Cabinet Media Briefing in Harare on Tuesday, Minister of InformationJenfan Muswere said the cabinet had approved several key measures to revamp the business environment.\n\nCabinet has approved significant reductions and eliminations of business licence fees to foster private sector growth and reduce barriers to entry, he said.\n\nA major feature of the overhaul is the consolidation of multiple, overlapping licence requirements into a single, streamlined business licence. The government will also remove redundant permits and reduce or eliminate high fees that have long hindered business operations, particularly in the wholesale and retail sectors.\n\nUnder the new framework, the Liquor licence application fee will be reduced from US$1,080 for wholesalers to just US$20 across all sectors, significantly improving access for small and medium enterprises.\n\nThe Medicines Control Authority of Zimbabwe (MCAZ) will scrap the US$200 fee previously charged for trading in veterinary products, while the local bakery licence fee of US$703 will be abolished entirely. In addition, local authority licence fees will be capped to ensure uniformity nationwide.\n\nMuswere noted that the changes were part of an ongoing process, with further refinements expected before the new regulations are gazetted.\n\nFinance Minister Professor Mthuli Ncube acknowledged that high local authority fees had discouraged investment, adding that their reduction would help stimulate private sector participation, a critical driver for maintaining economic growth above six percent.\n\nMeanwhile, Lands, Agriculture, Fisheries, Water, and Rural Development MinisterAnxious Masuka highlighted ongoing progress in water infrastructure development, with 12 new dams currently under construction.\n\nHe said these projects are vital for strengthening the agricultural sectors resilience to climate change and ensuring long-term food security.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga In a bold move to improve the ease of doing business, the government has embarked on a sweeping reform of the country’s licensing framework, aimed at cutting bureaucratic inefficiencies and aligning with global best practices. The latest efforts are designed to lower operational costs, reduce redundant charges, and simplify procedures, positioning Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-slashes-business-licence-fees/\">Government slashes business licence fees</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "08 Oct 2025"
        },
        {
            "title": "Mutodi removed as Parliamentary Committee chair over bribery claims against Finance Ministry PS Guvamatanga",
            "url": "https://www.newzimbabwe.com/mutodi-removed-as-parliamentary-committee-chair-over-bribery-claims-against-finance-ministry-ps-guvamatanga/",
            "content": "By Staff Reporter\n\nBikita South MP Energy Mutodi has been removed from his position as Chairperson of Parliaments Portfolio Committee on Budget, Finance and Economic Development following allegations he made against Finance Ministry Permanent Secretary George Guvamatanga, accusing him of receiving multi-million dollar kickbacks from government contractors.\n\nIn a post on X last week, Mutodi claimed Parliament had received complaints regarding Guvamatangas conduct and alleged that he was demanding payments of between 5% and 10% from ministries and departments to facilitate Treasury disbursements.\n\nMutodi further alleged that Guvamatangas wealth, which he said includes several mansions and over 5,000 dairy cattle, was built from illicit proceeds amounting to more than US$1 billion.\n\nThe MP repeated his claims in Parliament, calling for Guvamatanga to be summoned to clear his name, before later retracting the allegations and issuing a public apology.\n\nA letter seen byNewZimbabwe.comfrom Speaker of Parliament Jacob Mudenda informed Mutodi of his dismissal from the committee chairmanship. He has since been replaced by Chipinge East MP Lincoln Dhliwayo.\n\nThis serves to notify you that pursuant to Standing Order No. 19 of the National Assembly, the Committee on Standing Rules and Orders (CSRO) has resolved to terminate your tenure as Chairperson of the Portfolio Committee on Budget, Finance and Investment Promotion with immediate effect.\n\nConsequently, all benefits and entitlements attendant upon the said role shall likewise be discontinued forthwith. Please be guided accordingly, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/05195520/Energy-Mutodi.jpg",
            "description": "<p>By Staff Reporter Bikita South MP Energy Mutodi has been removed from his position as Chairperson of Parliament’s Portfolio Committee on Budget, Finance and Economic Development following allegations he made against Finance Ministry Permanent Secretary George Guvamatanga, accusing him of receiving multi-million dollar kickbacks from government contractors. In a post on X last week, Mutodi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutodi-removed-as-parliamentary-committee-chair-over-bribery-claims-against-finance-ministry-ps-guvamatanga/\">Mutodi removed as Parliamentary Committee chair over bribery claims against Finance Ministry PS Guvamatanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "08 Oct 2025"
        }
    ]
}