{
    "news": [
        {
            "title": "Harare Mayor Mafume fears temporary ban on Rufaro Stadium as facility deteriorates",
            "url": "https://www.newzimbabwe.com/harare-mayor-mafume-fears-temporary-ban-on-rufaro-stadium-as-facility-deteriorates/",
            "content": "By Darlington Gatsi\n\nRUFARO STADIUM could be on the brink of condemnation as the iconic venue continuesto show visible signs of deterioration just one year after reopening to host top-flight matches.\n\nThe imposing Mbare facility is struggling to withstand the demands of hosting elite fixtures, with the pitch visibly damaged, posing a danger to players.\n\nRufaro Stadium is home to Dynamos, CAPS United, Herentals, and Scottland FC. The ground is also used by Division One clubs, further straining its capacity.\n\nWith midweek Castle Lager Premier Soccer League matches scheduled, Rufaro would have hosted six encounters in 11 days, excluding Northern Region Division One games.\n\nSpeaking at a recent council meeting at Town House, Harare Mayor Jacob Mafume expressed concerns that the stadium could be barred from hosting top-tier matches.\n\nTwo weeks is too long. The renovations must be done because the stadium is about to be condemned again, Mafume told councillors.\n\nShould Rufaro be condemned, Premier Soccer League (PSL) teams in Harare could be left in limbo unless the City Council acts swiftly to upgrade the facility.\n\nEarlier this year, the council announced a partnership with Scottland FC, owned by Mabvuku Member of Parliament Pedzai Scott Sakupwanya, to renovate the stadium.\n\nHowever, no notable improvements have been made since, dashing Mafumes hopes of the venue hosting international matches.\n\nThe installation of bucket seats, which Mafume had promised would be completed by mid-year, remains far behind schedule.\n\nInstallation of electronic turnstiles is yet to be completed. Rufaro stadium is still using an archaic scoreboard, another task on the hands of Mafume-led Council.\n\nRufaro Stadium reflects the broader decline of sports facilities under the Harare City Council (HCC), many of which are in deplorable condition.\n\nMafume told councillors he was tired of apologising for the state of council-owned facilities.\n\nThe state of City Sportslet us look at them. Every time, I have to apologise when I arrive at any council facility. It is not nice. The place does not look good, but there are simple things we should fix, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/05120417/rufaro-1.jpg",
            "description": "<p>By Darlington Gatsi RUFARO STADIUM could be on the brink of condemnation as the iconic venue continues to show visible signs of deterioration just one year after reopening to host top-flight matches. The imposing Mbare facility is struggling to withstand the demands of hosting elite fixtures, with the pitch visibly damaged, posing a danger to players.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-mayor-mafume-fears-temporary-ban-on-rufaro-stadium-as-facility-deteriorates/\">Harare Mayor Mafume fears temporary ban on Rufaro Stadium as facility deteriorates </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "How Zimbabwe’s Health System Profits From the Dead",
            "url": "https://www.newzimbabwe.com/how-zimbabwes-health-system-profits-from-the-dead/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Blessing Mucharambeis uncle was just having lunch when he stood up, then collapsed. [He] started bleeding from the nose, she says, and died on the spot.\n\nAs far as his family knew, he had no health problems. As they struggled to make sense of the news, Chitungwiza Hospital  where his body had been taken to a mortuary  told them that a forensic postmortem would be required.\n\nZimbabwean law mandates postmortems for sudden or unexplained deaths, and public hospitals offer them for free. But there are only five qualified pathologists in Zimbabwe serving a population of close to 17 million people. The wait could stretch for days. And each day the funeral was delayed would add to the cost of hosting mourners, as some traditions require.\n\nA police officer stationed at the hospital offered them a workaround. Instead of a forensic postmortem, they could do a general one  an option when no foul play is suspected, and quicker since it doesnt require a specialist. But even that, he warned, could take days. He offered to fast-track the process for a US$30 fee. Desperate to bury their loved one, they paid.\n\nWe couldnt afford the time, Mucharambei says. We did it because we had no choice.\n\nPostmortem bribes are just one element of a health system  and state  in freefall.Hospitals across the country are plaguedby chronic underfunding, obsolete infrastructure and the mass emigration of medical professionals seeking better pay abroad. The government estimates that the country needs more than US$1.6 billion for its health sector to recover.\n\nUnderpaid and overstretched health workers have come to rely on informal payments as a means of survival, says Dr. Norman Matara, secretary general of the Zimbabwe Hospital Doctors Association. People are trying to survive. But over time, corruption becomes part of the culture.\n\nHe says its a common problem across hospital services, from the moment a patient is admitted.New mothers, for example, face extortionfor birth cards meant to be free. A 2021 study from Transparency International Zimbabwe surveyed over 1,000 people in Zimbabwe and found that 74% had been asked to pay a bribe while trying to access health care services.\n\nIn March, a nurses protest at Sally Mugabe Central Hospital  the largest referral hospital in the country  exposed how dire the situation is. It was the latest in a long history of strikes by health workers, who have repeatedly protested poor pay and deteriorating working conditions. But their actions are often met with intimidation. In June 2022, the government responded to a strike by passing a law banning health care workers from striking longer than 72 hours, with penalties of up to six months in jail for participants and organizers.\n\nA hospital corridor leads to the mortuary at Parirenyatwa Hospital. Zimbabwes public health system faces a severe shortage of pathologists, leading to postmortem delays and widespread bribery. Families say theyre often pressured to pay unofficial fees to expedite the process or obtain basic information about their loved ones.Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nPathology services are particularly strained, Matara says. The few available specialists are clustered in major hospitals, which creates opportunities for exploitation.\n\nFew medical students choose the career, and those who do face an uphill battle. Training programs are underfunded, mentorship is scarce and working conditions at public hospitals are dismal.\n\nBut this is partly a manufactured problem, says Memory, a nurse at Sally Mugabe Central Hospital, who asked to use her middle name for fear of losing her job. Memory has worked at the hospitals mortuary close to 20 years.\n\nThere isnt really a backlog but a fake one is created by police officers, the doctors and mortuary staff to pressure families into paying, she says.\n\nThese services are supposed to be easily available, she adds. A Cuban doctor performs the forensic postmortems on Mondays, Wednesdays and Fridays, while the general ones are done daily. But families are often told there are delays. At times, they are asked to pay US$50 to skip it entirely, even when its required by law, or US$100 to expedite the process, Memory says.\n\nIts a moneymaking scheme at the expense of grieving people, she says.\n\nGlobal Press Journal reached out to Sally Mugabe Central Hospital for a response to these allegations. They declined to comment.\n\nTendai Terrence Mautsi, the public relations officer at Parirenyatwa Hospital, the largest public hospital in Zimbabwe, says there are occasional delays with forensic postmortem cases, mostly due to demand. The hospital, he says, has responded by increasing forensic postmortem days from two to three. Theyve also cut the average waiting time from up to two weeks to just three days. To address the national shortage, Mautsi says, the hospital has partnered with Cuban doctors to fill the skills gap.\n\nHe acknowledges that corruption has plagued the process. But, he says, its part of a much bigger unravelling, and everyone has become complicit.\n\nAt times you cant find evidence, he says. When you want to investigate it, the patient is complicit. The service provider is also complicit.\n\nIn the end, corruption harms people in need, says Tafadzwa Chikumbu, the executive director of Transparency International Zimbabwe. For those who cant afford to pay [a bribe], it means being left unattended, he says, which erodes the integrity of public institutions.\n\nThe solution, he says, is to make ethical conduct  including fair hiring and honest service delivery  the standard.\n\nEmily Muchabaiwa, in hat, Antonette Chisango and Keldon Muchabaiwa sit at their home in Harare. The sudden death of Emily Muchabaiwas brother  Chisangos husband  was marred by irregularities, including the absence of a written report and the lack of a clear explanation from medical staff.Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nPostmortem corruption means some families never find out what happened to their loved one. When Emily Muchabaiwas brother was found dead in Harares industrial area, his family was desperate for answers. The circumstances of his death werent clear, and the family hoped a postmortem at Parirenyatwa Hospital would offer closure.\n\nPer standard procedure, a medical doctor or the pathologist should explain the results to the family, Matara says. There should also be a written report. But it was a police officer who delivered the results, verbally, to Muchabaiwas family. There was no official report.\n\n[He] told us my brother had died from tuberculosis and a cold in the lungs, but he struggled to explain the medical terms. Prior to all this, my brother had no signs of sickness, she says.\n\nThe family was suspicious. Muchabaiwa says they believe the death involved foul play and the process was compromised. It would cost the family money to delay the funeral, so they buried her brother, who left behind a young son.\n\nWe had no choice, she says, voice trembling. The postmortem failed us. Corruption failed us.\n\nLinda Mujuruis a Reporter-in-Residence for Global Press Journal in Zimbabwe, where she covers foreign direct investment and its effects on local communities. She holds an MBA from Midlands State University and Masters and Bachelors degrees in Journalism and Media Studies from the National University of Science and Technology. Linda is one of Global Press most widely read and syndicated journalists and won the Community Champions Award from the Nonprofit News Awards for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/16183122/01_GPJNews_Zimbabwe_LM_PostMortem_71_L_T.JPG_web.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — Blessing Mucharambei’s uncle was just having lunch when he stood up, then collapsed. “[He] started bleeding from the nose,” she says, “and died on the spot.” As far as his family knew, he had no health problems. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwes-health-system-profits-from-the-dead/\">How Zimbabwe’s Health System Profits From the Dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Turnall pins hopes on capital projects",
            "url": "https://www.newzimbabwe.com/turnall-pins-hopes-on-capital-projects/",
            "content": "By Alois Vinga\n\nLISTED fibre cement manufacturer Turnall Holdings Limited has seen recovery potential in the countrys booming capital projects, coupled with improved agricultural output.\n\nPresenting the groups annual report for the year 2024, Turnalls board chairman, Grenville Hampshire, said the current year presents prospects of recovery.\n\nThere is hope for some recovery in 2025 due to the ongoing capital projects in the manufacturing and construction sectors, coupled with an expected rebound in the agricultural sector on the back of the La Nina weather phenomenon.\n\nThis recovery is expected to have downstream benefits for the other sectors in the economy. In addition, a stable exchange rate, low inflation, as well as favourable international commodity prices for key minerals are expected to provide a conducive environment for doing business, he said.\n\nDuring the just-ended financial year, the groups turnover for the year ended 31 December 2024 was US$12.04 million compared to US$12.56 million in the previous year, representing a 4% decline, which was mainly due to liquidity constraints and the adverse effects of the El-Nino induced drought, which suppressed product demand.\n\nThe company recorded sales volumes of 32,086 tons, representing a 14% decline compared to the prior year. The decline in volumes was largely due to low product demand and stiff competition from substitute roofing materials and other players in the market.\n\nThe low demand was caused by the El Nio-induced drought, which affected farmers and other agricultural downstream industries; these farmers form a significant part.\n\nThe revenue for the year was US$12.04 million, which was a 4% decrease compared to US$12.56 million achieved in the prior year. The sales product mix for the period was skewed towards the high-value and low tonnage building product.\n\nDespite a challenging business environment, the board and management remain optimistic that the Group will revert to profitability in the medium term. Current efforts to retool the factories will go a long way in addressing production efficiencies and improving our product offering, which is expected to result in revenue growth. These efforts, coupled with the current cost containment initiatives, will bring material improvements to the performance of the group, added Hampshire.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/12054330/Turnall-Holdings.jpg",
            "description": "<p>By Alois Vinga LISTED fibre cement manufacturer Turnall Holdings Limited has seen recovery potential in the country’s booming capital projects, coupled with improved agricultural output. Presenting the group’s annual report for the year 2024, Turnall’s board chairman, Grenville Hampshire, said the current year presents prospects of recovery. “There is hope for some recovery in 2025</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/turnall-pins-hopes-on-capital-projects/\">Turnall pins hopes on capital projects</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Public Private Partnerships In Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-public-private-partnerships-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss public-private partnerships in Zimbabwe, what they are and whether they are a goodconsiderationin theinvestment area.\n\nVM: Thank you.\n\nAs the name suggests, it is a partnership between the government on behalf of its people and a private player in the development of a particular project. Potential projects capable of investment vary and may range from projects like dam construction, road and rail infrastructure development, power generation and so forth. The opportunities are vast.\n\nThe motivation for the government is to provide its people with the necessary infrastructure at an affordable cost, including in projects where charges are defrayed directly to the public, for example, toll fees, while the motivation of the private sector is to maximise profits.\n\nThese motivations are the underlying guide to the contract negotiation process.\n\nSo in short, a typical Public Private Partnership will have the private company designing, funding, constructing and even implementing the project while the government monitors compliance with the undertakings made in the contract and in some instances allows for concessions within its capacity, like tax incentives to assist in expediting project implementation.\n\nReporter:Are PPPs in Zimbabwe a good area for investment in light of the potential economic risks?\n\nVM: The first thing to consider is that Zimbabwe is a developing country. That being said, it follows that there is a lot of scope where private players can partner up with the government to deliver necessary infrastructure at a profit.\n\nThe issue of risk, which is critical in all negotiations with all governments around the world, can be mitigated by understanding our economic model and laws. Our law makes it a condition precedent before entering any public-private partnership that the company or private party intending to enter into a Public-Private Partnership must undertake a thorough feasibility study of the project.\n\nThis feasibility study will highlight all the potential risks that may emanate from the project and such risks are then allocated to the best party capable of managing or mitigating them in the partnership contract.\n\nReporter: Where will a person contemplating a PPP go in the government to get assistance?\n\nVM: The Zimbabwe Investment and Development Agency (ZIDA) and specifically the Public Private Partnership Unit within the agency, is responsible for the examination and review of the project, including its risk allocation. For a project to proceed to implementation, it requires the approval of the PPP unit and the Minister of Finance, Economic Development and Investment Promotion.\n\nIn unsolicited projects, where for instance, a private player has land that can be utilized in PPP to unlock value, the first port of call will obviously be the local council or responsible ministry with a comprehensive proposal outlining its value to the state and corresponding implementation requirements, be it legal, financial or technical.\n\nShould the government body responsible be satisfied with the proposal, it will then refer it to the PPP unit for evaluation. If the PPP unit gives the go-ahead, then the government body can enter negotiations with the private party for a mutually beneficial operating contract.\n\nReporter: What are the main considerations when negotiating a PPP?\n\nVM: It is critical to understand that PPPs are not a one-size-fits-all. Each PPP will address unique issues in a manner appropriate for that particular transaction. The underlying motivation for the parties remaining, as I stated earlier, the government intends to provide infrastructure at the best cost, and the private player intends to maximise as much profit. It is always best to allocate a portion of the profit as a buffer against unforeseen events like an increase in costs, delays in the project, which also have cost consequences, technical defects etc.\n\nAnother key consideration will be the model of the PPP, whether a Build Transfer PPP, a Build Operate and Transfer, Build Lease and Transfer. The type of structure should be one most suited to address projects particular risks.\n\nThe private partner on the other hand, may also be interested in achieving as many fiscal benefits as possible, which may include duty exemptions on capital goods, investment allowances, tax breaks or special rates et cetera.\n\nSpecial attention should also be afforded to the general contract clauses, like your dispute resolution clauses. They should allow provision for negotiated settlements as a first step in this type of contract, then consider alternative methods when negotiation fails. Other key clauses are your step-in, force majeure, and termination clauses as read with the undertakings clauses.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/15171050/ppp-1.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss public-private</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-public-private-partnerships-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Public Private Partnerships In Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "‘Zanu PF will rule forever’ — declares former army commander Sanyatwe, sparks outrage from top lawyer",
            "url": "https://www.newzimbabwe.com/zanu-pf-will-rule-forever-declares-former-army-commander-sanyatwe-sparks-outrage-from-top-lawyer/",
            "content": "By Staff Reporter\n\nTHABANI Mpofu, a top lawyer and confidante of opposition leader Nelson Chamisa, has reacted angrily to a former military commanders declaration from the pulpit that Zanu PF will rule Zimbabwe forever.\n\nThe remarks, made by Anselem Nhamo Sanyatwe, the former Zimbabwe National Army (ZNA) commander and current Minister of Sports, Recreation, Arts and Culture, have ignited a firestorm, with Mpofu calling for a decisive response.\n\nSanyatwe sparked the outrage while addressing congregants at a Seventh Day Adventist (SDA) church in Nyanga North over the weekend.\n\nHe was accompanying his wife, Chido, the local MP, who was receiving a donation of groceries from Kudakwashe Tagwireis Bridging Gaps Foundation.\n\nSanyatwe took the opportunity to assert that Zanu PF will remain in power till the donkeys grow horns, regardless of the electorates wishes.\n\nSanyatwes pronouncements have been met with dismay by many who view them as a blatant disregard for democratic principles and a chilling reminder of the struggle for constitutionalism in Zimbabwe.\n\nHopes for a change of government through the ballot box appear to have been directly undermined by the former military chiefs words.\n\nIt is worth noting that Sanyatwes career trajectory has been subject to intense scrutiny. After serving as ZNA commander for 16 months, President Emmerson Mnangagwa reassigned him to the sports ministry, a move widely interpreted by political analysts as a strategy to shore up his own position amid internal succession battles within Zanu PF.\n\nSanyatwe, once on the U.S sanctions list, is believed to be a close ally of Vice President Rtd General Constantino Chiwenga, himself tipped as a potential successor to Mnangagwa in 2028.\n\nAddressing the SDA congregation, with controversial tycoon Tagwirei also present, Sanyatwe declared the ruling party will retain power forever.\n\nZanu PF ichatonga kusvika madhongi amera nyanga. Ndazvitaura izvozvo nokuti handisisiri muoto. Pane vakambohukura hukura tazvitaura zvekare, ndiri kuzvidzokorora pamberi pekereke kuti uchida usingade tichakutonga kusvika madhongi amera nyanga.\n\nTranslated, this means: Zanu PF will rule till the donkeys grow horns. Im saying this because Im no longer a soldier. We had some people who thought this is a joke when we said it. Now, Im repeating it before the church that whether you like it or not, we will rule over you till the donkeys grow horns.\n\nIn response to the ex-army boss remarks, Mpofu vowed the comments cannot go unchallenged. He questioned the appropriateness of Sanyatwes using a church service to make such a partisan declaration.\n\nSanyatwe goes to my church and in my absence accuses me of kuvukura. Now thats political talk and its totally excusable. Whats not excusable is him saying this on the pulpit, on the sabbath (the holy day of the Lord) and in the presence of my church leaders.\n\nHow does a Zanu PF politician declare during a church service that his party will rule Zimbabwe forever? Mpofu wrote on his X account on Sunday.\n\nThe SDA church has been fully politicised and a line has now been crossed. We must respond decisively to this nonsense.\n\nFormer Binga North MP Prince Dubeko Sibanda echoed this sentiment, stating that Sanyatwe had defiled the church and compromised its neutrality.\n\nSanyatwe is no stranger to controversy. In 2018, he denied military involvement in the fatal shooting of six civilians during post-election protests in Harare. However, the Commission of Inquiry led by former South African President Kgalema Motlanthe established that soldiers were indeed responsible for the deaths of six civilians.\n\nThe army was subsequently sued for its role in the incident. At the time of the shootings, Sanyatwe was the Commander of the Presidential Guard. He was also placed on the U.S sanctions list.\n\nThis latest incident follows a pattern of serving and retired senior military figures openly declaring their allegiance to Zanu PF, and vowing never to salute anyone without liberation war credentials as President of Zimbabwe, further fuelling concerns about the impartiality of the security forces.\n\nIn 2002, months before Zimbabweans headed to the polls for a crucial presidential election, military chiefs delivered a stark warning, drawing a firm line on the qualities they expect in the countrys next leader. The top military brass declared that the presidency is not a prize to be won lightly, but rather a straitjacket whose occupant was expected to observe the objectives of the liberation struggle.\n\nThe message was delivered jointly by the then Defence Forces Chief Vitalis Zvinavashe (now late), Army Commander Constantine Chiwenga (now Vice President), Air Force Chief Perrence Shiri (now late) and Police Commissioner Augustine Chihuri (now retired and in self-exile), has been widely interpreted as a not-so-subtle intervention in the electoral process.\n\nThis was at a time there was heightened political tension between the former and President Robert Mugabe, who faced formidable challenge from the late opposition leader Morgan Tsvangirai.\n\nCritics have pointed out that the statement effectively sets a pre-condition for the presidency, one rooted in the historical narrative of the liberation war, thereby potentially disenfranchising voters who may hold differing views or priorities.\n\nThe opposition has condemned the generals remarks as a blatant attempt to intimidate voters and undermine the democratic process.\n\nThe controversy also underscores the enduring influence of the military in Zimbabwean politics.\n\nSenior figures within the ruling Zanu PF party, including current President Emmerson Mnangagwa and party spokesman Christopher Mutsvangwa, have often spoken of an unbreakable bond between Zanu PF and the military. Such pronouncements have led to accusations that elections are a mere ritual, with outcomes preordained due to the militarys allegiance to the ruling party.\n\nSection 208 of the Constitution explicitly forbids members of the security services, regardless of rank, from engaging in active politics.\n\nSanyatwes statement, therefore, raises serious questions about adherence to constitutional principles and the separation of powers in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/13031835/Commander-of-the-Presidential-Guard2C-Brigadier-General-Anselem-Sanyatwe.jpg",
            "description": "<p>By Staff Reporter THABANI Mpofu, a top lawyer and confidante of opposition leader Nelson Chamisa, has reacted angrily to a former military commander’s declaration from the pulpit that Zanu PF will rule Zimbabwe “forever.” The remarks, made by Anselem Nhamo Sanyatwe, the former Zimbabwe National Army (ZNA) commander and current Minister of Sports, Recreation, Arts</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-will-rule-forever-declares-former-army-commander-sanyatwe-sparks-outrage-from-top-lawyer/\">‘Zanu PF will rule forever’ — declares former army commander Sanyatwe, sparks outrage from top lawyer </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Labour MP Butler distances herself from summit with Zimbabwe’s First Lady as activists threaten protests",
            "url": "https://www.newzimbabwe.com/labour-mp-butler-distances-herself-from-summit-with-zimbabwes-first-lady-as-activists-threaten-protests/",
            "content": "By UK Correspondent\n\nLabour MP Dawn Butler has withdrawn from an international summit in London after learning she was advertised as a speaker alongsideAuxilliaMnangagwa, Zimbabwes First Lady, who is under US sanctions for alleged corruption and gold smuggling. The decision follows fierce backlash from Zimbabwean activists, who accuse Mnangagwa of hypocrisy and have pledged to disrupt the event with protests.\n\nThe First Ladies of African Impact & Resilience (FLAIR) Summit, due to take place on 17-18 June at the Leonardo Royal Hotelin London, aims to spotlight female leadership and investment in Africa. But Mnangagwas inclusion has ignited controversy, prompting Butlers exit and raising questions about the participation of two other British politicians, Labour MP Diane Abbott and Conservative peer Baroness Sandip Verma.\n\nLabour MP Dawn Butler\n\nIn a statement, Butlers office said: We have never agreed to speaking at this event, so are rightly concerned that Dawn is being advertised as a speaker at this summit. We have contacted the organisers and asked them to remove her name from their programme immediately. The move came after Zimbabwean diaspora activists delivered a petition to 10 Downing Street, calling for Mnangagwa to be barred from the UK.\n\nA Controversial Guest\n\nAuxilliaMnangagwa, married to Zimbabwes President Emmerson Mnangagwa, was sanctioned by the US in 2023 under the Global Magnitsky Act. An Al Jazeera investigation,Gold Mafia, alleged she played a key role in smuggling gold and diamonds, funnelling profits to the ruling elite while Zimbabwes economy crumbled. Over 80% of Zimbabweans are unemployed, and 5.6 million face food insecurity, according to the World Food Programme. Last years elections, widely criticised as fraudulent by the EU, SADCand others, further entrenched the regimes grip on power.\n\nDespite this, Mnangagwa has cast herself as an advocate for womens empowermenta claim activists dismiss as a sham. On 4 June, campaigner JosephineJenje-Mudimbuled a protest outside Downing Street, delivering a petition to block Mnangagwas entry. In a video on X, she said: Charity begins at home.Auxilliashould clean up the mess she and her husband are creating in Zimbabwe. There is no room forAuxilliato come to the UK to present herself at FLAIR.\n\nIve got a message for Auxillia Mnangagwa, the illegitimate First Lady.\n\nThese were the first few words by Josephine Jenje-Mudimbu as she started. She was standing in front of 10 Downing Street in London, on the 4th of June 2025 as part of a protest that was also handing in apic.twitter.com/SbPCPvghXA\n\n Zimbabwe Freedom of Expression (@ZimbabweFreedo1)June 12, 2025\n\nThe outrage has spilled onto social media. X user @MilMillazwrote: AuxilliaMnangagwa must not be given a platform at the #FLAIRSummit. She represents a brutal regime responsible for abductions, mass corruption, and human rights abuses.\n\nPolitical Fallout\n\nButlers withdrawal has turned the spotlight on Abbott and Verma, both still listed as speakers. Abbott, a veteran Labour MP, and Verma, the UKs Ministerial Champion for Tackling Violence Against Women and Girls Overseas, have yet to clarify their stances. For Verma, the stakes are high: her role puts her at odds with sharing a stage with the spouse of a leader linked to state violence. Neither responded to inquiriesemailed to their offices last week.\n\nThe silence has fuelled criticism. Would these MPs sit with the spouse of a Russian oligarch? asked @ChirevoChamisaon X. If not, what makes Zimbabwe different? Activists argue that hosting Mnangagwa undermines the summits stated mission and sends a dangerous signal to Zimbabwean women enduring repression.\n\nThe FLAIR Summits organisers have remained tight-lipped, though sources suggest Mnangagwas participation could be reconsidered as protests mount. With just days until the event, the row exposes a broader dilemma: how to balance diplomatic engagement with accountability for human rights abuses.\n\nAs activists prepare to shut it down, the summits future hangs in the balance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/08033118/Auxilia-Mnangagwa.jpeg",
            "description": "<p>By UK Correspondent Labour MP Dawn Butler has withdrawn from an international summit in London after learning she was advertised as a speaker alongside Auxillia Mnangagwa, Zimbabwe’s First Lady, who is under US sanctions for alleged corruption and gold smuggling. The decision follows fierce backlash from Zimbabwean activists, who accuse Mnangagwa of hypocrisy and have pledged to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-mp-butler-distances-herself-from-summit-with-zimbabwes-first-lady-as-activists-threaten-protests/\">Labour MP Butler distances herself from summit with Zimbabwe’s First Lady as activists threaten protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        },
        {
            "title": "Zimbabwe hearings over Gukurahundi massacres to start on June 26",
            "url": "https://www.newzimbabwe.com/zimbabwe-hearings-over-gukurahundi-massacres-to-start-on-june-26/",
            "content": "AFP\n\nLong-awaited hearings on notorious 1980s massacres by troops in Zimbabwe will commence on June 26, a panel of chiefs set up by the countrys President Emmerson Mnangagwa announced on Sunday.\n\nTens of thousands of people were killed over several years in the so-called Gukurahundi massacres under former leader Robert Mugabe, a few years after Zimbabwes independence from Britain.\n\nLast year, Mnangagwa announced that survivors would be interviewed in a series of village hearings, in a bid to settle longstanding grievances and tensions.\n\nThe hearings are starting on June 26, 2025 and will be presided by traditional chiefs and a panel of community members, Chief Fortune Charumbira told a press conference in Bulawayo, in the Matabeleland region where the massacres were committed.\n\nVictim-centred\n\nOur approach is victim-centred, Charumbira said, adding the hearings would be closed to the media because of the sensitivity and private nature of some of the stories.\n\nA report would be submitted to the president and financial compensation would be considered, he said, but added that the modalities and amounts could not be predetermined before the hearings.\n\nStarting in 1983, Mugabe deployed an elite North Korean-trained army unit to crack down on a revolt in the western Matabeleland region, the heartland of the Ndebele minority.\n\nThey killed an estimated 20,000 people over several years, according to the Catholic Commission for Justice and Peace in Zimbabwe, a toll supported by Amnesty International.\n\nTargeted minority Ndebele tribe\n\nThe operation was namedGukurahundi, a term in the majority Shona language that loosely translates as the early rain that washes away the chaff.\n\nCritics say it targeted dissidents loyal to Mugabes rival, fellow revolutionary leader Joshua Nkomo. Most of the victims belonged to the minority Ndebele tribe.\n\nMugabe, who died in 2019, never acknowledged responsibility for the massacres, dismissing evidence gathered by Amnesty International as a heap of lies.\n\nAfter taking power in 2017, Mnangagwa promised a resolution and set up a panel of chiefs to probe the massacres.\n\nFlawed process\n\nBut activists said the process was flawed as there had been no official government apology and victims were not consulted.\n\nActivist Mbuso Fuzwayo on Sunday dismissed the initiative as a sham from the start.\n\nThis is being dealt with from the position of the perpetrator and not the victims, he told AFP.\n\nSome of the known perpetrators are people in positions of power and they are the ones who led the initiative from the start, Fuzwayo said.\n\nMnangagwa, who has previously described the massacres as a bad patch in Zimbabwes history, was security minister at the time but has always denied any responsibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10153513/Gukurahundi.jpg",
            "description": "<p>AFP Long-awaited hearings on notorious 1980s massacres by troops in Zimbabwe will commence on June 26, a panel of chiefs set up by the country’s President Emmerson Mnangagwa announced on Sunday. Tens of thousands of people were killed over several years in the so-called Gukurahundi massacres under former leader Robert Mugabe, a few years after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hearings-over-gukurahundi-massacres-to-start-on-june-26/\">Zimbabwe hearings over Gukurahundi massacres to start on June 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "17 Jun 2025"
        }
    ]
}