{
    "news": [
        {
            "title": "Priscilla Presley accused of hastening Lisa Marie’s death for financial gain",
            "url": "https://www.newzimbabwe.com/priscilla-presley-accused-of-hastening-lisa-maries-death-for-financial-gain/",
            "content": "NBC News\n\nPriscilla Presleys former business partners accused the rock widow of hastening daughter Lisa Maries death to secure her own spot atop Elvis massive financial kingdom, according to a bombshell lawsuit filed in Los Angeles this week.\n\nPlaintiffs Brigitte Kruse and Kevin Fialko accused Priscilla Presley, the former wife of Elvis Presley, of fraud, breach of contract and other civil misdeeds in a Los Angeles County Superior Court action entered on Monday.\n\nElvis Presley is the King of Rock n Roll,' the lawsuit says. Defendant Priscilla Presley always wanted to the Queen. In fact, despite flaunting a public persona that only wanted to protect and keep her family together, Priscilla ultimately wanted one thing, power, no matter the cost.\n\nPriscilla Presleys attorney Marty Singer disputed the allegations in a two-page statement Thursday.\n\nThis is without a doubt, one of the most shameful, ridiculous, salacious and meritless lawsuits I have seen in my practice, Singer said in a 648-word statement.\n\nThese fabricated claims have absolutely no validity and we are confident this case will be dismissed.\n\nKruse, an auctioneer who specialized in Elvis sales, and Fialko, an Elvis memorabilia collector, said they had been collaborating with Priscilla Presley for years to leverage her name for maximum profits.\n\nBut once Kruse and Fialko got her back on stable financial footing in November 2023, they allege, she abruptly cut ties with them and denied themcompensation from themoviePriscilla.\n\nEarlier that year, the defendants daughter, Lisa Marie, died atage 54.\n\nLisa Marie had been ailing, but Priscilla insisted they attend a Golden Globes event together on Jan. 10 as Priscilla clasped to the spotlight, the lawsuit said.\n\nLisa Marie had collapsed at herhome days earlier and diedofsmall bowel obstruction, the medical examiners office ruled.\n\nPriscilla rushed to West Hills Hospital and despite Lisas clear directive to prolong her life, Priscilla pulled the plug within hours of Lisa being admitted, according to the lawsuit.\n\nPriscilla knew that Lisas death neutralized the threat of Lisas efforts to have Priscilla removed as the sole trustee of Lisas irrevocable life insurance trust and Priscilla ultimately wanted to control the Promenade Trust and Graceland. At her house the week following (before Lisas funeral), Priscilla exclaimed, Im the queen, Im in charge of Graceland. Kruse and Fialko were heartbroken by the unsettling behavior.\n\nSinger, Priscilla Presleys lawyer, said his clients granddaughter Riley Keough stands behind her grandmother 100%.\n\nKeough is equally disgusted with this latest, vicious attempt by Kruse to attempt to ruin her grandmothers life, Singer said.\n\nA rep forKeough, Lisa Maries daughter andPriscillas granddaughter, could not immediately be reached for comment Thursday.\n\nElvis and Priscilla Presleywere married for six years and divorced in 1973, four years before Elvis died.\n\nPriscilla Presley is now 80, and Elvis was 42 when he died onAug. 16, 1977, at Graceland.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/15023148/250814-Priscilla-Presley-vl-1003a-35dd42.webp",
            "description": "<p>NBC News Priscilla Presley’s former business partners accused the rock widow of hastening daughter Lisa Marie’s death to secure her own spot atop Elvis’ massive financial kingdom, according to a bombshell lawsuit filed in Los Angeles this week. Plaintiffs Brigitte Kruse and Kevin Fialko accused Priscilla Presley, the former wife of Elvis Presley, of fraud,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/priscilla-presley-accused-of-hastening-lisa-maries-death-for-financial-gain/\">Priscilla Presley accused of hastening Lisa Marie’s death for financial gain</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "Life after Cecil: How community conservation can combat trophy hunting",
            "url": "https://www.newzimbabwe.com/life-after-cecil-how-community-conservation-can-combat-trophy-hunting/",
            "content": "TRT Global\n\nCecil the lionwas the face of Zimbabwes Hwange National Park,had his own Wikipedia page, and a GPS collar tracked by Oxford researchers.\n\nTourists would fly to Zimbabwe just to photograph him. He was, in every possible way, the king of the pride.\n\nThen one evening in July 2015, a wealthy American trophy hunters bow and arrow ended it all.\n\nCecils killing blew up on social media, sparking protests from London to Los Angeles and turning him into the posthumous mascot of a campaign against trophy hunting.\n\nA decade on, lions and other wildlife continue to die the same way every year. Just that they dont make it to the headlines like Cecil did.\n\nAugust 10 marksWorld Lion Day, which Dr Angie Elwin, head of research at World Animal Protection, calls a stark reminder that the king of the jungle remains unprotected from commercial exploitation through trophy hunting and captive breeding.\n\nThere are over 8,000 lions in South Africas captive breeding sites, while only 3,500 roam in the wild according to IUCN. /Photo: Blood Lions\n\nProduction line\n\nThe growth of South Africas captive breeding industry over the past 30 years reflects how skewed conservation priorities have become.\n\nThe country now has nearly 8,000 lions in captivity, more than double the 3,500 in the wild.\n\nWorldwide, only about 20,000 lions remain outside of captive breeding centres, according to the International Union for Conservation of Nature.\n\nMost lion farms are pretty intensive production lines, Dr Louise de Waal, director of the conservation campaign Blood Lions, tells TRT Afrika.\n\nIn the wild, lioness gives birth once every two years. In captivity, she would potentially have four to five litters during the same period.\n\nCubs are separated from their mothers within days or weeks. Then, as Elwin points out, they are monetised at every stage of life: from cub petting attractions to walking with lions experiences.\n\nOnce too large to handle, a captive-bred lion is invariably sold as a target in a canned hunt, or commercialised killing of trophy animals within enclosed spaces, from where escape is impossible. Its a blood sport that represents the worst of human indulgences.\n\nEven death doesnt end the lions humiliating torment.\n\nSkins, skulls and paws become trophies, while bones may be dried, boxed, and sometimes illegally traded for use in the international big cat bone trade, Elwin tells TRT Afrika.\n\nHunters hang the heads and skins on their walls.\n\nBan only in name\n\nSouth Africa banned the legal export of lion skeletons in 2019, but a recent World Animal Protection investigation revealed that illegal trade continues.\n\nBetween 2014 and 2024, the CITES trade database shows that over 12,600 lion parts and products were exported globally  9,629 trophies, 943 claws, 670 skeletons, 486 skulls, 252 bones, skin, teeth, and other body parts.\n\nThis isnt conservation; its a supply chain built on animal suffering, with no benefit to wild populations and devastating consequences for the species welfare and dignity, says Elwin. Ending this cycle is critical to both protecting lions and safeguarding South Africas reputation as a global leader in ethical, wildlife-based tourism.\n\nCecil as a catalyst\n\nOn the positive side, Cecils death did change something.\n\nBased on available data, global trade in lion trophies has dropped by about a third since 2015, down to fewer than 1,000 in recent years.\n\nBut trophy hunting continues for elephants, rhinos, leopards, and other animals.\n\nConservationists in South Africa estimate that the proposed levy could generate over US$175 million annually. /Photo: World Animal Protection\n\nIn 2023, more than 6,000 international hunters killed over 34,000 animals, according to the Professional Hunters Association.\n\nThis is despite the fact that most local populations oppose trophy hunting. Communities living near South Africas Kruger National Park demand alternatives to killing animals for money despite having to deal with poverty, unemployment and wildlife that threatens their livestock and crops.\n\nFinding another way\n\nOver 85% of people we surveyed were in support of introducing a lion levy on international tourists, intended to replace trophy hunting revenue and directly benefit local communities, says Elwin, among those who contributed to the Lion Levy Research Paper.\n\nAbout 70% disagreed that hunting wild animals has always been part of our culture, and we should keep doing it.\n\nConservationists estimate that the levy, if introduced, could bring in over US $175 million annually, enough to replace all trophy hunting income in South Africa without scaring off tourists.\n\nThe lion levy has strong potential to improve local community livelihoods, Elwin tells TRT Afrika.\n\nCommunities near parks like Kruger have other options, too. They can sell traditional handicrafts to tourists, manage wildlife areas and guide eco-tours.\n\nCommunity-run lodges, campsites and guided tours would also attract responsible travellers seeking authentic nature experiences, Elwin says. This helps create jobs and raise revenue linked directly to wildlife preservation.\n\nCommunities around South Africas Kruger National Park prefer wildlife-friendly revenue as opposed to trophy hunting income which only benefits operators of the captive-breeding sites. /Photo: World Animal Protection.\n\nSome communities are trying out virtual safaris and wildlife webcams for international audiences, making money with minimal environmental impact. A few have leased out land to conservation groups, while others are part of biodiversity conservation campaigns that guarantee remuneration.\n\nBy embracing these diverse, wildlife-friendly livelihood options, communities can build sustainable economies that support conservation goals, reduce illegal hunting, and improve overall well-being, explains Elwin.\n\nFor now, its a race against time to shift from exploitation to preservation, before the roar of the wild potentially fades into silence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/15022736/cecil-lion.jpg",
            "description": "<p>TRT Global Cecil the lion was the face of Zimbabwe’s Hwange National Park, had his own Wikipedia page, and a GPS collar tracked by Oxford researchers. Tourists would fly to Zimbabwe just to photograph him. He was, in every possible way, the king of the pride. Then one evening in July 2015, a wealthy American trophy hunter’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/life-after-cecil-how-community-conservation-can-combat-trophy-hunting/\">Life after Cecil: How community conservation can combat trophy hunting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "‘It’s coming home’ – the undignified row over the body of Zambia’s ex-president",
            "url": "https://www.newzimbabwe.com/its-coming-home-the-undignified-row-over-the-body-of-zambias-ex-president/",
            "content": "BBC\n\nIts coming home!  a phrase indelibly linked to English football fans  has now gained currency among some Zambians in the battle over what to do with the body of former President Edgar Lungu.\n\nThe 68-year-old died two months ago in South Africa where he was being treated for an undisclosed illness.\n\nIn the latest episode of what is now a full-blown saga, a Pretoria court ruled in the Zambian governments favour, saying that in the public interest, Lungus remains can be repatriated and given a state funeral, against the wishes of the family.\n\nThe decision triggered celebrations among some governing party supporters, who shared Facebook posts with the phrase: Its coming home, as if Zambia had won a trophy.\n\nAn undignified response, perhaps, but it has come to symbolise how divisive and partisan this has become.\n\nFor some, who are fed up with the row, the sorrow and grief that came with Lungus passing have faded into feelings of fatigue.\n\nBut despite a host of more pressing economic problems, public discussions continue to be dominated by the fallout from the death of the former president, who led the country for six years from 2015.\n\nThe seeds of the controversy were sown in the feud between Lungu and his successor  the man who soundly beat him in the 2021 election  Hakainde Hichilema. But it has now spiralled into a row laced with wild accusations of witchcraft.\n\nWhen the judge in South Africa made his ruling last week, the ensuing anger from Lungus older sister was telling.\n\nBertha Lungu burst into a fit of rage, crying uncontrollably as she hurled unsavoury words at Zambias Attorney General Mulilo Kabesha, who was also present in court.\n\nKabesha, Lungu is not your fathers son hes not Hakaindes son This is really painful. I dont want to go to Zambia, she cried as people, including her niece, Tasila Lungu, struggled to comfort her and cover her mouth.\n\nThe body has not yet been repatriated to Zambia because the Lungu family is appealing against the South African judges decision  a case that is due to be heard on Friday.\n\nThis was all supposed to have been settled in June, when the family initially agreed that there could be a state funeral in Zambia. But the plans were scuppered over a dispute about what role President Hichilema would play.\n\nLungus family said one of his dying wishes was that Hichilema should not go anywhere near his body.\n\nThe key to understanding the animosity was the more than 100 days that Hichilema, opposition leader at the time, spent in detention in 2017, awaiting trial on treason charges.\n\nHe was accused of endangering the life of then-President Lungu after his motorcade allegedly refused to give way to the one transporting the head of state.\n\nThe charges were only dropped after the intervention of the secretary general of the Commonwealth. This was one of several times that Hichilema was arrested while he was in the opposition.\n\nIn turn, the Lungus have alleged persecution under Hichilema. Tasila and the former presidents widow, Esther, continue to face corruptions charges, which they deny.\n\nLungus family have vowed that they are prepared to wait for the court process as long as it takes to ensure he receives a burial they consider dignified, even if it means stalling the process, according to their spokesperson Makebi Zulu.\n\nThey insist that while they were open to burying Lungu in Zambia, they want to honour his wishes that Hichilema should not attend the event.\n\nBut the authorities are adamant that the former president should be accorded a state funeral to be attended by his successor and given a proper send-off as a former president.\n\nThe government, through the attorney general, has even indicated Lungu may have to be buried without the familys involvement.\n\nIf they want to set a precedent, let them give us reasons why the current president should not go near the casket. And who has told them that he wants to be near the casket, anyway? he told the state broadcaster ZNBC.\n\nWe are ready as government to discuss with the family, we will never ignore the family unless the family just walks out but the family has a right to say: We are not coming, we are not part of it. Then we will proceed and bury without them.\n\nTraditionally, all ex-leaders have been accorded state funerals and buried at Embassy Park, which is specifically reserved for them.\n\nSishuwa Sishuwa, a Zambian historian and senior lecturer at South Africas Stellenbosch University, strongly disagrees with the idea that Lungu could be buried without his familys involvement.\n\nSuch reckless statements are culturally insensitive, undermine the governments claims that its actions are motivated by the desire to accord Lungu a dignified burial, and indicate that political considerations rather than public interest are the key drivers at play, he told the BBC.\n\nThe failure by Hichilema to rein in on the unruly conduct of his officials and supporters has fed public perception that the president approves of such conduct and consequently heightened divisions.\n\nHe argues that had Hichilema publicly indicated that he would stay away from the funeral, Lungu would have been buried long ago.\n\nDr Sishuwa says that the authorities determination to take the body of Lungu from the grieving family  in the name of giving him a dignified funeral  has not only worsened political divisions but has also fed the belief that the body may be wanted for occult reasons, in a country where thebelief in witchcraft is widespread.\n\nNevers Mumba, the leader of the Movement for Multiparty Democracy, which is in a political alliance with Hichilemas party, has defended the president.\n\nWhat drives [the president] is not obsession, but a deep, deep sense of duty. Hakainde Hichilema never gives up on anything he pursues as long as he believes he is doing the right thing, Mumba, who is also a pastor, wrote on his Facebook page.\n\nHe fights, with a clear conscience till the end, and he keeps on refining his methods until he gets it right.\n\nHow long this fight will go on for is not known, but several episodes of the saga are yet to be written.\n\nZambians may shrug and try to focus on other matters, but they will still get drawn into the debate about whether the body should come home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25163954/lungu-burial.webp",
            "description": "<p>BBC “It’s coming home!” – a phrase indelibly linked to English football fans – has now gained currency among some Zambians in the battle over what to do with the body of former President Edgar Lungu. The 68-year-old died two months ago in South Africa where he was being treated for an undisclosed illness. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-coming-home-the-undignified-row-over-the-body-of-zambias-ex-president/\">‘It’s coming home’ – the undignified row over the body of Zambia’s ex-president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "Amin Soma-Phiri bounces back at Highlanders, as coach De Jong work permit delay continues",
            "url": "https://www.newzimbabwe.com/amin-soma-phiri-bounces-back-at-highlanders-as-coach-de-jong-work-permit-delay-continues/",
            "content": "By Sports Reporter\n\nHighlanders FC legend Amin Soma-Phiri has bounced back at the club as new Welfare Manager for the senior team.\n\nSoma-Phiris appointment was confirmed by the club on Thursday via a press release.\n\nHighlanders Football Club is pleased to announce the appointment of Amin Soma-Phiri as the new Welfare Manager for our first team.\n\nWe warmly welcome him back to the Highlanders family and wish him every success in his new role, reads part of the statement.\n\nThe former Highlanders player previously served the club as an assistant coach under coach Erol Akbay in 2017.\n\nMeanwhile, it will take longer than expected for Highlanders new coach Petier De Jong to start duty.\n\nSince his appointment last month, De Jong has yet to get a work permit.\n\nAlthough details behind his work permit delays have not been established yet, sources within the club told this publication that the move is a deliberate sabotage of club chairman Kenneth Mhlope, who pushed for the new coachs appointment.\n\nMhlopes time in office is under threat as some life members are pushing for a vote of no confidence against him in the coming EGM.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/15021816/amin-soma-phiri.jpeg",
            "description": "<p>By Sports Reporter Highlanders FC legend Amin Soma-Phiri has bounced back at the club as new Welfare Manager for the senior team. Soma-Phiri’s appointment was confirmed by the club on Thursday via a press release. “Highlanders Football Club is pleased to announce the appointment of Amin Soma-Phiri as the new Welfare Manager for our first</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amin-soma-phiri-bounces-back-at-highlanders-as-coach-de-jong-work-permit-delay-continues/\">Amin Soma-Phiri bounces back at Highlanders, as coach De Jong work permit delay continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "Former bank consultant jailed for US$23,000 fraud",
            "url": "https://www.newzimbabwe.com/former-bank-consultant-jailed-for-us23000-fraud/",
            "content": "By Staff Reporter\n\nA former ZB Bank loan consultant has been jailed after being convicted of defrauding clients of more than US$23,000 through a string of fraudulent loan transactions.\n\nThe Kwekwe Magistrates Court on Thursday sentenced 41-year-oldCosmas Bhudeto an effective three years and nine months in prison after finding him guilty on four counts of fraud.\n\nProsecutors told the court that between May and November 2023, Bhude exploited unsuspecting clients by forging documents, inflating loan amounts, and diverting funds for personal use.\n\nOn May 3 2023, he processed a fake loan of US$4,692 in a clients name without their knowledge, using forged withdrawal slips to take the money.\n\nJust two weeks later, on May 18he fraudulently processed a US$4,080 loan in another clients name, transferring US$3,650 of it to a separate account.\n\nIn September, a client applied for a US$3,000 loan, which Bhude inflated to US$7,700returning the original amount and using the rest to repay arrears from earlier fraud.\n\nThe scheme continued in November when he inflated another clients US$3,500 loan to US$6,550, again siphoning off funds for prior repayments.\n\nThe court heard the scam was exposed after victims noticed loan repayments continuing beyond agreed terms and sought clarification from the bank.\n\nBhude was initially handed a six-year sentence, but portions were suspended on condition that he repays the victimsUS$4,600, US$4,000, US$4,080, and US$2,770by September 30 this year.\n\nThe National Prosecuting Authority condemned Bhudes actions, calling them a severe breach of trust when financial professionals abuse their positions. The authority urged Zimbabweans to regularly check their bank accounts and statements to safeguard against such schemes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/16054829/ZB-BANK-1.jpg",
            "description": "<p>By Staff Reporter A former ZB Bank loan consultant has been jailed after being convicted of defrauding clients of more than US$23,000 through a string of fraudulent loan transactions. The Kwekwe Magistrates’ Court on Thursday sentenced 41-year-old Cosmas Bhude to an effective three years and nine months in prison after finding him guilty on four counts of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-bank-consultant-jailed-for-us23000-fraud/\">Former bank consultant jailed for US$23,000 fraud </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "Harare City Council officials attending workshops to sleep in hotels – councillor says",
            "url": "https://www.newzimbabwe.com/harare-council-officials-attending-workshops-to-sleep-in-hotels-councillor-says/",
            "content": "By Darlington Gatsi\n\nHARARE City Council continues to be dogged by the extravagance of its top officials, with residents bearing the brunt of the senior executives excessive expenditures.\n\nDespite being cash-strapped, top City Council officials have been attending workshops in excessive numbers at the municipalitys expense.\n\nSpeaking at a recent Council meeting, Harare Councillor Denford Ngadziore bemoaned the extravagance, saying some officials attend workshops merely to sleep in hotels.\n\nAt one time, we had over 20 workshops or trips of Council. My issue is if you go and check attendance, it is showing it seems as if we might be at a position where we are spending more on trips and workshops that are not also having a direct benefit to the Council. For example, you see a report that has three councillors, officials 20. Some of the justifications.\n\nI have been previously attending those workshops, but most of the people during the workshops people will be in rooms, not even contributing to whatever that will be happening, said Ngadziore.\n\nThis is a slap in the face for residents, who are bearing the brunt of the City Councils poor service delivery, often attributed to a lack of funds, while officials attend numerous workshops.\n\nWorkshops have become a feeding trough for council officials, who are reportedly pocketing hefty allowances.\n\nThe City Councils extravagance also became a bone of contention at the Commission of Inquiry, which was investigating the local authoritys governance systems.\n\nIn response, Harare Mayor Jacob Mafume said workshops should be downsized to reduce the burden on the City Council.\n\nLet us look at some of the workshops so that we reduce the cost to the organisation. Let us look at the bottom line as far as that issue is concerned, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/08041101/town-house1.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council continues to be dogged by the extravagance of its top officials, with residents bearing the brunt of the senior executives’ excessive expenditures. Despite being cash-strapped, top City Council officials have been attending workshops in excessive numbers at the municipality’s expense. Speaking at a recent Council meeting, Harare Councillor Denford</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-council-officials-attending-workshops-to-sleep-in-hotels-councillor-says/\">Harare City Council officials attending workshops to sleep in hotels – councillor says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "Two arrested for assaulting Zimbabwean student in Punjab",
            "url": "https://www.newzimbabwe.com/two-arrested-for-assaulting-zimbabwean-student-in-punjab/",
            "content": "INDIA  Punjab Police arrested two persons for the brutal attack on a Zimbabwean student, Ziweya Leeroy, at Talwandi Sabo in Bathinda district on Wednesday evening.\n\nThe 22-year-old BSc student of Guru Kashi University, a private institute, in Talwandi Sabo, is battling for life at All India Institute of Medical Sciences (AIIMS), Bathinda.\n\nSenior Superintendent of Police (SSP) Amneet Kondal stated on Thursday that Manpreet Singh and Mangu Singh have been arrested, while teams have been constituted to apprehend Dilpreet Singh and Lovepeet Singh.\n\nShe said that Leeroy suffered critical head injuries, and he is under constant medical observation.\n\nRuling out the hate crime, the SSP said that the attack followed an argument between Leeroy and the university security guard, Dilpreet Singh.\n\nDuring checking at the university gate on August 12, a baseball bat was found in Leeroys car, and he had an argument with Dilpreet. A day later, Dilpreet and his accomplices followed Leeroy and attacked him with baseball bats, sticks and sharp-edged weapons. Leeroy is in a critical condition, the SSP said.\n\nA case was registered at Talwandi Sabo under Sections 109 (attempt to murder), 126 (2) wrongful restraint, 115 (2) voluntarily causing hurt; 190 (unlawful assembly for offences committed in prosecution of their common object) and 191 (3) rioting involving deadly weapons of the Bharatiya Nyaya Sanhita (BNS).\n\nThe first information report (FIR) was lodged on the complaint of assistant sub-inspector Des Raj, as the doctors attending to Leeroy pronounced the patient unfit to give a police statement.\n\nA BSc second-year student under the faculty of health and allied sciences of Guru Kashi University, was found in an unconscious condition near the campus on Wednesday and was rushed to the hospital by the police.\n\nInvestigators said that after attacking the foreign national, the attackers rammed their car into a tree and left it behind.\n\nThe vehicle was impounded by the police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/09115004/handcuffs.jpg",
            "description": "<p>Hindustan Times INDIA – Punjab Police arrested two persons for the brutal attack on a Zimbabwean student, Ziweya Leeroy, at Talwandi Sabo in Bathinda district on Wednesday evening. The 22-year-old BSc student of Guru Kashi University, a private institute, in Talwandi Sabo, is battling for life at All India Institute of Medical Sciences (AIIMS), Bathinda.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-arrested-for-assaulting-zimbabwean-student-in-punjab/\">Two arrested for assaulting Zimbabwean student in Punjab</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "Zimbabwe’s mining laboratories get overwhelmed amid gold price surge",
            "url": "https://www.newzimbabwe.com/zimbabwes-mining-laboratories-get-overwhelmed-amid-gold-price-surge/",
            "content": "Zimbabwean laboratories are struggling to cope with a surge in mineral samples submitted by mines ramping up exploration activity in response torecord gold prices, a mine executive said on Wednesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/17044933/Gold.jpg",
            "description": "<p>Reuters Zimbabwean laboratories are struggling to cope with a surge in mineral samples submitted by mines ramping up exploration activity in response to record gold prices, a mine executive said on Wednesday. Geopolitical tensions, central bank buying and, lately, economic uncertainty fueled by U.S President Donald Trump’s tariffs drove gold prices to a record high</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-mining-laboratories-get-overwhelmed-amid-gold-price-surge/\">Zimbabwe’s mining laboratories get overwhelmed amid gold price surge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        },
        {
            "title": "High Court refuses to hear Varakashi4ED leader’s divorce case, says Canadian Court has jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-refuses-to-hear-varakashi4ed-leaders-divorce-case-says-canadian-court-has-jurisdiction/",
            "content": "By Staff Reporter\n\nThe High Court has thrown out a divorce bid filed by the leader of Zanu PFs online brigade, Varakashi4ED, Jonas Musara, against his estranged wife living in Canada, ruling that local courts have no jurisdiction because the matter is already before a Canadian court.\n\nThe application was filed by Musara, who is going through a nasty separation with his wife, Winnet Paidamoyo Motsi, who is currently living abroad.\n\nJustice Fatima Maxwell upheld a special plea by Motsi, finding that this court will withhold its jurisdiction until the matter in Canada is finalised, and warning against the risk of conflicting judgments, which is contrary to the principles of justice and judicial comity.\n\nThe judge said the actor forum rei principle  that the court of the defendants domicile has jurisdiction  applied since Motsi is domiciled in Canada.\n\nThe Zimbabwean courts cannot assume jurisdiction simply because the Plaintiff is domiciled or resident in Zimbabwe, she ruled.\n\nMotsi had argued that her husband could not pursue a parallel divorce action in Zimbabwe while a similar case was pending before another court of competent jurisdiction in Canada.\n\nThe judge agreed, stressing that this is correct to prevent duplication and conflicting rulings.\n\nIf an action is already pending between parties it is open to the Defendant to take the objection of lis pendens whereupon the court in its discretion may stay the second action pending the decision of the first, she said.\n\nMusaras lawyer had urged the court to use its inherent jurisdiction to hear the case, arguing that his client was being denied access to the couples minor children.\n\nBut Justice Maxwell said those rights must be enforced in the Canadian proceedings.\n\nThat there is an access order being defied is not for these proceedings, she ruled. Plaintiff is legally represented and should be advised on what steps to take to enforce his rights granted by an order of Court.\n\nThe judge also noted that Musara was seeking to have custody of the children awarded to Motsi, making it more appropriate for the Canadian Court to deal with the issue of the maintenance of the minor children.\n\nDismissing the case, Justice Maxwell advised Musara that if Motsi is unnecessarily dragging the process there should be ways in which he can have that matter dismissed by the Canadian Court Once that is done, he can then properly approach this Court.\n\nThe special plea was upheld, effectively halting the Zimbabwe proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13170431/jones-musara.jpg",
            "description": "<p>By Staff Reporter The High Court has thrown out a divorce bid filed by the leader of Zanu PF’s online brigade, Varakashi4ED, Jonas Musara, against his estranged wife living in Canada, ruling that local courts have no jurisdiction because the matter is already before a Canadian court. The application was filed by Musara, who is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-refuses-to-hear-varakashi4ed-leaders-divorce-case-says-canadian-court-has-jurisdiction/\">High Court refuses to hear Varakashi4ED leader’s divorce case, says Canadian Court has jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "15 Aug 2025"
        }
    ]
}