{
    "news": [
        {
            "title": "Former ‘House Of Zwide’ actress Shalate Sekhabi to release debut EP on September 26",
            "url": "https://www.newzimbabwe.com/former-house-of-zwide-actress-shalate-sekhabi-to-release-debut-ep-on-september-26/",
            "content": "TshisaLive\n\nTaking to her Instagram page this week, Shalate teased her next move with a post captionedMusic on the way.\n\nThe announcement confirmed her debut EP will officially drop on September 26.\n\nIn the past five years, Shalate has become a household name for her role as Shoki in the hit e.tv daily dramaHouse of Zwide.\n\nThis year Shalate landed the role ofNthabiin Netflixs young-adult seriesGo!.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/05060353/shalate-shoki.png",
            "description": "<p>TshisaLive Former House of Zwide star Shalate Sekhabi is stepping into a new chapter of her career and this time it’s all about the music. Taking to her Instagram page this week, Shalate teased her next move with a post captioned “Music on the way”. The announcement confirmed her debut EP will officially drop on September 26.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-house-of-zwide-actress-shalate-sekhabi-to-release-debut-ep-on-september-26/\">Former ‘House Of Zwide’ actress Shalate Sekhabi to release debut EP on September 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        },
        {
            "title": "Ebola outbreak kills 15 in DR Congo",
            "url": "https://www.newzimbabwe.com/ebola-outbreak-kills-15-in-dr-congo/",
            "content": "BBC\n\nAt least 15 people have died in a new outbreak of the Ebola virus in the Democratic Republic of Congo, the countrys health ministry has said.\n\nThe presence of the virus had been confirmed in a 34-year-old pregnant woman who was admitted to hospital last month after showing symptoms that included a high fever and repeated vomiting, the ministry added.\n\nShe died a few hours later from multiple organ failure.\n\nThis will be the 16th outbreak of the deadly virus in the vast central African state that has poor health services, and is hit by conflict in the east.\n\nThe latest outbreak is in central Kasai province, with 28 suspected cases recorded, the ministry said.\n\nOfficials have urged strict adherence to preventive measures, including frequent handwashing and social distancing in high-risk areas.\n\nTests identified the Zaire strain of Ebola, a rare but often deadly disease, officials said.\n\nThe World Health Organization (WHO) said it was acting with determination to rapidly halt the spread of the virus and protect communities.\n\nFour health workers were among the 15 people who had died, it said.\n\nCase numbers are likely to increase as the transmission is ongoing. Response teams and local teams will work to find the people who may be infected and need to receive care, to ensure everyone is protected as quickly as possible,WHO added in a statement.\n\nDR Congo had a stockpile of treatments, including 2,000 doses of the Ervebo vaccine, effective to protect against this type of Ebola, the global health body said.\n\nThe last Ebola outbreak in DR Congo was three years ago, killing six people.\n\nAn outbreak in 2018-20 was far deadlier, claiming more than 2,000 lives.\n\nThe virus, which is thought to have originated in fruit bats, was first detected in 1976 near the Ebola River in what is now DR Congo.\n\nPeople are infected when they have direct contact through broken skin, or the mouth and nose, with the blood, vomit, faeces or bodily fluids of someone with Ebola.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/05055746/ebola.webp",
            "description": "<p>BBC At least 15 people have died in a new outbreak of the Ebola virus in the Democratic Republic of Congo, the country’s health ministry has said. The presence of the virus had been confirmed in a 34-year-old pregnant woman who was admitted to hospital last month after showing symptoms that included a high fever</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ebola-outbreak-kills-15-in-dr-congo/\">Ebola outbreak kills 15 in DR Congo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        },
        {
            "title": "Lady Chevrons secure spot in Women’s T20 World Cup Global Qualifier",
            "url": "https://www.newzimbabwe.com/lady-chevrons-secure-spot-in-womens-t20-world-cup-global-qualifier/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior womens cricket team, the Lady Chevrons, have secured a place at the ICC Womens T20 World Cup Global Qualifier in Nepal after defeating Uganda by five wickets in the semifinal of the Africa Qualifier on Thursday afternoon.\n\nZimbabwe put on a disciplined bowling performance, restricting Uganda to 119 runs in their allotted 20 overs while claiming seven wickets.\n\nIn response, the Lady Chevrons chased down the target comfortably, reaching 120 runs in 17 overs with five wickets in hand to seal their qualification.\n\nThe victory sets up a final clash against hosts Namibia in Windhoek on Saturday. Namibia booked their spot after beating Tanzania by eight wickets in the other semifinal.\n\nRegardless of the result, both Zimbabwe and Namibia have already booked their tickets to next years Global Qualifier in Nepal. They will join Scotland, the Netherlands, Ireland, Bangladesh, Thailand, the USA, and hosts Nepal in the competition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/05055308/lady-chevrons.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior women’s cricket team, the Lady Chevrons, have secured a place at the ICC Women’s T20 World Cup Global Qualifier in Nepal after defeating Uganda by five wickets in the semifinal of the Africa Qualifier on Thursday afternoon. Zimbabwe put on a disciplined bowling performance, restricting Uganda to 119 runs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lady-chevrons-secure-spot-in-womens-t20-world-cup-global-qualifier/\">Lady Chevrons secure spot in Women’s T20 World Cup Global Qualifier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        },
        {
            "title": "Govt sets deadline for issuance of title deeds to 384 000 resettled farmers",
            "url": "https://www.newzimbabwe.com/govt-sets-deadline-for-issuance-of-title-deeds-to-384-000-resettled-farmers/",
            "content": "By Anna Chibamu\n\nAgriculture Minister Anxious Masuka has urged resettled farmers to prepare for the issuance of title deeds, which he said will be completed by June 30, 2026.\n\nMasuka announced this during an address to the National Assembly on Wednesday, outlining the governments commitment to strengthening land tenure security under the fast-track land reform programme.\n\nAll resettled farmers with valid tenure documents undoubtedly qualify for the issuance of title deeds. This is a pivotal moment for our farmers, who have waited long for formal recognition of their land rights, Masuka said.\n\nAgriculture Minister Anxious Masuka\n\nHe revealed that around 360,000 Model A1 farmers and 24,000 Model A2 farmers stand to benefit. However, he admitted that logistical challenges remain. Of the 24,000 Model A2 farmers, only about 12,000 have surveyed units ready for processing, with the remainder requiring surveying  a major bottleneck in the process.\n\nTo address this, Masuka said government had engaged the private sector to speed up surveying using modern technology. He also announced the establishment of a one-stop centre at Makombe Complex to streamline title deed processing.\n\nThe centre operates with seven workstations, covering everything from verifying tenure documents to finalising agreements for title deeds, he explained.\n\nOn financing, Masuka said farmers would have several options, including cash purchase, credit facilities, and mortgage arrangements through local banks. To incentivise quick payments, a 15% discount will be offered for cash transactions made within 90 days.\n\nDespite these measures, Masuka acknowledged ongoing challenges, particularly with land surveys and bureaucratic delays, but pledged that government remains committed to ensuring all qualifying farmers receive their title deeds within the set timeframe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/16155649/farm.jpg",
            "description": "<p>By Anna Chibamu Agriculture Minister Anxious Masuka has urged resettled farmers to prepare for the issuance of title deeds, which he said will be completed by June 30, 2026. Masuka announced this during an address to the National Assembly on Wednesday, outlining the government’s commitment to strengthening land tenure security under the fast-track land reform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-sets-deadline-for-issuance-of-title-deeds-to-384-000-resettled-farmers/\">Govt sets deadline for issuance of title deeds to 384 000 resettled farmers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        },
        {
            "title": "Minister professes ignorance on surge in gun crimes",
            "url": "https://www.newzimbabwe.com/minister-professes-ignorance-on-surge-in-gun-crimes/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT has professed ignorance over recent cases of gun killings in the country, which appear to be targeting influential people and businessmen.\n\nDuring a sitting in the National Assembly, the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, was taken to task by the Citizens Coalition for Change (CCC) Member of Parliament, Johnson Matambo, on the spike in gun killings and the action being taken by the government to end the murders.\n\nIn response, Ziyambi said he was not aware of the murders.\n\nI want to say that the prevalence of killings is something that I am hearing from this august House. What I request is that the Hon. Member should bring the paperwork which talks about the prevalence of homicide cases.\n\nIf we respond to such a question without evidence that this is happening, this is an issue which does not augur well, said Ziyambi.\n\nIn recent months, the country has been witnessing murder cases related to gun violence. They have been attributed to the proliferation and ownership of guns by individuals.\n\nIn May this year, the Zimbabwe Republic Police raised concern about the increase in illegal firearms, which is in contravention of the Firearms Act Chapter 10.09.\n\nZiyambi further said the government does not tolerate homicide cases.\n\nGovernment does not want to see homicide cases happening because it is a criminal offence. It is one offence which had a capital punishment life in jail. In the past, it used a death sentence which was given to an offender.\n\nSo, when we look at the issues to do with homicide, you would find that when criminals hear that there are punitive penalties that have been given to perpetrators of homicide, then this would discourage others.\n\nI want to urge the Hon. Member to put in writing his question so that we get clarity and that we also clarify, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Darlington Gatsi GOVERNMENT has professed ignorance over recent cases of gun killings in the country, which appear to be targeting influential people and businessmen. During a sitting in the National Assembly, the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, was taken to task by the Citizens Coalition for Change (CCC) Member of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-professes-ignorance-on-surge-in-gun-crimes/\">Minister professes ignorance on surge in gun crimes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        },
        {
            "title": "Zimbabwean brothers remanded in jail after deadly fight over a Limpopo woman",
            "url": "https://www.newzimbabwe.com/zimbabwean-brothers-remanded-in-jail-after-deadly-fight-over-a-limpopo-woman/",
            "content": "IOL\n\nTwo Zimbabwean brothers accused ofhacking a man to death with an axe and severely injuring a woman in a Limpopo villagehave appeared in court and were remanded in custody.\n\nThe brothers,Johannes Makhura, 20, and his elder brother, Jonas Makhura,55, were arrested after a bloody altercation in Wegdraai Village, Maleboho, reportedly sparked by a fight over a woman.\n\nProvincial police spokesperson Colonel Malesela Ledwaba confirmed the charges facing the pair.\n\nThe younger brother, Johannes Makhura, has been charged with murder, defeating the ends of justice, and contravening the Immigration Act, said Ledwaba. His elder brother, Jonas Makhura, is facing charges of murder, attempted murder, and contravening the Immigration Act.\n\nThe younger sibling was arrested shortly after the attack, and police recovered the axe allegedly used in the crime. The elder brother was later tracked down in the Alldays policing area, allegedly attempting to flee the country.\n\nHe was found hiding inside a truck headed towards Zimbabwe and carrying a bag of clothes in an attempt to escape, Ledwaba said.\n\nBoth suspects appeared before the Senwabarwana Magistrates Court on Wednesday. They were remanded in custody until 15 September 2025, when the matter will be heard at the Maleboho Periodical Court.\n\nMeanwhile,Limpopos provincial police commissioner, Lieutenant General Thembi Hadebe,welcomed the swift arrest of the brothers and applauded community members for helping police track down the alleged killers.\n\nThis was a brutal act of violence. We call upon communities to continue working closely with the police. We will not tolerate such despicable behaviour, and no one is above the law, said Hadebe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/04162742/Johannes-makura.png",
            "description": "<p>IOL Two Zimbabwean brothers accused of hacking a man to death with an axe and severely injuring a woman in a Limpopo village have appeared in court and were remanded in custody. The brothers, Johannes Makhura, 20, and his elder brother, Jonas Makhura, 55, were arrested after a bloody altercation in Wegdraai Village, Maleboho, reportedly sparked by a fight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-brothers-remanded-in-jail-after-deadly-fight-over-a-limpopo-woman/\">Zimbabwean brothers remanded in jail after deadly fight over a Limpopo woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        },
        {
            "title": "EcoCash ramps up UK remittances drive",
            "url": "https://www.newzimbabwe.com/ecocash-ramps-up-uk-remittances-drive/",
            "content": "By Alois Vinga\n\nEcoCash, Zimbabwes largest financial technology platform, says it is stepping up efforts to increase international remittance receipts by partnering with more global payment platforms.\n\nThe mobile money service, owned by Econet Wireless Zimbabwe, already partners with leading global remittance providers such as Sasai Money Transfer, Western Union, WorldRemit, MamaMoney, MoneyGram, Remitly, Shoprite Send and Terrapay.\n\nEcoCash currently has over 40 partners integrating into mobile wallets. The company revealed that it is currently in talks with additional international partners as part of its long-term strategy to build a truly global payments ecosystem.\n\nEfforts to onboard more payment partners are ongoing as we aim to establish a global platform that prioritises convenience, affordability and value for customers, EcoCash said last week at the Institute of Chartered Accountants of Zimbabwe (ICAZ) Winter School 2025 and Investment Conference in the United Kingdom.\n\nThe high-profile gathering is positioning Zimbabwe as an emerging investment hub and showcasing the countrys deal pipeline, growth-ready sectors and capital opportunities.\n\nIt is also connecting institutional investors, global financiers and the diaspora with pathways to channel funds into productive ventures.\n\nThe initiative by EcoCash comes at a time when remittances are increasingly playing a vital role in Zimbabwes economy.\n\nAccording to the Reserve Bank of Zimbabwe (RBZ), diaspora remittances surpassed US$2 billion in 2024, making them one of the countrys largest and most stable sources of foreign currency.\n\nAnalysts say EcoCashs expanded global footprint is timely and strategic, enabling millions of Zimbabweans abroad to send money home faster, more securely, and at a lower cost. EcoCash zero-rates all remittance withdrawals  or cash-outs  from its wallets. It has an extensive distribution network of over 60,000 merchants and channel partners across the countrys rural and urban areas.\n\nIn 2024, EcoCash recorded a 21% growth in transaction volumes and a 210% surge in transaction values, driven by increased wallet funding and growing customer adoption.\n\nThe growth reflects consumer trust in the mobile money platform and the increasing importance of digital channels in cross-border money transfers.\n\nBeyond household support for essentials  such as food, school fees, healthcare, and housing  remittances are increasingly powering small business growth and community development projects, EcoCash said, noting that reliable and affordable digital payment services are enabling both rural and urban recipients to transact, save and invest without relying on costly cash-based methods.\n\nIndustry experts observe that strengthening formal remittance channels curb dependence on informal networks, improves financial inclusion and enhances consumer protection.\n\nWith Zimbabwes diaspora spread across South Africa, the UK, the US, Australia and beyond, EcoCashs expansion of its partner network offers more convenience and consolidates its market leadership in the mobile money space.\n\nAs we expand, our mission remains clear  to empower Zimbabweans abroad to conveniently support their loved ones with ease, while ensuring that recipients at home enjoy safe, transparent and seamless access to funds for both their everyday needs and future investments.\n\nRemitHope  a fintech-powered social enterprise that mobilises financial support for underfunded African-led community initiatives and leverages EcoCash to channel remittances into Africa to close the funding gaps  also participated at the ICAZ Winter School 2025 and Investment Conference in the UK.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/04200114/ecocash.jpg",
            "description": "<p>By Alois Vinga EcoCash, Zimbabwe’s largest financial technology platform, says it is stepping up efforts to increase international remittance receipts by partnering with more global payment platforms. The mobile money service, owned by Econet Wireless Zimbabwe, already partners with leading global remittance providers such as Sasai Money Transfer, Western Union, WorldRemit, MamaMoney, MoneyGram, Remitly, Shoprite</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ecocash-ramps-up-uk-remittances-drive/\">EcoCash ramps up UK remittances drive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "05 Sep 2025"
        }
    ]
}