{
    "news": [
        {
            "title": "Madzingo scoops Excellence in Financial Services Award at UK-Zimbabwe Business Expo in Birmingham",
            "url": "https://www.newzimbabwe.com/madzingo-scoops-excellence-in-financial-services-award-at-uk-zimbabwe-business-expo-in-birmingham/",
            "content": "By Chipo Sabeta\n\nUnited Kingdom-based Zimbabwean entrepreneur Jeff Madzingo, the founder and Chief Executive Officer ofDiaspora Insurance, has once again demonstrated his business excellence after winning the Excellence in Financial Services Award at the UK-Zimbabwe Business Expo Awards held over the weekend in Birmingham, United Kingdom.\n\nThe award, which recognises outstanding innovation, leadership, and community impact in the financial sector, adds to an already impressive list of honours Madzingo has received for his exceptional contribution to empowering the global African diaspora.\n\nA multi-award-winning businessman and respected community leader, Madzingo has builtDiaspora Insuranceinto one of the most trusted brands serving Africans living abroad, with coverage extending across 25 African countries. The company specialises in providing bespoke financial and insurance solutions tailored for diasporans, ensuring dignityand peace of mind during lifes most challenging moments.\n\nSpeaking from Diaspora Insurance House, Madzingo dedicated the recognition to his team and the wider diaspora community.\n\nThis honour is not just mine, it belongs to every hardworking diasporan striving to make a difference. At Diaspora Insurance, our mission has always been to protect and empower our people, wherever they are in the world.\n\nHe also reaffirmed his passion for community empowerment and changing global perceptions of the African diaspora.\n\nOur focus has always been community empowerment and changing the diaspora narrative. We cannot continue to be defined by grieving and begging. We must educate and empower with the same energy.\n\nThe UKZimbabwe Business Expo is an annual event that brings together Zimbabwean entrepreneurs, professionals, investors, and community leaders from across the United Kingdom and beyond. It serves as a premier platform for networking, investment promotion, and business collaboration, celebrating excellence within the Zimbabwean and wider African diaspora business community.\n\nThe accompanying Expo Awards honour individuals and organisations making outstanding contributions in sectors such as finance, technology, education, and community development.\n\nOver the years, Madzingo has become a household name among Africans in the UK, not only for his business acumen but also for his philanthropy and community leadership. He continues to inspire young entrepreneurs and professionals through mentorship and his advocacy for economic empowerment.\n\nHis continued success reaffirms his place as one of the most influential Zimbabwean business figures abroad, demonstrating that excellence, integrity, and service can indeed go hand in hand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/09130023/jeff-madzingo-DI.jpg",
            "description": "<p>By Chipo Sabeta United Kingdom-based Zimbabwean entrepreneur Jeff Madzingo, the founder and Chief Executive Officer of Diaspora Insurance, has once again demonstrated his business excellence after winning the Excellence in Financial Services Award at the UK-Zimbabwe Business Expo Awards held over the weekend in Birmingham, United Kingdom. The award, which recognises outstanding innovation, leadership, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madzingo-scoops-excellence-in-financial-services-award-at-uk-zimbabwe-business-expo-in-birmingham/\">Madzingo scoops Excellence in Financial Services Award at UK-Zimbabwe Business Expo in Birmingham</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        },
        {
            "title": "Mzansi Magic’s ‘Inimba’ wedding special: Viewers sceptical about the happy couple’s big day",
            "url": "https://www.newzimbabwe.com/mzansi-magics-inimba-wedding-special-viewers-sceptical-about-the-happy-couples-big-day/",
            "content": "IOL\n\nThe storylines onMzansi Magic drama Inimbahave had viewers entertained and now one of the lead couples will be saying I do.\n\nThe invitation is out for Hlathi and Thumekas long-awaited one-hour wedding special episode starting at 21:00pm on Friday.\n\nHlathi and Thumeka portrayed by Zenande Mfenyana and Sisa Hewana have had a rocky relationship and now they finally get their big day.\n\nWhile the happy couple may be excited for their big day, viewers who have witnessed the ups and downs not so much. The comment section of the Instagram post, with the couples wedding invitation, is filled with many saying they are missing the big occasion.\n\nthumeka has been previously burned by Hlathi, who returned to her after he was droppedZoleka. Viewers are convinced that Thumeka will be hurt again by Hlathi.\n\nNot available, sorry, commented Tade\n\nNot only wedding bells are in the air, but so is peace seeming possible as Zoleka and Thumeka embrace a moment of reconciliation, hinting at the much-needed healing between their sisterhood relationship.\n\nHowever, drama is brewingbeneath the surface, a secret is quietly growing and is about to be revealed on the special wedding day.\n\nThe Mabandla family keeps viewers guessing; Zoleka has found love in the arms of her boss and partner Lazarus; and uMafungwashe kaHlathi, Qhawe, already with a promise ring from Mawethu, but will she ever forgive his indiscretion?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/09081609/inimba.jpeg",
            "description": "<p>IOL The storylines on Mzansi Magic drama “Inimba” have had viewers entertained and now one of the lead couple’s will be saying “I do”. The invitation is out for Hlathi and Thumeka’s long-awaited one-hour wedding special episode starting at 21:00pm on Friday. Hlathi and Thumeka portrayed by Zenande Mfenyana and Sisa Hewana have had a rocky relationship</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mzansi-magics-inimba-wedding-special-viewers-sceptical-about-the-happy-couples-big-day/\">Mzansi Magic’s ‘Inimba’ wedding special: Viewers sceptical about the happy couple’s big day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        },
        {
            "title": "Madagascar president asks for one year to resolve problems or he will resign",
            "url": "https://www.newzimbabwe.com/madagascar-president-asks-for-one-year-to-resolve-problems-or-he-will-resign/",
            "content": "BBC\n\nMadagascars President Andry Rajoelina has asked for one year to fix the countrys challenges, promising that if they persist, he will resign.\n\nHe said this during a town-hall style meeting at his palace with various groups of government supporters. Many attendees had the opportunity to ask the president questions or simply share their views  to which he responded.\n\nI dont want flattery. I want to hear the truth. Its the people who kept telling me that everything was fine who are responsible for our current situation, he said.\n\nThe movement behind the protest, known as Gen Z Mada, has been calling for the president to resign  and rejected an invitation to attend the talks.\n\nThey argue that they cannot engage a government that has been repressing them as they demand basic human rights. The group has called for new protests on Thursday.\n\nWe refuse the presidents invitation to talks. We will not engage in dialogue with a regime that represses, assaults, and humiliates its youth in the streets, they wrote on their Facebook page.\n\nRajoelina has been holding these meetings as part of his pledge to listen more, emphasising that the challenges facing the Indian Ocean island nation can only be solved through honest conversations and not protests.\n\nThe president assured those at the dialogue that ongoing power projects would address the recurring outages by adding 265 megawatts to the national grid.\n\nI swear that if power cuts persist in the capital within a year, I will resign, he said.\n\nThe protests began on 25 September triggered by anger over persistent power and water shortages, and have escalated into broader dissatisfaction over corruption, high unemployment and the cost-of-living crisis.\n\nLast week, Rajoelina sacked his entire government and appointed an army general as prime minister on Monday. The protest movement rejected the appointment and vowed to continue their struggle.\n\nRajoelina came to power in 2009 after leading mass protests that triggered military intervention and overthrew then-President Marc Ravalomanana.\n\nAlthough the youth-led movement continues to demand his resignation, street protests appear to have weakened.\n\nLife in most parts of the capital, Antananarivo, continues as normal, except in a few neighbourhoods with a heavy police presence, where some roads have been blocked or are being closely monitored.\n\nAt least 22 people have died in clashes with security forces and scores more have been injured, according to the United Nations. The authorities have disputed these figures.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/09080838/madagascar.webp",
            "description": "<p>BBC Madagascar’s President Andry Rajoelina has asked for one year to fix the country’s challenges, promising that if they persist, he will resign. He said this during a town-hall style meeting at his palace with various groups of government supporters. Many attendees had the opportunity to ask the president questions or simply share their views</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/madagascar-president-asks-for-one-year-to-resolve-problems-or-he-will-resign/\">Madagascar president asks for one year to resolve problems or he will resign</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        },
        {
            "title": "Richard Ngarava’s tall tale: how a Zimbabwe fast bowler came into his own",
            "url": "https://www.newzimbabwe.com/richard-ngaravas-tall-tale-how-a-zimbabwe-fast-bowler-came-into-his-own/",
            "content": "ESPN\n\nIf youre interested in gaining height, ZimbabwesRichard Ngarava, who stands at 1.98 metres, is willing to let you in on his secret.\n\nAnyone who asks me how I got tall, I tell them I only ate vegetables, Ngarava says, the day after he helpedZimbabwe qualify for next years T20 World Cup. He is, of course, not being entirely serious, but his growth spurt from a chubby and short young teen to a lean, lanky one coincided with him deciding to take his health seriously.\n\nI put myself on a diet, and I dont even know why I did it, he says. At that time I was a batter and I bowled a bit of spin but in Grade Nine everything just changed. For close to four years, I was on a diet and I made sure I didnt miss any gym sessions. As a young boy, I loved pizza and fried chicken but I cut those out and told myself I am going to eat fruits and vegetables, and drink water only. Thats when I became tall.\n\nAt the time, Ngarava was a student at Churchill School but playing club cricket in the area he grew up in, Harares Highfield, which is home to the famous Takashinga Cricket Club. Also part of the club wasBlessing Muzarabani, presumably born tall and currently 2.07 metres. The pair became friends. We went to different schools but we both played for the same Takashinga age-group team. Weve been pushing each other since we were Under-12s, Ngarava says.\n\nThere was one important difference between the Ngarava and Muzarabani of the early 2000s and the players they are now. Back then, Blessing was a legspinner and I was mostly a batter, Ngarava says.\n\nAlso, incidentally the first time he came to international attention it was, in fact, for something that happened when he was batting. At the 2016 Under-19 World Cup,Ngarava was run-out at the non-strikers end by Keemo Paul of West Indies. Zimbabwe needed just two runs to winthat matchwhen Ngarava was dismissed. The run-out put West Indies in the quarter-final and sparked a debate about the spirit of cricket.\n\nWhen it happened, I thought it was a ruse, Ngarava says. I was not really happy when I walked off the field and everyone else was not happy in the dressing room. We later understood that it was part of the game. But what I didnt like about the situation was, there was no warning from anyone.\n\nWhile bowlers are not obliged to warn batters who are backing up too far, and there is no rule against running out a batter at the non-strikers end, in some circles it is thought of as polite to give a batter a warning. This has been at the heart of some of crickets culture wars in recent times.\n\nHas Ngarava ever thought of running a non-striker out while bowling? At some point maybe. But then I figured, nah, I just want to play normal cricket. I dont want to mess with peoples moods.\n\nAgain, not entirely true, because Ngarava says he turned to fast bowling as a teenager because he quite enjoyed just hurting people. Slowly he started to change that outlook. Under the guidance of his school coach George Tande he discovered an ability to swing the ball. I actually like taking wickets more than hurting people, he realised.\n\nHe made Zimbabwes age-group sides in his mid-teens and continued to represent Takashinga and was part of their first team. He credits them with his growth, particularly the clubs trips to Uganda, where they played that countrys national side. We didnt look at those as just normal games or club games, we looked at them as international games because we were playing Uganda, he says.\n\nOne day, when he was around 18, he received a call while he was in Uganda. It was his international call-up.\n\nNgarava made hisdebut against Afghanistanin an ODI in 2017, and two and a half years after that, playedhis first T20I. Though he was always comfortable opening the bowling, he soon became interested in bowling at the end of an innings. I wanted to be the best death bowler in the team, he says. But I ended up developing more skills as I played more games. I used to enjoy just bowling yorkers and short balls but Ive now added some other skills to my game.\n\nThe appointment of Charl Langeveldt to Zimbabwes coaching staff in the middle of 2024 was a game changer for Ngarava. It was around then that he developed an important weapon.\n\nThe wobble seam has done so much for me, he says. Sometimes you dont really know what the ball is going to do [with a wobbly seam] but I just want to target that fifth-stump line or fourth-stump line and whatever the ball is going to do there, Im quite happy with it.\n\nIts different from the normal seam, where you can actually see the seam from the hand and its easy to pick. Ive seen the English bowlers are doing it now more often, where theyre wobbling the ball. Its also different from Jimmy Anderson, where he actually had to make sure that his seam is up for him to swing the ball.\n\nNgarava got a first hand-hand look at the English bowlers when Zimbabwe toured there earlier this year to playa first Testin that country in over two decades. He was named in the starting XI and bowled nine overs in the first innings but could play no further part in the match after suffering a back injury on day one.\n\nIts not a nice feeling to get injured and still get to hang around the ground and see the boys playing, he says. It was really disappointing considering it was historic. We hadnt played England for so long and I also wanted to perform, he says. I felt bad for the team and I asked myself, Is this the right time to get injured? even though I knew I couldnt control it. I tried to hide those emotions and didnt show them to anyone.\n\nThe issue was caused by a bulging vertebral disc and Ngarava has not played in any of Zimbabwes four Tests since. That has been tough because he says playing the longest format is something that I really want to do. Of course, Zimbabwe are not part of the World Test Championship, and for now, their focus is on the next two major white-ball tournaments: the 2026 T20 World Cup and the 2027 ODI World Cup. They will co-host the latter with South Africa and Namibia.\n\nGetting to the first of those was crucial for maintaining the relevance of Zimbabwe cricket, after they were the only Full Member to miss out on the 2024 T20 World Cup because they lost to Uganda in the qualifiers. This time,Zimbabwe beat Uganda easily, Ngarava removed their best batter Raizat Ali Shah and also finished asthe joint leading bowler at the event. In the process he also became thefirst Zimbabwean to 100 T20I wickets.\n\nOrdinarily you would expect a team and one of their key players to celebrate under the circumstances, but Zimbabwe and Ngarava are just relieved. It was quite nice to qualify in front of the Harare fans but everyone is not really expressing the way they feel, he says. Maybe guys are still not sure that we actually qualified. Everyone is just calm about it because weve got that understanding of us wanting to actually play for the team more than individual performances.\n\nBut there is also excitement. I cant wait to be on that plane to India and Sri Lanka and then also play the 50-over World Cup, and hopefully we will do something for the fans.\n\nNgarava already has some experience of Sri Lanka from his time in theLanka Premier League in 2023and ontwo tours there for Zimbabwe. His LPL appearance was the first of several league gigs, including the BPL and the ILT20, though he hasnt yet played a game in those last two leagues. Most recently he picked up a deal at Sharjah Warriors in the ILT20, for whom he hopes to play in the UAE ahead of the T20 World Cup. His new-ball partner, Muzarabani, will also be there, for Gulf Giants, as the two bowlers journeys continue to mirror each other.\n\nIts funny how were both now seam bowlers, Ngarava says. I dont really know how it happened, But he does. Theyre both very, very tall and he knows how that helps. Before talent or before anything else, having good height as a fast bowler gives you an extra advantage.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/09062329/ngarava.jpeg",
            "description": "<p>ESPN If you’re interested in gaining height, Zimbabwe’s Richard Ngarava, who stands at 1.98 metres, is willing to let you in on his secret. “Anyone who asks me how I got tall, I tell them I only ate vegetables,” Ngarava says, the day after he helped Zimbabwe qualify for next year’s T20 World Cup. He is, of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/richard-ngaravas-tall-tale-how-a-zimbabwe-fast-bowler-came-into-his-own/\">Richard Ngarava’s tall tale: how a Zimbabwe fast bowler came into his own</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        },
        {
            "title": "Crowhill residents’ bid to overturn Borrowdale Gated Community approval flops",
            "url": "https://www.newzimbabwe.com/crowhill-residents-bid-to-overturn-borrowdale-gated-community-approval-flops/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an application by the Upper Crowhill Residents Association seeking to invalidate Mount Breezes Borrowdale Brooke Estates gated community status and to reclaim access to a contested road cutting through the estate.\n\nJustice Joel Mambara ruled that the application was fatally defective and an abuse of court process, finding that the residents association had no locus standi to approach this Court and had acted with dirty hands by continuing to occupy stands and use an illegal road without compliance certificates.\n\nThe applicants illegal actions are not merely incidental to its claim  they are central to it, Mambara said in a damning judgment. One cannot build an unlawful road through someone elses land and then ask a court to declare that road to be lawful.\n\nAt the heart of the dispute was Crowhill Road, a route Crowhill residents claimed had historically provided them access to Borrowdale Road.\n\nThe City of Harare, however, in 2015 issued a letter stating it had no objection to Mount Breezes establishing a gated community, paving the way for the installation of gates that effectively blocked Crowhill residents from using the road.\n\nThe residents argued that the Citys decision was unlawful and that the servitudes establishing the road had been extinguished when the area was subdivided in 1999. But the court dismissed their claim, stressing that the association was improperly constituted, came into existence only in 2024, and was trying to reopen issues already settled by earlier rulings.\n\nA child born in 2024 cannot retrospectively challenge decisions that its parents made in 2015, the judge said, echoing the respondents argument.\n\nMambara also condemned the association for ignoring a binding 2014 consent order that gave Crowhill Farm (Pvt) Ltd exclusive authority to represent residents in legal matters until the development is fully regularised.\n\nThe court further held that the application was in substance a review of administrative action, disguised as a declaratory application, and was therefore grossly out of time since it sought to overturn a City of Harare decision made nine years ago.\n\nDismissing the application with punitive costs, the judge warned: The courts cannot connive at or condone the applicants open defiance of the law. Citizens are obliged to obey the law of the land and argue afterwards.\n\nThe ruling cements earlier judgments affirming Mount Breezes residents right to enjoy their gated community free from trespass and effectively ends Crowhill residents long-running bid to force open access through the estate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an application by the Upper Crowhill Residents Association seeking to invalidate Mount Breezes Borrowdale Brooke Estate’s gated community status and to reclaim access to a contested road cutting through the estate. Justice Joel Mambara ruled that the application was “fatally defective” and an abuse of court</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crowhill-residents-bid-to-overturn-borrowdale-gated-community-approval-flops/\">Crowhill residents’ bid to overturn Borrowdale Gated Community approval flops</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        },
        {
            "title": "Coach raised his hand and accidentally made contact with me — Ngezi Platinum Player covers for Chiragwi after sideline slap",
            "url": "https://www.newzimbabwe.com/coach-raised-his-hand-and-accidentally-made-contact-with-me-ngezi-platinum-player-covers-for-chiragwi-after-sideline-slap/",
            "content": "By Sports Reporter\n\nNgezi Platinum Stars forward McDonald Makuwe has defended his coach, Takesure Chiragwi, after the gaffer slapped him during a heated match against Dynamos on Saturday.\n\nThe incident, captured on camera, shows Makuwe attempting to calm Chiragwi, who was protesting a red card decision, before the coach struck him across the face.\n\nThe footage sparked outrage online, prompting Chiragwi to issue a public apology and resign as Warriors assistant coach.\n\nBoth the Premier Soccer League (PSL) and the Footballers Union of Zimbabwe (FUZ) condemned the incident and requested detailed reports from the club.\n\nIn a statement, however, Makuwe downplayed the altercation, insisting that the contact was accidental.\n\nCoach had already received a red card, unfortunately. During this exchange, the Head Coach inadvertently raised his hand, and in doing so, he accidentally made contact with me.\n\nI want to emphasise that this incident did not cause me any physical harm, nor did it affect our relationship, Makuwe said.\n\nThe 24-year-old added that Chiragwi had since apologised.\n\nI see Coach Chiragwi as more than just a coach; he has been both a mentor and a father figure to me during my time at the club and even before that.\n\nFollowing the incident, Coach Chiragwi apologised to me in front of the players and Mr Musariri, the club Chairman, he added.\n\nChiragwis conduct has drawn wider attention to discipline within the local league, coming barely a month after the PSL suspended Yadah FC board member Spencer Muvadi for one year after he was found guilty of assaulting the clubs goalkeeper, Godknows Gurure, in August.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter Ngezi Platinum Stars forward McDonald Makuwe has defended his coach, Takesure Chiragwi, after the gaffer slapped him during a heated match against Dynamos on Saturday. The incident, captured on camera, shows Makuwe attempting to calm Chiragwi, who was protesting a red card decision, before the coach struck him across the face. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/coach-raised-his-hand-and-accidentally-made-contact-with-me-ngezi-platinum-player-covers-for-chiragwi-after-sideline-slap/\">Coach raised his hand and accidentally made contact with me — Ngezi Platinum Player covers for Chiragwi after sideline slap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        },
        {
            "title": "High Court upholds dismissal of two constables over missing dagga exhibit",
            "url": "https://www.newzimbabwe.com/high-court-upholds-dismissal-of-two-constables-over-missing-dagga-exhibit/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by two police officers, Constables Robert Muganhu and David Hama, who were challenging their dismissal after being found guilty of tampering with dagga exhibits in a case that collapsed under suspicious circumstances.\n\nJustice Siyabona Musithu ruled that the officers conduct was reasonably likely to bring discredit to the police service, rejecting their claim that their acquittal in a criminal court should have protected them from disciplinary conviction.\n\nThis Court noted that the sentence imposed by the Trial Officer is not harsh or induces a sense of shock,Musithu said.\n\nThe sentence passed was appropriate, taking into consideration the gravity and seriousness of the offence committed by the appellants. A non-custodial sentence does not suffice under these circumstances.\n\nThe matter dates back to January 31, 2023, when the two officers arrested Loveness Tsoora and Aaron Muza in Glendale after finding a red plastic container of dagga, allegedly half full. The drugs were taken to Howard Police Base but later mysteriously shrank to only two twists of dagga.\n\nThe internal police tribunal found the officers guilty of disposing of most of the dagga and releasing Tsoora without proper procedure, despite the pair being acquitted of criminal charges on appeal in 2023. The disciplinary body ruled that their actions undermined public trust in the force.\n\nThe officers argued that the disciplinary tribunal erred since the High Court had already cleared them of criminal wrongdoing on the same allegations. They also insisted that no evidence was adduced beyond any reasonable doubt that they had tampered with the drugs.\n\nBut the High Court stressed that an acquittal in criminal proceedings did not bar internal disciplinary action. The present disciplinary proceedings were concerned with the manner in which the applicants had conducted themselves, which it was reckoned was likely to bring discredit to the police service, Justice Musithu wrote.\n\nLawyers for the applicants also argued that their custodial sentences were grossly irregular and too harsh given mitigating factors, suggesting that a reprimand or salary freeze would have sufficed.\n\nThe court rejected this argument. The points raised in mitigation were outweighed by the gravity and the seriousness of the offence committed by the Appellants, Justice Musithu said, siding with the Commissioner-General of Police.\n\nThe officers were also ordered to pay legal costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by two police officers, Constables Robert Muganhu and David Hama, who were challenging their dismissal after being found guilty of tampering with dagga exhibits in a case that collapsed under suspicious circumstances. Justice Siyabona Musithu ruled that the officers’ conduct “was reasonably likely to bring</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-upholds-dismissal-of-two-constables-over-missing-dagga-exhibit/\">High Court upholds dismissal of two constables over missing dagga exhibit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "09 Oct 2025"
        }
    ]
}