{
    "news": [
        {
            "title": "A brief overview of the regulation of dogs in Zimbabwe",
            "url": "https://www.newzimbabwe.com/a-brief-overview-of-the-regulation-of-dogs-in-zimbabwe/",
            "content": "By Mlondolozi Ndlovu\n\nLast week, Zimbabwe was once again confronted with the tragic consequences of dog attacks when a man was fatally mauled by a pit bull in Harare.\n\nThe dog was later euthanised, and the owner was arrested and charged with culpable homicide.\n\nThat incident has brought national attention to the gaps in how the country regulates the keeping of dangerous dogs and handles accountability when they cause harm.\n\nDrawing from that tragic event, attention now turns to the laws that govern dog ownership, the responsibilities they place on owners, the nature of liability when attacks occur, and what more can be done legally and structurally to reduce the frequency and severity of dog attacks in Zimbabwe.\n\nThe Legal Framework on Dog Ownership\n\nZimbabwe does not have a single unified Dog Act. Instead, various laws and bylaws touch on aspects, ranging from animal welfare and disease control to criminal liability and public safety.\n\nThe key statutory instruments include- the Prevention of Cruelty to Animals Act [Chapter 19:09, the Animal Health Act [Chapter 19:01], the Criminal Law (Codification and Reform) Act [Chapter 9:23] and the Municipal bylaws (e.g. those from City of Harare, Bulawayo etc.)\n\nEach of these pieces of legislation contributes a specific layer of regulation, but there is no comprehensive framework dealing specifically and adequately with the challenges posed by keeping aggressive or potentially dangerous dogs in residential or public areas.\n\nUnder Section 3 of the Prevention of Cruelty to Animals Act, dog owners are legally obligated to prevent cruelty, suffering, neglect, or terror being caused to an animal.\n\nThe law imposes a duty on every owner to exercise reasonable care and supervision over their animals. Importantly, an owner can be prosecuted not only for acts of cruelty but also for omissions, such as failing to secure a dog properly, that result in harm.\n\nThe Animal Health Act, on the other hand, provides the government with powers to regulate the keeping, movement, and control of animals, especially where disease transmission or public safety is concerned.\n\nIn terms of Section 5, the Minister of Agriculture may impose restrictions to establish a licensing system for domestic animals, including dogs. However, these provisions are more often invoked in the context of livestock and zoonotic diseases, not urban attacks.\n\nLocal authorities may also enact bylaws to govern dog licensing, lease requirements, noise control, and maximum numbers per household. However, in practice, many municipalities fail to enforce these rules, and the public is often unaware of their obligations.\n\nThus, Zimbabwe does have scattered legal provisions, but these are fragmented, poorly enforced and outdated relative to the scale and seriousness of dog attacks in recent years.\n\nOne of the key questions in cases of dog attacks is Who is legally responsible when a dog bites, injures, or kills someone? In Zimbabwean law, the answer largely centers on the owner or the person in control of the dog at the time of the incident.\n\nThe Criminal Code contains several provisions relevant to dog-related injuries and deaths.\n\nAccording to Section 89, if a person commands or intentionally causes a dog to attack another, they can be charged with assault via indirect application of force.\n\nSection 90 provides that any person who, by any act whatsoever, causes serious bodily harm to another person, negligently failing to realise that serious bodily harm may result from his or her conduct or negligently failing to guard against that possibility, shall be guilty of negligently causing serious bodily harm.\n\nIf someone negligently allows their dog to injure another person, this offence applies.\n\nSection 49 (Culpable Homicide) provides that where negligence results in death, such as failing to confine a known aggressive dog, a person can be charged with culpable homicide.\n\nThese provisions make it clear that owners bear criminal responsibility for their dogs actions, especially where the owners conduct falls below the legal standard of reasonable care.\n\nIn addition to criminal charges, victims or their families may pursue delictual claims against dog owners. This includes claims for pain and suffering, medical bills or funeral expenses, loss of income or support and emotional trauma.\n\nThis is known as pauperian action or action de pauperise. It involves an action arising out of harm caused by domestic animals. It is based on the notion that an owner is strictly liable for the harm that the animal causes to another person. In order to succeed in such a claim, one should prove;\n\ni. That the Defendant was the owner of the animal when damage was inflicted\n\nii. That the animal which inflicted the damage is a domestic animal\n\niii. That the Plaintiff was lawfully present at the location where the damage was inflicted\n\niv. That the animal acted contra naturam sui generis, that is to say, contrary to its nature or class.\n\nFrom an objective point of view, the animal must have acted contrary to what may be expected of a decent and well-behaved animal of its kind.\n\nv. The animal must have caused the damage spontaneously from an inward excitement or vice, that is to say, without provocation.\n\nThe growing number of fatal dog attacks, many involving pit bulls, boerboels, and crossbreeds, suggests that current laws are no longer sufficient to deal with the real dangers of unregulated dog ownership.\n\nNotable recent attacks include the March 2023 Whitecliffe incident, where a 9-year-old was killed by a boerboel, the August 2022 Matshemhlophe attack, where two boerboels killed a 6-year-old girl and the May 2022 Selbourne Park case, where a man was fatally attacked by his own dogs.\n\nThe examples, among others, demonstrate that dog attacks are not isolated events. They are a pattern, especially involving large, aggressive breeds in urban and peri-urban settings.\n\nThe combination of weak fencing, lack of training, absence of licensing, and community inaction often leads to predictable, preventable tragedies.\n\n1. Mandatory Licensing and Registration\n\nAll dogs, especially aggressive breeds such as pit bulls, boerboels, and rottweilers, should be subject to a compulsory licensing and microchipping system. Owners must register their dogs with municipal authorities and renew the license annually. This would improve traceability and make it easier to hold owners accountable.\n\n2. Breed-Specific Regulation\n\nWhile some are calling for a total ban on pit bulls, a more effective solution is tight breed-specific regulation. Outright bans are often difficult to enforce and may drive ownership underground. Instead, the following can be done-require muzzling and leashing in public spaces, impose ownership restrictions e.g. no ownership by persons under 21 and require special permits for keeping aggressive breeds, contingent on proof of secure fencing, dog training and insurance.\n\n3. Minimum Housing and Confinement Standards\n\nLegislation should prescribe minimum standards for secure fencing and enclosures for households keeping large or aggressive dogs. These standards should be enforceable through random inspections and backed by municipal fines.\n\n4. Mandatory Insurance\n\nOwners of aggressive breeds should be required to carry third-party liability insurance to cover injury or death caused by their dogs. This protects both the victims and the financial stability of owners.\n\n5. Licensing of Dog Sellers and Crackdown on Illegal Sales\n\nA critical but often overlooked factor contributing to dog attacks is the unregulated sale of dangerous breeds. Many of these high-risk dogs are sold informally through the black market.\n\nThis means individuals without the necessary capacity, training, or housing standards can easily acquire dogs that require expert handling.\n\nEvery person or business selling dogs, particularly aggressive breeds, should be licensed by the local authority or veterinary board. Selling dogs without a license should be criminalised with clear penalties, including fines and imprisonment.\n\nLicensing requirements should include proof of veterinary inspection, proper breeding and socialisation practices and verification that buyers meet the legal criteria for ownership.\n\nCracking down on illegal dog sales would prevent untrained individuals from owning powerful breeds, thereby reducing the risks of abuse, neglect and eventual attacks.\n\nIn summation, dog attacks in Zimbabwe are no longer isolated tragedies; they reflect a deeper problem rooted in weak regulation, poor enforcement, and a widespread lack of accountability among dog owners and sellers.\n\nAlthough legal provisions such as the Prevention of Cruelty to Animals Act, the Animal Health Act, and the Criminal Code assign liability to dog owners, they are fragmented, reactive, and under-enforced.\n\nThe absence of breed-specific regulations, enforceable confinement standards, licensing of sellers, and a clear system for early intervention continues to put the public at risk.\n\nPreventing future attacks requires a fundamental shift. Dog ownership, especially of aggressive breeds, must be treated as a regulated responsibility, not a causal entitlement.\n\nOwners must be held civilly and criminally accountable, illegal dog sellers must face penalties, and municipalities must be empowered to enforce minimum housing, licensing and training standards.\n\nA comprehensive, proactive legal framework, backed by enforcement and public cooperation, is the only sustainable path forward. The law must evolve, not only to punish after loss, but to protect before it happens again.\n\nMlondolozi Ndlovu is a Zimbabwean journalist who is also a media lecturer, legal and media researcher. He writes in his personal capacity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/14112921/vicious-Boer-dogs.png",
            "description": "<p>By Mlondolozi Ndlovu Last week, Zimbabwe was once again confronted with the tragic consequences of dog attacks when a man was fatally mauled by a pit bull in Harare. The dog was later euthanised, and the owner was arrested and charged with culpable homicide. That incident has brought national attention to the gaps in how</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-brief-overview-of-the-regulation-of-dogs-in-zimbabwe/\">A brief overview of the regulation of dogs in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "11 Jun 2025"
        },
        {
            "title": "Boy’s mutilated body found with missing parts in suspected ritual killing",
            "url": "https://www.newzimbabwe.com/boys-mutilated-body-found-with-missing-parts-in-suspected-ritual-killing/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland West have arrested a 32-year-old Chinhoyi man for allegedly killing a boy before removing some body parts suspectedly for rituals.\n\nThe mutilated body was found with the stomach ripped open and the genitals were missing.\n\nThe discovery was made on Monday, leading to the arrest of Lloyd Gwenhere of Chogi farm, Inyathi, Chinhoyi.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera confirmed the gory incident.\n\nCID Chinhoyi arrested Lloyd Gwenhere aged 32, in connection with a case of murder which occurred at Chogi Farm, Inyathi in Chinhoyi, said Kohwera.\n\nThe victim, Munyaradzi Shumba (9), was found dead with a ripped stomach. The neck and left hand were cut, while the victims private parts were missing.\n\nAccording to police, the suspect was allegedly spotted assaulting the victim for letting cattle stray onto his field.\n\nCircumstances are that on June 8, 2025, the deceased was harvesting grains with his grandfather, Isaac Shumba (70) when he was ordered to take over herding cattle from his sister, aged 10, at around 1500 hours.\n\nAt around 1600hrs, elder Shumba sent his daughter, Vongai Shumba (29), to look for Munyaradzi so that he could bring cattle to pull a cart laden with harvested grains.\n\nVongai failed to locate Munyaradzi, prompting her and her father to collect the grain up to around 1700 hours, but Munyaradzi was still nowhere to be found, leading to a search.\n\nA neighbour, Tariro Kwangwari, later told the family that she had witnessed the accused person assaulting the boy before sunset for letting cattle graze on his field.\n\nSearches were conducted by family members and other villagers around the area where the suspect had been seen assaulting the deceased, but they found only his rafters and a pool of blood, said Kohwera.\n\nA further search the next morning unearthed the grisly find of the mutilated body tucked in the grass about 15 metres from the point where the juvenile was allegedly assaulted.\n\nGwenhere was immediately arrested and is helping police with investigations.\n\nInvestigations are underway to establish the cause of the death in a case suspected to be ritual murder. The general public is urged to respect the sanctity of life, said the police spokesman.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter POLICE in Mashonaland West have arrested a 32-year-old Chinhoyi man for allegedly killing a boy before removing some body parts suspectedly for rituals. The mutilated body was found with the stomach ripped open and the genitals were missing. The discovery was made on Monday, leading to the arrest of Lloyd Gwenhere of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boys-mutilated-body-found-with-missing-parts-in-suspected-ritual-killing/\">Boy’s mutilated body found with missing parts in suspected ritual killing </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "11 Jun 2025"
        },
        {
            "title": "Ranger dies after rhino attack",
            "url": "https://www.newzimbabwe.com/ranger-dies-after-rhino-attack/",
            "content": "By Tapiwa Svondo\n\nA Save Valley Conservancy wildlife ranger, Knowledge Mudzimureka, has succumbed to the severe injuries he sustained in a rhino attack.\n\nMudzimureka died on June 8, two weeks after the attack, which happened during a routine patrol.\n\nOn 26th May 2025, Knowledge, accompanied by one other ranger, was on a routine patrol, tracking a different rhino when they unexpectedly encountered a mother black rhino and her calf. The rhino cow severely injured Knowledge, who sustained wounds to his abdomen, particularly his left lung, as well as to his head, shoulder, and knee.\n\nKnowledge was immediately evacuated on an ACE Air Ambulance and received exceptional care from the medical team at a private hospital in Harare, reads a statement by Zimparks spokesperson Tinashe Farawo.\n\nHe underwent two serious operations; on arrival to stabilise him, and a subsequent procedure to address a critical infection in his lungs.\n\nKnowledge had started to turn a corner, and the doctors were expressing optimism and positivity, his passing has shocked our entire community with grief.\n\nThe Zimparks will hold a burial service in honour of Mudzimureka.\n\nAnother Zimparks ranger was trampledto deathby an elephant in Kariba. The fatal accidentsunderscore the increasing risks faced by the frontline conservationworkers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/28022541/Black-Rhinos.png",
            "description": "<p>By Tapiwa Svondo A Save Valley Conservancy wildlife ranger, Knowledge Mudzimureka, has succumbed to the severe injuries he sustained in a rhino attack. Mudzimureka died on June 8, two weeks after the attack, which happened during a routine patrol. “On 26th May 2025, Knowledge, accompanied by one other ranger, was on a routine patrol, tracking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ranger-dies-after-rhino-attack/\">Ranger dies after rhino attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "11 Jun 2025"
        },
        {
            "title": "Serial rapist who preyed on female job seekers jailed 80 years",
            "url": "https://www.newzimbabwe.com/serial-rapist-who-preyed-on-female-job-seekers-jailed-80-years/",
            "content": "By Staff Reporter\n\nArapist who targeted female job seekers has been convicted and sentenced to 80 years imprisonment on four counts of rape.\n\nAaron Sanyamahwe (36) of Unit N, Seke, Chitungwiza appeared at Chitungwiza Regional Magistrates Court this week.\n\nIn passing sentence, the court imposed a severe penalty of 20 years per count, with the sentences to run consecutively.\n\nIt was the States case that on diverse occasions, the offender targeted vulnerable young women seeking jobs, posing as an employment agent in order to gain their trust.\n\nCourt heard that Sanyamahwe would lure his victims to secluded locations in the Dema area, where he would blindfold them before moving them to another location, strangulating and violently sexually assaulting them.\n\nIn a statement following Sanyamahwes sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) noted that the jail term sends a clear message that sexual violence will be met with the full force of the law.\n\nNPA further highlighted the devastating impact of rape on survivors while urging job seekers to be vigilant and desist from putting their trust in strangers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A rapist who targeted female job seekers has been convicted and sentenced to 80 years imprisonment on four counts of rape. Aaron Sanyamahwe (36) of Unit N, Seke, Chitungwiza appeared at Chitungwiza Regional Magistrates Court this week. In passing sentence, the court imposed a severe penalty of 20 years per count, with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/serial-rapist-who-preyed-on-female-job-seekers-jailed-80-years/\">Serial rapist who preyed on female job seekers jailed 80 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "11 Jun 2025"
        },
        {
            "title": "IMF wants Zimbabwe’s gold-backed ZiG to become sole currency",
            "url": "https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/",
            "content": "Bloomberg\n\nThe International Monetary Fund said it would like to see the ZiG fully becoming a national currency, as it weighs whether to place Zimbabwe on a staff-monitored program.\n\nThe ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. Its the countrys sixth attempt since 2009 to replace the dollar as the southern African nations main transacting currency, but is yet to succeed.\n\nSeveral measures will need to be adopted to boost ZiG usage, including deepening the foreign-exchange market to ensure full price discovery, said Wojciech Maliszewski, the Washington-based lenders mission chief, who is in Zimbabwe to review its request for a new SMP. The nations last program ended abruptly in 2019 after the central bank printed money that fueled the collapse of the local currency.\n\nRight now we see good stability in the official market and we also see a convergence between the parallel and official rate, he told reporters Monday after meeting Zimbabwean President Emmerson Mnangagwa in the capital, Harare. Ideally, we would like to see an elimination of this gap, we would like to see one exchange rate.\n\nStill, the ZiGs 43% devaluation in September to narrow the gap between the official and unofficial rate and its inconvertibility has led citizens to favor dollars.\n\nThe ZiG traded little changed on Tuesday at 26.96 against the dollar and exchanged hands at 32 to 35 on the parallel market.\n\nThe Washington-based lender said it isnt pushing for more exchange rate depreciation but for the two rates to converge supported by government fiscal discipline.\n\nThere is a good chance that these rates will converge, Maliszewski said.\n\nFinance Minister Mthuli Ncube last month at the annual meetings of the African Development Bank said he expected the SMP to be finalized by the end of June. The program would bring Zimbabwe closer toward revamping its $21 billion debt pile with creditors that want assurances that its authorities are pursuing prudent fiscal and monetary policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>Bloomberg The International Monetary Fund said it would like to see the ZiG “fully becoming a national currency,” as it weighs whether to place Zimbabwe on a staff-monitored program. The ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. It’s the country’s sixth attempt since 2009 to replace the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/\">IMF wants Zimbabwe’s gold-backed ZiG to become sole currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "11 Jun 2025"
        },
        {
            "title": "University of Zimbabwe withholds salaries of striking lecturers",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-withholdss-salaries-of-striking-lecturers/",
            "content": "By Darlington Gatsi\n\nTHE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution.\n\nThe lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwes soaring cost of living.\n\nWhile UZ has remained silent on the strike, it has retaliated by withholding salaries from the defiant lecturers, who are steadfast in their demand for a return to pre-2018 wages of US$2,250 per month for junior staff  up from the current US$230.\n\nObvious Vengeyi, spokesperson for the Association of University Teachers (AUT), condemned the move as an attempt to force an end to the strike.\n\nOf course, it is an act of trying to force our members to return to work for the US$230 they initially rejected. Its a way of arm-twisting certain members of our community to resume teaching.\n\nMany here who have not been paid have resolved that, whether they receive the US$230 or not, they will not return. The majority of us have not been paid  yes. But we remain committed. Until junior lecturers get US$2,250, we will not go back to class, said Vengeyi.\n\nThe universitys latest move follows its hiring of adjunct lecturers last month to fill gaps left by the striking staff.\n\nHowever, the AUT has dismissed this as futile, claiming most replacements lack the qualifications to teach at a university level.\n\nThere is no teaching happening at the university. No supervision is taking place. A few scabs have been hired to replace sort of  the lecturers on strike, said Vengeyi further.\n\nThe prolonged strike has disrupted examinations, with planned sittings facing further delays, potentially derailing the academic year.\n\nLast month, six students were arrested after staging flash protests demanding the lecturers return, signalling the growing unrest on campus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09165523/1000639185-scaled.jpg",
            "description": "<p>By Darlington Gatsi  THE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution. The lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwe’s soaring cost of living. While UZ has remained silent on the strike, it has retaliated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-withholdss-salaries-of-striking-lecturers/\">University of Zimbabwe withholds salaries of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "11 Jun 2025"
        }
    ]
}