{
    "news": [
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story",
            "url": "https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/",
            "content": "By Alois Vinga\n\nFinance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs.\n\nThe World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and US$12,535. In an ideal setting, this level of income would reflect improved living standards for ordinary citizens through equitable distribution of national wealth.\n\nAddressing delegates at the 2026 Pre-Budget Seminar in Bulawayo on Wednesday, Ncube painted a rosy picture of Zimbabwes economy, adding that most citizens are already spending above the daily threshold associated with middle-income economies.\n\nSo, the minimum GNI per capita should be US$4,500 per person, and this is an annual figure. That means that you ought to be able to spend on any given day no less than US$12 per person. Currently, on average, with the GNI per capita of US$3,300, that implies that we are spending US$9 per day, Ncube said.\n\nHe attributed the progress to the successful implementation of the National Development Strategy 1 (NDS1), which he said drove the economy to an average growth rate of 5.6% between 2021 and 2025, surpassing the official target of 5.2%, buoyed by increased infrastructure development. Ncube added that the economy is forecast to expand by 6.6% this year.\n\nHis statement, however, contrasts sharply with the lived reality of many Zimbabweans. The majority of the working population continues to earn less than US$250 per month, while a significant portion of the labour force operates in the informal sector, struggling to meet daily needs amid rising inflation and a weakening local currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga Finance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs. The World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/\">Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "‘One of us’: Ugandan pride in New York mayor with roots in their country",
            "url": "https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/",
            "content": "BBC\n\nMany Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality.\n\nSome have described him as one of their own, saying he inspires them.\n\nA journalist who mentored him during his teenage internship at one of Ugandas leading newspapers told the BBC that there was a lot of excitement in Uganda about Mamdanis rise especially because of his young age. Uganda has the second-lowest median age worldwide of just 16.2, according to the CIA World Factbook.\n\nZohran, 34, is the son of Prof Mahmood Mamdani, a prominent Ugandan academic, while his mother, Mira Nair, is an acclaimed filmmaker.\n\nJournalist Angelo Izama told the BBCs Newsday programme that the younger Mamdani was initially shy while they worked together, but was absolutely determined to get things done.\n\nHe says Zohran is very fond of Kampala, Ugandas capital, which he often mentions.\n\nMahmood Mamdani was raised in Uganda and worked for more than a decade at Makerere University, the countrys main and oldest university. He met his wife in Kampala while she was researching Mississippi Masala, a film about the expulsion of Asians from Uganda under Idi Amin.\n\nProf Mamdani is known for his anti-colonialist scholarship, which examines the legacy of colonialism in Africa and its impact on governance, identity and justice.\n\nMakerere University professor Okello Ogwang says he feels great about Zohrans success, describing him as the son of a colleague. This is somebody from home.\n\nWe have one of us there, he told the BBC.\n\nIt gives me hope that the children we are raising are the hope of this world. As a continent we are missing out on the greatest resource we have  the youth.\n\nWhile many Ugandans had not heard of Zohran until his election, a student at the university said people were very happy, saying it proved that anyone could rise above their background.\n\nIt gives morale, especially to us as youths, said Abno Collins Kuloba. Wherever you have grown up, be it poor or rich, you can become something big, like what [Mamdani] has done.\n\nAnother student, Chemtai Zamzam, said she was happy, for herself and Ugandans. She said Mamdani was an inspiration to her as a young person, as it shows we can become anything we want as long as we put faith and determination.\n\nThe new mayor is also being celebrated elsewhere in the continent.\n\nAbdul Mohamed, an Ethiopian who is a former senior UN and African Union official, describes Mahmood Mamdani as a distinguished scholar of African politics, a man who interrogated power and justice.\n\nHe says having known Zohran since infancy, he sees him as having inherited his fathers commitment to pan-Africanism, his parents courage to think freely, and their belief that one can belong everywhere.\n\nHe says Zohrans rise is symbolic and practical especially to young Africans, asking them to draw from him lessons in politics.\n\nI think through him, [the] power and beauty of multi-ethnic, multi-religious identity found its voice. And Africa is by and large a multi-ethnic and a multi-religious society, he says.\n\nHe adds that as Zohran has demonstrated, young people need to organise and build political action and avoid despair and avoid pure anger.\n\nUganda is holding elections next year, with 81-year-old President Yoweri Museveni seeking another term after almost 40 years in power.\n\nThe Mamdani family also spent at around three years in Cape Town, South Africa, after Mahmood was appointed the Chair of African Studies at the University of Cape Town in the 1990s.\n\nSome South Africans have also been taking pride in his historic election.\n\nHailing his victory as as a remarkable achievement, the imam of Cape Towns Claremont Road Mosque, Rashied Omar, said that Zohrans formative years were shaped, in small part, in our congregation.\n\nHe said that Zohran began his Islamic education at the mosque, and started his schooling at St Georges Grammar.\n\nIt is inspiring to see how Zohrans early South African experiences, though modest, made a lasting impression on his political consciousness and helped shape his creative, community-based approach to politics, Dr Omar said.\n\nAs South African social justice activists, we can now learn from Zohrans example, how to practise progressive politics that resonates with new generations and builds bridges across race, class, and faith, he added.\n\nThe Economic Freedom Fighters (EFF), the fourth-biggest party in South Africa which champions left-wing economic policies, also hailed Zohrans victory as historic.\n\nHis election represents not only a transformative moment for the people of New York but also a powerful signal to the world that progressive justice-driven leadership is rising even in the heart of the global capitalist order, the party said in a statement.\n\nIn Nigeria, a Christian pastor who is a supporter of President Bola Tinubu also welcomed Zohrans victory.\n\nPastor Okezie J Atai said on X that Nigeria cannot be threatenedby US President Donald Trump, whose threats could not subdue the 34-year-old Zohran.\n\nLast week,Trump threatened to take military action to tackle Islamist insurgents in Nigeria, accusing the government of failing to protect Christians.\n\nGovernment officials responded by saying that jihadists were not targeting members of a particular religion and that they had killed people from all faiths, or none.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05180408/mamdani.webp",
            "description": "<p>BBC Many Ugandans are expressing their pride in the newly elected mayor of New York, Zohran Mamdani, who was born in Uganda and retains dual nationality. Some have described him as one of “their own”, saying he inspires them. A journalist who mentored him during his teenage internship at one of Uganda’s leading newspapers told</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-of-us-ugandan-pride-in-new-york-mayor-with-roots-in-their-country/\">‘One of us’: Ugandan pride in New York mayor with roots in their country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        },
        {
            "title": "Govt apologises to travel vlogger denied access to Mbuya Nehanda statue",
            "url": "https://www.newzimbabwe.com/govt-apologises-to-travel-vlogger-denied-access-to-mbuya-nehanda-statue/",
            "content": "By Staff Reporter\n\nThe Ministry of Tourism and Hospitality Industry has apologised to travel vlogger Davud Akhundzada, who posted a viral video complaining he had been denied access to the Mbuya Nehanda statue.\n\nThe statue, a bronze monument honouring the legendary Shona spirit medium and heroine of the 18961897 First Chimurenga war against British colonisers, stands at the intersection of Samora Machel Avenue and Julius Nyerere Way in Harares central business district.\n\nAkhundzada alleged that he was prevented from accessing the monument,a move that has drawn widespread attention online. In response, the Tourism Ministry issued a statement defending existing access restrictions at the heritage site.\n\nThe Ministry of Tourism and Hospitality Industry has noted with concern a circulating video involving travel vlogger Davud Akhundzada, who was reportedly restricted from accessing the Mbuya Nehanda Statue site in Harare, the ministry said in a statement on Wednesday.\n\nWe wish to clarify that the Mbuya Nehanda Statue is a National Heritage Monument managed by the Ministry of Home Affairs and Cultural Heritage. It stands as a proud symbol of Zimbabwes liberation history and identity.\n\nThe site is subject to specific preservation and security protocols and, as such, public access to certain areas,including elevated or restricted zones,may be limited for safety, preservation, and security reasons.\n\nHowever, as the Ministry of Tourism and Hospitality Industry, we are taking proactive steps to enhance tourist management at such sites.\n\nThrough a Whole-of-Government Approach Strategy in coordination with our counterparts at the Ministry of Home Affairs and Cultural Heritage, we are in the process of deploying tourism officers at key heritage and cultural monuments. These officers will facilitate seamless, well-informed, and welcoming access for tourists, ensuring a positive experience while safeguarding our national heritage.\n\nThe ministry, led by Minister Barbra Rwodzi, apologised to Akhundzada for the inconvenience caused and reaffirmed its commitment to ensuring that all tourists visiting Zimbabwes heritage sites enjoy safe, accessible, and memorable experiences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05175521/davud.jpg",
            "description": "<p>By Staff Reporter The Ministry of Tourism and Hospitality Industry has apologised to travel vlogger Davud Akhundzada, who posted a viral video complaining he had been denied access to the Mbuya Nehanda statue. The statue, a bronze monument honouring the legendary Shona spirit medium and heroine of the 1896–1897 First Chimurenga war against British colonisers,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-apologises-to-travel-vlogger-denied-access-to-mbuya-nehanda-statue/\">Govt apologises to travel vlogger denied access to Mbuya Nehanda statue</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "06 Nov 2025"
        }
    ]
}