{
    "news": [
        {
            "title": "Shunned by the West, Zimbabwe’s UAE gamble hands economy a lifeline",
            "url": "https://www.newzimbabwe.com/shunned-by-the-west-zimbabwes-uae-gamble-hands-economy-a-lifeline/",
            "content": "Bloomberg\n\nZimbabwean President Emmerson Mnangagwas six years of wooing the United Arab Emirates has given a lifeline to a nation that the West has ostracised for a quarter century and is unable to repay its loans to China.\n\nThe wealthy Gulf state has overtaken China to become the resource-rich nations biggest export partner and since 2022 has plowed $1.4 billion into everything from gold trading to real estate. The steps are part of a wider effort by the UAE to build influence across Africa thats seen it become the country that routinely pledges the most foreign direct investment into the continent.\n\nThe UAE has gone within a few years from being unknown in commerce to becoming the nations foremost trading partner, Eldred Masunungure, a political science professor at the University of Zimbabwe, said.\n\nIn Mount Hampden, 11 miles northeast of Harare, Shaji Ul Mulk, a Dubai-based businessman who owns Mulk International, is developing a flagship cyber city for the rich to replace the capital, which is in ruin. The Dubai Gold & Commodities Exchange has a pact to establish a gold market and miner Bluefin Gold Group plans to set up in the country.\n\nThe oil-rich Gulf state is also consistently among the southern African nations top five foreign direct investment sources, according to the Zimbabwe Investment and Development Agency. And it doesnt plan to let up.\n\nThe UAE wants to maintain and expand its relationships with Zimbabwe in line with its broader foreign policy objectives, a UAE official who asked not to be identified said.\n\nStill, caution may be warranted because of the state of Zimbabwes economy. The southern African nations debt pile has ballooned to $21 billion since a default in 1999. Its sixth attempt at a viable local currency in 16 years is foundering less than nine months after debut. The economy is largely informal, high inflation, the economys Achilles heel, persists, making it difficult for big businesses to flourish.\n\nGulf states are increasingly using their petrodollars to build influence in Africa, as China pares back loans to the continent, Europe scales back its presence and the US becomes more domestically focused.\n\nThe UAE has invested $110 billion in Africa spread across trade, investment, renewable energy, logistics, food security and infrastructure, according to its government.\n\nIts strategic investments are made with the prospect of earning outsized returns, said Jim Krane, a fellow at Rice Universitys Baker Institute for Public Policy in Houston. The investing firms, which are mostly state-linked, target countries where they can advance the strategic interests of the UAE and are willing to overlook some of the risks that have otherwise prevented firms from entering these frontier markets, he added.\n\nThere are diplomatic motivations that go beyond profitability, but profits are still expected, said Krane.\n\nLast year, the Abu Dhabi wealth fund ADQ agreed to invest $35 billion in Egypt, most of it to develop prime land on the North African nations Mediterranean coast.That rescued the economy from its worst foreign-exchange crisis in decades.\n\nThe UAEs decision to invest in Zimbabwe came after Mnangagwa visited the country in 2019 as part of a roadshow to attract investment into an economy that was in freefall and locked out of capital markets because of sanctions, the debt default and decades of misrule by Robert Mugabe.\n\nThe UAE was mainly attracted to Zimbabwes gold which has become a bright spot for the economy, Lyle Begbie, an economist at Oxford Economics said. Last year output rose to a record 36 tons.\n\nTies to the UAE provided Zimbabwe with options for survival, senior officials in Mnangagwas administration said in 2019  and still do, said Hasnain Malik, an emerging market strategist at Tellimer in Dubai.\n\nUAE investment inflows are nowhere near large enough, on their own, to build up the foreign reserves needed to support a stable currency, he said. The economic solution for Zimbabwe requires addressing sovereign debt arrears, committing to a credible fiscal path, unlocking multilateral finance and foreign direct investment, and, ultimately, allowing a freer float of the currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>Bloomberg Zimbabwean President Emmerson Mnangagwa’s six years of wooing the United Arab Emirates has given a lifeline to a nation that the West has ostracised for a quarter century and is unable to repay its loans to China. The wealthy Gulf state has overtaken China to become the resource-rich nation’s biggest export partner and since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shunned-by-the-west-zimbabwes-uae-gamble-hands-economy-a-lifeline/\">Shunned by the West, Zimbabwe’s UAE gamble hands economy a lifeline</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Mnangagwa welcomes Trump’s decision to deport Zimbabweans illegally staying in America",
            "url": "https://www.newzimbabwe.com/mnangagwa-welcomes-trumps-decision-to-deport-zimbabweans-illegally-staying-in-america/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has welcomed his American counterpart Donald Trumps decision to deport illegal immigrants including some 545 Zimbabweans set to be shipped back.\n\nThe 545 Zimbabweans are part of a November 2024 list that has 1,445,549 noncitizens expected to be deported from America in the coming months.\n\nThey are on Americas Immigration and Customs Enforcements (ICE) list of noncitizens who were delegated for removal last November.\n\nThe government of Zimbabwe supports the United States governments decision to repatriate and return our Zimbabwean citizens who may have been residing in the US illegally, said Mnangagwa.\n\nRELATED:545 Zimbabweans set to be deported as Trump administration cranks up fight on illegal immigrants\n\nMillions of Zimbabweans have fled the country for Western nations, legally and illegally, over the past three decades because of the countrys worsening economy which has meant fewer jobs, poor remuneration and inhospitable working conditions.\n\nMillions are reported to be residing and working in South Africa illegally, while tens of thousands have opted for menial work in Australia, Dubai, Canada and on cruise ships.\n\nTrump, who was recently reelected as Americas President, is proceeding with his America First policy that has seen a raft of changes to the superpowers foreign policy, humanitarian funding and international financial support across the globe.\n\nHis administration has initiated raids in areas known to be populated by illegal immigrants, with reports indicating that over 500 are being nabbed daily.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has welcomed his American counterpart Donald Trump’s decision to deport illegal immigrants including some 545 Zimbabweans set to be shipped back. The 545 Zimbabweans are part of a November 2024 list that has 1,445,549 noncitizens expected to be deported from America in the coming months. They are on America’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-welcomes-trumps-decision-to-deport-zimbabweans-illegally-staying-in-america/\">Mnangagwa welcomes Trump’s decision to deport Zimbabweans illegally staying in America</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "“I want to achieve great things at Huddersfield Town” – Zimbabwe international Tawanda Chirewa",
            "url": "https://www.newzimbabwe.com/zimbabwes-tawanda-chirewa-i-want-to-achieve-great-things-at-huddersfield-town/",
            "content": "Pan Africa Football\n\nZimbabwe international Tawanda Chirema has talked for the first time since sealing a deadline day transfer move to Huddersfield Town from Premier League side Wolverhampton Wanderers until the end of the 2024/25 season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/04055610/chirewa.jpeg",
            "description": "<p>Pan Africa Football Zimbabwe international Tawanda Chirema has talked for the first time since sealing a deadline day transfer move to Huddersfield Town from Premier League side Wolverhampton Wanderers until the end of the 2024/25 season. The 21-year-old Chirewa spent the first half of the 2024/25 season on loan with Sky Bet Championship side Derby</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-tawanda-chirewa-i-want-to-achieve-great-things-at-huddersfield-town/\">“I want to achieve great things at Huddersfield Town” – Zimbabwe international Tawanda Chirewa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Matthew Parris: Why I decided to go it alone in Zimbabwe",
            "url": "https://www.newzimbabwe.com/matthew-parris-why-i-decided-to-go-it-alone-in-zimbabwe/",
            "content": "Matthew Parris | The Times\n\nDont hesitate. Dont look down. Just do it. And it was my turn.\n\nFrom the cliffs edge I stared across to the other side of the ravine, a wall of sharp rocks half hidden in racing clouds of mist. Beneath me  2,500 feet down  came the sound of a river crashing through the thick African forest that packed the ravines floor. To one side was a leg-wobbling view of the Mutarazi waterfall, Africas second highest, teeming down into the Mutarazi River. To the other lay the great valley into which the river flowed. Above, the blue of the wide Zimbabwe sky.\n\nAnd in front of me? A 1,200-yard steel cable, spanning the chasm. Zip wire doesnt do it justice. This was the Skyline,the highest anywhere on the planet, and I, crash-helmeted and harnessed beneath it, was readying myself to fly. Then, to the metallic scream of the pulley above my head, I was for 40 seconds reincarnated as an eagle.\n\nThere was no danger. Far and Wide, the intrepid Zimbabwean company that set up the Skyline, takes its zip technology seriously and there has never been an accident, I was assured by the reassuringly named and very capable experts, Justice and Wisdom, who checked my harness straps and launched me into thin air.\n\nAfter hitting a peak of 25mph or so, I slowed as the cliff on the far side neared before automatic brakes landed me on my feet, my heart and head buzzing from the ride. Already that morning I had crossed the SkyWalk  two thin bridges strung over the gorge on cables  which was just as spectacular but a little more sedate than the zip line (89 for both; farandwide.co.zw). This, it seemed, was going to be an African adventure rather different to the usual sun-baked safari searching for lions, hippos and elephants.\n\nJust hire a car, get a map and go. This country and its range of super places to stay is open for business. We were five, four friends and I, following our own itinerary and paying our own way, and wed reached the Nyanga mountains in the Eastern Highlands. Cool, green and damp, and rising to the countrys highest peak, the 8,500ft Mount Nyangani (we climbed it with a cheerful National Park guide, a steep but lovely mornings walk), the Eastern Highlands are one of Zimbabweans favourite places places for rest and recreation.\n\nThere are acres of conifer plantations and for a moment you can fool yourself youre in Scotland  until the sun bursts out and a little blue duiker buck darts though the forest, or monkeys chatter from the trees, or the view opens up of distant mountains forming the border with Mozambique and the Indian Ocean beyond.\n\nThis is a land I love  I spent my boyhood and teenage years in what is now Zimbabwe and came on holiday then to Nyanga, when the roads were even rougher, the hotels more basic and no one had dreamt of stringing a zip line across the cliffs. These days you can stay in the SkyDeck Mountain Retreat, the glamorous ultra-modern lodge also run by Far and Wide, where Jeremy Clarkson last year began his epic-comic final grand tour in Zimbabwe (not cheap: all-inclusive doubles are from 1,948 a night; skydeckretreat.com).\n\nWe chose something cheaper and a little more traditional, renting two of its sweet stone cottages on the edge of the native forest, cooking and eating our own meals in front of blazing log fires, our evenings lit by oil lamps. Theres mains power too  at least some of the time, since the national supply is erratic  but nothing beats a whisky by oil lamp as the rapid dark of an African evening falls (a nights self-catering for two from 106; wildnyanga.com).\n\nMention Zimbabwe in Britain and you usually get two reactions. People worry about the politics and safety  more on that in a moment  and they assume tourism is limited to the Victoria Falls and safaris in the many magnificent national parks.\n\nThe falls, massive, roaring walls of water, are extraordinary. So many wonders of the world disappoint. These dont. And Zims national parks are among Africas treasures. Welcoming, scholarly guides share knowledge from their years of training (standards of English are generally high) and there are luxurious lodges if you can afford them, and well-run, affordable campsites and chalets if simplicity attracts instead.\n\nBut theres so much more to Zimbabwe and on this visit I wanted to remind myself how much. So we started in Harare, the capital city I remember as Salisbury when I spent my boyhood there. Many tourists fly direct to Victoria Falls but that is to miss so much.\n\nHarare is gentler and quieter than Africas more manic big capitals. The traffic lights dont always work but then there isnt much traffic. Years of economic difficulty have had an impact  in places the city can look a touch knocked-about  but the jacaranda trees still carry their heavy blue blossom along avenues each spring, the hotels and restaurants are good, the shops are well-stocked and if there are potholes in the roads, well, arent we used to that in Britain anyway? Harare is a fine introduction to the country.\n\nWhere to stay? I love the long-standing Bront Garden Hotel, set around a courtyard of lush gardens (doubles from 110; brontehotel.com), but this time we began at Amanzi Lodge, which sits in the wealthy, leafy northern suburbs. To call its thatched free-standing rooms cabins would be to underplay: our suite was furnished with antiques and had a vast bath and a private terrace with a hammock. Sadly I only found out when we left that everything in the minibar was included in the price (doubles from 227; amanzi.co.zw).\n\nAmanzis gardens, complete with tiny African squirrels and vervet monkeys, are a botanical reserve all of their own and the restaurant one of the best in the capital, chosen by the president, Emmerson Mnangagwa, when, after replacing Robert Mugabe, he lunched with a western journalist to explain how he wanted to change the country for the better.\n\nHas he? Well, I tend to steer clear of politics when abroad. All I can say is that every Zimbabwean we met, black and white, was pleased to see tourists. End of the day its simple: people visiting keeps the animals alive! one local friend told me. As for safety, its always sensible to watch your possessions in towns but for the most part the country is gentle, friendly and relaxed. Security is light years ahead of Johannesburg, Cape Town or Nairobi. And if you stick to the higher central areas the malaria risk is minimal too. These are high plains and mountains: the skies are blue but the temperatures moderate, even chilly on winter mornings.\n\nDriving (on the left) is fine. We hired a 44 from Impala Car Rental, a helpful local company, though the big global brands are available too (impala.co.zw). Go carefully, smile at police roadblocks  they mostly wave you through  and use Google Maps to navigate. Buy an e-sim at the airport to save hideous mobile roaming and keep a fistful of US dollars to pay road tolls. We stocked up with food and wine. A supermarket in the northern suburbs was packed with everything you could need. Add a cold box and a string of boerewors (the ubiquitous and tasty southern African sausage) and you are all set for a braai, or barbecue.\n\nFrom the Eastern Highlands we cut across the country by road, on tarmac and then, by choice, dirt tracks past villages of round thatched huts. Children waved, goats darted out and the sun shone on the great hills of weather-rounded granite, which are the emblematic landscape of Zimbabwe.\n\nWe were in the country over new year, in the warm summer, as clouds gathered, lightning flashed and sudden heavy rainstorms broke 18 months of cruel drought. I hope it rains all through your holiday! one farmer told us but it didnt. Its not the time most tourists go but we loved it.\n\nWe spent a night on the way at Imire Lodge, which has done precious work protecting and breeding the rhinos we met (162pp; imire.co.zw). Not far from the comfortable rooms I reacquainted myself with an elephant that has, since birth, identified as a buffalo and seems happy in her buffalo herd. I tried feeding her. Do remember: the trunk is an elongated nose, not a mouth.\n\nA day later and we were racing down the main route into Zimbabwes charming second city, Bulawayo, its colonial-era buildings lining streets wide enough (they say) to turn an ox cart around in. Our destination was a place Ive long admired: the Bulawayo Club, still an elegant, antique city institution with dark panelling, portraits of long-gone settlers and farmers, and a billiard room where three Edwardian tables wait for players. You neednt be a member to stay, its great value and the huge bar still has a pith helmet hanging in one corner. I like the place so much Ive applied to join (doubles from 95; booking.com).\n\nThere was just time for one last trip into the wilderness. An hour out of Bulawayo, the Matobo National Park is a tumble of rocky valleys and boulder-strewn peaks, wrapped in deep bush. One well-guarded section is alive with game but I wanted to walk so we scrambled up signed paths to caves with some of the most evocative rock art in Africa. People danced among animals in pictures perhaps twice as old as Stonehenge. I looked out across the mountains, where afternoon rain clouds were boiling up above the plains, and looked forward to dinner at the spectacularly sited Big Cave Lodge (doubles from 268; bigcavematopos.com)  but most of all I looked ahead, making plans already to return to Zim.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05151040/PARRIS.jpg",
            "description": "<p>Matthew Parris | The Times Don’t hesitate. Don’t look down. Just do it. And it was my turn. From the cliff’s edge I stared across to the other side of the ravine, a wall of sharp rocks half hidden in racing clouds of mist. Beneath me — 2,500 feet down — came the sound of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/matthew-parris-why-i-decided-to-go-it-alone-in-zimbabwe/\">Matthew Parris: Why I decided to go it alone in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Hilmax Engineering directors who defrauded ZIMRA of R10m out on bail",
            "url": "https://www.newzimbabwe.com/hilmax-engineering-directors-who-defrauded-zimra-of-r10m-out-on-bail/",
            "content": "By Staff Reporter\n\nHilmax Engineering directors who were arrested on allegations of defrauding the Zimbabwe Revenue Authority (ZIMRA) of ZAR 10.7 million in a foreign scheme appeared in court Wednesday charged with fraud.\n\nThe two are the operations director, Rugare Murwira (59) and Patrick Musavaya (57) the finance director.\n\nThey are facing seven counts of fraud and violating the Exchange Control Act.\n\nThe two were not asked to plead when they appeared before Magistrate Tilda Mazhande and will be back in court in two weeks for their routine remand.\n\nThe two were arrested for allegedly orchestrating a multi-million-rand fraud scheme through forged import documents, prejudicing the Zimbabwe Revenue Authority (ZIMRA) of ZAR 10 755 880.00.\n\nIt is the States case that they allegedly submitted falsified Bills of Entry to Stanbic Bank to acquire foreign currency for purported imports from South African firms, which never materialised. \n\nThe court heard between January 2021 and March 2022, Hilmax Engineering (Pvt) Ltd applied for over ZAR 10.7 million through the Stanbic Bank, claiming to import goods.\n\nThey allegedly used or backdated Bills of Entry assigned to other companies, to justify payments.\n\nAn investigation into the foreign currency acquittals revealed that no goods were imported and the two directors allegedly fabricated release orders to conceal the scheme.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter Hilmax Engineering directors who were arrested on allegations of defrauding the Zimbabwe Revenue Authority (ZIMRA) of ZAR 10.7 million in a foreign scheme appeared in court Wednesday charged with fraud. The two are the operations director, Rugare Murwira (59) and Patrick Musavaya (57) the finance director. They are facing seven counts of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hilmax-engineering-directors-who-defrauded-zimra-of-r10m-out-on-bail/\">Hilmax Engineering directors who defrauded ZIMRA of R10m out on bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Will SA become the next Zimbabwe with Expropriation Act? No!",
            "url": "https://www.newzimbabwe.com/will-sa-become-the-next-zimbabwe-with-expropriation-act-no/",
            "content": "IOL\n\nThe signing of the Expropriation Act into law has been one of the most topical subjects of 2025 so far,with the recently elected US President Donald Trump taking aim at the lawon Monday, sending the rand into a tailspin.\n\nThe main question many South Africans are asking is how the law will impact residential property owners, buyers, sellers, and investors.\n\nSamuel Seeff, Chairman of the Seeff Property Group said that there is no need to panic.\n\nThe new Act is very specific in terms of the conditions for expropriation. which include\n\nImportantly, the protection of the property clause under Section 25 of the Constitution remains in place, Seeff has explained.\n\nHe said the Act, which replaces the outdatedExpropriation Act of 1975, was largely expected by the property industry, and he hasemphasised that the law has been sensationalised, and conflated beyond the actual implications of the Act, and noted that arbitrary property deprivation is specifically prohibited.\n\nWhile the Act provides for expropriation at nil-compensation, there are checks and balances contained in the Act. This includes that it must be in the public interest, and follow extensive consultation and negotiation with the courts having the final say if no agreement is reached, he added.\n\nRamaphosa and the Government of National Unity (GNU) have also been firm in their commitment thatno land grabs of whatsoever form will be tolerated.\n\nSeeff said that the aim is for expropriation to be lawful, and done with careful consideration to promote economic growth, development, and investor confidence.\n\nWith regard to,residential property, and having regard to the Zimbabwe experience, Seeff noted that it never involved residential homes.\n\nCompensation has also since been paid for the expropriated farms. There are also additional implications when it comes to residences such as the banks and mortgage loans over properties, he added.\n\nIt therefore remainsbusiness as usual for the property marketwith the legal protections of private property in place, he said.\n\nMeanwhile, speaking at the Mining Indaba in Cape Town on Monday, Public Works and InfrastructureMinister Dean Macphersonhas promised investors that there will be no land grabbing orland confiscation in South Africa.\n\nMeanwhile, South Africas property market has started this year on a better footing compared to last January followingthree successive interest rate cutswhich have hugely boosted affordability and confidence in the property market, he said.\n\nIt is a new year, and many young professionals will be looking to get their foot on the property ladder. There is excellent value for buyers in the inland provinces, including Gauteng which usually sees the highest influx of first-time buyers in the country, Seeff said.\n\nHe advised that while the traditionally strong areas such as the Western Cape and coastal hotspots are expected to enjoy a good year, Gauteng and inland markets will gain good momentum in 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05141514/Explore-the-implications-of-the-Expropriation-Act-for-South-African-property-owners-and-investors-as-industry-experts-weigh-in-on-its-potential-impact.webp",
            "description": "<p>IOL The signing of the Expropriation Act into law has been one of the most topical subjects of 2025 so far, with the recently elected US President Donald Trump taking aim at the law on Monday, sending the rand into a tailspin. The main question many South Africans are asking is how the law will impact</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/will-sa-become-the-next-zimbabwe-with-expropriation-act-no/\">Will SA become the next Zimbabwe with Expropriation Act? No!</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Mayor Mafume’s luxurious home funded by shady deals, disregard of council regulations – Harare Commission of Inquiry says",
            "url": "https://www.newzimbabwe.com/mayor-mafumes-luxurious-home-funded-by-shady-deals-disregard-of-council-regulations-harare-commission-of-inquiry-says/",
            "content": "By Darlington Gatsi and Tapiwa Svondo\n\nA Commission of Inquiry, investigating the operations of Harare City Council, has said that Mayor Jacob Mafume may have engaged in underhanded activities to acquire his luxurious property in Belvedere, Harare.\n\nMafume has found himself at the centre of controversy as the Commission of Inquiry continues to unearth irregularities within the City Council.\n\nThe Mayor is under scrutiny after it emerged that his Belvedere residence, currently undergoingrenovations, may have been funded through kickbacks from a company that had illegal dealings with the City Council.\n\nThe property in Belvedere is being renovated and when NewZimbabwe.com visited the area constructors could be seen on the site.\n\nAccording to Mafume, the renovations have forced him to temporarily reside in Greendale and the Belvedere house to be turned into a student residence once complete.\n\nHarare Commission of Inquiry evidence leader Tapiwa Godzi avered that Mafume is not following Council laws and procedures in the renovations of the house.\n\nWe want you to bring an approved plan for that project because that project was not approved by Council. You did not make any application to undertake that project, said Godzi.\n\nAccording to the City council regulations, individuals must pay application fees for the approval of plans, and development fees, and obtain approved plans to undertake any project.\n\nMafume has denied the allegations insisting the project is legitimate and that there is a paper trail to prove that he did not use his position as Mayor to bypass procedures.\n\nTo my knowledge, everything is above board. I have a contractor that I have used. We have made the applications. I had advised her (wife) to follow all the procedures that are required together with the contractor and I remember her telling me that building inspectors have come, said Mafume.\n\nHCC officials have been accused of using their positions at Town House to further their interest with some using it as a feeding trough at the expense of the ratepayers.\n\nMafume is no exception having previously been implicated in corrupt activities.\n\nGodzi further claimed that Mafume pocketed US$ 200,000 from Quill Associates, a company that was supposed to implement Enterprise Resource Planning (ERP). The funds were allegedly used to purchase the Belvedere property.\n\nHe is also accused of insisting that the Council uses the company despite other cheaper options available.\n\nQuill Associates was summarily dismissed in 2019 by management. I disagreed with management when they dismissed Quill Associates summarily and they said we would get a new ERP. It was dismissed because it had charged us US$75,000.\n\nThat (US$200,000 bribe) is a lie. I deny it, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05173756/mafume-and-home.png",
            "description": "<p>By Darlington Gatsi and Tapiwa Svondo A Commission of Inquiry, investigating the operations of Harare City Council, has said that Mayor Jacob Mafume may have engaged in underhanded activities to acquire his luxurious property in Belvedere, Harare. Mafume has found himself at the centre of controversy as the Commission of Inquiry continues to unearth irregularities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mayor-mafumes-luxurious-home-funded-by-shady-deals-disregard-of-council-regulations-harare-commission-of-inquiry-says/\">Mayor Mafume’s luxurious home funded by shady deals, disregard of council regulations – Harare Commission of Inquiry says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "US reviewing its funding in Zimbabwe in line with Trump’s America First policy",
            "url": "https://www.newzimbabwe.com/us-reviewing-its-funding-in-zimbabwe-in-line-with-trumps-america-first-policy/",
            "content": "By Leopold Munhende\n\nThe US Embassy has announced that it is currently reviewing all funds released to Zimbabwe through its State Department and USAID, as new President Donald Trumps America First policy takes effect.\n\nOn inauguration, Trump announced a raft of changes to Americas funding model that emphasised reasonable use of taxpayers money and focus on developing the superpower first.\n\nThe policy paused millions of US dollars in funding for local civil society organisations (CSOs) and billions across the world.\n\nWith America being a major funder of development in Zimbabwes health and education sectors, fears abound they would crumble.\n\nA waiver was later announced on health-related funding as most of Africas poorly resourced health systems threatened to crumble.\n\nIn a statement released Wednesday, the US Embassy revealed that funding will now be reviewed in line with its foreign policy.\n\nThe review of all foreign assistance programs will ensure they are efficient and consistent with U.S. foreign policy under the America First agenda, reads the statement.\n\nRELATED:\n\nThe US Embassy in Zimbabwe has paused its foreign assistance and is reviewing its programs to bring them in line with this Executive Order and the waiver.\n\nThe United States is proud of the gains we have helped Zimbabwe make in health, food security, and development.\n\nToday, 1.2 million Zimbabweans live longer, healthier lives because of PEPFARs support for HIS services.\n\nOver 1600 public hospitals and clinics have benefited from training and technical support from the United States.\n\nAmerica funds most of Zimbabwes fight against sexually transmitted diseases and HIV, with PEPFAR financing most condoms and antiretroviral drugs (ARVs) distributed by local hospitals.\n\nOver half a million people affected by the recent El Nino induced drought have also benefited from its funding.\n\nAdded the statement: More than 500,000 Zimbabweans have benefited from U.S. humanitarian assistance during the El Nino-induced drought.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15215508/Tremont-Photo-scaled.jpg",
            "description": "<p>By Leopold Munhende The US Embassy has announced that it is currently reviewing all funds released to Zimbabwe through its State Department and USAID, as new President Donald Trump’s America First policy takes effect. On inauguration, Trump announced a raft of changes to America’s funding model that emphasised “reasonable use of taxpayer’s money” and focus</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-reviewing-its-funding-in-zimbabwe-in-line-with-trumps-america-first-policy/\">US reviewing its funding in Zimbabwe in line with Trump’s America First policy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Kendrick Lamar’s Super Bowl Halftime Show: Will he include ‘Not Like Us’?",
            "url": "https://www.newzimbabwe.com/kendrick-lamars-super-bowl-halftime-show-will-he-include-not-like-us/",
            "content": "IOL\n\nMulti-award-winning rapper Kendrick Lamarwill perform at the Apple Music Super Bowl LIX Halftime Show this Sunday. All eyes will be on Lamar at the New Orleans Caesars Superdome for his performance, which is expected to be mindblowing.\n\nRihanna, Usher, and Beyonce have previously performed at the Super Bowl. In past performances, it is a medley of their top charting songs throughout their careers that make up the 12-13 minute performance.\n\nWith a discography featuring top-charting bangers that have made him a global superstar, curiosity is piqued about whether his set list will include hisGrammy-award-winning song Not Like Us.\n\nWith an ongoing defamation case, it does raise the question of whether Lamar will leave Not Like Us out of his performance.\n\nThe song, a Drake diss track, made history by winning Record of the Year, Best Music Video, Best Rap Song, and Best Rap Performance at the 67th Annual Grammy Awards, held on February 2.\n\nNot Like Us despite its huge success with 1 975 828 412 streams on Spotify and 220,872,679 views on YouTube, makes pedophile claims towards Drake and his team.\n\nSay, Drake, I hear you like em young / You better not ever go to cell block one / To any b***h that talk to him and they in love / Just make sure you hide your lil sister from him.\n\nThey tell me Chubbs the only one that gets your hand-me-downs / And party at the party, playin with his nose now / And Baka got a weird case, why is he around? / Certified Lover Boy? Certified pedophiles.\n\nIn January,Drake filed a lawsuit against Universal Music Group(UMG), accusing the label of defamation and harassment over Lamars incendiary diss track, Not Like Us, which dropped last year.\n\nIn legal papers filed in New York, Drakes lawyers stated that UMG orchestrated a campaign to create a viral hit with Not Like Us, exploiting the controversy to boost streams at Drakes expense.\n\nUMG fired back, calling the claims offensive and untrue. It argued that the idea of them undermining one of their biggest stars is illogical, and accused Drake of trying to stifle Lamars creative freedom through legal means.\n\nFans will only know on Sunday, if Not Like Us will have made the cut or not, but what is known is that SZA will be joining Lamar for the Halftime show.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05151605/Kendrick-Lamar-is-set-to-perform-at-the-Super-Bowl-Halftime-Show-at-the-New-Orleans-Caesars-Superdome-on-February-9-Picture-Instagram-kendricklamar.webp",
            "description": "<p>IOL Multi-award-winning rapper Kendrick Lamar will perform at the Apple Music Super Bowl LIX Halftime Show this Sunday. All eyes will be on Lamar at the New Orleans Caesars Superdome for his performance, which is expected to be mindblowing. Rihanna, Usher, and Beyonce have previously performed at the Super Bowl. In past performances, it is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kendrick-lamars-super-bowl-halftime-show-will-he-include-not-like-us/\">Kendrick Lamar’s Super Bowl Halftime Show: Will he include ‘Not Like Us’?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        },
        {
            "title": "Mambos wades into Zanu PF factional wars",
            "url": "https://www.newzimbabwe.com/mambos-wades-into-zanu-pf-factional-wars/",
            "content": "By Staff Reporter\n\nMAMBOS Chicken, one of Zimbabwes fast food outlets has waded into Zanu PF factional wars in its latest satirical post.\n\nIt is known for its catchy and controversial graphic advertisements inspired by daily life.\n\nGeza mawoko tidye, reads one of its latest posts.\n\nThe post is in reference to Blessed Geza, a Zanu PF central committee member calling for President Emmerson Mnangagwas immediate resignation.\n\nGeza, has been fronting one faction within Zanu PF that is against Mnangagwas bid to extend his second term to 2030.\n\nHe argues the ruling party supremo has failed, blames him for tolerating corruption the same way late President Robert Mugabe did and accuses him of nepotism.\n\nMambos makuda kutushurana nema Zanu PF. Remember vakatogumbuka ka avo, said Tembani Mudavanhu on Mambos post.\n\nZimbabwe, Zanu PF and indeed Mambos focus is now on whether Zimbabweans will allow the Mnangagwa faction to force its way to 2030.\n\nAlready his cronies have misrepresented that this could be done without going for a referendum while Geza is now being targeted for arrest and expulsion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05142250/WhatsApp-Image-2025-02-05-at-06.07.58-e1738765409481.jpeg",
            "description": "<p>By Staff Reporter MAMBO’S Chicken, one of Zimbabwe’s fast food outlets has waded into Zanu PF factional wars in its latest satirical post. It is known for its catchy and controversial graphic advertisements inspired by daily life. “Geza mawoko tidye,” reads one of its latest posts. The post is in reference to Blessed Geza, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mambos-wades-into-zanu-pf-factional-wars/\">Mambos wades into Zanu PF factional wars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "06 Feb 2025"
        }
    ]
}