{
    "news": [
        {
            "title": "Ukrainian political analyst suggests Zimbabwe, South Africa play mediatory role to end war with Russia",
            "url": "https://www.newzimbabwe.com/ukrainian-political-analyst-suggests-zimbabwe-south-africa-play-mediatory-role-to-end-war-with-russia/",
            "content": "By Leopold Munhende\n\nUKRAINIAN political analyst and journalist Peter Zalmayev has suggested that Zimbabwe and neighbouring South Africa present themselves as mediators to end the war between his country and superpower Russia.\n\nZalmayev, who is on a global tour to highlight implications of the war on Ukraine and other smaller countries, was recently in Zimbabwe, having already visited South Africa, eSwatini, Lesotho and some Pacific states.\n\nNamed the Russo-Ukrainian War, the ongoing crisis began in February 2014 when Russia annexed Crimea from Ukraine.\n\nThe war escalated in 2022 when Russia launched a full-scale invasion of its smaller neighbouring country, leading to hundreds of thousands of deaths and a massive refugee crisis.\n\nSpeaking to this publication in an exclusive interview, Zalmayev said the fact that Russia and Zimbabwe shared a lot of history and that President Emmerson Mnangagwa is assured of an ear in Moscow puts the country in an important position to help end the war.\n\nRussia actively took part in the training, clothing and arming of liberation movements in Zimbabwes fight for independence.\n\nSouth Africa, according to Zalmayev, offers another angle to potential mediation by virtue of being part of the BRICS union. BRICS, an acronym for Brazil, Russia, India, China and South Africa, is an amalgamation of emerging markets.\n\nIt is these ties which make Zimbabwe and South Africa, which is in BRICS with Russia, very important interlocutors, said Zalmayev.\n\nHarare is on speaking terms with Moscow and my position is that it is best placed to reach out to Ukraine as well and suggest itself as a potential platform for negotiations to end the war.\n\nZimbabwe had been purchasing grain in Ukraine before the war broke out. Zimbabweans are also, in a way, feeling the effects of this war.\n\nIn 2022, South African President Cyril Ramaphosa led a nine-member Africa Union (AU) delegation to Moscow and Kyiv to understand and help mediate. Although they were received by both Russian President Vladimir Putin and Ukraines Volodymyr Zelenskyy, the war continued.\n\nA study by the World Bank, United Nations (UN) and European Union (EU) earlier this year predicted that US$542 billion is needed to reconstruct Ukraine in the next ten years following Russias intensive bombardments in the past three years.\n\nAdded Zalmayev: No one wins in this war. It violates the basic UN principle of sovereignty and infallibility of borders. It is in the interest of smaller countries that Ukraine is allowed to continue existing as an independent state.\n\nIf it falls, it will create a huge precedent wherein bigger countries can walk over and take over the smaller ones.\n\nBefore the escalation of the conflict, Ukraine was one of Zimbabwe and other countries in the regions main sources of wheat and alternative grain imports.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/26191653/Zimbabwe-President-Emmerson-Mnangagwa-with-the-Russian-President-Vladimir-Putin.jpg",
            "description": "<p>By Leopold Munhende UKRAINIAN political analyst and journalist Peter Zalmayev has suggested that Zimbabwe and neighbouring South Africa present themselves as mediators to end the war between his country and superpower Russia. Zalmayev, who is on a global tour to highlight implications of the war on Ukraine and other smaller countries, was recently in Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ukrainian-political-analyst-suggests-zimbabwe-south-africa-play-mediatory-role-to-end-war-with-russia/\">Ukrainian political analyst suggests Zimbabwe, South Africa play mediatory role to end war with Russia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Zimbabwe says informal sector dominates 76% of the economy",
            "url": "https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/",
            "content": "Bloomberg\n\nZimbabweestimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census.\n\nWhile the high level of informalization has increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance with the formal tax system, the Zimbabwe National Statistics Agency said in a report released in the capital, Harare, on Wednesday.\n\nGrowing informalization is a critical risk to the economy as less than one quarter of formal businesses carry the tax burden, according to the Confederation of Zimbabwe Industries, the nations largest industry body.\n\nFormal businesses are being squeezed, MacDonald Mutengo, CZIs lead research officer, said at the event. Companies are not making profits, they are highly regulated.\n\nThe informal sector has flourished as formal jobs evaporated due to decades of economic mismanagement that led to repeated currency collapses and bouts of hyperinflation.\n\nThe census surveyed 204,798 businesses across a range of sectors, including financial services and construction. The wholesale and retail trade sector accounted for most economic activity, contributing 73%, followed by manufacturing at 8%.\n\nBulawayo province had the highest concentration of formal businesses at 40%, compared with less than 30% in other regions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Bloomberg Zimbabwe estimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census. While the high level of informalization has “increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/\">Zimbabwe says informal sector dominates 76% of the economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Supreme court enforces UK divorce order in case involving former Anglican bishop",
            "url": "https://www.newzimbabwe.com/supreme-court-enforces-uk-divorce-order-in-case-involving-former-anglican-bishop/",
            "content": "Anglican Ink\n\nZimbabwes Supreme Court has upheld the enforcement of a United Kingdom divorce order involving the former Bishop of Manicaland, the Rt. Rev. Julius Makoniaffirming the authority of English court rulings over matrimonial property under Zimbabwean law.\n\nBishop Makoni, a former investment banker who became a leading figure in Zimbabwes Anglican hierarchy, resigned his post in 2015 to take a position with the International Monetary Fund. A decade later, he has found himself embroiled in a transnational legal dispute with his ex-wife, Pauline Mutsa Makoni, over matrimonial property in London and Harare.\n\nBishop Makoni, who served as the Diocesan bishop of Manicaland from 2009 to 2015, was one of the key figures in the restoration of the Anglican Diocese in the wake of the contentious Nolbert Kunonga schism. His years as bishop were marked by efforts to rebuild the spiritual and administrative health of a diocese ravaged by ecclesiastical division and state interference.\n\nBut his personal life made headlines after he and his wife divorced in the UK, where they had legal residency. The English High Court finalized their divorce in December 2014 and awarded Mrs. Makoni substantial financial compensation, including the couples marital home in Harare.\n\nWhen Mrs. Makoni sought to have the English orders recognized and enforced in Zimbabwe, Bishop Makoni objectedarguing that the UK ruling was inconsistent with Zimbabwes laws and public policy, particularly when it came to property distribution. He contended that Zimbabwean courts should not recognize foreign judgments that conferred domestic property to a foreign-domiciled spouse.\n\nBut in a landmark decision handed down last week, Zimbabwes Supreme Court dismissed Bishop Makonis objections. The bench held that foreign divorce judgmentsespecially those issued by superior courts in jurisdictions such as the UKare enforceable in Zimbabwe, provided due process was followed and the ruling does not offend local public policy.\n\nThe ruling clarified that even where Zimbabwean courts may have ruled differently in terms of asset division, they are bound by the principle of international comity and legal reciprocity to acknowledge the authority of foreign courtsparticularly where both parties were properly represented.\n\nThis decision sets a precedent in Zimbabwean jurisprudence, specifically regarding cross-border matrimonial disputes, at a time when an increasing number of Zimbabweans reside or hold assets abroad but maintain ties to their home country.\n\nThe case carries allegorical weight for the Zimbabwean church. Just as provinces throughout the Global South have historically resisted directives from England on matters of doctrine, the question posed before Zimbabwes courts was whether English authority could shape realities on Zimbabwean soil.\n\nIronically, the courts decision stands in contrast with the ecclesiastical trend: while Zimbabwean bishops and church bodies have increasingly asserted independence from Canterbury in matters of theology and liturgy, here the state court has chosen deference to English legal authority.\n\nThe case also raises difficult questions for Church leaders involved in civil litigationparticularly when it relates to personal conduct and stewardship of property. While clergy and bishops are often held to high standards within the Churchs pastoral framework, many also own assets or reside across multiple jurisdictions. More importantly, it sends a message to Church leaders, lay or ordained, that positions of ecclesiastical authority do not confer immunity in the courts of law.\n\nThe juxtaposition of Bishop Makonis spiritual authority and his civil defeat may be uncomfortable for some within the Anglican establishment. For others, it demonstrates the maturing of Zimbabwes judiciaryholding sacred and secular spheres in check while respecting the rule of law across borders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201402/Julius-Makoni-2015.jpeg",
            "description": "<p>Anglican Ink Zimbabwe’s Supreme Court has upheld the enforcement of a United Kingdom divorce order involving the former Bishop of Manicaland, the Rt. Rev. Julius Makoni—affirming the authority of English court rulings over matrimonial property under Zimbabwean law. Bishop Makoni, a former investment banker who became a leading figure in Zimbabwe’s Anglican hierarchy, resigned his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-enforces-uk-divorce-order-in-case-involving-former-anglican-bishop/\">Supreme court enforces UK divorce order in case involving former Anglican bishop</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Tel One beats log leaders Simba Bhora, as FC Platinum close gap",
            "url": "https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/",
            "content": "By Sports Reporter\n\nSimba Bhoras ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium.\n\nThe Wifi Boys two goals came in the second half through Milton Chimedza and Washington Navaya.\n\nSo important was the win for Tel One that it reduced the gap between them and Simba Bhora to 6 points.\n\nTel One is now sitting in position 5 on the log with 37 points, the same as third and fourth place occupiers FC Platinum and Scottland, respectively.\n\nSimba Bhora, however, maintained top spot as second-place occupiers MWOS played a 1-1 at Nyamhunga against ZPC Kariba.\n\nMWOS is now two points behind Simba with 41 points, with 13 games to go.\n\nElsewhere at Mandava Stadium, FC Platinum maintained its unbeaten run with a 2-1 win over bottom-placed Kwekwe United.\n\nThe win was a big boost for FC Platinum, who leapfrogged two teams to go to number 3 with 37 points.\n\nPure Platinum Play remains the only team yet to be beaten this season; at the same time, they have a game in hand against Manica Diamonds.\n\nPSL Wednesday Results\n\nFull-time:\n\nNgezi Platinum 1-0 CAPS United\n\nTelOne 2-0 Simba Bhora\n\nZPC Kariba 1-1 MWOS\n\nFC Platinum 2-1 Kwekwe United\n\nYadah 1-1 Greenfuel\n\nHerentals 1-0 Chicken Inn\n\nThursday Fixture\n\nDynamos vs Manica Diamonds (Rufaro)\n\nBikita Minerals 7 (Gibbo Stadium)\n\nHighlanders vs. Triangle (Barbourfields)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23195657/telone-fc.jpg",
            "description": "<p>By Sports Reporter Simba Bhora’s ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium. The Wifi Boys’ two goals came in the second half through Milton Chimedza and Washington Navaya. So important was the win for Tel One that it reduced the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/\">Tel One beats log leaders Simba Bhora, as FC Platinum close gap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "This celebrity lifestyle kills you – Andy Muridzo announces retirement from music",
            "url": "https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/",
            "content": "By Tapiwa Svondo\n\nCONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album Chakanyuka, citing that the pressures of being a celebrity were taking a toll on him.\n\nChakanyuka will mark the end of Muridzos music career, which has spanned just over a decade and seen him become a household name with hits like Dherira and Chidhafudhunda.\n\nMuridzo took to Facebook, revealing that he felt music was not his true purpose.\n\nIm writing to inform you the family of Muridzo that CHAKANYUKA will be my last album. I never wanted to take music as my career, but one person I believe in most gave me the courage to move forward with my God given talent.\n\nI will forever love my fans and family, but after this forthcoming album, I will no longer take music as my career again: rather as using my talent and fame to journey into my true purpose, which is healing people spiritually.\n\nIm tired of this celebrity lifestyle; It kills you within. I tried being brave while being insulted by everyone, including people you call your own, he wrote.\n\nBaba Keketso who is not new to controversy, has once in a while, found himself receiving backlash for his love scandals.\n\nI sing from the bottom of my heart just to make you happy and well entertained, but when I try Im insulted and given names which dont suit me.\n\nI know a lot of my fans will not be happy to hear this, but I am tired of trying to prove myself to a nation that never appreciates.\n\nI love music with my life, but here I have become small. I will sing for my kids at home after this album. I think this is not what I was born to do. God help me locate my true purpose, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23185732/andy.jpg",
            "description": "<p>By Tapiwa Svondo CONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album ‘Chakanyuka’, citing that the pressures of being a “celebrity” were taking a toll on him. ‘Chakanyuka’ will mark the end of Muridzo’s music career, which has spanned just over a decade</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/\">This celebrity lifestyle kills you – Andy Muridzo announces retirement from music </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Top UN court says countries can sue each other over climate change",
            "url": "https://www.newzimbabwe.com/top-un-court-says-countries-can-sue-each-other-over-climate-change/",
            "content": "BBC\n\nA landmark decision by a top UN court has cleared the way for countries to sue each other over climate change, including over historic emissions of planet-warming gases.\n\nBut the judge at the International Court of Justice in the Hague, Netherlands on Wednesday said that untangling who caused which part of climate change could be difficult.\n\nThe ruling is non-binding but legal experts say it could have wide-ranging consequences.\n\nIt will be seen as a victory for countries that are very vulnerable to climate change, who came to court after feeling frustrated about lack of global progress in tackling the problem.\n\nThe unprecedented case at the International Court of Justice (ICJ) was the brainchild of a group of young law students from low-lying Pacific islands on the frontlines of climate change, who came up with the idea in 2019.\n\nOne of those students, Siosiua Veikune from Tonga, was in the Hague to hear the decision.\n\nIm lost for words. This is so exciting. Theres a ton of emotions rushing through us. This is a win we take proudly back home to our communities, he told BBC News.\n\nTonight Ill sleep easier. The ICJ has recognised what we have lived through  our suffering, our resilience and our right to our future, said Flora Vano, from the Pacific Island Vanuatu, which is considered the country most vulnerable to extreme weather globally.\n\nThis is a victory not just for us but for every frontline community fighting to be heard.\n\nThe ICJ is considered the worlds highest court and it has global jurisdiction. Lawyers have told BBC News that the opinion could be used as early as next week, including in national courts outside of the ICJ.\n\nCampaigners and climate lawyers hope the landmark decision will now pave the way for compensation from countries that have historically burned the most fossil fuels and are therefore the most responsible for global warming.\n\nMany poorer countries had backed the case out of frustration, claiming that developed nations are failing to keep existing promises to tackle the growing problem.\n\nBut developed countries, including the UK, argued that existing climate agreements, including the landmark UN Paris deal of 2015, are sufficient and no further legal obligations should be imposed.\n\nOn Wednesday the court rejected that argument.\n\nJudge Iwasawa Yuji also said that if countries do not develop the most ambitious possible plans to tackle climate change this would constitute a breach of their promises in the Paris Agreement.\n\nHe added that broader international law applies, which means that countries which are not signed up to the Paris Agreement  or want to leave, like the US  are still required to protect the environment, including the climate system.\n\nThe courts opinion is advisory, but previous ICJ decisions have been implemented by governments, including when the UK agreed to hand back the Chagos Islands to Mauritius last year.\n\nThe ruling is a watershed legal moment, said Joie Chowdhury, Senior Attorney at the Centre for International Environmental Law (CIEL).\n\nWith todays authoritative historic ruling, the International Court of Justice has broken with business-as-usual and delivered a historic affirmation: those suffering the impacts of climate devastation have a right to remedy for climate harm, including through compensation, she added.\n\nA spokesperson for the UKs Foreign, Commonwealth and Development Office said it was taking time to look at the opinion before commenting in detail, but added:\n\nTackling climate change is and will remain an urgent UK and global priority. Our position remains that this is best achieved through international commitment to the UNs existing climate treaties and mechanisms.\n\nThe court ruled that developing nations have a right to seek damages for the impacts of climate change such as destroyed buildings and infrastructure.\n\nIt added that where it is not possible to restore part of a country then its government may want to seek compensation.\n\nThis could be for a specific extreme weather event if it can be proved that climate change caused it, but the Judge said this would need to be determined on a case by case basis.\n\nThis is a huge win for climate vulnerable states. Its a huge win for Vanuatu, which led this case and is going to change the face of climate advocacy, said barrister Stephanie Robinson at Doughty Street Chambers, who represented the Marshall Islands.\n\nIt is not clear how much an individual country could have to pay in damages if any claim was successful.\n\nBut previous analysis published in Nature, estimated that between 2000 and 2019 there were $2.8 trillion losses from climate change  or $16 million per hour.\n\nDuring the evidence sessions in December, the court heard from dozens of Pacific Islanders who have been displaced as a result of rising sea level, caused by climate change.\n\nThe Marshall Islands highlighted that the costs for their island to adapt to climate change are $9 billion.\n\nThat is $9 billion the Marshall Islands does not have. Climate change is a problem they have not caused, but they are forced to consider relocating their capital, said Ms Robinson.\n\nAs well as compensation, the court also ruled that governments were responsible for the climate impact of companies operating in their countries.\n\nIt said specifically that subsidising the fossil fuel industry or approving new oil and gas licenses could be in breach of a countrys obligations.\n\nDeveloping countries are already exploring bringing new cases seeking compensation for historic contributions to climate change against richer, high emitting nations citing the ICJ opinion, according to lawyers the BBC spoke to.\n\nIf a country wants to bring a case back to the ICJ to make a ruling on compensation then it can only do so against countries which have agreed to its jurisdiction, which includes the likes of the UK, but not US or China.\n\nBut a case can be brought in any court globally, whether that be domestic or international, citing the ICJ opinion, explained Joie Chowdhury from CIEL.\n\nSo instead a country may choose to take their case not to the ICJ but a court where those countries are bound e.g. federal courts in the US.\n\nBut the question remains whether the ICJ opinion will be respected.\n\n[The ICJ] is an institution that is subject to geopolitics  and it relies on states adhering to its judgements, it doesnt have a police force, said Harj Narulla, a climate barrister at Doughty Street Chambers, which also represented the Solomon Islands.\n\nWhen asked about the decision, a White House spokesperson told BBC News:\n\nAs always, President Trump and the entire Administration is committed to putting America first and prioritising the interests of everyday Americans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23204139/court-climate-change.webp",
            "description": "<p>BBC A landmark decision by a top UN court has cleared the way for countries to sue each other over climate change, including over historic emissions of planet-warming gases. But the judge at the International Court of Justice in the Hague, Netherlands on Wednesday said that untangling who caused which part of climate change could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-un-court-says-countries-can-sue-each-other-over-climate-change/\">Top UN court says countries can sue each other over climate change</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "Africa to be hit hard as UK foreign aid cuts revealed",
            "url": "https://www.newzimbabwe.com/africa-to-be-hit-hard-as-uk-foreign-aid-cuts-revealed/",
            "content": "BBC\n\nThe government has revealed details of its plans to cut foreign aid, with support for childrens education and womens health in Africa facing the biggest reductions.\n\nThe government said in February it would slash foreign aid spending by 40%  from 0.5% of gross national income to 0.3%  to increase defence spending to 2.5% after pressure from the US.\n\nA Foreign Office report and impact assessment show the biggest cuts this year will come in Africa, with less spent on womens health and water sanitation with increased risks, it says, of disease and death.\n\nAid charities have criticised the move, saying the cuts would impact the worlds most vulnerable people.\n\nBut the government said spending on multilateral aid bodies  money given to international organisations like the World Bank  would be protected, including the Gavi vaccine alliance, and it said the UK would also continue to play a key humanitarian role in hotspots such as Gaza, Ukraine and Sudan.\n\nBaroness Chapman, minister for development, said: Every pound must work harder for UK taxpayers and the people we help around the world and these figures show how we are starting to do just that through having a clear focus and priorities.\n\nThe government said the cuts follow a line-by-line strategic review of aid by the minister, which focused on prioritisation, efficiency, protecting planned humanitarian support and live contracts while ensuring responsible exit from programming where necessary.\n\nThe Foreign Office said bilateral support  aid going directly to the recipient country  for some countries would decrease and multilateral organisations deemed to be underperforming would face future funding cuts. It has not yet announced which countries will be affected.\n\nThe move has been criticised by International Development Committee chair Sarah Champion, who said it appears the cuts will come at the expense of some of the worlds most vulnerable people.\n\nLiberal Democrat international development spokesperson Monica Harding said slashing UK aid spending to its lowest level this century will have an appalling impact on some of the worlds poorest and most vulnerable people.\n\nThis is only the beginning  we will see far deeper and crueller cuts next year when most of the reduction happens, she warned.\n\nIt is concerning that bilateral funding for Africa, gender, education and health programmes will drop, Bond policy director Gideon Rabinowitz said.\n\nThe worlds most marginalised communities, particularly those experiencing conflict and women and girls, will pay the highest price for these political choices.\n\nAt a time when the US has gutted all gender programming, the UK should be stepping up, not stepping back.\n\nUnicef, a UN agency providing aid to children, said the cuts will have a devastating and unequal impact on children and women and called the move deeply short-sighted.\n\nPhilip Goodwin, Unicef UK chief executive, said: We urge the government to adopt a new strategic approach that places vulnerable children at the heart of its aid programmes and policies\n\nAt least 25% of aid should be directed to child-focused initiatives, ensuring that childrens health, nutrition, education, and protection are prioritised.\n\nBritish-founded charity Street Child told the BBC that some of its work to help children get access to education in Sierra Leone, South Sudan and the Democratic Republic of the Congo  where British aid has been a main backer  will come to an end because of the cuts.\n\nCEO Tom Dannatt said education was the greatest long-term builder of hope, and he described reducing the support as sad and short-sighted.\n\nSo children who used to go to school will not go to school, and so, more children will be found roaming the streets and ploughing fields and not developing their critical faculties, he said.\n\nWhereas they should be in school learning and having a chance to build a brighter future for themselves and for their societies, but because of these cuts by British aid for the poorest children, especially in the poorest countries, thats not the reality anymore.\n\nForeign aid has come under intense scrutiny in recent years, with the one cabinet ministeradmitting the public no longer supports spending on it.\n\nOne organisation that escaped the cuts was the World Bank. The Foreign Office confirmed that the International Development Association (IDA), the World Banks fund for the worlds lowest income countries, would receive 1.98bn in funding from the UK over the next three years, helping the organisation benefit 1.9 billion people.\n\nThe Labour governments under Sir Tony Blair and Gordon Brown committed to increasing the overseas aid budget to 0.7% of national income.\n\nThe target was reached in 2013 under David Camerons Conservative-Liberal Democrat coalition government, before being enshrined in law in 2015.\n\nHowever, aid spending was cut to 0.5% of national income in 2021 under the Conservatives, blaming the economic pressures of Covid.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23202215/taps.webp",
            "description": "<p>BBC The government has revealed details of its plans to cut foreign aid, with support for children’s education and women’s health in Africa facing the biggest reductions. The government said in February it would slash foreign aid spending by 40% – from 0.5% of gross national income to 0.3% – to increase defence spending to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africa-to-be-hit-hard-as-uk-foreign-aid-cuts-revealed/\">Africa to be hit hard as UK foreign aid cuts revealed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        },
        {
            "title": "“How many more lives must we lose?” – Mnangagwa declares Seke Road accident a national disaster, orders tougher traffic enforcement",
            "url": "https://www.newzimbabwe.com/how-many-more-lives-must-we-lose-mnangagwa-declares-seke-road-accident-a-national-disaster-orders-tougher-traffic-enforcement/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has declared the fatal road traffic accident which claimed 17 lives along Seke Road, Harare, on Tuesday a national disaster and pledged to assist bereaved families with funeral expenses.\n\nThe tragic accident occurred at Hunyani Bridge when a Malawi-bound haulage truck collided with a commuter omnibus after it lost control and veered onto the oncoming lane.\n\nThe 30-tonne haulage truck first hit two pedestrians who were walking on the road island before crushing the commuter omnibus and killing 15 passengers.\n\nIn a statement on Wednesday, Mnangagwa called for urgent alignment of institutions and courts to address escalating road fatalities after recent devastating accidents.\n\nMy directive is to get all government institutions concerned with traffic enforcement, and our courts, to be properly aligned on this one matter so this seemingly endless, yet avoidable bloody spiral on our roads is brought to an immediate end.\n\nHow many more lives do we need to lose for our consciences to be aroused?\n\nI have directed that the Manyame Traffic accident be declared a national disaster in order to allow the government to move in and assist with hospital bills for those injured, and funeral arrangements and burials for those we sadly lost in the accident.\n\nAs I console with all the bereaved families, I wish those hospitalised a speedy recovery, Mnangagwa said.\n\nThe accident has sparked public outrage after it took nearly three hours for a crane to arrive and remove the trapped commuter omnibus from beneath the truck, exposing the nations poor disaster preparedness and emergency response.\n\nVictims of the accident could initially be heard crying for help, but they unfortunately died before any assistance reached them.\n\nPolice has identified the deceased as: Tatenda Silia (25), Wishby Nganima (19), Letwin Hwingiri (52), Frederick Jumo (39), Shantel Jere (03) Rainford Jere (29), Prodigas Mugere (37), Tatenda Dhokwani (25), Samantha Taderera (27), Sheilla Nemasango (58), Samantha Nyangani (32), Emma Matate (32), Joshua Gutsa (07), Perpetua Kurwa (35), Anyway Maguduru (26) Talent Hwingiri (18) and Mary Nyambiri (63).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133122/1000794263-scaled.jpg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa has declared the fatal road traffic accident which claimed 17 lives along Seke Road, Harare, on Tuesday a national disaster and pledged to assist bereaved families with funeral expenses. The tragic accident occurred at Hunyani Bridge when a Malawi-bound haulage truck collided with a commuter omnibus after it lost</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-many-more-lives-must-we-lose-mnangagwa-declares-seke-road-accident-a-national-disaster-orders-tougher-traffic-enforcement/\">“How many more lives must we lose?” – Mnangagwa declares Seke Road accident a national disaster, orders tougher traffic enforcement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:53",
            "date": "24 Jul 2025"
        }
    ]
}