{
    "news": [
        {
            "title": "Zimbabwe police officers banned from betting shops while in uniform",
            "url": "https://www.newzimbabwe.com/zimbabwe-police-officers-banned-from-betting-shops-while-in-uniform/",
            "content": "Gambling Insider\n\nZimbabwes police force has introduced a ban on officers entering betting shops or gambling while in uniform, due to reputational risks.\n\nThe announcement was made by National Police spokesperson Commissioner Paul Nyathi at the H-Metro National Forum On Responsible Betting, held in Harare over the weekend.\n\nThe forum, held in partnership with the Lotteries and Gaming Board, brought together government officials, regulators and industry stakeholders to discuss the rapid expansion of betting in Zimbabwe.\n\nThe discussion also touched on criminal cases linked to gambling misuse, including the conviction of a former manager who stole over $3,000 from his employer to fund a gambling addiction.\n\nHowever, betting industry representatives questioned the attribution of blame, arguing that some individuals may use gambling as a scapegoat for unrelated crimes.\n\nCommissioner Nyathi addressed growing concerns over law enforcements visibility in gambling environments, particularly after several viral images showed uniformed officers allegedly betting in shops, having said, This does not give a good picture of the countrys police force.\n\nThe ban is part of a wider push to strengthen regulation and safeguard the industrys growth, particularly as crash games continue to gain popularity across the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15015112/Police-Gambling-Betting-jpg.webp",
            "description": "<p>Gambling Insider Zimbabwe’s police force has introduced a ban on officers entering betting shops or gambling while in uniform, due to reputational risks. The announcement was made by National Police spokesperson Commissioner Paul Nyathi at the H-Metro National Forum On Responsible Betting, held in Harare over the weekend. The forum, held in partnership with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-police-officers-banned-from-betting-shops-while-in-uniform/\">Zimbabwe police officers banned from betting shops while in uniform</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Woman smuggled baby into UK using fake birth story",
            "url": "https://www.newzimbabwe.com/woman-smuggled-baby-into-uk-using-fake-birth-story/",
            "content": "BBC\n\nLast summer, a woman was arrested at Gatwick Airport after she arrived from Nigeria with a very young baby girl.\n\nThe woman had been living in West Yorkshire with her husband and children, and before leaving the UK for Africa had told her GP she was pregnant.\n\nThat was not true.\n\nWhen the woman returned about a month later with the baby, she was arrested on suspicion of trafficking.\n\nThe case, the second the BBC has followed through the Family Court in recent months, reveals what experts say is a worrying trend of babies possibly being brought to the UK unlawfully  some from so-called baby factories in Nigeria.\n\nThe woman, who we are calling Susan, is Nigerian, but had been living in England since June 2023, with her husband and children.\n\nA careworker with leave to remain in Britain, Susan claimed she was pregnant. But scans and blood tests showed that wasnt true. Instead, they revealed Susan had a tumour, which doctors feared could be cancerous. But she refused treatment.\n\nSusan insisted her previous pregnancies had been invisible on scans, telling her employer, my babies are always hidden. She also claimed shed been pregnant for up to 30 months with her other children.\n\nSusan had travelled to Nigeria in early June 2024, saying she wanted to have her baby there, and then contacted her local hospital in Britain, to say she had given birth.\n\nDoctors were concerned and contacted childrens services.\n\nArriving back in the UK with the baby girl  who were calling Eleanor  Susan was stopped and arrested by Sussex Police.\n\nShe was bailed and the lead police force on this confirmed there is no active investigation at the moment.\n\nAfter her arrest, Susan, her husband, and Eleanor were given DNA tests. Eleanor was taken to foster carers.\n\nWhen the results show that I am Eleanors mother, I want her to be returned immediately, Susan said.\n\nBut the tests showed the baby had no genetic link with Susan or her husband. Susan demanded a second test  which gave the same result, and then she changed her story.\n\nShed had IVF treatment before moving to Britain in 2023 with a donor egg and sperm, she said, and thats why the DNA tests were negative.\n\nSusan provided a letter from a Nigerian hospital, signed by the medical director, saying shed given birth there, as well as a document from another clinic about the IVF treatment to back up her claims.\n\nShe also provided photos and videos which she said showed her in the Nigerian hospitals labour suite. No face is visible in the images and one showed a naked woman with a placenta between her legs, with an umbilical cord still attached to it.\n\nThe Family Court in Leeds sent Henrietta Coker to investigate.\n\nMs Coker, who provides expert reports to family courts in cases like this, has nearly 30 years experience as a social worker. She trained in Britain, and worked in front-line child protection in London, before moving to Africa.\n\nMs Coker visited the medical centre where Susan claimed shed had IVF. There was no record of Susan having had treatment there  staff told her the letter was forged.\n\nShe then visited the place Susan said shed given birth. It was a shabby, three bedroom flat, with stained walls and dirty carpets.\n\nThere Ms Coker was met by three young teenage girls sitting in the reception room with nurses uniforms on.\n\nShe asked to speak to the matron and was ushered into the kitchen where a teenage girl was eating rice.\n\nMs Coker then tracked down the doctor whod written a letter saying Susan had given birth there. He said, Yes, someone had given birth.\n\nMs Coker showed him a photograph of Susan, but it wasnt her, the doctor said.\n\nImpersonating people is common in this part of the world, he told Ms Coker, suggesting that Susan might have bought the baby.\n\nSupplied Henrietta Coker has decades of experience as a social worker\n\nThe practice of baby farming is well known in West Africa, Ms Coker later told the court. At least 200 illegal baby factories have been shut down by the Nigerian authorities in the last five years, she said.\n\nSome contained young girls whod been kidnapped, raped, and forced to give birth repeatedly.\n\nSometimes these girls are released, Ms Coker said, other times they die during childbirth, or are murdered and placed in the grounds of the organisation.\n\nIts not clear where baby Eleanor might have come from  though the doctor told Ms Coker he believed she would have been given up voluntarily.\n\nMs Coker was unable to establish who Eleanors real parents are.\n\nShe gave evidence to the Family Court in Leeds in March this year, along with Susan, her husband, her employer and a senior obstetrician.\n\nAt an earlier hearing the judge asked for Susans phone to be examined. Investigators found messages which Susan had sent to someone saved in her address book as Mum oft [sic] Lagos Baby.\n\nAbout four weeks before the alleged date of birth Susan wrote a text message which read:\n\nGood afternoon ma, I have not seen the hospital items\n\nThe same day, Mum Oft Lagos Babyresponded:\n\nDelivery drug is 3.4 m\n\nHospital bill 170k.\n\nAssuming those sums to be Nigerian Naira, they would be in the region of 1,700 and 85 respectively, the Family Court judge, Recorder William Tyler KC said.\n\nThe local authority pointed out the messages were set to automatic self-destruct mode  and said they represented evidence of a deal to purchase a baby.\n\nSusan tried to explain the messages in court. The Recorder said her attempts were difficult to follow and impossible to accept.\n\nRecorder Tyler, sitting as a Deputy Judge of the High Court, found Susan had staged a scene which she falsely claimed showed her giving birth to Eleanor in Nigeria.\n\nHe said Susan and her husband had put forward a fundamental lie to explain how Eleanor came to be in their care, and had tried to mislead authorities with false documents.\n\nTheyd both caused the little girl significant emotional and psychological harm, he said.\n\nIn early July, the BBC attended the final hearing in Eleanors case, held remotely.\n\nIn one little square of the Teams meeting we could see Susan and her husband, sitting upright, barely moving, focused closely on what the advocates said.\n\nThey wanted Eleanor returned to them. Their barristers said their own children were thriving  they wanted to offer her the same love and care.\n\nSusans husband saw Eleanor as a fundamental part of their family unit.\n\nVikki Horspool, representing the childs guardian, a social worker from the Independent Children and Family Child Advisory Service challenged that. She said that the couple continued to be dishonest about Eleanors real start in life and how she came to be in their care.\n\nThe judge ordered that baby Eleanor be placed for adoption, and also made a declaration of non parentage. He said he was aware of the pain this would cause Susan and her husband.\n\nThe barrister for the local authority told the court that the baby is very settled with her foster carer, taking part in activities in her community and getting medical treatment.\n\nWhen Eleanor is adopted she will have a new identity and British nationality  but she may never know who her real parents are.\n\nEleanors storyechoes the case of Lucy who was brought into Manchester Airport in 2023, by a man claiming to be her father.\n\nMs Coker believes it is likely that more children have been brought unlawfully to the UK from West Africa. She told the BBC she has worked on around a dozen similar cases since the pandemic. In her experience, baby trafficking is commonplace.\n\nMoney is getting exchanged for children on a large scale she said  not just in Africa but across the global south.\n\nSince 2021 the UK government has restricted adoptions from Nigeria, partly because of evidence of organised child trafficking within the country.\n\nBritish authorities have been aware of the problem for many years, and there have been several cases in the Family Courts over the last 20 years.\n\nTwo hearings in 2011 and 2012 involvedNigerian couples whod had fertility treatment  that led to a miracle baby.\n\nThese treatments continue, as recently exposed byinvestigative journalists at BBC Africa Eye.\n\nIn 2013, the UK High Commission in Lagos required DNA tests in certain circumstances before newborn babies could be taken from Nigeria to Britain.\n\nAmong 12 couples investigated was a former Oxford academic,prosecuted for immigration offences.\n\nHoweverthis process has since stopped.In 2018 officials were advised that such DNA testing was unlawful.\n\nThey were told they could not make people undergo DNA testing when they were asking for a visa or passport in support of an application relating to immigration status  and that had been the case since 2014.\n\nMs Coker said some clinics offer packages that include registering the babys birth. It will cost anywhere between 2,000 and 8,000, excluding any airfare, she said.\n\nShe thinks more people in Britain should be aware of this activity.\n\nIt is hard to tackle, she said  perhaps DNA testing of newborn babies and purported parents would help.\n\nBut she wasnt sure the British government can do much to stop it, she said, the issues start in countries where the children are born.\n\nPatricia Durr, CEO of the anti-trafficking charity ECPAT said cases like this were particularly heinous because they denied a child right to their identity.\n\nShe said: Every effort must be made to prevent these egregious crimes occurring.\n\nA government spokesperson said: Falsely claiming to be the parent of a child to facilitate entry to the UK is illegal. Those found doing so will face the full force of the law.\n\nBorder Force is committed to protecting individuals who cross the border and where concerns are raised, officers will take action to safeguard individuals who could be at risk.\n\nThe BBC contacted the Nigerian High Commission for comment but they did not respond.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15014039/baby.webp",
            "description": "<p>BBC Last summer, a woman was arrested at Gatwick Airport after she arrived from Nigeria with a very young baby girl. The woman had been living in West Yorkshire with her husband and children, and before leaving the UK for Africa had told her GP she was pregnant. That was not true. When the woman</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-smuggled-baby-into-uk-using-fake-birth-story/\">Woman smuggled baby into UK using fake birth story</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Industrial supplies dominate Zimbabwe’s import list",
            "url": "https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/",
            "content": "By Alois Vinga\n\nINDUSTRIAL supplies dominated Zimbabwes import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed.\n\nThe RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and Transport and Equipment US$73,7 million.\n\nOut of the US$818,3 million spent during the period, just US$98,3 million and US$44,5 million was spent on food and consumer goods.\n\nZimbabwe is currently pursuing an industrial turnaround strategy with the objective to align with Vision 2030 as well as minimise the huge foreign exchange expenditure on the importation of simple consumables.\n\nThe countrys imports were mainly sourced from South Africa (37.1%), China (14.5%), Bahrain (10.4%), the Bahamas (7.4%), and Mozambique (3.8%). The remainder of the imports came from various other markets.\n\nDuring April 2025, the countrys trade deficit narrowed to US$118.7 million, from US$235.2 million recorded in the previous month. Relative to April 2024, the trade deficit narrowed from US$206.1 million to US$118.7 million in the reporting month.\n\nThe countrys merchandise exports increased by 13.6% to US$662.6 million, from the previous months outturn of US$583.1 million. The increase was largely underpinned by growth in export earnings from gold, platinum group of metals (PGMs) and diamond.\n\nOn a year-on-year basis, exports were 29.0% higher compared to US$513.5 million recorded in April 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15010733/pump-and-steel-supplies-zimbabwe-0009a-scaled-1.jpg",
            "description": "<p>By Alois Vinga INDUSTRIAL supplies dominated Zimbabwe’s import list in the latest reporting period, the Reserve Bank of Zimbabwe (RBZ) has revealed. The RBZ monthly economic review for April 2025 shows that US$313 million was spent on industrial supplies, with US$154 million being spent on fuels and lubricants. Capital goods chewed up US$128,1 million and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industrial-supplies-dominate-zimbabwes-import-list/\">Industrial supplies dominate Zimbabwe’s import list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Warriors midfielder Maswanhise aims big in Scottish league",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-maswanhise-aims-big-in-scottish-league/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanhise has set his sights high at Motherwell FCthis season in the Scottish Premier Soccer League after kicking off his campaign with two goals over the weekend.\n\nMaswanhise scored a brace over the weekend against Clyde FC in the Premier Sports Cup, which was the first competitive match for his side this season.\n\nSo important were the two goals that it saw his side picking a draw in regulation time (2-2) before they won 5-4 on penalties to proceed to the next round.\n\nIm happy to kick-start the campaign with two goals.\n\nI really want to get more goals this season and Im just delighted with the two goals.\n\nThere is always room for improvement, but I have set myself higher goals this season because I know what the leagues, said Maswanhise.\n\nMotherwell FC will be in action on Tuesday when they play Peterheadin the second match of the season, and all eyes will be on the Zimbabwean midfielder to deliver.\n\nWith new coach Jens Berthel, who joined the side in June, Maswanhise added that he is happy to be given first-team preference.\n\nIts good that I have been through one or two managers now.\n\nObviously, its my first season in professional football, so Im taking on board what he is doing and its going really well so far.\n\nSo Im happy that Im being selected for the team, really, he added.\n\nThis season will be the second in a row for Maswanhise, who joined Motherwell last season.\n\nThe 22-year-old won Motherwells best goals of the season (2024-25), and all eyes will be on him this season under new manager Jens Berthel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/31090359/IMG-20241031-WA0003.jpg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanhise has set his sights high at Motherwell FC this season in the Scottish Premier Soccer League after kicking off his campaign with two goals over the weekend. Maswanhise scored a brace over the weekend against Clyde FC in the Premier Sports Cup, which was the first competitive match for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-maswanhise-aims-big-in-scottish-league/\">Warriors midfielder Maswanhise aims big in Scottish league</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "Revolutionising transport, Click A Ride making travel safer and cheaper",
            "url": "https://www.newzimbabwe.com/revolutionising-transport-click-a-ride-making-travel-safer-and-cheaper/",
            "content": "By Staff Reporter\n\nRIDE-hailing company Click A Ride is making headway, revolutionising the local e-transport system by offering unique services ranging from cheaper prices to watertight security features.\n\nDespite starting as an idea last year, the fully functional mobile application launched in March this year has been making inroads in the local e-hailing system.\n\nClick A Ride is a locally tailored product designed to offer seamless services to passengers, with security features that enhance client safety.\n\nTinotenda Chinembiri, one of the companys founders, said this sets the platforms services apart, as they collaborate with the Zimbabwe Republic Police (ZRP) officers whenever passenger or driver safety is compromised.\n\nThe application requires data. This enhances security for the passenger at all times. It also enables us to know who the passenger is, where they are going, and any other necessary information. This helps safeguard both the passenger and the driver. There had been rising cases of robberies in taxis.\n\nThe security features reduce the risk of robberies for both the driver and the passenger. We can trace whenever a car goes off route, and we work with relevant security services, including the police, whenever safety is compromised, said Chinembiri.\n\nHe added that thorough security checks for drivers have been praised by clients.\n\nWe have been receiving feedback on our security system. If you give the driver a parcel, there is an one-time password OTP that one receives, making it easier to track the goods. We conduct thorough verification when someone joins our platform, which makes tracking easier, he explained.\n\nThe ride-hailing platform also keeps costs low, offering affordable services to its customer base. It allows both drivers and passengers to negotiate fares, giving them control over ride terms.\n\nChinembiri said the application is synonymous with lower transport costs for passengers, and drivers benefit from commission.\n\nGone are the days when people were charged based solely on their destination. With Click A Ride, you can charge a passenger per kilometre, which is cheaper. Passengers can also select their own prices. We also have lower commissions and conduct driver training sessions to reduce service conflicts, he said.\n\nClick A Ride offers taxi services, premium vehicle hire, parcel delivery via motorcycles, three-wheelers, trucks, and emergency towing services, making it the first platform in Zimbabwe to provide such a wide range of options.\n\nAdditionally, clients can choose from different service tiers, bronze, silver, gold, and platinum, with the latter offering top-notch services.\n\nClick A Ride enables users to access emergency taxis. If you have a business and sell goods online, our bikes help with deliveries. We also have scooters at the same prices as bikes and assist in moving heavy goods.\n\nOur application will soon be updated to include goods-in-transit insurance, which will be visible and help with compensation in case of accidents, Chinembiri added.\n\nCurrently, Click A Ride is running a weekly competition where top clients stand to win US$100 or even a motor vehicle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15004739/IMG-20250711-WA00211.jpg",
            "description": "<p>By Staff Reporter RIDE-hailing company Click A Ride is making headway, revolutionising the local e-transport system by offering unique services ranging from cheaper prices to watertight security features. Despite starting as an idea last year, the fully functional mobile application launched in March this year has been making inroads in the local e-hailing system. Click</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/revolutionising-transport-click-a-ride-making-travel-safer-and-cheaper/\">Revolutionising transport, Click A Ride making travel safer and cheaper</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "DRC nationals in court for smuggling skin bleaching creams into Zimbabwe",
            "url": "https://www.newzimbabwe.com/drc-nationals-in-court-for-smuggling-skin-bleaching-creams-into-zimbabwe/",
            "content": "By Staff Reporter\n\nTWO men from the Democratic Republic of Congo (DRC) have appeared in court facing a charge of smuggling skin bleaching creams into Zimbabwe.\n\nAccused persons, Aurora Mujinga (35) and Lolo Kapamba (45), appeared before the Chinhoyi Magistrates Court, where they were convicted of the crime.\n\nThe pair was sentenced to pay a US$200 fine each or in default, spend the next four months in jail. In addition to the sentence, the contraband was forfeited to the State.\n\nThe prosecutor told the court that on June 29, 2025, at Chirundu One-Stop Border Post, the offenders unlawfully imported a significant quantity of various goods from Zambia into the country without the required permits.\n\nCourt heard that at around 6pm on the same day, detectives from the Criminal Investigations Department (CID) received a tip-off that there were smuggled goods aboard a CAG bus parked at the Chirundu bus terminus.\n\nThe cops proceeded to the rank and directed the bus to the Zimbabwe Revenue Authority (ZIMRA) Chirundu yard for a search.\n\nDuring the search, three bags were found containing a variety of items, including bleaching products namely CT Plus, Lemon Plus, Dema Clair, Mark Clear, Extra Clear, Infirm Clear, Princes Clear, and Coco Pulp, which are cosmetic or medicinal creams/liquids.\n\nThe duo claimed to have purchased the goods in Zambia but could not produce any customs documentation to prove declaration to ZIMRA customs leading to their arrest. The following day, the recovered goods were seized by authorities.\n\nIn passing sentence, the magistrate noted that the defendants had shown disregard for the law and the potential harm caused by the products. However, considering they were first offenders and had pleaded guilty, the court decided to impose a fine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15011638/Skin-lightening-creams.jpeg",
            "description": "<p>By Staff Reporter TWO men from the Democratic Republic of Congo (DRC) have appeared in court facing a charge of smuggling skin bleaching creams into Zimbabwe. Accused persons, Aurora Mujinga (35) and Lolo Kapamba (45), appeared before the Chinhoyi Magistrates’ Court, where they were convicted of the crime. The pair was sentenced to pay a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drc-nationals-in-court-for-smuggling-skin-bleaching-creams-into-zimbabwe/\">DRC nationals in court for smuggling skin bleaching creams into Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        },
        {
            "title": "10 Zimbabweans making waves in Australia",
            "url": "https://www.newzimbabwe.com/10-zimbabweans-making-waves-in-australia/",
            "content": "By Darlington Gatsi\n\nZimbabwes global diaspora continues to be a powerful force shaping narratives, industries, and communities far beyond its borders. Among the most vibrant hubs is Australia  a land of opportunity where many Zimbabweans have not only settled but thrived. From the bustling cities of Sydney and Melbourne to the academic halls of Brisbane and the cultural melting pot of Perth, Zimbabweans have made their mark with tenacity, innovation, and a deep sense of purpose.\n\nNewZimbabwe.comshines a spotlight on 10 influential Zimbabweans based in Australia who are excelling in their respective fields and contributing meaningfully to both their host country and their motherland. These individuals embody the spirit of resilience and excellence. They are entrepreneurs, health professionals, community leaders, creatives, academics, and changemakers whose stories are rooted in hard work, cultural pride, and a desire to make a lasting impact.\n\nMore than a celebration of individual success, this article serves as a reminder of the potential of diaspora communities to uplift nations, drive change, and build bridges across cultures. It also affirms that Zimbabwes greatest export remains its people  whose talents and contributions extend well beyond geographical borders.\n\nTkayMaidza\n\nTkayMaidza\n\nTkay Maidzais a Zimbabwean-Australian musician who set aside her love for tennis in favour of studio time. Since then, she has made a name for herself in the music scene. Maidza has released two albums, Tkay (2016) and Sweet Justice (2023). Last year, she was named in the Forbes 30 Under 30 Australia list.\n\nMelody mbuya vaRaphy Magengezha\n\nMelody mbuya vaRaphy Magengezha\n\nMagengezha is a mental wellness advocate who leverages her academic background as a DBT (Dialectical Behaviour Therapy) therapist and holds certifications in Trauma Therapy and Solution-Based Therapy from Australia. Magengezha uses online platforms to champion mental health awareness in Australia.\n\nKnown as Mbuya vaRaphy, she has over 20 years of experience in therapy, coaching, and community-based mental wellness support. She is the CEO of Rising Serenity Coaching and Therapy Services, an organisation that focuses on mental and emotional resilience among children, youth, young adults, and families.\n\nMagengezha has written extensively on mental health, as evidenced by her two books: Forgiveness is Key to Freedom and Stagnant or Soaring: Impact of Your Inner Circle.\n\nRecently, Magengezha was honoured with the Influencer of the Year Award (Fluxx Awards, Education Hong Kong) and Mental Health Care Expert of the Year Award (Fluxx Awards, Health and Wellness Hong Kong). These follow the honours she received in 2023: Community Leader Award (Australian Ladies in Business Initiative) and Zimbabwe Achievers Award  Community Champion of the Year.\n\nTatendaTatsNyaruwe\n\nTatendaTatsNyaruwe\n\nTatsis an Australia-based Zimbabwean content creator, also known as ManLikeTats on social media. Having left Zimbabwe at a young age for Australia, Tatshas been using digital media to shine a spotlight on his roots. He advocates for Zimbabweans abroad to stay connected with their culture. He recently won Content Creator of the Year at the Amari Gala.\n\nRutendo Mupedzi\n\nRue Mupedzi\n\nMupedzi rose to prominence after appearing in the 15th season of MasterChef Australia. An oral health therapist based in Western Australia with a passion for culinary arts, she made history as the first Zimbabwean to reach the MasterChef Australia top 10. She has also launched her sauce brand, BarbeRue, sold in Australian outlets.\n\nAudius Mtawarira\n\nAudius Mtawarira\n\nThe Zimbabwean music legend has not been off the radar, contrary to some notions. Mtawarira recently released his song Trigger, which has reminded many of the good old urban grooves era. Mtawarira has been releasing music despite last releasing an album  Seeds of Change  two years ago. Last year, he was honoured with a Lifetime Achievement Award at the Zimbabwe Achievers Awards Australia.\n\nJoyce Takaidza\n\nJoyce Takaidza\n\nThe Zimbabwe Netball team player has been a mainstay in the Gems squad. Takaidza played a crucial role in the past World Cups that Zimbabwe has featured in, including Liverpool (2019) and Cape Town (2023). In 2017, she won three awards at the Zimbabwe Achievers Awards Australia (ZAA)  Sport Personality of the Year, Peoples Choice, and Chairmans Award.\n\nLucky Ngoshi\n\nLucky Ngoshi\n\nNgoshi is an entrepreneur who began an online grocery service and has since diversified into cakes, pharmaceuticals, solar installations, carpentry, and building supplies, creating a One-Stop Shop for Zimbabweans in the diaspora. She also runs an online podcast, Keeping in Touch with Lucky.\n\nNgoshi has also established a Non-Profit Organisation (NGO), Ladies of Zimbabwe in Australia (LOZA), where close to 6,000 Zimbabwean women (living in Australia) are empowered through community engagement and professional development. Last year, she was honoured at the Zimbabwe Achievers Awards (ZAA) with a Peoples Choice Award.\n\nAnesu Mushangwe\n\nAnesu Mushangwe\n\nThe Zimbabwe Womens Cricket player has been making waves in local teams in Australia. The Adelaide Strikers Women player has become an integral part of the team. Last season, she took 33 wickets in 21 games and scored 99 runs in the same number of matches.\n\nRavai Makwara\n\nRavai Makwara\n\nMakwara, through her bold venture Madhuve Catering, has been serving Zimbabwean cuisine in Melbourne. This has made several Zimbabweans fall in love with her restaurant, which offers many nostalgic dishes. Ravai is a strong advocate for cultural awareness and inclusivity, using food as a bridge to connect communities.\n\nTendayi Ganga\n\nTendayi Ganga\n\nGanga has established herself as a champion of womens rights and social justice through her community work in Australia. With a background in medicine as a registered nurse and pastoral work, she periodically uses her YouTube channel to advocate for womens rights. In 2019, she was honoured with a double recognition at the Zimbabwean Achievers Awards (ZAA) Australia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/14165120/rutendo-mupedzi.webp",
            "description": "<p>By Darlington Gatsi Zimbabwe’s global diaspora continues to be a powerful force shaping narratives, industries, and communities far beyond its borders. Among the most vibrant hubs is Australia – a land of opportunity where many Zimbabweans have not only settled but thrived. From the bustling cities of Sydney and Melbourne to the academic halls of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/10-zimbabweans-making-waves-in-australia/\">10 Zimbabweans making waves in Australia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "15 Jul 2025"
        }
    ]
}