{
    "news": [
        {
            "title": "UZ students protest against replacement of striking lecturers",
            "url": "https://www.newzimbabwe.com/uz-students-protest-against-replacement-of-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nUNIVERSITY of Zimbabwe (UZ) students are standing in solidarity with their striking lecturers, vowing to resist any attempts to bring in replacement staff.\n\nThe lecturers have been on an indefinite strike against poor salaries, which began on 16 April.\n\nThey held their third demonstration at UZ, Tuesday, where they vowed to press on with the industrial action until their demands are met.\n\nDelivering a solidarity speech Tuesday during the striking lecturers third demonstration, Zimbabwe National Students Union (ZINASU) representative Darlington Chingwena said their education had been stolen, accusing university authorities of threatening their future by neglecting the plight of academic staff.\n\nOur education was stolen from us and we are going to fight and demand our right to education.\n\nWe are not going to tolerate the hiring of scabs to teach us, our future was robbed, our future is at stake, we are going to pursue and recover our education and no one is going to stop or threaten us because we are even prepared to die for this thing, Chingwena said.\n\nUZ lecturers are demanding a return to their pre-2018 salaries when a junior lecturer earned US$2,250.Currently, they earn US$230.\n\nAbout a week ago, the university announced plans to replace striking lecturers with temporary staff earning just US$5.50 per hour, 40% of which will be paid in local ZWG currency.\n\nThe students vowed they will not accept the replacement of their lecturers with scab lecturers.\n\nThe idea of scabs is going to be met with fire and fury like what the world has never seen before, the students are ready, and we are not going to surrender until the right thing is done, Chingwena said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030519/UZ-strike-9-scaled.jpg",
            "description": "<p>By Thandiwe Garusa UNIVERSITY of Zimbabwe (UZ) students are standing in solidarity with their striking lecturers, vowing to resist any attempts to bring in replacement staff. The lecturers have been on an indefinite strike against poor salaries, which began on 16 April. They held their third demonstration at UZ, Tuesday, where they vowed to press</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-students-protest-against-replacement-of-striking-lecturers/\">UZ students protest against replacement of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "28 May 2025"
        },
        {
            "title": "Glitz and Glamour Shine at the 15th Zimbabwe Achievers Awards UK",
            "url": "https://www.newzimbabwe.com/glitz-and-glamour-shine-at-the-15th-zimbabwe-achievers-awards-uk/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28041253/1000279674.jpg",
            "description": "<p>The prestigious 15th edition of the Zimbabwe Achievers Awards UK (ZAA UK) lit up Birmingham with a spectacular evening of celebration, elegance, and inspiration. Hosted at the luxurious 5-star Grand Hotel, the event brought together trailblazers from the Zimbabwean diaspora for a night that truly embodied excellence and unity. Ultra Healthcare, part of the GMT</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/glitz-and-glamour-shine-at-the-15th-zimbabwe-achievers-awards-uk/\">Glitz and Glamour Shine at the 15th Zimbabwe Achievers Awards UK</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "28 May 2025"
        },
        {
            "title": "South Africa in talks with Zimbabwe and Zambia to run Grand Inga transmission line",
            "url": "https://www.newzimbabwe.com/south-africa-in-talks-with-zimbabwe-and-zambia-to-run-grand-inga-transmission-line/",
            "content": "IOL\n\nSouth Africas Minister for Minerals and Petroleum Resources Gwede Mantashe said his country is initiating discussions with Zambia and Zimbabwe on the possibility of running the electricity transmission line from the Democratic Republic of Congo (DRC) under the Grand Inga project, through which 2,500 megawatts are envisaged for the country.\n\nMantashe was responding to questions from members of the Portfolio Committee on Minerals and Petroleum Resources on Tuesday, who had asked about the status of the project and what the country was doing to harness regional collaboration following the decision to postpone participation in the project.\n\nThe Grand Inga project is not ours; its a DRC project, given to the Spanish and Chinese. We have a right to buy equity in it, which would have to be approved by the DRC. We have not bought that equity, so we cant really pretend to be managing the Inga project. It is not our project. We have committed ourselves to a quantity of electricity that will be taken up by South Africa, but the driving of the project is out of our jurisdiction, Mantashe said.\n\nMKP MP Crown Prince Adil Nchabaleng objected to the Ministers stance, indicating that South Africa still considered the project feasible.\n\nYou cant expect to tell us that you are going to power South Africa from the Grand Inga project. Is South Africa talking about a concession to resell in that market with regard to the 2 500 MW as an investment partnership? You cannot power South Africa from the Grand Inga project, he said.\n\nMantashe maintained that there were ongoing discussions.\n\nThe Grand Inga Hydropower Project, a massive dam construction on the Congo River in the DRC, is intended to generate a large amount of electricity, with South Africa being a key off-taker. This project is envisioned as a major source of clean energy for the region and potentially for the entire African continent.\n\nSouth Africa has expressed interest in importing electricity from the Grand Inga project, particularly from Inga 3, the first of the new hydropower facilities.\n\nSouth Africas energy planning assumes the country will import 2500 MW from Inga by 2030, with the potential to double this to 5 000 MW.\n\nA long transmission line, passing through Angola, Namibia, and Botswana, would be needed to deliver power from Inga to Gauteng, South Africas economic heartland.\n\nSouth Africa and the DRC have signed agreements on receiving electricity from Inga, and the project is in the process of finalizing an agreement and securing financing.\n\nMeanwhile, Mantashe clarified that the launch of the South African National Petroleum Corporation (SANPC), which resulted from the restructuring of the department into two entities, may seem like a negative intervention to many, but gave the department space and opportunity to prioritise petroleum appropriately. He noted that petroleum is a source of 80% of the worlds energy but currently plays second fiddle to renewables.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28035019/grand-inga.jpeg",
            "description": "<p>IOL South Africa’s Minister for Minerals and Petroleum Resources Gwede Mantashe said his country is initiating discussions with Zambia and Zimbabwe on the possibility of running the electricity transmission line from the Democratic Republic of Congo (DRC) under the Grand Inga project, through which 2,500 megawatts are envisaged for the country. Mantashe was responding to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-in-talks-with-zimbabwe-and-zambia-to-run-grand-inga-transmission-line/\">South Africa in talks with Zimbabwe and Zambia to run Grand Inga transmission line</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "28 May 2025"
        },
        {
            "title": "In Pictures: UZ lecturers stage third demonstration",
            "url": "https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/",
            "content": "Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled.jpg",
            "description": "<p>Below are some images from the University of Zimbabwe, where lecturers staged their third demonstration against poor salaries. The industrial action began on April 16. Pictures by Thandiwe Garusa </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-uz-lecturers-stage-third-demonstration/\">In Pictures: UZ lecturers stage third demonstration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "28 May 2025"
        },
        {
            "title": "Tagwirei-led Land Tenure Committee a coterie of looters – Mawarire",
            "url": "https://www.newzimbabwe.com/tagwirei-led-land-tenure-committee-a-coterie-of-looters-mawarire/",
            "content": "By Staff Reporter\n\nLATE President Robert Mugabes spokesperson Jealousy Mawarire has come out in support of a constitutional court application by disgruntled war veterans who are challenging the legality of President Emmerson Mnangagwas Lands Tenure Implementation Committee.\n\nThe Committee, led by businessman Kudakwashe Tagwirei, seeks to establish freehold on agricultural land despite clear constitutional provisions placing its ownership in the State.\n\nAccording to war veterans, the committee has been demanding payments of an unclear nature from beneficiaries of the countrys Land Reform Programme, with some being ordered to pay as much as US$1.5 million.\n\nWar veterans want the committee declared unlawful and for it to let all land issues be dealt with by the constitutionally mandated Land Commission.\n\nSpeaking on SABCs Channel Africa, in support of the court application, Mawarire described the committee as a quartet of looters and Mnangagwas land barons.\n\nThe Presidents attempt to introduce freehold land ownership is a huge departure from the provisions of the constitution and the overarching objective of the liberation struggle, which was to deal with private ownership of land, said Mawarire.\n\nWe have a President who does not respect the constitution for which he was sworn in to uphold.\n\nIn the event that the President has abrogated his responsibilities and has actually, in this case, started to behave like a land baron, then the war veterans are duty-bound to step in and offer those checks and balances that the opposition can no longer do.\n\nThey have launched a constitutional court application in order to put a stop to this madness that is being presided over by the President and his coterie of looters.\n\nIf you look at the whole scheme, this is a parallel structure formed by the President outside the provision of the constitution.\n\nSection 296, Section 297 and Section 72 of the Zimbabwean constitution confirm State ownership of all agricultural land, confirm the role of the Land Commission and further cancel all existing title deeds for it.\n\nMawarire, who has been very vocal, not just about the land issue but Mnangagwas attempts to unconstitutionally stay in power beyond his two terms up to 2030, said the fact that war veterans were now confronting Zanu PF themselves indicated an absence of opposition politicians.\n\nAfter close to two decades of keeping Zanu PF on its toes, the MDC, now led by Douglas Mwonzora, is a shell of its former glory. The Citizens Coalition for Change (CCC), once headed by Nelson Chamisa, was hijacked by self-styled secretary general Sengezo Tshabangu and has since been singing in favour of Mnangagwas term extension.\n\nChamisa withdrew from the party and announced a sabbatical.\n\nIt is actually an indication that we no longer have opposition politics in the country, that is why you find war veterans have stepped in to provide checks and balances.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter LATE President Robert Mugabe’s spokesperson Jealousy Mawarire has come out in support of a constitutional court application by disgruntled war veterans who are challenging the legality of President Emmerson Mnangagwa’s Lands Tenure Implementation Committee. The Committee, led by businessman Kudakwashe Tagwirei, seeks to establish freehold on agricultural land despite clear constitutional provisions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-led-land-tenure-committee-a-coterie-of-looters-mawarire/\">Tagwirei-led Land Tenure Committee a coterie of looters – Mawarire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "28 May 2025"
        }
    ]
}