{
    "news": [
        {
            "title": "AU ambassador hires Florida lobbyists in bid to get Trump to lift Zim sanctions",
            "url": "https://www.newzimbabwe.com/au-ambassador-hires-florida-lobbyists-in-bid-to-get-trump-to-lift-zim-sanctions/",
            "content": "News24\n\nThe African Unions (AU) mission to the US has engaged the services of a Florida-based lobby group to urge the Trump administration to lift targeted sanctions on senior Zimbabwean officials, including that of the countrys, President Emmerson Mnangagwa.\n\nA Foreign Agents Registration Act (FARA) filing from December last year shows that the AU mission engaged lobby group Ford and London Global Strategies, in a bid to lift targeted sanctions on Zimbabwe and foster a renewed partnership between the US and Zimbabwe.\n\nZimbabwe and the AU have long called for all sanctions to be lifted.The FARA filing shows that the AUs mission is optimistic that the Trump administration might be more receptive to this request than the Biden White House.\n\nAU ambassador to the US, Hilda Suka-Mafudze, wrote in an email to the lobby group last year that lifting sanctions on Zimbabwean individuals and entities would benefit the US by securing vital resources, creating economic opportunities for US businesses, and reasserting American leadership in southern Africa.\n\nShe pitched the idea that bilateral trade and investment agreements could prioritise US businesses under the America First strategy, ensuring US firms have preferential access to Zimbabwes markets and resources. Suka-Mafudzes email sets out the key messages she wants the lobby group to take to its meeting with team Trump. One of her proposals includes the line: Countering Chinese Influence.\n\nSuka-Mafudze writes that the US could benefit from Zimbabwes strategic location in Southern Africa, its critical minerals, and its workforce while reducing the regions dependence on Chinese investments. Aligning with Zimbabwe could counterbalance Chinas growing influence in the region and open avenues for US investments in agriculture, mining, and infrastructure, she adds.\n\nChina is one of Zimbabwes largest trading partners. According to the Chinese Embassy in Zimbabwe, bilateral trade between China and Zimbabwe was upwards of $3.8bn, in 2024.\n\nThe US first sanctioned Zimbabwe in 2001 under the Zimbabwe Democracy and Economic Recovery Act. This suite of sanctions was based on allegations of political repression, election rigging, land seizures, and corruption under former President Robert Mugabe.\n\nFormer US President Joe Biden ended this sanctions programme in March last year, unblocking all individuals, entities, and property previously affected.\n\nHowever, the US then proceeded to impose new targeted sanctions under the Global Magnitsky Programme on 11 individuals and three entities.\n\nThose sanctioned included Zimbabwean President Emmerson Mnangagwa, first lady Auxillia Mnangagwa, and first Vice-President Constantino Chiwenga.\n\nThe US has hit back against claims that the sanctions are responsible for Zimbabwes economic woes, saying they target only a handful of Zimbabweans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>News24 The African Union’s (AU) mission to the US has engaged the services of a Florida-based lobby group to urge the Trump administration to lift targeted sanctions on senior Zimbabwean officials, including that of the country’s, President Emmerson Mnangagwa. A Foreign Agents Registration Act (FARA) filing from December last year shows that the AU mission</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/au-ambassador-hires-florida-lobbyists-in-bid-to-get-trump-to-lift-zim-sanctions/\">AU ambassador hires Florida lobbyists in bid to get Trump to lift Zim sanctions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "Chinese doctors to provide free surgeries for 600 cataract patients in Zimbabwe",
            "url": "https://www.newzimbabwe.com/chinese-doctors-to-provide-free-surgeries-for-600-cataract-patients-in-zimbabwe/",
            "content": "Xinhua\n\nA total of 600 cataract patients in Zimbabwe will receive free surgeries from Chinese doctors under the China-aided Bright Journey program.\n\nA team of 12 doctors from Chinas Hunan Provincial Peoples Hospital will perform the surgeries from Feb. 23 to March 1 in Harare, Zimbabwes capital, Hong Xiuqin, the team leader, told Xinhua on Wednesday.\n\nScreening for eligible patients began on Feb. 12 and is currently underway, Hong said, adding that the Chinese medical team will collaborate with local doctors, provide on-site training, and engage in academic exchanges with Zimbabwean healthcare personnel.\n\nThe program marks the 45th anniversary of diplomatic relations between China and Zimbabwe and the 40th anniversary of bilateral medical cooperation.\n\nHong said the program aims to foster cooperation and exchanges between the two countries by bringing light and hope to Zimbabwean patients.\n\nThe incidence of cataracts in Zimbabwe is high, and we are concerned about the health of the Zimbabwean people, she said, adding that the Chinese government attaches great importance to the cooperation and friendship between China and Zimbabwe.\n\nBoniface Macheka, head of ophthalmology at Parirenyatwa Group of Hospitals, praised the initiative as a testament to Zimbabwe-China relations.\n\nThere is a historical basis to the relationship between our country and China. I believe this relationship is going to be further solidified by this program, he told Xinhua.\n\nHe expressed hope for more bilateral medical collaborations in the future. We hope to be able to increase the diversity of the surgeries that we do at this hospital so that well be able to serve our people better and to make the services more available, he said.\n\nAmos Chakaza, a 67-year-old patient, traveled over 170 km from Manicaland Province to Harare for screening. I cant wait for my vision to be clear since I have a lot of responsibilities. Having poor eyesight is detrimental to my work. I need to see clearly to be more productive, Chakaza said.\n\nHunan has implemented numerous medical projects in Zimbabwe over the years, including initiatives for maternal and child health, schistosomiasis prevention and treatment, and traditional Chinese medicine training.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/20044441/cataract.jpg",
            "description": "<p>Xinhua A total of 600 cataract patients in Zimbabwe will receive free surgeries from Chinese doctors under the China-aided “Bright Journey” program. A team of 12 doctors from China’s Hunan Provincial People’s Hospital will perform the surgeries from Feb. 23 to March 1 in Harare, Zimbabwe’s capital, Hong Xiuqin, the team leader, told Xinhua on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-doctors-to-provide-free-surgeries-for-600-cataract-patients-in-zimbabwe/\">Chinese doctors to provide free surgeries for 600 cataract patients in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "Tshabangu expelled from CCC for bringing party into disrepute, disrespecting office of the opposition’s president; labels the Disciplinary Committee a “charade”",
            "url": "https://www.newzimbabwe.com/tshabangu-expelled-from-ccc-for-bringing-party-into-disrepute-disrespecting-office-of-the-oppositions-president-labels-the-disciplinary-committee-a-charade/",
            "content": "By Costa Nkomo\n\nThe Welshman Ncube-led Citizens Coalition for Change (CCC) announced on Wednesday that self-appointed party secretary general Sengezo Tshabangu had been expelled from the party for violating the party constitution.\n\nFollowing the 2023 elections, Tshabangu began purging CCC members of parliament and councillors understood at the time to be close allies of the then-party leader Nelson Chamisa, claiming that they had ceased to be party members.\n\nCritics and analysts maintain that it appeared Tshabangu was playing a long game, in cahoots with President Emmerson Mnangagwas Zanu PF, to hijack the CCC party then led by Chamisa after the latter refused to acknowledge Mnangagwas 2023 election victory, citing irregularities which were also recorded in several election observer mission reports.\n\nNcubes CCC charged Tshabangu with four counts and found him guilty on all four.\n\nIn a statement issued on Wednesday, party spokesperson Willias Madzimure said that Tshabangu had contravened the party constitution clause 9.1.2.3.\n\nMadzimure stated that in November and December, Tshabangu had made changes to CCC Parliamentary Portfolio holders without the authority of the President or any organ of the party. He said Tshabangu had breached the partys constitution rules and regulations in that he brazenly defied the authority of the President of the CCC, the National Standing Committee, the National Executive Committee, and the National Council.\n\nOn the second count, Tshabangu was found guilty of making public pronouncements on changes to party representatives in parliament without first seeking the approval of the President of the CCC or its organs, namely the National Standing Committee, the National Executive Committee, and the National Council.\n\nOn the third count, the CCC stated that Tshabangu had brought the name and reputation of the party into disrepute by making changes in Parliament without the approval of the party organs.\n\nOn the fourth count, Tshabangu was found guilty of disrespecting the office of the President of the CCC and its organs by making derogatory remarks in the public media, where he made statements after his suspension from the party.\n\nHaving found Sengezo Tshabangu guilty of all the charges, and having regard to the gravity of the acts of misconduct of which the Committee convicted him, the Committee decided to sentence him to expulsion from the party with immediate effect, part of Madzimures statement reads.\n\nMadzimure added that he was uncertain whether Tshabangu would appeal, but implied that this expulsion could follow to give him a taste of his own medicine because he was the one who started the purging of party representatives from Parliament and local authorities.\n\nNewZimbabwe.com made efforts to reach Tshabangu, but he did not answer his mobile phone.\n\nHowever, one of his lawyers, Kucaca Phulu, confirmed that Tshabangu had appeared before the CCC party Disciplinary Committee but said he was not the one who spoke on behalf of Tshabangu and directed questions to fellow lawyer Nqobani Sithole.\n\nWhen reached for comment, Sithole rubbished the disciplinary Committee, its verdict, and its sentence, describing it as a charade. They do not have that power. They do not have structures. Structures that can exercise that power are not in existence at the moment. It is a charade, he stated.\n\nWhen asked why Tshabangu had appeared before a committee that he described as a charade, Sithole said his client had appeared to simply tell them that they are a charade.\n\nLast December, Ncubes group dragged Tshabangu to the High Court for pronouncing parliamentary changes without consulting his party organs. The High Court ruled in favour of Ncubes group before Tshabangu appealed the same ruling at the Supreme Court. The matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Costa Nkomo The Welshman Ncube-led Citizens Coalition for Change (CCC) announced on Wednesday that self-appointed party secretary general Sengezo Tshabangu had been expelled from the party for violating the party constitution. Following the 2023 elections, Tshabangu began purging CCC members of parliament and councillors understood at the time to be close allies of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tshabangu-expelled-from-ccc-for-bringing-party-into-disrepute-disrespecting-office-of-the-oppositions-president-labels-the-disciplinary-committee-a-charade/\">Tshabangu expelled from CCC for bringing party into disrepute, disrespecting office of the opposition’s president; labels the Disciplinary Committee a “charade”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "Zimbabwe compensating ex-white farmers for ‘developments’ while ignoring the Africans who worked on the land – says CCC MP",
            "url": "https://www.newzimbabwe.com/zimbabwe-compensating-ex-white-farmers-for-developments-while-ignoring-the-africans-who-worked-on-the-land-says-ccc-mp/",
            "content": "By Darlington Gatsi\n\nCITIZENS Coalition for Change (CCC) legislator Darlington Chigumbu has said that the governments initiative to compensate former white farmers overlooks the disadvantaged black workers who toiled on the farms.\n\nThe government recently announced that it is disbursing US$20 million to farmers who were displaced as a result of the land reform process aimed at addressing historical injustices in the early 2000s.\n\nThe 94 farmers, hailing from countries such as Switzerland and Germany, are covered under Bilateral Investment Protection and Promotion Agreements (BIPPAs) that Zimbabwe signed with the farmers countries of origin.\n\nFinance Minister Mthuli Ncube said that the compensation is for the developments the farmers carried out on the farms prior to their displacement.\n\nSpeaking in the National Assembly recently, Chigumbu argued that the programme is ignoring the historical injustices suffered by native workers while developing the farms.\n\nIt is a good thing that our country is honouring its commitments. I would want to bring to the attention of this House that we need to be cognisant of the fact that there are some historical injustices that happened as these people acquired the land. It is a good thing that the Ministry is saying they are paying these people for the developments that were made on the land that was repossessed around 2000.\n\nHowever, they should also not be blind to the fact that the developments that these people are now being paid for, actually came as a result of labour practises that were near to slavery and our grandfathers are no longer there to be part and parcel or to also claim with these farmers to say they also contributed to the development of that particular piece of land as well as not being treated fairly.\n\nIt is also sad that this whole arrangement seems not to be taking into consideration these people who participated in the development of these particular pieces of land, said Chugumbu.\n\nThe government has faced criticism from opposition groups for compensating landowners whose land was forcibly taken from local inhabitants during the colonial era.\n\nChigumbu further suggested that there should be a mechanism to ensure that the native workers who laboured on these farms are also compensated.\n\nThe third aspect is that when the land was re-distributed, the big guys are the ones who took parts of the farm land which was properly developed and l can tell that they are not part and parcel of this whole arrangement.\n\nMy prayer is that can this arrangement include a model whereby these people who are going to receive the payments of the developments that they have done on these pieces of land also pay the people who worked on these pieces of land, which they were not paid fairly during the time they were working on these pieces of land?\n\nI understand most of these people are no longer alive but is it not also prudent Mr. Speaker Sir, to say that they can give back to the communities where their farms are located so that they can also pay something? The reason would be because they are now benefiting from something they did not pay for in as much as we are talking about the developments that were done on the pieces of land that they are now being paid for, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/16155649/farm.jpg",
            "description": "<p>By Darlington Gatsi CITIZENS Coalition for Change (CCC) legislator Darlington Chigumbu has said that the government’s initiative to compensate former white farmers overlooks the disadvantaged black workers who toiled on the farms. The government recently announced that it is disbursing US$20 million to farmers who were displaced as a result of the land reform process</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-compensating-ex-white-farmers-for-developments-while-ignoring-the-africans-who-worked-on-the-land-says-ccc-mp/\">Zimbabwe compensating ex-white farmers for ‘developments’ while ignoring the Africans who worked on the land – says CCC MP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "Govt suspends Urban Connect’s operating license for six months after Masvingo-Beitbridge road accident which killed 25",
            "url": "https://www.newzimbabwe.com/govt-suspends-urban-connects-operating-license-for-six-months-after-masvingo-beitbridge-road-accident-which-killed-25/",
            "content": "By Thandiwe Garusa\n\nTHE government has, with immediate effect, suspended Urban Connect Holdings Pvt Ltd operating license for six months pending investigations after one of its buses was involved in a fatal accident last week, which killed 25 people.\n\nThe accident, which occurred along the Masvingo-Beitbridge Highway, was reportedly caused by reckless driving, with eyewitnesses stating that the Urban Connect driver was speeding.\n\nMore than 30 people were seriously injured in the accident.\n\nIn a statement on Wednesday, Transport and Infrastructural Development Minister Felix Mhona said the bus did not have a valid passenger insurance policy or route permit, and its driver had not met the re-test requirement, violating multiple transport regulations.\n\nAll omnibus operations by the companyin all the routes have been put in hold.\n\nIn light of these violations, I have directed the Commissioner of Road Motor Transportation to invoke the provisions of Section 17(b)(i) of the Road Motor Transportation Act [Chapter 13:15] and suspend, with immediate effect, Urban Connect (Pvt) Ltd from operating all its omnibuses on all routes for a period of six months as we further investigate, Mhona said.\n\nMhona also said that, in response to rising road fatalities, he will enforce stricter traffic and safety regulations to protect the public.\n\nIn view of the incessant road fatalities being recorded on our roads, I have taken a bold stance to reduce road carnage as the minister responsible for administering laws and regulations on road traffic and safety management.\n\nGoing forward, we shall build on this momentum of strict enforcement of road motor transportation and safety regulations for the safety and well-being of the people, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13112930/urban-connect.jpeg",
            "description": "<p>By Thandiwe Garusa THE government has, with immediate effect, suspended Urban Connect Holdings Pvt Ltd operating license for six months pending investigations after one of its buses was involved in a fatal accident last week, which killed 25 people. The accident, which occurred along the Masvingo-Beitbridge Highway, was reportedly caused by reckless driving, with eyewitnesses</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-suspends-urban-connects-operating-license-for-six-months-after-masvingo-beitbridge-road-accident-which-killed-25/\">Govt suspends Urban Connect’s operating license for six months after Masvingo-Beitbridge road accident which killed 25</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "ZACC arrests Zanu PF councillor, cop for stealing agricultural inputs",
            "url": "https://www.newzimbabwe.com/zacc-arrests-zanu-pf-councillor-cop-for-stealing-agricultural-inputs/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has arrested a Zanu PF councillor and a Karoi-based police officer on allegations of stealing presidential agricultural inputs and Agriculture Rural Development Authority (ARDA) inputs respectively.\n\nThe councillor is Chishamiso Linda Ellah who represents Makoni ward 11.\n\nThe police officer is Gideon Msambakurima.\n\nThe incidents happened separately.\n\nChishamiso was arrested alongside Enita Choga, a former Grain Marketing Board (GMB) employee, and Crispen Makoni.\n\nThey have since appeared Mutare Magistrate, Annie Ndiraya and were remanded out of custody on US$200.00 bail each.\n\nThey face a charge of theft as defined in Section 113 of the Criminal Law Codification and Reform Act, Chapter 9:23.\n\nThe trio allegedly conspired to divert 400 bags of 50kg fertiliser worth US$12 000.00 and sold to buyers in Rusape, said ZACC in a statement.\n\nTalent Nyamuzuwe prosecuted.\n\nMsambakurima, a 39-year-old officer stationed in Karoi was arrested by ZACC on allegations of defrauding ARDA of over US$4 700 in fertiliser supplies.\n\nMsambakurima appeared before Provincial Magistrate, Vakai Douglas Chikwekwe at Chinhoyi Magistrates Court and was remanded to 4 March 2025 on US$200.00 bail.\n\nRepresenting the state, Brian Machekera alleged that the accused joined the ARDA Joint Venture Farming programme and was given 8 metric tons of Calcium Ammonium Nitrate fertiliser for his 20-hectare maize plot.\n\nWeeks later, he allegedly used the same batch number to obtain an additional 6 metric tons of Windmill Ammonium Nitrate fertiliser, despite having exhausted his allocation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Anti-Corruption Commission (ZACC) has arrested a Zanu PF councillor and a Karoi-based police officer on allegations of stealing presidential agricultural inputs and Agriculture Rural Development Authority (ARDA) inputs respectively. The councillor is Chishamiso Linda Ellah who represents Makoni ward 11. The police officer is Gideon Msambakurima. The incidents happened separately.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-arrests-zanu-pf-councillor-cop-for-stealing-agricultural-inputs/\">ZACC arrests Zanu PF councillor, cop for stealing agricultural inputs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "EcoCash Holdings to rebrand as Nyambirai assumes 53,3% in Steward Bank",
            "url": "https://www.newzimbabwe.com/ecocash-holdings-to-rebrand-as-nyambirai-assumes-533-in-steward-bank/",
            "content": "By Alois Vinga\n\nECOCASH Holdings Limited says it will soon rebrand as Steward Bank is now the only remaining unit under its purview following the takeover by businessman Tawanda Nyambirai.\n\nIn a joint public announcement by Econet Wireless Zimbabwe (EWZ) and Ecocash informed the market thatin April 2024, a Scheme of Reconstruction was entered into whereby all the Financial Technology Businesses except Steward Bank were transferred to EWZ.\n\nThe units transferred are VAYA Technologies Zimbabwe (Private) Limited, Econet Insurance (Private) Limited, Econet Life (Private) Limited, MARS Zimbabwe (Private) Limited and Maisha Health Fund (Private) Limited.\n\nAs a result of this reorganisation, EcoCash Holdings Zimbabwe Limited retained its status as a Bank Holding Company with Steward Bank Limited as its only asset. EcoCash Holdings Zimbabwe Limited is in the process of changing its name to remove the reference to EcoCash as the Company no longer owns EcoCash and the other Fintech businesses, the joint statement said.\n\nTN acquired 53.3% of the Bank Holding Company of which 25% was already held in line with Banking Act and Regulations and the remaining 28.3%, is subject to a pending Application to the Registrar of Banks to hold in excess of the permitted 25% limit, before beneficial ownership is transferred.\n\nEWZ and Econet Global Limited currently have a shareholding position in the Bank Holding Company of 12.4% and 12.5% respectively and intend to maintain a strategic shareholding in the Bank Holding Company.\n\nThe Fintech businesses have been operating as subsidiaries of Econet Wireless Zimbabwe Limited since April 2024. Their performance was reported in the Companys public Financial Reports for the half year ended August 2024 under the Mobile Money and Insurance segments.\n\nMr Eddie Chibi continues as Chief Executive Officer of the Financial Technology Businesses that are now held as subsidiaries of Econet Wireless Zimbabwe Limited. All existing Fintech, Mobile Money and Banking services operations continue uninterrupted, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/16060727/Steward-Bank.jpg",
            "description": "<p>By Alois Vinga ECOCASH Holdings Limited says it will soon rebrand as Steward Bank is now the only remaining unit under its purview following the takeover by businessman Tawanda Nyambirai. In a joint public announcement by Econet Wireless Zimbabwe (EWZ) and Ecocash informed the market that in April 2024, a Scheme of Reconstruction was entered into</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ecocash-holdings-to-rebrand-as-nyambirai-assumes-533-in-steward-bank/\">EcoCash Holdings to rebrand as Nyambirai assumes 53,3% in Steward Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "Hurungwe man kills wife, niece and village head",
            "url": "https://www.newzimbabwe.com/hurungwe-man-kills-wife-niece-and-village-head/",
            "content": "By Mary Taruvinga\n\nA Hurungwe man has been arrested on allegations of killing his wife, niece and their village head in cold blood in a space of two days.\n\nThe suspect is Trymore Tore aged 37.\n\nPolice say their preliminary investigations have established that Tore and his wife were having domestic disputes and their village head Kuwesu Masawu, 56, got into crossfire after he tried mediate between the couple.\n\nThe bodies of the three victims were found dead on 17th February 2025 at Mubairecheni Village, Chundu, Hurungwe.\n\nThe first victim who is the suspects wife, Moline Chibayanzara (21), was found dead in a pit latrine with multiple injuries on the head.\n\nThe body was wrapped in a blue blanket, police spokesperson Paul Nyathi said in a statement.\n\nThe second victim, a 17-year-old female juvenile, who is the suspects niece was discovered about 60 metres from Tores homestead with a swollen head and a cut on the forehead.\n\nThe body was covered with tree branches and a knife was recovered beside the body.\n\nThe third victim Musawuwho was the village head, was discovered buried in a shallow grave behind the suspects house with a decapitated head and a deep cut on the neck.\n\nAccording to Nyathi, Tore and his wife were allegedly heard by villagers quarrelling at their homestead on 15th February 2025.\n\nMasawu was last seen going to the suspects homestead to mediate a dispute between the couple, while the second suspect was also last seen going to the suspects homestead to watch movies on 16 February 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga A Hurungwe man has been arrested on allegations of killing his wife, niece and their village head in cold blood in a space of two days. The suspect is Trymore Tore aged 37. Police say their preliminary investigations have established that Tore and his wife were having domestic disputes and their village</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hurungwe-man-kills-wife-niece-and-village-head/\">Hurungwe man kills wife, niece and village head</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "Police officer convicted of criminal abuse of office",
            "url": "https://www.newzimbabwe.com/police-officer-convicted-of-criminal-abuse-of-office/",
            "content": "By Staff Reporter\n\nA ZIMBABWE Republic Police (ZRP) officer has been convicted of criminal abuse of office afterletting off the hook a suspect.\n\nPolice Assistant Inspector Emmanuel Kumbani, who was member-in-charge of crime at Kariba Urban Police Station, appeared at Chinhoyi Magistrates Court Tuesday.\n\nThe State proved that Kumbani unlawfully released a detainee, Tinotenda Tsongora, and a crucial exhibit, a Samsung A15 smartphone crucial to a robbery investigation.\n\nIt was further heard that the accused person falsely documented that Tsongora had been transferred to court. By so doing, the senior cop obstructed the course of justice and undermined the case filed by the complainant, Godknows Simunye.\n\nUpon conviction, the senior police officer was sentenced to 24 months imprisonment, with six months suspended on condition of good behaviour. The remaining 18 months were committed to 630 hours of community service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/22025202/Chinhoyi-Magistrates-Court.jpeg",
            "description": "<p>By Staff Reporter A ZIMBABWE Republic Police (ZRP) officer has been convicted of criminal abuse of office after letting off the hook a suspect. Police Assistant Inspector Emmanuel Kumbani, who was member-in-charge of crime at Kariba Urban Police Station, appeared at Chinhoyi Magistrates’ Court Tuesday. The State proved that Kumbani unlawfully released a detainee, Tinotenda Tsongora,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-convicted-of-criminal-abuse-of-office/\">Police officer convicted of criminal abuse of office</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        },
        {
            "title": "A$AP Rocky not guilty of firearm assault on LA street",
            "url": "https://www.newzimbabwe.com/aap-rocky-not-guilty-of-firearm-assault-on-la-street/",
            "content": "BBC\n\nRapper A$AP Rocky has been found not guilty of firing a gun at a former friend.\n\nA jury in Los Angeles acquitted the musician, whose legal name is Rakim Mayers, on two felony assault charges that carried up to 24 years in prison.\n\nTerell Ephron claimed the Grammy-nominated hip-hop star opened fire at him during an argument on a Hollywood street on 6 November 2021, grazing his knuckles with one of the shots.\n\nMr Mayers, who is also a fashion mogul and the longtime partner of pop star Rihanna, denied the charges, arguing that the weapon was a prop gun and that his former friend, who calls himself A$AP Relli, was only after money.\n\nAs the first not-guilty verdict was read on Tuesday, the court rang with screams and clapping. Mr Mayers rushed towards his family and Rihanna, who were seated behind him. He dived over a wooden barrier to embrace them.\n\nRihanna had been a repeated presence in court during the trial, and for Tuesdays verdict, brought along their two sons, two-year-old RZA and one-year-old Riot.\n\nMr Mayers also hugged his lawyers and appeared to have tears in his eyes as the second not-guilty verdict was read.\n\nThank God for saving my life, Mr Mayers said aloud. He thanked members of the 12-person jury.\n\nThe rapper was arrested on the two felony assault charges after a heated argument with his former friend in the heart of Hollywood.\n\nMr Mayers and Mr Ephron have known each other since high school in New York and were part of the A$AP Mob hip-hop collective.\n\nTheir friendship cooled as A$AP Rockys career took off.\n\nAuthorities said Mr Ephron met Mr Mayers on 6 November 2021, a day after the pair had a disagreement, outside a hotel about a block from the iconic Hollywood Walk of Fame.\n\nAn altercation ensued.\n\nMr Mayers was alleged to have pulled out a gun from his waistband and pointed it at Mr Ephron, telling him: Ill kill you right now.\n\nHe looked me in my eyes and pointed the gun at me, Mr Ephron testified.\n\nMr Ephron said he told the rapper to fire the weapon, but Mr Mayers started walking away. As he left, Mr Ephron followed, shouting at him.\n\nProsecutors alleged that at this point, Mr Mayers once again pulled out the gun and fired multiple shots, with one bullet said to have grazed Mr Ephrons knuckles.\n\nMuch of the trial hinged on whether the firearm in question was a harmless prop gun, as Mr Mayerss defence said, or a real weapon capable of causing harm, as Mr Ephron and prosecutors alleged.\n\nThe weapon has not been recovered by authorities.\n\nJurors were able to watch some footage of the altercation because parts were captured on surveillance video, including audio of gunfire, but no video evidence directly showed any shooting.\n\nMr Ephron took two days before reporting the incident to authorities and brought shell casings he said he had retrieved from the scene.\n\nBut police who responded to reports of a shooting in the area did not locate any shell casings. Mr Ephron, who said he returned with his girlfriend hours later, said he knew exactly where to look, but no surveillance footage corroborates his account.\n\nHe was not admitted to hospital in Los Angeles and instead went for medical treatment after flying back to New York.\n\nLawyers for Mr Mayers suggested that Mr Ephron had planted the shell casings to frame the rapper.\n\nThe trial was marked by emotional and combative exchanges, particularly when Mr Ephron  the trials star witness  took the stand.\n\nAt one point, Mr Ephron called Mr Tacopina  a defence attorney for Mr Mayers  annoying, which led to a reprimand from the judge.\n\nAnother witness, A$AP Twelvyy, was asked by prosecutors about a photograph showing Mr Mayerss bed with the letters AWGE emblazoned on the furniture.\n\nWhen asked what that stood for, Mr Mayers unexpectedly interrupted the proceedings and yelled, Dont say! Twelvyy ultimately refused to elaborate.\n\nOutbursts from defendants during trials are uncommon, especially in front of a jury.\n\nHowever, for a criminal suspect on trial to interject and instruct a witness not to answer a prosecutors question during cross-examination is something nearly unheard of in a court.\n\nThe rapper is set to release his first solo album in nearly a decade and is scheduled to co-headline Los Angeles Rolling Loud festival in March 2025.\n\nAdditionally, he stars alongside Denzel Washington in Spike Lees upcoming film Highest 2 Lowest, due to be released the coming months.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/19124736/asap.webp",
            "description": "<p>BBC Rapper A$AP Rocky has been found not guilty of firing a gun at a former friend. A jury in Los Angeles acquitted the musician, whose legal name is Rakim Mayers, on two felony assault charges that carried up to 24 years in prison. Terell Ephron claimed the Grammy-nominated hip-hop star opened fire at him</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/aap-rocky-not-guilty-of-firearm-assault-on-la-street/\">A$AP Rocky not guilty of firearm assault on LA street</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "20 Feb 2025"
        }
    ]
}