{
    "news": [
        {
            "title": "Chris Brown sues Warner Bros over documentary’s sex assault claims",
            "url": "https://www.newzimbabwe.com/chris-brown-sues-warner-bros-over-documentarys-sex-assault-claims/",
            "content": "BBC\n\nMusician Chris Brown says hes suing a film studio over a documentary released last year which included accusations of sexual assault.\n\nChris Brown: A History of Violence was released by Warner Bros in October and featured testimony from an anonymous dancer who claimed he raped her on a yacht in 2020.\n\nIn a statement, the Forever singers lawyers say the film is defamatory, and her claims were baseless and sensationalised, accusing Warner Bros of recklessly damaging his reputation.\n\nAs well as Warner Bros, the lawsuit also names production company Ample. Neither firm responded when contacted for comment by BBC Newsbeat.\n\nChris Browns lawyers say he is seeking $500m (405m), after filing the complaint at a court in Los Angeles on Tuesday.\n\nThe statement goes on to say that his lawyers had told producers the allegations  which also included evidence tampering  were misleading and discredited but that Warner Bros proceeded to release the documentary without regard for Mr Brown, prioritising profits over journalistic integrity.\n\nIn a copy of the complaint, seen by BBC Newsbeat, Chris Browns lawyers cast doubt on the dancers reliability as a witness and highlight three claims in the documentary which they say are false.\n\nThese include a comment that he has a predisposition for punching women in the face, the dancers allegation he raped her and a claim he manipulated or deleted texts between them before sharing them with police.\n\nLawyers say the documentary states in every available fashion that he is a serial rapist and sexual abuser.\n\nThe allegations are said to have caused him emotional distress as well as significant harm to [his] reputation, career and business opportunities.\n\nThe documentary has, they say, irreparably tarnished [his] career and standing in the public eye.\n\nChris Brown first faced allegations from the dancer, known in court and in the documentary as Jane Doe, in 2022 when she sued him for $20m (14.9m).\n\nHer lawsuit claimed he drugged and raped her during a party on a yacht at a property owned by Sean Diddy Combs in Miami, Florida.\n\nBut the case was reportedly dismissed by a judge.\n\nThe 35-year-old has had a history of well-documented legal troubles.\n\nIn 2014, hepleaded guilty to punching a man outside a hotelin Washington DC while he was taking a photo with two women.\n\nTwo years later,a model claimed he assaulted her at a Las Vegas casino, however police said there was not enough evidence to bring charges.\n\nA court also ordered him tostay away from ex-girlfriend Karrueche Tranin 2017 after she claimed he threatened to kill her.\n\nLast years documentary also examined other allegations against Chris Brown including a rape inquiry in Paris  in which he was released without charge  and assaulting then-girlfriend Rihanna in 2009, which he pleaded guilty to.\n\nHis lawyers say hes never been found at fault for any type of sexual crime.\n\nTheir [Warner Bros and Amples] actions undermine not only Mr Browns decade-long efforts to rebuild his life but also the credibility of true survivors of violence, his lawyer Levi McCathern says.\n\nChris Brown says a portion of any damages would be donated to survivors of sexual violence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/22162924/chris-brown.webp",
            "description": "<p>BBC Musician Chris Brown says he’s suing a film studio over a documentary released last year which included accusations of sexual assault. Chris Brown: A History of Violence was released by Warner Bros in October and featured testimony from an anonymous dancer who claimed he raped her on a yacht in 2020. In a statement,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chris-brown-sues-warner-bros-over-documentarys-sex-assault-claims/\">Chris Brown sues Warner Bros over documentary’s sex assault claims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Kenny Ndebele steps down as Premier Soccer League CEO",
            "url": "https://www.newzimbabwe.com/kenny-ndebele-steps-down-as-premier-soccer-league-ceo/",
            "content": "By Sport Reporter\n\nAspiring ZIFA Vice President Kenny Ndebele has resigned as the Premier Soccer League Chief Executive Officer.\n\nNdebeles resignation was announced by the Premier Soccer League on Wednesday.\n\nThe Premier Soccer League (PSL) wishes to inform all stakeholders that the PSL Chief Executive Officer, Mr Kennedy Ndebele has resigned from his position, effective 24 January 2025.\n\nWe would like to take this opportunity to thank Mr Ndebele for his outstanding leadership and dedicated service to the PSL.\n\nHis contributions were crucial indriving the leagues growth and achieving its success. We wish him all the bestin his future endeavours, read part of PSLs statement.\n\nNdebele is now setting his eyes onZIFA where he is one of the candidates contesting for the Vice Presidentspostin Saturdaypolls.\n\nRodwell Thabe will be taking over from Ndebele on an interim basis.\n\nIn the interim, Mr Rodwell Thabe will assume the role of Acting Chief Executive officer to ensure the continued smooth operation of the League, further read the statement.\n\nThe Premier Soccer League is set for elections in March which will see the voting into power of a new executive to take over from the previous one which was chaired by Farai Jere who resigned in December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/03/27113635/PSL-CEO-Kenny-Ndebele.png",
            "description": "<p>By Sport Reporter Aspiring ZIFA Vice President Kenny Ndebele has resigned as the Premier Soccer League Chief Executive Officer. Ndebele’s resignation was announced by the Premier Soccer League on Wednesday. “The Premier Soccer League (PSL) wishes to inform all stakeholders that the PSL Chief Executive Officer, Mr Kennedy Ndebele has resigned from his position, effective</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenny-ndebele-steps-down-as-premier-soccer-league-ceo/\">Kenny Ndebele steps down as Premier Soccer League CEO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mozambique opposition leader open to serving in rival’s government",
            "url": "https://www.newzimbabwe.com/mozambique-opposition-leader-open-to-serving-in-rivals-government/",
            "content": "BBC\n\nMozambiques main opposition leader Venncio Mondlane has told the BBC he is prepared to serve in the government if President Daniel Chapo meets his demands to end the political crisis that has hit the country following disputed elections.\n\nChapo said he had set up a team that was considering whether his rival should be invited to join a new inclusive government.\n\nThe two men outlined their positions in separate interviews with the BBC, giving the impression that they were open to rapprochement after the deaths of about 300 people in post-election unrest.\n\nMondlane rejected his defeat in Octobers election, saying the result was rigged  something that Chapo denied.\n\nMozambiques highest court declared Chapo the winner with 65% of the vote to Mondlanes 24%.\n\nChapo was the candidate of the ruling Frelimo party, as his predecessor, Filipe Nyusi, had to step down after serving two terms in office.\n\nChapo was officially sworn in as president on 15 January, about a week after Mondlane held his own inauguration to declare himself the peoples president.\n\nMondlane told the BBC that Chapo was forced on the nation, and was the president of the defence force.\n\nMondlane said that he had, nevertheless, decided to suspend protests for the first 100 days of his rivals term on condition he did the following:\n\nMondlane said that if Chapo agreed to this, he would open a window for negotiations or else he would call on his supporters to renew protests.\n\nAsked whether he was prepared to work in Chapos government, Mondlane replied: Yes, if he has a genuine interest to work with me. Hes got a chance to invite me to the table of dialogue.\n\nEPA Daniel Chapo has promised to heal divisions created by the election\n\nIn his interview with the BBC, Chapo said he wanted to govern in an inclusive way, and to introduce reforms to address concerns about the electoral law, human rights and freedom of expression.\n\nHe said talks were currently taking place with opposition parties represented in the new parliament, and they would later be widened to include all segments of society.\n\nChapo added that he wanted to form a government that was open to all Mozambicans, but he wanted to stress that the profile of the people is very important.\n\nAsked whether he believed Mondlane qualified to serve in government, Chapo replied: It will depend because there is a team that is right now considering that, on the profile of the people, their competencies, their meritocracy, the patriotism  all these pre-requisites that Im alluding to.\n\nIf the team reaches the conclusion that these people have the right profile, they will be part of the government. Those who do not have that profile will not take part.\n\nAged 47, Chapo was chosen by Frelimo, which has been in power since independence 49 years ago, as its candidate to rally young voters affected by high unemployment, and fed up with the partys decades-long rule.\n\nHe told the BBC that he wanted both local and foreign investment to increase in Mozambique in order to make the economy more dynamic.\n\nThis would help create jobs for young people so that they could build their homes, establish their families and stabilize their lives.\n\nMondlane, 50, was seen to have considerable support among young people after he rallied them during the election campaign with the slogan Save Mozambique  this country is ours.\n\nHe contested the poll as an independent after breaking away from the main opposition Renamo party.\n\nA small party that backed his candidacy won a few parliamentary seats in the election.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/21024647/venancio-mondlane-moza-scaled.jpg",
            "description": "<p>BBC Mozambique’s main opposition leader Venâncio Mondlane has told the BBC he is prepared to serve in the government if President Daniel Chapo meets his demands to end the political crisis that has hit the country following disputed elections. Chapo said he had set up a team that was “considering” whether his rival should be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambique-opposition-leader-open-to-serving-in-rivals-government/\">Mozambique opposition leader open to serving in rival’s government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Leadership is about decisions! Ex-minister slams ‘energy-sapping’ ED2030 campaign, praises Trump’s ‘bold’ decisions",
            "url": "https://www.newzimbabwe.com/leadership-is-about-decisions-ex-minister-slams-energy-sapping-ed2030-campaign-praises-trumps-bold-decisions/",
            "content": "By Thandiwe Garusa\n\nEXILED former Cabinet Minister Walter Mzembi has lauded USPresident Donald Trumps decisions to cut wasteful and unnecessary expenditures for the Americans contrasting them with Zimbabwes political priorities.\n\nTrumps immediate actions included withdrawing the United States from the Paris Climate Agreement and the World Health Organization (WHO).\n\nLeadership is about decisions! Yesterday after inauguration, Donald Trump made nearly 100 such decisions for the American people that resonated with many on the globe while offending some but putting America first, far-reaching decisions on gender ( recognizing male and female only; A complete Reset to Genesis), exiting Paris Climate Agreement ( a wasteful annual travel expedition for most governments with huge delegates appetite), exiting WHO ( whose disastrous COVID lock downs created more tender barons and impoverished billions) etc.\n\nI am still consumed with analysing the rest of the decisions but they are all cutting wasteful and unnecessary expenditures for the American public while bringing the factories and jobs home!\n\nZanu PF is pushing for the extension of Mnangagwas term in office and to delay the 2028 elections by two years, a move which Mzembi described as completely unproductive.\n\nIn Zimbabwe regrettably we are consumed with one decision called 2030, a completely unproductive, divisive and selfish decision on self-perpetuity and entitlement, and it shall be so for the next two years waking up to this energy-sapping medieval decision that will put us into an election mode hardly two years after emerging from one and three years to the next.\n\nWhen are we going to be making historical decisions like being the first country to mount our flag on Mars? What a mess ! Mzembi wrote on his X account.\n\nZimbabwe has been grappling with high inflation, unemployment, and persistent power shortages and critics have been saying that the government mostly focuses on perpetual electioneering at the expense of governance and development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Thandiwe Garusa EXILED former Cabinet Minister Walter Mzembi has lauded US President Donald Trump’s decisions to cut “wasteful and unnecessary” expenditures for the Americans contrasting them with Zimbabwe’s political priorities. Trump’s immediate actions included withdrawing the United States from the Paris Climate Agreement and the World Health Organization (WHO). “Leadership is about decisions! Yesterday after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/leadership-is-about-decisions-ex-minister-slams-energy-sapping-ed2030-campaign-praises-trumps-bold-decisions/\">Leadership is about decisions! Ex-minister slams ‘energy-sapping’ ED2030 campaign, praises Trump’s ‘bold’ decisions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "WHO begs the US to stay after Trump order",
            "url": "https://www.newzimbabwe.com/who-begs-the-us-to-stay-after-trump-order/",
            "content": "By Mary Taruvinga\n\nThe World Health Organisation (WHO) has urged the United States to reconsider its decision following the signing of an executive order to withdraw its support by President Donald Trump on Monday.\n\nTrump said the US would leave within 12 months accusing WHO of mishandling the COVID-19 pandemic among other health crises.\n\nIn a statement issued on Tuesday, WHO said it regrets the announcement that the US intends to withdraw from the Organisation.\n\nWe hope the United States will reconsider and we look forward to engaging in constructive dialogue to maintain the partnership between the USA and WHO, for the benefit of the health and well-being of millions of people around the globe, reads the statement.\n\nAccording to WHO, the US was a founding member of WHO in 1948 and has participated in shaping and governing WHOs work ever since, alongside 193 other Member States, including through its active participation in the World Health Assembly and Executive Board.\n\nFor over seven decades, WHO and the USA have saved countless lives and protected Americans and all people from health threats.\n\nTogether, we ended smallpox, and together we have brought polio to the brink of eradication. American institutions have contributed to and benefited from membership in WHO, it said.\n\nWHO also said with the participation of the US and other Member States, WHO has over the past seven years implemented the largest set of reforms in its history, to transform its accountability, cost-effectiveness, and impact in countries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/10/14193331/WHO-e1634236428236.jpg",
            "description": "<p>By Mary Taruvinga The World Health Organisation (WHO) has urged the United States to reconsider its decision following the signing of an executive order to withdraw its support by President Donald Trump on Monday. Trump said the US would leave within 12 months accusing WHO of mishandling the COVID-19 pandemic among other health crises. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/who-begs-the-us-to-stay-after-trump-order/\">WHO begs the US to stay after Trump order</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "No willing US$ sellers at Interbank Market – ZNCC",
            "url": "https://www.newzimbabwe.com/no-willing-us-sellers-at-interbank-market-zncc/",
            "content": "By Alois Vinga\n\nINDUSTRY lobby group, Zimbabwe National Chamber of Commerce (ZNCC) says the lack of willing US$ sellers at the Interbank Market continues to stifle the productive sectors capacity to deliver.\n\nThe Reserve Bank of Zimbabwe (RBZ) disbanded the Foreign Exchange Auction System in January 2024, in favour of the Willing Buyer Willing Seller (WBWS) model which it perceived then as the only way towards the creation of a truly reflective exchange rate market.\n\nTop industrialists have since castigated the new set-up, arguing instead that despite some of the Auction systems shortcomings, the initiative managed to keep the formal sector alive as it provided a channel to avail the much-needed greenback to oil operations.\n\nCurrently, several formal operating companies have raised alarm over critical US$ shortages almost threatening to push the sector into extinction.\n\nAdding a similar voice to the discourse, the ZNCCs latest State of Industry and Commerce tracker said the WBWS platforms structure is dominated by more forex buyers than sellers.\n\nAfter the January 2024 disbandment of the Auction System, some firms have been getting foreign currency on the interbank market on a Willing Buyer Willing Seller (WBWS) model.\n\nThe lack of willing sellers on the formal market has meant that the WBWS has not been able to meet the foreign currency demand by firms, thus curtailing the achievement of maximum productive capacity and in turn depressing general economic activities, the ZNCC report said.\n\nThe lobby group also took a swipe at the April 2024 introduced ZWG currency saying month-on-month inflation data, from May through to August 2014, gave an indication that prices have been relatively stable. ZNCC said It seemed that inflationary pressures had been contained as reflected in the month-on-month ZWG and US$ inflation rates.\n\nWhilst inflation statistics from ZimStat show that the US$ inflation rate for October 2024 was 0,7%, the ZiG inflation rate significantly increased. The ZWG month-on-month inflation rate was 37,2% in October 20124, gaining 31.4 points on the September 2024 rate of 5,8%.\n\nThis means that prices as measured by the all items ZWG CPI, increased by an average of 37,2% between September and October 2024, ZNCC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27170948/rbz_zimbabwe-min.jpg",
            "description": "<p>By Alois Vinga INDUSTRY lobby group, Zimbabwe National Chamber of Commerce (ZNCC) says the lack of willing US$ sellers at the Interbank Market continues to stifle the productive sector’s capacity to deliver. The Reserve Bank of Zimbabwe (RBZ) disbanded the Foreign Exchange Auction System in January 2024, in favour of the Willing Buyer Willing Seller</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-willing-us-sellers-at-interbank-market-zncc/\">No willing US$ sellers at Interbank Market – ZNCC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "Chief Justice Malaba orders ‘disrespectful’ traditional leaders to undergo ethical, legal training",
            "url": "https://www.newzimbabwe.com/chief-justice-malaba-orders-disrespectful-traditional-leaders-to-undergo-ethical-legal-training/",
            "content": "By Staff Reporter\n\nTHE Judicial Services Commission (JSC) has been ordered to train traditional leaders on ethical and legal standards, just over a month after Zimbabwe Lawyers for Human Rights (ZLHR) lodged a complaint and demanded action against Chief Nyamaropas disrespectful conduct.\n\nChief Nyamaropa was recorded passing offensive and disparaging comments about an attendant at one of his traditional court sessions last year.\n\nBvisa magirazi ayo. Bvisa mazigirazi. Bvisa maziso. Stupid. Unotonga kumba kwamai vako kwete munyika mangu wazvinzwa? Uri kuda kuona kuti panapa wakanyanya? Saka wanga uchitaura pakuita sei? Usaite hu stupid wazvinzwa? Hauna chauri kushamisira pauri. Wazvinzwa?\n\nHis actions were frowned upon by the ZLHR which eventually filed a complaint through its lawyer Obey Shava.\n\nSpeaking at the opening of the 2025 legal year, Chief Justice Luke Malaba said the training will improve traditional leaders conduct as those seeking justice at traditional courts should always be treated with respect.\n\nI have directed the JSC secretary to initiate engagements with the National Council of Chiefs with a specific focus on the training of chiefs in respect of their conduct at their courts.\n\nThe idea is to empower chiefs with the necessary skills for hearing and determining disputes at their courts.\n\nLitigants seeking justice from customary law courts deserve to be treated with dignity. They must never be insulted by the presiding persons, said Malaba.\n\nAccording to the State-run daily, The Herald, National Council of Chiefs president Mtshane Khumalo blamed the failure to have these training sessions as the reason behind some chiefs behaviour.\n\nNumerous other traditional leaders have been caught offside.\n\nAdded the ZLHR after the release of the video last year: Chief Nyamaropas conduct betrays a contemptuous and demeaning attitude towards women and purveys and perpetuates such attitude considering his position of influence and the fact that the incident is on tape and has been widely disseminated across various social media platforms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/22052950/NYAMAROPA.jpg",
            "description": "<p>By Staff Reporter THE Judicial Services Commission (JSC) has been ordered to train traditional leaders on ethical and legal standards, just over a month after Zimbabwe Lawyers for Human Rights (ZLHR) lodged a complaint and demanded action against Chief Nyamaropa’s disrespectful conduct. Chief Nyamaropa was recorded passing offensive and disparaging comments about an attendant at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chief-justice-malaba-orders-disrespectful-traditional-leaders-to-undergo-ethical-legal-training/\">Chief Justice Malaba orders ‘disrespectful’ traditional leaders to undergo ethical, legal training</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "ZIFA elections: Mliswa withdraws appeal, backs Magwizi",
            "url": "https://www.newzimbabwe.com/zifa-elections-mliswa-withdraws-appeal-backs-magwizi/",
            "content": "By Sport Reporter\n\nDisqualified aspiring presidential candidate Themba Mliswa on Tuesday withdrew his application before the High Court in which he sought to block the January 25 ZIFA elections.\n\nMliswas appeal was set to go before Justice Tawanda Chitapi, who then ordered him to pay the costs for his action.\n\nThe former Norton legislator was challenging ZIFA for its whole electoral process which he claimed to be unconstitutional based on the fact that all those who participated in the process were not eligible except for the Normalization Committee which was appointed by FIFA.\n\nMliswa, through his lawyer Musindo Hungwe, admitted that his application was filed out of time, hence withdrawing the case.\n\nCommenting on the matter, Professor Lovemore Madhuku who was representing ZIFA, said , The matter is not urgent, the applicant did not treat the matter as urgent, he only became interested because he was nominated to be the presidential candidate.\n\nHe waited, only to be interested after his nomination.T he applicant has not been honest with the court, and the first respondent( ZIFA) was not served with the Court of Arbitration for Sport (CAS) application, this application has not given full information about that, the matter maybe thrown out, in an urgent application you ooght to be open.\n\nMliswa is one of the four candidates who were barred from contesting in the coming election after failing the integrity test, the other three being Farai Jere, Benjani Mwaruwari and Walter Magaya.\n\nHe has since endorsed Nqobile Magwizi to be the next national football association president.\n\nMagwizi is the favourite to win Saturdays election in which he is contesting for the top post together with Martin Kweza, Philemon Machana, Makwinji Soma-Phiri, Twine Phiri and Marshall Gore\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/31000914/Temba-Mliswa.jpg",
            "description": "<p>By Sport Reporter Disqualified aspiring presidential candidate Themba Mliswa on Tuesday withdrew his application before the High Court in which he sought to block the January 25 ZIFA elections. Mliswa’s appeal was set to go before Justice Tawanda  Chitapi, who then ordered him to pay the costs for his action. The former Norton legislator was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-elections-mliswa-withdraws-appeal-backs-magwizi/\">ZIFA elections: Mliswa withdraws appeal, backs Magwizi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "African Sun places Monomotapa Hotel on the market",
            "url": "https://www.newzimbabwe.com/african-sun-places-monomotapa-hotel-on-the-market/",
            "content": "By Alois Vinga\n\nLISTED hospitality group, African Sun has placed Monomotapa Hotel on the market for sale on the back of a call for shareholders to exercise caution when dealing the companys stocks during the process.\n\nKnown for its distinct architecture inspired by the ancient Kingdom of Monomotapa, the top-end hotel stands tall as one of Harares most recognisable buildings, located adjacent to the citys Harare Gardens.\n\nOver the decades, it has hosted a myriad of international and local guests, including dignitaries, corporate travellers, and tourists, making it a cornerstone in the citys tourism and hospitality landscape\n\nHowever, in what signals the pursuit of a new strategy which breaks from the past, African Sun took the bold step of placing one of its top hotels on the market.\n\nFurther to the cautionary statements dated 10 September, 11 October 2024, 4 November, and 3 December 2024 shareholders and the investing public are advised that in keeping with the strategy of unlocking value, negotiations for the disposal of a selection of hospitality assets are ongoing. Pursuant to the above, the Company has placed the Monomotapa Hotel on the market for sale, said the statement.\n\nThe impending negotiations, if successful, will constitute a transaction, accordingly, the company would be seeking the approval of its shareholders at an Extraordinary General Meeting to be convened at the appropriate time.\n\nShareholders and the investing public are therefore advised to exercise caution when dealing with the Companys securities until advised of the conclusion of the said ongoing processes, said African Sun.\n\nLast year, African Sun Limited, a hospitality group, called off the highly publicised sale of its two properties, the Beitbridge Express Hotel and Great Zimbabwe Hotel in Masvingo, which were to be sold for a combined US$6.9 million to TD Hotels and Leisure (Private) Limited, a rising local hospitality company.\n\nInitially, African Sun had stated that the sale was intended to generate capital by offloading assets deemed non-essential to the groups future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga LISTED hospitality group, African Sun has placed Monomotapa Hotel on the market for sale on the back of a call for shareholders to exercise caution when dealing the company’s stocks during the process. Known for its distinct architecture inspired by the ancient Kingdom of Monomotapa, the top-end hotel stands tall as one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-places-monomotapa-hotel-on-the-market/\">African Sun places Monomotapa Hotel on the market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        },
        {
            "title": "ZRP officers, CIO agents under investigation for extortion spree in Gokwe",
            "url": "https://www.newzimbabwe.com/zrp-officers-cio-agents-under-investigation-for-extortion-spree-in-gokwe/",
            "content": "By Staff Reporter\n\nAT LEAST ten Zimbabwe Republic Police (ZRP) officers and Central Intelligence Organisation (CIO) operatives based in Gokwe are under investigation after going on an extortion spree in which they netted US$2,030 from small businesses.\n\nThe case, filed with ZRP Gokwe last week, is being investigated under RRB numbers 6248660-63. No arrests have been made yet.\n\nAccording to a police memo sent to the Officer Commanding Gokwe District by the Officer in Charge Gokwe and gleaned by NewZimbabwe.com, the ten are being charged with Criminal Abuse of Duty as Public Officials as defined in Section 174 of the Criminal law [Codification and Reform] Act.\n\nAccording to the memo detective constables Tafadzwa Siwela, Daniel Chishapira and Batsirayi Madhongo, detective sergeant Takunda Vhezha, assistant inspector Chinyani John, police intelligence officer Edias Mugabe, CIO operatives Hungwe and Chatikobo, and two others are being investigated.\n\nThe crew was made up of security details who claimed to their victims that they were part of the CIOs crack Ferret Force sent to rural Gokwe to investigate abuses of the Exchange Rate Act and the smuggling of goods.\n\nHungwe and Chatikobo stand accused of collecting US$760 between October last year and January 4, 2025, from Wonderson Tamande whom they accused of not having enough papers to stay in Zimbabwe. Tamande is an Ethiopian national.\n\nThey also accused him of having smuggled goods in his possession.\n\nChatikobo was to follow this up with another US$200 in connivance with Chishapira and Madhongo after staging the arrest of Tamandes shopkeeper. According to the memo, the shopkeeper had used an illegal exchange rate in selling bread to them.\n\nThey demanded a US$1,000 bribe before eventually settling for US$200.\n\nThe three were to demand a US$80 protection fee from Fantasy Zambuko who owns Fantasy General Dealer on January 2, 2025, after notifying him of an anti-smuggling operation they were supposed to initiate in the area.\n\nThe continued spree saw Chatikobo going on to collect US$300 from Tamande after demanding US$3,000 before he roped in Chinyani to take another US$140.\n\nOn another occasion, a team of four males and a female-identifying themselves as part of the Ferret Team approached another Gokwe businessman Tafadzwa Nyakudzambara and extorted US$300.\n\nOn January 8, 2025 Chatikobo, Chishapira, Mugabe, alongside two others identified as Mukamuri and Mushonga approached Simbarashe Ziwaya and extorted US$250.\n\nAll four victims filed complaints with the police on January 14 this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/25125149/download.jpeg",
            "description": "<p>By Staff Reporter AT LEAST ten Zimbabwe Republic Police (ZRP) officers and Central Intelligence Organisation (CIO) operatives based in Gokwe are under investigation after going on an extortion spree in which they netted US$2,030 from small businesses. The case, filed with ZRP Gokwe last week, is being investigated under RRB numbers 6248660-63. No arrests have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zrp-officers-cio-agents-under-investigation-for-extortion-spree-in-gokwe/\">ZRP officers, CIO agents under investigation for extortion spree in Gokwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Jan 2025"
        }
    ]
}