{
    "news": [
        {
            "title": "After Harare City Council probe, government hints at Commission of Inquiry into Bulawayo’s operations",
            "url": "https://www.newzimbabwe.com/after-harare-city-council-probe-government-hints-at-commission-of-inquiry-into-bulawayos-operations/",
            "content": "By Darlington Gatsi\n\nAS the Commission of Inquiry probing the operations of the Harare City Council wrapped up and submitted its findings, the government has hinted that a similar approach could be replicated for other local authorities, with Bulawayo identified as being riddled with maladministration.\n\nThe Commission, which was chaired by retired judge Justice Maphios Cheda, on Tuesday submitted its report to President Emmerson Mnangagwa after a year-long investigation into the Harare City Council.\n\nThe Commission uncovered the shortcomings of the Harare City Council, which is dogged by corruption, resulting in poor service delivery in the capital.\n\nSpeaking after the presentation of the report at State House on Tuesday, the Minister of Local Government, Daniel Garwe, said local authorities are plagued by decay stemming from poor governance.\n\nThat is why the President has put in place a Commission of Inquiry, it is born out of the decay in the way our local authorities, especially our urban authorities, are being run. Harare City Council is number one, and Bulawayo City Council is number two going forward.\n\nI do not know yet, but we have made the recommendation that we need to have a thorough investigation of all our urban local authorities because there is a lot of decay, said Garwe.\n\nDuring the hearings, which were conducted over a period of nine months, the Jacob Mafume-led council was exposed for its extravagance, with officials taking home hefty perks.\n\nThis is despite the council bemoaning a shortage of funds in its operations, which has seen it failing to provide basics to residents.\n\nA clean-up is expected to be conducted at Town House once President Mnangagwa has reviewed the report and its recommendations.\n\nWith the findings remaining confidential for now, Garwe said his ministry now awaits further instructions from President Mnangagwa.\n\nThey have finished the report. The chairman and myself, as the Minister of Local Government, have come to present the report.\n\nThe details of the report cannot be disclosed today because the President has to go through the report, sit down, finalise it, and give us the way forward, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Darlington Gatsi AS the Commission of Inquiry probing the operations of the Harare City Council wrapped up and submitted its findings, the government has hinted that a similar approach could be replicated for other local authorities, with Bulawayo identified as being riddled with maladministration. The Commission, which was chaired by retired judge Justice Maphios</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-harare-city-council-probe-government-hints-at-commission-of-inquiry-into-bulawayos-operations/\">After Harare City Council probe, government hints at Commission of Inquiry into Bulawayo’s operations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Jun 2025"
        },
        {
            "title": "Zimbabwe embraces smart city technology to tame traffic offences",
            "url": "https://www.newzimbabwe.com/zimbabwe-embraces-smart-city-technology-to-tame-traffic-offences/",
            "content": "By Darlington Gatsi\n\nTHE government has approved the implementation of the Smart City concept, which aims to curb traffic offences and reduce road accidents.\n\nThe Smart City initiative will be rolled out by telecommunications company TelOne.\n\nThe system will incorporate Artificial Intelligence (AI), including components such as cameras with automatic number plate and facial recognition capabilities.\n\nSpeaking at a post-Cabinet media briefing,Tuesday, the Minister of Information said the home-grown system would address traffic violations using modern technology.\n\nThe government is set to accelerate the implementation of a Home-Grown Smart Traffic Management System, after Cabinet approved the rollout of a proof of concept in 2020, which was subsequently utilised during the COVID-19 period and thereafter.\n\nThis is meant to address unwarranted traffic congestion, road accidents, and traffic law violations. This innovative system utilises advanced technologies such as the Internet of Things (IoT), Artificial Intelligence (AI), and big data analytics to enhance traffic flow, road safety, and transparency, said Muswere.\n\nZimbabwe has lagged behind in addressing traffic violations, with offenders often escaping punishment due to an archaic ticketing system.\n\nHowever, given Zimbabwes ongoing power and internet challenges, there is scepticism over the feasibility of the systems success in the country.\n\nMuswere added that the system would be implemented in phases, starting with Harare and Bulawayo.\n\nThe Home-Grown Traffic Management System will be rolled out in phases, commencing with Harare and Bulawayo, followed by other major towns. To support effective implementation, several key enablers will be monitored, including a robust project governance framework, reliable power sources, stable internet connectivity, and strategic system integration with supporting platforms and institutions.\n\nSpecialised courts will assist in expediting justice delivery as the system operates. This localised approach is expected to foster knowledge transfer, skills development, and national pride while promoting self-reliance and sustainability, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Darlington Gatsi THE government has approved the implementation of the Smart City concept, which aims to curb traffic offences and reduce road accidents. The Smart City initiative will be rolled out by telecommunications company TelOne. The system will incorporate Artificial Intelligence (AI), including components such as cameras with automatic number plate and facial recognition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-embraces-smart-city-technology-to-tame-traffic-offences/\">Zimbabwe embraces smart city technology to tame traffic offences</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Jun 2025"
        },
        {
            "title": "Zimbabwe, South Africa, Botswana sign treaty to boost cross-border conservation, livelihoods",
            "url": "https://www.newzimbabwe.com/zimbabwe-south-africa-botswana-sign-treaty-to-boost-cross-border-conservation-livelihoods/",
            "content": "By Thandiwe Garusa\n\nBOTSWANA, South Africa, and Zimbabwe have signed a treaty to establish the Greater Mapungubwe Transfrontier Conservation Area, aiming atpromotingcross-border environmental conservation, cultural heritage protection, and sustainable socio-economic development.\n\nThe countries will work together to protect nature and cultural heritage in the Greater Mapungubwe area, while also improving peoples lives through conservation and sustainable development.\n\nSpeaking during a post-cabinet media briefing on Tuesday, Information Minister Jenfan Muswere said the people in the Greater Mapungubwe Transfrontier Conservation Area share common values, interests, and cultural ties and are therefore working together to create strategies that support both community well-being and environmental conservation.\n\nThe objective of the Treaty is to establish the Greater Mapungubwe\n\nTransfrontier Conservation Area for the promotion of collaborative conservation of the environment and shared natural and cultural heritage resources for the benefit of people in the Transfrontier Conservation Area.\n\nOwing to shared values, interests and cultures among the people in the Greater Mapungubwe Transfrontier Conservation Area, the governments of Botswana, South Africa and Zimbabwe are coming together to develop models for enhancing livelihoods and conservation efforts.\n\nThe Treaty will promote ecosystem integrity, biodiversity conservation, cultural heritage resource management and sustainable socio-economic development across international boundaries.\n\nThe Greater Mapungubwe Transfrontier Conservation Area will comprise the following areas: the Northern Tuli Game Reserve, in Botswana; the Mapungubwe National Park and World Heritage Site in South Africa; and the Tuli Circle Safari Area, Maramani and other surrounding Wildlife Management Areas in Zimbabwe.\n\nCommunities in the Greater Mapungubwe area face major problems like human-wildlife conflicts, climate change effects, and limited job or income options for locals.\n\nMeanwhile, according to authorities, in Zimbabwe, 300 people were killed in human-wildlife conflicts nationwide between 2019 and 2023, with recent reports indicating that 18 people were killed in this years first quarter alone.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17201737/Mapungubwe-rock-formation-and-baboons-1024x640-1.jpg",
            "description": "<p>By Thandiwe Garusa BOTSWANA, South Africa, and Zimbabwe have signed a treaty to establish the Greater Mapungubwe Transfrontier Conservation Area, aiming at promoting cross-border environmental conservation, cultural heritage protection, and sustainable socio-economic development. The countries will work together to protect nature and cultural heritage in the Greater Mapungubwe area, while also improving people’s lives through conservation and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-south-africa-botswana-sign-treaty-to-boost-cross-border-conservation-livelihoods/\">Zimbabwe, South Africa, Botswana sign treaty to boost cross-border conservation, livelihoods</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Jun 2025"
        },
        {
            "title": "AMH journalist Blessed Mhlanga’s trial in false start again",
            "url": "https://www.newzimbabwe.com/amh-journalist-blessed-mhlangas-trial-in-false-start-again/",
            "content": "By Staff Reporter\n\nThe trial of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, accused of transmitting data messages inciting violence, failed to start again on Tuesday after the presiding magistrate failed to show up due to poor health.\n\nMagistrate Learnmore Mapiye is presiding over the hearing with Mhlanga now jointly charged with his employer, Heart & Soul TV (HSTv), a subsidiary of AMH.\n\nTrial is now expected to begin on July 17.\n\nMhlanga and his employer are being charged under Section 164 of the Criminal Law (Codification and Reform) Act, but were arrested separately.\n\nThe journalist was arrested in February this year and spent 72 days in pretrial detention.\n\nHe was granted US$500 bail by High Court Judge Justice Gibson Mandaza on his third freedom bid.\n\nMhlanga landed in the dock after HSTV published a press conference by Zanu PF war veteran Blessed Geza, who was calling for President Emmerson Mnangagwas resignation. Geza is currently in hiding.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26061950/Blessed-Mhlanga.png",
            "description": "<p>By Staff Reporter The trial of Alpha Media Holdings (AMH) journalist Blessed Mhlanga, accused of transmitting data messages inciting violence, failed to start again on Tuesday after the presiding magistrate failed to show up due to poor health. Magistrate Learnmore Mapiye is presiding over the hearing with Mhlanga now jointly charged with his employer, Heart</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amh-journalist-blessed-mhlangas-trial-in-false-start-again/\">AMH journalist Blessed Mhlanga’s trial in false start again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Jun 2025"
        },
        {
            "title": "Explosion at fireworks factory in central China kills nine and injures 26",
            "url": "https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/",
            "content": "AFP\n\nAn explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident.\n\nThe blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run China National Radio (CNR) said.\n\nAs of 9:00 am on Tuesday, nine people were dead and 26 injured, CNR said, citing a rescue command centre.\n\nRescue work at the scene was ongoing, CNR reported, noting a complicated situation and the risk of additional explosions hampering response efforts.\n\nAdding to the challenge, the site was in a mountainous area with no large water source, it added.\n\nDuring more than 20 hours of uninterrupted and continuous rescue, the rescue team used remote-controlled water cannons to extinguish the fire, the report said.\n\nState news agency Xinhua also said Tuesday that the Ministry of Emergency Management had sent a working team to Hunan to oversee the rescue.\n\nEfforts must be made to ascertain the cause of the explosion as soon as possible and to hold those responsible accountable, the ministry said, according to Xinhua.\n\nIndustrial accidents are fairly common in China due to vague regulations and lax safety standards.\n\nLast month, an explosion at a chemical plant in the eastern province of Shandong killed at least five people.\n\nIn 2015, blasts at warehouses containing flammable chemicals in the port city of Tianjin killed more than 170 people and injured 700 others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17092806/Screenshot-2025-06-17-at-10.27.17.png",
            "description": "<p>AFP An explosion at a fireworks factory in central China killed nine people. It injured 26 others, state media said on Tuesday, as challenging on-site rescue work continued a day after the incident. The blast occurred shortly before 8:30 am Monday at a factory in a village outside Changde, a city in Hunan province, state-run</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/explosion-at-fireworks-factory-in-central-china-kills-nine-and-injures-26/\">Explosion at fireworks factory in central China kills nine and injures 26</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Jun 2025"
        }
    ]
}