{
    "news": [
        {
            "title": "Ronaldo engaged to long-term partner Georgina Rodríguez",
            "url": "https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/",
            "content": "By BBC News\n\nFOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodrguez.\n\nShe announced the news on social media alongside a picture of a large ring, writing Yes I do. In this and in all my lives in her native Spanish.\n\nNo further details have been shared. Ronaldo, who is the most followed person on Instagram, has not yet made a comment about their engagement.\n\nThe couple have been together for nine years, after they met at a Gucci shop in Madrid where Rodrguez was working. He was playing at the Spanish club Real Madrid at the time.\n\nShe said siu! was one of the top comments, a nod to the footballers famous goal celebration where he shouts yes in Portuguese or Spanish.\n\nThe Portugal and Al-Nassr player has five children in total, two of whom he shares with Rodrguez.\n\nTheir youngest daughter Bella was born in April 2022, alongside a baby boy who was stillborn.\n\nRodrguez has also helped to raise Ronaldos other three children.\n\nThe 31-year-old, who starred in her own Netflix reality show I Am Georgina, previously addressed speculation around her engagement status. On the programme, she said her friends were always joking about the wedding.\n\nSince Jennifer Lopezs song The Ring Or When came out, they started singing it to me. And well, this is not up to me, she added.\n\nFamous faces including Kim Kardashian have liked the engagement announcement on social media. Piers Morgan, who interviewed Ronaldo in 2022, wished them as much success in their marriage as hes had on the football pitch!\n\nCelebrity make-up artist Charlotte Tilbury commented that it was fabulous news. Lauren Sanchez-Bezos, who married Amazon founder Jeff Bezos in June, said she was so happy for the couple.\n\nThe family currently live in the Saudi Arabian capital Riyadh, where Ronaldo plays for Al-Nassr. He joined the club in December 2022 for a reported annual salary of 177m ($238m).\n\nIn June 2025, it was announced that the 40-year-olds contract had been extended until 2027 after speculation that he was preparing to retire.\n\nIn a post on X, Ronaldo wrote: A new chapter begins. Same passion, same dream. Lets make history together.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13045909/cristiano-ronaldo-wife-1.webp",
            "description": "<p>By BBC News FOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodríguez. She announced the news on social media alongside a picture of a large ring, writing “Yes I do. In this and in all my lives” in her native Spanish. No further details have been shared. Ronaldo, who is the most</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/\">Ronaldo engaged to long-term partner Georgina Rodríguez</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "13 Aug 2025"
        },
        {
            "title": "Daniel Msendami opens Betway Premiership scoring account as Marumo beat Pirates",
            "url": "https://www.newzimbabwe.com/daniel-msendami-opens-betway-premiership-scoring-account-as-marumo-beat-pirates/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Daniel Msendami was on target Tuesday evening when Marumo Gallants beat Orlando Pirates 2-1 in the second game of South Africas Betway Premiership.\n\nMsendami struck in the 45th minute to cancel Orlando Pirates lead level the game at 1-1 going for the break.\n\nMarumo Gallants came back in the second half and sealed victory through Jaisen Clifford in the 90th minute to record a 2-1 win over Pirates.\n\nTuesdays goal was the first of the season for Zimbabwean striker, who joined the side in July last year from Botswanas Jwaneng Galaxy.\n\nMarumo Gallants is home two three Zimbabweans, the other two being Warriors first choice goalkeeper Washington Arubi and striker Junior Zindoga.\n\nArubi also had a good day in the office as he denied Orlando Pirates several attempts to score a second goal through his super saves.\n\nTuesdays win saw Marumo Gallants going on top of the Betway Premiership with six points after managing two wins in two games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/29053013/Daniel-Msendami-12-scaled-1.webp",
            "description": "<p>By Sports Reporter WARRIORS midfielder Daniel Msendami was on target Tuesday evening when Marumo Gallants beat Orlando Pirates 2-1 in the second game of South Africa’s Betway Premiership. Msendami struck in the 45th minute to cancel Orlando Pirates’ lead level the game at 1-1 going for the break. Marumo Gallants came back in the second</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/daniel-msendami-opens-betway-premiership-scoring-account-as-marumo-beat-pirates/\">Daniel Msendami opens Betway Premiership scoring account as Marumo beat Pirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:36",
            "date": "13 Aug 2025"
        }
    ]
}