{
    "news": [
        {
            "title": "Victory for striking UZ lecturers as court interdicts police from stopping job action",
            "url": "https://www.newzimbabwe.com/victory-for-striking-uz-lecturers-as-court-interdicts-police-from-stopping-job-action/",
            "content": "By Staff Reporter\n\nTHE High Court has handed down a landmark decision interdicting the police from disrupting, interfering with or stopping the ongoing strike by lecturers at the University of Zimbabwe (UZ).\n\nThe order handed down by Justice Chikowero applies to both members of the union and their supporters such as non-academic employees and students.\n\nThe1stRespondentisinterdictedfrom unlawfullyinterfering,obstructingor prohibiting the picketing by the applicants members and supporters outside the premises of 3rd Respondent in terms of the pocket authorisation issued by the applicant on 15 April 2025, reads the ruling issued Saturday.\n\nAmong other conditions, the strike action should be confined to waving placards, song, dance, prayers and solidarity speeches.\n\nPolice were interdicted from unlawfully arresting protest organisers and participants, who will have two liaison officers representing them during talks with authorities.\n\nFollowing the ruling, Vashandi-Zisebenzi Working Peoples Collective (WPC) congratulated the UZ lecturers and their legal team led by Munyaradzi Gwisai and E. Matika of MG and Partners.\n\nThis is an important victory for workers. It advances the struggle for a full and effective right to strike.\n\nWe salute all unions and organisations that have given solidarity. More is needed. An important battle has been won, but the war is still to be won.\n\nAll out on Tuesday as the strike resumes. A successful lecturers strike will inspire other exploited workers to join the rallying battle for a living wage, WPC said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/15203310/uz_main_gate-min.jpeg",
            "description": "<p>By Staff Reporter  THE High Court has handed down a landmark decision interdicting the police from disrupting, interfering with or stopping the ongoing strike by lecturers at the University of Zimbabwe (UZ). The order handed down by Justice Chikowero applies to both members of the union and their supporters such as non-academic employees and students.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/victory-for-striking-uz-lecturers-as-court-interdicts-police-from-stopping-job-action/\">Victory for striking UZ lecturers as court interdicts police from stopping job action </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "‘Don’t heed call for national shutdown’— says Information Minister, labels Geza enemy of progress and a terrorist",
            "url": "https://www.newzimbabwe.com/dont-heed-call-for-national-shutdown-says-information-minister-labels-geza-enemy-of-progress-and-a-terrorist/",
            "content": "By Staff Reporter\n\nINFORMATION Minister Jenfan Muswere has laid down the gauntlet, branding his former Zanu PF party colleague, Blessed Geza, a terrorist and an enemy of progress.\n\nMuswere urged the public to ignore Gezas calls for a two-day national shut down on April 22 and 23, 2025  a protest against President Emmerson Mnangagwas rule.\n\nOn Saturday night, Geza issued a call for Zimbabweans to stay at home and not show up for work nationwide, hoping to force Mnangagwa to stand down.\n\nThe agitation for a national shut down follows Gezas March 31, 2025, protest, which, to put it mildly, failed to gain much traction. It amounted to little more than a stay-away, punctuated by a few isolated flash demonstrations in the capital.\n\nIn a press briefing yesterday, Muswere implored Zimbabweans to remain united and pay no heed to Gezas shutdown appeals.\n\nWe must remain united against cyber terrorism and enemies of progress. We have a responsibility to build our country. Zimbabweans should utilise the internet for development.\n\nWe should continue to ignore calls from unproductive charlatans and merchants of falsehoods who seek to reverse the gains of the liberation struggle through demonisation of Zimbabwes image, its people and leadership through misinformation and malice, he said.\n\nIn his Saturday night address, delivered from an undisclosed location, Geza, who was wearing military garb, called on Zimbabweans to stay at home in protest against Mnangagwas misrule.\n\nOn Tuesday and Wednesday, the 22nd and 23rd of April 2025, everyone must stay home. We must shut down Zimbabwe completely. This is to send a strong message to Mnangagwa and his zvigananda.\n\nShops and industries will not open and kombis will be parked. The police will not tear gas you, but if they ever come to you, you have the right to defend yourselves, Geza said.\n\nThe ex-combatant, who has been on the police wanted list since early February, also assured the 95 protesters arrested March 31 in Harare, and Heart and Soul Television and Radio (HSTV) journalist Blessed Mhlanga, that they will be released from prison soon.\n\nGeza told Zimbabweans that the writing is on the wall, claiming that Mnangagwa will soon be out of office.\n\nAddressing delegates at the 45th Independence celebration in Gokwe last Friday, Mnangagwa, without naming Geza directly, urged Zimbabweans to ignore instigators on social media, which Geza has been using to communicate with the public.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/19222123/Dr-Jenfan-Muswere.png",
            "description": "<p>By Staff Reporter INFORMATION Minister Jenfan Muswere has laid down the gauntlet, branding his former Zanu PF party colleague, Blessed Geza, a terrorist and an enemy of progress. Muswere urged the public to ignore Geza’s calls for a two-day national shut down on April 22 and 23, 2025 – a protest against President Emmerson Mnangagwa’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-heed-call-for-national-shutdown-says-information-minister-labels-geza-enemy-of-progress-and-a-terrorist/\">‘Don’t heed call for national shutdown’— says Information Minister, labels Geza enemy of progress and a terrorist</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "Green technology firm SulNOx Group Plc obtains patent covering Zimbabwe",
            "url": "https://www.newzimbabwe.com/green-technology-firm-sulnox-group-plc-obtains-patent-covering-zimbabwe/",
            "content": "By Alois Vinga\n\nGREENTECH firm, SulNOx Group plc has obtained a patent covering Zimbabwe among other seven countries on the continent in a move aimed at protecting the companys products.\n\nIn a statement, the company said the patent was obtained from the African Regional Intellectual Property Organisation (ARIPO), which now covers the Gambia, Ghana, Kenya, Mozambique, Sierra Leone, Uganda, Zambia and Zimbabwe.\n\nThe firms product range, including Berol 6446 emulsifiers for Heavy Sulphur Fuel Oils and Sulnox Eco Fuel Conditioners, is now protected in these markets. These products are designed for use with various fuels, such as diesel, petrol/gasoline, biofuels, and marine fuels, including Marine Gas Oil and Marine Diesel Oil.\n\nThe patent is further to SulNOxs existing patent in South Africa and covers a range of formulation versions including the Berol 6446 heavy sulphur fuel oil emulsifiers and SulNOx eco fuel conditioners.\n\nSulNOx also holds a separate patent in Nigeria for fuel oil reclamation.\n\nThe ARIPO patent marks a step change in our strategy for Africa, where we are working with a number of partners to deploy our products across a range of industries.\n\nGaining wider protection for our innovation in some of Africas largest and most developed countries undoubtedly improves Sulnoxs prospects for revenue growth, particularly in the continents key sectors such as shipping, mining and road transport, said Chief Executive Officer Ben Richardson.\n\nWe look forward to announcing further progress in Africa and expansion of our patent portfolio as we target new sectors and markets worldwide.\n\nShares in SulNOx last traded at 85.56 pence on the Aquis Exchange in London following the patents announcement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/21055700/profile-ben-richardson.jpeg",
            "description": "<p>By Alois Vinga GREENTECH firm, SulNOx Group plc has obtained a patent covering Zimbabwe among other seven countries on the continent in a move aimed at protecting the company’s products. In a statement, the company said the patent was obtained from the African Regional Intellectual Property Organisation (ARIPO), which now covers the Gambia, Ghana, Kenya,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/green-technology-firm-sulnox-group-plc-obtains-patent-covering-zimbabwe/\">Green technology firm SulNOx Group Plc obtains patent covering Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "Media lobby group calls for Zimbabwean journalist Blessed Mhlanga’s freedom",
            "url": "https://www.newzimbabwe.com/media-lobby-group-calls-for-zimbabwean-journalist-blessed-mhlangas-freedom/",
            "content": "By Nicole Fritz l lOL\n\nZimbabwean journalist Blessed Mhlanga has spent over 50 days behind bars. His unlawful arrest and detention are but one of President Emmerson Mnangagwas many attempts to silence the press and criminalise speech under unconstitutional laws.\n\nMhlanga, a senior journalist at Heart and Soul TV, has been charged with inciting violence and unrest after interviews with liberation veteran and former Zanu PF politician Blessed Geza. Geza accused Mnangagwa of corruption and called for his immediate resignation in the November 2024 and January 2025 interviews Mhlanga conducted with Geza.\n\nSince his arrest on 24 February 2025 for having purportedly violated a section of the criminal law which prohibits transmission of data, Mhlanga has been denied bail an extraordinary three times on the flimsiest of pretexts  including that he might interfere with state witnesses whose identities are not known to him\n\nMhlanga also suffered arrest in 2022, again seemingly for simply doing his job  covering the attempted arrest of an opposition politician.\n\nHis arrest and continued detention at present represent the furtherance of a campaign both Mnangagwa and his predecessor, Robert Mugabe, have long waged: ruthlessly targeting independent media and suppressing critical voices.\n\nNicole Fritz, executive director of the Campaign for Free Expression (CFE), said: It is high time that Blessed Mhlanga have his freedom restored, be returned to his family and be able to conduct his profession unhindered.\n\nIt is long overtime that the Mnangagwa government cease its relentless suppression of freedom of expression and allow Zimbabweans both to call and organise for better government.\n\nWe call on the diplomatic community, and on South Africa in particular, to make Blessed Mhlangas continued incarceration a matter for general engagement on Zimbabwe-related issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Nicole Fritz l lOL  Zimbabwean journalist Blessed Mhlanga has spent over 50 days behind bars. His unlawful arrest and detention are but one of President Emmerson Mnangagwa’s many attempts to silence the press and criminalise speech under unconstitutional laws. Mhlanga, a senior journalist at Heart and Soul TV, has been charged with inciting violence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/media-lobby-group-calls-for-zimbabwean-journalist-blessed-mhlangas-freedom/\">Media lobby group calls for Zimbabwean journalist Blessed Mhlanga’s freedom </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "Drama as Zim dancehall artist Silent Killer refuses to get on flight to UK SAMA Festival",
            "url": "https://www.newzimbabwe.com/drama-as-zim-dancehall-artist-silent-killer-refuses-to-get-on-flight-to-uk-sama-festival/",
            "content": "By Staff Reporter\n\nZIM dancehall artist Jimmy Mudereri popularly known as Silent Killer failed to make an appearance at the UK SAMA Festival Saturday after refusing to get onto a flight alleging, he had dreamt of an airplane exploding mid-air.\n\nThis follows his shock refusal, on two instances, to board flights, which were fully paid for, with the other costing US$1,500.\n\nAlso, shocking was the fact that he checked-in at Robert Mugabe lnternational Airport, armed with his passport and VISA, only to make somersault the last minutes, arguing the plane would crash.\n\nThe second time, the delirious chanter reportedly locked himself in the toilet at the airport until the booked UK-bound airplane departed.\n\nUK SAMA Fest promoters confirmed the debacle, which is attributed to the artists misuse of drugs and substances.\n\nSilent Killer refused to board a UK-bound flight because he had a dream it would explode. He missed the first flight and my colleague had to booked another flight and paid US$1,500. Unfortunately, this time he locked himself in the airport toilet, said Fred Matenga of Y2K Promotions.\n\nSilent Killer has been producing captivating Zimdancehall music as early as 2011. He uses the tagline Ngirozi Yehondo and is popular for doing freestyles.\n\nAlso known as Ngwere the Mbare-born musician was billed to perform at the UK SAMA Festival UK on Saturday alongside sungura music virtuoso Alick Macheso, Mambo Dhuterere, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/20143157/68f1a042-a004-4d9e-b932-852b21b013d3.jpg",
            "description": "<p>By Staff Reporter  ZIM dancehall artist Jimmy Mudereri popularly known as ‘Silent Killer’ failed to make an appearance at the UK SAMA Festival Saturday after refusing to get onto a flight alleging, he had dreamt of an airplane exploding mid-air. This follows his shock refusal, on two instances, to board flights, which were fully paid</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drama-as-zim-dancehall-artist-silent-killer-refuses-to-get-on-flight-to-uk-sama-festival/\">Drama as Zim dancehall artist Silent Killer refuses to get on flight to UK SAMA Festival </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "Zimbabwe’s government avoids international embarrassment, flies Rovos Rail tourists to Victoria Falls despite promises to take them by road",
            "url": "https://www.newzimbabwe.com/zimbabwes-government-avoids-international-embarrassment-flies-rovos-rail-tourists-to-victoria-falls-despite-promises-to-take-them-by-road/",
            "content": "By Staff Reporter\n\nGOVERNMENT abandoned a disastrous plan to have tourists involved in the Gwanda train accident driven to Victoria Falls but instead had them flown to the resort town Saturday.\n\nOne of Africas most luxurious trains, Rovos Rail collided with a Beitbridge Bulawayo Rail (BBR) goods train in Gwanda over the Easter holiday while carrying 47 tourists on a fancy trip from Pretoria, South Africa.\n\nThe Bulawayo to Victoria Falls highway, on the other hand, is one of the worst in the country, with dangerous potholes and a derelict road for hundreds of kilometres.\n\nWhat is supposed to be a six-hour trip now extends beyond eight-hours as vehicles manoeuvre the tough terrain, at times moving into bushes towards Lupane and Hwange.\n\nGetting the tourists on buses to Victoria Falls would have raised eyebrows on the state of Zimbabwes roads, especially considering the luxury of their Rovos Rail.\n\nI am happy to finally be in Victoria Falls. We have enjoyed such good hospitality even after the accident. We value this, said a tourist after arriving in Victoria Falls.\n\nAlthough no fatalities were recorded, eight people, seven of them foreigners, were admitted in Gwanda and Bulawayo.\n\nAbsence of the train, whose repair was said to be on course, meant tourists had to continue using other means to Victoria Falls, with the road being governments initial plan.\n\nTourism Minister Barbara Rwodzi and Bulawayo Minister of State Judith Ncube both rushed to visit the injured tourists at Roman Catholic run private hospital Mater Dei in Bulawayo and Gwanda.\n\nThe two also toured the accident scene.\n\nGovernment, which has constantly been accused of ignoring the road, has reportedly engaged eight contractors to work on the 435km highway.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/20063404/IMG-20250420-WA0003.jpg",
            "description": "<p>By Staff Reporter GOVERNMENT abandoned a ‘disastrous’ plan to have tourists involved in the Gwanda train accident driven to Victoria Falls but instead had them flown to the resort town Saturday. One of Africa’s most luxurious trains, Rovos Rail collided with a Beitbridge Bulawayo Rail (BBR) goods train in Gwanda over the Easter holiday while</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-government-avoids-international-embarrassment-flies-rovos-rail-tourists-to-victoria-falls-despite-promises-to-take-them-by-road/\">Zimbabwe’s government avoids international embarrassment, flies Rovos Rail tourists to Victoria Falls despite promises to take them by road</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "High Court releases full judgement on Chinese national jailed 30 years for murder",
            "url": "https://www.newzimbabwe.com/high-court-releases-full-judgement-on-chinese-national-jailed-30-years-for-murder/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge Justice Esther Muremba has finally released her detailed judgement in the case of a Chinese national jailed 30 years for killing a miner in Zhombe and also for attempted murder and assault.\n\nCai Yulong was slapped with a 20-year jail term in September last year, but the judge issued an extempore ruling.\n\nYulong, the owner of Stone Steel Mine also known as Blue Mine in Zhombe, fatally shot Goni Goni after accusing him and his colleagues of encroaching into his mine on May 24 last year.\n\nHe also attempted to kill John Muchawaya Bera by shooting him once on the right knee and once on the left thigh, before he unlawfully struck Lovemore Mapfanya with a clenched fist.\n\nHe was convicted on all counts.\n\nYulong, who was in the country on a Temporary Work Permit, had pleaded not guilty to all the charges.\n\nIn his defence, the accused did not dispute shooting the deceased in the murder charge and the complainant in the attempted murder charge.\n\nHe claimed that his actions were in self-defence and in defence of his property.\n\nRegarding the assault charge, the accused stated that it was fabricated.\n\nHowever, the court ruled that his defence was weak.\n\nThe court heard that on the fateful day, the deceased, the complainant and their colleagues who were employed by Blackhand 10 Mine were working underground erecting the barricade.\n\nIt was heard the accused entered his mine using his shaft and proceeded to the intersection between the two mines. A confrontation ensued between the accused and the Blackhand 10 Mine workers, during which the accused shot at them.\n\nIn her ruling, Muremba said there was no justification for what Yulong did.\n\nIn this case, the offence of murder is further aggravated by the fact that the accused shot the deceased and his colleagues as they were fleeing for their lives.\n\nEven if it were accepted that the deceased and his colleagues were illegally panning for gold in the accuseds mine, the accused had no right to shoot them while they were running away.\n\nThe sanctity of human life must be upheld, and the accuseds actions demonstrate a cold-blooded killing.\n\nThe accused intentionally killed the deceased, and the deceaseds father provided a victim impact statement indicating the profound trauma caused by his sons death.\n\nThe father, who had expected his 23-year-old son to marry and provide him with grandchildren, was devastated by the unnatural and violent nature of his death, she said.\n\nThe judge also said the deceased was also the breadwinner for his family, and his loss has left them facing significant financial and emotional challenges.\n\nThe father had expressed a desire for the death penalty to be imposed, while the State has prayed for a sentence of 40 years imprisonment.\n\nIn relation to the charge of attempted murder, the accused used a firearm to shoot the complainant twice in both legs, causing serious injuries.\n\nWhen he was shooting the complainant, he was actually holding his legs to make sure that he would not escape.\n\nWhilst the doctors report states that there will not be permanent injury, we noted that the complainant was still walking with the aid of crutches when he came to court to testify, the judge said.\n\nDuring trial his right leg was still in plaster.\n\nThe complainant was shot while running away, and the victim impact statement reveals the profound pain and trauma he has endured.\n\nHe lost a workmate during the shooting and remains deeply affected by the incident. He is still nursing his injuries and is unable to provide for his family as the breadwinner.\n\nThe complainant has no hope of returning to the mining industry due to his inability to perform heavy duties, the judge noted.\n\nThe judge said the statutory penalty for attempted murder committed in aggravating circumstances is 20 years imprisonment up to death.\n\nShe said the presumptive penalty for attempted murder committed under such circumstances is five years imprisonment, but given the severity of the offence, a higher penalty is warranted.\n\nThe accused exhibited a high degree of cruelty by holding the complainant with one hand while shooting him in the back of his legs, completely disabling him from walking.\n\nThe court agrees with the States submission for a sentence of 10 years imprisonment.\n\nHowever, to avoid an excessive overall sentence, five years of this sentence will be suspended for five years on the condition that the accused does not commit an offence involving violence on the person of another during this period, she said.\n\nShe said the effective sentence for attempted murder will be five years imprisonment, which we will order to run concurrently with the sentence for murder.\n\nFor the first count Yulong was jailed 30 years.\n\nFor count two, he was jailed 10 years imprisonment of which five years imprisonment was suspended for 5 years on condition the accused does not within that period commit an offence involving violence on the person of another and for which upon conviction he is sentenced to imprisonment without the option of a fine.\n\nHe effectively sentenced to five years for the count.\n\nThis effective sentence of five years imprisonment will run concurrently with the sentence for murder.\n\nFor assault, Yulomg was fined US$100 in default of payment he will serve one month imprisonment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga  HIGH Court judge Justice Esther Muremba has finally released her detailed judgement in the case of a Chinese national jailed 30 years for killing a miner in Zhombe and also for attempted murder and assault. Cai Yulong was slapped with a 20-year jail term in September last year, but the judge issued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-releases-full-judgement-on-chinese-national-jailed-30-years-for-murder/\">High Court releases full judgement on Chinese national jailed 30 years for murder </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "Junior Sables fall to Namibia in Barthes Trophy opener",
            "url": "https://www.newzimbabwe.com/junior-sables-fall-to-namibia-in-barthes-trophy-opener/",
            "content": "By Sports Reporter\n\nZIMBABWES mens Under 20 team kicked off its 2025 Rugby Africa Barthes Trophy campaign with a 22- 41 defeat at the hands of Namibia at Old Hararians.\n\nDespite playing on home soil, Junior Sables failed to take charge of the game in which they went for the break trailing 5-27.\n\nZimbabwe seemed to be picking themselves in the second half as the home crowd tried to cheer up the side, hence scoring 17 points but still made little impact, failing to stop the Namibia from getting more points.\n\nJunior Sables last won the Barthes Trophy in 2023 after a two year dominance in the prestigious tournament.\n\nIn another match played at the same venue, defending champions Kenya started off their campaign with a 29- 21 victory over Tunisia.\n\nKenya remains favourites to win the tournament after ending Zimbabwes two year dominance last year at Harare Sports Club.\n\nBarthes Trophy action continues Wednesday as hosts Zimbabwe take on Tunisia while Kenya will face Namibia.\n\nThe tournament climaxes Saturday with a match between Namibia and Tunisia before the much-anticipated big rivalry match between Zimbabwe and Kenya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/25145518/F14Aua0XgAEBAN6.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE’S men’s Under 20 team kicked off its 2025 Rugby Africa Barthes Trophy campaign with a 22- 41 defeat at the hands of Namibia at Old Hararians. Despite playing on home soil, Junior Sables failed to take charge of the game in which they went for the break trailing 5-27. Zimbabwe seemed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/junior-sables-fall-to-namibia-in-barthes-trophy-opener/\">Junior Sables fall to Namibia in Barthes Trophy opener</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "45 years of lndependence: A call to action for economic justice",
            "url": "https://www.newzimbabwe.com/45-years-of-lndependence-a-call-to-action-for-economic-justice/",
            "content": "SUNDAY MORNING TABLET\n\nCELEBRATING Independence on empty stomachs: An injustice not only to the stomach infrastructure but also the future lives of our youth\n\nAnd the King will answer them, Truly, I say to you, as you did it to one of the least of these my brothers, you did it to me.'  Matthew 25:40\n\nAs we celebrate 45 years of independence, we must remember that true freedom is not just about political liberation but also about economic empowerment. Unfortunately, many Zimbabweans are struggling to make ends meet, living on less than a dollar a day, and civil servants earn far below the poverty datum line.\n\nFor the needy will not always be forgotten, and the hope of the poor will not perish forever.  Psalm 9:18\n\nWe implore our political leadership to value the lives of the majority, to prioritize their economic well-being, and to take concrete actions to alleviate poverty. Hunger and poverty can cause disharmony in communities and harden souls.\n\nWe pray that our government authorities will take the economic situation of its citizens seriously, that they will value the lives of the poor and vulnerable, and that they will work towards creating a more just and equitable society.\n\nRighteousness exalts a nation, but sin is a reproach to any people.  Proverbs 14:34\n\nLET US PRAY:\n\nDear Lord, we come before you today, asking that you guide our leaders to prioritize the economic well-being of their citizens.\n\nMay they value the lives of the poor and vulnerable, and may they work towards creating a more just and equitable society.\n\nAs long as our people are hungry and unhappy, our country cannot enjoy true happiness. We ask that you give our leaders wisdom, compassion, and courage to take action today and the time is now.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>SUNDAY MORNING TABLET CELEBRATING Independence on empty stomachs: An injustice not only to the stomach infrastructure but also the future lives of our youth “And the King will answer them, ‘Truly, I say to you, as you did it to one of the least of these my brothers, you did it to me.'” – Matthew</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/45-years-of-lndependence-a-call-to-action-for-economic-justice/\">45 years of lndependence: A call to action for economic justice</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        },
        {
            "title": "Triangle United appoints Mangombe new substantive coach",
            "url": "https://www.newzimbabwe.com/triangle-united-appoints-mangombe-new-substantive-coach/",
            "content": "By Sports Reporter\n\nTRIANGLE United Saturday evening officially announced the appointment of Genesis Mangombe as the new substantive head coach for the premiership side.\n\nMangombe comes in as a replacement of Luke Masomere, who was fired by the club last week.\n\nThe former Dynamos and Yadah gaffer joins Triangle from Tanzanian side Tebora United, where his contract was terminated this week after a string of poor results.\n\nAged 42, Mangombes first game in charge of the lowveld side will be Sunday when the outfit hosts Yadah at Gibbo Stadium.\n\nTriangle is currently bottom in the Castle Lager Premier Soccer League (PSL) with one point out of the six games they have played.\n\nThe Sugar Boys are marking their return to the topflight league after spending the whole of last season in the Eastern Region Division One League where they were crowned champions under the guidance of Masomere to get PSL promotion.\n\nTriangles new technical team\n\nHead Coach  Genesis Mangombe\n\nAssistant Coach  Newsome Mutema\n\nGoalkeepers Coach  Brito Gwere\n\nAnalyst  Desmond Mhene\n\nKit Manager  Arnold Chiveya\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/16182026/Dynamos-iinterim-coach-Genesis-Mangombe.jpg",
            "description": "<p>By Sports Reporter  TRIANGLE United Saturday evening officially announced the appointment of Genesis Mangombe as the new substantive head coach for the premiership side. Mangombe comes in as a replacement of Luke Masomere, who was fired by the club last week. The former Dynamos and Yadah gaffer joins Triangle from Tanzanian side Tebora United, where</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/triangle-united-appoints-mangombe-new-substantive-coach/\">Triangle United appoints Mangombe new substantive coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:29",
            "date": "21 Apr 2025"
        }
    ]
}