{
    "news": [
        {
            "title": "You are responsible for sanctions – Mudenda bluntly tells opposition MPs",
            "url": "https://www.newzimbabwe.com/you-are-responsible-for-sanctions-mudenda-bluntly-tells-opposition-mps/",
            "content": "By Staff Reporter\n\nIn a potential sign of overstepping, the Speaker of the National Assembly, Jacob Mudenda, bluntly told the opposition legislators that they are responsible for the economic sanctions on Zimbabwe.\n\nMudenda said this recently in the National Assembly during a Question and Answer session when Citizens Coalition for Change (CCC) legislator, Shakespeare Hamauswa, sought his protection after Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi insinuated that the opposition was responsible for the sanctions-induced downfall of the economy.\n\nWe are now developing a serious problem in this House. Whenever we passionately ask questions which are aimed at advancing the lives of Zimbabweans, we are met with insinuations that you are the owners of sanctions, you are the people who brought sanctions, which is not really fair, said Hamauswa.\n\nIn response, Mudenda bluntly told the National Assembly that the leaders of the opposition had invited economic sanctions on the country.\n\nThe element of sanctions is very genuine. If you recall the earlier leaders of the opposition, then MDC, they actually went to America to ask for those sanctions. Please recall. If you do not know your history, can you research on it? said Mudenda.\n\nSanctions have been a point of contention in Zimbabwean politics, with the ruling party ZANU PF using them as an excuse for the decay of the economy.\n\nThe economic ruin is marked by the comatose industry.\n\nThe government predicted to have lost millions in funding as a result of sanctions that were imposed by the United States of America and Britain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/13200646/Jacob-Mudenda-.jpg",
            "description": "<p>By Staff Reporter In a potential sign of overstepping, the Speaker of the National Assembly, Jacob Mudenda, bluntly told the opposition legislators that they are responsible for the economic sanctions on Zimbabwe. Mudenda said this recently in the National Assembly during a Question and Answer session when Citizens Coalition for Change (CCC) legislator, Shakespeare Hamauswa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-are-responsible-for-sanctions-mudenda-bluntly-tells-opposition-mps/\">You are responsible for sanctions – Mudenda bluntly tells opposition MPs </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "12 Sep 2025"
        },
        {
            "title": "Salisbury-based Zimbabwean woman growing creative business",
            "url": "https://www.newzimbabwe.com/salisbury-based-zimbabwean-woman-growing-creative-business/",
            "content": "Salisbury Journal\n\nA CREATIVE business is helping ethical brands grow through storytelling rooted in African heritage.\n\nMediabelle, based in Salisbury and founded by Claire White in December 2024, supports brands with a focus on sustainability, culture, and conservation.\n\nClaire, 44, lives in Old Sarum with her family, but she was born in Zimbabwe. She has been in Salisbury for 25 years now and built her marketing career in the UK, said: The recognition is encouraging because it shows theres a real appetite for purpose-driven marketing.\n\nBut more importantly, it shines a light on the brands and causes I get to represent. Their stories are what truly deserve the spotlight.\n\nMediabelles work has already earned national recognition.\n\nClaire was named Digital Marketer of the Year 2025 (Wiltshire) at the SME News Southern Enterprise Awards and has been shortlisted as a finalist in the UK Small Business Awards (Best Digital Marketing Business).\n\nZimasa Vodka(Image: Claire White)\n\nThe studios recent projects include Zimasa Vodka, a Zimbabwean-inspired premium drinks brand distilled in the UK; Lulu & Boo Sustainable Jeweller, an award-winning Wilton-based jeweller; and Tambarara Houseboat, a hospitality brand on Lake Kariba, Zimbabwe.\n\nOther clients include The Zuri Collection, a sustainable jewellery brand from Zimbabwe, and Brooke Bruk-Jackson, Miss Universe Zimbabwe 2023, for her perfume launch.\n\nClaire travelled to Lake Kariba to create a full content suite for Tambarara Houseboat.\n\nShe said: Shooting on Lake Kariba was a pinch-me moment. The houseboat experience is pure magic. Its where luxury meets the wild.\n\nMy role was to capture that atmosphere so international travellers could imagine themselves there.\n\nTambarara(Image: Claire White)\n\nHer work with Zimasa Vodka involved developing storytelling content that traced the journey of the masau fruit from Zimbabwe to the distillery in Wales.\n\nShe said: Zimasa Vodka is rooted in Zimbabwean pride, but it has the sophistication to sit on any UK bar shelf.\n\nI wanted the content to reflect both worldsbold and luxury, but also deeply authentic and community-driven.\n\nMediabelle also supports UK brands.\n\nClaire said: Working with Lulu & Boo was about showing that sustainability can be beautiful and stylish, not just ethical.\n\nLulu & Boo(Image: Claire White)\n\nShe recently collaborated with The Sober Supper Club LDN on a dining event at Twelve Eatery in Bournemouth.\n\nShe said: The Sober Supper Club LDN is proof that alcohol-free doesnt mean joy-free  its stylish, inclusive, and forward-thinking.\n\nLooking ahead, Mediabelle is developing new projects focused on tourism and wildlife conservation.\n\nClaire said: I believe storytelling is one of the most powerful tools we have.\n\nWhen people connect emotionally with a brand or a place, thats when real change and growth can happen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/11174430/claire-white.jpg",
            "description": "<p>Salisbury Journal A CREATIVE business is helping ethical brands grow through storytelling rooted in African heritage. Mediabelle, based in Salisbury and founded by Claire White in December 2024, supports brands with a focus on sustainability, culture, and conservation. Claire, 44, lives in Old Sarum with her family, but she was born in Zimbabwe. She has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/salisbury-based-zimbabwean-woman-growing-creative-business/\">Salisbury-based Zimbabwean woman growing creative business</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "12 Sep 2025"
        },
        {
            "title": "Zimbabwe will freeze most state hiring in 2026 to curb wage bill",
            "url": "https://www.newzimbabwe.com/zimbabwe-will-freeze-most-state-hiring-in-2026-to-curb-wage-bill/",
            "content": "Bloomberg\n\nZimbabwes government will freeze recruitment in most of its departments next year to contain the state wage bill, the nations finance ministry said.\n\nThe halt to hiring will exclude only the health, security and education departments,George Guvamatanga, the secretary for finance and economic development, said in a circular seen by Bloomberg News and confirmed by the ministry. The Zimbabwean government has proposed a freeze on headcount before, including in last years budget, though the policy hasnt been implemented.\n\nTreasury has noted with concern the size of the civil service in non-critical sectors, despite the recruitment freeze policy stance, Guvamatanga said. For 2026, the recruitment freeze will apply to all sectors with the exception of health, education and the security sector to a limited extent.\n\nZimbabwes government employs 330,000 people, whose wages account for about56%of the southern African nations 276.4 billion ZiG ($10.4 billion) budget. The International Monetary Fund in June cited public-sector pay as one of the key fiscal pressures the country faces.\n\nThe finance ministry plans to start the consultation process for the 2026 budget later this month. Guidelines will be issued by Sept. 20 that will include spending ceilings for government ministries, departments and agencies, according to the circular.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>Bloomberg Zimbabwe’s government will freeze recruitment in most of its departments next year to contain the state wage bill, the nation’s finance ministry said. The halt to hiring will exclude only the health, security and education departments, George Guvamatanga, the secretary for finance and economic development, said in a circular seen by Bloomberg News and confirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-will-freeze-most-state-hiring-in-2026-to-curb-wage-bill/\">Zimbabwe will freeze most state hiring in 2026 to curb wage bill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "12 Sep 2025"
        },
        {
            "title": "Mthuli Ncube slashes repetitive licensing fees after personal experience with ‘exorbitant’ restaurant registration charges",
            "url": "https://www.newzimbabwe.com/mthuli-ncube-slashes-repetitive-licensing-fees-after-personal-experience-with-exorbitant-restaurant-registration-charges/",
            "content": "ByAlois Vinga\n\nFinance Minister Mthuli Ncube has followed through on his pledge to overhaul Zimbabwes costly and repetitive licensing regime after experiencing first-hand the burden his wife faced while registering a restaurant in Bulawayo last year.\n\nFor years, the business community has decried multiple licensing requirements, with companies forced to pay separate fees for different departments operating under the same roof. For example, a supermarket must obtain separate bakery, butchery, restaurant, and liquor licences to operate fully.\n\nNcube, who last year told the Womens Prosperity Conference that his wife had presented him with a long list of licences required before opening her restaurant, admitted the system was excessive.\n\nOn the issue of licences, I totally agree with what women in business are saying. Just recently, my wife showed me a very long list of licences she had to pay before opening a restaurant in Bulawayo. Its just too much for a single business, Ncube said at the time, promising urgent reforms.\n\nNcube on Wednesday unveiled a raft of measures aimed at reducing the cost of doing business and improving Zimbabwes competitiveness.\n\nThe first tranche, which is targeting the agricultural value chain, has seen the requirement for a Small Scale Farmers registration fees of US$500 being scrapped, while the Dairy Processor Registration of US$350 per annum being reduced to a once-off US$50.\n\nFeed manufacturing registration fees were reduced from US$250 to US$20 while livestock movement clearance which attracted US$10 per herd, will now require US$5 per herd.\n\nThe livestock genetics import permit, which was pegged at US$100 will now attract just US$20 while the meat export registration, which was pegged at US$500 will now attract US$100.\n\nOther measures include scrapping food handler certificate fees and capping Environmental Impact Assessment (EIA) costs at 0.05% of project value, with a maximum of US$100,000.\n\nThe Agricultural Marketing Authority (AMA) livestock levy, biosafety permit, and the CBCA certificate are also among the charges that have been scrapped.\n\nThese reforms are part of governments commitment to ease the cost of doing business and create a more competitive economic environment, Ncube said.\n\nNew Licensing Fees\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga Finance Minister Mthuli Ncube has followed through on his pledge to overhaul Zimbabwe’s costly and repetitive licensing regime after experiencing first-hand the burden his wife faced while registering a restaurant in Bulawayo last year. For years, the business community has decried multiple licensing requirements, with companies forced to pay separate fees for different</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mthuli-ncube-slashes-repetitive-licensing-fees-after-personal-experience-with-exorbitant-restaurant-registration-charges/\">Mthuli Ncube slashes repetitive licensing fees after personal experience with ‘exorbitant’ restaurant registration charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:38",
            "date": "12 Sep 2025"
        }
    ]
}