{
    "news": [
        {
            "title": "Unlicensed driver jailed for speeding against oncoming traffic causing accident",
            "url": "https://www.newzimbabwe.com/unlicensed-driver-jailed-for-speeding-against-oncoming-traffic-causing-accident/",
            "content": "By James Muonwa\n\nAN unlicensed driver has been sent to prison for reckless driving against oncoming traffic, a stunt which caused an accident in Harare city centre.\n\nOscar Ngonidzashe Mushangazhike (32) from Kuwadzana suburb, Harare, appeared before the Harare Magistrates Court facing charges of reckless driving and driving without a valid licence.\n\nBesides imprisonment, the court also prohibited the offender from driving for two years.\n\nThe court heard that on September 9, 2025, at around 1530 hours, the offender drove against oncoming vehicles while speeding on a marked one-way road, Kenneth Kaunda Avenue in Harare Central Business District(CBD). As a result of his actions,Mushangazhikecaused an accident after he sideswiped another vehicle.\n\nTraffic police officers who attended the scene discovered that hedidnt have a drivers licence.\n\nThe court found him guilty on the following particulars: Count one: reckless driving, sentenced to 18 months in prison, with six months suspended for five years. He will serve an effective 12 months behind bars. Count two: driving without a licence, sentenced to a fine of US$80 and prohibited from driving for 24 months.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPA) noted that reckless driving has taken a toll, resulting in serious road carnage.\n\nReckless driving is a significant concern, and countless lives have been lost on our roads. The criminal justice system will not hesitate to deal with drivers who endanger the lives of others, the NPA said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By James Muonwa AN unlicensed driver has been sent to prison for reckless driving against oncoming traffic, a stunt which caused an accident in Harare city centre. Oscar Ngonidzashe Mushangazhike (32) from Kuwadzana suburb, Harare, appeared before the Harare Magistrates Court facing charges of reckless driving and driving without a valid licence. Besides imprisonment, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unlicensed-driver-jailed-for-speeding-against-oncoming-traffic-causing-accident/\">Unlicensed driver jailed for speeding against oncoming traffic causing accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        },
        {
            "title": "Kenyan President Ruto warns UN at 80th General Assembly: Adapt or Perish",
            "url": "https://www.newzimbabwe.com/kenyan-president-ruto-warns-un-at-80th-general-assembly-adapt-or-perish/",
            "content": "ByBernard Momanyi, Capital FM Nairobi\n\nPresident William Ruto used his address to the 80th United Nations General Assembly to deliver a blunt message: the UN must reform or risk drifting into irrelevance.\n\nHe argued that modernising the Security Council and overhauling the global financial system are not optional tweaks but the prerequisites for peace, climate delivery and equitable development  and he placed Africas representation at the centre of that effort.\n\nInstitutions rarely fail because they lack vision, Ruto said. They drift into irrelevance when they do not adapt, when they hesitate to act, and when they lose legitimacy.\n\nRuto opened with a history lesson. The League of Nations collapsed not for want of ideals but for lack of enforcement and inclusion. Eight decades after the UNs founding, he said, the system again faces a legitimacy test amid wars in Eastern Europe, the Middle East, the Sahel and the Horn of Africa, climate shocks, deepening inequality and technological disruption outpacing governance. Funding cuts and bureaucracy have sapped UN capacity, while the Security Council remains frozen in the post-war structures of 1945, unable to act inclusively, with fairness and with speed.\n\nYet he called the UN one of humanitys greatest achievements, citing everything from famine relief and refugee protection to eradicating smallpox and coordinating global health responses  proof, he said, that multilateralism works when it is properly equipped and genuinely representative.\n\nRutos core political demand was unambiguous: two permanent seats for Africa with full rights, including the veto, plus two additional non-permanent seats. Africa dominates much of the Security Councils agenda, contributes significant peacekeeping contingents and bears heavy costs of instability, yet remains the only continent without a permanent seat.\n\nYou cannot claim to be the United Nations while disregarding the voice of 54 nations, he said, invoking the Ezulwini Consensus and Sirte Declaration that have framed the African common position for two decades. Reform, he argued, is not a favour to Africa but essential to the UNs credibility and survival in the 21st century.\n\nPivoting from principles to practice, Ruto showcased Kenyas 15-month leadership of the Multinational Security Support (MSS) mission in Haiti under Security Council Resolution 2699. The mission, he said, worked in a volatile environment under enormous constraints, operating under-funded, under-equipped and below 40% of authorised strength. Even so, he listed tangible gains: the Presidential Palace restored as the seat of government; the national police headquarters and academy secured; more than 700 recruits graduating; schools reopened; roads cleared of gang checkpoints; kidnappings sharply reduced; and both airport and seaport back to normal operations.\n\nIf so much could be achieved with limited resources and stretched personnel within just 15 months, he asked, what more could have been accomplished if the United Nations fraternity had truly acted together in solidarity with the people of Haiti? With the mandate coming to an end in a few days, Ruto urged a careful, orderly transition and sustained, coordinated, undivided international attention so hard-won gains are not lost.\n\nOn human rights, Ruto insisted the protection of civilians and respect for international humanitarian law cannot be applied selectively. He voiced Kenyas grave concern over the humanitarian catastrophe in Gaza, called for the unconditional release of Israeli hostages, and backed a permanent ceasefire and a credible political process toward a two-state solution where Israel and Palestine live side by side, in peace and in security.\n\nTurning toSudan, he endorsed the Quad (Egypt, Saudi Arabia, the United Arab Emirates and the United States), saying there isno military solution. He urged all parties  including SAF, RSF and external actors  to respect Sudans sovereignty, unity and territorial integrity and rejected any attempts to divide the country.\n\nCalling climate change the single greatest threat of our age and also one of the greatest transformation opportunities, Ruto argued that ambition without affordable finance will not deliver. He highlighted Kenyas progress  93% of electricity generated from renewables (geothermal, wind, solar and hydro), along with investments in e-mobility, climate-smart agriculture, clean cooking, green manufacturing and circular-economy solutions. He pointed to Africas unified stance through the Nairobi Declaration (2023) and the follow-up at the second Africa Climate Summit in Addis Ababa two weeks ago, presenting Africa as a source of climate solutions, not merely a victim.\n\nBut implementation costs are steep: $56 billion to deliver Africas new NDCs. Ruto called on the global community to unlock the $300 billion agreed at Baku and accelerate negotiations toward a $1.3 trillion goal under the Baku-Belm Roadmap  and he tied this to a broader overhaul of the financial system.\n\nRuto argued the global financial architecture punishes poor countries while rewarding the rich. As evidence, he cited the IMFs most recent Special Drawing Rights allocation: 64% went to wealthy countries with little need for liquidity, while the poorest received just 2.4%. The outcome, he said, is a cycle of debt, high borrowing costs and inadequate emergency support that stalls climate action and development where it is most needed.\n\nHe proposed transforming Bretton Woods institutions into genuinely independent, apolitical global bodies, democratising decision-making and restoring credibility so the IMF and World Bank serve all countries fairly. In parallel, he spotlighted Africas own financial architecture: the Alliance of African Multilateral Financial Institutions (Afreximbank, Africa Finance Corporation, Trade and Development Bank, Shelter Afrique, Africa Re, ATIDI, ZEP-RE), and AU plans for an African Central Bank, African Monetary Fund and African Investment Bank, plus an African Credit Rating Agency that understands our realities and assesses risk with fairness and truth.\n\nDespite his critique, Ruto warned against cynicism: the UN remains humanitys best chance at global solidarity, with unique legitimacy and convening power. From refugee protection to more than 70 peace operations and the global vaccination push, the world can achieve together what no nation can accomplish on its own, however mighty. Kenya  host to UN headquarters in the Global South  backs the Secretary-Generals UN@80 renewal agenda and stands ready to help drive reform.\n\nThe 80th anniversary of the United Nations must be more than a commemoration, Ruto said. Let us seize this moment to re-imagine and rebuild the UN into a body that commands legitimacy, responds with speed, and delivers justice for all.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25164126/ruto-UN.jpeg",
            "description": "<p>By Bernard Momanyi, Capital FM Nairobi President William Ruto used his address to the 80th United Nations General Assembly to deliver a blunt message: the UN must reform or risk “drifting into irrelevance.” He argued that modernising the Security Council and overhauling the global financial system are not optional tweaks but the prerequisites for peace,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenyan-president-ruto-warns-un-at-80th-general-assembly-adapt-or-perish/\">Kenyan President Ruto warns UN at 80th General Assembly: Adapt or Perish</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        },
        {
            "title": "“Consider debt cancellation to alleviate the economic burden” – Zimbabwe Christian leaders say",
            "url": "https://www.newzimbabwe.com/consider-debt-cancellation-to-alleviate-the-economic-burden-zimbabwe-christian-leaders-say/",
            "content": "ACI Africa\n\nMembers of theZimbabwe Heads of Christian Denominations(ZHOCD) marked theInternational Day of Peacewith an appeal to the international community to cancel Zimbabwes debt, saying such a step would help revive the countrys economy, reduce poverty, and build lasting peace.\n\nZimbabwe is struggling with an US$8.3 billion debt, mostly in arrears, which blocks access to affordable international financing and slows economic recovery.\n\nIn a joint statementpublishedon X by theZimbabwe Council of Churches(ZCC), the ZHOCD body which consists of theZimbabwe Catholic Bishops Conference(ZCBC),Evangelical Fellowship of Zimbabwe(EFZ), and theUnion for Development of Apostolic Churches in Zimbabwe Africa(UDACIZA), the Christian leaders stressed that peace cannot be separated from social and economic well-being.\n\nOn this International Peace Day, we urge international partners to consider debt cancellation to alleviate the economic burden on our nation and local leadership to alleviate the situation and arrest the social evils that threaten the very fibre of our society, members of ZHOCD said in their collective statement dated September 21.\n\nSuch a step could enable Zimbabwe to redirect critical resources towards vital sectors like healthcare, education, and infrastructure development, addressing poverty and inequality, they added.\n\nThe Christian leaders from reflected on the state of peace in the Southern African nation, saying that despite the countrys good security, the people of God are still experiencing injustices and inequalities.\n\nThey noted that while Zimbabwe is not embroiled in outright violence or war, the situation of the country can be characterised as negative peace, a concept they said highlights the absence of direct violence but presence of underlying structural injustices and inequalities.\n\nThe Church leaders said Zimbabwe is grappling with economic hardships, political polarisation, and social injustices.\n\nThey specifically pointed out social ills like drug and substance abuse, gross domestic violence, and armed robberies that they described as a worrisome phenomenon that impacts the well-being of the people, particularly vulnerable groups like women, youths, and persons with disabilities.\n\nThe members of ZHOCD called upon all political leaders in Zimbabwe to prioritise peace, justice, and the human rights of Zimbabweans, especially the vulnerable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>ACI Africa Members of the Zimbabwe Heads of Christian Denominations (ZHOCD) marked the International Day of Peace with an appeal to the international community to cancel Zimbabwe’s debt, saying such a step would help revive the country’s economy, reduce poverty, and build lasting peace. Zimbabwe is struggling with an US$8.3 billion debt, mostly in arrears, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/consider-debt-cancellation-to-alleviate-the-economic-burden-zimbabwe-christian-leaders-say/\">“Consider debt cancellation to alleviate the economic burden” – Zimbabwe Christian leaders say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        },
        {
            "title": "Politburo Reshuffle: Mpofu demoted over failure to unite Zanu PF, suspected links to corruption dossier",
            "url": "https://www.newzimbabwe.com/politburo-reshuffle-mpofu-demoted-over-failure-to-unite-zanu-pf-suspected-links-to-corruption-dossier/",
            "content": "By Staff Reporter\n\nZanu PFs Obert Mpofu was removed from his influential position as the ruling party Secretary General amid suspicions he had knowledge of the origins of a corruption dossier recently tabled before the politburo.\n\nPresident Emmerson Mnangagwa reassigned Mpofu to the relatively minor post of Secretary for Information and Communication Technology (ICT) in a politburo reshuffle announced this week.\n\nZanu-PFs politburo is the partys highest decision-making body, and its resolutions are binding.\n\nAccording to Zanu PF activist Tonderai Chidawa, Mpofus demotion reflects concerns within the party over his leadership and his possible ties to the dossier that implicated senior officials in corruption.\n\nChidawa alleges Mpofu failed to unite the party, whose membership, he claims, is fragmented.\n\nMpofu was replaced by the Speaker of the National Assembly, Jacob Mudenda, who previously served as Treasurer General.\n\nSpeaking to a local online TV channel, Chidawa said, He (Mpofu) was failing to unite the party. The party is disintegrated.\n\nChidawa further questioned why Mpofus name was absent from the dossier, suggesting this as evidence that Mpofu had an idea of its source.\n\nWhy is his name not being mentioned in the dossier?\n\nOn Monday, Zanu PF spokesperson Christopher Mutsvangwa stated that the politburo did not discuss the dossier at length, claiming its originator was unknown but believed to be based in South Africa.\n\nThe dossier, which Mutsvangwa said the politburo barely acknowledged, included names such as controversial business tycoons Wicknell Chivayo and Kudakwashe Tagwirei. Vice President Constantino Chiwenga reportedly questioned Mnangagwa as to why those named as corrupt had not been arrested.\n\nChidawa also claimed that Zanu PFs grassroots support in the Matebeleland Provinces erupted in celebration upon hearing news of Mpofus demotion.\n\nPeople are celebrating. There are celebrations in Matebeleland. We are talking of the downfall of a man who owns many big buildings in Bulawayo and Victoria Falls, he said.\n\nThe Zanu PF succession war is reaching a new crescendo as factions aligned to Mnangagwa and Chiwenga vie for power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/02042119/Obert-Mpofu.jpg",
            "description": "<p>By Staff Reporter Zanu PF’s Obert Mpofu was removed from his influential position as the ruling party Secretary General amid suspicions he had knowledge of the origins of a corruption dossier recently tabled before the politburo. President Emmerson Mnangagwa reassigned Mpofu to the relatively minor post of Secretary for Information and Communication Technology (ICT) in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/politburo-reshuffle-mpofu-demoted-over-failure-to-unite-zanu-pf-suspected-links-to-corruption-dossier/\">Politburo Reshuffle: Mpofu demoted over failure to unite Zanu PF, suspected links to corruption dossier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        },
        {
            "title": "South African house duo Liquideep reunites after hiatus",
            "url": "https://www.newzimbabwe.com/south-african-house-duo-liquideep-reunites-after-hiatus/",
            "content": "Kaya 959\n\nBeloved South African house music duo Liquideep has officially reunited, ending a long hiatus that left fans longing for their signature sound.\n\nThe group, composed of Jonathan Ziyon Hamilton and Thabo Ryzor Shokgolo, made the exciting announcement on 24 September 2025, through a humorous video posted on the social media platform X.\n\nThe clip, which quickly went viral, shows the pair comically discussing their past fame before teasing their reunion, sparking a wave of excitement across social media.\n\nFormed in Johannesburg in 2007, Liquideep quickly rose to prominence, becoming a staple in the local music scene. Their debut album,Fabrics of the Heart, achieved multi-platinum status, producing chart-topping hits like Alone and Fairytale.\n\nThe duos success was cemented at the 2011 South African Music Awards, where they took home several accolades, solidifying their place as one of the countrys most successful house acts.\n\nFollowing their reunion announcement, Liquideep has already lined up several performances, with a show scheduled in Durban on 1 November and another in Bloemfontein. While the duo has not yet announced a new album, a recent remake of their classic track BBM has fans speculating about new material.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25160715/Liquideep-1.jpg",
            "description": "<p>Kaya 959 Beloved South African house music duo Liquideep has officially reunited, ending a long hiatus that left fans longing for their signature sound. The group, composed of Jonathan “Ziyon” Hamilton and Thabo “Ryzor” Shokgolo, made the exciting announcement on 24 September 2025, through a humorous video posted on the social media platform X. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-house-duo-liquideep-reunites-after-hiatus/\">South African house duo Liquideep reunites after hiatus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        },
        {
            "title": "Nketsi denies rumours she is dating Mbau’s partner Kudzai Mushonga",
            "url": "https://www.newzimbabwe.com/nketsi-denies-rumours-she-is-dating-mbaus-partner-mushonga/",
            "content": "The Citizen\n\nReality TV star Faith Nketsi has set the record straight on claims she is dating Khanyi Mbaus partner, Kudzai Mushonga.\n\nGossip blogMaphepha Ndabaclaimed Nketsi was Mushongas new flame, posting a picture of the two together.\n\nNketsi has since denied the rumours, explaining that Mushonga and another man, who was cropped out of the picture, asked to take a photo with her.\n\nPlease neh. Since no one wants to come forward and say something, therefore creating a false narrative. Im not with Kudzai. NEVER WILL, NEVER BEEN AND NEVER WOULD BE. Can a girl just travel in peace? Nketsi wrote on her Instagram Stories.\n\nNketsi has not gone public with a relationship since her split from businessman Nzuzo Njilo, which ended in divorce in November 2023, less than a year aftertheir April 2022 wedding.\n\nNketsi and herHave Faithcast member and friend Andzelo Tivani are currently travelling.\n\nA few days ago, they jetted off to Germany for Drakes $ome $pecial $hows 4 EU ($$$4EU) tour, which made a stop in Hamburg.\n\n24 hours in Germany to catch Drake concert, Nketsi wrote, captioning pictures and videos of their trip.\n\nOn Wednesday, she shared more travel content from Italy, including a boat cruise and lunch at a beachside restaurant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25154030/nketsi-kudzai.png",
            "description": "<p>The Citizen Reality TV star Faith Nketsi has set the record straight on claims she is dating Khanyi Mbau’s partner, Kudzai Mushonga. Gossip blog Maphepha Ndaba claimed Nketsi was Mushonga’s new flame, posting a picture of the two together. Nketsi has since denied the rumours, explaining that Mushonga and another man, who was cropped out of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nketsi-denies-rumours-she-is-dating-mbaus-partner-mushonga/\">Nketsi denies rumours she is dating Mbau’s partner Kudzai Mushonga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        },
        {
            "title": "Teen sentenced for sexually violating neighbour’s hen",
            "url": "https://www.newzimbabwe.com/teen-sentenced-for-sexually-violating-neighbours-hen/",
            "content": "By Staff Reporter\n\nIn a bizarre incident in Manicaland, a 19-year-old man has been convicted of bestiality after storming a neighbours fowl run and sexually violating a hen.\n\nThe accused, Carrington Mutasa, appeared before Mutare Magistrates Court, where he was sentenced to 18 months in prison. Three months were suspended for five years, while the remainder was commuted to 175 hours of community service.\n\nProsecutors told the court that on September 16, 2025, around 5:30 p.m., Mutasa entered a deserted homestead in Piki Village, Zimunya, Mutare. He proceeded to the fowl run, grabbed a hen, and engaged in sexual activity with the animal.\n\nAs he left the scene, he was spotted by the complainants granddaughter, who alerted elders. Upon inspection, the hens owner discovered evidence of violation on the bird.\n\nNeighbours were informed, and together they apprehended Mutasa, who later confessed. A police report was filed at Zimunya Police Station, leading to his arrest and court appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25111908/hen.png",
            "description": "<p>By Staff Reporter In a bizarre incident in Manicaland, a 19-year-old man has been convicted of bestiality after storming a neighbour’s fowl run and sexually violating a hen. The accused, Carrington Mutasa, appeared before Mutare Magistrates Court, where he was sentenced to 18 months in prison. Three months were suspended for five years, while the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-sentenced-for-sexually-violating-neighbours-hen/\">Teen sentenced for sexually violating neighbour’s hen</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:00",
            "date": "25 Sep 2025"
        }
    ]
}