{
    "news": [
        {
            "title": "From Silicon Valley to Hollywood: Zimbabweans making a mark in the United States",
            "url": "https://www.newzimbabwe.com/from-silicon-valley-to-hollywood-zimbabweans-making-a-mark-in-the-united-states/",
            "content": "By Staff Reporter\n\nThe United States of America has long been seen as a land of opportunitya place where dreams in various fields can become reality.\n\nWhether that belief holds for everyone is a matter of debate. However, what is undeniable is that many Zimbabweans who have migrated to the U.S. are breaking barriers and achieving remarkable success across diverse sectors.\n\nFrom leading in boardrooms and driving innovation in Silicon Valley, to topping music charts and making their mark in award-winning films, the Zimbabwean story in the U.S. continues to inspire.\n\nNewZimbabwe.comtakes a closer look at some of the Zimbabweans making waves in the United States.\n\nJames Manyika\n\nJames Manyika\n\nManyika is the senior vice president of research, technology and society at Google and co-chair of the UN Secretary-Generals high-level advisory body on AI. Manyika has been working in the Silicon Valley in the United States of America for more than 20 years. He has, over the years, emerged as one of the brilliant minds in technology to have ever emerged from Zimbabwe.\n\nDanai Gurira\n\nGurira is renowned for her work as an actress and playwright. She has featured on a number of projects, which includeThe Walking Dead, Black PantherandMichonne.It is her fearless role as Okoye onBlack Panther,a Marvel Cinematic project that Gurira is widely remembered for. Gurira effortlessly brought the Warrior character to life, defying the stereotypes that African women have been subjected to. Despite being a household name in the United States, Gurira has been ploughing her experiences home through Almasi Collaborative Arts, which has been training actors and playwrights.\n\nTongai Chirisa\n\nTongai Chirisa\n\nChirisa rose to prominence on local soapie Studio 263 playing the character of detective Trevor Davies. Since then Chirisa has not looked back and has found himself rubbing shoulders with elite acting stars in the United States. He has transformed himself into a Hollywood star. Chirisa recently featured on the AssasinsCreed Shadows.Chirisa has also appeared onNCIS Los Angeles, Robinson Crusoe, AMC horror Mayfair Witchesandhorror movie Antebellum.\n\nAnnatoria\n\nAnnatoria\n\nBlessing Annatoria Chitapa was born in Zimbabwe but was raised in England. Annatoria moved from England to the United States of America where she has been pursuing her musical career. Despite growing up singing in church, Annatoria got a breakthrough when she won the Voice UK in 2020. Recently, she performed at Sarah Jakes Roberts Woman Evolve Conference.\n\nTanyaradzwa Muzinda\n\nTanya Muzinda\n\nMuzinda is a 21-year-old motorcross sensation. Muzinda started her career at a tender age of fiveandwon diferent races. Muzinda left Zimbabwe with her family in 2019 and has competed in major motorcross events in the United States. Away from the tracks, Muzinda has also used her voice to speak out against societal ills like corruption and drug abuse which have become rampant in Zimbabwe. Muzinda has been using her influence on the tracks to make a postive impact on vulnerable children by paying for their tution fees.\n\nThandiwe Newton\n\nThandiwe Newton\n\nNewton was born to a Zimbabwean mother in Britain. Newton, an award-winning actress, claims close ties to the Liberaton war Hero Herbet Chitepo, who was a family friend. Newton has gone on to carve her heroine status by featuring on ytheLine of Duty Mission Impossible, Star Wars Storyand Tyler PerrysGood Deedsmovies.\n\nThemba Gorimbo\n\nGorimbo is a mixed martial artist making a name for himself in the UFC. Known for his resilience and inspiring journey from rural Zimbabwe to the global MMA stage, Gorimbo has become a symbol of determination and perseverance. Outside the octagon, he has captured hearts with his humility and philanthropy, most notably after revealing he had just $7 to his name before winning a crucial fight, a story which grabbed Dwayne The Rock Johnsonss attention.\n\nDumisani Draze Maraire\n\nDumi Draze Maraire\n\nMaraire comes from the musical royalty. He is the son of the late Abraham Dumisani Maraire, who was a master performer who specialised in Mbira. Maraire Junior is the younger brother of Chiwoniso Maraire. Known in the music circles as Draze, Maraire has proved that Mbira rhythm flows in his blood. He has fused the Mbira instrument with the Hip-Hop sound.\n\nZivanai Masango\n\nZivanai Masango\n\nMasango is arguably the unsung hero of Zimbabwean music, having assisted several local artists. Masngo worked with a number of artists  the late Jackie Madondo, Ivy Kombo, Fungisai Mashavave, Vuyo Mokoena and Thembinkosi. Masango was also part of Thomas Mapfumos The Blacks Unlimited. From 2012 to 2015, Masango was part of Oliver Mtukudzis Black Spirits. Using the experience of working with the music legends, Masango is on his own musical path in the United States. Amid COVID-19, Msango brought to life yester-years classics on his YouTube channel. Masango boasts of three albums: Pachedu (2005), Dut-Storm (2007) and Its Time (2014).\n\nJulian King\n\nJulian King\n\nJulian Kanombirira is a Zimbabwean musician based in the United States. Julian King has refused to allow distance to distract his talent from blowing in his country of birth. Julian King rose to prominence with his songRwendowhich was released in 2021. Since then, Julian King has not looked back, releasing hits such asOne by OneandOxygenamong others.\n\nTinashe Kachingwe\n\nTinashe Kachingwe\n\nKachingwe is a multi-platinum-certified R&B singer, dancer, songwriter and actress. Known as Tinashe, Kachingwe was born in the United States to Zimbabwean father Michael Kachingwe and an American mother. She made acting appearances onCora Unashamed, The Polar ExpressandTwo and a Half Men.On the music scene, Tinashe hogged the limelight with the songOnfeaturing Schoolboy Q and has gone on to work with music giants such as Chris Brown.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/06074108/Danai-Gurira-Black-Panther.webp",
            "description": "<p>By Staff Reporter  The United States of America has long been seen as a land of opportunity—a place where dreams in various fields can become reality. Whether that belief holds for everyone is a matter of debate. However, what is undeniable is that many Zimbabweans who have migrated to the U.S. are breaking barriers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-silicon-valley-to-hollywood-zimbabweans-making-a-mark-in-the-united-states/\">From Silicon Valley to Hollywood: Zimbabweans making a mark in the United States</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:42",
            "date": "06 Aug 2025"
        },
        {
            "title": "Not an isolated case – nurses association slams govt for neglecting bedridden nurse injured on duty seven years ago",
            "url": "https://www.newzimbabwe.com/not-an-isolated-case-nurses-association-slams-govt-for-neglecting-bedridden-nurse-injured-on-duty-seven-years-ago/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Nurses Association (ZINA) has strongly condemned the governments neglect of a Bikita nurse, Progress Muzuva, who was severely injured while on duty seven years ago, calling her case a tragic example of systemic abandonment of front-line health workers.\n\nShe has since been denied compensation, medical support, and justice by the government for which she worked.\n\nIn a statement Tuesday, ZINA president Enock Dongo said Muzuvas case is not an isolated incident and demanded an investigation into the matter.\n\nZINA demands a full investigation into how this matter was handled from the district authorities all the way up to head office.\n\nThose responsible for this neglect must be held accountable. What happened to Nurse Muzuva is not an isolated incident; this is just a drop in the ocean.\n\nAcross Zimbabwe, many nurses are injured while carrying out their duties, some in ambulance accidents while escorting patients, others while lifting immobile patients in wards, Dongo said.\n\nAccording to the nurses association, many health workers get injured on duty and receive no support, treatment, nor compensation.\n\nMany are left to suffer silently in their homes, unable to afford care with the meagre salaries they earn.\n\nThis culture of abandonment is pushing nurses out of the public service and out of the country to search for greener pastures elsewhere.\n\nWe ask again: Who will care for the carers? If the system fails to protect those who risk their lives for patients, then it has failed entirely.\n\nZINA calls on all relevant stakeholders to intervene urgently in Muzuvas case. She must receive immediate medical assistance, financial support, and justice. Her case should set a precedent for change, Dongo added.\n\nMuzuva told this publication that since 2018, the Health Ministry has been refusing to help her from the district level up to the ministers office.\n\nMuzuva was attacked by a violent maternity patientwhom she was escorting to Silveira Hospital in Masvingo for emergency care.\n\nThe violent patient wanted to kill herself and her newborn baby in what medical experts say could have been a case of severe postpartum psychosis.\n\nMuzuva saved the patient and her newly born baby but injured her spine and leg in the process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04042411/Screenshot_20250804-051338_2.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Nurses Association (ZINA) has strongly condemned the government’s neglect of a Bikita nurse, Progress Muzuva, who was severely injured while on duty seven years ago, calling her case a tragic example of systemic abandonment of front-line health workers. She has since been denied compensation, medical support, and justice by the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-an-isolated-case-nurses-association-slams-govt-for-neglecting-bedridden-nurse-injured-on-duty-seven-years-ago/\">Not an isolated case – nurses association slams govt for neglecting bedridden nurse injured on duty seven years ago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:42",
            "date": "06 Aug 2025"
        },
        {
            "title": "A sculpture garden boosts environmental action in Harare",
            "url": "https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/",
            "content": "By Tawanda Mupatsi| DW\n\nZimbabwes capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation?\n\nIn Harare, Zimbabwes capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmentalconservation. The park is a sanctuary where sculptors carve stone works of art inspired byanimalsand other natural forms. It, in turn is designed to protectnature. Indigenous native species have been planted there to help preserve them. Artist and park manager Nicholas Kadzungura explains that they are threatened bydeforestation. The garden, founded in 1970 and named after the sacred Bateleur Eagle, serves as both a creative hub and a living classroom, where visitors learn aboutZimbabwes rich ecological and cultural heritage.\n\nMany sculptures in the park reflect Zimbabwes environmental challenges. Friend of the Rhino, a piece by the late Joseph Ndandarika, which encourages empathy and the protection ofendangered species. With only around 600 black rhinos left in Zimbabwe, the message is pressing. Marcey Mushore, the parks director, explains how animistic Shona traditions guide conservation efforts. The park also acts as agreen lungfor Hararesurban sprawl. Some 2.4 million people live in its metropolitan area and pollution and disappearing green spaces are a problem.\n\nChapungus artists are committed to sharing ancestral knowledge through sculpture workshops and educational programs. Kadzungura stresses that Zimbabwes traditional stone art is not just decorativeit carries lessons about coexistence with nature. Asclimate changeand urban development threaten the countrys wetlands andbiodiversity, the parks mission is becoming more vital. Chapungu inspires action by blending creativity, tradition, and environmental stewardship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05181947/sculpture-garden.jpeg",
            "description": "<p>By Tawanda Mupatsi | DW Zimbabwe’s capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation? In Harare, Zimbabwe’s capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmental conservation. The park is a sanctuary where sculptors carve stone works of art inspired by animals and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/\">A sculpture garden boosts environmental action in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:42",
            "date": "06 Aug 2025"
        },
        {
            "title": "Afreximbank to fund study for 1-GW floating solar project in Zimbabwe",
            "url": "https://www.newzimbabwe.com/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe/",
            "content": "African Export-Import Bank, or Afreximbank, has signed a heads of terms agreement to provide USD 4.4 million (EUR 3.80m) to support a 1-GW hybrid floating solar project on Lake Kariba in Zimbabwe.\n\nThe financing facility will be extended to Green Hybrid Power Private Limited to fund the bankability and feasibility studies for the project and the procurement of transaction advisers. It is expected to unlock an estimated USD 350 million in investment.\n\nThe plan is to build the solar park in two phases, starting with the installation of 500 MW of power-generating capacity. The pilot stage will supply electricity to the Intensive Energy Users Group, a consortium of large industrial and mining companies, under a 20-year take-or-pay power purchase agreement (PPA).\n\nThe agreement was signed during the 32nd Annual Meetings of Afreximbank (AAM2025). It was one of four project preparation deals inked at the event, which are collectively expected to catalyse around USD1 billion in investments.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05182552/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe-1279691-1754396766.webp",
            "description": "<p>Renewables Now African Export-Import Bank, or Afreximbank, has signed a heads of terms agreement to provide USD 4.4 million (EUR 3.80m) to support a 1-GW hybrid floating solar project on Lake Kariba in Zimbabwe. The financing facility will be extended to Green Hybrid Power Private Limited to fund the bankability and feasibility studies for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afreximbank-to-fund-study-for-1-gw-floating-solar-project-in-zimbabwe/\">Afreximbank to fund study for 1-GW floating solar project in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:42",
            "date": "06 Aug 2025"
        },
        {
            "title": "South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans",
            "url": "https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/",
            "content": "By Thandiwe Garusa\n\nPublic Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals.\n\nThere have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring countrys already stretched public resources.\n\nAmong these groups is Operation Dudula in Gauteng, which has been actively preventing undocumented immigrants from accessing healthcare.\n\nIn an interview on Monday, ZHRC Chairperson Jessie Majome told South African broadcaster Newzroom Afrika that she recently had discussions with PPSA to resolve the issue of healthcare denial for Zimbabweans.\n\nMajomesinterview triggered a public uproar from South Africans condemning the PPSA for allowing Zimbabweans to fight for rights in a foreign country instead of fighting for the same healthcare access in their country.\n\nHowever, in a statement Tuesday, PPSAspokesperson Ndili Msokidenied Majomes claims, saying there was never any discussion around healthcare issues specifically affecting Zimbabwean nationals.\n\nThe PPSA said that when it hosted a ZHRC delegation last year, the discussions focused on institutional strengthening, corruption, and service delivery challenges in both countries but did not address migrant access to healthcare.\n\nFollowing numerous media inquiries, the PPSA wishes to clarify that it has no record of a complaint lodged by the ZHRC in relation to the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nAt no point did the discussions then, nor recently, focus on the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nRather, the discussions were about, among other things, the state of the healthcare systems in both countries.\n\nAccordingly, the PPSA also referred to its own investigation into the state of the healthcare system in South Africa as a guide for the ZHRC to conduct similar investigations in its own country,Msoki said.\n\nThe PPSA also emphasised that it has not received any complaint of that nature.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa Public Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals. There have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring country’s already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/\">South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:42",
            "date": "06 Aug 2025"
        }
    ]
}