{
    "news": [
        {
            "title": "In Pictures: At least 17 killed in Seke Road accident",
            "url": "https://www.newzimbabwe.com/in-pictures-at-least-17-killed-in-seke-road-accident/",
            "content": "AT LEAST 17 people were killed in an accident which occurred along Seke Road on Tuesday morning when a haulage truck collided with a commuter omnibus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133056/1000794251-scaled.jpg",
            "description": "<p>AT LEAST 17 people were killed in an accident which occurred along Seke Road on  Tuesday morning when a haulage truck collided with a commuter omnibus. Below are some images from the accident scene. Pictures by Tapiwa Svondo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-at-least-17-killed-in-seke-road-accident/\">In Pictures: At least 17 killed in Seke Road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "17 die in Seke road accident",
            "url": "https://www.newzimbabwe.com/17-die-in-seke-road-accident/",
            "content": "By Mary Taruvinga\n\nA total of 17 people have been confirmed dead by rescue and medical teams following a horror crush involving a haulage truck and a commuter omnibus along Seke road, Harare this morning.\n\nThe fatal accident took place at Hunyani Bridge near Water Works.\n\nAmong the 17, the first two were hit by the 30 tonne haulage truck before it crushed the commuter omnibus which remained trapped for a long time before rescue came.\n\nThree other victims were rushed to hospital in critical conditions.\n\nIn first videos that went viral on social media, victims could be heard crying.\n\nAuthorities are yet to give an account of what happened.\n\nHowever, some eye witnesses said the truck was traveling to Harare while the commuter omnibus was headed for St Marys when the crush happened.\n\nIt is believed that a Honda Fit veered into the lane of the truck causing the driver to serve into the opposite lane resulting in a head-on collision with the commuter omnibus.\n\nThe kombi was dragged before it was crushed under the truck.\n\nVictims are yet to be identified.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133056/1000794251-scaled.jpg",
            "description": "<p>By Mary Taruvinga A total of 17 people have been confirmed dead by rescue and medical teams following a horror crush involving a haulage truck and a commuter omnibus along Seke road, Harare this morning. The fatal accident took place at Hunyani Bridge near Water Works. Among the 17, the first two were hit by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/17-die-in-seke-road-accident/\">17 die in Seke road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Brendan Taylor set to return to face NewZealand after three-year ban",
            "url": "https://www.newzimbabwe.com/brendan-taylor-set-to-return-to-face-newzealand-after-three-year-ban/",
            "content": "NZ Herald\n\nFormer Zimbabwe cricket captain Brendan Taylor is set to face the Black Caps just days after his three-and-a-half-year ban from cricket is lifted, according to reports.\n\nTaylor was handed the ban in 2022 for breaching the ICCs anti-corruption code after he admitted to taking money from match-fixers in India  but claimed he never fixed or manipulated games.\n\nHis ban officially expires on Saturday, after which he will be named in the Zimbabwe test squad to face the Black Caps, with the first test beginning on July 30, Cricinfo reports.\n\nThe 39-year-old has previously played 34 tests including leading Zimbabwe to a close defeat to the Black Caps in 2011, in which he scored a century in the fourth innings before the home side fell 34 runs short of victory.\n\nTaylor admitted he took money from match-fixers who tried to blackmail him into manipulating international games with a secret video of him using cocaine on a visit to India in 2019.\n\nEven though he took US$15,000 ($25,000) from the fixers, Taylor said he never fixed or manipulated games.\n\nTaylor said he was invited to India to discuss a sponsorship opportunity in October 2019. At a dinner with businessmen, he was offered cocaine and foolishly took the bait.\n\nThe following morning, the same men entered my hotel room to show me a video taken of me the night before doing cocaine and told me that if I did not partake in spot fixing at international matches, the video would be released to the public, Taylor said.\n\nTaylor said he took the US$15,000 from the men, who said it was now a deposit for him to fix and they promised him another US$20,000 ($33,500) once the fixing job was complete.\n\nTaylor took four months to report the incident to the ICC and accepted that was against crickets anti-corruption rules.\n\nThe Black Caps and Zimbabwe will play a two-test series with both matches taking place in Bulawayo.\n\nZimbabwe have already named a 16-man squad which includes four changes following a 2-0 series defeat to South Africa last month, with Ben Curran, Sikandar Raza, Roy Kaia and Tanunurwa Makoni joining the side. Cricinfo reports Taylor is expected to be added to the squad.\n\nTaylor told Cricinfo in March that he has been using facilities at an elite independent school in Harare, preparing for his return.\n\nI still want to play and I believe I could make an impact as a player, he said.\n\nI look at where Im at physically and mentally and if I didnt feel I could do it, I wouldnt bother. Givemore [Makoni, managing director of Zimbabwe Cricket] has really supported me on this. He sort of shut down the coaching role for now and said, Can you play and try to push yourself up until the 2027 World Cup? Granted Ill be 41 then but with sobriety, Im living my truest form.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/16073556/brendan-taylor-e1581839069251.jpg",
            "description": "<p>NZ Herald Former Zimbabwe cricket captain Brendan Taylor is set to face the Black Caps just days after his three-and-a-half-year ban from cricket is lifted, according to reports. Taylor was handed the ban in 2022 for breaching the ICC’s anti-corruption code after he admitted to taking money from match-fixers in India – but claimed he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-taylor-set-to-return-to-face-newzealand-after-three-year-ban/\">Brendan Taylor set to return to face NewZealand after three-year ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Sables coach proves critics wrong after making World Cup qualification history",
            "url": "https://www.newzimbabwe.com/sables-coach-proves-critics-wrong-after-making-world-cup-qualification-history/",
            "content": "By Sports Reporter\n\nWhen Piet Benade was appointed head coach to lead the Sables in March last year, not many gave him a chance.\n\nThe 43-year-old gaffer was heavily criticised with many doubting his pedigree, including former rugby administrator Themba Mliswa.\n\nIm very disappointed how we still seem insecure to trust our own local coaches to lead the national team.\n\nWho is this guy, and what level has he been coaching? We keep importing mediocre coaches who cant measure up to the requisite level, wrote Mliswa after Benades appointment.\n\nTo prove his critics wrong, Benade guided Zimbabwe to win the 2024 Rugby Africa Cup, a historical achievement.\n\nThe former Old Hararians gaffer on Saturday led Zimbabwe to defend the title, becoming the first Zimbabwean coach to win the Rugby Africa Cup trophy back-to-back.\n\nSo important was the victory that it came with a 2027 Rugby World Cup qualification ticket.\n\nThe true magnitude of what has been achieved has not yet set in, to be honest.\n\nWe are obviously very proud of our group for the work that was put in and very happy that the vision we set out 18 months ago has become a reality, Sables coach Piet Benade told New Zimbabwe.com.\n\nZimbabwe last featured at a rugby World Cup in 1991, and Benades recent success saw him end the nations 34-year wait.\n\nThe 43-year-old gaffer has, however, hinted that the greater challenge of preparing for the World Cup is now his focus.\n\nWe knew we had to go out and do something special to change what has happened for 30 years.\n\nWe hope that this will inspire and give the belief that Zimbabweans can be excellent.\n\nThe next step is obviously very daunting, but we are excited by the challenge of what is to come, he added.\n\nZimbabwe Sables are expected to arrive in the country on Tuesday evening at Robert Mugabe International Airport in Harare.\n\nThe Zimbabwe Rugby Union supporter union is set to give the team a heros welcome.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22104131/piet-benade.jpg",
            "description": "<p>By Sports Reporter When Piet Benade was appointed head coach to lead the Sables in March last year, not many gave him a chance. The 43-year-old gaffer was heavily criticised with many doubting his pedigree, including former rugby administrator Themba Mliswa. “I’m very disappointed how we still seem insecure to trust our own local coaches</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-coach-proves-critics-wrong-after-making-world-cup-qualification-history/\">Sables coach proves critics wrong after making World Cup qualification history</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Malcolm-Jamal Warner, The Cosby Show star, dies aged 54",
            "url": "https://www.newzimbabwe.com/malcolm-jamal-warner-the-cosby-show-star-dies-aged-54/",
            "content": "BBC\n\nMalcolm-Jamal Warner, an actor best known for his role as Theo Huxtable on The Cosby Show, has died.\n\nWarner, who was 54, drowned at the weekend while on holiday in Costa Rica, local authorities said.\n\nWarner appears to have been dragged out to sea by a swift ocean current while swimming at Playa Grande around 14:00 (20:00 GMT) local time on Sunday in Cocles, a town in the province of Limn, Costa Ricas Judicial Investigation Agency said.\n\nWarner played the son of Bill Cosby on the hugely popular US sitcom from 1984-1992. Tributes swiftly poured in from celebrities, including Questlove, Jennifer Hudson, Taraji P Henson, Jennifer Love Hewitt and Magic Johnson.\n\nAuthorities said bystanders rescued Warner and brought him to shore, where the Costa Rican Red Cross tried to treat him, but he was declared dead at the scene.\n\nHe is survived by his wife and daughter.\n\nWarner was Emmy-nominated in the Outstanding Supporting Actor in a comedy series for his work on The Cosby Show in 1986.\n\nHe was handpicked for his breakout role by Cosby on the final day of a nationwide audition.\n\nI was literally the last person they saw, he recalled in a 2023 interview.\n\nThe Cosby Show ranked as the number one TV show for five seasons from 1985-90. It portrayed a cosy middle-class family  a relatively rare depiction at the time of black Americans on television.\n\nWhen the show first came out, there were white people and black people talking about [how] the Huxtables dont really exist, black people dont really live like that, Warner said in a 2013 interview.\n\nMeanwhile, we were getting tens of thousands of fan letters from people saying, Thank you so much for this show.'\n\nAfter The Cosby Show, Warner appeared in several other television programmes including Malcom & Eddie, alongside comedian Eddie Griffin.\n\nGriffin paid respects to him on social media after his death, writing R.I.P. King and My big little brother.\n\nWarner had guest appearances on The Fresh Prince of Bel-Air and Sesame Street. More recently, he played AJ Austin, a cardio-thoracic surgeon on the medical drama series The Resident.\n\nWarner also won a Grammy for Best Traditional R&B Performance in 2015, alongside Robert Glasper and Lalah Hathaway for their cover of Stevie Wonders song Jesus Children of America.\n\nHis spoken word album Hiding In Plain View garnered him another Grammy nomination in 2023.\n\nLast year, he started a podcast  Not All Hood  which discussed mental health in the black community.\n\nFormer co-stars and fans has been posting their tributes to him online.\n\nBasketball star Magic Johnson, who appeared in an AIDS awareness video directed by Warner, wrote that he and his wife were both super fans of the hit Cosby Show and continued to follow his career over the years.\n\nEvery time I ran into Malcolm, we would have deep and fun conversations about basketball, life, and business. He will truly be missed, Johnson wrote.\n\nActress Jennifer Love Hewitt called him a gentleman and an incredible talent.\n\nActress Vivica A Fox posted that she was stunned and saddened by his sudden death, writing: Thanks for ya gifts, king.\n\nTracee Ellis Ross, who starred with Warner on Reed Between the Lines, also mourned him, writing: My heart is so so sad.\n\nWhat an actor and friend you were: warm, gentle, present, kind, thoughtful, deep, funny, elegant. You made the world a brighter place.\n\nSending so much love to your family. Im so sorry for this unimaginable loss.\n\nActress Taraji P Henson posted: Malcolm, we grew up with you. Thank you for the art, the wisdom, the grace you gave us!!!!!\n\nYou left the world better than you found it. Rest easy, king!!!! Your legacy lives far beyond the screen.\n\nActress Niecy Nash posted that she had recently spoken to Warner.\n\nWe talked about how happy we both were in our marriages. Damn friend. You were cornerstone of The Cosby Show.\n\nWe all loved Theo! Never to be forgotten. You will be missed. Rest Easy.\n\nGeorgia Senator Raphael Warnock also praised Warner, writing in a post: For me and so many in my generation, Malcolm-Jamal Warner was a part of our childhood, a brother whose character Theo felt like one of my own.\n\nMay God grant peace to his soul, strength and grace to his grieving family.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22081900/malcolm-jamal.jpg",
            "description": "<p>BBC Malcolm-Jamal Warner, an actor best known for his role as Theo Huxtable on The Cosby Show, has died. Warner, who was 54, drowned at the weekend while on holiday in Costa Rica, local authorities said. Warner appears to have been dragged out to sea by a swift ocean current while swimming at Playa Grande</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malcolm-jamal-warner-the-cosby-show-star-dies-aged-54/\">Malcolm-Jamal Warner, The Cosby Show star, dies aged 54</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "22 Jul 2025"
        },
        {
            "title": "Zimbabwe’s export of minerals used in battery production surges 30%",
            "url": "https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/",
            "content": "Reuters\n\nPrices of lithium  used in batteries to power renewable energy technologies  have tumbled nearly 90% over the past two years, mainly due to oversupply, but producers remain positive about the metals long-term prospects amid a global push towards cleaner energy sources and electric vehicles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/24130533/Lithium-Mining.jpeg",
            "description": "<p>Reuters  Zimbabwe’s exports of spodumene concentrate, a lithium-bearing mineral essential for battery production, surged 30% in the first half of 2025 despite weak global lithium prices, official statistics show. Africa’s top lithium producer exported 586,197 metric tons of spodumene concentrate between January and June, compared to 451,824 metric tons during the same period last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/\">Zimbabwe’s export of minerals used in battery production surges 30%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "22 Jul 2025"
        }
    ]
}