{
    "news": [
        {
            "title": "Mwazha dies aged 107",
            "url": "https://www.newzimbabwe.com/mwazha-dies-aged-107/",
            "content": "By Staff Reporter\n\nClergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107.\n\nMwazha passed away on Thursday after a long illness.\n\nIn a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader.\n\nGood morning! The African Apostolic Church, VaApostora veAfrica.\n\nI regret to inform you that our Archbishop, Paul Mwazha of Africa, our church leader, has just passed on today, November 20, 2025. He has departed from us, but in spirit we are together with him.\n\nMore information will be released in due course. Any further announcements will be released in due course. Kudzai Jehovah, Kudzai Jehovah, said Mhizha.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20100021/mwazha-.jpg",
            "description": "<p>By Staff Reporter Clergyman and founder of the African Apostolic Church, Archbishop Paul Mwazha, has died aged 107. Mwazha passed away on Thursday after a long illness. In a statement, African Apostolic Church General Secretary Jeshua Mhizha confirmed the death of the church leader. “Good morning! The African Apostolic Church, VaApostora veAfrica. “I regret to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwazha-dies-aged-107/\">Mwazha dies aged 107</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "“A proud moment for Africa” – Miniyothabo Chiwenga celebrates historic appointment as first African non-model Miss Universe judge",
            "url": "https://www.newzimbabwe.com/a-proud-moment-for-africa-miniyothabo-chiwenga-celebrates-historic-appointment-as-first-african-non-model-miss-universe-judge/",
            "content": "By Thandiwe Garusa\n\nMINIYOTHABO Baloyi-Chiwenga has described her selection to the Miss Universe 2025 official judging panel as a milestone achievement for both Zimbabwe and the African continent.\n\nBaloyi-Chiwenga, wife to Vice President Constantino Chiwenga and chairperson of the Miss Universe Zimbabwe organisation, becomes the first African non-model to serve as a judge at the prestigious global pageant, which is taking place in Thailand.\n\nShe joins an elite panel that includes Miss Universe 2005 Natalie Glebova (Canada) and Miss Universe 2020 Andrea Meza (Mexico), and together they will evaluate over 80 contestants from around the world.\n\nMiss Universe Zimbabwe, Lyshanda Moyas is representing Zimbabwe.\n\nSpeaking in Thailand ahead of the pageant, set for November 21, Baloyi-Chiwenga said her appointment reflects the rising recognition of African voices on global platforms.\n\nBeing selected as a judge is an honour, not only for me or Zia mbabwe but for Africa as a whole because it means that we are being respected as a whole because it means that we are being represented as Africa in the judgment and decision-making table, so it means a lot to us and the girlchild, she said.\n\nShe added that the modelling industry has evolved significantly, moving away from outdated stereotypes.\n\nFrom what I have seen in the past years, the modelling industry is becoming better and better, people are approaching it from a professional point of view.\n\nA long time ago, there were a lot of misinterpretations and misunderstandings of this industry and now it has changed, so I can say that the future is bright and a lot of changes are happening and we are happy about it, she added.\n\nBaloyi-Chiwenga called on contestants to demonstrate global awareness and social responsibility, addingthat pageantry demands more than beauty.\n\nWhen you are a model, for you to win, you have to be the voice of the people, you must look beyond your own interests but be a global citizen, someone who speaks to the challenges and issues that the world is facing.\n\nSo for me to believe that you have to represent the world, you must be conversant on the problems that the whole world is facing regardless of where you stay.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20094056/miniyothabo-chiwenga.jpg",
            "description": "<p>By Thandiwe Garusa MINIYOTHABO Baloyi-Chiwenga has described her selection to the Miss Universe 2025 official judging panel as a milestone achievement for both Zimbabwe and the African continent. Baloyi-Chiwenga, wife to Vice President Constantino Chiwenga and chairperson of the Miss Universe Zimbabwe organisation, becomes the first African non-model to serve as a judge at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-proud-moment-for-africa-miniyothabo-chiwenga-celebrates-historic-appointment-as-first-african-non-model-miss-universe-judge/\">“A proud moment for Africa” – Miniyothabo Chiwenga celebrates historic appointment as first African non-model Miss Universe judge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "Three convenient ways to log into 1win Ghana",
            "url": "https://www.newzimbabwe.com/three-convenient-ways-to-log-into-1win-ghana/",
            "content": "Getting started with 1win Ghana is designed to be simple and accessible for every user. The platform offers different entry points so that newcomers and experienced players alike can join quickly without unnecessary complications. This flexibility makes the first steps comfortable, no matter where you are connecting from.\n\nWhen visiting theOfficial site of 1win Ghana, users immediately notice that there is more than one way to access their personal account. Each method is adapted for a modern audience, focusing on speed, safety, and convenience. Such diversity allows players to choose the option that feels most natural for them.\n\nOne of the key advantages of this approach is the elimination of barriers for new members. Whether someone prefers classic registration, fast login through social networks, or authorization via mobile number, the system ensures a smooth experience. The process is designed with user-friendliness at its core.\n\nIn the end, 1win Ghana emphasizes accessibility and choice. By providing three distinct login methods, the platform demonstrates its commitment to user comfort and adaptability. Its not just about logging in  its about making sure every customer feels at ease right from the very beginning of their journey.\n\nBefore diving into the entertainment and opportunities available on the platform, every player must go through a simple authorization process. This step is not just a formality  it lays the foundation for a safe and personalized gaming experience. Without logging in, users are limited in what they can access and miss out on the core benefits of being part of the community.\n\nAuthorization is also a guarantee of trust between the platform and its players. By confirming your identity, the system ensures that your personal data, financial transactions, and gaming preferences are protected. This is the moment when a casual visitor turns into a recognized member of 1win Ghana, gaining access to everything the service has to offer.\n\nThese reasons highlight how essential authorization is for a seamless journey on 1win Ghana. It transforms the site from a simple interface into a personalized environment tailored to the players needs. Without this step, the experience would remain incomplete.\n\nUltimately, authorization is about more than just logging in  it is the gateway to a safe, rewarding, and fully functional platform. By signing in, users are assured that their time and resources are protected, while at the same time opening the door to exciting opportunities that are exclusive to active members.\n\nThe platform offers flexibility when it comes to authorization, giving players several convenient methods to enter their personal accounts. Each option is tailored to suit different user preferences, ensuring that everyone can choose the path that feels most comfortable. Whether you value simplicity, security, or speed, there is a suitable way to log in without unnecessary complications.\n\nFor newcomers, these alternatives remove possible barriers and make the first steps much smoother. Returning users, on the other hand, can select the method they find most efficient, whether it is tied to their mobile device, a familiar social account, or the traditional combination of email and password. Below is a clear breakdown of the available login methods on 1win Ghana.\n\nEach of these methods has its own advantages. The phone number option is particularly useful for those who rely on mobile devices daily, making it a straightforward choice. Logging in via social networks adds speed and removes the hassle of remembering additional passwords, though availability depends on local access to these platforms.\n\nMeanwhile, the email and password option remains the most universal and secure approach. It appeals to players who value control and are accustomed to traditional login systems. By offering all three options side by side, 1win Ghana ensures that every type of user can find the right balance between convenience and security.\n\nA reliable login system is one of the cornerstones of any online platform, and 1win Ghana takes this aspect seriously. By providing clear, straightforward authorization methods, the site removes unnecessary complications that might discourage new users. This simplicity encourages players to focus on what truly matters  enjoying the wide range of games, bets, and opportunities available after signing in.\n\nMoreover, a seamless login process reflects the platforms overall commitment to user comfort. Each authorization method is not only functional but also designed with convenience in mind. This ensures that every player, regardless of their experience level, can start their journey on 1win Ghana without obstacles, setting a positive tone for everything that follows.\n\nAuthorization on 1win Ghana is more than just a formality  it is the essential step that opens the door to a complete user experience. Without logging in, the platform remains only a showcase, but once you sign in, it transforms into a personalized space filled with opportunities. This first move is what truly defines the beginning of a players journey.\n\nThe three login methods  by phone number, through social networks, and via email with password  are designed to accommodate different preferences. Each carries its own strengths, from simplicity to security, ensuring that no user feels excluded. By offering such versatility, the platform demonstrates its commitment to convenience and accessibility.\n\nLooking at the reasons to authorize, it becomes clear that the process provides not only practical benefits but also an extra layer of protection. Secure access, eligibility for bonuses, and full functionality are all tied to this step. That makes authorization the central element around which the entire 1win Ghana experience is built.\n\nIn conclusion, logging in is not just about gaining entry  it is about establishing trust, enjoying rewards, and unlocking the full scale of entertainment the site has to offer. By giving players multiple ways to authorize, 1win Ghana ensures that every journey begins smoothly and continues without barriers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20073842/1win.jpg",
            "description": "<p>Getting started with 1win Ghana is designed to be simple and accessible for every user. The platform offers different entry points so that newcomers and experienced players alike can join quickly without unnecessary complications. This flexibility makes the first steps comfortable, no matter where you are connecting from. When visiting the Official site of 1win</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-convenient-ways-to-log-into-1win-ghana/\">Three convenient ways to log into 1win Ghana</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "South Africa to lead global PGM supply rebound next year after dragged output",
            "url": "https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/",
            "content": "IOL\n\nLower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the worlds biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year.\n\nThe World Platinum Investment Council said on Wednesday that global PGM supplywas flatin the third quarter year on year weighed on by lower South African mineproduction.\n\nThis was after refined volumes fromValterra(formerly Anglo American Platinum) fell inSouth Africa.\n\nThis was reflective of a significant destocking of semi-finished inventory in Q324.\n\nImplats own refined production was, however, little changed year-on-year, although scheduled processing maintenance led to a further build in already elevated work-in-progress stocks.\n\nSouth African production contracted 2% year-on-year to 1 028 koz, said WIPC in a quarterly report.\n\nNonetheless, following the unusually high rainfall and flooding that disrupted South African mining operations earlier this year, as well as theprocessing constraints that curtailed refined volumes,PGMsupply is expected to recover over the latter half of the year.\n\nThe completionof maintenance at Implats South African smelters should allow some destocking of excess inventory that had been deferredearlier in the year, partly due to disruptions to water, power and hydrogen supply to the refineries, further noted WIPC.\n\nAlthough South African mine production is forecast to contract 5% to 3,945 koz, mine supply for PGM from the country is projected to rise by 2% year-on-year in 2026, with gains from South Africa and Zimbabwe partially offset by a modest decline from North America and Russia.\n\nOutput from major South African producers is expected to rise, with improved processing availability anticipated to support a modestincrease in output from Implats, aided by the drawdown of excess semi-finished inventory.\n\nInvestor sentiment in South African platinum miners and future pricing prospects has brightened with the commoditys recent good run in prices providing favourable momentum among fund managers.\n\nLong dogged by suppressed investor sentiment due to low prices and uncertainty that demand could be subdued due to popularity and uptake of electric vehicles, platinum group metals have been on a rebound in the past few weeks.\n\nThis is despite the World Platinum Investment Council saying earlier this year that full-year output will still be 6% lower than last year, since South African producers will not benefit from the large drawdown of work-in-process inventory that occurred last year.\n\nBesides the inclination towards platinum, the South African fund managers have exhibited lowpositioninginhealthcare,offshore,telecomandcash. Thebiggest fallswere recorded forheavyindustrialsand cash, according to Bank of America analysts.\n\nZimbabweanPGMproduction slipped 10% to 119 koz, largely reflecting significant destocking of semi-processed material at Unki, owned by Valterra.\n\nOutput from Zimplats,Zimbabweslargest producer, edged lower owing to furnace repairs.\n\nThus, PGM supply from Zimbabwe is expected to contract by 4% year-on-year to 493 koz, retreating from the record level achieved in 2024.\n\nThe decline primarily reflects the absence of a drawdown of semi-finished stock that boosted last years volumes, said WIPC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20044527/gold-platinum.jpg",
            "description": "<p>IOL Lower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the world’s biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year. The World Platinum Investment Council said on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/\">South Africa to lead global PGM supply rebound next year after dragged output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation",
            "url": "https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/",
            "content": "By Anna Chibamu\n\nMining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned.\n\nSpeaking in the Senate recently, Goromonzis Chief Chikwaka said that while Zimbabwe remains open for business, some foreign miners were wreaking havoc in the communities where they operate.\n\nWhat is government policy regarding the allocation of licences where you find miners displacing local communities? This is affecting peoples livelihoods. You would find that people are just relocated without improving their livelihoods.\n\nWhat is the government policy in terms of people who are being displaced by mining activities, where you find, them being relocated to areas which are not conducive? he said.\n\nHis concerns come just two months after President Emmerson Mnangagwa directed Parliament to expedite the long-overdue Mines and Minerals Bill to address ongoing disputes between miners, farmers, and communities.\n\nResponding to the issue, Mines and Mining Development Deputy Minister responsible for Oil and Gas Research and other Strategic Minerals Exploration, Caleb Makwiranzou, acknowledged the challenges.\n\nThe Deputy Minister said, Before giving permission to miners, we require a report, which is called the Environmental Impact Assessment (EIA), which is a report, which looks at the community which is going to be affected, and where they are going to be relocated. If they going to receive houses where they are going to be relocated, then after getting that report, that is where we allow mining companies to go ahead.\n\nMakwiranzou also highlighted provisions in the new law.\n\nI want to inform this House that the new law [H. B. 1, 2025] allows that if someone has their field or their farm and there is a need for mining to be done in that field, that person is given the first option. The person is asked whether they allow the miners, and then they can discuss with whoever wants to mine if there is an allocation of shares. The person can then be given shares.\n\nOn the other hand, if that person is to be relocated, it should be consensual. They must give consent because the previous law was causing disputes where there was conflict between the Minerals Act and the Agricultural Act, said Makwiranzou.\n\nHowever, Chief Chikwaka argued that, in reality, no environmental impact assessments were being conducted before mining begins.\n\nThere is no Environmental Impact Assessment, which is being done. You would find that miners are just coming into the community. They start drilling in peoples fields. They start mining and excavating in peoples fields and leave such fields open.\n\nThey do not cover the pits and the original farmer cannot farm on his land because there are pits. There is a need for consultation with stakeholders, Chief Chikwaka said.\n\nMakwiranzou stressed that operating without an EIA is illegal, adding that government would send inspectors to the affected communities and block the mining activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26023525/Chinese-Mining-Operations.png",
            "description": "<p>By Anna Chibamu Mining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned. Speaking in the Senate recently, Goromonzi’s Chief Chikwaka said that while Zimbabwe remains open for business,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/\">Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank",
            "url": "https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/",
            "content": "Channel Africa\n\nZimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the countrys monetary authorities.\n\nSpeaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the Zimbabwe Gold (ZiG) to operate as the countrys sole currency.\n\nThe present reserve level provides more than four times cover for reserve money, far above the minimum one-to-one backing required, but still insufficient for a mono-currency environment.\n\nOfficials stressed thatZimbabwes domestic currency must be fully backed by foreign currency reserves and precious mineralsto ensure stability and convertibility.\n\nWe need reserves that provide between three and six months of import cover for a mono-currency regime.To achieve that, Zimbabwe would require between 5 and 6 billiondollars.At the pace we are accumulating reserves, we are confident we can reach those levels, Gwanyanya said.\n\nMonetary authorities emphasised that while reserves are essential, macroeconomic stability is the decisive factor.\n\nWe need durable stability, price stability, and exchange-ratestabilityto restore trust in the currency. Stability for beyond one year is crucial for the market to accept a mono-currency arrangement,  he said.\n\nThe Reserve Bank attributes the increase to several factors, including:\n\nGold reserves currently stand at around 3.5 tonnes, and the authorities say the country has benefited from the global gold price rally.\n\nZimbabwe also continues to accumulate reserves through the foreign-currency surrender system, in which exporters convert part of their earnings into local currency.\n\nAt the rate we are accumulating these reserves, it is quite encouraging. Our exports are increasing, and this is what funds reserve accumulation.\n\nHowever, they cautioned that beyond building reserves, confidence in the ZiG and broader economic performance will determine the success of the 2030 single-currency target.\n\nOur economy has been performing to expectations, and in some cases exceeding expectations, despite external shocks. But stability remains the foundation for trust in the currency, Gwanyanya said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>Channel Africa Zimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the country’s monetary authorities. Speaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/\">Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "20 Nov 2025"
        }
    ]
}