{
    "news": [
        {
            "title": "Zimbabwe-born heavyweight boxer Derek Chisora beats Wallin in UK finale",
            "url": "https://www.newzimbabwe.com/zimbabwe-born-heavyweight-boxer-derek-chisora-beats-wallin-in-uk-finale/",
            "content": "By BBC\n\nHEAVYWEIGHT boxer Derek Chisora proved too much for Otto Wallin as he picked up a unanimous decision victory in his final fight in the United Kingdom.\n\nChisora was on top from the first bell and twice knocked Wallin down at a packed Co-op Live Arena in Manchester.\n\nThe judges scored it 117-109, 114-112 and 116-110 in favour of Chisora, who took his overall record to 36 wins in 49 fights.\n\nI thought he was going to gas out but he didnt and I was wrong, Chisora said. It was a firefight.\n\nThe bout had been elevated to an IBF world title eliminator earlier in the week, with Chisora now in line to face either champion Daniel Dubois or Joseph Parker, who meet on 22 February.\n\nFormer four-weight world champion Roberto Duran, WBA featherweight champion Nick Ball, who faces TJ Doheny on 15 March, Joe Joyce and Dillian Whyte were among those in attendance for Chisoras UK send-off.\n\nThe 41-year-old was joined in the ring by UK rappers Skepta, Tinie Tempah and Chipmunk after his victory was announced as he asked fans to vote on who his opponent should be for his 50th fight.\n\nChisora intends to retire after that fight, which he wants to take place overseas.\n\nLegacy isnt made by me  it is made by the fans, Chisora added.\n\nChisora spoke in the build-up to his UK send-off about it being an emotional week and those feelings got the better of him when he entered the venue earlier in the night, with the TNT broadcast showing him in tears.\n\nBy the time he made his walk to the ring wearing a cowboy hat, Chisora had steadied himself mentally and he was warmly welcomed into the arena as fans sang along to Hotel California.\n\nDel Boy set the tempo from the outset, fighting on the front foot and not allowing Wallin space to get behind his jab.\n\nShort bursts to body and head were enough to carry Chisora through the early stages and a looping right had Wallin backtracking in round three.\n\nChisora was cut above his right eye in round five but passed a check with the doctor in the sixth as he continued to enjoy the better of the close exchanges.\n\nA looping right sent Wallin tumbling across the ring and down in the ninth but he was back ready to go by the count of eight.\n\nUpon hearing the 10-second clapper in the final round, Chisora threw everything at Wallin and put down his rival, who was saved by the bell.\n\nChisora has faced some of the biggest names in the sport during his 18-year career, meeting Tyson Fury on three occasions, Whyte and Parker twice, and has also come up short against Vitali Klitschko and Oleksandr Usyk.\n\nIt is Chisoras third win in succession after victories over Gerald Washington and Joe Joyce.\n\nChisora is the third man to beat Wallin following losses against Fury and Anthony Joshua.\n\nJust seven of Chisoras 49 professional bouts have taken place outside of the UK and this was his fourth contest in Manchester.\n\nHis three previous fights in Manchester  two against Parker and one with Whyte  ended in defeat.\n\nChisora wants to end on a high\n\nChisora was clear that he wanted one more fight after facing Wallin and the news that this bout had been upgraded to an IBF eliminator put even more on the line for the veteran.\n\nThe Zimbabwe-born Londoner first fought for a world title in 2012 when he lost against WBC heavyweight champion Klitschko and he also came up short against Fury in 2022 with the WBC belt on the line.\n\nA third shot at gold could be on the horizon for Chisora after he rolled back the years to dispatch Wallin.\n\nChisora urged the fans to help him pick his next opponent, with WBA (Super), WBC and WBO champion Usyk and former two-time heavyweight champion Joshua also in his sights.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/23212050/Derek-Chisora.jpeg",
            "description": "<p>By BBC HEAVYWEIGHT boxer Derek Chisora proved too much for Otto Wallin as he picked up a unanimous decision victory in his final fight in the United Kingdom. Chisora was on top from the first bell and twice knocked Wallin down at a packed Co-op Live Arena in Manchester. The judges scored it 117-109, 114-112</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-born-heavyweight-boxer-derek-chisora-beats-wallin-in-uk-finale/\">Zimbabwe-born heavyweight boxer Derek Chisora beats Wallin in UK finale</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Police raid Job Sikhala and 39 others, threaten to shoot activists later released without charge after hours of detention",
            "url": "https://www.newzimbabwe.com/police-raid-job-sikhala-and-39-others-threaten-to-shoot-activists-later-released-without-charge-after-hours-of-detention/",
            "content": "By Costa Nkomo\n\nFORMER St Marys Member of Parliament, Job Sikhala and 39 other members of the National Democratic Working Group (NDWG) were yesterday rounded up in Mutare before being released hours later.\n\nZimbabwe Republic Police (ZRP) in Mutare reportedly raided NDWG executive members Saturday afternoon while holding a meeting at a private resort, assaulted and detained them for hours before their release without charge.\n\nThe group was initially charged with Section 7 of the Maintenance of Peace and Order Act (MOPA) upon arrest.\n\nAccording to Sikhala, the raid was like a scene from a dodgy movie, after what he described as several visits by members of the Central Intelligence Organisation (CIO) and CID, Law and Order police officers.\n\nIt appears the group was under watch from State officials.\n\nAfter being released, Sikhala wrote on X Sunday morning that the police were off the mark, because MOPA does not apply to private places and private meetings.\n\nMOPA does not sanction the notification of executive meetings. Its like Zanu PF seeking police clearance to hold its Politburo meetings, he said.\n\nThe law only talks of holding public meetings, processions or demonstrations in public places. The meeting we held was in a bush at Beats of Forest and wondered how it turned out to be a public place.\n\nSecondly, they are mistaking the National Democratic Working Group (NDWG), to be a political party which it is not, he said.Sikhala narrated episodic visits to their meeting by police officers and those from the Presidents Office before being raided and heavily assaulted, including one unnamed officer, who reportedly pointed a gun at top official Wurayi Zembe.Initially, a Toyota Hilux double cab with dark windows arrived with 5 members of the CIO led by Muvhangeri, whose home area is Buhera. They arrived and parked at the premises and engaged with the NDWG Chief National Organiser Democrat Engineer Joelson Mugari.After about 5 minutes they left. A few minutes later, another vehicle, a Toyota Hilux without number plates arrived with members of the Police Intelligence (PI) formerly PISI & members of the CID Law and Order led by Ngweme.According to Sikhala, his group, through one Engineer Joelson Mugari, engaged the police in vain.While he was engaging them, 3 truckloads of riot Police and AK47 wielding police officers descended on the venue led by a plain clothed officer called Shonhiwa.The other AK47-wielding police officer pointed his gun at Dr. Zembe screaming I am going to shoot you. Dr Zembe remained calm and watched the drama. This happened right next to me, he said.Sikhala further complained of being commandeered into waiting pick-up trucks during heavy and torrential rains.Rains pounded on us from Beats of Forest to Penhalonga Police Station around 12 noon. We all got so wet that we looked like drowned rats when we finally arrived at Penhalonga Police Station which was a distance away.All our phones were switched off and we were asked to sit down on some dirty floor. Recording of each individuals details took about 3 hours. We were suddenly told that we are no longer handling your case and you must be taken to Mutare Central CID Law and Order.At the CID Law and Order we were not asked to plead to any charge but they took Engineer Joelson Mugari, Dr. Wurayayi Zembe, Nyabeze and myself for interviews.Sikhalas group arrest rekindles memories of the arrest of Senator Jameson Timba and other 78 Citizens Coalition for Change (CCC) activists. These were arrested in June last year for gathering to commemorate the Day of the African Child, which the police said was illegal. They spent six months behind bars before being released.\n\nSecondly, they are mistaking the National Democratic Working Group (NDWG), to be a political party which it is not, he said.\n\nSikhala narrated episodic visits to their meeting by police officers and those from the Presidents Office before being raided and heavily assaulted, including one unnamed officer, who reportedly pointed a gun at top official Wurayi Zembe.\n\nInitially, a Toyota Hilux double cab with dark windows arrived with 5 members of the CIO led by Muvhangeri, whose home area is Buhera. They arrived and parked at the premises and engaged with the NDWG Chief National Organiser Democrat Engineer Joelson Mugari.\n\nAfter about 5 minutes they left. A few minutes later, another vehicle, a Toyota Hilux without number plates arrived with members of the Police Intelligence (PI) formerly PISI & members of the CID Law and Order led by Ngweme.\n\nAccording to Sikhala, his group, through one Engineer Joelson Mugari, engaged the police in vain.\n\nWhile he was engaging them, 3 truckloads of riot Police and AK47 wielding police officers descended on the venue led by a plain clothed officer called Shonhiwa.\n\nThe other AK47-wielding police officer pointed his gun at Dr. Zembe screaming I am going to shoot you. Dr Zembe remained calm and watched the drama. This happened right next to me, he said.\n\nSikhala further complained of being commandeered into waiting pick-up trucks during heavy and torrential rains.\n\nRains pounded on us from Beats of Forest to Penhalonga Police Station around 12 noon. We all got so wet that we looked like drowned rats when we finally arrived at Penhalonga Police Station which was a distance away.\n\nAll our phones were switched off and we were asked to sit down on some dirty floor. Recording of each individuals details took about 3 hours. We were suddenly told that we are no longer handling your case and you must be taken to Mutare Central CID Law and Order.\n\nAt the CID Law and Order we were not asked to plead to any charge but they took Engineer Joelson Mugari, Dr. Wurayayi Zembe, Nyabeze and myself for interviews.\n\nSikhalas group arrest rekindles memories of the arrest of Senator Jameson Timba and other 78 Citizens Coalition for Change (CCC) activists. These were arrested in June last year for gathering to commemorate the Day of the African Child, which the police said was illegal. They spent six months behind bars before being released.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/09070701/GjSFXE_XUAAu3Rg.jpeg",
            "description": "<p>By Costa Nkomo FORMER St Mary’s Member of Parliament, Job Sikhala and 39 other members of the National Democratic Working Group (NDWG) were yesterday rounded up in Mutare before being released hours later. Zimbabwe Republic Police (ZRP) in Mutare reportedly raided NDWG executive members Saturday afternoon while holding a meeting at a private resort, assaulted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-raid-job-sikhala-and-39-others-threaten-to-shoot-activists-later-released-without-charge-after-hours-of-detention/\">Police raid Job Sikhala and 39 others, threaten to shoot activists later released without charge after hours of detention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Namibia’s ‘founding father’ Sam Nujoma dies aged 95",
            "url": "https://www.newzimbabwe.com/namibias-founding-father-sam-nujoma-dies-aged-95/",
            "content": "By Reuters\n\nWINDHOEK Sam Nujoma, the activist and guerrilla leader who became Namibias first democratically elected president after it won its independence from apartheid South Africa, died aged 95 on Saturday, the Namibian Presidency said on Sunday.\n\nNujoma rose to head the thinly populated southern African country on March 21, 1990 and was formally recognised as Founding Father of the Namibian Nation through a 2005 Act of Parliament.\n\nThe acclaim was balanced out by domestic and international criticism over his intolerance of critical media coverage, his railing against homosexuality and over the 1998 constitutional amendment that let him run for a third term.\n\nHe was a longtime ally of Zimbabwean strongman Robert Mugabe, backing Mugabes land seizures from white farmers, though at home Nujoma stuck to a willing buyer, willing seller policy.\n\nThe foundations of the Republic of Namibia have been shaken, the presidency posted on X.\n\nOur venerable leader, Dr. Nujoma did not only blaze the trail to freedom  but he also inspired us to rise to our feet and to become masters of this vast land of our ancestors.\n\nThe presidency said Nujoma had been hospitalised for medical treatment over the past three weeks, adding: Unfortunately, this time, the most gallant son of our land could not recover from his illness.\n\nCOMPLEX LEGACY\n\nNujoma served his three terms as president from 1990 to 2005 and sought to project himself as a unifying leader bridging political divides.\n\nIn a country scarred by the legacy of apartheid and German colonial rule, Nujomas SWAPO party oversaw a national reconciliation programme under the motto One Namibia, One Nation.\n\nIn his speeches, Nujoma made a point of repeating the phrase: A united people, striving to achieve a common good for all members of the society, will always emerge victorious.\n\nHis achievements included establishing democratic institutions and prioritising reconciliation, said Ndumba Kamwanyah, a lecturer at the University of Namibia and a political analyst.\n\nBut his autocratic tendencies, on display in his treatment of the media and brutal suppression of the 1999 Caprivi rebellion, cast a shadow over his legacy, Kamwanyah added.\n\nWhile Nujomas presidency was foundational in establishing Namibias independence and governance, it was not without flaws, Kamwanyah said.\n\nCAMPAIGNER AND GUERRILLA\n\nNujoma was born in a village in northwestern Namibia in 1929, when his country was under South African administration.\n\nSouth Africa had controlled Namibia since World War One after a brutal few decades of German colonial rule remembered for the genocide of the Herero and Nama people.\n\nAs a boy he looked after his familys cattle and attended a Finnish mission school, before moving to the coastal town of Walvis Bay and then the capital Windhoek, where he worked for South African Railways, according to a biography posted on the website of Nujomas charitable foundation.\n\nNujoma left his job on the railways to focus his energies on bringing down the apartheid system.\n\nIn the late 1950s he became leader of the Owambo Peoples Organisation, a precursor to liberation movement SWAPO, organising resistance to the forced relocation of Black people in Windhoek that culminated in the police killing 12 unarmed people and wounding dozens more.\n\nNujoma was charged with organising the resistance and arrested. In 1960, he went into exile. He travelled across Africa before reaching the United States, where he petitioned the United Nations for Namibias independence.\n\nMade SWAPO leader in absentia, Nujoma established its armed wing and in 1966 launched a guerrilla war against the apartheid government.\n\nIt took more than a decade of pressure from Nujoma and others before a U.N. Security Council resolution in 1978 proposed a ceasefire and elections, and another decade for the ceasefire deal to be signed and elections held in late 1989.\n\nSWAPO won a majority in those elections, and Nujoma took office in March the following year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/09064246/WhatsApp-Image-2025-01-30-at-6.45.58-PM.jpeg",
            "description": "<p>By Reuters  WINDHOEK— Sam Nujoma, the activist and guerrilla leader who became Namibia’s first democratically elected president after it won its independence from apartheid South Africa, died aged 95 on Saturday, the Namibian Presidency said on Sunday. Nujoma rose to head the thinly populated southern African country on March 21, 1990 and was formally recognised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibias-founding-father-sam-nujoma-dies-aged-95/\">Namibia’s ‘founding father’ Sam Nujoma dies aged 95</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Woman scalds hubby’s face with boiling oil in infidelity row",
            "url": "https://www.newzimbabwe.com/woman-scalds-hubbys-face-with-boiling-oil-in-infidelity-row/",
            "content": "By Staff Reporter\n\nA NORTON man is battling for his life in hospital after his wife scalded him with hot oil in a dispute over infidelity.\n\nZimbabwe Republic Police (ZRP) spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe assailant, Melody Tambudzai aged 40 has since been arrested facing an attempted murder charge.\n\nPolice in Norton arrested Melody Tambudzai (40) for attempted murder which occurred at Makava village, Chivero, Mhondoro on January 27, 2025, said Nyathi.\n\nThe suspect allegedly poured boiling cooking oil on her husbands face whilst he was asleep.\n\nThe victim sustained facial burns and is currently hospitalised in Norton.\n\nIt was revealed that investigations by police established that the couple had a long-standing domestic dispute over infidelity issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  A NORTON man is battling for his life in hospital after his wife scalded him with hot oil in a dispute over infidelity. Zimbabwe Republic Police (ZRP) spokesperson, Commissioner Paul Nyathi confirmed the incident. The assailant, Melody Tambudzai aged 40 has since been arrested facing an attempted murder charge. ‘”Police in Norton</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-scalds-hubbys-face-with-boiling-oil-in-infidelity-row/\">Woman scalds hubby’s face with boiling oil in infidelity row </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Indian PM Modi’s party wins election in New Delhi after 27 years out of power",
            "url": "https://www.newzimbabwe.com/indian-pm-modis-party-wins-election-in-new-delhi-after-27-years-out-of-power/",
            "content": "By Reuters\n\nNEW DELHI Indian Prime Minister Narendra Modis party on Saturday regained power in the nations capital for the first time in 27 years, a boost for the Hindu-nationalist leader after a disappointing national election last year.\n\nModis Bharatiya Janata Party won 48 of the 70 seats in the Delhi capital district, well ahead of the 22 for the opposition Aam Aadmi Party (AAP) of Arvind Kejriwal, a fierce critic of Modi, data from the Election Commission of India showed.\n\nIt is our guarantee that we will leave no stone unturned in developing Delhi, improving the overall quality of life for the people, Modi wrote on social media platform X.\n\nAAP, which grew out of an anti-corruption movement in 2012, tasted its first electoral success in Delhi and has ruled the territory, which includes Indias parliament and federal government offices in New Delhi, for two terms from 2015.\n\nKejriwal, 55, an anti-corruption crusader-turned-politician who was arrested on graft charges weeks before last years general election began, alleged a political vendetta by the Modi government. The BJP denies his claims.\n\nKejriwal, who was released on bail and resigned as Delhi chief minister to focus on campaigning for the state election, lost the seat he was contesting.\n\nAAP will play the role of constructive opposition after trying to improve the citys infrastructure, education, and healthcare in the past ten years, Kejriwal said in a video message on X.\n\nAAP, which won the past two elections with thumping majorities, was popular because of its largesse, such as free water and power for the poor, its main voter base.\n\nTo counter AAP, the BJP promised monthly payments of 2,500 Indian rupees ($28) to all poor women, a one-time payment of 21,000 rupees to each pregnant woman, subsidised cooking gas, a monthly pension of 2,500 rupees for the elderly and 15,000 rupees for the youth to prepare for competitive exams.\n\nModi lost his majority in Indias Parliament last year but returned as prime minister for a record-equalling third term with the support of regional parties. His BJP has won three of four subsequent State elections.\n\nState election victories help political parties boost their numbers in the upper house of parliament, which is key for decision-making.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/09032128/ap889445775356_wide-fd9a1c33c12a077fb7bf962ea7640f18ce79b36e.jpg",
            "description": "<p>By Reuters  NEW DELHI— Indian Prime Minister Narendra Modi’s party on Saturday regained power in the nation’s capital for the first time in 27 years, a boost for the Hindu-nationalist leader after a disappointing national election last year. Modi’s Bharatiya Janata Party won 48 of the 70 seats in the Delhi capital district, well ahead</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/indian-pm-modis-party-wins-election-in-new-delhi-after-27-years-out-of-power/\">Indian PM Modi’s party wins election in New Delhi after 27 years out of power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Nyasha Mushekwi reports for preseason training to dismiss rumours of premature departure at new club",
            "url": "https://www.newzimbabwe.com/nyasha-mushekwi-reports-for-preseason-training-to-dismiss-rumours-of-premature-departure-at-new-club/",
            "content": "By Soccer24\n\nZIMBABWEAN international, Nyasha Mushekwi has reported for pre-season training at his new Chinese League One club, Dalian Kun City.\n\nMushekwi joined the club in late December after leaving Yunnan Yukun upon their promotion to the top-flight league.\n\nReports emerged in January suggesting the former Warriors international had prematurely ended the contract after the parties disengaged on some terms, which led to the departure of a senior club official.\n\nBut Mushekwi is still with the club and has reported for pre-season training.\n\nThe Dalian club said in a statement, as cited by Chinese News agency Xinhua: On the morning of February 5, Mushekwi joined up with the team in Foshan after a journey of about ten hours.\n\nAfter a brief rest, he will take part in the teams preseason training in the best possible form,\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/25134859/Nyasha-Mushekwi.png",
            "description": "<p>By Soccer24  ZIMBABWEAN international, Nyasha Mushekwi has reported for pre-season training at his new Chinese League One club, Dalian Kun City. Mushekwi joined the club in late December after leaving Yunnan Yukun upon their promotion to the top-flight league. Reports emerged in January suggesting the former Warriors international had prematurely ended the contract after the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nyasha-mushekwi-reports-for-preseason-training-to-dismiss-rumours-of-premature-departure-at-new-club/\">Nyasha Mushekwi reports for preseason training to dismiss rumours of premature departure at new club</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "9 Zimbabweans charged with murder of fellow citizen in Botswana",
            "url": "https://www.newzimbabwe.com/9-zimbabweans-charged-with-murder-in-botswana/",
            "content": "By Mmegi\n\nNINE Zimbabwean nationals have been formally charged with a single count of murder and illegal entry into Botswana following the gruesome killing of fellow Zimbabwean man, Tavonanashe Mariga, who was brutally assaulted by stomping on his testicles.\n\nThe nine Zimbabwean nationals, who are facing the two offences are Crispen Gasura, 33, Desmond Dube, 23, Takesure Fraser, 38, Abbisai Gasura, 29, Justice Mafukidze, 25, Clayton Chiwa, 35, Spencer Gasura, 35, Calvin Mafukidze, 27, and Alouis Gasura, 23. All nine accused persons are male.\n\nThe accused were arraigned before the Broadhurst Magistrates Court last Friday.\n\nThe shocking incident occurred at the Matebele Farms on January 5, 2025, after the nine accused alleged the slain Mariga had stolen money amounting to P1,500.\n\nGanging up on him, the nine accused allegedly beat the slain Mariga to a pulp and visually shot the whole ordeal. Tied up, Mariga was beaten by the nine men with sticks and stomped on his testis until he lost consciousness.\n\nHe was certified dead upon arrival at the hospital.\n\nDue to the brutality the deceased suffered prior to death, Prosecutor Mmoloki Selofera asked that the accused be further remanded in custody.\n\nThe accused persons shouldnt be granted bail as this is a relatively new matter. And we are still waiting for the post-mortem results, forensic affidavit, and the photo album, he said.\n\nMeanwhile, the accused persons who are farm workers at the Matebele Farms didnt contend the submissions made by the State after being asked by the presiding Magistrate Goratile Moremi-Ramakoloi. The magistrate acceded to the prosecutions plea.\n\nThe nine accused persons are further remanded in custody until the next mention date on February 13, 2025, she ordered. The case continues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/09025004/download-1-2.jpeg",
            "description": "<p>By Mmegi  NINE Zimbabwean nationals have been formally charged with a single count of murder and illegal entry into Botswana following the gruesome killing of fellow Zimbabwean man, Tavonanashe Mariga, who was brutally assaulted by stomping on his testicles. The nine Zimbabwean nationals, who are facing the two offences are Crispen Gasura, 33, Desmond Dube,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/9-zimbabweans-charged-with-murder-in-botswana/\">9 Zimbabweans charged with murder of fellow citizen in Botswana </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Law Society of Zimbabwe issues warning against errant and bogus lawyers",
            "url": "https://www.newzimbabwe.com/law-society-of-zimbabwe-issues-warning-against-errant-and-bogus-lawyers/",
            "content": "By Mary Taruvinga\n\nTHE Law Society of Zimbabwe (LSZ) has issued a stern warning to lawyers, who stray from their professional obligations and engage in corruption, among other unacceptable behaviour.\n\nLSZ says that such conduct will not be tolerated.\n\nThe caution comes in light of recent accusations of corruption cartels allegedly involving judicial officers, lawyers, and journalists.\n\nSpeaking during a media training workshop in Harare on Friday, LSZ president Lison Ncube stressed commitment to combating the vice, assuring that anyone caught off guard will face appropriate punishment.\n\nAccusations of corruption fronted by alleged cartels between judicial officers, journalists and legal practitioners have been flying around.\n\nSuch accusation must be frowned upon and the LSZ takes a very dim view of this situation.\n\nWe decided, however, that we will not join the chorus of accusations; rather we now seek to work with authorities on a campaign to educate our members and stakeholders on the dangers of corruption, he said.\n\nNcube also highlighted that the integrity of the justice sector is crucial for Zimbabwes economic and social development.\n\nHe further said that Zimbabweans must have confidence in the justice system, noting that the media plays a vital role in achieving this objective.\n\nWe are acutely aware that complaints against our members may have the effect of eroding public confidence in the legal profession.\n\nHowever, the flip side for us is that the increase in complaints is a sign of growing confidence in the ability of the society to discipline its members and effective regulation of the profession in the public interest, Ncube said.\n\nThe LSZ expressed concern over the rise of bogus lawyers, which has contributed to an increase in complaints received.\n\nThe LSZ is a stickler for rules and will not waiver. We take this opportunity to reassure stakeholders that there is no place for errant lawyers to hide.\n\nThe wheels of administrative justice may turn slowly, but they certainly do turn.\n\nOur processes may appear long and winding as things stand, but this is as provided by law, and unless there are amendments to existing legislation, we can only follow what is available to us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/28222325/law-firm-1.jpeg",
            "description": "<p>By Mary Taruvinga   THE Law Society of Zimbabwe (LSZ) has issued a stern warning to lawyers, who stray from their professional obligations and engage in corruption, among other unacceptable behaviour. LSZ says that such conduct will not be tolerated. The caution comes in light of recent accusations of corruption cartels allegedly involving judicial officers, lawyers,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/law-society-of-zimbabwe-issues-warning-against-errant-and-bogus-lawyers/\">Law Society of Zimbabwe issues warning against errant and bogus lawyers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "Winky D’s Siya video reaches one million views within a week",
            "url": "https://www.newzimbabwe.com/winky-ds-siya-video-reaches-one-million-views-within-a-week/",
            "content": "By Thandiwe Garusa\n\nZIMDANCEHALL king, Wallace Chirumiko popularly known as Winky Ds Siya music video has surpassed one million YouTube views just a week after its release.\n\nThe visuals, which currently hold the number one spot on YouTube trending, were released on February 1 as he celebrated his 42nd birthday.\n\nAlso known as The Gaffa President, he released an extended play (EP) called Pabho without any prior promotion or notice.\n\nThe EP consists of six tracks, beginning with PaTonaz, Siya, Kudhakwa, Fake Love, Zvatanga, and Pabho which features Bling 4.\n\nThe record breaking Siya song can be interpreted as a message to the youth, encouraging them to work hard and earn their lifestyle.\n\nIn the song, the musical giant also warns society about the dangers of reliance on others and highlights the risks of being exploited by powerful individuals after accepting freebies.\n\nZvisina dikita rangu kani maoko angu siya. Zvisina kuda kwangu moyo wangu siya, rwusiri rwendo rwangu kani makumbo angu mira. Asiri mashoko angu, muromo wangu pfira.\n\nHumwe huranda hunouya nekuda kugamuchira, dai wavhura meso unofa munzira, zvimwe zvinonyudza buda munzira, ndamba kuudzwa akasiya jira, zvinoyevedza zvine kakuparira, saka pakutambira ngwarira, kugona ngoma huipfavira, unofira kuda mukuravira.\n\nTinofira kusada kuva shure asi mberi kune rufu mhanduwe, asi hatidzokeri share, moyo wangu ndibatsire ndinyumwe, sings Winky D.\n\nThe song comes at a time when many public figures and artists have received luxury cars from controversial businessman Wicknell Chivayo.\n\nThe Zanu PF aligned tenderprenuer has so far donated hordes of top-of-the-range cars to public figures, church members and supporters of the ruling party. This has led many public figures and ordinary individuals to publicly beg for cars or money from Chivayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/08090848/ZimFest-18.png",
            "description": "<p>By Thandiwe Garusa ZIMDANCEHALL king, Wallace Chirumiko popularly known as Winky D’s Siya music video has surpassed one million YouTube views just a week after its release. The visuals, which currently hold the number one spot on YouTube trending, were released on February 1 as he celebrated his 42nd birthday. Also known as The Gaffa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/winky-ds-siya-video-reaches-one-million-views-within-a-week/\">Winky D’s Siya video reaches one million views within a week</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        },
        {
            "title": "SADC, East African Community leaders call for an immediate, unconditional ceasefire in DRC",
            "url": "https://www.newzimbabwe.com/sadc-eac-leaders-call-for-an-immediate-unconditional-ceasefire-army-chiefs-to-meet-within-5-days/",
            "content": "By Thandiwe Garusa\n\nAFRICAN leaders have called for an immediate and unconditional ceasefire in the Democratic Republic of Congo (DRC), which will be enforced by army chiefs within five days.\n\nThe Southern African Development Community (SADC) and the East African Community (EAC) leaders held a joint summit in Tanzania, Saturday, to find a way forward and an end to the crisis in the eastern DRC where Rwanda backed March 23 Movement (M23) rebels have captured Goma.\n\nThe two regional blocs both expressed concern over the crisis and directed military generals to lead the ceasefire process as well as assist injured soldiers and facilitate repatriation of those slain in the attacks.\n\nThe Joint Summit directed the EAC-SADC Chiefs of Defense Forces to meet within five (5) days and provide technical direction on immediate and unconditional ceasefire and cessation of hostilities, provision of humanitarian assistance including repatriation of the deceased and evacuation of the injured, a communique on the resolutions of the summit reads.\n\nThe summit also called for the reopening of main supply routes and Goma airport.\n\nDevelop a securitisation plan for Goma and surrounding areas, opening of main supply routes including Goma-Sake-Bukavu; Goma-Kibumba-Rumangabo-Kalengera- Rutshuru-Bunagana; and Goma- Kiwanja-Rwindi- Kanyabayonga-Lubero including navigation on Lake Kivu between Goma and Bukavu and immediate re-opening of Goma Airport, added the communique.\n\nThe African leaders also called for negotiations and dialogue with all state and non-state parties (military and non-military) including the M23.\n\nThey also directed that modalities for withdrawal of uninvited foreign armed forces from the territory of the DRC be developed and implemented.\n\nSoldiers from South Africa, Burundi, Malawi, Tanzania, and Uganda have been sent to DRC as part of a regional development community mission and 16 of them were killed two weeks ago by the M23 rebels.\n\nOver 400,000 Congolese have been displaced since January due to the violence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/09071906/b7af3139-5000-4df0-9162-74419a936756_w640_r0_s.jpg",
            "description": "<p>By Thandiwe Garusa AFRICAN leaders have called for an immediate and unconditional ceasefire in the Democratic Republic of Congo (DRC), which will be enforced by army chiefs within five days. The Southern African Development Community (SADC) and the East African Community (EAC) leaders held a joint summit in Tanzania, Saturday, to find a way forward</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-eac-leaders-call-for-an-immediate-unconditional-ceasefire-army-chiefs-to-meet-within-5-days/\">SADC, East African Community leaders call for an immediate, unconditional ceasefire in DRC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:31",
            "date": "09 Feb 2025"
        }
    ]
}