{
    "news": [
        {
            "title": "Mnangagwa acolytes want to butcher Constitution by amending it to extend presidential term to 2030 without a referendum— Geza",
            "url": "https://www.newzimbabwe.com/mnangagwa-acolytes-want-to-butcher-constitution-by-amending-it-to-extend-presidential-term-to-2030-without-a-referendum-geza/",
            "content": "By Staff Reporter\n\nWAR veteran Blessed Bombshell Runesu Geza has come out guns blazing attacking the Speaker of Parliament Jacob Mudenda, Justice Minister Ziyambi Ziyambi and the Prosecutor General Virginia Mabiza for allegedly trying to butcher the Constitution by repealing Section 328 and amending it to extend the presidential limit to 2030.\n\nThis comes after Geza called for a national shutdown starting tomorrow, 22 April, until Mnagagwa exits office.\n\nThe acerbic former guerilla fighter, who is in hiding since he began the push for Mnangagwas outser, claims that the trio is avoiding a referendum process and planning to use the two thirds parliamentary majority to amend the Constitution.\n\nThe situation in our country has reached another level, since our address on Saturday 19 April 2025, further damning information has come to our through progressive forces within the security sector in our country.\n\nThese progressive forces have revealed continued daily plunder of our national Treasury by Emmerson Dambudzo Mnagagwa and his Zviganandas (wealth looters).\n\nThis is done while our people continue to suffer in every way including a collapsed healthcare system, infrastructure decay, judicial capture and others.\n\nAs we speak Ziyambi Ziyambi the Minister of Justice and Parliamentary Affairs, Virginia Mabiza, Prosecutor General and Jacob Mudenda, the Speaker of the House of Assembly, are ready to submit proposals to amend the Constitution and extend presidential term to 2030.\n\nThe amendments will also extend the life of Parliament from five to seven years. This will take the current Parliament to 2030.\n\nThe amendments include repealing Section 328 of the Constitution to allow Mnangagwa to benefit from the changes.\n\nThey are also planning to use their two-thirds majority to approve the amendments and illegally avoid a referendum.\n\nThey are planning to submit the proposals to the Cabinet next week for approval. The proposed amendments will then be sent to Parliament for approval using the Zanu PF two-thirds majority. Public consultations will be conducted and even if they are resisted, amendments will be adopted by Parliament again, said Geza\n\nGeza also alleged that the trio has bribed judges to flush out anyones court application in trying to defend the Constitution.\n\nThe amendments will be adopted without conducting a referendum. We are aware of this shenanigans.\n\nApart from looting billions, they are also planning to loot the Constitution by criminally mutilating the Constitution to extend their plunder.\n\nZiyambi Ziyambi, Mudenda and Mabiza we are watching you and your time will come, Hokoyo (beware) we will not give you the chance to butcher our Constitution, we know you have met judges and ordered them to throw away any applications by anyone who will approach the court seeking a relief to save the Constitution, said Geza\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter  WAR veteran Blessed ‘Bombshell’ Runesu Geza has come out guns blazing attacking the Speaker of Parliament Jacob Mudenda, Justice Minister Ziyambi Ziyambi and the Prosecutor General Virginia Mabiza for allegedly trying to “butcher” the Constitution by repealing Section 328 and amending it to extend the presidential limit to 2030. This comes after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-acolytes-want-to-butcher-constitution-by-amending-it-to-extend-presidential-term-to-2030-without-a-referendum-geza/\">Mnangagwa acolytes want to butcher Constitution by amending it to extend presidential term to 2030 without a referendum— Geza </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Pope Francis has died aged 88",
            "url": "https://www.newzimbabwe.com/pope-francis-has-died-aged-88/",
            "content": "By AFP\n\nPOPE Francis, an energetic reformer who inspired widespread devotion from Catholics but riled traditionalists, died on Monday aged 88.\n\nThe Argentine pontiff, leader of the Catholic Church since March 2013, spent 38 days being treated for double pneumonia at Romes Gemelli hospital before seeming to recover and leaving the facility on March 23.\n\nHis death came just a day after he delighted the crowds of worshippers at the Vatican on Easter Sunday with an appearance on the balcony at Saint Peters Basilica.\n\nDearest brothers and sisters, it is with deep sorrow that I must announce the death of our Holy Father Francis, said Cardinal Kevin Farrell in the statement published by the Vatican on its Telegram channel.\n\nThis morning at 7:35 am (0535 GMT) the Bishop of Rome, Francis, returned to the home of the Father.\n\nHis entire life was dedicated to the service of the Lord and His church.\n\nHis death sets in motion centuries-old traditions that will culminate in the gathering of a conclave of cardinals to choose a successor.\n\nIn the meantime, the day-to-day running of the tiny Vatican City state will be handled by the camerlengo, a senior cardinal, currently Dublin-born Kevin Farrell.\n\nHumble pastor\n\nFrancis, whose real name was Jorge Bergoglio, was the first Jesuit to lead the worlds almost 1.4 billion Catholics and the first from the Americas.\n\nHe took over after Benedict XVI became the first pontiff since the Middle Ages to step down  and cut a sharply different figure from the German theologian.\n\nA football-loving former archbishop of Buenos Aires who was often happiest among his flock, Francis sought to forge a more open and compassionate church.\n\nHe strongly defended social justice, the rights of migrants and the environment, while also pushing through governance reforms and tackling the scourge of clerical sex abuse of children.\n\nBut critics accused him of creating doctrinal confusion and failing to defend traditional Catholic beliefs on key issues such as abortion and divorce.\n\nFranciss desire to chart a different path was evident right to the end, with his decision to be buried not in St Peters Basilica but in Romes Santa Maria Maggiore basilica.\n\nHe will become the first pope in more than 100 years to be laid to rest outside the Vatican.\n\nFrancis also rejected the tradition of popes having three coffins, instead choosing to buried in just one, made of wood and zinc, to reflect his role as a humble pastor.\n\nHealth issues\n\nFrancis had left open the possibility of stepping down if he felt unable to do his job, following the example of Benedict, who quit citing his ailing health.\n\nBut he insisted for years that time had not yet come, and maintained a busy schedule, right up to hosting the prime minister of Slovakia shortly before his hospital admission.\n\nFrancis, who had part of his lung removed as a young man, was visibly breathless in the days before going to the Gemelli, delegating aides to read his homilies at public audiences.\n\nQuestions will now be asked whether the pontiff, known for being stubborn and refusing to take rest, should have been admitted to hospital earlier.\n\nEven after he was released from hospital and ordered to rest for two months, Francis did not wait long before making public appearances.\n\nHe had been hospitalised with a respiratory infection in March 2023. That same year he also underwent surgery for a hernia, and in 2021 he had colon surgery.\n\nHe suffered knee pain that required him to use a wheelchair, and had fallen twice in recent months.\n\nYet he never took a day off and made frequent trips abroad, including a four-nation Asia-Pacific tour only last September.\n\nHuge crowds gathered wherever he went, a testament to his popularity and human touch, which saw him finish his Sunday Angelus prayer each week urging followers to pray for him and to have a good lunch.\n\nWho am I to judge?\n\nWhen Francis took over, the Catholic Church was mired in infighting and beset by a global scandal over clerical sex abuse of children and decades of cover-ups.\n\nHe promised an end to impunity and changed Vatican law to help tackle abuse, though victims said he could have gone further.\n\nMore widely, he initiated a major shake-up of the Vaticans powerful governing body, including improving financial responsibility and allowing lay Catholics to lead Vatican offices.\n\nThroughout his papacy, Francis championed the poor and vulnerable and emphasised love over doctrine.\n\nIf someone is gay and is searching for the Lord and has good will, then who am I to judge him? he said at the start of his papacy.\n\nHowever, his detractors accused him of failing to uphold established Church doctrine, and his final months were marked by increasingly outspoken attacks by senior cardinals.\n\nTensions with conservative Catholics marked the Synod congress that met at the Vatican at the end of 2023, part of a years-long global consultation on the future of the church  that Francis now leaves unfinished.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/31172615/Pope-Francis.png",
            "description": "<p>By AFP POPE Francis, an energetic reformer who inspired widespread devotion from Catholics but riled traditionalists, died on Monday aged 88. The Argentine pontiff, leader of the Catholic Church since March 2013, spent 38 days being treated for double pneumonia at Rome’s Gemelli hospital before seeming to recover and leaving the facility on March 23.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pope-francis-has-died-aged-88/\">Pope Francis has died aged 88</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Changes in Laws for Private Voluntary Organisations",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-changes-in-laws-for-private-voluntary-organisations/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss legal issues that affect Zimbabweans. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back, Mr. Madzima. This week, we want to discuss the recent enactment of the Private Voluntary Organisations Amendment Act 2025, which came into effect on 11 April 2025. Who is affected by the amendments, and what was the motivation for the amendments?\n\nVM: The amendments introduced will significantly affect how private voluntary organisations operate going forward. By private voluntary organisations, I am referring mainly to non-governmental organisations and charities, whether they are local, grassroots organisations or they are international organisations with a local presence. As long as these organisations receive donor funding or contributions, they are likely to fall within the purview or ambit of the Act.\n\nThe amendments were motivated mainly by the requirement to curb terrorist financing and money laundering through non-governmental organisations and charities. This has also seen the inclusion of words like financing the production of weapons of mass destruction being included in the amendment Act. These amendments, in an attempt to curb this, have introduced significant restrictive changes to how PVOs are regulated and increased government oversight.\n\nReporter:What are the significant measures introduced by the amendments?\n\nVM: The private voluntary organisations are now subject to anti-money laundering and counter terrorism risk assessments from the Financial Action Taskforce. Being subject to the Financial Action Task Force requires, among other things, that the organisation declare its beneficial owners. For purposes of clarity, beneficial owners include persons or organisations that have a major interest in the PVO and or have directly or indirectly significant sway in the operations of the PVO.\n\nThe new law requires Private Voluntary Organisations to be transparent about donors and donations. The money donated to it is to be used for the stated purposes in the PVOs objectives. This may assist in curbing the misuse of funding.\n\nThe amendments also ban PVOs from being involved in politics, they cannot support or be affiliated with political parties or candidates, nor fund them. Limitations and directions for non-partisan assistance have been included in the amendments.\n\nFurther, the amendments have banned discrimination against potential beneficiaries on the basis of political affiliation or to make the benefit to the potential beneficiary contingent upon political affiliation.\n\nTo achieve all this, the Registrar for private voluntary organisations has been empowered to impose civil penalties in addition to the criminal penalties imposed by the Act where there is contravention of the Act.\n\nReporter: So does this law only apply to new registrations of Private Voluntary Organisations?\n\nVM: The amendments require that existing charities or charitable entities that fall within the purview of the Act to re-register as Private Voluntary organisations within 90 days of the coming into law of the Amendment Act. Among the general information normally required with the registration of such entities, there is a further requirement to submit the beneficial ownership of the organisation.\n\nReporter: Have the amendments affected the general registration processes for PVOs?\n\nVM: Qualifying organisations are required to register as Private Voluntary Organisations within 30 days of commencing operations. The amendments have empowered the Registrar for private voluntary organisations to consider such applications, be it for registration, cancellation or amendment. Long and short, the granting of the application rests solely with the Registrar.\n\nOrganisations or persons that collect contributions or funding from the public and are not registered may be subject to imprisonment or a fine. The Registrar has been empowered to issue a written 30-day notice to an existing trust to register as a PVO should the Registrar believe that the operations of the trust are in contravention of the law in that they fall within the scope of the Act.\n\nReporter: It appears the powers of the Registrar have been extended. Is there an appeal process available for the PVOs?\n\nVM: Yes, there is an appeal process. First, the decision of the board is considered by the Minister on appeal. The Minister will consider, among other things, whether there was bias or gross misconduct in the decision-making process. Should the appealing party remain aggrieved following the Ministers determination on appeal, then the aggrieved party may further appeal to the Administrative Court.\n\nReporter: Thank you, Mr. Madzima. We have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/21073523/pvo.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss legal issues that affect Zimbabweans. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back, Mr. Madzima. This week, we want to discuss the recent enactment</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-changes-in-laws-for-private-voluntary-organisations/\">Legal Discussions with Vengai Madzima: Changes in Laws for Private Voluntary Organisations   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Victory for striking UZ lecturers as court interdicts police from stopping job action",
            "url": "https://www.newzimbabwe.com/victory-for-striking-uz-lecturers-as-court-interdicts-police-from-stopping-job-action/",
            "content": "By Staff Reporter\n\nTHE High Court has handed down a landmark decision interdicting the police from disrupting, interfering with or stopping the ongoing strike by lecturers at the University of Zimbabwe (UZ).\n\nThe order handed down by Justice Chikowero applies to both members of the union and their supporters such as non-academic employees and students.\n\nThe1stRespondentisinterdictedfrom unlawfullyinterfering,obstructingor prohibiting the picketing by the applicants members and supporters outside the premises of 3rd Respondent in terms of the pocket authorisation issued by the applicant on 15 April 2025, reads the ruling issued Saturday.\n\nAmong other conditions, the strike action should be confined to waving placards, song, dance, prayers and solidarity speeches.\n\nPolice were interdicted from unlawfully arresting protest organisers and participants, who will have two liaison officers representing them during talks with authorities.\n\nFollowing the ruling, Vashandi-Zisebenzi Working Peoples Collective (WPC) congratulated the UZ lecturers and their legal team led by Munyaradzi Gwisai and E. Matika of MG and Partners.\n\nThis is an important victory for workers. It advances the struggle for a full and effective right to strike.\n\nWe salute all unions and organisations that have given solidarity. More is needed. An important battle has been won, but the war is still to be won.\n\nAll out on Tuesday as the strike resumes. A successful lecturers strike will inspire other exploited workers to join the rallying battle for a living wage, WPC said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/15203310/uz_main_gate-min.jpeg",
            "description": "<p>By Staff Reporter  THE High Court has handed down a landmark decision interdicting the police from disrupting, interfering with or stopping the ongoing strike by lecturers at the University of Zimbabwe (UZ). The order handed down by Justice Chikowero applies to both members of the union and their supporters such as non-academic employees and students.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/victory-for-striking-uz-lecturers-as-court-interdicts-police-from-stopping-job-action/\">Victory for striking UZ lecturers as court interdicts police from stopping job action </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "‘Don’t heed call for national shutdown’— says Information Minister, labels Geza enemy of progress and a terrorist",
            "url": "https://www.newzimbabwe.com/dont-heed-call-for-national-shutdown-says-information-minister-labels-geza-enemy-of-progress-and-a-terrorist/",
            "content": "By Staff Reporter\n\nINFORMATION Minister Jenfan Muswere has laid down the gauntlet, branding his former Zanu PF party colleague, Blessed Geza, a terrorist and an enemy of progress.\n\nMuswere urged the public to ignore Gezas calls for a two-day national shut down on April 22 and 23, 2025  a protest against President Emmerson Mnangagwas rule.\n\nOn Saturday night, Geza issued a call for Zimbabweans to stay at home and not show up for work nationwide, hoping to force Mnangagwa to stand down.\n\nThe agitation for a national shut down follows Gezas March 31, 2025, protest, which, to put it mildly, failed to gain much traction. It amounted to little more than a stay-away, punctuated by a few isolated flash demonstrations in the capital.\n\nIn a press briefing yesterday, Muswere implored Zimbabweans to remain united and pay no heed to Gezas shutdown appeals.\n\nWe must remain united against cyber terrorism and enemies of progress. We have a responsibility to build our country. Zimbabweans should utilise the internet for development.\n\nWe should continue to ignore calls from unproductive charlatans and merchants of falsehoods who seek to reverse the gains of the liberation struggle through demonisation of Zimbabwes image, its people and leadership through misinformation and malice, he said.\n\nIn his Saturday night address, delivered from an undisclosed location, Geza, who was wearing military garb, called on Zimbabweans to stay at home in protest against Mnangagwas misrule.\n\nOn Tuesday and Wednesday, the 22nd and 23rd of April 2025, everyone must stay home. We must shut down Zimbabwe completely. This is to send a strong message to Mnangagwa and his zvigananda.\n\nShops and industries will not open and kombis will be parked. The police will not tear gas you, but if they ever come to you, you have the right to defend yourselves, Geza said.\n\nThe ex-combatant, who has been on the police wanted list since early February, also assured the 95 protesters arrested March 31 in Harare, and Heart and Soul Television and Radio (HSTV) journalist Blessed Mhlanga, that they will be released from prison soon.\n\nGeza told Zimbabweans that the writing is on the wall, claiming that Mnangagwa will soon be out of office.\n\nAddressing delegates at the 45th Independence celebration in Gokwe last Friday, Mnangagwa, without naming Geza directly, urged Zimbabweans to ignore instigators on social media, which Geza has been using to communicate with the public.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/19222123/Dr-Jenfan-Muswere.png",
            "description": "<p>By Staff Reporter INFORMATION Minister Jenfan Muswere has laid down the gauntlet, branding his former Zanu PF party colleague, Blessed Geza, a terrorist and an enemy of progress. Muswere urged the public to ignore Geza’s calls for a two-day national shut down on April 22 and 23, 2025 – a protest against President Emmerson Mnangagwa’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-heed-call-for-national-shutdown-says-information-minister-labels-geza-enemy-of-progress-and-a-terrorist/\">‘Don’t heed call for national shutdown’— says Information Minister, labels Geza enemy of progress and a terrorist</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Green technology firm SulNOx Group Plc obtains patent covering Zimbabwe",
            "url": "https://www.newzimbabwe.com/green-technology-firm-sulnox-group-plc-obtains-patent-covering-zimbabwe/",
            "content": "By Alois Vinga\n\nGREENTECH firm, SulNOx Group plc has obtained a patent covering Zimbabwe among other seven countries on the continent in a move aimed at protecting the companys products.\n\nIn a statement, the company said the patent was obtained from the African Regional Intellectual Property Organisation (ARIPO), which now covers the Gambia, Ghana, Kenya, Mozambique, Sierra Leone, Uganda, Zambia and Zimbabwe.\n\nThe firms product range, including Berol 6446 emulsifiers for Heavy Sulphur Fuel Oils and Sulnox Eco Fuel Conditioners, is now protected in these markets. These products are designed for use with various fuels, such as diesel, petrol/gasoline, biofuels, and marine fuels, including Marine Gas Oil and Marine Diesel Oil.\n\nThe patent is further to SulNOxs existing patent in South Africa and covers a range of formulation versions including the Berol 6446 heavy sulphur fuel oil emulsifiers and SulNOx eco fuel conditioners.\n\nSulNOx also holds a separate patent in Nigeria for fuel oil reclamation.\n\nThe ARIPO patent marks a step change in our strategy for Africa, where we are working with a number of partners to deploy our products across a range of industries.\n\nGaining wider protection for our innovation in some of Africas largest and most developed countries undoubtedly improves Sulnoxs prospects for revenue growth, particularly in the continents key sectors such as shipping, mining and road transport, said Chief Executive Officer Ben Richardson.\n\nWe look forward to announcing further progress in Africa and expansion of our patent portfolio as we target new sectors and markets worldwide.\n\nShares in SulNOx last traded at 85.56 pence on the Aquis Exchange in London following the patents announcement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/21055700/profile-ben-richardson.jpeg",
            "description": "<p>By Alois Vinga GREENTECH firm, SulNOx Group plc has obtained a patent covering Zimbabwe among other seven countries on the continent in a move aimed at protecting the company’s products. In a statement, the company said the patent was obtained from the African Regional Intellectual Property Organisation (ARIPO), which now covers the Gambia, Ghana, Kenya,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/green-technology-firm-sulnox-group-plc-obtains-patent-covering-zimbabwe/\">Green technology firm SulNOx Group Plc obtains patent covering Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Media lobby group calls for Zimbabwean journalist Blessed Mhlanga’s freedom",
            "url": "https://www.newzimbabwe.com/media-lobby-group-calls-for-zimbabwean-journalist-blessed-mhlangas-freedom/",
            "content": "By Nicole Fritz l lOL\n\nZimbabwean journalist Blessed Mhlanga has spent over 50 days behind bars. His unlawful arrest and detention are but one of President Emmerson Mnangagwas many attempts to silence the press and criminalise speech under unconstitutional laws.\n\nMhlanga, a senior journalist at Heart and Soul TV, has been charged with inciting violence and unrest after interviews with liberation veteran and former Zanu PF politician Blessed Geza. Geza accused Mnangagwa of corruption and called for his immediate resignation in the November 2024 and January 2025 interviews Mhlanga conducted with Geza.\n\nSince his arrest on 24 February 2025 for having purportedly violated a section of the criminal law which prohibits transmission of data, Mhlanga has been denied bail an extraordinary three times on the flimsiest of pretexts  including that he might interfere with state witnesses whose identities are not known to him\n\nMhlanga also suffered arrest in 2022, again seemingly for simply doing his job  covering the attempted arrest of an opposition politician.\n\nHis arrest and continued detention at present represent the furtherance of a campaign both Mnangagwa and his predecessor, Robert Mugabe, have long waged: ruthlessly targeting independent media and suppressing critical voices.\n\nNicole Fritz, executive director of the Campaign for Free Expression (CFE), said: It is high time that Blessed Mhlanga have his freedom restored, be returned to his family and be able to conduct his profession unhindered.\n\nIt is long overtime that the Mnangagwa government cease its relentless suppression of freedom of expression and allow Zimbabweans both to call and organise for better government.\n\nWe call on the diplomatic community, and on South Africa in particular, to make Blessed Mhlangas continued incarceration a matter for general engagement on Zimbabwe-related issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Nicole Fritz l lOL  Zimbabwean journalist Blessed Mhlanga has spent over 50 days behind bars. His unlawful arrest and detention are but one of President Emmerson Mnangagwa’s many attempts to silence the press and criminalise speech under unconstitutional laws. Mhlanga, a senior journalist at Heart and Soul TV, has been charged with inciting violence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/media-lobby-group-calls-for-zimbabwean-journalist-blessed-mhlangas-freedom/\">Media lobby group calls for Zimbabwean journalist Blessed Mhlanga’s freedom </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Drama as Zim dancehall artist Silent Killer refuses to get on flight to UK SAMA Festival",
            "url": "https://www.newzimbabwe.com/drama-as-zim-dancehall-artist-silent-killer-refuses-to-get-on-flight-to-uk-sama-festival/",
            "content": "By Staff Reporter\n\nZIM dancehall artist Jimmy Mudereri popularly known as Silent Killer failed to make an appearance at the UK SAMA Festival Saturday after refusing to get onto a flight alleging, he had dreamt of an airplane exploding mid-air.\n\nThis follows his shock refusal, on two instances, to board flights, which were fully paid for, with the other costing US$1,500.\n\nAlso, shocking was the fact that he checked-in at Robert Mugabe lnternational Airport, armed with his passport and VISA, only to make somersault the last minutes, arguing the plane would crash.\n\nThe second time, the delirious chanter reportedly locked himself in the toilet at the airport until the booked UK-bound airplane departed.\n\nUK SAMA Fest promoters confirmed the debacle, which is attributed to the artists misuse of drugs and substances.\n\nSilent Killer refused to board a UK-bound flight because he had a dream it would explode. He missed the first flight and my colleague had to booked another flight and paid US$1,500. Unfortunately, this time he locked himself in the airport toilet, said Fred Matenga of Y2K Promotions.\n\nSilent Killer has been producing captivating Zimdancehall music as early as 2011. He uses the tagline Ngirozi Yehondo and is popular for doing freestyles.\n\nAlso known as Ngwere the Mbare-born musician was billed to perform at the UK SAMA Festival UK on Saturday alongside sungura music virtuoso Alick Macheso, Mambo Dhuterere, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/20143157/68f1a042-a004-4d9e-b932-852b21b013d3.jpg",
            "description": "<p>By Staff Reporter  ZIM dancehall artist Jimmy Mudereri popularly known as ‘Silent Killer’ failed to make an appearance at the UK SAMA Festival Saturday after refusing to get onto a flight alleging, he had dreamt of an airplane exploding mid-air. This follows his shock refusal, on two instances, to board flights, which were fully paid</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drama-as-zim-dancehall-artist-silent-killer-refuses-to-get-on-flight-to-uk-sama-festival/\">Drama as Zim dancehall artist Silent Killer refuses to get on flight to UK SAMA Festival </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "Zimbabwe’s government avoids international embarrassment, flies Rovos Rail tourists to Victoria Falls despite promises to take them by road",
            "url": "https://www.newzimbabwe.com/zimbabwes-government-avoids-international-embarrassment-flies-rovos-rail-tourists-to-victoria-falls-despite-promises-to-take-them-by-road/",
            "content": "By Staff Reporter\n\nGOVERNMENT abandoned a disastrous plan to have tourists involved in the Gwanda train accident driven to Victoria Falls but instead had them flown to the resort town Saturday.\n\nOne of Africas most luxurious trains, Rovos Rail collided with a Beitbridge Bulawayo Rail (BBR) goods train in Gwanda over the Easter holiday while carrying 47 tourists on a fancy trip from Pretoria, South Africa.\n\nThe Bulawayo to Victoria Falls highway, on the other hand, is one of the worst in the country, with dangerous potholes and a derelict road for hundreds of kilometres.\n\nWhat is supposed to be a six-hour trip now extends beyond eight-hours as vehicles manoeuvre the tough terrain, at times moving into bushes towards Lupane and Hwange.\n\nGetting the tourists on buses to Victoria Falls would have raised eyebrows on the state of Zimbabwes roads, especially considering the luxury of their Rovos Rail.\n\nI am happy to finally be in Victoria Falls. We have enjoyed such good hospitality even after the accident. We value this, said a tourist after arriving in Victoria Falls.\n\nAlthough no fatalities were recorded, eight people, seven of them foreigners, were admitted in Gwanda and Bulawayo.\n\nAbsence of the train, whose repair was said to be on course, meant tourists had to continue using other means to Victoria Falls, with the road being governments initial plan.\n\nTourism Minister Barbara Rwodzi and Bulawayo Minister of State Judith Ncube both rushed to visit the injured tourists at Roman Catholic run private hospital Mater Dei in Bulawayo and Gwanda.\n\nThe two also toured the accident scene.\n\nGovernment, which has constantly been accused of ignoring the road, has reportedly engaged eight contractors to work on the 435km highway.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/20063404/IMG-20250420-WA0003.jpg",
            "description": "<p>By Staff Reporter GOVERNMENT abandoned a ‘disastrous’ plan to have tourists involved in the Gwanda train accident driven to Victoria Falls but instead had them flown to the resort town Saturday. One of Africa’s most luxurious trains, Rovos Rail collided with a Beitbridge Bulawayo Rail (BBR) goods train in Gwanda over the Easter holiday while</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-government-avoids-international-embarrassment-flies-rovos-rail-tourists-to-victoria-falls-despite-promises-to-take-them-by-road/\">Zimbabwe’s government avoids international embarrassment, flies Rovos Rail tourists to Victoria Falls despite promises to take them by road</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        },
        {
            "title": "High Court releases full judgement on Chinese national jailed 30 years for murder",
            "url": "https://www.newzimbabwe.com/high-court-releases-full-judgement-on-chinese-national-jailed-30-years-for-murder/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge Justice Esther Muremba has finally released her detailed judgement in the case of a Chinese national jailed 30 years for killing a miner in Zhombe and also for attempted murder and assault.\n\nCai Yulong was slapped with a 20-year jail term in September last year, but the judge issued an extempore ruling.\n\nYulong, the owner of Stone Steel Mine also known as Blue Mine in Zhombe, fatally shot Goni Goni after accusing him and his colleagues of encroaching into his mine on May 24 last year.\n\nHe also attempted to kill John Muchawaya Bera by shooting him once on the right knee and once on the left thigh, before he unlawfully struck Lovemore Mapfanya with a clenched fist.\n\nHe was convicted on all counts.\n\nYulong, who was in the country on a Temporary Work Permit, had pleaded not guilty to all the charges.\n\nIn his defence, the accused did not dispute shooting the deceased in the murder charge and the complainant in the attempted murder charge.\n\nHe claimed that his actions were in self-defence and in defence of his property.\n\nRegarding the assault charge, the accused stated that it was fabricated.\n\nHowever, the court ruled that his defence was weak.\n\nThe court heard that on the fateful day, the deceased, the complainant and their colleagues who were employed by Blackhand 10 Mine were working underground erecting the barricade.\n\nIt was heard the accused entered his mine using his shaft and proceeded to the intersection between the two mines. A confrontation ensued between the accused and the Blackhand 10 Mine workers, during which the accused shot at them.\n\nIn her ruling, Muremba said there was no justification for what Yulong did.\n\nIn this case, the offence of murder is further aggravated by the fact that the accused shot the deceased and his colleagues as they were fleeing for their lives.\n\nEven if it were accepted that the deceased and his colleagues were illegally panning for gold in the accuseds mine, the accused had no right to shoot them while they were running away.\n\nThe sanctity of human life must be upheld, and the accuseds actions demonstrate a cold-blooded killing.\n\nThe accused intentionally killed the deceased, and the deceaseds father provided a victim impact statement indicating the profound trauma caused by his sons death.\n\nThe father, who had expected his 23-year-old son to marry and provide him with grandchildren, was devastated by the unnatural and violent nature of his death, she said.\n\nThe judge also said the deceased was also the breadwinner for his family, and his loss has left them facing significant financial and emotional challenges.\n\nThe father had expressed a desire for the death penalty to be imposed, while the State has prayed for a sentence of 40 years imprisonment.\n\nIn relation to the charge of attempted murder, the accused used a firearm to shoot the complainant twice in both legs, causing serious injuries.\n\nWhen he was shooting the complainant, he was actually holding his legs to make sure that he would not escape.\n\nWhilst the doctors report states that there will not be permanent injury, we noted that the complainant was still walking with the aid of crutches when he came to court to testify, the judge said.\n\nDuring trial his right leg was still in plaster.\n\nThe complainant was shot while running away, and the victim impact statement reveals the profound pain and trauma he has endured.\n\nHe lost a workmate during the shooting and remains deeply affected by the incident. He is still nursing his injuries and is unable to provide for his family as the breadwinner.\n\nThe complainant has no hope of returning to the mining industry due to his inability to perform heavy duties, the judge noted.\n\nThe judge said the statutory penalty for attempted murder committed in aggravating circumstances is 20 years imprisonment up to death.\n\nShe said the presumptive penalty for attempted murder committed under such circumstances is five years imprisonment, but given the severity of the offence, a higher penalty is warranted.\n\nThe accused exhibited a high degree of cruelty by holding the complainant with one hand while shooting him in the back of his legs, completely disabling him from walking.\n\nThe court agrees with the States submission for a sentence of 10 years imprisonment.\n\nHowever, to avoid an excessive overall sentence, five years of this sentence will be suspended for five years on the condition that the accused does not commit an offence involving violence on the person of another during this period, she said.\n\nShe said the effective sentence for attempted murder will be five years imprisonment, which we will order to run concurrently with the sentence for murder.\n\nFor the first count Yulong was jailed 30 years.\n\nFor count two, he was jailed 10 years imprisonment of which five years imprisonment was suspended for 5 years on condition the accused does not within that period commit an offence involving violence on the person of another and for which upon conviction he is sentenced to imprisonment without the option of a fine.\n\nHe effectively sentenced to five years for the count.\n\nThis effective sentence of five years imprisonment will run concurrently with the sentence for murder.\n\nFor assault, Yulomg was fined US$100 in default of payment he will serve one month imprisonment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga  HIGH Court judge Justice Esther Muremba has finally released her detailed judgement in the case of a Chinese national jailed 30 years for killing a miner in Zhombe and also for attempted murder and assault. Cai Yulong was slapped with a 20-year jail term in September last year, but the judge issued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-releases-full-judgement-on-chinese-national-jailed-30-years-for-murder/\">High Court releases full judgement on Chinese national jailed 30 years for murder </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "21 Apr 2025"
        }
    ]
}