{
    "news": [
        {
            "title": "Former Finance deputy minister Chapfika dies in car accident",
            "url": "https://www.newzimbabwe.com/former-finance-deputy-minister-chapfika-dies-in-car-accident/",
            "content": "By Staff Reporter\n\nFormer deputy finance minister and long-serving Zanu PF member David Chapfika has died aged 68.\n\nChapfika diedafter his vehicle veered off a bridge and landed on its roof in a shallow river.\n\nHe served as Deputy Minister of Finance under the late President Robert Mugabes administration.\n\nHe also served as a legislator for Mutoko South and chairperson of the Parliamentary Portfolio Committee on Finance and Economic Development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19133559/chapfika.jpeg",
            "description": "<p>By Staff Reporter Former deputy finance minister and long-serving Zanu PF member David Chapfika has died aged 68. Chapfika died after his vehicle veered off a bridge and landed on its roof in a shallow river. He served as Deputy Minister of Finance under the late President Robert Mugabe’s administration. He also served as a legislator</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-finance-deputy-minister-chapfika-dies-in-car-accident/\">Former Finance deputy minister Chapfika dies in car accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Best Apps to Help Manage Screen Time",
            "url": "https://www.newzimbabwe.com/best-apps-to-help-manage-screen-time/",
            "content": "Screen time refers to the average amount of time you spend using your device, which should be around 3 to 4 hours daily. However, not many people live like this, especially with the increasing availability of new and advanced smartphone models. Dont be surprised that people can spend over 12 hours on their phones every day. The constant ping of notifications and endless scrolling can quietly drain productivity, disrupt sleep, and increase stress.\n\nAs such, it is important to find a balance and ensure that screen time is not affecting your personal life. Thankfully, we now have mobile apps designed specifically to manage your screen time and help you focus on productive activities. In this article, we will explore these apps and the importance of managing screen time.\n\nMany people actually attribute staring at the screen for long hours to eye strain and headaches. However, the effects cut even deeper, as they can affect both your mind and body. Over time, it can mess up your sleep cycle and even promote unhealthy habits.\n\nIn response to these effects, phone companies and other software developers are creating apps and tools that can help the average user manage screen time. These apps have been thoroughly tested and proven effective in mitigating the effects of excessive screen time. They make it easy for you tolearn instead of scrolling, get enough sleep, and improve your overall well-being.\n\nScreen time management apps allow you to create a digital routine that works for you, not against you. As such, there are certain features you need to look out for before choosing an app to use. These features indicate that the app can help you control your usage, block specific apps or sites, and even limit your notifications. Below are some key features you should look for:\n\nYour preferred screen time manager should allow you to monitor how long youve spent on your phone and the apps you use the most. This feature also allows you to view the apps and activities that are consuming your data and battery.\n\nApp usage contributes heavily to excessive screen time. People tend to spend more time on some apps than others. With an effective screen time app, you should be able to block such apps or schedule time limits for their daily use. This feature also allows you to block or restrict access to inappropriate websites.\n\nMost screen time apps provide reports and insights about your usage on all the apps and websites you visit. This helps you identify activities that consume more of your time and require improvement.\n\nAs a parent, you should be able to control what your kids watch, do, or listen to on their devices. Ensure the screen time app allows you to track their location in real-time and oversee their calls and text messages with their friends.\n\nScreen time apps should prioritise digital well-being and reduce distractions, using focus mode and notification control features. With these features, you can temporarily block apps and improve your attentiveness. An effective screen time manager should also help you reduce the number of notifications and limit notifications from specific apps.\n\nWhen it comes to managing your screen time, you need to use an effective app. Such apps give you access to exclusive features that prioritise yourphysical and mental well-being. Whether youre a parent concerned about your childs screen habits or an adult looking to reclaim focus, these apps can help. The table below reveals that the best screen time management apps can help:\n\nReducing your screen time goes beyond using an app or built-in control features. In most cases, you need to be disciplined and realistic to commit to the requirements of the app. But here are some tips you can follow to reduce your screen time successfully:\n\nExcess screen time has become one of the most pressing challenges in todays digital world. Medical experts have attributed it to several health issues, from eye strain and poor posture to anxiety, sleep disruption, and mental fatigue.\n\nIn response, developers have introduced innovative screen time management apps designed to help users build healthy digital habits. These tools empower you to take back control. Remember, managing screen time isnt about giving up devices. It is about using them more intentionally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19132100/Screenshot-2025-06-19-at-14.20.20.png",
            "description": "<p>Screen time refers to the average amount of time you spend using your device, which should be around 3 to 4 hours daily. However, not many people live like this, especially with the increasing availability of new and advanced smartphone models. Don’t be surprised that people can spend over 12 hours on their phones every</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/best-apps-to-help-manage-screen-time/\">Best Apps to Help Manage Screen Time</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "IMF says Zimbabwe’s economy has made ‘significant progress’",
            "url": "https://www.newzimbabwe.com/imf-says-zimbabwes-economy-has-made-significant-progress/",
            "content": "Bloomberg\n\nThe International Monetary Fund said Zimbabwes economic progress represents a regime change, but declined to say if or when the Washington-based lender would grant it a staff-monitored program.\n\nWojciech Maliszewski, who is visiting the southern African nation to conduct a regular IMF economic health update, said the conduct of the Reserve Bank of Zimbabwe, which has vowed to halt printing money to finance the government, was particularly impressive.\n\nThe RBZ, holding liquidity positions tight, not providing monetary financing to the government. I think this is a regime shift, he told Bloomberg on Wednesday in the capital, Harare.\n\nStill, he declined to be drawn on whether the IMF would accede to Zimbabwes request for a SMP. The informal process could lift confidence in the country and provide a stepping stone to restructuring a $21 billion debt pile thats kept it locked out of global financial markets since it defaulted in 1999.\n\nWhat is most important for us at this stage is to make sure that when authorities enter the program, they will exit a successfully completed program, he said. This requires a lot of effort, a lot time from both us and the authorities on the other side.\n\nZimbabwe, which has asked neighbouring South Africa for help in getting its debt reworked under the Group of 20 Common Framework, is trying to revive an economy wracked by years of mismanagement thats stoked hyperinflation and currency collapse.\n\nIt unveiled the gold-backed ZiG last year  its sixth attempt at creating a functioning local unit  and Maliszewski, the IMF Mission Chief for Zimbabwe since 2023, said establishing it as a fully-fledged currency would be welcome.\n\nLooking at the current macroeconomic situation comparing it to what the country was when I started my assignment and before, its massive progress, significant progress, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/01073531/harare.png",
            "description": "<p>Bloomberg The International Monetary Fund said Zimbabwe’s economic progress represents a “regime change,” but declined to say if or when the Washington-based lender would grant it a staff-monitored program. Wojciech Maliszewski, who is visiting the southern African nation to conduct a regular IMF economic health update, said the conduct of the Reserve Bank of Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-says-zimbabwes-economy-has-made-significant-progress/\">IMF says Zimbabwe’s economy has made ‘significant progress’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "No wonder the president did not tour hospitals with you – opposition MP taunts Health Minister, chucked out of National Assembly",
            "url": "https://www.newzimbabwe.com/no-wonder-the-president-did-not-tour-hospitals-with-you-opposition-mp-taunts-health-minister-chucked-out-of-national-assembly/",
            "content": "By Staff Reporter\n\nCITIZENS Coalition for Change (CCC) MP Charlton Hwende was on Wednesday removed from the National Assembly for taunting Health Minister Douglas Mombeshora over his exclusion from President Emmerson Mnangagwas visits to Harares public referral hospitals.\n\nManicaland CCC legislator Prosper Mutseyami had brought a policy question on access to health services in public health institutions.\n\nWhat steps is the government taking to improve access to affordable health care and ensure the availability of essential medicines in public hospitals and clinics across the country? Mutseyami asked.\n\nIn his response, Mombeshora tried to give a background on the patient treatment processes in the country using the Shona language, despite the question being asked in English.\n\nThis did not satisfy Hwende, who said, On a point of order, the question was asked in English. The Standing Orders are clear that the Hon. Minister should respond in English.\n\nThe deputy speaker reminded Hwende that the law said otherwise.\n\nAfter Mombeshora gave a lengthy explanation, Hwende interjected and told Mombeshora that his response was not adequate, and this was one of the reasons why President Emmerson Mnangagwa left him and his deputy behind when he visited Parirenyatwa and Sally Mugabe Hospitals on Monday.\n\nNdosaka makatizwa na President pavakaenda ku Parirenyatwa (That is why the President left you when he visited Parirenyatwa hospital), shouted Hwende.\n\nHwende was immediately shown the exit by Gezi.\n\nHwende tried to resist the order, saying: Minister havasi kupindura mubvunzo, ngavapindure mubvunzo, ndobudirei?(The minister is not answering the question. Why should l leave this house?)\n\nGezi did not tolerate any of Hwendes appeals and the MP was escorted out of the Chamber by the Serjeant-At-Arms, leading to several Points of Order by other opposition members.\n\nOn a point of order Madam Speaker. The Standing Rules and Orders say that before someone is chased out of the House, he must be informed of what his offence is, MP Makumire stated.\n\nOn another point of order, CCC MP Gladys. Hlatswayo requested the minister to answer the question raised by Mutseyami.\n\nWe kindly request the minister to answer the question. If he seeks to elaborate further or if he wants us to know what is happening in the health sector, he can come up with a Ministerial Statement. There is a direct question, and he just needs to answer the question.\n\nAnother MP, Rungwave, stood up on a point of order and asked the minister to respond to the question instead of giving a historical background.\n\nA distraught Gezi said, So, have you decided to disrupt the operations of the House with points of order?\n\nGezi responded by ordering the MPs to take their seats for house business to continue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26033121/Chalton-Hwende.jpeg",
            "description": "<p>By Staff Reporter CITIZENS Coalition for Change (CCC) MP Charlton Hwende was on Wednesday removed from the National Assembly for taunting Health Minister Douglas Mombeshora over his exclusion from President Emmerson Mnangagwa’s visits to Harare’s public referral hospitals. Manicaland CCC legislator Prosper Mutseyami had brought a policy question on access to health services in public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-wonder-the-president-did-not-tour-hospitals-with-you-opposition-mp-taunts-health-minister-chucked-out-of-national-assembly/\">No wonder the president did not tour hospitals with you – opposition MP taunts Health Minister, chucked out of National Assembly</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak",
            "url": "https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/",
            "content": "By Staff Reporter\n\nThe government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan.\n\nThis Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna Resort in Harare, marking the start of a process to craft the countrys five-year economic blueprint 2026-2030.\n\nThe indaba drew participants from industry and commerce, farmers organisations, the clergy, civil society and academia.\n\nSpeaking on the sidelines of the event, Minister of Finance, Economic Development and Investment Promotion, Mthuli Ncube, said a draft of NDS 2 should be ready by October.\n\nThe NDS 2 will be a successor to NDS 1. We have appointed consultants to do an evaluation of NDS 1 and their observations will serve as the base for NDS 2, which will be crafted following wide consultations, at the provincial and district levels. We should have a draft ready by October, said Ncube.\n\nAlthough Ncube emphasised that as NDS 1 approaches its end in December 2025, Zimbabwe remains solidly on track to attain an upper-middle-income society status, poverty and unemployment remain widespread among the general populace. The nation is reeling from a liquidity crunch amid a faltering Zimbabwe Gold (ZiG) currency.\n\nNcube said NDS 2 will serve as the crucial five-year plan to leapfrog the country towards the ambitious Vision 2030, by which Zimbabwe will attain upper-middle-class society status.\n\nNcube said chairpersons of 10 national priorities that will underpin the strategy were hitting the ground running to contribute to the national document.\n\nThe final document is expected to be tabled by November 2025, ahead of the National Budget presentation. Thereafter, it will be officially launched by the President.\n\nFollowing NDS 2s launch, Ncube said there will be public awareness campaigns by amplifiers to extensively disseminate its contents so that there is buy-in for the important national blueprint.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Staff Reporter The government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan. This Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/\">Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        },
        {
            "title": "Rapist, robber jailed 75 years",
            "url": "https://www.newzimbabwe.com/rapist-robber-jailed-75-years/",
            "content": "By Staff Reporter\n\nA MAGISTRATE has meted a deterrent sentence to a rapist robber, condemning him to 75 years imprisonment.\n\nAccused person, John Foroma (38) appeared at Chipinge Magistrates Court, where he pleaded guilty to all five counts of rape, two counts of aggravated indecent assault, and one of robbery.\n\nHe was sentenced to 15 years for each of the five counts of rape and indecent assault. He was also slapped with five years imprisonment for the robbery count. The sentences run consecutively, resulting in a total effective term of 75 years.\n\nThe court heard that during the night of May 3 this year, in the Chief Ngungunyana area, he unlawfully entered a house, where a 13-year-old victim and her siblings were sleeping. He threatened her with a knife before raping her three times.\n\nThe assailant went on to sexually assault the other two minor girls, aged 9 and 11.\n\nIn another count, Foroma used violence against a 63-year-old woman to steal her Hisense cellphone. He later sold the gadget, which was tracked by police, leading to his arrest on June 15.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A MAGISTRATE has meted a deterrent sentence to a rapist robber, condemning him to 75 years imprisonment. Accused person, John Foroma (38) appeared at Chipinge Magistrates Court, where he pleaded guilty to all five counts of rape, two counts of aggravated indecent assault, and one of robbery. He was sentenced to 15</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rapist-robber-jailed-75-years/\">Rapist, robber jailed 75 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:40",
            "date": "19 Jun 2025"
        }
    ]
}