{
    "news": [
        {
            "title": "Breast cancer diagnoses and deaths expected to surge worldwide, says WHO",
            "url": "https://www.newzimbabwe.com/breast-cancer-diagnoses-and-deaths-expected-to-surge-worldwide-says-who/",
            "content": "The Guardian\n\nBreast cancer diagnoses and deaths are projected to surge worldwide by 2050, the World Health Organizations cancer agency has said, with cases in the UK to rise by 21% and deaths by 42%.\n\nGlobally, one in 20 women will be diagnosed with the disease in their lifetime, with cases up 38% and deaths up 68% over the next 25 years, according to an analysis by the International Agency for Research onCancer(IARC).\n\nThere will be 3.2m new cases and 1.1m deaths a year worldwide by 2050 if current trends continue, the study found. In the UK, cases are expected to rise from 58,756 cases a year in 2022 to 71,006 cases a year in 2050. Deaths will jump from 12,122 a year in 2022 to 17,261 in 2050.\n\nThe findings werepublished in the journal Nature Medicine.\n\nEvery minute, four women are diagnosed with breast cancer worldwide and one woman dies from the disease, and these statistics are worsening, said the IARC scientist Dr Joanne Kim, one of the authors of the report.\n\nCountries can mitigate or reverse these trends by adopting primary prevention policies  and by investing in early detection and treatment.\n\nThe projected increase in cases worldwide is probably due to a mix of factors, including a growing and ageing global population, improvements in detection and diagnosis, and a higher prevalence of known risk factors for the disease.\n\nFactors that increase the risk of breast cancer include getting older, inherited faulty genes and a family history of the disease.\n\nGlobally, most breast cancer cases and deaths occur in women aged 50 and above, who account for 71% of new cases and 79% of deaths, the IARC said.\n\nAbout a quarter of breast cancer cases can be prevented, the studys authors said, for example by reducing alcohol intake, maintaining a healthy weight and becoming more active.\n\nBreast cancer is the most common form of cancer in women worldwide but its burden is not evenly distributed. The IARC said diagnosis rates were highest in Australia and New Zealand, followed by North America and northern Europe, and lowest in Asia and Africa. However, death rates were highest in Melanesia and Polynesia, and in west Africa.\n\nOver the last decade, incidence rates grew by 1% to 5% a year in 27 of 50 countries studied, the IARC said. Importantly, breast cancer mortality rates decreased in 29 of 46 countries analysed.\n\nDr Isabelle Soerjomataram, the deputy head of the IARCs cancer surveillance branch, said: Continued progress in early diagnosis and improved access to treatment are essential to address the global gap in breast cancer and ensure that the goal of reducing suffering and death from breast cancer is achieved by all countries worldwide.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25043551/Screenshot-2025-02-25-at-06.35.38.png",
            "description": "<p>The Guardian Breast cancer diagnoses and deaths are projected to surge worldwide by 2050, the World Health Organization’s cancer agency has said, with cases in the UK to rise by 21% and deaths by 42%. Globally, one in 20 women will be diagnosed with the disease in their lifetime, with cases up 38% and deaths</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/breast-cancer-diagnoses-and-deaths-expected-to-surge-worldwide-says-who/\">Breast cancer diagnoses and deaths expected to surge worldwide, says WHO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Injured SANDF troops to be repatriated from DRC conflict zone soon",
            "url": "https://www.newzimbabwe.com/injured-sandf-troops-to-be-repatriated-from-drc-conflict-zone-soon/",
            "content": "IOL\n\nDefence Minister Angie Motshekga says theSA National Defence Force (SANDF) memberswho were injured in the Democratic Republic of Congo (DRC) during a battle with M23 rebels will be back in the country soon.\n\nWe are expecting the injured ones to be back soon, but we are also in direct communication with those who are in the DRC for other missions. As government, we continue to commit ourselves to work with them, she said.\n\nMotshekgaannounced the news on Sunday at the funeral of Rifleman Richard Chokoe, one of the 14 SANDF troops who were killed in armed combat in the DRC.\n\nShe committed the government to looking after the families of the14 fallen SANDFsoldiers.\n\nThe minister also said they would ensure that those who are still on a mission will be assisted at all times.\n\nWe will make sure that families of those who departed are looked after, especially the children. But also, those who are still in the mission, we will work with them and make sure that they get all the necessary support, she said.\n\nThis comes a week after a mission to repatriate more than 100 wounded and unwell SANDF personnel was suspended.\n\nThere are at least 189 soldiers reportedly injured or unwell in the DRC, at least five of whom have been reported badly wounded, and two of whom have been confirmed pregnant.\n\nThese soldiers served in a peacekeeping assignment in Southern Africa and were wounded during clashes with rebel forces.\n\nMotshekga expressed confidence in South Africas relations with other countries, saying there have been good developments and the United Nations (UN) have pronounced themselves on the matter.\n\nWe were at the AU last week, it also pronounced itself on the very same matter. There was a special commission to focus on this and they endorsed the decisions of Tanzania and Zimbabwe.\n\nSo even the two communities, the eastern community and SADC will be meeting soon to monitor implementation of the agreement. Theres a lot of good and positive progress, she said.\n\nMeanwhile, some of the troops were laid to rest last week while others were buried over the weekend in other provinces.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25042632/Screenshot-2025-02-25-at-06.26.17.png",
            "description": "<p>IOL Defence Minister Angie Motshekga says the SA National Defence Force (SANDF) members who were injured in the Democratic Republic of Congo (DRC) during a battle with M23 rebels will be back in the country soon. “We are expecting the injured ones to be back soon, but we are also in direct communication with those who are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/injured-sandf-troops-to-be-repatriated-from-drc-conflict-zone-soon/\">Injured SANDF troops to be repatriated from DRC conflict zone soon</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "US star John Legend defends playing Rwanda concert during war",
            "url": "https://www.newzimbabwe.com/us-star-john-legend-defends-playing-rwanda-concert-during-war/",
            "content": "BBC\n\nAmerican singer-songwriter John Legend has told the BBC he is unfazed by a public backlash against his decision to perform in Rwanda, despite the countrys involvement in the war in neighbouring Democratic Republic of Congo.\n\nI dont believe that we should punish the people of Rwanda and punish the people of other countries when we disagree with their leaders, he said after last weeks concert in Kigali.\n\nIn recent weeks, M23 rebels, backed by Rwanda, have seized the two largest cities in the mineral-rich east of the DR Congo.\n\nThere is evidence Rwanda has sent 4,000 troops across the border to support the rebels.\n\nHundreds of thousands of civilians are now destitute having fled their homes, andshocking violence, including the rape of children, has skyrocketed.\n\nCritics argue that Legend could have made a powerful statement by pulling out of the concert, especially given his highly respected EGOT status as someone who has won Emmy, Grammy, Oscar and Tony awards.\n\nFellow Grammy-winner Tems did pull out of a concert she was due to give on Saturday in Rwanda,saying she would never, ever intend to be insensitive to real-world issues.\n\nBut Legend defended his decision to headline the Move Afrika event in Kigali, which was run by the Global Citizen NGO and attracted thousands of fans from across the continent.\n\nHe said he was not being paid for the performance but felt it was his duty to help grow touring capabilities on the African continent, which is often overlooked by international stars on so-called world tours.\n\nIm aware of whats happening [in DR Congo] and Im aware of the calls there have been for me to not do this show, but I really believe that the mission of Move Afrika is still important, he told the BBC.\n\nDelighted fans at the sold-out show agreed, but the social media backlash was ferocious enough to force Legend to delete an Instagram post he had made promoting the event.\n\nBelgium-based activist Denise Zanesa had argued that performing under the banner of Rwanda would be akin to collaborating with oppression itself,in a message posted to X (formerly Twitter).\n\nIt was a sentiment echoed by others, including Simone Umba in the US, whowrote in a TikTok video caption: So are we ready to talk about Rwandas use of Black American culture in their soft campaigning to normalise their terrorising of eastern Congo?\n\nTaking a political stance would have been nothing new for the star.\n\nLegend is outspoken in his criticism of US President Donald Trump. He also severed ties with former mentor Kanye West when he ran for president, suspecting it was part of a wider Trump campaign tosiphon black peoples votes away from the Democrats.\n\nThe debate over Rwandas relationship with popular global figures is also not new.\n\nMost recently, Rwanda has been accused of sportswashing  with critics saying it uses the feel-good factor of international football to cover up alleged human rights abuses at home.\n\nThe East African nation is said to receive $1bn (800m) a year in foreign aid and its tourism arm  Visit Rwanda  has lucrative sponsorship deals with Arsenal in England, Bayern Munich in Germany and Paris St-Germain in France.\n\nWhen asked his thoughts on the topic, Legends aide told the BBC that he would not answer that question.\n\nIt appears that, as far as Legend and his team are concerned, his music itself should do the talking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25042111/john-legend.webp",
            "description": "<p>BBC American singer-songwriter John Legend has told the BBC he is unfazed by a public backlash against his decision to perform in Rwanda, despite the country’s involvement in the war in neighbouring Democratic Republic of Congo. “I don’t believe that we should punish the people of Rwanda and punish the people of other countries when</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-star-john-legend-defends-playing-rwanda-concert-during-war/\">US star John Legend defends playing Rwanda concert during war</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Chinese national stashes rhino horns worth US$350,000 in owl sculpture, attempts to smuggle them out of Zim",
            "url": "https://www.newzimbabwe.com/chinese-national-stashes-rhino-horns-worth-us350000-in-owl-sculpture-attempts-to-smuggle-them-out-of-zim/",
            "content": "By Staff Reporter\n\nA Chinese national has been arrested on allegations of attempting to smuggle rhino horns worth US$350,000 out of the country.\n\nThe horns were found stashed in an owl sculpture.\n\nThe suspect is Lin Wang. He will be jointly charged with Cuthbert Maoko, a Zimbabwe Revenue Authority (Zimra) official who is already on remand.\n\nWang is being charged for contravening the Parks and Wildlife Act.\n\nHe was remanded in custody when he appeared before Harare magistrate Isheanesu Matova who advised him to seek bail at the High Court.\n\nAccording to prosecutor Rufaro Chonzi, on 12 September 2024 Wang went to the airport holding a 13-kilogram owl-hardened plastic sculpture to which he intended to facilitate its shipment to China by processing its export papers.\n\nIt is alleged that security officials observed the accused holding the parcel which looked suspicious and alerted other stakeholders.\n\nThe sculpture was put on AGS Scanner and the image was not consistent which prompted the stakeholders to want to verify what was contained therein.\n\nThe sculpture was placed on items held by Zimra on receipt number 029910A on 12 September 2024 awaiting a two months period. After the lapse of the two-month period and on the 20 November 2024, the concerned stakeholders who first witnessed the item being taken into custody by ZIMRA were again summoned to witness the breaking of the sculptor the clearing agent.\n\nWhen the sculpture was broken, it was discovered that there were five rhino horn pieces which were wrapped by a newspaper and tied by a transparent plastic hidden inside.\n\nThe agent implicated the accused as the one who gave him the sculpture which contained the recovered rhino horn pieces.\n\nThe agent called Wang to come to the airport to answer the questions relating to the case but the accused disappeared.\n\nThe five Rhino horn pieces were seized by Zimra on notice of seizure receipt number 024315L.\n\nThe recovered exhibit was conveyed to Zimparks for assaying where it was assayed in the presence of the agent since the accused was on the run and it was found to be five pieces of rhino horns all valued at US$ 360 000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter A Chinese national has been arrested on allegations of attempting to smuggle rhino horns worth US$350,000 out of the country. The horns were found stashed in an owl sculpture. The suspect is Lin Wang. He will be jointly charged with Cuthbert Maoko, a Zimbabwe Revenue Authority (Zimra) official who is already on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-national-stashes-rhino-horns-worth-us350000-in-owl-sculpture-attempts-to-smuggle-them-out-of-zim/\">Chinese national stashes rhino horns worth US$350,000 in owl sculpture, attempts to smuggle them out of Zim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "SADC countries urged to strengthen cross-border infrastructure to boost regional development",
            "url": "https://www.newzimbabwe.com/sadc-countries-urged-to-strengthen-cross-border-infrastructure-to-boost-regional-development/",
            "content": "Xinhua\n\nSouthern African Development Community (SADC) member states should strengthen cross-border infrastructure to advance regional integration and economic development, a senior SADC official said on Monday.\n\nSpeaking at the SADC ministerial meeting on meteorology, transport, and information and communications technology (ICT) in Harare, Zimbabwes capital, Angele Makombo Ntumba, deputy executive secretary responsible for regional integration of the SADC, said member states should strengthen meteorological cooperation and promote transport and ICT infrastructure development, as these are critical to achieving regional integration and economic prosperity.\n\nNtumba said SADC member states must enhance partnerships with regional and international stakeholders, mobilize financial and technical resources, and work toward harmonizing policies that promote climate resilience, sustainable transport, ICT infrastructure, and economic development.\n\nShe pointed out that the SADC region is facing significant and unprecedented challenges posed by climate change, with extreme weather events, rising temperatures, shifting rainfall patterns, and prolonged droughts increasingly affecting socio-economic stability and sustainable development in the region.\n\nIn this regard, having good roads, an efficient railway system, border posts, good seaports and shipping services, and efficient aviation systems is vital, as this will ensure quick and effective delivery of goods and services, transiting into and within the SADC region, said Ntumba.\n\nThe five-day meeting seeks to review progress on the implementation of programs in the three sectors to promote regional integration.\n\nThe SADC is a 16-member southern African regional bloc whose members include Angola, Botswana, the Comoros, the Democratic Republic of the Congo, Eswatini, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, Seychelles, South Africa, Tanzania, Zambia, and Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24171341/Angele-Makombo-Ntumba.jpg",
            "description": "<p>Xinhua Southern African Development Community (SADC) member states should strengthen cross-border infrastructure to advance regional integration and economic development, a senior SADC official said on Monday. Speaking at the SADC ministerial meeting on meteorology, transport, and information and communications technology (ICT) in Harare, Zimbabwe’s capital, Angele Makombo N’tumba, deputy executive secretary responsible for regional integration</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-countries-urged-to-strengthen-cross-border-infrastructure-to-boost-regional-development/\">SADC countries urged to strengthen cross-border infrastructure to boost regional development</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Avocado exports spur Tanganda revenue to US$25,7 mln",
            "url": "https://www.newzimbabwe.com/avocado-exports-spur-tanganda-revenue-to-us257-mln/",
            "content": "By Alois Vinga\n\nLISTED producer, packer and distributor of tea, Tanganda Tea Companys (TTC) revenue surged to US$25,7 million attributed to strong avocado exports in the just-ended financial year.\n\nPresenting an Annual Report for the year ended September 30 2024, TTC board chairman, Herbert Nkala said revenue during the period significantly improved.\n\nRevenue for the year of US$25,7 million grew by 9% from the prior year of USD23.6 million primarily attributable to an increase in avocado export volumes and the recovery of their selling prices as Covid-19 pandemic restrictions eased.\n\nThe company achieved a profit after tax of US$1.4 million from a loss of US$3.1 million in the previous year, he said.\n\nDuring the period, Avocado production of 3 976 tons grew by 84% over prior year production of 2 156 tons due to the increased maturity profile of the plantations.\n\nThe crops exports grew by 40% to 2 997 tons from 2 148 tons achieved in the prior year. Growth in export volumes was buttressed by the firming of export prices to an average 75 US cents per kg from 44 US per kg cents achieved in the prior year following global easing of Covid-19 imposed restrictions.\n\nThe company sold 60% of its non-exportable secondary grade for oil extraction and to the retail and informal sector, while 40% was unsalable.\n\nIn the ensuing financial year, it is expected that the previously unsalable secondary grades will be channelled towards crude oil extraction.\n\nMacadamia production of 1 626 tons increased by 77% over prior year production of 921 tons. Exports declined by 3% to 1 508 tons from 1551 tons in the previous year, due to logistical issues caused by rescheduled ships, affecting the last consignment of 286 tons.\n\nThe decline in packed tea sales volumes of 7% from 1 873 tons in the prior year to 1 733 tons in this financial year was due to packaging material supply constraints, depressed performance from the traditional formal customers and overall macroeconomic dynamics.\n\nThe operating environment is expected to remain complex, largely influenced by adverse developments on currency and inflation. The effects of the El Nino-induced drought are likely to persist until the next harvesting period in April 2025, added Nkala.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/24214809/Avocado.jpg",
            "description": "<p>By Alois Vinga LISTED producer, packer and distributor of tea, Tanganda Tea Company’s (TTC) revenue surged to US$25,7 million attributed to strong avocado exports in the just-ended financial year. Presenting an Annual Report for the year ended September 30 2024, TTC board chairman, Herbert Nkala said revenue during the period significantly improved. “Revenue for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/avocado-exports-spur-tanganda-revenue-to-us257-mln/\">Avocado exports spur Tanganda revenue to US$25,7 mln</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Caledonia Plc appoints Ross Jerrard new CFO",
            "url": "https://www.newzimbabwe.com/caledonia-plc-appoints-ross-jerrard-new-cfo/",
            "content": "By Alois Vinga\n\nCALEDONIA Mining Corporation Plc (Caledonia) has appointed Ross Jerrard as the new Chief Finance Officer.\n\nHis appointment is with immediate effect.\n\nHe takes over from outgoing CFO,Chester Goodburn who is set to step down from his role on March 24 2025, following the publication of Caledonias financial results for the year to December 31, 2024.\n\nJerrard brings extensive experience in financial leadership, having been the CFO of Centamin Plc from April 2016 until its acquisition by AngloGold Ashanti Plc in November 2024 for a deal value of US$2.5 billion.\n\nCentamin was a former FTSE-250 dual-listed (London and Canada) mining company with operations in Egypt and West Africa. Centamins flagship asset was the Sukari gold mine in Eqypt which is one of the worlds largest gold mines producing 450,000 ounces of gold per annum.\n\nJerrard is a member of the Institute of Chartered Accountants of Australia and New Zealand and the Institute of Chartered Accountants of Zimbabwe.\n\nCaledonia Plc CEO Mark Learmonth expressed gratitude to the services extended by Goodburn as he welcomed the incoming CFO.\n\nChester has made a substantial contribution to Caledonias growth since he joined us in 2014, the last two-and-a-half years as CFO. Along with the board and his colleagues, I thank him for his time at Caledonia and we wish him well in his future endeavours.\n\nI am pleased to welcome Ross to Caledonia. He brings a depth and breadth of experience which will be invaluable to Caledonia as we advance our strategy to become a mid-tier, Zimbabwe-focussed gold producer, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/04025045/Caledonias-chief-executive-officer-Mark-Learmonth.jpeg",
            "description": "<p>By Alois Vinga CALEDONIA Mining Corporation Plc  (Caledonia) has appointed Ross Jerrard as the new Chief Finance Officer. His appointment is with immediate effect. He takes over from outgoing CFO, Chester Goodburn who is set to step down from his role on March 24 2025, following the publication of Caledonia’s financial results for the year to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caledonia-plc-appoints-ross-jerrard-new-cfo/\">Caledonia Plc appoints Ross Jerrard new CFO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "US$7 million Presidential Goats scheme fraud trial postponed again; lawyer says Chimombe is sick and needs time to heal",
            "url": "https://www.newzimbabwe.com/us7-million-presidential-goats-scheme-fraud-trial-postponed-again-lawyer-says-chimombe-is-sick-and-needs-time-to-heal/",
            "content": "By Mary Taruvinga\n\nJailed businessman, Mike Chimombe failed to show up for trialMondayin a case he is accused of defrauding the state of US$7 million in a Presidential Goats Scheme.\n\nAccording to a letter from doctors submitted before High Court judge Pisirayi Kwenda, Chimombe is currently ill and will require at least seven days to recuperate.\n\nHis lawyer, Ashiel Mugiya asked for a postponement of the trial to next Monday to allow his client to heal.\n\nThe basis of the application is that the second accused person, Mike Chimombe is not feeling well and is not in a state that he could stand trial. I received a document dated the 22ndof February 2025 in which a medical practitioner attended to the second accused person.\n\nThe document indicates that the accused is expected to recuperate within seven days so my application is that the matter be postponed to Monday next week, on the 3rdof March for commencement of trial, Mugiya submitted.\n\nThe court heard the letter was written by Dr D Ngwaru.\n\nMugiya also requested a court order directing that Chimombe be examined by a state doctor.\n\nI so pray that this directive will be issued by the court, he said.\n\nWitness Mabhaudhi representing the state said he was not opposed to the postponement but shot down the request to have a courtorderissued as requested by Mugiya.\n\nIts unlike a mental health issue. No one is challenging that medical report.\n\nWe expect him (Chimombe) to be here on Monday so there is no need for him to be examined by a doctor. The matter has been remanded so that should suffice, he said.\n\nThe presiding judge Kwenda granted a postponement of the trial to Monday but agreed with the state and said he would not issue a court order for Chimombe to be seen by state doctors.\n\nChimombe is jointly charged with his colleague Moses Mpofu.\n\nThe two have been in custody since their arrest in June last year with all their attempts to secure freedom having failed.\n\nThere have been many false starts to the duos trial from the time they were indicted last year.\n\nThe two made a lengthy application for referral of their case to the Constitution Court without luck.\n\nTheir trial has also been postponed on several occasions for various reasons.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga Jailed businessman, Mike Chimombe failed to show up for trial Monday in a case he is accused of defrauding the state of US$7 million in a Presidential Goats Scheme. According to a letter from doctors submitted before High Court judge Pisirayi Kwenda, Chimombe is currently ill and will require at least seven days to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us7-million-presidential-goats-scheme-fraud-trial-postponed-again-lawyer-says-chimombe-is-sick-and-needs-time-to-heal/\">US$7 million Presidential Goats scheme fraud trial postponed again; lawyer says Chimombe is sick and needs time to heal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Journalist Blessed Mhlanga arrested over Geza interview; accused of transmitting information that incites violence",
            "url": "https://www.newzimbabwe.com/journalist-blessed-mhlanga-arrested-over-geza-interview-accused-of-transmitting-information-that-incites-violence/",
            "content": "By Costa Nkomo\n\nHeart and Soul Television (HSTV) journalist Blessed Mhlanga has been arrested and charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23. The charges relate to Mhlanga granting an interview to Blessed Geza, a staunch opponent of the Mnangagwa 2030 agenda, war veteran, and Zanu PF Central Committee member.Section 164 pertains to the transmission of information that incites violence or causes damage to property.Geza had issued press briefings and interviews through HSTV, anchored by Mhlanga, calling for President Emmerson Mnangagwa to resign from officeimmediately, adding that failure to which the people of Zimbabwe will use the constitution to assist him to step down.Last week, police issued a statement appealing to the public for informationregardingMhlangas whereabouts. Mhlanga denied that he was on the run andstatedthat he would present himself to the police on Monday. Upon presenting himself to the Harare Central Police State CID Law and Order department, Mhlanga was charged andsubsequentlydetained.Alpha Media Holdings owner Trevor Ncube posted on his X account on Monday afternoon, informing the public of Mhlangas arrest.I condemn in the strongest terms the arrest and detention of Blessed Mhlanga today. Dhara is spending the night in police custody accused of Transmission of data message inciting violence or damage to property. This followsHStvNewsbroadcast of an interview with Blessed Geza. This is punishing Dhara for doing his work as a journalist. Dhara is a principled and courageous journalist who will not be broken by this brazen harassment and intimidation, Ncube wrote.\n\nI condemn in the strongest terms the arrest and detention of@bbmhlangatoday. Dhara is spending the night in police custody accused of Transmission of data message inciting violence or damage to property. This follows@HStvNewsbroadcast of an interview with Blessed Geza. Thispic.twitter.com/MpMpbFa0js\n\n Trevor Ncube (@TrevorNcube)February 24, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24145559/blessed.jpeg",
            "description": "<p>By Costa Nkomo Heart and Soul Television (HSTV) journalist Blessed Mhlanga has been arrested and charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23. The charges relate to Mhlanga granting an interview to Blessed Geza, a staunch opponent of the Mnangagwa 2030 agenda, war veteran, and Zanu PF Central Committee</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-blessed-mhlanga-arrested-over-geza-interview-accused-of-transmitting-information-that-incites-violence/\">Journalist Blessed Mhlanga arrested over Geza interview; accused of transmitting information that incites violence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        },
        {
            "title": "Urban Connect bus accident death toll rises to 28; two victims yet to be identified",
            "url": "https://www.newzimbabwe.com/urban-connect-bus-accident-death-toll-rises-to-28-two-victims-yet-to-be-identified/",
            "content": "By Staff Reporter\n\nTHE death toll in theaccident involving an Urban Connect bus and a haulagetruck along the Masvingo-Beitbridge highway has risen to 28, police has said.\n\nThe accidentkilled 17 people on the spot, while seven others died upon admission at Beitbridge Hospital, and four more later died while receiving treatment bringing the total death toll to 28.\n\nThe tragic accident occurredtwo weeks agonear Lutumba tollgate when a Beitbridge-bound Urban Connect bus collided with a truck transporting magnesium to Chirundu.\n\nIn a statement Monday, the Zimbabwe Republic Police (ZRP) said two bodies remain unknown.\n\nReference is made to the ZRP press statement released on 21 February 2024 on a fatal road traffic accident which occurred on 13 February 2024 at the 262-kilometre peg along Masvingo-Beitbridge Road, Lutumba.\n\nThe death toll has risen to 28.\n\nTwo victims, a man and woman, are yet to be identified, ZRP said.\n\nThe crash was allegedly a result of reckless driving, as witnesses claimed the Urban Connect driver was speeding.\n\nThe government last week suspended Urban Connect Holdings Pvt Ltd operating license for six months saying the bus did not have a valid passenger insurance policy or route permit, and its driver had not met the re-test requirement, violating multiple transport regulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13112930/urban-connect.jpeg",
            "description": "<p>By Staff Reporter THE death toll in the accident involving an Urban Connect bus and a haulage truck along the Masvingo-Beitbridge highway has risen to 28, police has said. The accident killed 17 people on the spot, while seven others died upon admission at Beitbridge Hospital, and four more later died while receiving treatment bringing the total death</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/urban-connect-bus-accident-death-toll-rises-to-28-two-victims-yet-to-be-identified/\">Urban Connect bus accident death toll rises to 28; two victims yet to be identified</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "25 Feb 2025"
        }
    ]
}