{
    "news": [
        {
            "title": "ZIFA blocks PSL bid to suspend relegation, says proposal is invalid",
            "url": "https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer Leagues (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, cannot be implemented.\n\nAt an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under PSLs proposal, eight teams that were facing relegation this season would survive, while the four regional division champions would be promoted to the topflight, bringing the league to 22 clubs.\n\nThe meetingwas convened after ZIFA had earlier recommended a 20-team league structure.\n\nIn a statement, ZIFA, however, trashed the PSLs resolution,\n\nThe Association wishes to make it unequivocally clear that this proposal cannot be implemented. Promotion and relegation are fundamental components of football competition and are essential to maintaining the integrity, fairness, and sporting merit of the league system.\n\nZIFA confirmed that four clubs will be relegated at the conclusion of the 2025 Castle Lager Premier Soccer League season, which officially ends on 23 November 2025.\n\nThe association also reminded the PSL to follow proper procedure when proposing structural changes in the future.\n\nShould the Premier Soccer League or any other member wish to propose an adjustment to the number of participating teams or propose any other resolution, such a request must be formally submitted to the Association. In accordance with ZIFA statutes, the proposal will then be tabled for consideration at the next ZIFA Congress, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer League’s (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, “cannot be implemented.” At an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/\">ZIFA blocks PSL bid to suspend relegation, says proposal is invalid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "Cloudflare outage disrupts X, ChatGPT and other parts of the internet",
            "url": "https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/",
            "content": "The Verge\n\nCloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage thats taking down sites across the web. Users encountered error messages when trying to access X,ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs of recovery.\n\nMany sites displayed an error message saying Please unblock challenges.cloudflare.com to proceed. On Cloudflaresstatus page, the most recent update from the company at 9:34AM ET says:\n\nWeve deployed a change which has restored dashboard services. We are still working to remediate broad application services impact.\n\nIn a statement toThe Verge, Cloudflare spokesperson Jackie Dutton says the company noticed a spike in unusual traffic to one of its services starting at 6:20AM ET, causing some traffic passing through Cloudflares network to experience errors. Dutton adds, We do not yet know the cause of the spike in unusual traffic. We are all hands on deck to make sure all traffic is served without errors. The company is also planning to investigate the cause of the unusual spike in traffic.\n\nOther online services, including Indeed, Grindr, Uber, Canva, Spotify, NJ Transit,League of Legends, and Archive of Our Own, experienced issues during the outage, while digital outlets likeAxios,The Information, andPoliticoalso went down.\n\nThe Cloudflare outage comes less than a month after a hugeAmazon Web Services crash took downFortnite, Alexa, Snapchat, and other services, which was followed by issues atMicrosoft Azure that brought Xbox offlinefor hours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18150503/cloudflare.jpeg",
            "description": "<p>The Verge Cloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage that’s taking down sites across the web. Users encountered error messages when trying to access X, ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/\">Cloudflare outage disrupts X, ChatGPT and other parts of the internet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "Zimbabwe’s miners spending a paltry US$11 million on exploration",
            "url": "https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/",
            "content": "By Alois Vinga\n\nA mineral asset valuation expert has raised alarm over Zimbabwes mining sectors paltry US$11 millionannual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more.\n\nMining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical and geochemical methods. It is the first and most critical stage of mining, involving mapping, surveys and exploratory drilling to identify potential ore bodies before mining decisions are made.\n\nSpeaking toNewZimbabwe.comon the sidelines of the inaugural Zimbabwe Gold Investment Conference on Monday, Ernst & Young Associate Partner Dr Godknows Njowasaid Zimbabwes exploration spending remains far too low.\n\nErnst & Young Associate Partner Dr Godknows Njowa\n\nIn terms of exploration, Zimbabwe spends only 0.2% of annual global exploration expenditure, and within Africa, we contribute just 2%. Yet Africas total share is around 9%, he said.\n\nSo this shows that in Zimbabwe, we are not spending enough money on exploration. During my presentation, I gave the example of Canada, which is the highest spender in the world at about 20% of the annual global exploration budget.\n\nNjowa warned that Zimbabwe continues to lose opportunities, saying the country has the potential to double its current gold outputif it adequately explores and develops new deposits.\n\nFor decision makers,both government and private sector,more money must be allocated to exploration. Gold mining companies globally are making super profits because prices are at levels not seen in the past 30 or 40 years.\n\nSo some of that money should be reinvested into exploration. You need to spend between US$50 and US$80 per ounceof what you produce on exploration, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga A mineral asset valuation expert has raised alarm over Zimbabwe’s mining sector’s paltry US$11 million annual spend on exploration, warning that the country risks missing out on vast untapped mineral value unless both government and industry invest more. Mining exploration is the systematic process of locating economically viable mineral deposits through geological, geophysical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-miners-spending-a-paltry-us11-million-on-exploration/\">Zimbabwe’s miners spending a paltry US$11 million on exploration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds",
            "url": "https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/",
            "content": "The Globe and Mail\n\nThe documentaryMbira Talks, about a Zimbabwean-Canadian musicians relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Eds department store in the background.\n\nThe lights went out in that building in 2016, and it was torn down a year later. Director Adrienne Amato originally planned to make a film about Stella Chiweshe, the pioneering rebel queen of the instrument, often referred to as a thumb piano because of the metal tines affixed to a wooden board that are struck by the first digits of the human hand.\n\nLogistics sabotaged the film on Chiweshe, who died in 2023 at age 76. Amato, who is white and was born in Zimbabwe when it was still under British rule as Rhodesia, immigrated to Toronto in 1977. After Chiweshes death, she shifted her focus to Mutamba. Still, the documentary, which premieres online and at the South African Film Festival in Toronto on Monday, took years to make, mostly because of money.\n\nIts very specific what gets funding these days, said the filmmaker, who joined Mutamba on a video call. Unless you have a celebrity in your doc or its a whodunnit crime thing, its a difficult landscape for making documentaries these days.\n\nAmato did not have a celebrity in her film, but she and Mutamba did have one on their side. Canadian indie-pop star Leslie Feist donated her frequent-flier miles for the trip to Africa by Amato, Mutamba and cinematographer Tess Girard. She also helped pay for the digging of a well at the Ubuntu Learning Village, the educational and community hub Mutamba co-founded in rural Zimbabwe.\n\nMutamba came to Canada more than 20 years ago to study economics at Trent University in Peterborough, Ont. The self-described village human finds Toronto too loud and crowded. In 2007, longing for a connection with his homeland, he took up the mbira, a ceremonial instrument tied to traditions of the Shona culture.\n\nThe late Chiweshe called the mbira a telephone to the spirits of people, water, trees and birds. Deeming it subversive, Rhodesias white authorities and Christian missionaries banned the instrument. The mbira is part of Mutambas educational mission involving food sovereignty, arts and cultural reclamation.\n\nIm intrigued by the power of community, he said. People are searching for it. Were all searching for village.\n\nFormer Toronto landmark Honest Eds can be seen across the street from Mutamba in a still from the documentary.Supplied\n\nMutamba is both a facilitator and a searcher himself. He longs for home, but Toronto is where he earns a living as co-director of Bloom Consulting, specializing in strategic planning, conflict mediation and psychotherapy. Canadas wealthy biggest city is his hunting place, where money is made to be used in Zimbabwe.\n\nThe mbira is more popular in Western Canada than in its eastern counterpart  Vancouver Island is the hotbed. Though the instrument is foreign to Canada, Mutamba believes its effect is universal.\n\nIt provokes certain emotions, he said. It is in the body. Its beyond the otherness. It is a sound that is human.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18051030/rainos-mutamba-mbira-canada.jpg",
            "description": "<p>The Globe and Mail The documentary Mbira Talks, about a Zimbabwean-Canadian musician’s relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Ed’s department store in the background. The lights went</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/\">In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:33",
            "date": "18 Nov 2025"
        },
        {
            "title": "AfriForum seeks G20 countries’ intervention on South Africa’s property rights and farm murders",
            "url": "https://www.newzimbabwe.com/afriforum-seeks-g20-countries-intervention-on-south-africas-property-rights-and-farm-murders/",
            "content": "IOL\n\nLobby group AfriForum has called on G20 countries to usethe upcoming summit in Johannesburgand subsequent diplomatic engagements with South Africa to urge the government to respect property rights and take stronger action to address farm murders.\n\nThe organisation stated that it had written to the embassies of G20 member states, outlining concerns about what it described as the erosion of property rights and the rise in violent attacks on farmers, and had also presented what it called practical solutions to both issues.\n\nAfriForum CEO Kallie Kriel stated that the lack of progress in addressing these matters had already impacted the G20 summit,pointing out that the United States had decided to boycott the gathering due to such concerns.\n\nG20 countries can play a constructive role in stabilising both local and international relations by pledging their support for efforts to protect property rights and combat farm murders, Kriel said.\n\nHe argued that it was in the G20s own interest to ensure that property rights in South Africa were safeguarded, warning that uncertainty in this area could deter foreign investment.\n\nThe disregard for property rights in places like Zimbabwe and Venezuela has caused great suffering for ordinary people, leading to hyperinflation, unemployment and growing poverty, Kriel added.\n\nAfriForum has been a vocal critic of the Expropriation Act, which allows for the taking of property without compensation under certain conditions. Kriel said the organisations campaign against the policy was motivated by what it saw as the potentially catastrophic consequences for all South Africans.\n\nAmong the measures AfriForum is proposing are:\n\nOn property rights, AfriForum has called for amendments to the Expropriation Act, including the scrapping of Section 12(3), which allows for expropriation without compensation.\n\nAfriForum said it is set to launch a report regarding what it termed the violation of minorities human rights in South Africa.\n\nLast week,IOL reported that Argentinas President Javier Milei will not attend the G20 leaders summit in Johannesburg, aligning witha boycott of the key meeting backed by United States President Donald Trump.\n\nAccording to reports in Argentine media, Milei will instead send Foreign Minister Pablo Quirno to represent the country, along with G20 negotiator Federico Pinedo.\n\nThe decision marks a show of solidarity with Trump, who announced that the United States would not participate in the G20 summit in South Africa, citing alleged human-rights abuses against Afrikaner farmers in the country.\n\nArgentinas government has not issued an official statement on the withdrawal, but presidential aides quoted in local outlets said the move was in line with Washingtons position.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18050036/Afriforum.jpg",
            "description": "<p>IOL Lobby group AfriForum has called on G20 countries to use the upcoming summit in Johannesburg and subsequent diplomatic engagements with South Africa to urge the government to respect property rights and take stronger action to address farm murders. The organisation stated that it had written to the embassies of G20 member states, outlining concerns about what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afriforum-seeks-g20-countries-intervention-on-south-africas-property-rights-and-farm-murders/\">AfriForum seeks G20 countries’ intervention on South Africa’s property rights and farm murders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:33",
            "date": "18 Nov 2025"
        }
    ]
}