{
    "news": [
        {
            "title": "African Sun to amass stake in other hospitality assets",
            "url": "https://www.newzimbabwe.com/african-sun-to-amass-stake-in-other-hospitality-assets/",
            "content": "By Alois Vinga\n\nLISTED hospitality group African Sun Limited has announced plans to acquire a significant stake in other hospitality assets as it consolidates efforts around propping up its portfolio.\n\nASL recently placed its three assets, the Beitbridge Express Hotel, Great Zimbabwe Hotel in Masvingo and the Monomotapa Hotel in Harares CBD on sale in pursuit of its strategic plans to strengthen the hospitality portfolio.\n\nThe developments resulted in speculations that the hospitality giant is slowly becoming an insignificant factor in the sector.\n\nBut speaking to NewZimbabwe.com this week, ASL chairman Lloyd Mhishi said the concern has a series of projects lined up to consolidate the groups position.\n\nPlans are afoot to acquire significant interest in other hospitality assets, including a possible new build,which plans will come to the fore once all processes and regulatory requirements are in placeand funds are available from the disposal of the non-strategic properties, he said.\n\nThe ASL chairman, however, declined to divulge finer details.\n\nHe said as part of the lined up new investments, the current period is focused on massive refurbishment and upgrading oftheremainingflagship hotels such as the Elephant Hills Resort to enhance competitiveness and revenue-generating capacity driven by the belief that the strategic move will enable the company to optimize its operations to improve efficiency and reduce costs.\n\nNotably, ASL has already successfully refurbished Hwange Safari Lodge and Troutbeck Resort to a standard of excellence. The companys goal is to match or surpass this standard with its remaining properties, including Elephant Hills Resort and the Holiday Inns.\n\nEncouragingly, guest feedback, particularly from foreign visitors, has been very positive, and this is gradually translating into increased bookings. Plans are afoot to acquire significant interest in other hospitality assets, including a possible new build,which plans will come to the fore once all processes and regulatory requirements are in placeand funds are available from the disposal of the non-strategic properties, added Mhishi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/14043239/troutbeck.jpg",
            "description": "<p>By Alois Vinga LISTED hospitality group African Sun Limited has announced plans to acquire a significant stake in other hospitality assets as it consolidates efforts around propping up its portfolio. ASL recently placed its three assets, the Beitbridge Express Hotel, Great Zimbabwe Hotel in Masvingo and the Monomotapa Hotel in Harare’s CBD on sale in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-to-amass-stake-in-other-hospitality-assets/\">African Sun to amass stake in other hospitality assets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "Polokwane court imposes five-year sentence on Zimbabwean men for smuggling R8 million worth of tobacco",
            "url": "https://www.newzimbabwe.com/polokwane-court-imposes-five-year-sentence-on-zimbabwean-men-for-smuggling-r8-million-worth-of-tobacco/",
            "content": "IOL\n\nTwo Zimbabwean nationals, Samuel Nkomo, 38, and Josephat Mawire, 46, have been sentenced to five years in prison for possession of illicit goods valued at R8 million.\n\nThe sentence was handed down by the Polokwane Specialised Commercial Crimes Court.\n\nNational Prosecution Authority regional spokesperson Mashudu Malabi-Dzhangi said on September 11, 2024, police officers from the Capricorn Flying Squad were executing a stop-and-search operation on the R521 (Dendron Road) when they encountered a white Rigid Man Truck.\n\nOfficers searched the car and recovered 908 boxes of Adalya Premium HookahTobacco, wrapped in plastic, worth R8 million.\n\nThe packaging markings indicated that the consignment originated from Turkey. However, the defendants failed to provide valid importation documents. Further verification revealed that the SAD 500 form and invoice they presented were fraudulent as they did not exist in the SARS system. During the trial, both accused pleaded guilty and were convicted as charged, said Malabi-Dzhangi.\n\nIn aggravating the sentence, Advocate Phumudzo Mudau argued that the accused committed a serious and prevalent offence in the courts jurisdiction.\n\nThey showed no remorse, the high value of theillicit goodsnecessitated a strong deterrent message to potential offenders, there is public demand for harsher sentences in such cases, and the court granted the states request for a custodial sentence and imposed the following penalties: five years of direct imprisonment.\n\nAdvocate Ivy Thenga, Director of Public Prosecutions, praised the sentence, saying it sends a clear message to potential criminals participating inillegal trading.\n\nShe also praised the work of Advocates Phumudzo Mudau and Tebogo Mothapo, as well as the investigating officer, Sergeant Mmametse Sophina Lehodi of the Directorate for Priority Crime Investigations (Hawks).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/14042249/The-sentence-was-handed-down-by-the-Polokwane-Specialised-Commercial-Crimes-Court.webp",
            "description": "<p>IOL Two Zimbabwean nationals, Samuel Nkomo, 38, and Josephat Mawire, 46, have been sentenced to five years in prison for possession of illicit goods valued at R8 million. The sentence was handed down by the Polokwane Specialised Commercial Crimes Court. National Prosecution Authority regional spokesperson Mashudu Malabi-Dzhangi said on September 11, 2024, police officers from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polokwane-court-imposes-five-year-sentence-on-zimbabwean-men-for-smuggling-r8-million-worth-of-tobacco/\">Polokwane court imposes five-year sentence on Zimbabwean men for smuggling R8 million worth of tobacco</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "SRC lifts Director General Eltah Nengomasha’s suspension",
            "url": "https://www.newzimbabwe.com/src-lifts-director-general-eltah-nengomashas-suspension/",
            "content": "By Sport Reporter\n\nThe Sports and Recreation Commission has lifted its suspension on Director General Eltah Nengomasha after she was cleared of allegations of misconduct.\n\nNengomasha was suspended in October last year, with details of her misconduct allegations not disclosed.\n\nFollowing her suspension, a disciplinary hearing was held, which found her not guilty of all allegations.\n\nNengomashas reinstatement was confirmed by the SRC on Thursday.\n\nPlease take note that following the suspension of the Director General of the SRC on the 31st of October 2024, a disciplinary hearing was subsequently held before an Independent Tribunal.\n\nIn its twenty-one page determination of 1 1h March, 2025, the three member Tribunal acquitted and cleared the Director General of any wrongdoing.\n\nEffectively, the suspension against the Director General is lifted, and she will resume normal duties, including the restructuring of the SRCs human resources, with the full confidence and support of the Board,said the SRCin astatement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/10172350/nengomasha.webp",
            "description": "<p>By Sport Reporter The Sports and Recreation Commission has lifted its suspension on Director General Eltah Nengomasha after she was cleared of allegations of misconduct. Nengomasha was suspended in October last year, with details of her misconduct allegations not disclosed. Following her suspension, a disciplinary hearing was held, which found her not guilty of all</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/src-lifts-director-general-eltah-nengomashas-suspension/\">SRC lifts Director General Eltah Nengomasha’s suspension</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "No need to use a hammer to kill a fly – Gutu urges humane handling of vendors’ crisis",
            "url": "https://www.newzimbabwe.com/no-need-to-use-a-hammer-to-kill-a-fly-gutu-urges-humane-handling-of-vendors-crisis/",
            "content": "By Leopold Munhende\n\nNATIONAL Peace and Reconciliation Commission (NPRC) commissioner Obert Gutu has urged restraint in dealing with vendors, following a government order to flush them out of Zimbabwes towns.\n\nDespite being an eyesore across most, if not all, central business districts (CBDs), Gutu said councils and the Zimbabwe Republic Police (ZRP) should realise that desperation and an absence of opportunities were driving people to sell wares illegally on the streets.\n\nGutu posted on X, formerly Twitter, that no normal person would want to survive on vending deep into the night.\n\nQuite honestly, no normal person would prefer to be vending in the dead of the night in downtown Harare if they had a better alternative to earn a decent and honest living, he wrote.\n\nAs we prepare to clamp down on illegal vending, it would be very pragmatic for the responsible authorities not to use draconian and insensitive tactics to address this particular challenge.\n\nSurely, there is no need to use a sledgehammer to kill a fly. We need to exercise empathy and restraint as we move towards eradicating mass poverty in our homeland.\n\nIn a scathing announcement of the impending clampdown, local government minister Daniel Garwe on Wednesday accused vendors of perpetuating unsanitary conditions, worsening public health issues and creating a haven for criminal activities.\n\nGovernment is directing all local authorities to clear vendors from undesignated points within 48 hours, said Garwe.\n\nA high unemployment rate and increasing levels of poverty, exceeding half of the population, have forced Zimbabweans, including graduates, onto the streets.\n\nWith few to no opportunities, the young and old have opted to survive by illegally selling goods in urban areas, including vegetables, second-hand clothes delivered via Mozambique from Europe, cooked food such as chicken feet, cigarettes, and sweets.\n\nAdded Gutu: Most of these vendors are young people, young mothers and fathers as well as young school leavers and college graduates.\n\nThe formal job sector, particularly in the private sector, has been steadily shrinking over the years and as such, the majority of job seekers (mostly people in the prime years of their lives), simply cannot secure jobs in the formal sector.\n\nThe default mode will be for them to resort to the informal sector to sustain their livelihoods. As a result, we find our streets flooded with these young vendors who are trying to erk out a decent living.\n\nPut bluntly, massive vending as we are currently witnessing it, is a direct result of desperation as opposed to people just trying to be unruly and disorderly.\n\nPast efforts to rid the capital Harare and other centres such as Bulawayo of illegal vendors have failed.\n\nCouncils have either given up or totally lost the battle to the over a million illegal vendors across various cities.\n\nThe latest round, first announced by Harare City Council and later government, was expected to have started Wednesday evening.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/13051625/Obert-Gutu.jpg",
            "description": "<p>By Leopold Munhende NATIONAL Peace and Reconciliation Commission (NPRC) commissioner Obert Gutu has urged restraint in dealing with vendors, following a government order to flush them out of Zimbabwe’s towns. Despite being an eyesore across most, if not all, central business districts (CBDs), Gutu said councils and the Zimbabwe Republic Police (ZRP) should realise that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-need-to-use-a-hammer-to-kill-a-fly-gutu-urges-humane-handling-of-vendors-crisis/\">No need to use a hammer to kill a fly – Gutu urges humane handling of vendors’ crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "SADC makes ‘bold decision’ to withdraw troops from DRC as tensions intensify",
            "url": "https://www.newzimbabwe.com/sadc-makes-bold-decision-to-withdraw-troops-from-drc-as-tensions-intensify/",
            "content": "By Thandiwe Garusa\n\nSOUTHERN African Development Community (SADC) has announced the termination of its peacekeeping mission in the Democratic Republic of Congo (DRC) and withdrawal of troops in phases.\n\nThe 16-nation regional bloc held a virtual summit, Thursday to discuss the ongoing conflict in an area that has seen three decadesof unrest.\n\nMilitary chiefs from SADC and the East African Community had previously stated that the mission known as SAMIDRC was in a dilemma and untenable.\n\nSADC member states sent troops to DRC in December 2023 to assist the Congolese army in combating rebel groups.\n\nAlthough its mandate was extended late last year, the mission experienced losses in 2025, and at least 19 soldiers from South Africa, Malawi and Tanzania were killed when the M23 rebels captured Goma.\n\nSADC chairperson President Emmerson Mnangagwa said the regional body will, however, continue supporting DRC through other means.\n\nOn the basis of well-considered factors and reflections on the initial mandate, this Extraordinary SADC Summit has made the bold decision to withdraw our Mission from the eastern DRC.\n\nThe withdrawal of SAMIDRC notwithstanding, our august regional body will remain seized with the political and security situation in eastern DRC, Mnangagwa said.\n\nThis was the third SADC extraordinary summit in the past three months to discuss the DRC crisis.\n\nAccording to Congolese authorities, since the start of the year, over 8,500 people have been killed, with the conflict causing mass displacement and a deepening humanitarian crisis.\n\nThe conflict between the Democratic Republic of the Congo (DRC) government and the March 23 Movement (M23) dates back to the 1990s but has escalated this year.\n\nWhile M23 claims to be advocating for minority rights, the DRC government alleges that the rebels aim to take control of the resource-rich eastern region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/13145831/mnangagwa.jpeg",
            "description": "<p>By Thandiwe Garusa SOUTHERN African Development Community (SADC) has announced the termination of its peacekeeping mission in the Democratic Republic of Congo (DRC) and withdrawal of troops in phases. The 16-nation regional bloc held a virtual summit, Thursday to discuss the ongoing conflict in an area that has seen three decades of unrest. Military chiefs from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-makes-bold-decision-to-withdraw-troops-from-drc-as-tensions-intensify/\">SADC makes ‘bold decision’ to withdraw troops from DRC as tensions intensify</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "Jay-Z accuser admits he had no involvement in alleged sexual assault",
            "url": "https://www.newzimbabwe.com/jay-z-accuser-admits-he-had-no-involvement-in-alleged-sexual-assault/",
            "content": "IOL\n\nA woman who accused Jay-Z of sexuallyassaulting her when she was just 13 has been recorded admittinghe didnt have anything to do with what happened to her.\n\nThe 55-year-old star and Sean Diddy Combs were accused by an unnamed woman of drugging and raping her at an after-party for the 2000 MTV Video Music Awards in New York City when she was a teenager, but the lawsuit was dismissed last month and now ABC News have shared a discussion between the accuser, who is identified only as Jane Doe, and two private investigators.\n\nIn the recording, the investigator asked: He was just there, but he didnt have anything to do with any sexual acts towards you?\n\nThe woman replied: Yeah.\n\nShe then claimed her lawyer, Tony Buzbee, pushed her into taking action against the 99 Problems hitmaker, whose real name is Shawn Carter.\n\nShe could be heard saying: He was the one that kind of pushed me towards going forward with him, with Jay-Z.\n\nThe investigators asked: Buzbee did?\n\nShe confirmed: Yeah.\n\nBut the lawyer insisted the idea he pushed Jane Doe into suing Jay  who has three children with wife Beyonce  is a blatant lie.\n\nHe told ABC News in a statement: As far as the suggestion that I pushed Jane Doe to bring a case against Jay Z That is a blatant lie that is directly contrary to all the documentary evidence.\n\nThe Roc Nation boss own attorney, Alex Spiro, insisted the tape speaks for itself and should leave no one in doubt about Jays innocence.\n\nHe told the network: She says in no uncertain terms Mr. Carter did not do this. Its effectively a lie and the only reason Mr. Carter is even involved in this is because she was pushed to involve him.\n\nIn a sworn declaration, the accuser has insisted she stands by her claims and only dropped her lawsuit due to fear of intimidation and retaliation from Jay-Z and his fans.\n\nShe denied telling the investigators Buzbee had sought her out as a client or encouraged her to pursue a false claim but argued she felt intimidated and terrified at being confronted on her doorstep.\n\nBut Spiro insisted the investigators didnt coerce or threaten the woman.\n\nHe said: She voluntarily met and spoke to them and she told them her truth, which was under no circumstances did Mr. Carter do this, and number two the only reason hes even involved in this is she was pushed to introduce him by a lawyer.\n\nMr. Carter doesnt know Jane Doe, never met Jane Doe. Theres no truth to any of this.\n\nJay is suing both his accuser and her lawyer for defamation, which they have denied, and is ready to move forward with his life.\n\nHis lawyer said: Its tough to hear a false lie said about you, spread through the internet, and affecting your children.\n\nIts tough on him. Its tough on anybody. But what he does is he proves himself innocent. Today is hopefully the final chapter in that. And then theyre gonna move forward. Thats what Jay does.\n\nThe truth had to fully come out. This person cannot be allowed to sort of hide from the reality that this was a false accusation.\n\nIn Jays lawsuit, he claimed the allegations of rape against him were knowingly false and malicious and accused the woman and his lawyers of having launched to extort him through a menacing private demand letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/13050954/Jay-Z.webp",
            "description": "<p>IOL A woman who accused Jay-Z of sexually assaulting her when she was just 13 has been recorded admitting he “didn’t have anything to do” with what happened to her. The 55-year-old star and Sean ‘Diddy’ Combs were accused by an unnamed woman of drugging and raping her at an after-party for the 2000 MTV Video Music</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jay-z-accuser-admits-he-had-no-involvement-in-alleged-sexual-assault/\">Jay-Z accuser admits he had no involvement in alleged sexual assault</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "Tragedy as body found in river during search for missing Zim man",
            "url": "https://www.newzimbabwe.com/tragedy-as-body-found-in-river-during-search-for-missing-zim-man/",
            "content": "NorthWalesLive\n\nA body has been discovered in a river during the search for a missing man.North Wales Policeconfirmed that officers found a body in the River Dee atLlangollenduring the search for Clifford Sibanda.\n\nSibanda, 47, was reported missing on Saturday. A police spokesperson said: Whilst formal identification is yet to take place, his family are being supported by specialist officers and the local coroner has been informed.\n\nIn their initial appeal after Sibanda, from Birkenhead, was reported missing, police said it was believed he had travelled to Llangollen on Saturday, March 8, via a bus from Chester Train Station. They said he had possibly been next to the river, close to the Chainbridge Hotel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/13043752/nsibande.webp",
            "description": "<p>NorthWalesLive A body has been discovered in a river during the search for a missing man. North Wales Police confirmed that officers found a body in the River Dee at Llangollen during the search for Clifford Sibanda. Sibanda, 47, was reported missing on Saturday. A police spokesperson said: “Whilst formal identification is yet to take place, his family</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tragedy-as-body-found-in-river-during-search-for-missing-zim-man/\">Tragedy as body found in river during search for missing Zim man</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "We had already planned to take over – says govt on health sector following Trump’s ‘unexpected’ orders",
            "url": "https://www.newzimbabwe.com/we-had-already-planned-to-take-over-says-govt-on-health-sector-following-trumps-unexpected-orders/",
            "content": "By Leopold Munhende\n\nSTRUGGLING to provide basics at public hospitals, government has sensationally claimed it had already decided to takeover the health sector before American President Donald Trumps unexpected executive order.\n\nTrump, on January 20, ordered a 90-day freeze on all funding and a programme-by-programme review of all activities financed through USAID, Americas largest humanitarian organisation.\n\nWith it playing a central role in public health services provision in Zimbabwe and the rest of Africa, fears abound that gains realised in the fight against HIV/AIDS, TB and malaria would be reversed.\n\nWe had already planned to take over all health workers to be employed by the ministry because we were facing challenges of accountability, we did not even know the reporting structure of those employed by NGOs, said health minister Douglas Mombeshora.\n\nAlthough the suspension on funding health-related programmes was later reversed, medicines are yet to be delivered with current stocks lasting up to June, three months from now.\n\nSpeaking to journalists in Harare on Monday, Mombeshora said government had already planned for this and procured medicines that would cover the period after June to September.\n\nIn a heavily contradictory statement, Mombeshora said the challenge government was facing was that its procurement had been stopped before saying that it will be coming in phases and later, that they had called for tenders to also procure the same medicines as government waits for Trumps review of USAID.\n\nAdded Mombeshora: The challenges that I can say still remain,relate to procurement, we had medicines for HIV/AIDS, TB and Malaria which we had procured by they will be coming in phases.\n\nWe have enough stocks up to the end of June, but the stocks that were coming to cover the period after June have been stopped, and we cannot wait to see what happens after the 90 days which they said they were using to review.\n\nWe have actually floated a tender to do procurement of medicines that will cover from June to the end of September while we see how other resources can be covered.\n\nUSAID not only financed the procurement of medicines meant for treatment of HIV/AIDS, TB and malaria, it also ensured the provision of condoms and payment of nurses and doctors manning opportunistic clinics across the country.\n\nThose who are on HIV treatment will not have any disruption, no one should be scared, no one should be seen hoarding, he added.\n\nOver 19,000 village health workers, more than a thousand nurses and doctors were on USAIDs payroll according to Mombeshora.\n\nThe Zimbabwean and African health services situation, battered by little to no investment since the attainment of independence, has been worsened by a further flight of other humanitarian organisations in the wake of Trumps decision.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/08044936/mombeshora.webp",
            "description": "<p>By Leopold Munhende STRUGGLING to provide basics at public hospitals, government has sensationally claimed it had already decided to ‘takeover’ the health sector before American President Donald Trump’s unexpected executive order. Trump, on January 20, ordered a 90-day freeze on all funding and a programme-by-programme review of all activities financed through USAID, America’s largest humanitarian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-had-already-planned-to-take-over-says-govt-on-health-sector-following-trumps-unexpected-orders/\">We had already planned to take over – says govt on health sector following Trump’s ‘unexpected’ orders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "‘Only 3,000 out of 16,000 kombis operating in Harare are registered’— say police amid clampdown on errant operators",
            "url": "https://www.newzimbabwe.com/only-3000-out-of-16000-kombis-operating-in-harare-are-registered-say-police-amid-clampdown-on-errant-operators/",
            "content": "By James Muonwa\n\nPOLICE have launched a major clampdown on unregistered commuter omnibuses amid a shocking revelation that less than 20 percent of them are compliant with the law.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi said the blitz on illegal public transporters is aimed at forcing operators to comply with the law and make clean money.\n\nIts sad, for Harare alone we have close to 16,000 kombis but only 2,500 or lets say 3,000 are registered, Nyathi said during a press conference in Harare this Wednesday.\n\nThe rest are playing hide-and-seek with the law. Yet the government has put in place regulatory mechanisms to assist people to get into business, but they dont want to. They want to take money and put it into the pocketno safety for Zimbabweans and no compliance.\n\nRoads need to be maintained, police officers need to be paid by the government, where is the money coming from? The next thing is, you say the government is not providing a service; what contribution have you made?\n\nSo, first and foremost, all kombis must be registered, and kombi operators must lead by example in their operations by being responsible Zimbabweans, said the ZRP spokesman.\n\nOn enforcement of the law, Nyathi said all police officers are under instructions to carry out their duties professionally in accordance with police standards.\n\nZRP will take action against any police officer who will try to endanger the lives of Zimbabweans, Nyathi added.\n\nIn some instances, police officers have been blamed for road traffic accidents as they smash windscreens and chase after fleeing commuter omnibuses.\n\nMotorists were urged to comply with police officers and avoid running away. Also, Nyathi warned members of the public who try to interfere with police officers on duty.\n\nWhen you are arrested, you are not being killed. Youre simply being taken in to ensure the law takes its course. Why do you want to run away? Comply with the law; if you have to go to court, go to court and if you have to pay a fine, pay the fine, and go back to your business, Nyathi cautioned.\n\nThe ZRP Commissioner Paul Nyathi has urged the public not to board unregistered kombis as they are not insured.pic.twitter.com/sIKV4cHbKq\n\n NewZimbabwe.com (@NewZimbabweCom)March 12, 2025\n\nThe clampdown on unregistered kombis will be implemented without fear or favour, he added.\n\nThere is no going back in enforcing the governments law, and we are unapologetic about that, he said.\n\nOn corruption, Nyathi said bribe-taking police officers will be arrested alongside the motorists paying them off.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10145359/Kombi.jpg",
            "description": "<p>By James Muonwa POLICE have launched a major clampdown on unregistered commuter omnibuses amid a shocking revelation that less than 20 percent of them are compliant with the law. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi said the blitz on illegal public transporters is aimed at forcing operators to comply with the law</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/only-3000-out-of-16000-kombis-operating-in-harare-are-registered-say-police-amid-clampdown-on-errant-operators/\">‘Only 3,000 out of 16,000 kombis operating in Harare are registered’— say police amid clampdown on errant operators </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        },
        {
            "title": "Only the interbank market sets the official rate – RBZ",
            "url": "https://www.newzimbabwe.com/only-the-interbank-market-sets-the-official-rate-rbz/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has said only the interbank market has the authority to determine the official rate, clearing the confusion around the interpretation of market-determined exchange rates.\n\nThis follows confusion triggered by some Business Member Organizations in the tourism sector which recently interpreted the Monetary Policy Statements mention of market-determined exchange rates as implying that markets are now free to set their own exchange rates, prompting traders to violate the stipulated exchange rates.\n\nBut in a statement, the RBZ governor, Dr John Mushayavanhu implored stakeholders and the public to take note of the fact that the country is operating under a floating Exchange Rate system where the exchange rate is determined in the interbank market for foreign exchange under the Willing Buyer Willing Seller arrangement.\n\nHe said this rate is purely determined through the authorized dealers (Banks) based on trades that would have been transacted through them.\n\nFor clarity, market determined rate simply means a rate determined on the interbank foreign exchange market by banks is the one that should be used to guide the pricing of all other goods and services in the economy. Therefore, no other business entity outside the interbank market should determine the exchange rate.\n\nThe February 2025 Monetary Policy Statement again provided clarity that the 5% trading margin communicated in previous Interbank Foreign Exchange Trading Guidelines was only applicable for the determination of the starting exchange rate at the introduction of ZWG, he said.\n\nMushayavanhu added that banks are free to on-sell foreign currency purchased from willing sellers (including the RBZ) at a margin consistent with international best practices.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171550/mushayavanhu-200-zig.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has said only the interbank market has the authority to determine the official rate, clearing the confusion around the interpretation of market-determined exchange rates. This follows confusion triggered by some Business Member Organizations in the tourism sector which recently interpreted the Monetary Policy Statement’s mention of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/only-the-interbank-market-sets-the-official-rate-rbz/\">Only the interbank market sets the official rate – RBZ</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "14 Mar 2025"
        }
    ]
}