{
    "news": [
        {
            "title": "Cassper Nyovest embarks on weight loss journey after social media criticism",
            "url": "https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/",
            "content": "TshisaLive\n\nCassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29.\n\nAfter facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey.\n\nI was doing cardio all week. This time its a bit more fun because Im playing tennis. Next week Ill start weight training. The comments at the weekend were harsh. It hurt my feelings a bit but sometimes thats what you need, a little push, he said.\n\nIt is a projection, about how you feel about yourself. Body shaming and all of that. You dont know what Im going through. Im going to turn the lemons into lemonade.\n\nThis is not the first time Cassper has undergone a weight loss journey before his Fill Up concerts.\n\nIn 2022 Cassper did it before his Fill Up Mmabatho concert in Mahikeng.\n\nI cant explain how proud I am of myself. This was by far the hardest weight loss journey for me because I have done this three times and I now knew what it would take for me to get back in shape. To be honest, mentally I didnt feel like I was as strong as I once was and I was demoralised.\n\nIts supposed to get easier by the day but it got harder and harder. I just kept waking up and going. Lost touch with a lot of relationships and people because I zoned into this goal and I had no time for anyone but myself.\n\nLooking at these pictures now Im in awe of myself. I owe it to myself never to let myself go like that again. Big shout out to my training and nutrition team. Shout out to Fight Club for always having their doors open for me at any time I wanted to train. We four weeks out Boys! Lets put on a show! Im back!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09051311/nyovest.jpg",
            "description": "<p>TshisaLive Cassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29. After facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey. “I was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/\">Cassper Nyovest embarks on weight loss journey after social media criticism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        },
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        },
        {
            "title": "Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups",
            "url": "https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/",
            "content": "By Staff Reporter\n\nHIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwas son.\n\nHarare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto Road in Highlands. The potential buyer of the land, believed to be Collins Mnangagwa, is constructing a multi-storey building in the area and intends to close part of the public road.\n\nThe residents have been given a month to lodge objections and reasons with the City Council regarding the land.\n\nThe Highlands Residents Association has, via a petition, objected to the sale of the portion of the road by the City Council.\n\nWe, the undersigned residents and community members of Highlands and surrounding areas, hereby submit our formal objection to the proposed permanent road closure of a portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue hereinafter referred to as Otto Road as per the public notice), Highlands, Harare, as advertised in the Public Notice placed in The Herald on Tuesday 2 September 2025, read the petition.\n\nThe residents lashed out at the City Council for the lack of transparency in the process, arguing that the sale of the land deprives the public of the benefits it carries.\n\nOtto Road is public land. Its permanent closure and subsequent sale would deprive current and future residents of their right to access and benefit from public infrastructure.\n\nOtto Road provides a safe and established route for domestic workers, security guards, gardeners, pedestrians, cyclists, schoolchildren, walkers and joggers. Closing it will force vulnerable users onto busier, more dangerous routes.\n\nMany people who rely on Otto Road do not own cars. Closure would disproportionately harm women, children, and low-income workers who depend on safe non-motorised routes.\n\nThe proposed closure appears to serve private interests at the expense of the broader community. Council has a duty to uphold transparency and protect public assets for collective benefit, read the petition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Staff Reporter HIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwa’s son. Harare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/\">Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        },
        {
            "title": "Motorist loses US$10,000 and pistol to attendant at Harare car wash",
            "url": "https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/",
            "content": "By Staff Reporter\n\nA HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle.\n\nThe offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his clients car at a Mabelreign washing bay in March.\n\nChimukuyu was slapped with 13 months imprisonment, of which five months were conditionally suspended. He will, therefore, serve an effective eight months behind bars.\n\nCourt heard that on March 21, 2025, the complainant left the money and firearm inside his Mercedes-Benz before handing it over to the offender for cleaning.\n\nInstead of performing his duties, Chimukuyu fled with the bag containing the valuables.\n\nIt was further heard that following a tip-off, police detectives arrested the offender at Pamuzinda Lodge, Claudia in Harare and recovered US$1,850 in his trousers pocket. The stolen pistol and bag were later recovered during a follow-up search.\n\nOf the stolen cash, only US$3,450 was recovered.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) urged motorists to avoid leaving large sums of money and firearms unattended in vehicles, even when dealing with trusted service providers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09045858/Car-wash_.png",
            "description": "<p>By Staff Reporter A HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle. The offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his client’s car at a Mabelreign washing bay in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/\">Motorist loses US$10,000 and pistol to attendant at Harare car wash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        },
        {
            "title": "Chief Mugabe’s appointment upheld as challenger drags President Mnangagwa, Minister to court over succession feud",
            "url": "https://www.newzimbabwe.com/chief-mugabes-appointment-upheld-as-challenger-drags-president-mnangagwa-minister-to-court-over-succession-feud/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe has dismissed a bid by Emmanuel Dumbu to overturn the appointment of Matubede Mudavanhu as Chief Mugabe, ruling that the succession dispute had reached a stalemate that justified presidential intervention.\n\nDumbu had cited President Emmerson Mnangagwa, Local Government minister and Mudavanhu as respondents.\n\nDumbu had argued that his rivals appointment was irregular, illegitimate and unconstitutional, claiming he was the rightful heir under the Mugabe clans collateral system of rotation. He maintained that a 2022 meeting of the five royal houses had nominated him as the successor.\n\nBut Justice Herbert Zisengwe, sitting at the Masvingo High Court, said the appointment of Mudavanhu was valid, stressing that the traditional process had failed to produce consensus. There was a stalemate and this effectively left the Minister with no option but to invoke the proviso to section 3(2) of the Traditional Leaders Act, the judge ruled.\n\nThe court noted that Mudavanhu had already served as acting chief since 2009, adding: His appointment cannot be said to be inimical to the customs, traditions and culture of the community in question.\n\nOn the disputed 2022 Chikarudzo meeting, which Dumbu relied on, the judge was blunt: It would be an exercise in futility to repeat the same process and expect a different result.\n\nJustice Zisengwe also warned that Zimbabwes laws must provide a mechanism to end deadlocks in future disputes: Such a provision is a necessary tie breaker; a necessary tool to break any possible impasse.\n\nThe court dismissed Dumbus application with costs, cementing Mudavanhus position as substantive Chief Mugabe after nearly 14 years in an acting role.\n\nArguing his case,Dumbu said he is the legitimate heir to the throne.\n\nHe alleged that the appointment of Mudavanhu flouted what he termed the Mugabe chieftainships collateral system of rotation among the five houses, each with a right to the throne at any given time.\n\nThese houses are the Dumbu, Chipfunhu, Haruzivishe, Chikamhi (Muzondo) and Mudavanhu houses.\n\nAccording to him, the houses take turns in succeeding to the throne in order of seniority.\n\nThe term house is customary parlance for family. In short, the eldest child (usually the eldest son) of the founder of the clan is considered the most senior and basically establishes the most senior house.\n\nEach of his brothers established the second house and subsequent houses in order of seniority.\n\nWhat the collateral system of rotation envisages, therefore, is that the eldest member of the first family succeeds his father.\n\nUpon his death, his most senior brother takes over, followed by the third and so on.\n\nThis cycle is repeated with each successive generation.\n\nDumbu said Musavanhu was irregularly appointed after he had served about 13 years as an acting chief following the demise of one Mute Mudavanhu of the Mudavanhu house.\n\nHe further asserts that the incessant complaints raised by the affected people over the prolonged tenure of the third respondent as acting chief initially went unheeded but eventually the Provincial Assembly of Chiefs seconded three chiefs from the province (namely Chief Nhema, Chitanga and Serima) to resolve the matter.\n\nThis culminated in a meeting held on 31 October 2022 at a creche at Chikarudzo Business Centre, dubbed the Chikarudzo meeting. This meeting was convened to deliberate over the appointment of substantive Chief Mugabe.\n\nMost importantly, the applicant avers that at that meeting all five houses were represented and it was agreed that the Dumbu house, to which he belongs, was to succeed the Mudavanhu house. When the Dumbu house was requested to name the person to take up the throne, he was identified as the one to do so.\n\nAccording to him, therefore, he was duly nominated as the heir to the throne.\n\nTo his dismay, however, he learnt on 13 February 2023 that Mudavanhu had been appointed Chief Mugabe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/08201152/masvingo-high-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court of Zimbabwe has dismissed a bid by Emmanuel Dumbu to overturn the appointment of Matubede Mudavanhu as Chief Mugabe, ruling that the succession dispute had reached a stalemate that justified presidential intervention. Dumbu had cited President Emmerson Mnangagwa, Local Government minister and Mudavanhu as respondents. Dumbu had argued that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chief-mugabes-appointment-upheld-as-challenger-drags-president-mnangagwa-minister-to-court-over-succession-feud/\">Chief Mugabe’s appointment upheld as challenger drags President Mnangagwa, Minister to court over succession feud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        },
        {
            "title": "Teen jailed for attempted murder after stabbing passerby who refused to share cigarette",
            "url": "https://www.newzimbabwe.com/teen-jailed-for-attempted-murder-after-stabbing-passerby-who-refused-to-share-cigarette/",
            "content": "By Staff Reporter\n\nA GWERU magistrate has sentenced a 19-year-old man for stabbing a passerby who refused to share a cigarette.\n\nNation Muyashu, who was facing an attempted murder charge, was arraigned before the Gweru Magistrates Court in Midlands province this Monday for sentencing.\n\nMuyashu was sentenced to nine years imprisonment, with three years suspended for five years on condition of good behaviour. He will, therefore, serve an effective six-year jail term.\n\nThe States case was that on July 16, 2025, the offender was walking alongside his unnamed girlfriend in the Mahamara area of Lalapanzi. It is said he encountered victim, Simon Ngazimbi, and asked him for a cigarette, but he refused.\n\nCourt heard that as Ngazimbi walked away, an argument ensued and in a fit of rage, the teenager drew out a knife and stabbed the victim once in the abdomen, causing his intestines to protrude from the wound. The victim fell to the ground and lost consciousness.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) encouraged members of the public to desist from physical abuse and senseless assaults.\n\nIts a sobering fact that a significant number of murder cases originate from seemingly meaningless altercations. We advise individuals to seek third-party mediation as a constructive alternative to violence, the NPAZ said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09050538/cigarette-.jpg",
            "description": "<p>By Staff Reporter A GWERU magistrate has sentenced a 19-year-old man for stabbing a passerby who refused to share a cigarette. Nation Muyashu, who was facing an attempted murder charge, was arraigned before the Gweru Magistrates Court in Midlands province this Monday for sentencing. Muyashu was sentenced to nine years imprisonment, with three years suspended</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-jailed-for-attempted-murder-after-stabbing-passerby-who-refused-to-share-cigarette/\">Teen jailed for attempted murder after stabbing passerby who refused to share cigarette</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        },
        {
            "title": "Sending your people to deal with me only confirms your father runs a terrorist organisation – dazed Holy Ten tells Mnangagwa’s son",
            "url": "https://www.newzimbabwe.com/sending-your-people-to-deal-with-me-only-confirms-your-father-runs-a-terrorist-organisation-dazed-holy-ten-tells-mnangagwas-son/",
            "content": "By Leopold Munhende\n\nHOLY Ten, an eccentric character on Zimbabwes Hip Hop scene by any margin, has told President Emmerson Mnangagwas son Collins not to entertain thoughts of sending people after him, as that will only confirm that his father runs a terrorist organisation, Zanu PF.\n\nHoly Ten, born Mukudzei Chitsama, broke the internet over the weekend when he went on an online rant, laying into Collins and his twin brother Sean for sending Central Intelligence Organisation (CIO) and army officers to his home.\n\nIn other posts, shared on Facebook and Instagram, he sent coded messages that they had been showering him with expensive gifts such as a house and cars, which he said they could now take back.\n\nHe went as far as declaring that he was bigger than the ruling Zanu PF party and could take the whole institution down, in what many have interpreted as a message passed in drunken stupor.\n\nHis last post on X, formerly Twitter, took aim at Collins, whose brother Sean is also an Army Major.\n\nDear Collins Mnangagwa, you cant touch me and the moment you try, youre really proving to all of us that you and your father run a terrorist organisation. Leave me alone, said Holy Ten.\n\nOnce the fastest rising talent in Zimbabwes music industry, Holy Tens career took a nasty nose dive after he laid into popular Zim Dance Hall chanter Winky D.\n\nHis tirade against Winky D, which came after the release of a red hot collaboration,Ibotso, was blamed on unidentified drugs and alcohol, a challenge he has accepted to have been dealing with for over two years. Ibotso, which he disputed, highlighted how the high and mighty were taking all that was supposed to benefit the downtrodden.\n\nHis tweet, however, comes a day after he apologised for his online tirade, captured live on Instagram.\n\nI joined Zanu PF because I was trying to clean the reputation, the image of Zanu PF. What you did, boys, I can finish all of you off. I can end the Zanu PF today. Im bigger than the Zanu PF, he said\n\nHoly Ten has in the past posted images of himself clad in army regalia, brandishing the Zanu PF clenched fist and openly campaigned for Mnangagwa.\n\nAccording to sources closer to his circle of friends, he was gifted, by the Mnangagwa twins, a fully furnished house and numerous cars, one of which he presented to his wife, Kimberly Richards, before repossessing it to pay a debt.\n\nUnconfirmed reports from Zimbabwean socialites indicate that Richards could have been in an extramarital affair with one of Mnangagwas sons, something that could be leading to his constant meltdowns.\n\nRichards, the Mnangagwa twins, Zanu PF, government and Mnangagwa himself are yet to comment on the matter that has raised questions on abuse of CIO and military personnel for personal benefits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/08202033/holy-ten-.jpg",
            "description": "<p>By Leopold Munhende HOLY Ten, an eccentric character on Zimbabwe’s Hip Hop scene by any margin, has told President Emmerson Mnangagwa’s son Collins not to entertain thoughts of sending “people” after him, as that will only confirm that his father runs a terrorist organisation, Zanu PF. Holy Ten, born Mukudzei Chitsama, broke the internet over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sending-your-people-to-deal-with-me-only-confirms-your-father-runs-a-terrorist-organisation-dazed-holy-ten-tells-mnangagwas-son/\">Sending your people to deal with me only confirms your father runs a terrorist organisation – dazed Holy Ten tells Mnangagwa’s son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:45",
            "date": "09 Sep 2025"
        }
    ]
}