{
    "news": [
        {
            "title": "Mighty Warriors eye return leg victory against Angola",
            "url": "https://www.newzimbabwe.com/mighty-warriors-eye-return-leg-victory-against-angola/",
            "content": "By Sport Reporter\n\nZimbabwe senior womens football team is hoping for a positive outcome on Wednesday when they host Angola at Lucas Moripe stadium in South Africa in a Womens Africa Cup Of Nations (WAFCON) qualifier second-leg match.\n\nHaving suffered a 2-1 defeat in Luanda last week, Zimbabwe will be hoping to overcome their counterparts with a wider margin to keep their hopes of playing next years WAFCON alive.\n\nThe winner between Zimbabwe and Angola will play Malawi in the final qualifying round.\n\nMighty Warriors coach Sithethelelwe Sibanda says she is expecting a positive outcome.\n\nI am hopeful that with what we have done, we are going to be much better than what we were in the first leg.\n\nAlso I am just hoping that everyone shows the positivity we saw at training, she said.\n\nZimbabwe last beat Angola in 2019 during the Womens COSAFA Cup tournament, when they picked a 4-1 win.\n\nThe Mighty Warriors are expected to have a huge fan backing as two buses ferried supporters from Zimbabwe to South Africa.\n\nMighty Warriors captain Emmaculate Msipa added, We prepared very well for the second leg, and the coaches have done their part meaning it is now up to us.\n\nWe are going to play to the best of our abilities and try to utilise every chance, so we will see how it will go on the pitch.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/19060302/Sithethelewe-Kwinji-15-Sibanda-Pic-ZIFA.jpg",
            "description": "<p>By Sport Reporter Zimbabwe senior women’s football team is hoping for a positive outcome on Wednesday when they host Angola at Lucas Moripe stadium in South Africa in a Women’s Africa Cup Of Nations (WAFCON) qualifier second-leg match. Having suffered a 2-1 defeat in Luanda last week, Zimbabwe will be hoping to overcome their counterparts</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-eye-return-leg-victory-against-angola/\">Mighty Warriors eye return leg victory against Angola</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "How Mablanyo transformed Wolves star Munetsi into a midfielder",
            "url": "https://www.newzimbabwe.com/how-mablanyo-transformed-wolves-star-munetsi-into-a-midfielder/",
            "content": "By Sport Reporter\n\nYears back, Dynamos coach Lloyd Mablanyo Chigowehad a chance to coach Marshall Munetsi in the mens Under 17 national team.\n\nI gotto know Munetsi when Iwas coach for Zimbabwe under 17, we got him from Ali Sundowns in Mabvuku.\n\nBy then he was just a defender, playing as a centre back, Mablanyo recalled in an interview.\n\nLloyd Mablanyo Chigowe\n\nHaving been impressed by Munetsi in national team colours, Mablanyo then signed him at Blue Rangers, a division one side he was leading back then.\n\nWhen I formed Blue Rangers as head coach, I then signed him (Munetsi).\n\nI saw a lot of potential inthe boy when he was in the national team because he had a big frame.\n\nBy then he was 17 and I took him to a Division One, played him week in, week out.\n\nBecause he was still fragile, I had to push him into the midfield, a role he occupies today, that is box-to-box play.\n\nSo when the Blue Rangers project folded, Irecommended him to Friendly Academy, Mablanyo added.\n\nAs fate would have it, Munetsi was part of the Friendly Academy team that went for a tour to South Africa where he was spotted by FC Cape Town, a lower division club that eventually signed him in 2015.\n\nDestined for greatness, Munetsi in 2016 was signed by South African giants Orlando Pirates.\n\nAt the Buccaneers, the 28-year-old utility player spent three seasons before he was eventually sold to French Ligue 1 side Stade Reims in 2019.\n\nAt Reims the Warriors vice captain spentfour seasons, making more than 300 appearances before he was snatched in January by English Premier Soccer League side Wolverhampton Wanderers in a S$ 20 million deal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>By Sport Reporter Years back, Dynamos coach Lloyd “Mablanyo” Chigowe had a chance to coach Marshall Munetsi in the men’s Under 17 national team. “I got to know Munetsi when I was coach for Zimbabwe under 17, we got him from Ali Sundowns in Mabvuku. “By then he was just a defender, playing as a centre back,” Mablanyo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-mablanyo-transformed-wolves-star-munetsi-into-a-midfielder/\">How Mablanyo transformed Wolves star Munetsi into a midfielder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "African countries urged to mobilise alternative funding for HIV, TB and malaria prevention amid financing crisis",
            "url": "https://www.newzimbabwe.com/african-countries-urged-to-mobilise-alternative-funding-for-hiv-tb-and-malaria-prevention-amid-financing-crisis/",
            "content": "By Staff Reporter\n\nSOUTHERN African Development Community (SADC) health ministers have called upon governments to mobilize alternative funding sources to sustain critical health programs, including HIV, tuberculosis (TB), and malaria prevention, treatment and control.\n\nSADC held a two-day virtual extraordinary meeting of health ministers last week to address critical health challenges facing the SADC region.\n\nAddressing a post-cabinet media briefing Tuesday, information minister Jenfan Muswere said SADC health ministers endorsed key health initiatives to address the challenges.\n\nIn addition, member states were urged to mobilise alternative fundingthrough public-private partnerships and domestic resource mobilisationfor critical health programmes, including HIV, TB and malariaprevention, treatment and control.\n\nThe Meeting also endorsed the SADC TB Strategic Plan, expansion of the E8 Malaria Elimination Initiative to all 16, SADC Member States under the auspices of SADC, a project to accelerate the implementation and investment into the SADC Sexual and Reproductive Health and Rights (SRHR) strategy, the feasibility study on the establishment of a Southern Africa Health Organisation and the establishment of the SADC Pooled Procurement Services (SPPS) as an Autonomous Special Purpose Vehicle under the principle of subsidiarity, Muswere said.\n\nThis comes at a time when the region is facing funding shortages following an executive order freezing almost all United States foreign aid in line with President Donald Trumps America First.\n\nOver 50 African countries have been benefiting from the U.S Presidents Emergency Plan for AIDS Relief which provided critical HIV/AIDS treatment and prevention.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12194913/truck-stop-clinic.webp",
            "description": "<p>By Staff Reporter SOUTHERN African Development Community (SADC) health ministers have called upon governments to mobilize alternative funding sources to sustain critical health programs, including HIV, tuberculosis (TB), and malaria prevention, treatment and control. SADC  held a two-day virtual extraordinary meeting of health ministers last week to address critical health challenges facing the SADC region.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-countries-urged-to-mobilise-alternative-funding-for-hiv-tb-and-malaria-prevention-amid-financing-crisis/\">African countries urged to mobilise alternative funding for HIV, TB and malaria prevention amid financing crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Master H’s EP: A story of ghetto tears and existential strife",
            "url": "https://www.newzimbabwe.com/master-hs-ep-a-story-of-ghetto-tears-and-existential-strife/",
            "content": "By Darlington Gatsi\n\nZimdancehall sensation Hillary Marufu, popularly known as Master H, has picked up where he left off last year with the release of an Extended Play (EP).\n\nMaster H continues to solidify his status as one of the most sought-after Zimdancehall artists, even as the genre shows signs of waning in popularity compared to emerging genres such as Hip Hop.\n\nThe EP features four tracks: Bhoo Zvokuti, Ghetto Tears, Bum Bum Figa in which he ropedin Anika, and Dancehall Time featuring JamaicanmusicianCapleton.\n\nBhoo Zvokuti, which features Nutty O and Freeman, along with Ghetto Tears, continues Master Hs exploration of hardship.\n\nHardship has been a recurring theme in some of Master Hs more mature compositions, standing in contrast to his usual party-centric tracks.\n\nBho Zvokuti serves as a continuation of Master Hs 2023 release, Zvirimo Mumoyo. The song delves into his personal battles and the demons of poverty.\n\nThe new release, a blend of three great musical voices, celebrates the hardships of ZvirimoMumoyothose whose dreams are manifesting, albeit at a slow pace.\n\nThe songs visuals depict a young man in the high-density suburbs who, despite the hardships, is driven by ambition.\n\nThe protagonist is a reflection of Master H himself, who endured hurdles such as drug abuse and a lack of opportunity before making his breakthrough in the music scene.\n\nThe song resonates with the majority of young people who navigate a life born out of hardship and struggle. The ghetto setting paves the way for Ghetto Tears.\n\nGhetto Tears portrays hardship once again, with strife at the core of its message. It offers a raw and introspective perspective on the lives of young people.\n\nMaster H, himself a product of the ghetto, has taken it upon himself to be the voice of striving young people. He interrogatespoverty that is rife in the ghetto which has seen many failing to acquire basics.\n\nThe intertwining themes of the three songs, each carrying a deeper meaning, are a testament to Master Hs lyrical prowess.\n\nAnchored in hardship, the three tracks carry a message of hope despite the struggles.\n\nOverall, the EP showcases Master Hs versatility as an artist, blending his signature party anthems with deeper, more reflective narratives.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27024548/IMG-20250126-WA0020.jpg",
            "description": "<p>By Darlington Gatsi Zimdancehall sensation Hillary Marufu, popularly known as Master H, has picked up where he left off last year with the release of an Extended Play (EP). Master H continues to solidify his status as one of the most sought-after Zimdancehall artists, even as the genre shows signs of waning in popularity compared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/master-hs-ep-a-story-of-ghetto-tears-and-existential-strife/\">Master H’s EP: A story of ghetto tears and existential strife</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "ZimTrade implores local companies to tap into the US$144,3 billion agrochemicals global industry",
            "url": "https://www.newzimbabwe.com/zimtrade-implores-local-companies-to-tap-into-the-us1443-billion-agrochemicals-global-industry/",
            "content": "By Alois Vinga\n\nTRADE Promotion agency, ZimTrade has implored local players to pursue strategic partnershipsandtap into the US$144billion agrochemicals global industry potential.\n\nAccording to the agency, the SADC market alone imported US$4,4 billion worth of agrochemicals in 2023, up from US$2,7 billion in 2019.\n\nCOMESA imports showed similar growth, climbing to US$4,9 billion in 2023 from US$3,1 billion in 2019.Africas agrochemical market is highly competitive, with imports dominated by countries such as China, Morocco, and Russia.\n\nZimtrade data shows that China alone accounted for US$2.2 billion in exports to African countries in 2023, followed by Morocco at US$1,1 billion and Russia at US$816 million with regional players like South Africa and Egypt, exporting US$685 million and US$563 million, respectively.\n\nThis competitive environment underscores the need for Zimbabwean companies to carve out a niche, potentially focusing on innovative, eco-friendly agrochemicals or leveraging proximity to regional markets to reduce logistical costs.\n\nAnalysis of bilateral trade data between African countries reveals that specific product categories present significant opportunities for Zimbabwean exporters, said ZimTrade.\n\nThe agency said mineral or chemical fertilizers containing nitrogen, phosphorus, and potassium (NPK) dominate regional demand, with imports in African markets reaching US$1,4 billion in 2022. Similarly, products like insecticides, herbicides, and fungicides  essential for improving crop yields, saw imports of US$296 million within African markets in 2023.\n\nThe global and regional agricultural sectors are expanding, and the demand for agrochemicals continues to rise, presenting Zimbabwe with a unique opportunity to tap into these markets and drive export-led growth.\n\nCloser to home, ZimTrade said the demand for fertilizers and crop protection products is growing across Southern Africa due to the regions reliance on agriculture as a key economic activity with the potential for export growth being high particularly in countries such as Zambia, Malawi, and Mozambique, which are all experiencing an increase in agricultural activity.\n\nAs demand for fertilizers and crop protection products increases in these countries, Zimbabwean companies are well-positioned to capitalize on this growth by offering cost-effective solutions that cater to the specific agricultural needs of each market, the agency added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26010536/agrochemicals.webp",
            "description": "<p>By Alois Vinga TRADE Promotion agency, ZimTrade has implored local players to pursue strategic partnerships and tap into the US$144 billion agrochemicals global industry potential. According to the agency, the SADC market alone imported US$4,4 billion worth of agrochemicals in 2023, up from US$2,7 billion in 2019. COMESA imports showed similar growth, climbing to US$4,9 billion in 2023</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimtrade-implores-local-companies-to-tap-into-the-us1443-billion-agrochemicals-global-industry/\">ZimTrade implores local companies to tap into the US$144,3 billion agrochemicals global industry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "GEO Pomona’s waste deal yet to kick off as garbage piles up in Harare; a scheme to pocket council money – resident says",
            "url": "https://www.newzimbabwe.com/geo-pomonas-waste-deal-yet-to-kick-off-as-garbage-piles-up-in-harare-a-scheme-to-pocket-council-money-resident-says/",
            "content": "By Darlington Gatsi\n\nGEO Pomona, a private company awarded the mandate to oversee waste management in Harare, is yet to begin its operations, with residential areas accumulating uncollected garbage.\n\nFollowing pressure from the Ministry of Local Government, the Harare City Council entered into an agreement last year with GEO Pomona Waste Management, allowing the company to collect 650 tonnes of refuse daily at a rate of US$40 per tonne.\n\nHowever, two months into the year, piles of garbage remain a common sight in Harare, with some areas going for weeks without refuse collection, leading to the rise of illegal dumping sites.\n\nThe Combined Harare Residents Association (CHRA) director, Reuben Akili, says the deal was designed to benefit top officials without considering residents input.\n\nAs CHRA, we have always maintained that the GEO Pomona project has nothing to do with refuse collection or improving waste management in the city. As you can see, those who championed this dubious project now have egg on their faces, as it is clear this initiative will fail. It has nothing to do with service provision but is rather a scheme to dig deeper into the pockets of local authorities.\n\nUnfortunately, it has become expensive for them to collect waste and dump it at Pomona because the dump site has been privatised under dubious circumstances, in a manner that is both fictitious and clandestine, Akili told NewZimbabwe.com.\n\nThe Harare City Council succumbed to government pressure after initially opposing the takeover by GEO Pomona, which is led by controversial businessman Delish Nguwaya.\n\nGEO Pomona was established in 2022 after a Dutch waste management firm, Geogenix BV, secured a US$350 million waste-to-energy deal with the city.\n\nGEO Pomonas operations with the City of Harare have been a source of contention among residents.\n\nWhen approached for comment, GEO Pomonas public relations officer, Siphathisiwe Masuku, told NewZimbabwe.com that the delay in implementing the deal was due to a transitional process.\n\nWe recognise the challenges of waste collection and fully acknowledge the significant responsibility entrusted to us. Currently, we are in a transitional period and are finalising key logistics. Our goal is to establish an efficient and sustainable waste management system that serves the city effectively. Achieving this requires careful planning, coordination, and preparation.\n\nDuring this transition period, the City of Harare continues to handle door-to-door waste collection while we work closely with them to finalise key logistics. This includes defining operational zones, identifying transfer points, and securing garages for vehicle servicing and parking.\n\nAdditionally, we are actively engaging with the City of Harare on the transfer of employees, as we are committed to retaining experienced personnel who bring valuable expertise. Once everything has been finalised, we will announce the official launch date, said Masuku.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/07184609/Pomona-Picture.jpg",
            "description": "<p>By Darlington Gatsi GEO Pomona, a private company awarded the mandate to oversee waste management in Harare, is yet to begin its operations, with residential areas accumulating uncollected garbage. Following pressure from the Ministry of Local Government, the Harare City Council entered into an agreement last year with GEO Pomona Waste Management, allowing the company</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geo-pomonas-waste-deal-yet-to-kick-off-as-garbage-piles-up-in-harare-a-scheme-to-pocket-council-money-resident-says/\">GEO Pomona’s waste deal yet to kick off as garbage piles up in Harare; a scheme to pocket council money – resident says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "In Pictures: Journalists, rights activists, politicians stand in solidarity with HSTv’s Blessed Mhlanga",
            "url": "https://www.newzimbabwe.com/in-pictures-journalists-rights-activists-politicians-stand-in-solidarity-with-hstvs-blessed-mhlanga/",
            "content": "Below are some images from THE Harare Magistrates Court where AMH journalist Blessed Mhlanga appeared facing charges of transmission of information that incites violence or causes damage to property.\n\nDozens of human rights activists, opposition politicians and journalists attended in solidarity.\n\nPictures by Tapiwa Svondo\n\nMhlanga's lawyer Chris Mhike\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003104/InShot_20250225_164929774-scaled.jpg",
            "description": "<p>Below are some images from THE Harare Magistrates Court where AMH journalist Blessed Mhlanga appeared facing charges of transmission of information that incites violence or causes damage to property. Dozens of human rights activists, opposition politicians and journalists attended in solidarity. HSTv’s Mhlanga complains about inhumane treatment by police officers; state opposes bail says he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-journalists-rights-activists-politicians-stand-in-solidarity-with-hstvs-blessed-mhlanga/\">In Pictures: Journalists, rights activists, politicians stand in solidarity with HSTv’s Blessed Mhlanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Deadly floods in Botswana kill 9; nearly 2,000 people evacuated",
            "url": "https://www.newzimbabwe.com/deadly-floods-in-botswana-kill-9-nearly-2000-people-evacuated/",
            "content": "VOA\n\nBotswana authorities say at least nine peoplewere confirmed dead Monday, as rare flooding hit the semi-arid country. More than 5,000 people have been affected by the floods as record rainfall fell over the last week.\n\nAddressing Parliament on Monday, Moeti Mohwasa, the minister for state president, said the nine people who died had all drowned. Of the deceased, six were minors.\n\nWhile the risk level has generally reduced  I regret to inform this house that we have lost one more person yesterday evening, bringing to nine the total number of fatalities to date.  So far, the number of people evacuated has increased to 1,806 from 1,749 reported yesterday, Mohwasa said.\n\nThe United Nations Children Fund (UNICEF) said at least 600,000 schoolchildren were experiencing disruptions due to the floods.\n\nSchools have been closed since last week, but Mohwasa said most are expected to reopen Tuesday.\n\nAfter a thorough assessment of the situation, I am happy to announce that schools will reopen tomorrow, February 25, 2025, he said. Another positive note is that our critical infrastructure remain[s] stable, with both electricity and water supply fully restored. Our 24-hour clinics, primary hospitals, and referral hospitals are operational and accessible to all, although there may be occasional interruptions in service provision.\n\nWhile the situation is improving with rain subsiding, more than 600 people remained at evacuation centers Monday.\n\nCalvin Moalosi, a Gaborone resident who was at one of the centers, said he lost his belongings due to the floods.\n\nI have never seen so much water in my life. The house became a pool of water, and it is really sad that some people were swept away in the floods, Moalosi said. The government has done its best to evacuate people and take them to safe areas.\n\nMost parts of the country recorded heavy rains from 150 mm (6 inches) to 200 mm (8 inches) in a 24-hour period several times last week.\n\nKutlwano Mukokomani, chief executive at the local Red Cross Society, said the organization is continuing to provide relief at evacuation centers across the country.\n\nThe Botswana Red Cross Society provided relief items to evacuation centers. We continue to provide these relief items to ensure that our communities are kept safe. We provided food items, blankets, mattresses and also hygiene packs. We are also doing assessments so that they can further guide our response, Mukokomani said.\n\nBotswana, like most southern African countries, has been recovering from the devastating El Nino-induced drought.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26002450/floods-botswana.png",
            "description": "<p>VOA Botswana authorities say at least nine people were confirmed dead Monday, as rare flooding hit the semi-arid country. More than 5,000 people have been affected by the floods as record rainfall fell over the last week. Addressing Parliament on Monday, Moeti Mohwasa, the minister for state president, said the nine people who died had all</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/deadly-floods-in-botswana-kill-9-nearly-2000-people-evacuated/\">Deadly floods in Botswana kill 9; nearly 2,000 people evacuated</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Parliament slams police over deadly pirate taxi pursuits",
            "url": "https://www.newzimbabwe.com/parliament-slams-police-over-deadly-pirate-taxi-pursuits/",
            "content": "By Darlington Gatsi\n\nPARLIAMENT has raised concerns over the vehicle pursuits of pirate taxis commonly known as mushikashika and commuter omnibuses by the Zimbabwe Republic Police (ZRP) officers, which have become a danger to the public.\n\nSpeaking on a point of national interest recently in the National Assembly, Citizens Coalition for Change (CCC) Member of Parliament, Traswell Chikomo, said that the ZRPs conduct is endangering public safety.\n\nIn Harare, we are facing a challenge regarding the battle between commuter omnibuses and the police. You would find that there are running battles between the police and commuter omnibus operators.\n\nThe police will be targeting commuter omnibuses and when commuter omnibuses are offloading people, the rank marshals tip them off and they try to evade the police. You would find that passengers get hurt and some are affected by that Hon. Speaker, this is not sustainable, said Chikomo.\n\nThe Glen View legislator added that punitive measures should be taken to address the cat-and-mouse game between commuter omnibuses and the ZRP.\n\nAs a nation, I think we need to enact laws which will help in this situation because now people are no longer free because of the races between the commuter omnibus and the police, said Chikomo.\n\nZRP officers have been involved in running battles with commuter omnibuses and pirate taxis. These confrontations have resulted in the loss of innocent passengers lives.\n\nHowever, in a surprising response, the Speaker of Parliament, Jacob Mudenda, dismissed Chikomos concerns.\n\nIf they are not guilty, why do they run away? Do innocent people run away? If a car is stationary and the driver is in the car, when the police come, why do people run away when they are innocent? So, inform combi drivers to drive their vehicles accordingly. There is no need to run away, said Mudenda.\n\nCommuter omnibuses remain a preferred mode of transport, despite some operating outside the parameters of the law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04193446/Mushikashika.png",
            "description": "<p>By Darlington Gatsi PARLIAMENT has raised concerns over the vehicle pursuits of pirate taxis commonly known as “mushikashika” and commuter omnibuses by the Zimbabwe Republic Police (ZRP) officers, which have become a danger to the public. Speaking on a point of national interest recently in the National Assembly, Citizens Coalition for Change (CCC) Member of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-slams-police-over-deadly-pirate-taxi-pursuits/\">Parliament slams police over deadly pirate taxi pursuits   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        },
        {
            "title": "Industry doubts 3% inflation rate is still achievable by year end",
            "url": "https://www.newzimbabwe.com/industry-doubts-3-inflation-rate-is-still-achievable-by-year-end/",
            "content": "By Alois Vinga\n\nTHE Confederation of Zimbabwe Industries (CZI) has expressed doubts over the fiscal authorities capability to attain a 3% month-on-month inflation rate by year-end.\n\nPresenting the 2025 National Budget, Finance Minister Mthuli Ncube, projected annual inflation rate for Zimbabwe in 2025 is expected to bewithin single digits on the strength of stable month-on-month inflation below 3% based on tight fiscal and monetary policies;essentially indicating a significantly lower inflation rate compared to previous years.\n\nHowever, the latest CZI inflation tracker doubts the possibility of attaining the set inflation target.\n\nThe high inflation rate for January 2025 threatens to make it difficult for this to be realised. The elevated ZWG month-on-month inflation rate poses a significant challenge to achieving a low annual ZWG inflation rate by May 2025, when the annual inflation figure will be reported, the industry lobby group said.\n\nIn January 2025,CZI saidthere was an observed decline in the parallel market premium as ZWG depreciated faster in the parallel market compared to the official market.\n\nThe ZWG depreciated on both the official and the parallel market by about 4,8% and 0,6% respectively between the period 1st of October 2024 to 29th of January 2025.\n\nAs a result, the exchange rate premium also declined from 38% on the 1st of October to 34% on the 29th of January 2025.\n\nThe tight liquidity stance which has seen the scarcity of ZWG has helped create some stability of the exchange rate. However, the value of 34% is still high as it creates access challenges to US$ for compliant retailers and encourages arbitrage opportunities, the inflation tracker added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171613/mushayavanhu-zig.jpg",
            "description": "<p>By Alois Vinga THE Confederation of Zimbabwe Industries (CZI) has expressed doubts over the fiscal authorities’ capability to attain a 3% month-on-month inflation rate by year-end. Presenting the 2025 National Budget, Finance Minister Mthuli Ncube,  projected annual inflation rate for Zimbabwe in 2025 is expected to be within single digits on the strength of stable month-on-month</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industry-doubts-3-inflation-rate-is-still-achievable-by-year-end/\">Industry doubts 3% inflation rate is still achievable by year end</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "26 Feb 2025"
        }
    ]
}