{
    "news": [
        {
            "title": "Trump and Zelensky in extraordinary Oval Office shouting match",
            "url": "https://www.newzimbabwe.com/trump-and-zelensky-in-extraordinary-oval-office-shouting-match/",
            "content": "By AFP\n\nUS President Donald Trump cut short a meeting with Volodymyr Zelensky on Friday and said the Ukrainian leader is not ready for peace with Russia in an extraordinary meltdown in the Oval Office that threw question marks over chances for a truce.\n\nZelensky was meant to be making a full White House visit to sign a US-Ukrainian deal for joint exploitation of Ukraines mineral resources, as part of a post-war recovery in a US-brokered peace deal.\n\nInstead, an ugly clash blew up almost immediately in the Oval Office where Trump and Vice President JD Vance shouted at Zelensky, accusing him of not being thankful for US help in the three-year war against Russian invasion.\n\nTrump berated Zelensky, telling him to be more thankful and that without US assistance Ukraine would have been conquered by Russia.\n\nYoure either going to make a deal or were out, Trump added.\n\nAnd if were out, youll fight it out and I dont think its going to be pretty.\n\nZelensky left in his motorcade shortly after, without holding a planned joint press conference. The resources deal was left unsigned, the White House said.\n\nTrump took to his Truth Social platform to castigate Zelensky saying he disrespected the United States of America in its cherished Oval Office.\n\nZelensky is not ready for peace, Trump wrote.\n\nHe can come back when he is ready for peace.\n\nCompromise row\n\nThe extraordinary meltdown came after Trump said Ukraine will have to make compromises in a truce with Russia, which has occupied swaths of Ukraine, destroying entire cities and towns along the way.\n\nYou cant do any deals without compromises. So certainly, hes going to have to make some compromises, but hopefully they wont be as big as some people think, Trump said.\n\nBut showing Trump pictures of war atrocities and referring to Russian President Vladimir Putin, Zelensky said there should be no compromises with a killer on our territory.\n\nCrazy Russians, he said, deported Ukrainian children and committed war crimes during their three-year invasion of his country.\n\nThe dramatic public breakdown in the long-tense relationship between Zelensky and Trump came after their meeting  in front of a large group of journalists  had appeared to get off to a friendlier start.\n\nZelensky had said, I think President Trump is on our side.\n\nTruce talks in doubt\n\nThe clash left in doubt efforts led by Trump to cast himself as mediator in the war.\n\nThe leaders of France and Britain also came to the White House this week, seeking to persuade Trump not to take the Russian line and to bolster US support for Ukraine in a future truce.\n\nAfter the drama in the White House, Polands Prime Minister Donald Tusk told Zelensky: You are not alone.\n\nTrump has alarmed Kyiv and European allies with his abrupt U-turn in US policy, ending what had been full-throated support for Ukraines attempt to defeat the Russian invasion and casting himself as a mediator between Putin and Zelensky.\n\nTrump said in the Oval Office that he had spoken on numerous occasions to Putin  more than has been publicly reported beyond the lengthy call between the two leaders earlier this February.\n\nSpeaking before the shouting match erupted, Trump told Zelensky that a truce is fairly close.\n\nThe US leader also said that the proposed minerals deal would be very fair.\n\nThe proposal was to give Washington financial benefits for helping Ukraine in a truce, even if Trump has repeatedly refused to commit any US military force as a back-up to European troops who might act as peacekeepers.\n\nDictator without elections\n\nThe clash came after Trump has flip-flopped in his tone on Zelensky.\n\nTrump called him a dictator last week and has repeatedly blamed Ukraine for Russias February 2022 invasion and echoed a series of Kremlin talking points about how the war started.\n\nBut on Thursday, Trump said at a joint press conference with British Prime Minister Keir Starmer: I have a lot of respect for him.\n\nWere going to get along really well, he said.\n\nTrump, who has repeatedly expressed admiration for Putin, said this week he trusts Putin to keep his word on any ceasefire.\n\nSenate Democrats accused Trump and Vance of siding with Putin.\n\nThey are doing Putins dirty work. Senate Democrats will never stop fighting for freedom and democracy, Democratic Senate Minority Leader Chuck Schumer posted on social media.\n\nDisgraceful, said Senator Chris Van Hollen.\n\nAs tensions between Moscow and Washington escalated, Russias assault on Ukraine continued.\n\nRussian infantry were on Friday storming the Ukrainian border from the Russian region of Kursk, near areas of the region that were seized last summer by Ukrainian forces, Kyiv said Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/01060813/240120205758-zelensky-trump-split-012024.jpg",
            "description": "<p>By AFP US President Donald Trump cut short a meeting with Volodymyr Zelensky on Friday and said the Ukrainian leader is “not ready” for peace with Russia in an extraordinary meltdown in the Oval Office that threw question marks over chances for a truce. Zelensky was meant to be making a full White House visit</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-and-zelensky-in-extraordinary-oval-office-shouting-match/\">Trump and Zelensky in extraordinary Oval Office shouting match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "Woman jailed for facilitating rape of own daughter (6)",
            "url": "https://www.newzimbabwe.com/woman-jailed-for-facilitating-rape-of-own-daughter-6/",
            "content": "By Staff Reporter\n\nA 43-year-old Penhalonga woman has been slapped with a 10-year jail term following conviction for assisting a man rape her minor daughter.\n\nThe woman, whose identity was withheld to protect the victim, was convicted by a Mutare magistrate after a full trial.\n\nProsecutors proved that the incident took place in 2022.\n\nThe woman is the one who undressed her 6-year-old daughter and ordered her to lie down before she was violated by accused person.\n\nShe sat in a chair and watched while her daughter was being abused.\n\nThe offender assisted an adult male unknown to the prosecutor, to rape the child.\n\nThe mother undressed the child while the unknown male was watching sitting on the bed. She then instructed her child to lie on her back on the bed. The unknown male took off his clothes and raped the child once, while the mother was watching, sitting on a chair in the bedroom, the National Prosecuting Authority said.\n\nThe matter eventually came to light in April last year when the child was living with her grandmother.\n\nThe grandmother discovered that the child was suffering from urinary incontinence.\n\nThe girl narrated that it began soon after she was raped.\n\nShe revealed the role that her mother had played in the ordeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter  A 43-year-old Penhalonga woman has been slapped with a 10-year jail term following conviction for assisting a man rape her minor daughter. The woman, whose identity was withheld to protect the victim, was convicted by a Mutare magistrate after a full trial. Prosecutors proved that the incident took place in 2022. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-jailed-for-facilitating-rape-of-own-daughter-6/\">Woman jailed for facilitating rape of own daughter (6)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "AMH owner Trevor Ncube demands a day in court as his journalist is denied bail",
            "url": "https://www.newzimbabwe.com/amh-owner-trevor-ncube-demands-a-day-in-court-as-his-journalist-is-denied-bail/",
            "content": "By Mary Taruvinga\n\nALPHA Media Holdings (AMH) publisher, Trevor Ncube has challenged the police to arrest him arguing that his reporter, Blessed Mhlanga who is currently languishing in jail after he was denied bail by a Harare magistrate is not a publisher.\n\nNcube, who is President Emmerson Mnangagwas former advisor, was responding to questions by journalists at Harare Magistrates Court where he had come in solidarity with Mhlanga.\n\nMhlanga was arrested Monday after handing himself over to the police.\n\nHe is accused of publishing messages which incite violence following his interviews with outspoken war veteran, Blessed Runesu Geza, who demanded that President Mnangagwa should step down.\n\nNcube said Mhlanga is not the owner of AMH television channel, Heart and Soul as such deserved freedom.\n\nBlessed is not AMH. Hes just a journalist practicing his profession, which is constitutionally protected, just like you guys are doing here, broadcasting to the public at home.\n\nYou cant be accused of inciting the public for broadcasting what Im saying right now.\n\nI am the one who should be brought before the courts, not the journalists who transmit the information. So, Im disappointed in that regard, but this is the reality that we are in right now, Ncube said.\n\nThe media entrepreneur said he was disappointed that Mhlanga was denied bail, pointing to selective application of the law and also accused the court of failing to appreciate that there should be freedom of the press.\n\nHe also accused Mnangagwa of controlling the judiciary, noting that the President literally owns the courts.\n\nI think fundamentally important is the fact that there wasnt any indication that the court realises that youre dealing with freedom of expression and press freedom, and that Blessed did not say any of the stuff that he is alleged to have said.\n\nUnfortunately, President Mnangagwa owns the courts. They have said they own the military; they own the police, they will do as they please. We will continue; I mean, Im sure the lawyers will do what is right, but what we saw happening today is not fair; It is not justice, and our Constitution does not support what has just taken place here, Ncube said.\n\nMhlanga was denied bail by Harare Magistrate Farai Gwitima, who ruled that he was likely to interfere with witnesses who are his subordinates.\n\nThe magistrate also said his release will jeopardise peace in Zimbabwe, among other reasons.\n\nHis lawyer Chris Mhike said he will be filing an appeal at the High Court as soon as possible.\n\nMhlanga will be back in court March 14 for routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21101343/Trevor-Ncube.jpeg",
            "description": "<p>By Mary Taruvinga ALPHA Media Holdings (AMH) publisher, Trevor Ncube has challenged the police to arrest him arguing that his reporter, Blessed Mhlanga who is currently languishing in jail after he was denied bail by a Harare magistrate is not a publisher. Ncube, who is President Emmerson Mnangagwa’s former advisor, was responding to questions by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amh-owner-trevor-ncube-demands-a-day-in-court-as-his-journalist-is-denied-bail/\">AMH owner Trevor Ncube demands a day in court as his journalist is denied bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "Harare’s Geo-Pomona waste-to-energy deal sparks corruption fears, residents allege it’s a feeding trough",
            "url": "https://www.newzimbabwe.com/harares-geo-pomona-waste-to-energy-deal-sparks-corruption-fears-residents-allege-its-a-feeding-trough/",
            "content": "By Darlington Gatsi\n\nIMPOSING deals from private companies on City of Harare (CoH) without following proper procedures and consultation creates a breeding ground for corruption, residents have said.\n\nThese are the sentiments of the Combined Harare Residents Association (CHRA), who are at loggerheads with council and the Ministry of Local Government over the approval of Geo Pomona to carry out waste management in the capital.\n\nSpeaking at a recent meeting with Harare Mayor Jacob Mafume at Town House, CHRA director Reuben Akili said that the failure to consult and the passing of council resolutions on private partnerships creates channels for corruption.\n\nWhen you read the addendum for the Pomona project, it also speaks to the issues of the local authority transferring equipment and moving workers to Geo Pomona, which is likely an agreement that was not discussed.\n\nWe need to look at the root causes of this corruption. This is very important because when you look at these committees, they play an oversight role.\n\nWhen issues are discussed in a chamber like this, decisions are made at that level. But when decisions do not originate from there, we create room for corruption. We create room for the bleeding of council resources, said Akili.\n\nGeo Pomona was established in 2022 after a Dutch waste management firm, Geogenix BV, secured a US$350 million waste-to-energy deal with the city.\n\nGeo Pomonas operations with Harare have been a source of contention among residents amid new information that the firms local focal person, Delish Nguwaya, and President Emmerson Mnangagwas son, have 50-50 percent shares in the company.\n\nInitially, Town House opposed granting permission for Geo Pomona to take over its dumping sites but has since changed its stance, agreeing to work together to clear the dump sites.\n\nGeo Pomona Waste Management will collect 650 tonnes of refuse daily at a rate of US$40 per tonne.\n\nDespite objections from residents, Geo Pomonas projects have been dubbed a model to emulate in other cities by the government.\n\nMafume, once a vocal critic of Geo Pomona, told residents that private partnerships such as this one will transform the CoH.\n\nLet us be clear, there are certain things that can be done better if we work with the private sector. I do understand that initially, the dump site was an issue of contention, even for me, but if you go there now, the place is clean.\n\nThe place has no smell. The place has been effectively managed. If you remember, we, as the residents or as the city council at that time, said we would not pay, and the payment was done from the central fiscus. They have sorted the place out, and the residents did not have to pay.\n\nThat is a model that seems to work. We might have issues with it, but those are issues that we can address, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/24161628/Pomona-dumpsite-7.png",
            "description": "<p>By Darlington Gatsi IMPOSING deals from private companies on City of Harare (CoH) without following proper procedures and consultation creates a breeding ground for corruption, residents have said. These are the sentiments of the Combined Harare Residents Association (CHRA), who are at loggerheads with council and the Ministry of Local Government over the approval of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-geo-pomona-waste-to-energy-deal-sparks-corruption-fears-residents-allege-its-a-feeding-trough/\">Harare’s Geo-Pomona waste-to-energy deal sparks corruption fears, residents allege it’s a feeding trough</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "‘l am stronger,’ says incarcerated AMH journalist Blessed Mhlanga",
            "url": "https://www.newzimbabwe.com/l-am-stronger-says-incarcerated-amh-journalist-blessed-mhlanga/",
            "content": "By Mary Taruvinga\n\nALPHA Media Holdings (AMH) journalist, Blessed Mhlanga, who is currently in remand prison awaiting trial in a case he is accused of transmitting information inciting violence has said his incarceration has made him stronger.\n\nHis arrest Monday followed his recent interviews with his namesake, Blessed Runesu Geza, a firebrand war veteran currently challenging Mnangagwas presidency. Geza is in hiding.\n\nIn a handwritten statement penned from his prison cell, Mhlanga who heads AMHs television channel, Heart and Soul, said he will take the lead in fighting for freedom of expression in Zimbabwe.\n\nThis Friday, he was denied bail by a Harare magistrate, who ruled that he was likely to interfere with investigations and reoffend.\n\nBelow is his full statement:\n\nOver the last few days, I have learnt my lesson. I have learnt that freedom is free. It comes at a cost and sometimes a painful one.\n\nI have learnt that free speech, free talk is not free and, therefore, we must never stop at anything to achieve it. It must be achieved in our generation, not the next.\n\nIt is clear to me that without acting we wont achieve anything so act we must. I will take the lead; therefore, I have instructed my lawyers to take action.\n\nI have learnt that justice is a myth but just a tool used by those in power to entrench self. At law school Munyaradzi Gwisai told me that you can never understand law fully unless you understand its origins.\n\nI fully agree, save to add that you will never fully understand it until its applied to you unjustly and with impunity by the social elites.\n\nThere is a mile of difference between writing about injustice and experiencing it. My friends and I now have the benefit of it both. L Madhuku says law is law coz its law. Just or unjust. My experience teaches me that an unjust law is no law.\n\nDear friends, prison is meant to break you. It is meant to change you. I have learnt quite to the contrary. Prison makes you more resolute. I am stronger and I identify more with you ever than before.\n\nThey say when you are arrested you are alone. Thats not true. I was never alone; your voices were with me. I stood proud in the dark hours, my wife, my family were with me. I thank you.\n\nTo those behind my persecution, including prosecution aiding and abetting injustice, I wish to say the sun will set. It wont last forever. I am and I remain Dhara B.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003104/InShot_20250225_164929774-scaled.jpg",
            "description": "<p>By Mary Taruvinga  ALPHA Media Holdings (AMH) journalist, Blessed Mhlanga, who is currently in remand prison awaiting trial in a case he is accused of transmitting information inciting violence has said his incarceration has made him stronger. His arrest Monday followed his recent interviews with his namesake, Blessed Runesu Geza, a firebrand war veteran currently</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-am-stronger-says-incarcerated-amh-journalist-blessed-mhlanga/\">‘l am stronger,’ says incarcerated AMH journalist Blessed Mhlanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "Racial discrimination rocks Peterhouse Boys School; black teachers and students feel the heat",
            "url": "https://www.newzimbabwe.com/racial-discrimination-rocks-peterhouse-boys-school-black-teachers-and-students-feel-the-heat/",
            "content": "By Alois Vinga\n\nPRESTIGIOUS Anglican-run institution, Peterhouse Boys School (PHB) has once again torched a storm on the back of rampant allegations of victimisation of black teachers and learners in favour of the whites.\n\nIn 2020, the private school made headlines for similar allegations following an outcry by black teachers and students, who experienced segregation bordered on racial grounds.\n\nRecently, some disgruntled staff members at the institution anonymously told NewZimbabwe.com that all was not well at one of the countrys elite schools after recently appointed Head of Studies at the school was tasked to cleanse black teachers by levelling trumped up charges.\n\nA number of black teachers are currently undergoing hearings while some have been dismissed and replaced by white teachers on flimsy charges. Imagine the institution is recruiting teachers from as far as Australia despite vast local talent available.\n\nIt appears that the school has an unwritten strategy to attract more white students. They want to follow the trend at other schools with more white by the tactic of eliminating black teachers who are now seen as a stumbling block to attract such a clientele, one insider alleged.\n\nAnother insider alleged that teaching conditions are tougher for black teachers, who are often loaded with more work but are given lesser periods to teach their subjects in a development suspected to be aimed at setting up to fail the students and subsequently justify dismissals.\n\nOn the other hand, white staffers often enjoy lighter loads and more teaching periods for their subjects to justify their efficiency in results outcomes.\n\nAt the core of the problems bedeviling the revered institution is also the issue of dismal Ordinary and Advanced Level performance at Peterhouse Boys in the 2024 sitting after allegedly scoring a 77.6% as compared to 96% plus for the Peterhouse Girls School.\n\nThe insiders contend that all is well at the girls division because there are more white teachers and students compared to the boys division, where there are more blacks prompting suspicion that the need to get rid of blacks is causing the mayhem.\n\nBlack teachers are alleged to be earning a gross salary of less than US$1,500 raising suspicions that the white teachers coming from as far as Australia and the UK could be earning much higher.\n\nThe schools top management has been very economical with information on the actual pass rates at Porterhouse Boys School. So far, it appears that three different sets of pass rates were shared with parents, the teachers and school administration.\n\nI hear the PHB parents sent a letter of complaint over the dismal performance and the rector sent out an email apologising and confirming the bad performance, another insider alleged.\n\nSome of the disgruntled management members now suspect that the poor performance could be influenced by the racial bias in the employment pattern, which is favouring the white teachers even when they are not so competent.\n\nContacted for comment and challenged to share his side of the story on the cocktail of allegations, Peterhouse Group of Schools Rector, Jon Trafford said the institution upholds the highest standards of transparency as he dismissed the concerns.\n\nThe Peterhouse Group is not in the habit of disclosing information which may impinge on the privacy of its staff. There are very clear policies within the school relating to the management of staff welfare and well-being.\n\nOn examination results, the school has always been entirely transparent with its results and the details of these have been circulated to parents. There should be no, at all three levels of public examination, confusion with respect to our 2024 results, Trafford said.\n\nHe noted that any suggestion there is a relationship between fees and examinations results would be tenuous and lacks insight into the determinants of academic success within schools.\n\nWe value feedback but, equally, understand that not all the information, in the public domain, may represent the facts on the ground within the school, added Trafford.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/01045816/maxresdefault-2.jpg",
            "description": "<p>By Alois Vinga PRESTIGIOUS Anglican-run institution, Peterhouse Boys School (PHB) has once again torched a storm on the back of rampant allegations of victimisation of black teachers and learners in favour of the whites. In 2020, the private school made headlines for similar allegations following an outcry by black teachers and students, who experienced segregation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/racial-discrimination-rocks-peterhouse-boys-school-black-teachers-and-students-feel-the-heat/\">Racial discrimination rocks Peterhouse Boys School; black teachers and students feel the heat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "‘Mr President, you have failed, step down’- war veterans reiterate calls for Mnangagwa’s exit",
            "url": "https://www.newzimbabwe.com/mr-president-you-have-failed-step-down-war-veterans-reiterate-calls-for-mnangagwas-exit/",
            "content": "By Staff Reporter\n\nVETERANS of the countrys liberation struggle, who are backing their fellow bush war combatant, Blessed Runesu Geza, now wanted by police on a litany of charges, have once again called for President Emmerson Mnangagwa to step down immediately, accusing him of failure.\n\nThis follows recent demands by Geza, a vocal critic of Mnangagwa and Zanu PF Central Committee member, who insisted that the President must resign due to his poor leadership.\n\nGeza is currently in hiding after police launched a manhunt for him over four criminal charges, including undermining the authority of the President and inciting public violence.\n\nSpeaking at a press conference Friday, Ethan Mathibela, chairman of the Zimbabwe National Liberation War Veterans Association (ZNLWVA), stated that Mnangagwa has failed to address widespread corruption, which has led to the countrys economic crisis, among other issues.\n\nEthan Mathibela\n\nThe nation at large, which is suffering due to this crisis, has told us they will stand with us war veterans every step of the way. They have made it clear that we must lead the charge in ensuring that the President of the Republic of Zimbabwe steps down immediately, and we are in agreement, said Mathibela.\n\nWe have countless reasons to justify this. Among them, he has failed to tackle corruption, which has severely impacted ordinary citizens and crippled our economy.\n\nHe has also failed to curb tribalism; he could be the architect of it. These are some of the reasons why people who once respected this government have now reached a decision, Mr. President, you have failed, and therefore, you must step down!\n\nWe put you in power, and we can remove you. Its very straightforward. I am speaking on behalf of the majority of citizens who have been pressuring us for far too long, Mathibela said.\n\nThe war veterans have vowed to embark on massive protests to force Mnangagwas resignation.\n\nThis comes at a time when there are two distinct factions in the ruling Zanu PF party with one loyal to Mnangagwa advocating for the suspension of the 2028 elections to allow him to remain in power until 2030 and the other, believed to be aligned to Vice President Constantino Chiwenga, pushing for adherence to the constitutional term limits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005742/SONA-3-Mnangagwa.png",
            "description": "<p>By Staff Reporter VETERANS of the country’s liberation struggle, who are backing their fellow bush war combatant, Blessed Runesu Geza, now wanted by police on a litany of charges, have once again called for President Emmerson Mnangagwa to step down immediately, accusing him of failure. This follows recent demands by Geza, a vocal critic of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mr-president-you-have-failed-step-down-war-veterans-reiterate-calls-for-mnangagwas-exit/\">‘Mr President, you have failed, step down’- war veterans reiterate calls for Mnangagwa’s exit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "U.S condemns arrest, bail denial of AMH journalist Blessed Mhlanga",
            "url": "https://www.newzimbabwe.com/u-s-condemns-arrest-bail-denial-of-amh-journalist-blessed-mhlanga/",
            "content": "By Staff Reporter\n\nTHE United States U.S embassy in Zimbabwe has strongly condemned the arrest of Alpha Media Holdings (AMH) journalist Blessed Mhlanga urging authorities to respect the fundamental rights to press freedom.\n\nMhlanga was arrested Monday on allegations of transmission of information that incites violence or causes damage to property and is being charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23.\n\nHe was denied bail Friday as the magistrate said there is a chance that he would interfere with witnesses and jeopardize the investigation.\n\nIn a statement Friday, the U.S embassy said all journalists should be entitled to constitutional protections, including the right to bail and freedom of speech.\n\nConstitutional rights to bail and free speech, should apply to all journalists, the U.S embassy said\n\nCharges against Mhlanga emanated from interviews he allegedly had with Blessed Geza, a ruling Zanu PF party war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nThe police are actively looking for Geza to respond to charges of incitement, undermining the Presidents authority, and theft.\n\nGeza called for President Emmerson Mnangagwa to resign from office immediately citing misrule.\n\nThe ruling Zanu PF party is currently divided into two factions, one loyal to Mnangagwa, which advocates for suspending the 2028 elections to extend his rule until 2030, and another, reportedly aligned with Vice President Constantino Chiwenga, which supports adhering to constitutional term limits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26062142/Mhlanga-Blessed.png",
            "description": "<p>By Staff Reporter THE United States U.S embassy in Zimbabwe has strongly condemned the arrest of Alpha Media Holdings (AMH) journalist Blessed Mhlanga urging authorities to respect the fundamental rights to press freedom. Mhlanga was arrested Monday on allegations of transmission of information that incites violence or causes damage to property and is being charged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-condemns-arrest-bail-denial-of-amh-journalist-blessed-mhlanga/\">U.S condemns arrest, bail denial of AMH journalist Blessed Mhlanga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "Scottland stumbles to victory as Triangle United gifts them a win with own goal",
            "url": "https://www.newzimbabwe.com/scottland-stumbles-to-victory-as-triangle-united-gifts-them-a-win-with-own-goal/",
            "content": "By Darlington Gatsi\n\nIt may not have been the dream start that ambitious Castle Lager Premier Soccer League side Scottland were expecting, but they got off the mark in the top flight with a victory against Triangle United.\n\nAn own goal by Triangle Uniteds defence in injury time was enough to seal the win for Scottland.\n\nScottland got off to a slow start in the PSL, appearing disjointed for the better part of the first half.\n\nVeteran midfielder Thabani Kamusoko caused numerous problems for Scotland, who were unlucky not to go into half time with a lead.\n\nKamusoko was so impressive that he received a standing ovation from the supporters at half time.\n\nDespite boasting a galaxy of stars, Scottland looked disjointed for much of the first half.\n\nMoments after the restart, Lynoth Chikuhwa shot wide from what looked like a good scoring opportunity after captain Walter Musona capitalised on a defensive mistake by Triangle.\n\nScottland coach Tonderai Ndiraya struck the right chord in the second half, with his substitutes making an instant impact.\n\nPanashe Mutimbanyoka, Sadney Urikhob, and Michael Tapera provided an attacking edge.\n\nScottlands persistence was rewarded in injury time when Triangle scored an own goal.\n\nNdiraya said the performance was not a pleasing one, considering the number of stars on his side.\n\nI think this is a historic moment for us as a team. First game in the league. You start that with a win. You can not ask for much. What is important for us is we have taken off.\n\nI must admit it was difficult, and we always knew it was going to be difficult. Despite having a galaxy of stars in our team and I think it is important to understand that football is a process, said Ndiraya after the match.\n\nScottland face Harare giants CAPS United Im their next game at Rufaro.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/28165838/WhatsApp-Image-2025-02-28-at-18.58.14.jpeg",
            "description": "<p>By Darlington Gatsi  It may not have been the dream start that ambitious Castle Lager Premier Soccer League side Scottland were expecting, but they got off the mark in the top flight with a victory against Triangle United. An own goal by Triangle United’s defence in injury time was enough to seal the win for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-stumbles-to-victory-as-triangle-united-gifts-them-a-win-with-own-goal/\">Scottland stumbles to victory as Triangle United gifts them a win with own goal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        },
        {
            "title": "Luxury meets nature at the Hills Lifestyle Estate",
            "url": "https://www.newzimbabwe.com/luxury-meets-nature-at-the-hills-lifestyle-estate/",
            "content": "By Staff Reporter\n\nTucked away from the hustle and bustle of city life, The Hills Lifestyle Estate is a breathtaking new community that offers a harmonious blend of luxury, nature, and comfort.\n\nThis upcoming exclusive development, situated on a world-class golf course, promises the perfect living space for every stage of life.\n\nWe are thrilled to introduce The Hills Lifestyle Estate, a true gem in the heart of Zimbabwe, said Ken Sharpe, CEO of WestProp.\n\nOur vision is to create a luxurious and serene lifestyle that combines the best of nature with world-class amenities.\n\nThe estate boasts a range of thoughtfully designed apartments, townhouses, villas, and retirement homes, each combining elegance with functionality. Residents can enjoy stunning views of the golf course, walking trails, outdoor spaces, and a spa and wellness centre.\n\nThe Hills Lifestyle Estate is committed to sustainability and eco-conscious living, incorporating green technologies and eco-friendly materials throughout. With its strong sense of community, family-friendly environment, and world-class amenities, this development is the perfect place to call home.\n\nAs we build The Hills Lifestyle Estate, we are not just offering a place to live  we are offering a lifestyle, addedSharpe.\n\nWe invite you to experience the ultimate in luxury and serenity, surrounded by natures beauty. Whether you are a young professional, a growing family, or someone seeking a peaceful retirement sanctuary, The Hills Lifestyle Estate has something special for you. Explore this stunning development today and discover your dream home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/28121101/hills-e1740744691562.jpeg",
            "description": "<p>By Staff Reporter Tucked away from the hustle and bustle of city life, The Hills Lifestyle Estate is a breathtaking new community that offers a harmonious blend of luxury, nature, and comfort. This upcoming exclusive development, situated on a world-class golf course, promises the perfect living space for every stage of life. “We are thrilled</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/luxury-meets-nature-at-the-hills-lifestyle-estate/\">Luxury meets nature at the Hills Lifestyle Estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "01 Mar 2025"
        }
    ]
}