{
    "news": [
        {
            "title": "Man jailed 16 years for raping older sister",
            "url": "https://www.newzimbabwe.com/man-jailed-16-years-for-raping-older-sister/",
            "content": "By Mary Taruvinga\n\nA 21-year-old man from Matobo has been slapped with a 16-year jail term following his conviction for raping his older sister.\n\nThe accused, who cannot be named to protect the victim, resides under Chief Masuku.\n\nHe was sentencedby the Gwanda Magistrates after a full trial.\n\nIt was proved that he raped his 23-year-old sister when their mother had left them at home.\n\nThe incident took place on the 1st of April 2025 this year.\n\nThe court heard the victims mother left home early in the morning to do a part-time job.\n\nShe left her three children at home.\n\nSometime around mid-morning, the youngest sibling went to the bathroom, leaving the offender and the victim at home.\n\nThe offender went into the bedroom where the complainant was sleeping and raped her, the court heard.\n\nThe offender put on his trousers and left.\n\nHe met his young sister at the door and she asked him what he was doing in their bedroom.\n\nThe accused person tried to assault her and she ran away.\n\nThe victim reported that their brother had raped her.\n\nThe matter was later reported to their mother and a police report was made, leading to the arrest of the offender.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/15194818/GWANDA-HIGH-COURT-680x380-1-e1676490526759.jpeg",
            "description": "<p>By Mary Taruvinga A 21-year-old man from Matobo has been slapped with a 16-year jail term following his conviction for raping his older sister. The accused, who cannot be named to protect the victim, resides under Chief Masuku. He was sentenced by the Gwanda Magistrates after a full trial. It was proved that he raped his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-16-years-for-raping-older-sister/\">Man jailed 16 years for raping older sister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "ZESA Executive Chairman Gata dies",
            "url": "https://www.newzimbabwe.com/zesa-executive-chairman-gata-dies/",
            "content": "By Staff Reporter\n\nThe Executive Chairman of ZESA Holdings, Sydney Gata, has died aged 79.\n\nGata died at a local private hospital after a short illness.\n\nIt is with heavy hearts and profound sadness that we share the news of the untimely passing of Dr. Sydney Zikuzo Gata, a distinguished energy, power, and infrastructure development specialist, and the Executive Chairman of ZESA Holdings. He passed away at a local hospital on 3 July 2025, after a short illness, ZESA Holdings said in a statement.\n\nDr. Gata dedicated his life to advancing energy solutions and infrastructure development.\n\nHis illustrious career spanned several decades, during which he served as a beacon of hope for the nation and an inspiration to many.\n\nHis leadership at ZESA transformed the organisation during some of its most challenging times, addressing critical power supply issues. Dr. Gatas visionary approach saw the introduction of strategic reforms that improved service delivery and was passionate about the welfare of the entire ZESA family.\n\nHe was the first black General Manager of the Electricity Supply Commission (ESC), 1981-85.\n\nGata then served as CEO and board member of ZESA in the mid-1980s to early 1990s. He was appointed ZESA Executive Chairman in 2001-2006, and was appointed to the same position in November 2019 until the time of his death.\n\nAccording to ZESA, during the period 1976-81, Sydney Gata made an impact in Research and Teaching in the fields of Mechanical and Aeronautical Engineering. In 1976, he lectured at the Chelsea College of Aeronautical Engineering in London, United Kingdom. He also lectured at the City University Department of Mechanical Engineering and Aeronautics in London, the United Kingdom, during the period 1977-80 before he came back to Zimbabwe to lecture at the University of Zimbabwe in the Faculty of Engineering during the period 1981-82.\n\nFurthermore, Dr. Gata served as a Board member of the World Energy Council Commission (WEC) for a three-year period between 1992-94.\n\nHe also served as Deputy Chairman of the WEC Studies Committee. During his career, he held advisory and board roles at the World Energy Council, African Development Bank and Integrated Energy Systems Ltd (UK) among others.\n\nHe is survived by his wife,the Deputy Minister of Primary and Secondary Education, Angeline Gata, children and grandchildren.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/05044909/sydney-gata-900.jpg",
            "description": "<p>By Staff Reporter The Executive Chairman of ZESA Holdings, Sydney Gata, has died aged 79. Gata died at a local private hospital after a short illness. “It is with heavy hearts and profound sadness that we share the news of the untimely passing of Dr. Sydney Zikuzo Gata, a distinguished energy, power, and infrastructure development</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zesa-executive-chairman-gata-dies/\">ZESA Executive Chairman Gata dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "Zimbabwe faces renewed scrutiny over Gukurahundi reconciliation drive",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-renewed-scrutiny-over-gukurahundi-reconciliation-drive/",
            "content": "Channel Africa\n\nZimbabwes attempt to reckon with one of its darkest chapters, the Gukurahundi massacres of the 1980s, is drawing fierce criticism, with questions raised about the legitimacy of the process under President Emmerson Mnangagwas leadership.\n\nThe government says it is moving forward with a judicial and reconciliation programme aimed at addressing long-standing grievances stemming from the mass killings in Matabeleland and the Midlands, which left an estimated 20 000 people dead. But for many survivors and human rights advocates, the effort feels hollow, not least because of who is leading it.\n\nAt the time of the atrocities, Mnangagwa was the Minister of State for National Security, serving under then-President Robert Mugabe. His involvement in the security structures responsible for the crackdown has cast a long shadow over the current initiative.\n\nGeopolitical analyst Aaron Ngambi believes the process is more about optics than accountability.Mnangagwa seems determined to close this chapter, but many view it as an attempt to whitewash the past, Ngambi said in an interview. Its difficult to talk about reconciliation when those accused of complicity are in charge of the process.\n\nThe Gukurahundi killings, carried out by the North Korean-trained Fifth Brigade, targeted members of the Ndebele ethnic group in the aftermath of Zimbabwes independence. The violence has never been properly investigated, and the state has long resisted calls for justice and recognition.\n\nNow, with the renewed focus on the issue, some observers say the timing may be politically motivated, part of a broader effort by Mnangagwa to shape his legacy and consolidate power in the run-up to future elections.\n\nAny reconciliation process that fails to include survivors, civil society and independent investigators will never be seen as credible, Ngambi warned. This moment demands openness, not control.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/19142837/Gukurahundi-Brigade.webp",
            "description": "<p>Channel Africa Zimbabwe’s attempt to reckon with one of its darkest chapters, the Gukurahundi massacres of the 1980s, is drawing fierce criticism, with questions raised about the legitimacy of the process under President Emmerson Mnangagwa’s leadership. The government says it is moving forward with a judicial and reconciliation programme aimed at addressing long-standing grievances stemming</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-renewed-scrutiny-over-gukurahundi-reconciliation-drive/\">Zimbabwe faces renewed scrutiny over Gukurahundi reconciliation drive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "Mnangagwa appoints new Labour Court judges",
            "url": "https://www.newzimbabwe.com/mnangagwa-appoints-new-labour-court-judges/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed new judges of the Labour Court.\n\nThe judges were successful in the public interviews conducted by the Judicial Service Commission (JSC) last month.\n\nThose who made it to the post include Bianca Makwande, Clever Tsikwa, former magistrate at the Harare courts, Garudzo Ziyaduma, who served as prosecutor, Robin Mzyece, Evidence Gonesi and Motion Jaravani.\n\nIt is hereby notified that His Excellency, the President has, in terms of section 180 (1) of the Constitution of Zimbabwe appointed the persons specified in the Schedule as Judges of the Labour Court, with effect from the date of appointment, said Mnangagwa in the latest government gazette.\n\nThe JSC interviewed 28 candidates.\n\nInitially, the commission received 53 nominations, but following a review, six submissions were invalidated, and two were withdrawn.\n\nOn April 14, 2025, 45 candidates participated in the first-level examination, with 28 qualifying for the final interviews.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13050811/labour-court.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed new judges of the Labour Court. The judges were successful in the public interviews conducted by the Judicial Service Commission (JSC) last month. Those who made it to the post include Bianca Makwande, Clever Tsikwa, former magistrate at the Harare courts, Garudzo Ziyaduma, who served as prosecutor,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-appoints-new-labour-court-judges/\">Mnangagwa appoints new Labour Court judges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        },
        {
            "title": "Feels great to be back home – Ishmael Wadi returns to CAPS United",
            "url": "https://www.newzimbabwe.com/feels-great-to-be-back-home-ishmael-wadi-returns-to-caps-united/",
            "content": "By Sports Reporter\n\nStriker Ishmael Wadi says he is happy to be back at CAPS United after playing in South Africa for the past three years.\n\nWadi (32) is one of the three players who have been signed by CAPS United during the ongoing transfer window, which started on the 1st of July.\n\nHe last featured for CAPS United in 2021 before leaving for South Africa, where he played for Glad Africa Championship side JDR Stars.\n\nIt feels great to be back home. I think home is best, so I decided to come back to CAPS because it is home.\n\nWadi re-joins CAPS United at a time when the team is struggling with form in the ongoing campaign.\n\nMakepekepe recorded one of its worst starts in PSL history, only to revive form with the coming of Zambian coach Ian Bakala, who is a former player.\n\nCurrently, the team is in position 11 with 20 points, twelve ahead of bottom-placed Kwekwe United.\n\nI think we need to work as a team because I dont think it is an individual sport.\n\nSo we need to push because where we are standing right now is not a favourable position for us, but I think we need to work ourselves out, added Wadi.\n\nCAPS United has only scored 14 goals in 18 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/03203354/Ishmael-Wadi.jpg",
            "description": "<p>By Sports Reporter Striker Ishmael Wadi says he is happy to be back at CAPS United after playing in South Africa for the past three years. Wadi (32) is one of the three players who have been signed by CAPS United during the ongoing transfer window, which started on the 1st of July. He last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/feels-great-to-be-back-home-ishmael-wadi-returns-to-caps-united/\">Feels great to be back home – Ishmael Wadi returns to CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "04 Jul 2025"
        }
    ]
}