{
    "news": [
        {
            "title": "NetOne CEO’s lawyers demand his release, blame “boardroom politics” for arrest",
            "url": "https://www.newzimbabwe.com/netone-ceos-lawyers-demand-his-release-blame-boardroom-politics-for-arrest/",
            "content": "By Mary Taruvinga\n\nLawyers representing NetOne CEO Raphael Mushanawani have written to the Zimbabwe Anti-Corruption Commission (ZACC) demanding his immediate release, insisting their client is the victim of a calculated power grab within the organisation.\n\nMushanawani was arrested Monday on fraud allegations involving US$1.2 million. However, his legal team claims the charges are fabricated by rivals seeking to force him out, using the names of influential politicians to strengthen their plot.\n\nIn a letter dated September 30, 2025, and seen byNewZimbabwe.com, Mushanawanis lawyer Admire Rubaya argued that the arrest was unlawful, describing his client as being punished for doing things right at the parastatal.\n\nRubaya alleged that ZACC had been misled, insisting that all the CEOs actions were above board and backed by board approval, contrary to claims that he engaged companies without authorisation.\n\nThere are certain individuals who are targeting his post who have approached you (ZACC) on the basis of name dropping very powerful individuals who sit in the high echelons of power and politics in this country yet there is no involvement of any such political figures. The grand plan is for these instigators to take over as the people at the helm of NetOne, the letter states.\n\nZACC accuses Mushanawani of breaching company procedures by secretly engaging Lunartech Solutions (Pvt) Ltd to upgrade NetOnes SAGE 1000 system, which was meant to be replaced under a separate US$3.5 million contract awarded to Farevic Systems (Pvt) Ltd in 2022.\n\nThe commission alleges that Mushanawani did so without the approval of the Executive Committee or the Board.\n\nHowever, his lawyers insist the upgrade was necessary, approved at the board level, and vital to safeguard NetOnes operations.\n\nOur client is at a loss as to why he finds himself languishing in police custody over an issue which exposes your officers lack of understanding of IT systems, the lawyers wrote.\n\nThey explained that the SAP ERP system being implemented by Farevic was distinct from the SAGE 1000 system NetOne had been using for years. SAGE had reached its end-of-sale stage, with support from its South African vendor scheduled to end on December 31, 2024, creating what they said was a significant operational risk.\n\nContrary to your claims, the upgrading of the SAGE ERP 1000 to SAGE L200 was imperative  This was key and had been approved by the board, the lawyers said.\n\nThey further argued that both systems had to run in parallel until the new one was proven fully functional.\n\nThe lawyers also rejected claims that Mushanawani signed addenda worth US$1.2 million to upgrade the SAGE system.\n\nThis is false, and you are challenged to provide such evidence. For your information, the only payments which have been made thus far are for US$184,800 and US$88,002.57, the letter reads.\n\nThey equally dismissed allegations that Mushanawani entered into an unapproved consultancy contract with Diztech (Pvt) Ltd for US$79,467.\n\nFor the record, there is no contract that was signed between Diztech (Pvt) Ltd and NetOne as alleged, neither has there been any payment of even a dime to Diztech (Pvt) Ltd  since no such services were ever provided, the lawyers said.\n\nMushanawanis defence team maintains that the allegations are part of a deliberate campaign to oust him from his position. They attached board documents to support their case and warned ZACC against being used in what they called an orchestrated plot.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30061209/NETONE-CEO-Raphael.jpeg",
            "description": "<p>By Mary Taruvinga Lawyers representing NetOne CEO Raphael Mushanawani have written to the Zimbabwe Anti-Corruption Commission (ZACC) demanding his immediate release, insisting their client is the victim of a calculated power grab within the organisation. Mushanawani was arrested Monday on fraud allegations involving US$1.2 million. However, his legal team claims the charges are fabricated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netone-ceos-lawyers-demand-his-release-blame-boardroom-politics-for-arrest/\">NetOne CEO’s lawyers demand his release, blame “boardroom politics” for arrest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "01 Oct 2025"
        },
        {
            "title": "Parliament: “Cut off the manhood!” – MP calls for castration of rapists",
            "url": "https://www.newzimbabwe.com/parliament-cut-off-the-manhood-mp-calls-for-castration-of-rapists/",
            "content": "By Anna Chibamu\n\nA femalelegislator has made a bold plea in Parliament, calling for the castration of convicted rapists, particularly repeat offenders.\n\nGoromonzi West MP Beata Nyamupinga made the appeal during Tuesdays National Assembly session, urging lawmakers to take urgent steps to protect women and children from rampant sexual violence.\n\nHer remarks followed two shocking incidents that have sparked national outrage: the rape of a Grade 7 girl by a tout at Harares Rezende bus terminus, and a viral video showing two 16-year-old boys gang-raping a 17-year-old girl who appeared unconscious.\n\nWe are crying over the issue of rape. We are grieving as women of this country. The whole nation is not happy to see a fit gentleman having sexual intercourse with a young child, Nyamupinga said.\n\nShe further urged her female colleagues to lobby President Emmerson Mnangagwa directly, arguing that stiffer penalties were urgently needed.\n\nCan we have something as a matter of urgency to ensure that if somebody is caught having sexual intercourse with a minor, they should be castrated. If he maintains that manhood, he will not have the discipline to stop. As women, we live in fear,where can we safely keep our children when we go to work, to church, or even here in Parliament? she asked, drawing applause across the House.\n\nNyamupinga stressed that prison sentences alone were insufficient, since many offenders re-offend upon release.\n\nIf you decide it is not good to cut off his manhood, then let us castrate them, she insisted.\n\nActing Speaker of Parliament Joseph Tshuma acknowledged the gravity of the issue, condemning the sexual abuse of minors as incomprehensible and appalling.\n\nHe suggested that Nyamupinga consider introducing a Private Members Bill to push for harsher penalties, including possible life sentences for child rapists.\n\nWhile Zimbabwe has abolished the death penalty, certain crimes, particularly the rape of minors, demand severe consequences, the Acting Speaker said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Anna Chibamu A female legislator has made a bold plea in Parliament, calling for the castration of convicted rapists, particularly repeat offenders. Goromonzi West MP Beata Nyamupinga made the appeal during Tuesday’s National Assembly session, urging lawmakers to take urgent steps to protect women and children from rampant sexual violence. Her remarks followed two shocking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-cut-off-the-manhood-mp-calls-for-castration-of-rapists/\">Parliament: “Cut off the manhood!” – MP calls for castration of rapists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "01 Oct 2025"
        },
        {
            "title": "OK Zimbabwe revenue tumbles by 53% amid supply chain disruptions",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-revenue-tumbles-by-53-amid-supply-chain-disruptions/",
            "content": "By Alois Vinga\n\nRetail giant OK Zimbabwe has reported a 53% decline in revenues, attributing the slump to supply chain disruptions, a liquidity crunch, and intensifying competition from the informal sector.\n\nPresenting the groups performance for the year ended March 31, 2025, OK Zimbabwe chairman Herbert Nkala said revenues fell to US$240 million, down 53% compared to the prior year, despite an average inflation rate of 15.21%.\n\nThe decline was linked to several factors, including exchange rate controls that distorted pricing and delayed supplier payments, which led to disruptions in product availability.\n\nSupply chain disruptions were as a result of the group failing to settle suppliers accounts on time leading to some withholding deliveries while others demanded payment upfront. These challenges resulted in the Groups operational capacity being impacted negatively, said Nkala.\n\nThe company carried out a comprehensive impairment review of all cash-generating units (CGUs). Due to constrained operational capacity, it recognised an impairment of US$10.3 million, as the recoverable amounts of certain CGUs fell below their carrying values.\n\nA net exchange gain of US$13.5 million was recorded, stemming from the revaluation of monetary liabilities after the devaluation of the Zimbabwe Gold (ZWG).\n\nDespite the challenges, the group has taken steps to strengthen its balance sheet. A rights issue raising US$20 million was concluded in July 2025, with proceeds received in August. An additional capital raise of US$10.5 million through the sale of immovable properties is underway, with offers currently under consideration.\n\nLooking ahead, cost optimisation and in-store as well as online sales strategies will remain central to achieving and sustaining the required growth. The recovery of the Group has started, but it will take some time to return to normal operations, added Nkala.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga Retail giant OK Zimbabwe has reported a 53% decline in revenues, attributing the slump to supply chain disruptions, a liquidity crunch, and intensifying competition from the informal sector. Presenting the group’s performance for the year ended March 31, 2025, OK Zimbabwe chairman Herbert Nkala said revenues fell to US$240 million, down 53%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-revenue-tumbles-by-53-amid-supply-chain-disruptions/\">OK Zimbabwe revenue tumbles by 53% amid supply chain disruptions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "01 Oct 2025"
        },
        {
            "title": "Robbery spree targeting schools: Zimbabwean man shot dead in Limpopo",
            "url": "https://www.newzimbabwe.com/robbery-spree-targeting-schools-zimbabwean-man-shot-dead-in-limpopo/",
            "content": "IOL\n\nPolice at Ritavi, in Limpopo, have launched a manhunt for two suspects after a series of violent incidents at schools in the area, which left one suspect dead, another arrested, and several items stolen.\n\nAccording to provincial police spokesperson Colonel Malesela Ledwaba, between midnight and 4 am on Sunday, three armed suspects targeted three schools in the Ritavi policing area. The gang stole cellphones and laptops and attempted to break into an administration block at one of the schools around 3 am.\n\nThe on-duty security guard became suspicious and confronted the suspects. Police said the suspects opened fire in the guards direction before fleeing.\n\nThe guard later discovered one of the suspects lying on the ground with a gunshot wound. Paramedics certified the suspect dead at the scene. A post-mortem will be conducted to determine the exact cause of death, said Ledwaba.\n\nThe provincial murder and robbery unit, together with the Mopani tracking team, attended the scene and identified the deceased as a 36-year-old man from Seshego. The deceased is also reported to be a Zimbabwean national.\n\nFurther investigations led to the tracing of a vehicle allegedly used in the crimes. The driver, a 41-year-old man from Seshego, was arrested and is due to appear in the Nkowankowa Magistrates Court on Tuesday.\n\nPolice confirmed that two suspects remain at large and are actively being pursued.\n\nSAPS has urged anyone with information on the outstanding suspects to contact investigating officer Sergeant Eric Mathebula on 083 239 0977, call theCrime Stop number 08600 10111, report to the nearest police station, or use the My SAPS App.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30181434/LIFELESS-ZIM-MAN.png",
            "description": "<p>IOL Police at Ritavi, in Limpopo, have launched a manhunt for two suspects after a series of violent incidents at schools in the area, which left one suspect dead, another arrested, and several items stolen. According to provincial police spokesperson Colonel Malesela Ledwaba, between midnight and 4 am on Sunday, three armed suspects targeted three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robbery-spree-targeting-schools-zimbabwean-man-shot-dead-in-limpopo/\">Robbery spree targeting schools: Zimbabwean man shot dead in Limpopo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "01 Oct 2025"
        },
        {
            "title": "Zimbabwe orders spending clampdown to keep budget under control",
            "url": "https://www.newzimbabwe.com/zimbabwe-orders-spending-clampdown-to-keep-budget-under-control/",
            "content": "Zimbabwe ordered government departments to halt unbudgeted spending and focus funds only on projects that will support economic growth in the southern African nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>Bloomberg Zimbabwe ordered government departments to halt unbudgeted spending and focus funds only on projects that will support economic growth in the southern African nation. Secretary of Finance George Guvamatanga issued the instruction in a circular seen by Bloomberg and confirmed by his ministry on Monday. He suspended government-funded foreign trips, froze hiring and barred</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-orders-spending-clampdown-to-keep-budget-under-control/\">Zimbabwe orders spending clampdown to keep budget under control</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "01 Oct 2025"
        },
        {
            "title": "South Africa’s top diplomat in France found dead near Paris hotel",
            "url": "https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/",
            "content": "BBC\n\nSouth Africas ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC.\n\nMthethwa, 58, was reported missing by his wife on Monday evening, after a worrying message from him, the Paris prosecutors office said.\n\nHe had booked a room on the 22nd floor of the high-rise hotel, whose security window was forced open, it added.\n\nThe circumstances around his death are unclear at this stage, and an investigation has been opened, the Paris prosecutors office said, adding that a duty magistrate was going to the scene.\n\nMthethwa was a high-ranking member of the African National Congress, the party that brought in democratic rule in 1994 with Nelson Mandela as South Africas first black president.\n\nHe had been serving as South Africas ambassador to Paris since December 2023, and had previously been in government as police minister and also arts and culture minister.\n\nHe was a close ally of former President Jacob Zuma and was implicated in what is known in South Africa as the state capture inquiry, which looked into allegations of high-level corruption during Zumas presidency.\n\nIn a statement, South Africas Foreign Minister Ronald Lamola hailed Mthethwa as a distinguished servant of the nation.\n\nI have no doubt that his passing is not only a national loss but is also felt within the international diplomatic community, he added.\n\nLamola confirmed that the circumstances around Mthethwas death were being investigated by the French authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30181743/nathi-mtetwa.webp",
            "description": "<p>BBC South Africa’s ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC. Mthethwa, 58, was reported missing by his wife on Monday evening, after a “worrying message from him”, the Paris prosecutor’s office said. He had booked a room on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-top-diplomat-in-france-found-dead-near-paris-hotel/\">South Africa’s top diplomat in France found dead near Paris hotel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "01 Oct 2025"
        }
    ]
}