{
    "news": [
        {
            "title": "Zimbabwe’s inflation drops, but debt management remains key",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/",
            "content": "Forbes Africa\n\nThe Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025.\n\nZimbabwes economy hasbeenimpactedbysevere inflation since the early 2000s, but officialsmaybebreathing a sigh of relieffollowinga recentConfederation of Zimbabwe Industries (CZI) report, which showed inflation to have droppedfrom82.7% in September to 32.7% in October.\n\nThe future appears brighter with inflation projected to fall to between 15% and 20% by the end of the year, marking a significant recovery from 2020, when inflation soared past 500%,amid the pandemic.\n\nIntroduced by the Reserve Bank of Zimbabwe (RBZ) in April 2024, the rising valuation ofZiG, pegged to foreign currency and precious metals, primarily gold, has beenaleading protagonist behind Zimbabwes economic resurgence.\n\nAccording to theInternational Monetary Fund, the nations current GDP is $53.31 billionup $13.35 billion from 2020.\n\nHowever, despitetheimpactof theZiG, expertsseem to becautiousofa recurring theme of volatility.\n\nThe outlook for the ZiG has improved over the near term, supported by elevated gold prices. However, it still has a long way to go before it becomes the sole legal tender for Zimbabwe, says Lyle Begbie, an economist at Oxford Economics Africa.\n\nZimbabwes history of hyperinflation and failed monetary experiments means itremainshighly dollarized. The U.S.dollar is the main medium of exchange, while the share ofZiGin monetary aggregates is small at around 17%. Prices are rarely quoted inZiG, and salaries and goods and services transactions are typically either fully or partially paid in U.S.dollars.\n\nWhile stabilizing inflation is undoubtedly positive, the landlocked nationwill need to remain steadfastregardingother challenges,before unlocking national sovereignty. Zimbabwes public debt, which reached $23.2 billion in 2024 (72.9% of GDP),per the World Bank,remainsa discouraging barrier to foreign investment.\n\nZimbabwes debt arrearssubstantially weighon its economic growth outlook, Begbie explains, before adding, Due to these arrears, the country cannot access concessional funding from multilateralorganizations, andis excluded from obtaining any sort of debt relief.\n\nThe World Bank has placed Zimbabwe in non-accrual status since 2000. Whilemassivedebtrisks stallingmomentum, addressing inflationwillput thatsummitwithin reach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Forbes Africa The Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025. Zimbabwe’s economy has been impacted by severe inflation since the early 2000s, but officials may be breathing a sigh of relief following a recent Confederation of Zimbabwe Industries (CZI) report, which showed inflation to have dropped from 82.7% in September</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/\">Zimbabwe’s inflation drops, but debt management remains key</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "19 Nov 2025"
        },
        {
            "title": "Mutapa Fund mining cluster injects 2.4 tons of gold in nine months",
            "url": "https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/",
            "content": "By Alois Vinga\n\nThe Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions.\n\nAs the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests in opportunities aligned with national development priorities across agriculture, renewable energy, technology, and mining. The Fund derives income primarily through dividends and investment returns, and may selectively pursue third-party funding while maintaining conservative leverage under strict risk and governance frameworks.\n\nAddressing delegates at the Zimbabwe Gold Investment Conference 2025, MIF Deputy Chief Investment Officer Ernest Denhere said the strong performance was driven by investee companies within the mining cluster.\n\nThe Fund has strong presence in the gold space through Kuvimba Mining House (KMH) and Defold Mine, delivering 29% of Large Scale Miners gold to Fidelity between January and September, at 2.4 tons. The Fund recognises that gold currently presents a unique opportunity for value creation and growth in export receipts, he said.\n\nMIF officials noted that precious metals, especially gold, have surged in 2025 as investors seek safe-haven assets amid geopolitical and economic uncertainty. Gold has gained 56% year-to-date, while Zimbabwes gold exports have grown by 71% for the nine months to September 2025.\n\nDenhere said the value of gold exported by September stood at US$3.2 billion, with artisanal and small-scale miners contributing 74% of total gold output.\n\nWith a funding pipeline of at least US$500 million across several gold projects, the Fund is open to exploring different strategies to support the sector and bolster the gold value chain. MIF is a long-term, non-speculative investor focused on providing patient capital to its investors.\n\nThe Funds strategy also includes establishing an exploration fund. With gold as a safe-haven asset with long-term upside, there is strong upside for new discoveries, added Denhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>By Alois Vinga The Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions. As the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/\">Mutapa Fund mining cluster injects 2.4 tons of gold in nine months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "19 Nov 2025"
        },
        {
            "title": "WestProps Hills Luxury Golf Estate transforms Harare West",
            "url": "https://www.newzimbabwe.com/westprops-hills-luxury-golf-estate-transforms-harare-west/",
            "content": "By Staff Reporter\n\nIn the heart of Harare West, once dismissed by skeptics as an unlikely canvas for luxury  a bold vision has taken root. The Hills Luxury Golf Estate is rewriting the rules of real estate, sport, and lifestyle in Zimbabwe.\n\nWhat was once called a project of impossibilities is now the countrys most iconic urban development. The lead developer Ken Sharpe, CEO of Westprop Holdings is upbeat with progress so far.\n\nHe feels the project has all the ingredients of luxury, modernity and the future. Last week he hosted an elite gathering of customers to serenade them with progress so far. The customers felt the vibe and committed to the project.\n\nCritics had scoffed at the idea of a baobab forest thriving in Harare West. They doubted that global attention could be drawn to this corner of the capital. Today, those doubts have been silenced by a living, breathing masterpiece  where ancient trees meet modern luxury, and every detail is curated for excellence.\n\nAt the heart of this transformation is a golf course designed by none other than Peter Matkovich, the current world number one golf architect. His signature blends natural beauty with championship precision, creating a course that is both a sanctuary and a stage for greatness.\n\nThe Hills is not just a place to live  itnis a place to belong. Exclusive features include:\n\nBranded Residences: Architecturally stunning homes with direct access to the golf course.\n\nSpeaking at a recent customer familiarization tour of the project Simukai Whande WestProp Digital Marketing Manager had this to say: This is a rare moment in time. Early investors will benefit from pre-launch pricing, securing premium assets at unmatched value. Once the ceremonial first tee is struck, prices will rise by an average of 40%, reflecting the true worth of this landmark estate.\n\nThe Hills is proof that vision, courage, and excellence can defy geography and expectation. Its a celebration of Zimbabwean pride, global standards, and the power of belief. What was once deemed impossible is now inevitable, and those who act early will own a piece of history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18182919/the-hills.webp",
            "description": "<p>By Staff Reporter In the heart of Harare West, once dismissed by skeptics as an unlikely canvas for luxury – a bold vision has taken root. The Hills Luxury Golf Estate is rewriting the rules of real estate, sport, and lifestyle in Zimbabwe. What was once called “a project of impossibilities” is now the country’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/westprops-hills-luxury-golf-estate-transforms-harare-west/\">WestProps Hills Luxury Golf Estate transforms Harare West</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "19 Nov 2025"
        },
        {
            "title": "PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season",
            "url": "https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/",
            "content": "By Sports Reporter\n\nPremier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign.\n\nThe decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare.\n\nZIFA had initially proposed increasing the number of participating teams from 18 to 20, but PSL clubs went further, opting for a 22-team league next year.\n\nAs a result, all eight teams that were facing relegation this season will survive, while the four regional division champions will be promoted to the topflight, bringing the league to 22 clubs.\n\nIn a statement PSL revealed that the league will be trimmed back to 20 teams in 2027.\n\nThe PSL resolved to suspend relegation for the 2025 season.\n\nThe League will accommodate the newly promoted teams, resulting in an expanded league of twenty-two teams for a transitional period during the 2026 season.\n\nAfter the conclusion of the 2026 season, the League will revert to the proposed twenty team format beginning in the 2027 season, read part of PSL statement.\n\nThe move is meant to help ZIFA adopt a National First Division League which will feed the topflight league.\n\nIn addition, the PSL proposed a phased approach to the implementation of the National First Division League with the possibilities of it being fully operational within the next three years, PSL added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18152309/psl-zim-1-e1763479504235.jpg",
            "description": "<p>By Sports Reporter Premier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign. The decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare. ZIFA had initially proposed increasing the number of participating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/\">PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "19 Nov 2025"
        },
        {
            "title": "Cloudflare outage disrupts X, ChatGPT and other parts of the internet",
            "url": "https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/",
            "content": "The Verge\n\nCloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage thats taking down sites across the web. Users encountered error messages when trying to access X,ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs of recovery.\n\nMany sites displayed an error message saying Please unblock challenges.cloudflare.com to proceed. On Cloudflaresstatus page, the most recent update from the company at 9:34AM ET says:\n\nWeve deployed a change which has restored dashboard services. We are still working to remediate broad application services impact.\n\nIn a statement toThe Verge, Cloudflare spokesperson Jackie Dutton says the company noticed a spike in unusual traffic to one of its services starting at 6:20AM ET, causing some traffic passing through Cloudflares network to experience errors. Dutton adds, We do not yet know the cause of the spike in unusual traffic. We are all hands on deck to make sure all traffic is served without errors. The company is also planning to investigate the cause of the unusual spike in traffic.\n\nOther online services, including Indeed, Grindr, Uber, Canva, Spotify, NJ Transit,League of Legends, and Archive of Our Own, experienced issues during the outage, while digital outlets likeAxios,The Information, andPoliticoalso went down.\n\nThe Cloudflare outage comes less than a month after a hugeAmazon Web Services crash took downFortnite, Alexa, Snapchat, and other services, which was followed by issues atMicrosoft Azure that brought Xbox offlinefor hours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18150503/cloudflare.jpeg",
            "description": "<p>The Verge Cloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage that’s taking down sites across the web. Users encountered error messages when trying to access X, ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/\">Cloudflare outage disrupts X, ChatGPT and other parts of the internet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "19 Nov 2025"
        }
    ]
}