{
    "news": [
        {
            "title": "Knives out in ZANU PF as Mutsvangwa raps Chiwenga over corruption dossier, accuses VP of turning presidium into a kangaroo court",
            "url": "https://www.newzimbabwe.com/knives-out-in-zanu-pf-as-mutsvangwa-raps-chiwenga-accuses-vp-of-turning-presidium-into-a-kangaroo-court/",
            "content": "By Staff Reporter\n\nZanu PFs internal power struggles have escalated dramatically, with party spokesperson Christopher Mutsvangwa publicly rebuking Vice President Constantino Chiwenga, accusing him of turning the presidium into a kangaroo court.\n\nThe confrontation reportedly followed Chiwengas demand for President Emmerson Mnangagwa to take action against individuals named in a corruption dossier he presented to the Politburo.\n\nSources told NewZimbabwe.com tensions were high during the meeting. Chiwengas allies initially rallied behind him before retreating when questions were raised about the motives behind his dossier.\n\nThe document reportedly implicates several prominent businessmen closely associated with Mnangagwa, including Wicknell Chivayo, Delish Nguwaya, Kudakwashe Tagwirei, Pedzai Sakupwanya, and Paul Tungwarara.\n\nThe group is accused of siphoning millions from state coffers, calling for their immediate arrest,a move that has deepened divisions within the ruling party.\n\nOur Vice President decides to turn the Presidium into a kangaroo court. An inquisitive court.KutongaPresident citing that document which was authored by Kasukuwere and his colleagues, Mutsvangwa told journalists at a press briefing in Harare, Thursday, expressing his disapproval of Chiwengas actions.\n\nMutsvangwa claimed that everyone in the Politburo professed ignorance about the origins of the dossier, with the exception of Chiwengaleading to speculation that the Vice President is acting alone.\n\nHefurther suggested that the incident had served as a reminder to Chiwenga that he is merely a Presidential appointee and lacks independent powerandshould conduct himself accordingly.\n\nIt reminded the Presidium that you are appointees of the President like us. You have no powers as the Presidium. And it was one person among these Presidium members who was championing that document. All these other people were just being dragged along.\n\nThe Politburo asked who penned the document, do you accept the ownership individually? All other members of the Presidium said we dont know where it came from. So it zeroed in on the Vice President.\n\nChiwenga has consistentlyslammed corruption, describing it as a national security threat. He has also repeatedly warned those who amass wealth through unscrupulous means to watch their backs, suggesting that their day of reckoning is coming.\n\nThe individuals named in the dossier are alleged to be securing government tenders through corrupt practices. These allegations are not new, but their formal presentation within the Politburo has brought the issue to a head.\n\nFor instance, Chivayo previously defrauded ZESA of US$5 million in the Gwanda Solar Power project through his Intratek Company, and failed to deliver on the project.\n\nTagwirei has been linked to the over US$3 billion Command Agriculture scandal and is also implicated in the recent dossier alleging that approximately US$3.2 billion has been stolen from state coffers. Meanwhile, Paul Tungwarara secured a tender to drill 10,000 boreholes under the Presidential Borehole Drilling Scheme, but was recently criticised by Parliament for failing to deliver.\n\nThe government has acknowledged that it is losing US$2 billion annually due to corruption and illicit financial dealings, making the current accusations all the more damaging and increasing the pressure on Mnangagwa to take action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16163123/chris-mutsvangwa.jpg",
            "description": "<p>By Staff Reporter Zanu PF’s internal power struggles have escalated dramatically, with party spokesperson Christopher Mutsvangwa publicly rebuking Vice President Constantino Chiwenga, accusing him of “turning the presidium into a kangaroo court.” The confrontation reportedly followed Chiwenga’s demand for President Emmerson Mnangagwa to take action against individuals named in a corruption dossier he presented to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/knives-out-in-zanu-pf-as-mutsvangwa-raps-chiwenga-accuses-vp-of-turning-presidium-into-a-kangaroo-court/\">Knives out in ZANU PF as Mutsvangwa raps Chiwenga over corruption dossier, accuses VP of turning presidium into a kangaroo court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "16 Oct 2025"
        },
        {
            "title": "After destroying CCC, Tshabangu now pushing for suspension of 2028 elections",
            "url": "https://www.newzimbabwe.com/after-destroying-ccc-tshabangu-now-pushing-for-suspension-of-2028-elections/",
            "content": "By Darlington Gatsi\n\nSelf-imposed Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu is spearheading a plan to suspend the 2028 general elections, a move that would effectively extend President Emmerson Mnangagwas stay in power.\n\nAccording to Ziyambi, the proposal contained in a document titled Building Bridges Initiative (BBI) seeks to amend Section 92 of the Constitution to allow for the suspension of general elections.\n\nIf enacted, the amendment would pave the way for Mnangagwas term to be extended beyond the constitutional limit.\n\nZiyambi, however, dismissed claims linking Jonathan Moyo and businessmen Kudakwashe Tagwirei and Pedzai Sakupwanya to the alleged plot, insisting that the initiative originated from Tshabangu.\n\nThe BBI is an opposition document which was initially brought to my attention by the leader of the opposition in Parliament, Sengezo Tshabangu, in the company of a General Khumalo from the Vice Presidents Office.\n\nAs a Party, we should appreciate the relationship with the opposition, which has been beneficial to us. There is no proof whatsoever that the BBI Project is being funded by the named individuals. It appears the author is more seized with it and would have assisted us by unpacking it further, said Ziyambi.\n\nThe move has deepened tensions within Zanu PF, angering a faction backing Vice President Constantino Chiwenga as Mnangagwas successor.\n\nThis has created a tense atmosphere at the National Peoples Conference, which is being held in Mutare and is expected to cement last years resolution number one, extending Mnangagwas term.\n\nZiyambi further defended the BBI, describing it as a nation-building initiative rather than a treasonous plot.\n\nIt is surprising how the writer got hold of the Building Bridges Initiative (BBI) document if it was meant for Parliament. This tendency of stalking officials who are carrying out their duties is regrettable.\n\nThere is nothing treasonous about improving a political system. This BBI, which is being referred to, is not strange to us, and its actually promoting nation building and cohesion as compared to the authors divisive and inciteful document, said Ziyambi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Darlington Gatsi Self-imposed Citizens Coalition for Change (CCC) Secretary General Sengezo Tshabangu is spearheading a plan to suspend the 2028 general elections, a move that would effectively extend President Emmerson Mnangagwa’s stay in power. This was revealed by ZANU-PF’s Secretary for Legal Affairs, Ziyambi Ziyambi, in a recent Politburo meeting. He was responding to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-destroying-ccc-tshabangu-now-pushing-for-suspension-of-2028-elections/\">After destroying CCC, Tshabangu now pushing for suspension of 2028 elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "16 Oct 2025"
        },
        {
            "title": "US plays downs claims Hamas is violating ceasefire deal over hostage remains",
            "url": "https://www.newzimbabwe.com/us-plays-downs-claims-hamas-is-violating-ceasefire-deal-over-hostage-remains/",
            "content": "BBC\n\nThe US has downplayed claims that Hamas is violating the ceasefire deal with Israel by not returning all the bodies of dead hostages.\n\nOnly nine of the 28 dead hostages have been returned, with Hamas saying it needs time and specialised equipment to recover the others from the ruins of Gaza.\n\nThe latest wo bodies returned on Wednesday have been identified as Inbar Hayman and Sgt Maj Muhammad al-Atresh, the Israel Defense Forces said early on Thursday.\n\nThe row over the return of dead hostages has led Israel to limit promised aid supplies to Gaza, but two senior advisers to US President Donald Trump have said plans to demilitarise the Strip and build a new transitional government are under way.\n\nIn an update on the implementation of Trumps 20-point peace plan, the advisers told reporters that the US government did not so far believe Hamas had broken the agreement by not retrieving more remains.\n\nThe advisers argued that Hamas had acted in good faith by returning all living hostages and was working with various interlocutors to find and return the remains of the others.\n\nHamass armed wing said in a statement it was committed to the deal but had returned all the bodies of hostages it was able to reach.\n\nOne senior US adviser said the recovery of all the bodies could take weeks because of the level of destruction in Gaza.\n\nHe said rewards might be offered for Gazan civilians who gave information and that Turkish experts were expected to join the search.\n\nConfirming the return of two more deceased hostages on Thursday, the IDF said Hayman was 27 when she was killed by Hamas on 7 October 2023 at the Nova festival. Her body was taken into the Gaza Strip.\n\nSgt Maj al-Atresh, who was 39, fell in combat on the same day, the IDF said.\n\nHamas is required to fulfill its part of the agreement and make the necessary efforts to return all the hostages to their families and to a dignified burial, it added.\n\nIn a statement, the Hostages Families Forum said: The families of the hostages and of those released embrace the families of Inbar Hayman and Muhammad al-Atresh, whose loved ones came home yesterday for proper burial in Israel.\n\nAlongside the grief and the understanding that their hearts will never be whole, the return of Inbar and Muhammad, may their memories be a blessing, brings some measure of comfort to families who have lived with agonising uncertainty for over two years.\n\nWe will not rest until all 19 hostages are brought home.\n\nHamas is required to return all 28 dead hostages as part of thefirst phase of the Gaza peace plan.\n\nBut Hamass armed wing said in a statement the remaining bodies require significant efforts and specialised equipment to search for and retrieve, and we are making a great effort to close this file.\n\nEarlier, Israel said it would not compromise on hostage returns, saying the mission is not complete.\n\nIsraels defence minister said he had instructed the IDF to prepare a comprehensive plan to defeat Hamas in Gaza in the event of a renewal of the war.\n\nAfter meeting senior generals on Wednesday, Israel Katz said the military must be prepared to act if Hamas refuses to implement the peace plan.\n\nThe latest repatriations came after Israel said one of four bodies returned by Hamas on Tuesday was not one of the missing hostages.\n\nUN humanitarian chief Tom Fletcherhas urged Israel to immediately open all border crossings into Gazafor humanitarian aid, as called for in the ceasefire plan.\n\nIn a post on X, Fletcher said Hamas must make strenuous efforts to return all the bodies of the deceased hostages.\n\nHe added: As Israel has agreed, they must allow the massive surge of humanitarian aid  thousands of trucks a week  on which so many lives depend, and on which the world has insisted.\n\nHe called for a genuine, practical, problem-solving approach to removing remaining obstacles and said withholding aid from civilians is not a bargaining chip.\n\nTrumps ceasefire plan, which both Israel and Hamas accepted, envisaged the handover of all 48 hostages would be completed by noon on Monday. Hamas returned all the 20 living hostages on Monday.\n\nBut the US-brokered ceasefire agreement appears to acknowledge that Hamas and other Palestinian factions may not have been able to find all hostage remains before the initial deadline on Monday.\n\nUnder the agreement, Israel also agreed to hand over the bodies of 15 Palestinians in return for every deceased Israeli hostage.\n\nSo far, Israel has returned the bodies of 90 Palestinians in exchange for the Israeli hostages remains.\n\nMeanwhile in Gaza, residents report growing concern about the durability of the ceasefire  and food prices have surged as Palestinians stockpile food.\n\nTraders and suppliers in the enclave have been hoarding food items to create shortages and drive up profits, fearing that the war could resume, local residents told the BBC.\n\nEvery time we start to feel safe, new threats appear, and we fear the war will start all over again, says mother-of-six Neven Al-Mughrabi, a displaced resident from Gaza who lives in Khan Younis.\n\nI lost my house in Gaza City, I decided to stay here with my family because I dont trust the ceasefire and were sick of displacement.\n\nShe added that a trader in Khan Youniss main market said demand for flour, oil and sugar had surged within hours. Despite the sudden rise of prices by about 30%, people are buying as if they dont trust the calm will last long, everyone is afraid aid will stop, Neven says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16070756/gaza.webp",
            "description": "<p>BBC The US has downplayed claims that Hamas is violating the ceasefire deal with Israel by not returning all the bodies of dead hostages. Only nine of the 28 dead hostages have been returned, with Hamas saying it needs time and specialised equipment to recover the others from the ruins of Gaza. The latest wo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-plays-downs-claims-hamas-is-violating-ceasefire-deal-over-hostage-remains/\">US plays downs claims Hamas is violating ceasefire deal over hostage remains</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "16 Oct 2025"
        },
        {
            "title": "Zimbabwe reaffirms commitment to gender equality at Global Leaders’ Meeting on Women",
            "url": "https://www.newzimbabwe.com/zimbabwe-reaffirms-commitment-to-gender-equality-at-global-leaders-meeting-on-women/",
            "content": "Xinhua\n\nZimbabwes participation in the Global Leaders Meeting on Women is a testament to its unwavering commitment to advancing gender equality and womens empowerment, a senior government official said Tuesday.\n\nMavis Sibanda, permanent secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, told Xinhua in a written interview that the forum provides a platform for knowledge exchange, enabling Zimbabwe to learn from global best practices in advancing gender equality and womens empowerment, as well as to share its own experiences and innovations.\n\nAccording to Sibanda, the meeting also presents Zimbabwe with an opportunity to further strengthen bilateral and multilateral partnerships in promoting gender equality and womens empowerment.\n\nThis renewed global dialogue provides a platform for nations to reaffirm their dedication to implementing the Beijing Declaration and to advancing the 2030 Agenda for Sustainable Development, particularly Goal 5: Achieve gender equality and empower all women and girls, she said.\n\nZimbabwe is represented at the meeting by Minister of Women Affairs, Community, Small and Medium Enterprises Development Monica Mutsvangwa.\n\nSibanda said the minister highlighted the progress Zimbabwe has made over the years, from establishing gender-responsive institutions and policies that promote womens participation in leadership and decision-making, to investing in womens economic empowerment.\n\nMeasures such as expanding education and training opportunities for girls and young women, and promoting women-owned enterprises through dedicated funding mechanisms and entrepreneurial support programs, were also mentioned, she added.\n\nThese measures demonstrate Zimbabwes commitment to global development frameworks such as the Beijing Platform for Action and the United Nations Sustainable Development Goals, particularly Goal 5, Sibanda said.\n\nSince the adoption of the Beijing Declaration and Platform for Action, Zimbabwe has made substantial progress in implementing its provisions through policy reforms, institutional frameworks, and gender-sensitive programming, she added.\n\nThe global meeting, Sibanda noted, underscores the urgent need for collective international action to close persistent gender gaps and ensure that women are placed at the center of sustainable development efforts.\n\nIt further highlights the importance of international cooperation in formulating and implementing policies that empower women politically, socially and economically across all regions, she said.\n\nSibanda added that the global meeting holds profound significance as it marks the 30th anniversary of the landmark 1995 Fourth World Conference on Women in Beijing.\n\nThe conference, she said, laid the groundwork for the global advancement of gender equality and womens rights through the Beijing Declaration and Platform for Action, which continues to serve as a key guiding framework for gender equality initiatives worldwide.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16065506/monica.jpeg",
            "description": "<p>Xinhua Zimbabwe’s participation in the Global Leaders’ Meeting on Women is a testament to its unwavering commitment to advancing gender equality and women’s empowerment, a senior government official said Tuesday. Mavis Sibanda, permanent secretary in the Ministry of Women Affairs, Community, Small and Medium Enterprises Development, told Xinhua in a written interview that “the forum</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-reaffirms-commitment-to-gender-equality-at-global-leaders-meeting-on-women/\">Zimbabwe reaffirms commitment to gender equality at Global Leaders’ Meeting on Women</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "16 Oct 2025"
        },
        {
            "title": "DNC bus accident: Police want owner of medication found at crash scene to come forward",
            "url": "https://www.newzimbabwe.com/dnc-bus-accident-police-want-owner-of-medication-found-at-crash-scene-to-come-forward/",
            "content": "IOL\n\nThe South African Police Service (SAPS) in Limpopo has launched an official inquiry following the discovery of bottles appearing to be medication atthe site of the horrific bus crash on the N1 freeway near Makhado, which killed 43 people on Sunday.\n\nThe provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, confirmed that an inquiry docket has been opened by Makhado police in the Vhembe district to investigate the discovery. The bottles of medication were found on the accident scene, a few kilometres outside Makhado.\n\nThe inquiry comes as police explore potential contraventions of the countrys drug laws. According to the SAPS statement, Section 22A of the Medicines and Related Substances Act in South Africa makes it a crime to possess certain scheduled medicines without proper authorization.\n\nProvincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe. Image: SAPS\n\nLegally, someone is only permitted to possess and carry the quantity of medicine you have been prescribed by an authorized prescriber. Carrying a large quantity of medicine without exception is illegal, provincial police spokesperson, Colonel Malesela Ledwaba said.\n\nWhile the lawful owner of the medication has not yet been identified, police are treating the find seriously as their investigation into the cause of the fatal crash continues.\n\nThe tragedy occurred on Sunday, October 13, when a cross-border bus, reportedly travelling from Gqeberha to Zimbabwe and Malawi, veered off the mountainous road on the N1 and plunged down an embankment. The death toll rose to 43, with scores of other passengers injured.\n\nAlthough for now the lawful owner of the bottles of medication is not yet identified to get the explanation regarding its origin, the police have, in the meantime, opened an inquiry for further investigation, said Ledwaba.\n\nAnyone or the lawful owner of the medication is requested to contact the nearest police, call the SAPS toll-free number 08600 10111 or use the My SAPS App.\n\nVisuals seen on television news channels showed bottles of what appears to be BronCleer spewed among the luggage at the crash scene. The images and videos have sparked outrage, with many social media users accusing foreign nationals of looting South Africas health system.\n\nOn Tuesday,IOL reported that health authorities have moved to quash viral social media claims that South Africas public healthcare system is distributing BronCleer, a codeine-based cough syrup, insisting the medication is strictly controlled and only available through private or illegal channels.\n\nThe clarification comes amid a police bust in Kimberley that uncovered a stash of unregistered medicines  including BronCleer  being sold unlawfully by unlicensed operators.\n\nCity of Tshwanes MMC for Health Services, Tshegofatso Mashabela, has dismissed claims circulating on social media about public healthcare facilities in South Africa distributing BronCleer, a codeine-based cough syrup.\n\nMashabela clarified that BronCleer is a controlled substance and not included in the official formularies or procurement lists of any government hospitals or clinics.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL The South African Police Service (SAPS) in Limpopo has launched an official inquiry following the discovery of bottles appearing to be medication at the site of the horrific bus crash on the N1 freeway near Makhado, which killed 43 people on Sunday. The provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe, confirmed that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-accident-police-want-owner-of-medication-found-at-crash-scene-to-come-forward/\">DNC bus accident: Police want owner of medication found at crash scene to come forward</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "16 Oct 2025"
        }
    ]
}