{
    "news": [
        {
            "title": "Alpha Media Holdings challenges remand as editor-in-chief is dragged to court",
            "url": "https://www.newzimbabwe.com/alpha-media-holdings-challenges-remand-as-editor-in-chief-is-dragged-to-court/",
            "content": "By Mary Taruvinga\n\nThe editor-in-chief at Alpha Media Holdings (AMH), Kholwani Nyathi, on Thursday appeared in court representing his employer, charged with undermining the authority of President Emmerson Mnangagwa.\n\nThe company is accused of insulting the president following the publication of a satirical article in its weekly paper, Zimbabwe Independents Muckracker column.\n\nThe same article titled When you become mafia state landed the Zimbabwe Independent editor Faith Zaba in jail recently. She was granted US$200 bail after spending three nights behind bars.\n\nThrough its lawyer Chris Mhike, AMH challenged placement on remand, arguing that the charge does not disclose an offence.\n\nMhike said in a democratic state, one cannot be arrested for expressing his or her opinion where there is freedom of the media and expression.\n\nThe arrest amounts to restrictions of the right of access to information.\n\nThe disregard of fundamental rights of the accused amount to violation of principle of democracy, he said.\n\nThe lawyer said when the company is placed on remand the state has restricted it from performing its duties to inform the public which is its mandate.\n\nJournalism is not a crime, by placing the company on remand means criminalisation of journalism.\n\nOne consenting to placement on remand means youre admitting to committing the offence, Mhike said.\n\nTakudzwa Jambawu representing the state said there is reasonable suspicion that an offence was committed.\n\nHe said it is not in dispute that Mnangagwa is the current SADC chairperson and the words contained in the article were insulting his authority.\n\nAccording to the state on June 7 2025 accused through the Zimbabwe Independent newspaper edition of 27 June 2025 to 3 July 2025 published an article titled When you become mafia state, intending to undermine the authority of the President by saying: In less than two months, our one year rotating chairmanship of SADC comes to an end and we hope it is not just Muckraker, who has not seen any value that our time in that important role has added to the regional bloc apart from just confirming the obvious fears that SADC is a mere trade union of dictators.\n\nIn the few months that we have been in that role, we have been implicated in the chaos that has rocked most neighbouring countries. We were implicated in the massive vote rigging in Mozambican elections-with proof that our people actually voted for Daniel Chapo in an election in whose disputed outcome resulted in the death of hundreds of people. We were also fingered in the elections in Botswana and Namibia, where our electoral rigging machinery was heavily deployed.\n\nWhen you have become a mafia state, and are known to arm fellow criminals from around the globe with your diplomatic passports, it has become very hard to stop your people from believing just anything.\n\nThere is certainly no doubt who is micro Managing this Chapo chap, so there is not even any need to wonder what our Owner thought when his boy was addressing a virtually empty stadium very soon the boy would have developed a thick skin, just hike his handler who no longer needs to do anything under the cover of the darkness. That is what happens when you become the head of a mafia state.  It is a government that came into power through a coup and is only obsessed with keeping itself in power hence the creation of demons such as the Tshabangus and the like, themselves creations of courts whose top judges are themselves appointed -and kept on  the bench via political chicanery, all to serve the purpose of keeping this criminal enterprise masquerading as a government in power.\n\nThe state alleges that the accused attached a photograph of President Emerson Dambudzo Mnangagwa and Mozambican President Daniel Chapo.\n\nThe state alleges the article was false in material and was designed to engender feelings of hostility by the citizens of Zimbabwe towards the President.\n\nHearing continues Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10193920/kholwani.jpg",
            "description": "<p>By Mary Taruvinga  The editor-in-chief at Alpha Media Holdings (AMH), Kholwani Nyathi, on Thursday appeared in court representing his employer, charged with undermining the authority of President Emmerson Mnangagwa. The company is accused of insulting the president following the publication of a satirical article in its weekly paper, Zimbabwe Independent’s Muckracker column. The same article</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/alpha-media-holdings-challenges-remand-as-editor-in-chief-is-dragged-to-court/\">Alpha Media Holdings challenges remand as editor-in-chief is dragged to court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Olympic champ Semenya did not get a fair hearing in sex eligibility case, human rights court rules",
            "url": "https://www.newzimbabwe.com/olympic-champ-semenya-did-not-get-a-fair-hearing-in-sex-eligibility-case-human-rights-court-rules/",
            "content": "AP\n\nTwo-time Olympic champion runner Caster Semenya won a partial victory at the European Court of Human Rights on Thursday in her seven-year legal fight against track and fields sex eligibility rules.\n\nThe courts 17-judge highest chambersaid in a 15-2 votethat Semenya had some of her rights to a fair hearing violated at Switzerlands Supreme Court,where she had appealedagainst a ruling by the Court of Arbitration for Sport in favor of tracks World Athletics.\n\nHowever, the court declined to rule on several other aspects of Semenyas case, including on the question of whether she was discriminated against in Swiss courts. The European court in Strasbourg, France, said those issues were outside Switzerlands jurisdiction, although four of the 17 judges gave a partial dissent to the majority view.\n\nSemenyas case should now go back to the Swiss federal court in Lausanne. It will be watched closely by other sports which have passed or are reviewing their own rules on eligibility in womens events.\n\nSemenya laterposted on social mediaa photo of herself in the court chamber with a message a three raised fists symbolizing her fight for justice.\n\nToday, my patience in this journey has been rewarded with a result that will pave the way for all athletes human rights to be protected, she said in a statement.\n\nThe original case between Semenya and tracks governing body based in Monaco was about whether athletes like her  who have specific medical conditions, a typical male chromosome pattern and naturally high testosterone levels  should be allowed to compete freely in womens sports.\n\nThe European courts ruling does not overturn the World Athletics rules that effectively ended Semenyas career running the 800 meters after she won two Olympic and three world titles since emerging on the global stage as a teenager in 2009.\n\nThe judges also did not take up other aspects of the appeal filed by Semenya, who was in court to hear their judgment read. It awarded her 80,000 euros ($94,000) from the state of Switzerland in respect of costs and expenses.\n\nThe key legal point in Semenyas win was that the Swiss Federal Court had not carried out a rigorous judicial review. This was required because Semenya had no choice but to pursue her case through the CASs mandatory and exclusive jurisdiction. the Strasbourg judges ruled.\n\nGoverning bodies of sports oblige athletes and national federations to take their disputes to the sports court in the International Olympic Committees home city Lausanne.\n\nThe court considered, however, that the Federal Supreme Courts review had fallen short of that requirement, it said in a statement.\n\nIn dismissing other elements of the South African runners case, including if she had been discriminated against, the court judged it did not fall within Switzerlands jurisdiction in respect of those complaints.\n\nWorld Athletics, led by its president Sebastian Coe, has said its rules maintain fairness because Semenya has an unfair, male-like athletic advantage from her higher testosterone. Semenya argues her testosterone is a genetic gift.\n\nWorld Athletics and CAS did not immediately respond to the ruling. The IOC declined to comment on a case it is not directly involved in.\n\nThursdays win followed a legal victory from the same court two years ago for Semenya.\n\nThat judgment which said she had faced discrimination opened a way for the Swiss supreme court to reconsider its decision to dismiss her appeal against the CAS verdict in favor of World Athletics.\n\nAt CAS in 2019, three judges ruled 2-1 that discrimination against Semenya was necessary, reasonable and proportionate to maintain fairness in womens track events.\n\nWorld Athletics drew up its rules in 2018 forcing Semenya and other female athletes with Differences in Sex Development to suppress their testosterone to be eligible for international womens events.\n\nFour of the 17 judges filed a partial dissent to the majority opinion, arguing their court should have been able to pronounce on substantive conclusions reached by the CAS that went against Semenya.\n\nWorld Athletics eligibility rules specifically targeted the applicant, since they concerned only the events in which she competed  indeed, the fact that they amounted to a kind of lex Semenya clearly demonstrates the arbitrariness of those regulations as a whole, the four judges wrote.\n\nWe are disappointed that her expectations have not been met, said the dissenting judges, who included the chamber president, Marko Bonjak from Slovenia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10191357/semenya.webp",
            "description": "<p>AP  Two-time Olympic champion runner Caster Semenya won a partial victory at the European Court of Human Rights on Thursday in her seven-year legal fight against track and field’s sex eligibility rules. The court’s 17-judge highest chamber said in a 15-2 vote that Semenya had some of her rights to a fair hearing violated at Switzerland’s Supreme</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/olympic-champ-semenya-did-not-get-a-fair-hearing-in-sex-eligibility-case-human-rights-court-rules/\">Olympic champ Semenya did not get a fair hearing in sex eligibility case, human rights court rules</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid",
            "url": "https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/",
            "content": "By Costa Nkomo\n\nThe cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed.\n\nThe Treasury confirmed in Parliament that the project cost a total of US$114 million  an increase of US$26 million.\n\nWhen questions were raised about the projects cost, the government was quick to attribute the increase to the relocation of families who had been settled close to the project site.\n\nExperts have, however, drawn comparisons with regional markets such as South Africa and Botswana, where constructing a similar project would typically cost around US$45 million.\n\nWhile many are still trying to make sense of the initial US$88 million figure, Finance Minister Professor Mthuli Ncube further shocked lawmakers by revealing during a Question and Answer session in Parliament on Wednesday that the project had actually consumed an additional US$26 million, not included in the original budget.\n\nEmakhandeni-Luveve MP Decent Bajila raised the issue in Parliament, requesting that Ncube clarify the full cost of the Trabablas Interchange.\n\nI asked the Minister of Finance, Economic Development and Investment Promotion to brief the House on the total cost of the Trabablas Interchange Project and to clarify whether the funding source was a loan from the private sector or the International Monetary Funds (IMFs) Special Drawing Rights facility, Bajila said.\n\nResponding, Ncube said: The cost of Trabablas Interchange was driven by our initial loan arrangement of the order of US$88 million, which was provided by the Consortium of Contractors. In terms of what we used from the Special Drawing Rights, we were required to pay a deposit of US$26 million. So, we used US$26 million from the SDRs to pay that deposit and then the rest was structured as a loan from that US$88 million arrangement.\n\nBajila followed up, asking whether the US$26 million was part of the US$88 million total, to which Ncube responded that it was not.\n\nThe US$26 million is in addition, but it was a requirement for accessing the US$88 million that we pay that deposit to access that facility. We think that was a very good arrangement indeed because we have been able to complete the piece of infrastructure, said Ncube.\n\nDangamvura Chikanga MP Prosper Mutseyami then pressed Ncube for an explanation on what had caused the additional US$26 million in project costs.\n\nMay the Hon. Minister explain to the House as to what caused the additional US$26 million, bearing in mind that the US$88 million had been budgeted to cover the whole construction of the interchange, he asked.\n\nNcube attributed the extra cost to the relocation of residents living near the construction site.\n\nThe cost of relocating, for example, relocating some of the residents that we relocated to create space, for developing this piece of infrastructure. There were some unexpected escalations of that cost, which then pushed us towards increasing the budget by another US$26 million that I have referred to, Ncube said.\n\nMutseyami was not satisfied and posed another follow-up question.\n\nCan you substantiate to the House as to how this supplementary US$26 million would just come about when the budget had already been sorted, then we have extra figures for the situation of adding US$26 million? How do you account that Hon. Minister?\n\nIn response, Ncube said the cost overruns were unforeseen and occurred during the implementation of the project.\n\nKwekwe Mbizo MP Corban Madzivanyika also challenged Ncube, reminding him that the original Trabablas Interchange budget presented to and approved by Parliament did not include the additional US$26 million. He questioned Ncubes authority to spend the extra funds without Parliamentary approval.\n\nMinister, you came and paid another additional US$26 million outside Parliament, where did you get that power to do such? Madzivanyika queried.\n\nHowever, Ncube insisted that, as Finance Minister, he is empowered to handle project budget overruns.\n\nOne did not have to come back to Parliament to be able to exercise the powers that Parliament and the Executive have already awarded or extended to me as Minister of Finance, he responded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10165407/trabablas.jpg",
            "description": "<p>By Costa Nkomo The cost of constructing the recently commissioned Trabablas Interchange in Harare was beyond the US$88 million initially communicated and budgeted for, Treasury has revealed. The Treasury confirmed in Parliament that the project cost a total of US$114 million – an increase of US$26 million. When questions were raised about the project’s cost,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trabablas-interchange-cost-hits-us114-million-as-treasury-reveals-an-unbudgeted-us26-million-was-paid/\">Trabablas Interchange cost hits US$114 million as Treasury reveals an unbudgeted US$26 million was paid    </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Anti-immigrant activists deny foreigners access to hospitals and clinics in South Africa",
            "url": "https://www.newzimbabwe.com/anti-immigrant-activists-deny-foreigners-access-to-hospitals-and-clinics-in-south-africa/",
            "content": "Medicalbrief\n\nSouth Africa  TheNational Department of Healthhas condemned the action taken by some groups to prevent foreign nationals from accessing essential healthcare services around the country, after campaigners in both Gauteng and KwaZulu-Natal blocked clinic and hospital entry to migrant patients, demanding proof of identity before anyone was allowed in.\n\nThis week, members ofOperation Dudulain Gauteng and of theMarch and Marchmovement in KZN began manning the entrances of government facilities that includedAddington HospitalandGateway Clinicin Durban,RK Khan Hospitalin Chatsworth, andHillbrow Clinicas well asRosettenville Clinic,south of Johannesburg, in a bid to prevent alleged undocumented foreigners from seeking health services.\n\nThe Mercuryreports that they accosted patients at the gate and demanded they show ID documents to confirm they were South African nationals.\n\nIn Rosettenville last week, foreign nationals were barred from the local clinic by the protesters who said they were fed up with the long queues that mostly comprised illegal foreign nationals and who, they added, are placing a strain on the facilitys already stretched resources, reportsKaya959.\n\nThey said the clinic was on the brink of collapse, having already stretched its resources to provide free healthcare  mostly to migrants.\n\nClinic management denied allegations that it was turning people away, saying it was attending to everyone walking into the health facility, reportseNCA. Some patients in the queue said they had been waiting for assistance for a week.\n\nPut SA First\n\nDaily Maverickreports that the various anti-migrant groups broadly fall under the Put South Africa First banner  including Operation Dudula, thePatriotic Alliance(PA) and several smaller community groups.\n\nThe groups are demanding that South Africans be prioritised over undocumented migrants  whom they want deported  for economic opportunities and services, like healthcare, accusing them of burdening the countrys health system to the detriment of locals.\n\nThey demanded proof of our nationalities and denied us access because we are not South Africans. The clinic has our clinic cards because we come here for medical attention, said a young mother who was at the Rosettenville Clinic to have her baby vaccinated.\n\nThe Immigration Act stipulates that only immigration officers and members of theSouth African Police Service(SAPS) have the authority to ask citizens and foreign nationals to produce valid documentation.\n\nAt the Hillbrow Community Clinic, where members of the PA, along with a small group of residents and members of Operation Dudula, denied access to foreign nationals, an off-duty security officer toldDaily Maverickthat the (anti-foreigner) groups that have been coming here are not happy with the matron.\n\nThey feel she is siding with the foreign nationals, and when they came on Friday, some demanded to speak to the clinics provincial manager, he said.\n\nAt the Rosettenville Clinic, where community members stood guard at the gates screening patients, Aneliswa Dutshwa, who spoke on behalf of the local anti-migrant group, claimed South African voters concerns were not being taken seriously by the government.\n\nWe want Immigration and Home Affairs to be visible. We are not taking a break until they are both visible, Dutshwa said.\n\nForeign nationals who were barred from entering the facility said they were also being denied a chance to take their clinic cards so they could seek help elsewhere.\n\nSome said they could afford private healthcare, but, pointed out oneZimbabwean who was at the clinic to collect medication, private health facilities require their clinic cards, with their full medical history. Without their cards they could not go anywhere else.\n\nI would have left already because its clear that they will not allow us in, but I want my clinic card because private health facilities require those. If they can give me my card, I will leave, she said.\n\nOperation Dulula\n\nOperation Dudula, which has vowed to intensify its operations at health centres, has been calling for the deportation of all undocumented foreign nationals since its emergence in mid-2020.\n\nThe groups Zandile Dabula said they would escalate their operations and also call for doctors who are foreign nationals to be replaced with South Africans, even if the foreigners were legally employed.\n\nThe government has condemned the groups and said it would deploy police to maintain peace and enforce the law at the affected facilities.\n\nGauteng police spokesperson Brigadier Brenda Muridili said: These deployments are as and when needed, and should the need arise, the SAPS will respond to its mandate.\n\nIllegal\n\nDepartment of Health spokesperson Foster Mohale said the reports were concerning.\n\nWe have noted with concern these illegal actions, he said, adding that no one has the right to prevent anyone from medical treatment.\n\nEveryone who happens to be in the country is protected by a number number of prescripts, including Section 27 of the constitution, theNational Health Act, and theRefugees Actof 1998.\n\nWhile there were claims that those seeking health services are illegal in the country, and while the department condemns the action of those who enter the country illegally, he said, no one has the right to take the law into their own hands.\n\nGauteng Health MEC Nomantu Nkomo-Ralehoko indicated that her department has begun engaging concerned community-based organisations involved in the campaign, adding that while they noted the concerns by some groups, our Constitution allows everybody to access healthcare services, so it becomes difficult for us to chase people away.\n\nTheSouth African Human Rights Commission(SAHRC) said the rise in complaints from people being turned away from facilities was unlawful, discriminatory, and an infringement on human rights, reportsIOL.\n\nSection 27(1) of the Constitution clearly states that everyone has the right to have access to . services, including reproductive healthcare, it said in a statement.\n\nThe SAHRC has urged health departments and provincial leaders to address critical issues plaguing the sector, like staff shortages, long waiting times, and insufficient bed availability, saying these challenges, compounded by discriminatory practices, exacerbate healthcare inequity in an already strained system.\n\nMeanwhile, theForum for South Africa(FOSA) said the Human Rights Commission is failing in its arguments as it advocates for undocumented migrants to access healthcare services in this country.\n\nThe organisation added that illegal foreign nationals taking advantage of national health services arenot only affecting South Africans, but other legal documented foreign nationals.\n\nThey burden the system while accessing medications earmarked for citizens and documented migrants, said the organisations spokesperson, Tebogo Mashilompane.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>Medicalbrief  South Africa – The National Department of Health has condemned the action taken by some groups to prevent foreign nationals from accessing essential healthcare services around the country, after campaigners in both Gauteng and KwaZulu-Natal blocked clinic and hospital entry to migrant patients, demanding proof of identity before anyone was allowed in. This week, members</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/anti-immigrant-activists-deny-foreigners-access-to-hospitals-and-clinics-in-south-africa/\">Anti-immigrant activists deny foreigners access to hospitals and clinics in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Father Zimbabwe: Parliament demands public holiday in honour of Joshua Nkomo",
            "url": "https://www.newzimbabwe.com/father-zimbabwe-parliament-demands-public-holiday-in-honour-of-joshua-nkomo/",
            "content": "By Staff Reporter\n\nPARLIAMENT has demanded that President Emmerson Mnangagwa declare 1 July a public holiday in honour of the late deputy president Joshua Nkomo.\n\nNkomo, affectionately known as Father Zimbabwe, died on 1 July 1999 due to prostate cancer.\n\nThe revered former ZAPU leader was credited for his selfless contribution to the unity of Zimbabwe after independence.\n\nThis has warranted calls for the day he died to be observed as a public holiday to cement his hero status.\n\nCitizens Coalition for Change (CCC) lawmaker Charles Moyo said in accordance with Public Holidays and Business Prohibition Act,President Mnangagwa should set aside a Joshua Nkomo Day.\n\nWe are who we are today because of selfless leadership, immense contribution, unifying efforts and the peace-making attributes of the late Dr. Joshua Mqabuko Nyongolo Nkomo, our late Vice President, also known as Father Zimbabwe, Umdala Wethu, Chibwechitedza.\n\nIt is in the same vein that I pray that we continue to have peace and unity in this Parliament and our motherland, Zimbabwe. Furthermore, Mr. Speaker, most importantly, is to request His Excellency, the President of Zimbabwe, Dr. E. D. Mnangagwa, who is also our SADC Chair, to declare 1 July of every year as a public holiday through the Public Holidays and Business Prohibition Act [Chapter 10:21], said Moyo.\n\nNkomo is hailed for the role that he played in ending the mass killings of ZAPU supporters in Matebeleland and parts of the Midlands by State security agents.\n\nThe Unity accord he signed with Robert Mugabe on 22 December signalled an end to one of the most divisive periods in an independent Zimbabwe.\n\nSpeaker of Parliament Jacob Mudenda acknowledged the receipt of Moyos statement in the National Assembly.\n\nI shall convey that sentiment to His Excellency, the President, as indicated in your statement, said Mudenda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/29115441/Joshua-Nkomo.jpg",
            "description": "<p>By Staff Reporter PARLIAMENT has demanded that President Emmerson Mnangagwa declare 1 July a public holiday in honour of the late deputy president Joshua Nkomo. Nkomo, affectionately known as Father Zimbabwe, died on 1 July 1999 due to prostate cancer. The revered former ZAPU leader was credited for his selfless contribution to the unity of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/father-zimbabwe-parliament-demands-public-holiday-in-honour-of-joshua-nkomo/\">Father Zimbabwe: Parliament demands public holiday in honour of Joshua Nkomo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        },
        {
            "title": "Lithium smuggling rampant as Zimbabwe fails to end corruption",
            "url": "https://www.newzimbabwe.com/lithium-smuggling-rampant-as-zimbabwe-fails-to-end-corruption/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published by theGlobal Press Journal.\n\nHARARE, ZIMBABWE  In 2023, Peter, a truck driver, was approaching a border checkpoint between Zimbabwe and Mozambique. He had little reason to question what was in his trucks sealed container  hed transported shipments for this Chinese-owned company before.\n\nWe just thought everything was in order, he says.\n\nBut rather than chrome, the mineral listed on the containers paperwork, inspectors found raw lithium. By law, unprocessed lithium shouldnt leave Zimbabwe without written permission from the minister of mines and mining development. Peter didnt have that. Border officials impounded the truck and trailer  worth more than US$50,000  for a year. Drape Trucking, the company where Peter works, recovered it after paying a US$5,000 fine.\n\nZimbabwe, which boasts Africas largest lithium reserves, is poised to help meet global demand in the race to secure green energy and develop advanced technology. Its production pales in comparison to powerhouses like Australia and Chile, but the country is still among the top-eight producers of the mineral, producing 1,200 tons in 2021 alone.\n\nBut as demand grows, so does illegal trading. In Zimbabwe, some companies mislabel shipments or underreport the quality and quantity of lithium exports. Border officials  either unaware or complicit  allow the shipments to slip through, undermining efforts to regulate one of Zimbabwes most valuable exports.\n\nPeter asked that Global Press Journal use only his first name, and he did not share the name of the company responsible for the shipping containers contents. He provided the name of the owner of the company, but Global Press Journal was not able to verify the involvement of anyone by that name in the industry.\n\nTendai, a former border agent, says hes accepted bribes to allow lithium shipments to pass through the border. Tendai confirmed the incident involving Peter and says he was arrested and fined for his role. Like many other sources who spoke to Global Press Journal for this article, he asked not to use his full name for fear of losing his job.\n\nIn 2022, Zimbabwe banned the export of raw lithium to curb smuggling and extract more value, since the law would force mining companies to process lithium domestically. Since then, some of the largest lithium mining companies in the country, such as Arcadia and Bikita Minerals, have set up processing operations.\n\nData on whether these regulations have generated more revenue is hard to find. Official records show that the countrys lithium production capacity surged by 230% between 2022 and 2023. Most of the product ends up in China, which controls 90% of Zimbabwes mining sector. Even so, the ban has done little to contain lithium smuggling across Zimbabwes porous borders.\n\nThe regulations are ineffective, says Gorden Moyo, director of the Public Policy and Research Institute of Zimbabwe. Officials, including members of security services, who collude with politicians and foreign governments, particularly China, facilitate illegal exports, he says.\n\nNomsa Jane Moyo, the general manager at the Minerals Marketing Corporation of Zimbabwe, a parastatal group that inspects exports, says the organization closely monitors mining at all stages to ensure that companies export the quantities and qualities they declare. They intercept those who skirt the law, she says.\n\nThe government seized 22 lithium shipments in 2023 and 23 in 2024. Some were seized before reaching the borders; others were flagged by officials at the Forbes border post, between Zimbabwe and Mozambique, and the Beitbridge border post, between Zimbabwe and South Africa.\n\nA sign marks the entrance to Prospect Lithium Zimbabwes processing plant in Goromonzi. Despite government efforts to curb smuggling, former border officials say companies conceal high-grade lithium and bribe authorities to export unprocessed minerals. Most of the countrys lithium ends up in China and Hong Kong. Credit: Linda Mujuru, GPJ Zimbabwe\n\nAccording to the Minerals Marketing Corporation, in 2023, the country sold a total of 769,086 metric tons of lithium, valued at US$794 million and produced by two main lithium mining companies, Prospect Lithium Zimbabwe and Bikita Minerals. Two-thirds of these minerals went to either China (59%) or Hong Kong (7%), according to United Nations trade data.\n\nBut these figures dont reflect the true volume of lithium leaving Zimbabwe, says Tendai, the former border agent. Lithium export permits are issued with a fixed limit for how much a company can export, so companies often underreport, he says.\n\nIt all starts at the mines, where officials claim to closely monitor activities, says Tatenda, an employee at Prospect Lithium Zimbabwe who asked that Global Press Journal use only his first name for fear of losing his job.\n\nTatenda says the company undervalues high grades of lithium. And while the ministry of mines carries out inspections, he says, the high-quality lithium is concealed beneath lower-value ore to mislead inspectors.\n\nGlobal Press Journal made several attempts to speak to Prospect Lithium Zimbabwe. Officials indicated that they would comment but did not respond to subsequent requests.\n\nNomsa Jane Moyo, from the Minerals Marketing Corporation, says the lithium quality tests theyve carried out at Prospect Lithium Zimbabwe meet all legal requirements.\n\nTendai, the former border agent, says the mining companies sometimes bypass shipment records by bribing not only border officials but also officers from the Zimbabwe Revenue Authority or the Minerals Marketing Corporation of Zimbabwe and others within the export chain.\n\nThe Zimbabwe Revenue Authority did not respond to multiple requests for an interview, and Nomsa Jane Moyo did not respond to allegations of corruption within the Minerals Marketing Corporation.\n\nCorruption facilitates smuggling, but some border officials dont always know what theyre inspecting, says Levious Chiukira, a customs and trade consultant at Gleam Customs and Clearing Agency.\n\nI worked as a customs official for years, yet I cannot differentiate between petalite and lepidolite, both of which are forms of lithium, he says. [The revenue authority] does not employ geologists, and there is no institutional capacity to address this knowledge gap.\n\nPiles of lithium at a mine in Mutoko. Zimbabwe banned the export of unprocessed lithium in 2022, but weak enforcement and corruption have allowed smuggling to continue. Credit: Linda Mujuru, GPJ Zimbabwe\n\nExporters exploit the regulatory gaps, Gorden Moyo says. While corruption is punishable by law in China, when they operate abroad, they act with impunity.\n\nThe government hasnt helped. Contracts between the state and investors are not accessible to the public, according to a report by the Africa Policy Research Institute. It erodes public trust, says Tafara Chiremba, an environmentalist at the Zimbabwe Environmental Lawyers Association.\n\nBecause of the smuggling, Chiremba says, its China, not Zimbabwe, that benefits from the countrys wealth of lithium.\n\nLinda Mujuruis a Reporter-in-Residence based in Harare, Zimbabwe. A renowned international reporter and public speaker, she has spent nearly a decade covering human rights, the mining sector, the economy, and public health. She holds an MBA from Midlands State University and both masters and bachelors degrees in Journalism and Media Studies from the National University of Science and Technology in Zimbabwe. Linda is one of Global Presss most widely read and syndicated journalists. In 2023, she won the Community Champion Award from the Institute for Nonprofit News for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09211731/01_GPJNews_Zimbabwe_LM_LithiumSmuggling_42_L.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by the Global Press Journal. HARARE, ZIMBABWE — In 2023, Peter, a truck driver, was approaching a border checkpoint between Zimbabwe and Mozambique. He had little reason to question what was in his truck’s sealed container — he’d transported shipments for this Chinese-owned company before.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lithium-smuggling-rampant-as-zimbabwe-fails-to-end-corruption/\">Lithium smuggling rampant as Zimbabwe fails to end corruption</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "10 Jul 2025"
        }
    ]
}