{
    "news": [
        {
            "title": "Journalist Blessed Mhlanga to spend two more nights in jail as bail ruling is deferred to February 27",
            "url": "https://www.newzimbabwe.com/journalist-blessed-mhlanga-to-spend-two-more-nights-in-jail-as-bail-ruling-is-deferred-to-february-27/",
            "content": "By Mary Taruvinga\n\nAlpha Media Holdings (AMH ) journalist Blessed Mhlanga who is being accused of transmission of information that incites violence or causes damage to property will spend two more nights in custody after his bail ruling was deferred to this Thursday.\n\nMhlanga was arrested on Monday after he presented himself at Harare Central Police Station in the company of his lawyer Chris Mhike.\n\nHe is charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23.\n\nThe charges relate to him granting an interview to Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza had issued press briefings through AMH broadcaster, HSTv calling for President Emmerson Mnangagwa to resign from office immediately.\n\nThe state represented by Ruvimbo Matyatya opposed his bail submitting that Mhlanga was likely to interfere with witnesses who include his junior subordinates.\n\nMhlangas lawyer urged the court to grant him bail arguing that journalism is not a crime.\n\nIf practicing journalism is deemed to be dangerous then we have a problem that must be rectified by the justice delivery system and those who wield power in this nation.\n\nZimbabwe defines itself as a democratic Republic under section 1 of the Constitution.\n\nMy client wants his day in court to prove his innocence although the investigating officer has promised fire and trouble for HSTV the accused is ready to exonerate himself through trial, said Mhike.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25145039/WhatsApp-Image-2025-02-25-at-16.28.01.jpeg",
            "description": "<p>By Mary Taruvinga Alpha Media Holdings (AMH ) journalist Blessed Mhlanga who is being accused of transmission of information that incites violence or causes damage to property will spend two more nights in custody after his bail ruling was deferred to this Thursday. Mhlanga was arrested on Monday after he presented himself at Harare Central</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-blessed-mhlanga-to-spend-two-more-nights-in-jail-as-bail-ruling-is-deferred-to-february-27/\">Journalist Blessed Mhlanga to spend two more nights in jail as bail ruling is deferred to February 27</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Zimbabwe firms brace for hyperinflation accounting under ZiG",
            "url": "https://www.newzimbabwe.com/zimbabwe-firms-brace-for-hyperinflation-accounting-under-zig/",
            "content": "Bloomberg\n\nZimbabwes market regulator is seeking clarity from the central bank on new rules that would require companies to report their financial statements in the nations gold-backed currency, forcing them to adopt hyperinflationary accounting and increase the cost of doing business.\n\nThe Securities and Exchange Commission, is engaged with the relevant authorities on the way forward, Justin Bgoni, the Zimbabwe Stock Exchange s chief executive officer, said Monday.\n\nGovernor John Mushayavanhu earlier this month ordered companies listed on the exchange to adopt the ZiG, short for Zimbabwe Gold, for reporting purposes with immediate effect including for the 2024 audited financial statements. This requirement is consistent with the increase in the number and value of transactions settled in ZiG since its introduction on April 5, he said. The ZiG is used in 30% of all transactions in the economy with the remainder done in US dollars.\n\nSince 2023 companies listed on the exchange have been allowed to report their results in US dollars because of the currencys dominance in the economy and frequent collapse of the Zimbabwean dollar, which was replaced by the ZiG. Many companies, including blue-chip beverage manufacturer Delta Corp, have switched.\n\nZSE-listed FBC Holdings warned the move could have several negative consequences. It may introduce accounting complexities, inflation translation risks, investor concerns and regulatory challenges, the Harare-based lender said in a recent client note.\n\nIt will also require companies to adjust accounting software, financial models and auditing procedures and the application of IAS 29  financial reporting in hyperinflationary economies  guidelines, leading to frequent revaluations, it said.\n\nIt urged authorities to rethink their position. Given that the ZiG has demonstrated instabilities in the past, a hybrid approach where businesses can choose the most relevant currency would be more practical, FBCH said.\n\nThe ZiG is the nations sixth attempt at a functioning local currency since 2009. It has shed 95% of its value since its debut, amid exchange-rate volatility that forced authorities to devalue the currency in September.\n\nThe southern African nations difficult operating environment recently led to the exit of global accounting firms Deloitte LLP and PwC LLP.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Zimbabwe’s market regulator is seeking clarity from the central bank on new rules that would require companies to report their financial statements in the nation’s gold-backed currency, forcing them to adopt hyperinflationary accounting and increase the cost of doing business. The Securities and Exchange Commission, is “engaged” with the relevant authorities on the way</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-firms-brace-for-hyperinflation-accounting-under-zig/\">Zimbabwe firms brace for hyperinflation accounting under ZiG</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "HSTv’s Mhlanga complains about inhumane treatment by police officers; state opposes bail says he will interfere with witnesses who are his juniors at work",
            "url": "https://www.newzimbabwe.com/hstvs-mhlanga-complains-about-inhumane-treatment-by-police-officers-state-opposes-bail-says-he-will-interfere-with-witnesses-who-are-his-juniors-at-work/",
            "content": "By Staff Reporter\n\nThe lawyer representingAlpha Media Holdings (AMH ) journalist, Blessed Mhlanga who is being accused of transmission of information that incites violence or causes damage to property complained that the police have been unprofessional in the manner in which they handled his clients matter.\n\nMhlanga was arrested on Mondayafter he presented himself at Harare Central Police Station in the company of his lawyer Chris Mhike.He ischarged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23.\n\nThe charges relate to him granting an interview to Blessed Geza, a war veteran and a staunch opponent of the Mnangagwa 2030 agenda.\n\nGeza had issued press briefings throughAMH broadcaster, HSTv calling for President Emmerson Mnangagwa to resign from officeimmediately. Mhlanga is the head of HSTv.\n\nMy client was invited to the police station thrice over the past four weeks with the police indicating that they wanted to have talks with him and on each occasion ,they released him indicating that they did not have any case against him.\n\nWhen we knew through the police about the polices intention my client walked in freely to the police and police read out the whole process of interviewing him and other relevant paperwork.\n\nBy lunchtime they were complete they should have taken the accused to court but alas, police decided to detain him till today, said Chris Mhike representing Mhlanga.\n\nThe cells at Harare Central Police Station are in a sorry state with ceilings hanging down.\n\nOur police does not provide inmates with food or water and inmates have normalised sleeping on a dry floor in this jurisdiction.\n\nThat is inhumane treatment. This conduct by the police has been sanitised by the NPA, every police report should be vetted properly.\n\nThe State said they need 72 hours to investigate the alleged complaints.\n\nThe court ordered it to investigate the complaints and revert with its findings within 72 hours.\n\nProsecutors said its witnesses are his junior colleagues.\n\nSome of them are yet to be recorded statements by the police\n\nInvestigations are still ongoing If the accused is granted bail, he will interferewith witnesses.\n\nThe prosecutor further said, There is a likelihood that he will commit similar offences, the same machinery which he used in the present case before the court are yet to be recovered by the police, procedures to recover same have commenced.\n\nMhike shot back saying The state has failed to make a valid legal point against the granting of bail.\n\nIf the prosecution had established that the accused person was previously on remand that would constitute compelling reasons.\n\nThe reasons are unfounded and groundless.\n\nMy sister (prosecutor) made a strange comparison that because he is a political reporter he therefore is a politician. We now see the politicisation of journalism.\n\nMhike also said, Silencing journalists is not part of law.\n\nMay the court be told that the so-called juniors have been visiting the accused in solidarity.\n\nIf the state thought they are dangerous they would have taken measures to reduce the visits.\n\nAccused is a journalist whose job is to gather news and disseminate the news.\n\nSection 61 of our Constitution speaks to freedom of expression and freedom of the media.\n\nWhat happened to press freedom in this country? I am pained that I am standing in court defending a journalists right to freedom of expression.\n\nThe last point is that the accused did not do this once but twice, yes he didnt do it twice but many times. It is his job.\n\nWhether you agree with what Geza said, the public is entitled to hear it. Its not my client who put these statements to the public.\n\nI pray that the court makes a finding that on the law the state has failed to find compelling reasons to detain my clients.\n\nThe hearing is ongoing, Josphat Chitambira arresting detail attached to CID Counter Terrorism Unit now testifying opposing bail\n\nFirstly, the witnesses we have lined up are the accuseds workmates, he is senior to them out of fear is that he will influence them and it is prejudicial.\n\nWe have 10 witnesses whom we intend to interview, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24145559/blessed.jpeg",
            "description": "<p>By Staff Reporter The lawyer representing Alpha Media Holdings (AMH ) journalist, Blessed Mhlanga who is being accused of transmission of information that incites violence or causes damage to property complained that the police have been unprofessional in the manner in which they handled his client’s matter. Mhlanga was arrested on Monday after he presented himself at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hstvs-mhlanga-complains-about-inhumane-treatment-by-police-officers-state-opposes-bail-says-he-will-interfere-with-witnesses-who-are-his-juniors-at-work/\">HSTv’s Mhlanga complains about inhumane treatment by police officers; state opposes bail says he will interfere with witnesses who are his juniors at work</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "How SoftOrbits’ AI Photo Editor helps professional photographers gain a competitive edge",
            "url": "https://www.newzimbabwe.com/how-softorbits-ai-photo-editor-helps-professional-photographers-gain-a-competitive-edge/",
            "content": "SoftOrbits, a software development company founded in 2006 by Eugene Ustinenkov, focuses on building utilities that help photography enthusiasts deal with tedious and difficult technical tasks like format conversion or stamp removal. Starting as a small team of software experts, SoftOrbits has evolved into one of the leading niche companies with over 300,000 users and more than 1,000,000 yearly downloads.\n\nWhile the team initially prioritized small-scale software designed for amateurs with no technical photography background, its recent introduction of AI features to the Image Editor has gained a lot of traction with professionals. According toSoftOrbits internal data,experts account for over a quarterof the softwares total user base.\n\nEugene Ustinenkov, CEO of SoftOrbits and AlarmFront\n\nI think these numbers may seem a bit unexpected  they certainly were for us at first. However, theyre quite telling of the current state of the industry. Experts no longer view AI as a gimmick, and you can see it everywhere: from the Coca-Cola AI advertisements to AI usage in movie production by Marvel. Were no longer on the verge of living in a world with AI-generated content as the standard  were already here,says Eugene Ustinenkov, CEO of SoftOrbits and AlarmFront.\n\nAs Eugene Ustinenkov admits, initially AI Photo Editor was aimed at marketing teams and content creators, as well as general users, addressing their need for quick and simple solutions to common issues with images and photos: from quickly removing backgrounds and objects to fixing the lighting. From a few conversations with customers, it turned out that the speed the AI tool provides has become its major selling point even for professional photographers.\n\nWe can see how there is almost no way a pro can compete with these tools when it comes to speed, so a lot of photographers start integrating AI into their workflow. Most of the experts weve spoken to say that new customers expect different timeframes, so you either adapt or get left out. AI Photo Editor comes in handy here, because it isnt about generating images  photographers arent particularly enthusiastic about this  but because it helps deal with repetitive and time-consuming tasks,says Eugene Ustinenkov, CEO of SoftOrbits and Candidate of Technical Sciences.\n\nThe current version of SoftOrbits AI Photo Editor supports images with up to 8K resolution, provides multi-format export capabilities, and offers RAW file support. It is most commonly used to change the lighting, enhance portraits, remove objects, manipulate backgrounds, and apply special effects, but thats not the full extent of its capabilities.\n\nRecently, SoftOrbits introduced a prompt-based photo editing feature, which means that the tools possibilities are only limited by the users imagination. As Eugene explains, it is this functionality that became one of the selling points for the software even among professionals.\n\nThe industry inevitably gravitates toward greater AI adoption, and you can see so many startups offering AI-based photo editing, leaving less and less market space for traditional approaches. It doesnt mean that experts will get replaced  as long as they keep up with the technology and find ways to seamlessly integrate it to provide a better service, everyone wins, says Eugene Ustinenkov, CEO of SoftOrbits with 10+ years of software development experience.\n\nThe AI trend has affected SoftOrbits as well: This year, the team has integrated the technology into seven of their utilities, and right now, it helps SoftOrbits users with unblurring images, denoising photos, removing watermarks, and more. The team doesnt intend to stop here and already has plans to integrate AI into other solutions, focusing on increasing user-friendliness, speed, and simplicity of use.\n\nWith the recent increase in popularity of SoftOrbits tools among professionals, the team is focused on not only adding extra AI features but also increasing the softwares general availability by switching to a SaaS model of distribution.\n\nHannes Jansen\n\nSaaS was one of our goals for the past few years, but we were mostly focused on other aspects of our companys work. Now we see that this has become a priority  removing hardware requirements and ensuring instant global access is becoming an industry standard. We already provide SaaS solutions to our corporate partners, but the goal is to reach our everyday users as well  and we will achieve it soon enough,says Hannes Jansen, writer and editor at SoftOrbits.\n\nWhether youre a client interested in SoftOrbits products or a business owner willing to partner with the team, you can reach out atsupport@softorbits.comor visitsoftorbits.net.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25071007/SoftOrbits-PR-Header.png",
            "description": "<p>SoftOrbits, a software development company founded in 2006 by Eugene Ustinenkov, focuses on building utilities that help photography enthusiasts deal with tedious and difficult technical tasks like format conversion or stamp removal. Starting as a small team of software experts, SoftOrbits has evolved into one of the leading niche companies with over 300,000 users and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-softorbits-ai-photo-editor-helps-professional-photographers-gain-a-competitive-edge/\">How SoftOrbits’ AI Photo Editor helps professional photographers gain a competitive edge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Breast cancer diagnoses and deaths expected to surge worldwide, says WHO",
            "url": "https://www.newzimbabwe.com/breast-cancer-diagnoses-and-deaths-expected-to-surge-worldwide-says-who/",
            "content": "The Guardian\n\nBreast cancer diagnoses and deaths are projected to surge worldwide by 2050, the World Health Organizations cancer agency has said, with cases in the UK to rise by 21% and deaths by 42%.\n\nGlobally, one in 20 women will be diagnosed with the disease in their lifetime, with cases up 38% and deaths up 68% over the next 25 years, according to an analysis by the International Agency for Research onCancer(IARC).\n\nThere will be 3.2m new cases and 1.1m deaths a year worldwide by 2050 if current trends continue, the study found. In the UK, cases are expected to rise from 58,756 cases a year in 2022 to 71,006 cases a year in 2050. Deaths will jump from 12,122 a year in 2022 to 17,261 in 2050.\n\nThe findings werepublished in the journal Nature Medicine.\n\nEvery minute, four women are diagnosed with breast cancer worldwide and one woman dies from the disease, and these statistics are worsening, said the IARC scientist Dr Joanne Kim, one of the authors of the report.\n\nCountries can mitigate or reverse these trends by adopting primary prevention policies  and by investing in early detection and treatment.\n\nThe projected increase in cases worldwide is probably due to a mix of factors, including a growing and ageing global population, improvements in detection and diagnosis, and a higher prevalence of known risk factors for the disease.\n\nFactors that increase the risk of breast cancer include getting older, inherited faulty genes and a family history of the disease.\n\nGlobally, most breast cancer cases and deaths occur in women aged 50 and above, who account for 71% of new cases and 79% of deaths, the IARC said.\n\nAbout a quarter of breast cancer cases can be prevented, the studys authors said, for example by reducing alcohol intake, maintaining a healthy weight and becoming more active.\n\nBreast cancer is the most common form of cancer in women worldwide but its burden is not evenly distributed. The IARC said diagnosis rates were highest in Australia and New Zealand, followed by North America and northern Europe, and lowest in Asia and Africa. However, death rates were highest in Melanesia and Polynesia, and in west Africa.\n\nOver the last decade, incidence rates grew by 1% to 5% a year in 27 of 50 countries studied, the IARC said. Importantly, breast cancer mortality rates decreased in 29 of 46 countries analysed.\n\nDr Isabelle Soerjomataram, the deputy head of the IARCs cancer surveillance branch, said: Continued progress in early diagnosis and improved access to treatment are essential to address the global gap in breast cancer and ensure that the goal of reducing suffering and death from breast cancer is achieved by all countries worldwide.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25043551/Screenshot-2025-02-25-at-06.35.38.png",
            "description": "<p>The Guardian Breast cancer diagnoses and deaths are projected to surge worldwide by 2050, the World Health Organization’s cancer agency has said, with cases in the UK to rise by 21% and deaths by 42%. Globally, one in 20 women will be diagnosed with the disease in their lifetime, with cases up 38% and deaths</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/breast-cancer-diagnoses-and-deaths-expected-to-surge-worldwide-says-who/\">Breast cancer diagnoses and deaths expected to surge worldwide, says WHO</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Injured SANDF troops to be repatriated from DRC conflict zone soon",
            "url": "https://www.newzimbabwe.com/injured-sandf-troops-to-be-repatriated-from-drc-conflict-zone-soon/",
            "content": "IOL\n\nDefence Minister Angie Motshekga says theSA National Defence Force (SANDF) memberswho were injured in the Democratic Republic of Congo (DRC) during a battle with M23 rebels will be back in the country soon.\n\nWe are expecting the injured ones to be back soon, but we are also in direct communication with those who are in the DRC for other missions. As government, we continue to commit ourselves to work with them, she said.\n\nMotshekgaannounced the news on Sunday at the funeral of Rifleman Richard Chokoe, one of the 14 SANDF troops who were killed in armed combat in the DRC.\n\nShe committed the government to looking after the families of the14 fallen SANDFsoldiers.\n\nThe minister also said they would ensure that those who are still on a mission will be assisted at all times.\n\nWe will make sure that families of those who departed are looked after, especially the children. But also, those who are still in the mission, we will work with them and make sure that they get all the necessary support, she said.\n\nThis comes a week after a mission to repatriate more than 100 wounded and unwell SANDF personnel was suspended.\n\nThere are at least 189 soldiers reportedly injured or unwell in the DRC, at least five of whom have been reported badly wounded, and two of whom have been confirmed pregnant.\n\nThese soldiers served in a peacekeeping assignment in Southern Africa and were wounded during clashes with rebel forces.\n\nMotshekga expressed confidence in South Africas relations with other countries, saying there have been good developments and the United Nations (UN) have pronounced themselves on the matter.\n\nWe were at the AU last week, it also pronounced itself on the very same matter. There was a special commission to focus on this and they endorsed the decisions of Tanzania and Zimbabwe.\n\nSo even the two communities, the eastern community and SADC will be meeting soon to monitor implementation of the agreement. Theres a lot of good and positive progress, she said.\n\nMeanwhile, some of the troops were laid to rest last week while others were buried over the weekend in other provinces.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25042632/Screenshot-2025-02-25-at-06.26.17.png",
            "description": "<p>IOL Defence Minister Angie Motshekga says the SA National Defence Force (SANDF) members who were injured in the Democratic Republic of Congo (DRC) during a battle with M23 rebels will be back in the country soon. “We are expecting the injured ones to be back soon, but we are also in direct communication with those who are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/injured-sandf-troops-to-be-repatriated-from-drc-conflict-zone-soon/\">Injured SANDF troops to be repatriated from DRC conflict zone soon</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "US star John Legend defends playing Rwanda concert during war",
            "url": "https://www.newzimbabwe.com/us-star-john-legend-defends-playing-rwanda-concert-during-war/",
            "content": "BBC\n\nAmerican singer-songwriter John Legend has told the BBC he is unfazed by a public backlash against his decision to perform in Rwanda, despite the countrys involvement in the war in neighbouring Democratic Republic of Congo.\n\nI dont believe that we should punish the people of Rwanda and punish the people of other countries when we disagree with their leaders, he said after last weeks concert in Kigali.\n\nIn recent weeks, M23 rebels, backed by Rwanda, have seized the two largest cities in the mineral-rich east of the DR Congo.\n\nThere is evidence Rwanda has sent 4,000 troops across the border to support the rebels.\n\nHundreds of thousands of civilians are now destitute having fled their homes, andshocking violence, including the rape of children, has skyrocketed.\n\nCritics argue that Legend could have made a powerful statement by pulling out of the concert, especially given his highly respected EGOT status as someone who has won Emmy, Grammy, Oscar and Tony awards.\n\nFellow Grammy-winner Tems did pull out of a concert she was due to give on Saturday in Rwanda,saying she would never, ever intend to be insensitive to real-world issues.\n\nBut Legend defended his decision to headline the Move Afrika event in Kigali, which was run by the Global Citizen NGO and attracted thousands of fans from across the continent.\n\nHe said he was not being paid for the performance but felt it was his duty to help grow touring capabilities on the African continent, which is often overlooked by international stars on so-called world tours.\n\nIm aware of whats happening [in DR Congo] and Im aware of the calls there have been for me to not do this show, but I really believe that the mission of Move Afrika is still important, he told the BBC.\n\nDelighted fans at the sold-out show agreed, but the social media backlash was ferocious enough to force Legend to delete an Instagram post he had made promoting the event.\n\nBelgium-based activist Denise Zanesa had argued that performing under the banner of Rwanda would be akin to collaborating with oppression itself,in a message posted to X (formerly Twitter).\n\nIt was a sentiment echoed by others, including Simone Umba in the US, whowrote in a TikTok video caption: So are we ready to talk about Rwandas use of Black American culture in their soft campaigning to normalise their terrorising of eastern Congo?\n\nTaking a political stance would have been nothing new for the star.\n\nLegend is outspoken in his criticism of US President Donald Trump. He also severed ties with former mentor Kanye West when he ran for president, suspecting it was part of a wider Trump campaign tosiphon black peoples votes away from the Democrats.\n\nThe debate over Rwandas relationship with popular global figures is also not new.\n\nMost recently, Rwanda has been accused of sportswashing  with critics saying it uses the feel-good factor of international football to cover up alleged human rights abuses at home.\n\nThe East African nation is said to receive $1bn (800m) a year in foreign aid and its tourism arm  Visit Rwanda  has lucrative sponsorship deals with Arsenal in England, Bayern Munich in Germany and Paris St-Germain in France.\n\nWhen asked his thoughts on the topic, Legends aide told the BBC that he would not answer that question.\n\nIt appears that, as far as Legend and his team are concerned, his music itself should do the talking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/25042111/john-legend.webp",
            "description": "<p>BBC American singer-songwriter John Legend has told the BBC he is unfazed by a public backlash against his decision to perform in Rwanda, despite the country’s involvement in the war in neighbouring Democratic Republic of Congo. “I don’t believe that we should punish the people of Rwanda and punish the people of other countries when</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-star-john-legend-defends-playing-rwanda-concert-during-war/\">US star John Legend defends playing Rwanda concert during war</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Chinese national stashes rhino horns worth US$350,000 in owl sculpture, attempts to smuggle them out of Zim",
            "url": "https://www.newzimbabwe.com/chinese-national-stashes-rhino-horns-worth-us350000-in-owl-sculpture-attempts-to-smuggle-them-out-of-zim/",
            "content": "By Staff Reporter\n\nA Chinese national has been arrested on allegations of attempting to smuggle rhino horns worth US$350,000 out of the country.\n\nThe horns were found stashed in an owl sculpture.\n\nThe suspect is Lin Wang. He will be jointly charged with Cuthbert Maoko, a clearing agent licensed by ZIMRA who is already on remand.\n\nWang is being charged for contravening the Parks and Wildlife Act.\n\nHe was remanded in custody when he appeared before Harare magistrate Isheanesu Matova who advised him to seek bail at the High Court.\n\nAccording to prosecutor Rufaro Chonzi, on 12 September 2024 Wang went to the airport holding a 13-kilogram owl-hardened plastic sculpture to which he intended to facilitate its shipment to China by processing its export papers.\n\nIt is alleged that security officials observed the accused holding the parcel which looked suspicious and alerted other stakeholders.\n\nThe sculpture was put on AGS Scanner and the image was not consistent which prompted the stakeholders to want to verify what was contained therein.\n\nThe sculpture was placed on items held by Zimra on receipt number 029910A on 12 September 2024 awaiting a two months period. After the lapse of the two-month period and on the 20 November 2024, the concerned stakeholders who first witnessed the item being taken into custody by ZIMRA were again summoned to witness the breaking of the sculptor the clearing agent.\n\nWhen the sculpture was broken, it was discovered that there were five rhino horn pieces which were wrapped by a newspaper and tied by a transparent plastic hidden inside.\n\nThe agent implicated the accused as the one who gave him the sculpture which contained the recovered rhino horn pieces.\n\nThe agent called Wang to come to the airport to answer the questions relating to the case but the accused disappeared.\n\nThe five Rhino horn pieces were seized by Zimra on notice of seizure receipt number 024315L.\n\nThe recovered exhibit was conveyed to Zimparks for assaying where it was assayed in the presence of the agent since the accused was on the run and it was found to be five pieces of rhino horns all valued at US$360,000.\n\n*The third paragraph has been edited to clarify that Cuthbert Maoko is not a ZIMRA agent but a clearing agent licensed by the revenue authority.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter A Chinese national has been arrested on allegations of attempting to smuggle rhino horns worth US$350,000 out of the country. The horns were found stashed in an owl sculpture. The suspect is Lin Wang. He will be jointly charged with Cuthbert Maoko, a clearing agent licensed by ZIMRA who is already on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-national-stashes-rhino-horns-worth-us350000-in-owl-sculpture-attempts-to-smuggle-them-out-of-zim/\">Chinese national stashes rhino horns worth US$350,000 in owl sculpture, attempts to smuggle them out of Zim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "SADC countries urged to strengthen cross-border infrastructure to boost regional development",
            "url": "https://www.newzimbabwe.com/sadc-countries-urged-to-strengthen-cross-border-infrastructure-to-boost-regional-development/",
            "content": "Xinhua\n\nSouthern African Development Community (SADC) member states should strengthen cross-border infrastructure to advance regional integration and economic development, a senior SADC official said on Monday.\n\nSpeaking at the SADC ministerial meeting on meteorology, transport, and information and communications technology (ICT) in Harare, Zimbabwes capital, Angele Makombo Ntumba, deputy executive secretary responsible for regional integration of the SADC, said member states should strengthen meteorological cooperation and promote transport and ICT infrastructure development, as these are critical to achieving regional integration and economic prosperity.\n\nNtumba said SADC member states must enhance partnerships with regional and international stakeholders, mobilize financial and technical resources, and work toward harmonizing policies that promote climate resilience, sustainable transport, ICT infrastructure, and economic development.\n\nShe pointed out that the SADC region is facing significant and unprecedented challenges posed by climate change, with extreme weather events, rising temperatures, shifting rainfall patterns, and prolonged droughts increasingly affecting socio-economic stability and sustainable development in the region.\n\nIn this regard, having good roads, an efficient railway system, border posts, good seaports and shipping services, and efficient aviation systems is vital, as this will ensure quick and effective delivery of goods and services, transiting into and within the SADC region, said Ntumba.\n\nThe five-day meeting seeks to review progress on the implementation of programs in the three sectors to promote regional integration.\n\nThe SADC is a 16-member southern African regional bloc whose members include Angola, Botswana, the Comoros, the Democratic Republic of the Congo, Eswatini, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, Seychelles, South Africa, Tanzania, Zambia, and Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/24171341/Angele-Makombo-Ntumba.jpg",
            "description": "<p>Xinhua Southern African Development Community (SADC) member states should strengthen cross-border infrastructure to advance regional integration and economic development, a senior SADC official said on Monday. Speaking at the SADC ministerial meeting on meteorology, transport, and information and communications technology (ICT) in Harare, Zimbabwe’s capital, Angele Makombo N’tumba, deputy executive secretary responsible for regional integration</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-countries-urged-to-strengthen-cross-border-infrastructure-to-boost-regional-development/\">SADC countries urged to strengthen cross-border infrastructure to boost regional development</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        },
        {
            "title": "Avocado exports spur Tanganda revenue to US$25,7 mln",
            "url": "https://www.newzimbabwe.com/avocado-exports-spur-tanganda-revenue-to-us257-mln/",
            "content": "By Alois Vinga\n\nLISTED producer, packer and distributor of tea, Tanganda Tea Companys (TTC) revenue surged to US$25,7 million attributed to strong avocado exports in the just-ended financial year.\n\nPresenting an Annual Report for the year ended September 30 2024, TTC board chairman, Herbert Nkala said revenue during the period significantly improved.\n\nRevenue for the year of US$25,7 million grew by 9% from the prior year of USD23.6 million primarily attributable to an increase in avocado export volumes and the recovery of their selling prices as Covid-19 pandemic restrictions eased.\n\nThe company achieved a profit after tax of US$1.4 million from a loss of US$3.1 million in the previous year, he said.\n\nDuring the period, Avocado production of 3 976 tons grew by 84% over prior year production of 2 156 tons due to the increased maturity profile of the plantations.\n\nThe crops exports grew by 40% to 2 997 tons from 2 148 tons achieved in the prior year. Growth in export volumes was buttressed by the firming of export prices to an average 75 US cents per kg from 44 US per kg cents achieved in the prior year following global easing of Covid-19 imposed restrictions.\n\nThe company sold 60% of its non-exportable secondary grade for oil extraction and to the retail and informal sector, while 40% was unsalable.\n\nIn the ensuing financial year, it is expected that the previously unsalable secondary grades will be channelled towards crude oil extraction.\n\nMacadamia production of 1 626 tons increased by 77% over prior year production of 921 tons. Exports declined by 3% to 1 508 tons from 1551 tons in the previous year, due to logistical issues caused by rescheduled ships, affecting the last consignment of 286 tons.\n\nThe decline in packed tea sales volumes of 7% from 1 873 tons in the prior year to 1 733 tons in this financial year was due to packaging material supply constraints, depressed performance from the traditional formal customers and overall macroeconomic dynamics.\n\nThe operating environment is expected to remain complex, largely influenced by adverse developments on currency and inflation. The effects of the El Nino-induced drought are likely to persist until the next harvesting period in April 2025, added Nkala.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/24214809/Avocado.jpg",
            "description": "<p>By Alois Vinga LISTED producer, packer and distributor of tea, Tanganda Tea Company’s (TTC) revenue surged to US$25,7 million attributed to strong avocado exports in the just-ended financial year. Presenting an Annual Report for the year ended September 30 2024, TTC board chairman, Herbert Nkala said revenue during the period significantly improved. “Revenue for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/avocado-exports-spur-tanganda-revenue-to-us257-mln/\">Avocado exports spur Tanganda revenue to US$25,7 mln</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "25 Feb 2025"
        }
    ]
}