{
    "news": [
        {
            "title": "In Pictures: Business as usual as Geza’s stay away flops",
            "url": "https://www.newzimbabwe.com/in-pictures-business-as-usual-as-gezas-stay-away-flops/",
            "content": "War veteran Blessed Gezas efforts to initiate a nationwide shutdown in Zimbabwe starting Tuesday failed, as the majority of people went about their normal daily routines.\n\nWhile traffic was noticeable, it was not as heavy as usual. Most businesses remained open, with only a few outlets closed.\n\nHere are some images from Harares Central Business District and Mbare.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22155539/Shutdown-flops-6.png",
            "description": "<p>War veteran Blessed Geza’s efforts to initiate a nationwide shutdown in Zimbabwe starting Tuesday failed, as the majority of people went about their normal daily routines. While traffic was noticeable, it was not as heavy as usual. Most businesses remained open, with only a few outlets closed. Here are some images from Harare’s Central Business</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-business-as-usual-as-gezas-stay-away-flops/\">In Pictures: Business as usual as Geza’s stay away flops</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Business as usual in Harare as Geza’s stay away is ignored",
            "url": "https://www.newzimbabwe.com/business-as-usual-in-harare-as-gezas-stay-away-is-ignored/",
            "content": "By Staff Reporter\n\nRESIDENTS of Harare ignored war veteran Blesses Gezas call for a stay away on Tuesday, with most businesses operating as usual.\n\nFrom as early as 5 am, commuter omnibuses were touting for commuters, most of whom are vendors headed to Harares main vegetable market in Mbare.\n\nThere was no indication of any change in Dzivarasekwa Extension, Madokero, Westlea and Warren Park, Waterfalls, Greendale and Chitungwizawhen NewZimbabwe.com toured.\n\nThe same applied in the Central Business District (CBD) and areas such as Westgate, Rugare and the heavily populated Mbare high-density.\n\nWe cannot afford to stay away even if we wanted to, said a vendor in Warren Park who sells cigarettes, chips and soft drinks.\n\nEveryone understands what Geza is saying and agrees with him that only a few are living off Zimbabwes wealth but most of us are not formally employed, we eat what we kill on a daily basis.\n\nIf he intends to have people support his cause, he should take a different approach.\n\nVendors went about their business while most of the supermarkets in town were open.\n\nThe government had earlier warned civil servants not to stay at home and promised punishment for any of them who would choose to respect Gezas call.\n\nZimbabwe Republic Police (ZRP) spokesperson Paul Nyathi assured citizens and exhibitors at the ongoing Zimbabwe International Trade Fair (ZITF) in Bulawayo of their safety.\n\nGeza, the man who has riskedit all by taking confronting President Emmerson Mnangagwa and demanding that he steps down, on March 31 called for a protest cum stay away.\n\nMost businesses chose to stay shut while a significant number protested on the streets of Harare.\n\nHe is in hiding but maintains that Mnangagwa knows where he is.\n\nWe did not go to war so that Mnangagwa and his corrupt colleagues enjoy. We went to war for every Zimbabwean, he once again said when announcing the Tuesday and Wednesday stay away.\n\nGeza finds himself at the centre of factional fights within the ruling Zanu PF party.\n\nSome sections within the party, mainly from Mnangagwas Masvingo province, are calling for him to hang on beyond the constitutionally mandated two terms up to 2030.\n\nThe other faction, allegedly in support of Mnangagwas deputy Constantino Chiwenga, wants him to hand over power in 2028.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22111740/mbare-.jpeg",
            "description": "<p>By Staff Reporter RESIDENTS of Harare ignored war veteran Blesses Geza’s call for a stay away on Tuesday, with most businesses operating as usual. From as early as 5 am, commuter omnibuses were touting for commuters, most of whom are vendors headed to Harare’s main vegetable market in Mbare. There was no indication of any</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/business-as-usual-in-harare-as-gezas-stay-away-is-ignored/\">Business as usual in Harare as Geza’s stay away is ignored</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Mapeza calm despite FC Platinum’s slow start",
            "url": "https://www.newzimbabwe.com/mapeza-calm-despite-fc-platinums-slow-start/",
            "content": "By Sports Reporter\n\nFC Platinum coach Norman Mapeza says he is not panicking despite his sides slow start in the ongoing Premier Soccer League campaign.\n\nMapezas team on Monday managed a one all draw against Scottland at Rufaro Stadium.\n\nFC Platinum picked up a point from the match, thanks to super-sub Jarrison Selimani, who scored an equalizer to cancel Vassil Kawes first-half strike for Scottland.\n\nWith one win so far this season, the Zvishavane-based side is currently sitting in position 10 on the log with 9 points.\n\nFC Platinum has been struggling upfront with only three goals in seven games, however, Mapeza ishopingfor an improvement.\n\nWe are ok, the boys are doing well despite us not scoring, I have been in this before and I am not panicking.\n\nIm not going to give my boys pressure, they are working so hard and you saw it today. The results will come, we just need to be patient and keep on working hard, said Mapeza.\n\nMapeza guided FC Platinum to win three of its four league titles in 2017, 2018 and 2022.\n\nFC Platinum and the current league log leader, Mwos, are the only teams yet to register a defeat this season in the ongoing league campaign.\n\nWe are doing well with these boys. I was with Munhumutapa in 2008, the first four games we lost, and by this time of this season, we were where we are right now, seven games with 9 points.\n\nSo I know anything can happen, its more or less the same, added Mapeza.\n\nCastle Lager Premier Soccer League Matchday 7 Results\n\nMWOS 1-0 Dynamos\n\nCAPS United 0-1 Bikita Minerals\n\nScottland 1-1 FC Platinum\n\nManica Diamonds 2-2 Tel One\n\nTriangle 1-0 Yadah\n\nNgezi Platinum 0-0 Highlanders\n\nChicken 1-0 Simba Bhora\n\nGreen Fuel 0-0 ZPC Kariba\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/05172218/Norman-Mapeza.jpg",
            "description": "<p>By Sports Reporter FC Platinum coach Norman Mapeza says he is not panicking despite his side’s slow start in the ongoing Premier Soccer League campaign. Mapeza’s team on Monday managed a one all draw against Scottland at Rufaro Stadium. FC Platinum picked up a point from the match, thanks to super-sub Jarrison Selimani, who scored</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mapeza-calm-despite-fc-platinums-slow-start/\">Mapeza calm despite FC Platinum’s slow start</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "‘Staying away from work is sabotage’—Civil servants warned against participating in national shutdown",
            "url": "https://www.newzimbabwe.com/staying-away-from-work-is-sabotage-civil-servants-warned-against-participating-in-national-shutdown/",
            "content": "By Staff Reporter\n\nTHE Public Service Commission (PSC)has issued a warning to civil servants who abscond from work heeding a call for a national shutdown.\n\nThe warning comes in the wake of calls by war veteran Blessed Bombshell Geza for citizens not to report for duty, but stay home in protest over alleged gross incompetence by President Emmerson Mnangagwa and his government. Geza says the protests should be sustained until Mnangagwa resigns.\n\nIn response to Gezas incitement, the PSC said its workers, who fail to report for duty, would be deemed saboteurs.\n\nThe PSC notes with concern recent incitements circulating in various platforms encouraging public servants and other citizens to stay away from work or abstain from regular activities on 22 and 23 April 2025.\n\nThe Commission is confident that public servants, who are committed, disciplined, and fully aware of their responsibilities, will not be misled by such reckless and disruptive incitements, PSC said in a statement.\n\nPublic servants are reminded that their core mandate is to serve the people of Zimbabwe faithfully, diligently, and without interruption. The work carried out by the Public Service is vital to the delivery of essential services and the advancement of our national development aspirations, as outlined in Vision 2030.\n\nThe government workers were also reminded that participating in the stay-away would be considered an act of insubordination.\n\nParticipation in any stay-away that disrupts service delivery constitutes a dereliction of duty and an act of insubordination. Such actions are unpatriotic, undermine national unity, damage the economy, and hinder the collective progress of the nation. The PSC will not tolerate any conduct that threatens the stability and functionality of public institutions, added the PSC.\n\nAccordingly, the PSC wishes to clarify that Tuesday, 22 April 2025, and Wednesday, 23 April 2025, are normal working days.\n\nSupervisors were urged to mark attendance registers of all government employees and inspectors will collect the registers at all ministries, departments and agencies.\n\nPSC said it expects its workers to be at their workstations and discharge normal duties professionally, thereby displaying their loyalty to the incumbent leadership.\n\nTogether, let us uphold the dignity of the Public Service and contribute meaningfully towards building a prosperous, resilient, and united Zimbabwe, the PSC statement further reads.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22075053/PSC.jpg",
            "description": "<p>By Staff Reporter THE Public Service Commission (PSC) has issued a warning to civil servants who abscond from work heeding a call for a national shutdown. The warning comes in the wake of calls by war veteran Blessed ‘Bombshell’ Geza for citizens not to report for duty, but stay home in protest over alleged gross incompetence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/staying-away-from-work-is-sabotage-civil-servants-warned-against-participating-in-national-shutdown/\">‘Staying away from work is sabotage’—Civil servants warned against participating in national shutdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Man arrested for helping migrants enter South Africa illegally for just R300",
            "url": "https://www.newzimbabwe.com/man-arrested-for-helping-migrants-enter-south-africa-illegally-for-just-r300/",
            "content": "SowetanLive\n\nA man has been arrested at the Beitbridge border post for aiding undocumented migrants cross into South Africa for just R300.\n\nThe Border Management Authority (BMA) on Monday said the man from SA was caught by drone surveillance and intercepted by its officials while attempting to exit the patrol zone in Musina, Limpopo, with two undocumented people.\n\nThe area the man dubbed as a facilitator operates from was in a carport just 500m opposite the port.\n\nOfficials said another facilitator who fled the scene was seen conversing with a migrant before cash was exchanged between the two through a red gate.\n\nBMA commissioner Michael Masiapato said they had intensified their efforts to identify and arrest facilitators at border posts.\n\nHe said facilitators charge undocumented foreigners between R300 and R350 to get across the border.\n\nWhat we are doing seriously now is identifying and arresting the facilitators. These individuals arent deported  instead, theyre taken to the police station in Musina and charged for aiding and abetting, he said.\n\nSpeaking at the command site where the drones were being operated from, Masiapato said:It is great to capture the groups of [undocumented] people but they are not the ones organising this [illegal crossing].\n\nWe need to get the people who organise for these people being transported into the country, the people who are pulling the ropes, like we did in Lebombo [border in Komatipoort, Mpumalanga].\n\nWe let these people cross the river and then follow them until we get to the facilitator.\n\nMasiapato said they had let a group of undocumented migrants travel into the country at Lebombo andlater arrested them and the taxi driver who had met them halfway past the border.\n\nEven if we dont get them all, and two or three escape, as long as we can get the facilitator, that cuts their operation much shorter, Masiapato said.\n\nThe arrest of the man at Beitbridge came as officials were monitoring a makeshift boat with several passengers in the Limpopo River.\n\nWhen it comes to illegal migration at Beitbridge, this [using makeshift boats] is a common pattern. People are put into makeshift boats and ferried across the Limpopo River. We keep destroying those boats, but they keep rebuilding them.\n\nWe cant act while theyre still on the Zimbabwean side or even entering the river, but once theyre on our side, thats when we can act and arrest them, he said.\n\nDrone surveillance footage Sowetan has seen shows two people pulling a group of 15 people to the Limpopo River banks on the SA side.\n\nThe group then scattered shortly afterwards. However, BMA officials followed some who were going to meet another facilitator.\n\nOur border guards intercepted the group we saw today in the bush, and as we speak, they are being processed for deportation.\n\nMasiapato said 1,000 undocumented people have been arrested and deported since Tuesday, leading up to the Easter holidays.\n\nWeve processed just about 89,000 people since Tuesday last week. Now, from yesterday [Sunday] until today, were officially in the return leg, he said.\n\nDrone operator Thato Motloung said:The drone is the eyes in the sky. It helps the officials know from which positions foreigners are coming from.\n\nIt has features like obstacle detection and movement detection, something you might miss with a naked eye, like someone hiding under a truck or even in the river, thats how we detected the body of the person who was eaten by a crocodile [in the Limpopo River] on Sunday, Motloung said.\n\nLea Petersen, business enablement projects coordinator forArmaments Corporation of SA, said the technology being used by the BMA has really helped the officials work to the fullest ability, improving public behaviour.\n\nThe drones have been used once again, its been so inspirational to see how the drones using artificial intelligence and providing an eye in the sky help the BMA to do targeted arrests and targeted operations, said Petersen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22063103/man-arrested-at-beitbridge.jpg",
            "description": "<p>SowetanLive A man has been arrested at the Beitbridge border post for aiding undocumented migrants cross into South Africa for just R300. The Border Management Authority (BMA) on Monday said the man from SA was caught by drone surveillance and intercepted by its officials while attempting to exit the patrol zone in Musina, Limpopo, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-arrested-for-helping-migrants-enter-south-africa-illegally-for-just-r300/\">Man arrested for helping migrants enter South Africa illegally for just R300</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Who will be the next pope? Some potential candidates to succeed Francis",
            "url": "https://www.newzimbabwe.com/who-will-be-the-next-pope-some-potential-candidates-to-succeed-francis/",
            "content": "The Guardian\n\nPredicting the outcome of thehighly secretive papal conclaveis near impossible as cardinals positions shift over successive votes and some try to game the system to influence the chances of their favoured  or least-favoured  candidates. In the last conclave in 2013, few predicted that Jorge Mario Bergoglio would be elected as Pope Francis. At the moment, speculation is focusing on these men to succeed him:\n\nSeen as a moderate continuity candidate, Parolin was close to Francis. He has been the Vaticans secretary of state since 2013, playing a key role in diplomatic affairs, including delicate negotiations with China and governments in the Middle East. He is regarded as a reliable and trusted papal representative by secular diplomats. In 2018, he was the driving force behind acontroversial agreementwith the Chinese government on the appointment of bishops, criticised by some as a sellout to the communist regime. Parolins critics see him as a modernist and a pragmatist who places ideology and diplomatic solutions above hard truths of the faith. To his supporters, he is a courageous idealist and avid proponent of peace.\n\nTagle, a former archbishop of Manila, would be the first Asian pope, the region with the fastest-growing Catholic population. At one time he was considered to be Franciss preferred successor and a strong contender to continue the late popes progressive agenda, but recently appears to have fallen out of favour. He has suggested that the Catholic churchs stance on gay and divorced couples is too harsh, but has opposed abortion rights in the Philippines.\n\nTurkson would be the first black pope in centuries. He has been vocal on issues such the climate crisis, poverty and economic justice while affirming the churchs traditional positions on the priesthood, marriage between a man and a woman, and homosexuality. However, his views on the latter have loosened and he has argued that laws in many African countries are too harsh. He has spoken out on corruption and human rights.\n\nA leading conservative candidate, Erd has been a strong advocate for traditional Catholic teachings and doctrine. He would represent a big shift away from Franciss approach. He is widely regarded as a great intellect and a man of culture. Erd was a favourite of the late cardinalGeorge Pellwho believed he would restore the rule of law in the post-Francis Vatican. In 2015, Erd appeared to align himself with Hungarys nationalist prime minister, Viktor Orbn, when he opposed Franciss call for churches to take in migrants.\n\nAppointed a cardinal by Francis in 2019, Zuppi is considered to be on the progressive wing of the church, and would be expected to continue Franciss legacy, sharing the late popes concern for the poor and marginalised. He is (relatively) liberal on same-sex relationships. Two years ago, Francis made him theVaticanpeace envoy for Ukraine, in which capacity he visited Moscow to encourage gestures of humanity. While there he met Patriarch Kirill, the leader of the Russian Orthodox church and Vladimir Putins ally. He has also met Volodymyr Zelenskyy, Ukraines president.\n\nTolentino is one of the youngest potential successors to Francis, which could count against him  ambitious cardinals may not want to wait another 20 or 30 years before another shot at the top job. He has attracted controversy for sympathising with tolerant views on same-sex relationships and allying himself with a feminist Benedictine sister who favours womens ordination and is pro-choice. He was close to Francis on most issues, and argues that the church must engage with modern culture.\n\nGrech was seen as a traditionalist but began to embrace more progressive views after Francis was elected in 2013. His supporters argue that his changing opinions show his capacity for growth and change. He has criticised European political leaders who sought to limit the activities of NGO ships and has expressed support for female deacons.\n\nSince 2020, Pizzaballa has been the Latin patriarch of Jerusalem, a crucial role in advocating for the Christian minority in the Holy Land. After Hamass attack on Israel on 7 October 2023, Pizzaballaoffered himself as a hostagein exchange for children who were being held by Hamas in Gaza. He visited Gaza in May 2024 after months of negotiations. He would be expected to continue some aspects of Franciss leadership of the church, but has made few public statements on controversial issues.\n\nSarah is a traditional, Orthodox cardinal who at one time sought to present himself as aparallel authorityto Francis, according to a Vatican observer. In 2020, he co-authored a book with the then retired Pope Benedict defending clerical celibacy that was seen as a challenge to Franciss authority. He has denounced gender ideology as a threat to society, and has spoken out against Islamic fundamentalism. Like Turkson, he could make history as the first black pope in centuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22061546/Screenshot-2025-04-22-at-07.13.51.png",
            "description": "<p>The Guardian Predicting the outcome of the highly secretive papal conclave is near impossible as cardinals’ positions shift over successive votes and some try to game the system to influence the chances of their favoured – or least-favoured – candidates. In the last conclave in 2013, few predicted that Jorge Mario Bergoglio would be elected as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/who-will-be-the-next-pope-some-potential-candidates-to-succeed-francis/\">Who will be the next pope? Some potential candidates to succeed Francis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Zimbabwe’s house of stone: the gallery that showcases a famous sculpture tradition",
            "url": "https://www.newzimbabwe.com/zimbabwes-house-of-stone-the-gallery-that-showcases-a-famous-sculpture-tradition/",
            "content": "The Conversation\n\nZimbabwe is the house of stone, both literally and figuratively, with its very name derived from the ancient stone city ofGreat Zimbabwe. Stone is more than just a material here  its the totem pole of the countrys identity, shaping both its history and artistic legacy. And theres no better place to witness this thanChapungu Sculpture Park.\n\nOn the outskirts of Harares industrial zone, the sprawling estate is both a gallery for stone artistry and a living landscape, home to over 90 varieties of indigenous trees, with a tributary of the Mukuvisi river running through it. Art and nature intertwine, offering a unique glimpse into Zimbabwes famous sculptural tradition.\n\nThe last time I visited, in 2021, founderRoy Guthriewas still around, but he has since passed away. His enduring legacy remains visible throughout the park.\n\nThe former refrigerator salesman turned stone broker was arguably one of the most influential figures in bringing Zimbabwean sculpture to the global stage. He organised international exhibitions and artist residencies. At one point he had more than 200 artists in his books.\n\nBut his vision extended beyond exporting artwork. His true ambition was to create the largest and most representative permanent collection of Zimbabwean stone sculpture. Here, in the open air, different generations of artists works stand side by side, demonstrating the evolution of the art form.\n\nToday I am here to meetMarcey Mushore, Guthries widow. She tells me the park is now managed by a trust and shares the many plans in place to honour and expand his work. One is establishing a dedicated museum.\n\nAs we walk from the entrance, beneath a canopy of trees nicknamed the cathedral, sculptures line the pathways, creating a quiet dialogue. Leading the way is our guide, artist-turned-administratorNicholas Kadzungura. He arrived at Chapungu as an apprentice and has never left. Today he is a walking institutional memory.\n\nMy book in progress,The Stone Philosophers, foregrounds the lives of the black Zimbabwean artists who made stone sculpture famous. I am grappling with this vexing question: What does a stone archive look like? One possible answer could be that it takes the form of a well-tended garden park with sculptures from Zimbabwes master sculptors.\n\nAs we stand facing the water, Mushore points towards a cluster of trees to indicate where the museum would be built. Perhaps, in a few years, the brush will be cleared, and in its place will rise a building dedicated to housing the history of Zimbabwean stone sculpture.\n\nDespite theinternational recognitionit has garnered since the 1960s, there is still no local museum solely dedicated to this art form. British curatorFrank McEwen, founding director of theNational Gallery of Zimbabwe, is often regarded as the architect of the movement. And Guthrie considered McEwen an influence.\n\nWith Zimbabwean sculpture, each piece tells a story, simple and elaborate, ranging from spirit-filled folk tales to depictions of the everyday moments that shape life. Youre confronted by human-size shapes of torsos, heads, animals and sometimes abstract figurations.\n\nWhile often categorised under the contentious label of Shona sculpture, the stone sculptors of Zimbabwe were not exclusivelyShona, the countrys largest ethnic group. The term was popularised by McEwen.\n\nIn fact, some of these artists came from other parts of Zimbabwe and from neighbouring countries like Zambia, Malawi or Angola, broadening the scope of the tradition. The sculptors primarily work with serpentine stone  especially springstone, fruit serpentine and leopard rock  alongside opal stone, verdite and dolomite, sourced mainly from the Great Dyke, a 300km geological formation in central Zimbabwe.\n\nBeyond the architectural metaphor of Zimbabwean writerNovuyo Rosa Tshumas novel,House of Stone, who were the builders and stone workers behind the legend of Zimbabwe?\n\nThe countrys name is thanks to the Shona peoples long artisanal tradition of stone working. Its not just a metaphor. Cities were built with blood, sweat and tears. Stone sculpture was not a peculiarity that was ignited by colonial encounter. It was always there, through generations and traditions. It was just not yet classified in anthropological terms, or exhibited in the colonial museum.\n\nThe modernstone sculpture movementin Zimbabwe emerged organically. It was a phenomenon shaped by groups of friends, siblings, and spouses whose work made a significant contribution to theAfrican modernismof the 1960s and 1970s.\n\nThe artists who brought stone sculpture to prominence formed networks that stretched from village to village, collaborating informally. Their work was eventually co-opted into the white-dominated art world ofRhodesia, as the country was known in colonial times. From there, it was exported to Europe and the US.\n\nAlthough these artists rose to prominence during a period of decolonisation in the 1950s and 1960s, they remained marginal figures in their own country. When Rhodesia declared unilateral independence in 1965, becoming an isolated stronghold of white supremacy, the history of stone sculpture became inseparable from the broader struggles faced by black Zimbabweans. It reflected the racist exclusions and hardships endured by its creators, who persisted against the odds.\n\nToday, Zimbabwe is better known for its young visual artists, who primarily work in painting, mixed media and collage. While stone sculpture was once the countrys dominant art form, its visibility has diminished  not in production, but in critical conversations about art. A simple internet search yields little on its history or artistic significance; instead, results are dominated by commercial gallery websites showcasing polished sculptures for sale, with little attention given to the artists or their creative processes.\n\nThis emphasis on the final product over the maker is not new. It traces back to the very origins of the stone sculpture movement. What we see here is a repressed archive, where gaps in documentation are not accidental but the result of historical omissions. These absences, in turn, expose deeper questions of power, access and visibility in the art world.\n\nAs we conclude our tour of Chapungu, a group of artists, seated on planks of wood and large stones, wave at us. They represent a new generation, carrying forward the tradition of stone sculpture in Zimbabwe, ensuring that this art form continues to evolve and endure.\n\nResearch Associate, University of Oxford\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22061215/Screenshot-2025-04-22-at-07.11.57.png",
            "description": "<p>The Conversation Zimbabwe is the house of stone, both literally and figuratively, with its very name derived from the ancient stone city of Great Zimbabwe. Stone is more than just a material here – it’s the totem pole of the country’s identity, shaping both its history and artistic legacy. And there’s no better place to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-house-of-stone-the-gallery-that-showcases-a-famous-sculpture-tradition/\">Zimbabwe’s house of stone: the gallery that showcases a famous sculpture tradition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Geza claims military backing in bid to oust Mnangagwa",
            "url": "https://www.newzimbabwe.com/geza-claims-military-backing-in-bid-to-oust-mnangagwa/",
            "content": "By Staff Reporter\n\nExpelled Zanu PF Central Committee member and war veteran, Blessed Geza, has claimed he is working with elements within the security establishment, including the armed forces, in his campaign to remove President Emmerson Mnangagwa from power.\n\nGeza is raising allegations against Mnangagwa and his government, including corruption, tribalism and cronyism.\n\nTo bolster these claims of military backing, Geza, who is currently a person of interest to the Zimbabwe Republic Police (ZRP), has been appearing in military garb in an undisclosed location. The army, however, following his first online address, released a statement denouncing individuals misusing military uniforms.\n\nAddressing Zimbabweans via his YouTube and X accounts on Monday morning, Geza reiterated his call for Mnangagwa to step down.\n\nI have engaged in extensive consultations and received guidance and instructions from progressive elements within the senior echelons of the security apparatus. We have reached an accord: progressive units within the security forces will be deployed nationwide to assist the populace in their efforts to remove Mnangagwa and his criminal cabal, Geza proclaimed.\n\nGeza further asserted that the security forces would also apprehend all those surrounding Mnangagwa, whom he accuses of being unfit for office on the grounds of ill-health.\n\nThis stay-away will be accompanied by precisely calibrated strategic actions undertaken by progressive members of the security sector to exert maximum pressure on Mnangagwa and his inner circle to relinquish power forthwith.\n\nAll progressive elements within the security sector have received unequivocal instructions to arrest on sight all members of the inner circle cabal, he asserted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051558/zdf-Mnangagwa-0.jpeg",
            "description": "<p>By Staff Reporter Expelled Zanu PF Central Committee member and war veteran, Blessed Geza, has claimed he is working with elements within the security establishment, including the armed forces, in his campaign to remove President Emmerson Mnangagwa from power. Geza is raising allegations against Mnangagwa and his government, including corruption, tribalism and cronyism. To bolster</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geza-claims-military-backing-in-bid-to-oust-mnangagwa/\">Geza claims military backing in bid to oust Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Zimbabwe women embark on a historic multi-format tour of USA",
            "url": "https://www.newzimbabwe.com/zimbabwe-women-embark-on-a-historic-multi-format-tour-of-usa/",
            "content": "ICC\n\nThe tour will mark the first occasion that Zimbabwe womens cricket team visit USA for a bilateral series.\n\nZimbabwe womens cricket team are set to take on the United States of America across three T20Is and two ODIs.\n\nThe tour will kickstart with the T20I series, beginning from April 25. It will be followed by a couple of ODIs scheduled for May 1 and 3.\n\nAll the games will be played at the Grand Prairie Stadium in Texas.\n\nThe two teams last squared off in October 2024 when USA toured Harare for an ODI series. While the hosts emerged victorious, it was a closely contested five-match series  separating the two teams with a 3-2 margin.\n\nThe US tour is a start to steady build-up towards the Ireland series in July which will give us a gauge in terms of where we are ahead of the FTP next year, Zimbabwe women head coach Walter Chawaguta said.\n\nIt also kickstarts our journey towards the Africa qualifiers later this year.\n\nZimbabwe squad:Biza Beloved, Chipare Francesca, Dhururu Chiedza, Mabhero Lindokuhle, Makusha Tendai, Marange Precious, Mthomba Natasha, Mugeri-Tiripano Chipo, Mupachikwa Modester, Ndhlovu Kelis, Nkomo Josephine, Pasipanodya Runyararo, Sibanda Nomvelo, Tshuma Loreen, Zimunu Adel\n\nNon-Travelling Reserves:Gwanzura Nyasha, Ndiraya Kelly\n\nTour schedule:\n\n1st T20I: April 25, Friday\n\n2nd T20I: April 27, Sunday\n\n3rd T20I: April 29, Tuesday\n\n1st ODI: May 1, Thursday\n\n2nd ODI: May 3, Saturday\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22053346/lady-chevrons.jpeg",
            "description": "<p>ICC The tour will mark the first occasion that Zimbabwe women’s cricket team visit USA for a bilateral series. Zimbabwe women’s cricket team are set to take on the United States of America across three T20Is and two ODIs. The tour will kickstart with the T20I series, beginning from April 25. It will be followed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-women-embark-on-a-historic-multi-format-tour-of-usa/\">Zimbabwe women embark on a historic multi-format tour of USA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        },
        {
            "title": "Crossing Beitbridge border post a lifeline for many Zimbabweans",
            "url": "https://www.newzimbabwe.com/crossing-beitbridge-border-post-a-lifeline-for-many-zimbabweans/",
            "content": "SowetanLive\n\nZimbabwes economic problems continue to force thousands of citizens to seek relief in neighbouring SA.\n\nWith inflation, high unemployment, and skyrocketing prices for basic foods, survival has become a daily negotiation, one that for many begins with a border crossing.\n\nFrom traders to job seekers, the Beitbridge border post becomes a lifeline.\n\nKaisser Tsikini is one of those who cross the border daily.\n\nAs a mother of two, she makes her way into SA every morning to sell fruits and vegetables, a trade that helps her feed her family.\n\nThis is how I survive, she said.Its not easy, and sometimes I get very tired, but I do what I have to. My children depend on me.\n\nThough Tsikini has the documentation to cross legally, she said many around her dont  not because they dont want to, but because they simply cant afford to.\n\nGetting a passport is expensive. So some people try to find other ways into SA just to buy food or make a little money, she said.\n\nYolanda Ferra, who makes the journey to SA to shop for essentials, shares that sentiment.\n\nIt would help if Zimbabwe werent so expensive. I wouldnt have to go through this just to get basics like mealie meal and oil, she said.\n\nThe way the world talks about SA, youd think its dangerous. But the people are friendlier than what we hear online.\n\nFor many like Ferra, SA isnt the dream, its the alternative. Her trips are frequent and often exhausting, but necessary to make life manageable back home.\n\nJohn Nyoni, a father of four, divides his year between Zimbabwe and SA, chasing short-term jobs in carpentry and mechanics.\n\nI spend half the year here [in SA], working. The other half, Im back with my family in Zim. But this time, I left early.\n\nTheres no work, and its been hard to survive. At least at home, I can be with my kids and try again later, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22062735/beitbridge.jpg",
            "description": "<p>SowetanLive Zimbabwe’s economic problems continue to force thousands of citizens to seek relief in neighbouring SA. With inflation, high unemployment, and skyrocketing prices for basic foods, survival has become a daily negotiation, one that for many begins with a border crossing. From traders to job seekers, the Beitbridge border post becomes a lifeline. Kaisser Tsikini</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crossing-beitbridge-border-post-a-lifeline-for-many-zimbabweans/\">Crossing Beitbridge border post a lifeline for many Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "22 Apr 2025"
        }
    ]
}