{
    "news": [
        {
            "title": "Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda.\n\nMatatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO), Asher Walter Tapfumaneyi.\n\nTapfumaneyi had been named ZNA Chief of Staff in May.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2 of the Constitution of Zimbabwe as read with sections 7(1) and 8(2 of the Defence Act [Chapter 11:02], promoted Lieutenant Genera Emmanuel Matatu to the rank of General and appointed him Commander of the Zimbabwe Defence Forces with effect from 21 November 2025.\n\nThe appointment follows the retirement of outgoing Commander of the Zimbabwe Defence Forces, General Philip Valerio Sibanda, Rushwaya said\n\nSibanda is expected to take up a role in the ruling Zanu PF politburo.\n\nIn 2023, Mnangagwa briefly appointed him to the partys politburo before reversing the decision following a backlash from civil society. His appointment was scheduled for review at the end of his army tenure.\n\nWith tensions reportedly deepening over Mnangagwas succession, analysts view the elevation of his close allies to key military positions as a move to consolidate and secure his political interests.\n\nThe military played a pivotal role in the 2017 coup that propelled Mnangagwa to power, making control of the security sector crucial in maintaining his hold on the state.\n\nTapfumaneyi was placed under US sanctions in 2024 for his alleged role in disrupting the 2023 general elections through the Forever Association of Zimbabwe (FAZ), which was accused of intimidating voters at polling stations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27184152/matatu.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda. Matatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/\">Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe’s dollar stock market closes in on 131-year-old main bourse",
            "url": "https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourses mantle as the southern African nations main trading platform.\n\nThe 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for the 49 stocks trading in the local ZiG currency on theZimbabwe Stock Exchange.\n\nThe gap between the two exchanges is substantial but could narrow quickly in the event of a currency event that impacts on company valuations or if a large firm migrates to the new bourse, according to Lloyd Mlotshwa, head of research at IH Securities.\n\nIf we are looking at purely organic growth, the total value of shares on the VFEX could exceed those on the ZSE within the next 24 months, he said.\n\nTrade in blue-chips, including Delta Corp and Econet Wireless Zimbabwe, is still anchored on the local-currency exchange.\n\nThe two firms, which make up 54% of the ZSEs total market value, may face pressure to migrate to VFEX to better protect shareholder returns, Imara Asset Management Chief Executive Officer Shelton Sibanda said.\n\nThe economy is dollarised with pension funds doing more trading on the VFEX, he said in an interview.\n\nThe VFEX has posted broad gains this year, mirroring rallies across emerging markets on the back of firm commodity prices, a steadier local currency, and renewed confidence, IH Securities said. That contrasts with the ZSE  long a haven for investors during bouts of high inflation  which is slightly lower.\n\nThe VFEX has been the standout performer, with market capitalisation rising over 40% year to date, the Harare-based brokerage said in its latest equity report, attributing the strong performance to gold-linked and consumer-facing stocks.\n\nLiquidity on the VFEX has also improved significantly, the brokerage added. With average daily turnover up 197% from the prior year, reflecting deepening participation by both institutional and retail investors.\n\nThe main exchange in Harare has borne the brunt of a yearlong liquidity squeeze thats been in place since the 43% devaluation of the ZiG, short for Zimbabwe Gold, last September.\n\nTrading on the ZSE has slumped, and IH Securities expects the slowdown will continue to suppress stock market activity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/23081422/zse.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourse’s mantle as the southern African nation’s main trading platform. The 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/\">Zimbabwe’s dollar stock market closes in on 131-year-old main bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe’s inflation drops, but debt management remains key",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/",
            "content": "Forbes Africa\n\nThe Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025.\n\nZimbabwes economy hasbeenimpactedbysevere inflation since the early 2000s, but officialsmaybebreathing a sigh of relieffollowinga recentConfederation of Zimbabwe Industries (CZI) report, which showed inflation to have droppedfrom82.7% in September to 32.7% in October.\n\nThe future appears brighter with inflation projected to fall to between 15% and 20% by the end of the year, marking a significant recovery from 2020, when inflation soared past 500%,amid the pandemic.\n\nIntroduced by the Reserve Bank of Zimbabwe (RBZ) in April 2024, the rising valuation ofZiG, pegged to foreign currency and precious metals, primarily gold, has beenaleading protagonist behind Zimbabwes economic resurgence.\n\nAccording to theInternational Monetary Fund, the nations current GDP is $53.31 billionup $13.35 billion from 2020.\n\nHowever, despitetheimpactof theZiG, expertsseem to becautiousofa recurring theme of volatility.\n\nThe outlook for the ZiG has improved over the near term, supported by elevated gold prices. However, it still has a long way to go before it becomes the sole legal tender for Zimbabwe, says Lyle Begbie, an economist at Oxford Economics Africa.\n\nZimbabwes history of hyperinflation and failed monetary experiments means itremainshighly dollarized. The U.S.dollar is the main medium of exchange, while the share ofZiGin monetary aggregates is small at around 17%. Prices are rarely quoted inZiG, and salaries and goods and services transactions are typically either fully or partially paid in U.S.dollars.\n\nWhile stabilizing inflation is undoubtedly positive, the landlocked nationwill need to remain steadfastregardingother challenges,before unlocking national sovereignty. Zimbabwes public debt, which reached $23.2 billion in 2024 (72.9% of GDP),per the World Bank,remainsa discouraging barrier to foreign investment.\n\nZimbabwes debt arrearssubstantially weighon its economic growth outlook, Begbie explains, before adding, Due to these arrears, the country cannot access concessional funding from multilateralorganizations, andis excluded from obtaining any sort of debt relief.\n\nThe World Bank has placed Zimbabwe in non-accrual status since 2000. Whilemassivedebtrisks stallingmomentum, addressing inflationwillput thatsummitwithin reach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Forbes Africa The Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025. Zimbabwe’s economy has been impacted by severe inflation since the early 2000s, but officials may be breathing a sigh of relief following a recent Confederation of Zimbabwe Industries (CZI) report, which showed inflation to have dropped from 82.7% in September</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/\">Zimbabwe’s inflation drops, but debt management remains key</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "ANC NEC members demand investigation into intelligence failures over Palestinian refugee flights",
            "url": "https://www.newzimbabwe.com/anc-nec-members-demand-investigation-into-intelligence-failures-over-palestinian-refugee-flights/",
            "content": "IOL\n\nMembers of the ANCs national executive committee (NEC) have called for an investigation into how the South Africas intelligence services failed to warn the government about the imminent arrival of planes transporting refugees from Palestine.\n\nThe Mercury understands from NEC members, who were part of themeeting this past weekend, that concerns were raised that refugees had arrived in the country, with the intelligence services knowing nothing about it.\n\nTwo planes have landed in the country, withone landing a few days ago. The arrival of the passengers raised alarms within government circles, as it has since emerged that the refugees did not know where they were being taken.\n\nA source in the NEC said during discussions, members were shocked that the intelligence services failed to detect this situation.\n\nKeep in mind that this is not the first time something like this has happened; there is another plane that has arrived before, and there have been people coming from Palestine and, we understand, others from Ukraine. However, the intelligence service was unaware; how can that be? We now want them to be investigated, stated the source.\n\nThe NEC members said that both the domestic and foreign intelligence arms should take responsibility for this security breach.\n\nA plane filled with people just landed in our country and they know nothing about it. We wanted answers because this means this could happen again and again.\n\nThe source said the issue was not about the Palestinian refugees but the fact that such a security breach was allowed to happen. The party also wants a profile of everyone that is in the country.\n\nWe are concerned that some of the people that have arrived stated that they paid about R30 000 to be taken here, and we wanted to confirm if that is indeed the case.\n\nThe NEC member also said the party would want to put more stringent visa regimes in place going forward, pointing out that Palestinians and Israelis could get into the country with visas, and that could be beefed up going forward. We have to know who is in the country.\n\nSeveral attempts to get comment from the ANC yesterday were unsuccessful.\n\nPolitical analyst Thabani Khumalo said the situation has left many questions for the ruling party to answer.\n\nIn South Africa, you do not know whether this is a country or what; the manner in which this unfolded has left many people feeling unsafe. We do not feel safe, and the visitors to the G20 will feel unsafe as well.\n\nHow many people are roaming the streets that are unknown? There have been reports of people operating training camps, and even the defence members are complaining, indicating that many things are not going well.\n\nInternational Relations Minister Ronald Lamola said the flight was part of a clear agenda to cleanse Palestinians from Gaza and the West Bank.\n\n[This] is a clearly orchestrated operation because they are not only being sent to South Africa. There are other countries where such flights have been sent, he said.\n\nIt was reported that the Palestinian embassy in South Africa stated that the group left Israels Ramon Airport and flew to the country via the Kenyan capital, Nairobi, without any prior notice or co-ordination.\n\nThe embassy added that an unregistered and misleading organisation had exploited the plight of the Gaza citizens, deceived families, collected money from them, and facilitated their travel in an irregular and irresponsible manner.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/28060019/ANC-rally.jpeg",
            "description": "<p>IOL Members of the ANC’s national executive committee (NEC) have called for an investigation into how the South Africa’s intelligence services failed to warn the government about the imminent arrival of planes transporting refugees from Palestine. The Mercury understands from NEC members, who were part of the meeting this past weekend, that concerns were raised that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/anc-nec-members-demand-investigation-into-intelligence-failures-over-palestinian-refugee-flights/\">ANC NEC members demand investigation into intelligence failures over Palestinian refugee flights</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/",
            "content": "FAO\n\nZimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025from 1920 November, a flagship event held duringWorld Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the worlds most pressing public health and development challenges\n\nAMR threatens the effective treatment of infections in humans, animals and plants, impacting health systems, food security, trade and the environment. Zimbabwe has made substantial progress, supported by the Fleming Fund and the AMR Multi-Partner Trust Fund, in improving laboratory capacity, AMR and AMU surveillance, infection prevention and control (IPC), biosecurity in the agrifood sector and behaviour change initiatives across communities\n\nThe conference aims to provide a national platform where evidence can be shared widely, partnerships strengthened, and innovations showcased to improve policy influence and sustainability of ongoing AMR interventions.\n\nOver the two days, participants will engage inscientific presentations, panel discussions, exhibitions and poster sessions, covering themes such as surveillance across One Health sectors, stewardship and governance, digital innovation, community-level solutions and policy pathways. The programme features multisectoral speakers including experts from the Ministry of Health and Child Care, Ministry of Lands and Agriculture, FAO, WHO, BRTI, academia, development partners, civil society and the private sector.\n\nA dedicatedInnovation and Exhibition Pavilionwill showcase laboratory tools, digital platforms, biosafety technologies and solutions developed by research institutes, private companies and implementing partners. Youth engagement will be led by the Generational Stewards for Antimicrobials (GSA), underscoring the critical role of young scientists and advocates in sustaining momentum on AMR response.\n\nThe conference will also profile Zimbabwes progress in implementing thesecond National Action Plan for AMR (20242028)and highlight emerging regional opportunities for collaboration.\n\nEvent organizers, including the Government of Zimbabwe through the One Health Secretariat, FAO, WHO and BRTI, affirm that strengthening multisectoral partnerships is key to safeguarding the effectiveness of antimicrobials and securing the countrys health and food systems for future generations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19043945/AMR.jpg",
            "description": "<p>FAO Zimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025 from 19–20 November, a flagship event held during World Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the world’s most pressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/\">Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute",
            "url": "https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/",
            "content": "By Staff Reporter\n\nFormer legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility.\n\nMliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused his office by allegedly pressuring the City Council to remove residents who acquired land legally along Airport Road.\n\nHarare City Council were intimidated by the office of the Vice President. He forced them to write letters. Vice President can not be using the church to amass wealth for himself and George Charamba, said Mliswa.\n\nThe outspoken politician further called on the Zimbabwe Anti-Corruption Commission (ZACC) to investigate the City Council over the controversial eviction notices.\n\nHere comes the institutions that fight corruption, ZRP, ZACC, you need to investigate Harare City Council. Why they then wrote letters to displace those people when they are the owners of the land? They gave them the land. Everything was paid for. Over US$2 million was paid for that land, then suddenly you think people must just leave because somebody in a higher office, who is a Vice President says something, said Mliswa.\n\nHarare City Council acting Town Clerk Phakamile Mabena Moyo recently issued a three-month notice for the occupants to vacate the land, citing violation of Section 24 of the Regional, Town and Country Planning Act (Chapter 29:12).\n\nMliswas latest remarks come shortly after he accused Chiwengas wife, Minoyothabo Baloyi, of allegedly running a parallel structure in the Zimbabwe National Army.\n\nCity Council, I am going to report you to ZACC for overturning such decisions. That is fraud. If you have overturn decisions of such nature because of certain powers, you will go to jail like a joke, added Mliswa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/30052903/Chiwenga-680x380-1.webp",
            "description": "<p>By Staff Reporter Former legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility. Mliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/\">Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "20 Nov 2025"
        }
    ]
}