{
    "news": [
        {
            "title": "Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation",
            "url": "https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/",
            "content": "By Anna Chibamu\n\nMining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned.\n\nSpeaking in the Senate recently, Goromonzis Chief Chikwaka said that while Zimbabwe remains open for business, some foreign miners were wreaking havoc in the communities where they operate.\n\nWhat is government policy regarding the allocation of licences where you find miners displacing local communities? This is affecting peoples livelihoods. You would find that people are just relocated without improving their livelihoods.\n\nWhat is the government policy in terms of people who are being displaced by mining activities, where you find, them being relocated to areas which are not conducive? he said.\n\nHis concerns come just two months after President Emmerson Mnangagwa directed Parliament to expedite the long-overdue Mines and Minerals Bill to address ongoing disputes between miners, farmers, and communities.\n\nResponding to the issue, Mines and Mining Development Deputy Minister responsible for Oil and Gas Research and other Strategic Minerals Exploration, Caleb Makwiranzou, acknowledged the challenges.\n\nThe Deputy Minister said, Before giving permission to miners, we require a report, which is called the Environmental Impact Assessment (EIA), which is a report, which looks at the community which is going to be affected, and where they are going to be relocated. If they going to receive houses where they are going to be relocated, then after getting that report, that is where we allow mining companies to go ahead.\n\nMakwiranzou also highlighted provisions in the new law.\n\nI want to inform this House that the new law [H. B. 1, 2025] allows that if someone has their field or their farm and there is a need for mining to be done in that field, that person is given the first option. The person is asked whether they allow the miners, and then they can discuss with whoever wants to mine if there is an allocation of shares. The person can then be given shares.\n\nOn the other hand, if that person is to be relocated, it should be consensual. They must give consent because the previous law was causing disputes where there was conflict between the Minerals Act and the Agricultural Act, said Makwiranzou.\n\nHowever, Chief Chikwaka argued that, in reality, no environmental impact assessments were being conducted before mining begins.\n\nThere is no Environmental Impact Assessment, which is being done. You would find that miners are just coming into the community. They start drilling in peoples fields. They start mining and excavating in peoples fields and leave such fields open.\n\nThey do not cover the pits and the original farmer cannot farm on his land because there are pits. There is a need for consultation with stakeholders, Chief Chikwaka said.\n\nMakwiranzou stressed that operating without an EIA is illegal, adding that government would send inspectors to the affected communities and block the mining activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26023525/Chinese-Mining-Operations.png",
            "description": "<p>By Anna Chibamu Mining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned. Speaking in the Senate recently, Goromonzi’s Chief Chikwaka said that while Zimbabwe remains open for business,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/\">Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Leaked letter to ZACC accuses High Court judge, top lawyer Thabani Mpofu of conflict of interest",
            "url": "https://www.newzimbabwe.com/leaked-letter-to-zacc-accuses-high-court-judge-top-lawyer-thabani-mpofu-of-conflict-of-interest/",
            "content": "By Staff Reporter\n\nHigh Court judge Priscilla Munangati-Manongwa and prominent lawyer Advocate Thabani Mpofu have been drawn into controversy after an anonymous whistle-blower accused them of a conflict of interest in a leaked letter seen by NewZimbabwe.com.\n\nThe letter, addressed to the Zimbabwe Anti-Corruption Commission (ZACC) and copied to the Judicial Service Commission, claims the alleged personal and professional links of the two compromise judicial impartiality.\n\nThe author, who says they are writing anonymously for fear of victimisation, alleges that Advocate Mpofu continues to take instructions from Munangati and Associates, a law firm they say still bears the judges name.\n\nI write to raise my concern over a serious conflict of interest between the above-mentioned court officials.\n\nDespite having a brother who works at Munangati and Associates, where I believe the Honourable Judge still has interests as her name still appears at the law firm, Advocate Mpofu takes instructions from the law firm and appears before Justice Munangati in those matters.\n\nThe whistle-blower argues that this arrangement is highly undesirable and grossly unfair to other litigants who will be in the dark about the relationship between the Honourable Judge and Advocate Mpofu.\n\nThe letter goes on to list several cases the author believes demonstrate the alleged conflict. Among them is HC 2312/24  Collin Zondai Makoni vs The State, which the writer says came [before] Justice Munangati despite the fact that it was from her law firm, involving lawyers Skumbuzo Mpofu and Skyvaine Vongai Tendere. This matter is pending decision pronouncement, the letter notes.\n\nThe whistle-blower also cites Thelma Chimbanga vs L Gono Enterprises (HC 1518/24), which they say was heard by the same judge despite originating from the same law firm, and is still awaiting a set down.\n\nAnother flagged case is Blue Star Logistics vs Harare Motorways (HC 8108/24), where Thabani Mpofu is representing the Applicant, with the author adding: I believe this anomaly is being overlooked since Thabani Mpofu and Webster Chiikwanha are the best of friends.\n\nThe author insists that Justice Munangati Manongwa should not hear any matters instructed to Advocate Mpofu by Munangati and Associates legal practitioners, urging ZACC to intervene because these allegations, which are very serious in nature be investigated so as to avoid prejudice to other litigants.\n\nThe writer further notes that this is not their first complaint to ZACC: Kindly note that I once wrote to your good office again on the 24th of June 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/27222834/Thabani-Mpofu1.jpg",
            "description": "<p>By Staff Reporter High Court judge Priscilla Munangati-Manongwa and prominent lawyer Advocate Thabani Mpofu have been drawn into controversy after an anonymous whistle-blower accused them of a conflict of interest in a leaked letter seen by NewZimbabwe.com. The letter, addressed to the Zimbabwe Anti-Corruption Commission (ZACC) and copied to the Judicial Service Commission, claims the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/leaked-letter-to-zacc-accuses-high-court-judge-top-lawyer-thabani-mpofu-of-conflict-of-interest/\">Leaked letter to ZACC accuses High Court judge, top lawyer Thabani Mpofu of conflict of interest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank",
            "url": "https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/",
            "content": "Channel Africa\n\nZimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the countrys monetary authorities.\n\nSpeaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the Zimbabwe Gold (ZiG) to operate as the countrys sole currency.\n\nThe present reserve level provides more than four times cover for reserve money, far above the minimum one-to-one backing required, but still insufficient for a mono-currency environment.\n\nOfficials stressed thatZimbabwes domestic currency must be fully backed by foreign currency reserves and precious mineralsto ensure stability and convertibility.\n\nWe need reserves that provide between three and six months of import cover for a mono-currency regime.To achieve that, Zimbabwe would require between 5 and 6 billiondollars.At the pace we are accumulating reserves, we are confident we can reach those levels, Gwanyanya said.\n\nMonetary authorities emphasised that while reserves are essential, macroeconomic stability is the decisive factor.\n\nWe need durable stability, price stability, and exchange-ratestabilityto restore trust in the currency. Stability for beyond one year is crucial for the market to accept a mono-currency arrangement,  he said.\n\nThe Reserve Bank attributes the increase to several factors, including:\n\nGold reserves currently stand at around 3.5 tonnes, and the authorities say the country has benefited from the global gold price rally.\n\nZimbabwe also continues to accumulate reserves through the foreign-currency surrender system, in which exporters convert part of their earnings into local currency.\n\nAt the rate we are accumulating these reserves, it is quite encouraging. Our exports are increasing, and this is what funds reserve accumulation.\n\nHowever, they cautioned that beyond building reserves, confidence in the ZiG and broader economic performance will determine the success of the 2030 single-currency target.\n\nOur economy has been performing to expectations, and in some cases exceeding expectations, despite external shocks. But stability remains the foundation for trust in the currency, Gwanyanya said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>Channel Africa Zimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the country’s monetary authorities. Speaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/\">Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe’s dollar stock market closes in on 131-year-old main bourse",
            "url": "https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourses mantle as the southern African nations main trading platform.\n\nThe 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for the 49 stocks trading in the local ZiG currency on theZimbabwe Stock Exchange.\n\nThe gap between the two exchanges is substantial but could narrow quickly in the event of a currency event that impacts on company valuations or if a large firm migrates to the new bourse, according to Lloyd Mlotshwa, head of research at IH Securities.\n\nIf we are looking at purely organic growth, the total value of shares on the VFEX could exceed those on the ZSE within the next 24 months, he said.\n\nTrade in blue-chips, including Delta Corp and Econet Wireless Zimbabwe, is still anchored on the local-currency exchange.\n\nThe two firms, which make up 54% of the ZSEs total market value, may face pressure to migrate to VFEX to better protect shareholder returns, Imara Asset Management Chief Executive Officer Shelton Sibanda said.\n\nThe economy is dollarised with pension funds doing more trading on the VFEX, he said in an interview.\n\nThe VFEX has posted broad gains this year, mirroring rallies across emerging markets on the back of firm commodity prices, a steadier local currency, and renewed confidence, IH Securities said. That contrasts with the ZSE  long a haven for investors during bouts of high inflation  which is slightly lower.\n\nThe VFEX has been the standout performer, with market capitalisation rising over 40% year to date, the Harare-based brokerage said in its latest equity report, attributing the strong performance to gold-linked and consumer-facing stocks.\n\nLiquidity on the VFEX has also improved significantly, the brokerage added. With average daily turnover up 197% from the prior year, reflecting deepening participation by both institutional and retail investors.\n\nThe main exchange in Harare has borne the brunt of a yearlong liquidity squeeze thats been in place since the 43% devaluation of the ZiG, short for Zimbabwe Gold, last September.\n\nTrading on the ZSE has slumped, and IH Securities expects the slowdown will continue to suppress stock market activity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/23081422/zse.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourse’s mantle as the southern African nation’s main trading platform. The 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/\">Zimbabwe’s dollar stock market closes in on 131-year-old main bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe’s inflation drops, but debt management remains key",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/",
            "content": "Forbes Africa\n\nThe Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025.\n\nZimbabwes economy hasbeenimpactedbysevere inflation since the early 2000s, but officialsmaybebreathing a sigh of relieffollowinga recentConfederation of Zimbabwe Industries (CZI) report, which showed inflation to have droppedfrom82.7% in September to 32.7% in October.\n\nThe future appears brighter with inflation projected to fall to between 15% and 20% by the end of the year, marking a significant recovery from 2020, when inflation soared past 500%,amid the pandemic.\n\nIntroduced by the Reserve Bank of Zimbabwe (RBZ) in April 2024, the rising valuation ofZiG, pegged to foreign currency and precious metals, primarily gold, has beenaleading protagonist behind Zimbabwes economic resurgence.\n\nAccording to theInternational Monetary Fund, the nations current GDP is $53.31 billionup $13.35 billion from 2020.\n\nHowever, despitetheimpactof theZiG, expertsseem to becautiousofa recurring theme of volatility.\n\nThe outlook for the ZiG has improved over the near term, supported by elevated gold prices. However, it still has a long way to go before it becomes the sole legal tender for Zimbabwe, says Lyle Begbie, an economist at Oxford Economics Africa.\n\nZimbabwes history of hyperinflation and failed monetary experiments means itremainshighly dollarized. The U.S.dollar is the main medium of exchange, while the share ofZiGin monetary aggregates is small at around 17%. Prices are rarely quoted inZiG, and salaries and goods and services transactions are typically either fully or partially paid in U.S.dollars.\n\nWhile stabilizing inflation is undoubtedly positive, the landlocked nationwill need to remain steadfastregardingother challenges,before unlocking national sovereignty. Zimbabwes public debt, which reached $23.2 billion in 2024 (72.9% of GDP),per the World Bank,remainsa discouraging barrier to foreign investment.\n\nZimbabwes debt arrearssubstantially weighon its economic growth outlook, Begbie explains, before adding, Due to these arrears, the country cannot access concessional funding from multilateralorganizations, andis excluded from obtaining any sort of debt relief.\n\nThe World Bank has placed Zimbabwe in non-accrual status since 2000. Whilemassivedebtrisks stallingmomentum, addressing inflationwillput thatsummitwithin reach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Forbes Africa The Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025. Zimbabwe’s economy has been impacted by severe inflation since the early 2000s, but officials may be breathing a sigh of relief following a recent Confederation of Zimbabwe Industries (CZI) report, which showed inflation to have dropped from 82.7% in September</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/\">Zimbabwe’s inflation drops, but debt management remains key</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/",
            "content": "FAO\n\nZimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025from 1920 November, a flagship event held duringWorld Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the worlds most pressing public health and development challenges\n\nAMR threatens the effective treatment of infections in humans, animals and plants, impacting health systems, food security, trade and the environment. Zimbabwe has made substantial progress, supported by the Fleming Fund and the AMR Multi-Partner Trust Fund, in improving laboratory capacity, AMR and AMU surveillance, infection prevention and control (IPC), biosecurity in the agrifood sector and behaviour change initiatives across communities\n\nThe conference aims to provide a national platform where evidence can be shared widely, partnerships strengthened, and innovations showcased to improve policy influence and sustainability of ongoing AMR interventions.\n\nOver the two days, participants will engage inscientific presentations, panel discussions, exhibitions and poster sessions, covering themes such as surveillance across One Health sectors, stewardship and governance, digital innovation, community-level solutions and policy pathways. The programme features multisectoral speakers including experts from the Ministry of Health and Child Care, Ministry of Lands and Agriculture, FAO, WHO, BRTI, academia, development partners, civil society and the private sector.\n\nA dedicatedInnovation and Exhibition Pavilionwill showcase laboratory tools, digital platforms, biosafety technologies and solutions developed by research institutes, private companies and implementing partners. Youth engagement will be led by the Generational Stewards for Antimicrobials (GSA), underscoring the critical role of young scientists and advocates in sustaining momentum on AMR response.\n\nThe conference will also profile Zimbabwes progress in implementing thesecond National Action Plan for AMR (20242028)and highlight emerging regional opportunities for collaboration.\n\nEvent organizers, including the Government of Zimbabwe through the One Health Secretariat, FAO, WHO and BRTI, affirm that strengthening multisectoral partnerships is key to safeguarding the effectiveness of antimicrobials and securing the countrys health and food systems for future generations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19043945/AMR.jpg",
            "description": "<p>FAO Zimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025 from 19–20 November, a flagship event held during World Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the world’s most pressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/\">Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        },
        {
            "title": "Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute",
            "url": "https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/",
            "content": "By Staff Reporter\n\nFormer legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility.\n\nMliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused his office by allegedly pressuring the City Council to remove residents who acquired land legally along Airport Road.\n\nHarare City Council were intimidated by the office of the Vice President. He forced them to write letters. Vice President can not be using the church to amass wealth for himself and George Charamba, said Mliswa.\n\nThe outspoken politician further called on the Zimbabwe Anti-Corruption Commission (ZACC) to investigate the City Council over the controversial eviction notices.\n\nHere comes the institutions that fight corruption, ZRP, ZACC, you need to investigate Harare City Council. Why they then wrote letters to displace those people when they are the owners of the land? They gave them the land. Everything was paid for. Over US$2 million was paid for that land, then suddenly you think people must just leave because somebody in a higher office, who is a Vice President says something, said Mliswa.\n\nHarare City Council acting Town Clerk Phakamile Mabena Moyo recently issued a three-month notice for the occupants to vacate the land, citing violation of Section 24 of the Regional, Town and Country Planning Act (Chapter 29:12).\n\nMliswas latest remarks come shortly after he accused Chiwengas wife, Minoyothabo Baloyi, of allegedly running a parallel structure in the Zimbabwe National Army.\n\nCity Council, I am going to report you to ZACC for overturning such decisions. That is fraud. If you have overturn decisions of such nature because of certain powers, you will go to jail like a joke, added Mliswa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/30052903/Chiwenga-680x380-1.webp",
            "description": "<p>By Staff Reporter Former legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility. Mliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/\">Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "20 Nov 2025"
        }
    ]
}