{
    "news": [
        {
            "title": "Auditor General’s Report: Over half a billion US dollars paid by Treasury unaccounted for",
            "url": "https://www.newzimbabwe.com/auditor-generals-report-over-half-a-billion-us-dollars-paid-by-treasury-unaccounted-for/",
            "content": "By Costa Nkomo\n\nThe latest Auditor Generals Report has once again raised flagrant breaches of Public Finance Management regulations, revealing that, as of June 2025, a staggering sum exceeding half a billion United States dollars paid by the Treasury to service providers on behalf of Ministries, Departments and Agencies (MDAs) in 2024 remains unaccounted for.\n\nThis substantial shortfall undermines fiscal transparency and accountability, principles crucial for sound governance.\n\nA key finding highlights a failure by MDAs to properly upload payment information onto the Public Finance Management System (PFMS). This omission creates a loophole that could facilitate embezzlement and corruption.\n\nThe report reads: Direct payments amounting to US$1,986,391,797 were made to service providers on behalf of the MDAs by Treasury during the 2024 financial year. However, MDAs accounted for US$1,388,673,713, leaving a balance of US$597,718,082 as at June 18, 2025. In some instances, the payments were not uploaded onto the PFMS. MDAs expenditure was understated by the direct payments.\n\nThis discrepancy represents a significant material misstatement of public accounts.\n\nThe failure to reconcile these payments points to a serious breakdown in internal controls, increasing the risk of fraudulent activity and illicit enrichment.\n\nThe report further details a five-month period of opacity during the currency transition from ZWL to ZWG between April and August 2024. MDAs reportedly operated outside the PFMS during this period, resulting in a vacuum of financial oversight.\n\nThere was a downtime of the Public Financial Management Systems (PFMS) during the country changeover of currency from ZWL$ to Zimbabwe Gold (ZWG) for almost five (5) months (April to August 2024). During that time most MDAs operated outside the PFMS.\n\nThe financial information that would have been processed outside the system was not uploaded onto the system in some cases. Such information would misstate expenditure figures.\n\nThis prolonged systems downtime created a black box scenario, leaving the door open for potentially unlawful financial transactions and making it incredibly difficult to trace the flow of public funds.\n\nMoreover, the Auditor Generals Report casts a spotlight on the widespread abuse of fuel allocations, noting a concerning increase in such incidents compared to 2023.\n\nPoor record-keeping practices and inadequate internal controls were identified as primary contributing factors.\n\nCases of loss of fuel were on the increase. These were attributed to control weaknesses in fuel management, ranging from non-maintenance of fuel registers, inconsistent fuel recordings, non-performance of fuel reconciliations, absence of segregation of duties and weak supervisory checks. In this report, seven (7) MDAs had issues with fuel management. Measures around fuel management should be enhanced, the report added.\n\nThe lack of robust fuel management procedures indicates a serious disregard for public assets, exposing them to potential misappropriation and wastage.\n\nSuch inefficiencies have a detrimental impact on service delivery and overall economic performance.\n\nSection 298 of the Constitution of Zimbabwe enshrines the principles of transparency and accountability within public finance management.\n\nThese findings from the Auditor Generals Report underscore the urgent need for enhanced oversight, stronger internal controls, and the rigorous enforcement of financial regulations to safeguard public funds and promote responsible fiscal governance.\n\nThe scale of the irregularities demands immediate and decisive action to hold those responsible to account and to prevent future occurrences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/17144600/rheah-kujinga.jpg",
            "description": "<p>By Costa Nkomo The latest Auditor General’s Report has once again raised flagrant breaches of Public Finance Management regulations, revealing that, as of June 2025, a staggering sum exceeding half a billion United States dollars paid by the Treasury to service providers on behalf of Ministries, Departments and Agencies (MDAs) in 2024 remains unaccounted for.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/auditor-generals-report-over-half-a-billion-us-dollars-paid-by-treasury-unaccounted-for/\">Auditor General’s Report: Over half a billion US dollars paid by Treasury unaccounted for</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "Serial attempted murder and robbery suspect arrested in Bulawayo",
            "url": "https://www.newzimbabwe.com/serial-attempted-murder-and-robbery-suspect-arrested-in-bulawayo/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Republic Police (ZRP) has arrested a 25-year-old Bulawayo man who is a suspect in a spate of robbery and attempted murder cases in the city.\n\nNdumiso Nxumalo is accused of committing the offences between June 2 and July 24 2025, in Cowdray Park and surrounding areas, Bulawayo.\n\nPolice spokesperson Paul Nyathi said his accomplice, Themba Moyo, is yet to be arrested.\n\nThe suspect, along with his accomplice, Themba Moyo, who is yet to be arrested, would mostly target complainants who will be walking at night.\n\nThey would then attack the complainants threatening them with knives, a machete and an axe,  Nyathi said in a statement.\n\nPolice investigations led to the recovery of eight smartphones from a cellphone dealer in Bulawayo Central District and the subsequent arrest of the suspect.\n\nNxumalo is clearing seven cases of robbery and a case of attempted murder which occurred in Cowdray Park.\n\nAccording to the police, in one of the cases, the suspects attacked a complainant who was walking in Cowdray Park on July 15 2025.\n\nThey threatened him with knives and an axe before robbing him of a Samsung Galaxy Z Flip 4 smartphone, cash and other valuables.\n\nOn 21st July 2025, in Bulawayo Central Business District, the suspects posed as genuine commuters seeking transport to Cowdray Park.\n\nThey boarded a Toyota Wish vehicle. Upon arrival in Cowdray Park, they produced knives and an axe before robbing the complainant of his car and other valuables. The motor vehicle was later dumped in Tsholotsho.\n\nOn July 24 2025, the suspects attacked a 56-year-old man near Tategulu Primary School, Cowdray Park.\n\nIt is alleged that they threatened him with knives and an axe before robbing him of a Samsung Galaxy A16 cellphone and other valuables.\n\nThey went on to attack a 52-year-old man near Emagasini, Cowdray Park, Bulawayo. They struck him on the forehead with an axe and robbed him of a black satchel and a speaker.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Republic Police (ZRP) has arrested a 25-year-old Bulawayo man who is a suspect in a spate of robbery and attempted murder cases in the city. Ndumiso Nxumalo is accused of committing the offences between June 2 and July 24 2025, in Cowdray Park and surrounding areas, Bulawayo. Police spokesperson Paul</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/serial-attempted-murder-and-robbery-suspect-arrested-in-bulawayo/\">Serial attempted murder and robbery suspect arrested in Bulawayo </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "Zimbabwe Under-17 men’s team learns COSAFA Cup opponents",
            "url": "https://www.newzimbabwe.com/zimbabwe-under-17-mens-team-learns-cosafa-cup-opponents/",
            "content": "By Sports Reporter\n\nZimbabwe has learned its opponents for the 2025 COSAFA Under-17 Mens Championship, set to take place from September 11 to 20.\n\nTournament hosts, Zimbabwe have been placed in Group Aalongside Mozambique, Comoros,and Eswatini.\n\nGroup Bfeatures South Africa, Madagascar, Malawi,and defending champions Zambia, while Group Ccomprises Angola, Botswana, Mauritius,and Lesotho.\n\nThis years edition of the tournament will also serve as the regional qualifier for the 2026 Under-17 Africa Cup of Nations (AFCON)for the Southern African countries.\n\nThe top three teams from the tournament will book their places at next years Under-17 mens AFCON, which will also be an Under-17 World Cup Qualifier for Africa.\n\nMeanwhile, the Zimbabwe Football Association (ZIFA) has confirmed that matches will be played at Heart Stadiumin Harareand Ngoni Stadiumin Norton, the home ground of MWOS FC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/05062138/cosafa.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe has learned its opponents for the 2025 COSAFA Under-17 Men’s Championship, set to take place from September 11 to 20. Tournament hosts, Zimbabwe have been placed in Group A alongside Mozambique, Comoros, and Eswatini. Group B features South Africa, Madagascar, Malawi, and defending champions Zambia, while Group C comprises Angola, Botswana, Mauritius, and Lesotho. This year’s edition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-under-17-mens-team-learns-cosafa-cup-opponents/\">Zimbabwe Under-17 men’s team learns COSAFA Cup opponents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "From Silicon Valley to Hollywood: Zimbabweans making a mark in the United States",
            "url": "https://www.newzimbabwe.com/from-silicon-valley-to-hollywood-zimbabweans-making-a-mark-in-the-united-states/",
            "content": "By Staff Reporter\n\nThe United States of America has long been seen as a land of opportunitya place where dreams in various fields can become reality.\n\nWhether that belief holds for everyone is a matter of debate. However, what is undeniable is that many Zimbabweans who have migrated to the U.S. are breaking barriers and achieving remarkable success across diverse sectors.\n\nFrom leading in boardrooms and driving innovation in Silicon Valley, to topping music charts and making their mark in award-winning films, the Zimbabwean story in the U.S. continues to inspire.\n\nNewZimbabwe.comtakes a closer look at some of the Zimbabweans making waves in the United States.\n\nJames Manyika\n\nJames Manyika\n\nManyika is the senior vice president of research, technology and society at Google and co-chair of the UN Secretary-Generals high-level advisory body on AI. Manyika has been working in the Silicon Valley in the United States of America for more than 20 years. He has, over the years, emerged as one of the brilliant minds in technology to have ever emerged from Zimbabwe.\n\nDanai Gurira\n\nGurira is renowned for her work as an actress and playwright. She has featured on a number of projects, which includeThe Walking Dead, Black PantherandMichonne.It is her fearless role as Okoye onBlack Panther,a Marvel Cinematic project that Gurira is widely remembered for. Gurira effortlessly brought the Warrior character to life, defying the stereotypes that African women have been subjected to. Despite being a household name in the United States, Gurira has been ploughing her experiences home through Almasi Collaborative Arts, which has been training actors and playwrights.\n\nJacque Mgido\n\nJacque Mgido\n\nMgido is one of the few entrepreneurs who invested in cosmetics when the business was a nonentity in Zimbabwe. Mgido is a make-up artist based in the United States of America. Mgido, the owner of Vault Cosmetics and Vault Academy Make-up School. She has worked with a number of Hollywood stars such as Snoop Dog, R&B singer John Legend, actor and singer Jamie Foxx and Sylvester Stallone in award-winning projects propping them with her cosmetic touch.\n\nTongai Chirisa\n\nTongai Chirisa\n\nChirisa rose to prominence on local soapie Studio 263 playing the character of detective Trevor Davies. Since then Chirisa has not looked back and has found himself rubbing shoulders with elite acting stars in the United States. He has transformed himself into a Hollywood star. Chirisa recently featured on the AssasinsCreed Shadows.Chirisa has also appeared onNCIS Los Angeles, Robinson Crusoe, AMC horror Mayfair Witchesandhorror movie Antebellum.\n\nAnnatoria\n\nAnnatoria\n\nBlessing Annatoria Chitapa was born in Zimbabwe but was raised in England. Annatoria moved from England to the United States of America where she has been pursuing her musical career. Despite growing up singing in church, Annatoria got a breakthrough when she won the Voice UK in 2020. Recently, she performed at Sarah Jakes Roberts Woman Evolve Conference.\n\nTanyaradzwa Muzinda\n\nTanya Muzinda\n\nMuzinda is a 21-year-old motorcross sensation. Muzinda started her career at a tender age of five and won different races. Muzinda left Zimbabwe with her family in 2019 and has competed in major motocross events in the United States. Away from the tracks, Muzinda has also used her voice to speak out against societal ills like corruption and drug abuse which have become rampant in Zimbabwe. Muzinda has been using her influence on the tracks to make a positive impact on vulnerable children by paying for their tuition fees.\n\nBrian Soko\n\nBrian Soko\n\nSoko is a Grammy Award-winning artist and producer based in the United States. Soko has worked with numerous elite artists in the mould of Beyonce, Jay Z, Casper Nyovest and KO with his Midas touch on projects such as Drunk in Love by the former.\n\nThandiwe Newton\n\nThandiwe Newton\n\nNewton was born to a Zimbabwean mother in Britain. Newton, an award-winning actress, claims close ties to the Liberaton war Hero Herbet Chitepo, who was a family friend. Newton has gone on to carve her heroine status by featuring on ytheLine of Duty Mission Impossible, Star Wars Storyand Tyler PerrysGood Deedsmovies.\n\nThemba Gorimbo\n\nGorimbo is a mixed martial artist making a name for himself in the UFC. Known for his resilience and inspiring journey from rural Zimbabwe to the global MMA stage, Gorimbo has become a symbol of determination and perseverance. Outside the octagon, he has captured hearts with his humility and philanthropy, most notably after revealing he had just $7 to his name before winning a crucial fight, a story which grabbed Dwayne The Rock Johnsons attention.\n\nDumisani Draze Maraire\n\nDumi Draze Maraire\n\nMaraire comes from the musical royalty. He is the son of the late Abraham Dumisani Maraire, who was a master performer who specialised in Mbira. Maraire Junior is the younger brother of Chiwoniso Maraire. Known in the music circles as Draze, Maraire has proved that Mbira rhythm flows in his blood. He has fused the Mbira instrument with the Hip-Hop sound.\n\nZivanai Masango\n\nZivanai Masango\n\nMasango is arguably the unsung hero of Zimbabwean music, having assisted several local artists. Masngo worked with a number of artists  the late Jackie Madondo, Ivy Kombo, Fungisai Mashavave, Vuyo Mokoena and Thembinkosi. Masango was also part of Thomas Mapfumos The Blacks Unlimited. From 2012 to 2015, Masango was part of Oliver Mtukudzis Black Spirits. Using the experience of working with the music legends, Masango is on his own musical path in the United States. Amid COVID-19, Msango brought to life yester-years classics on his YouTube channel. Masango boasts of three albums: Pachedu (2005), Dut-Storm (2007) and Its Time (2014).\n\nJulian King\n\nJulian King\n\nJulian Kanombirira is a Zimbabwean musician based in the United States. Julian King has refused to allow distance to distract his talent from blowing in his country of birth. Julian King rose to prominence with his songRwendowhich was released in 2021. Since then, Julian King has not looked back, releasing hits such asOne by OneandOxygenamong others.\n\nBevan Makaka\n\nBevan Makaka\n\nBevan Makaka is an entrepreneur who is based in the United States. He is the founder of Xcelerate Enterprises, which has a subsidiary, Xcelerate Entertainment, majoring in event planning in the United States.\n\nSibongile Mlambo\n\nSibongile Mlambo\n\nMlambo is a renowned actress with Zimbabwean heritage. She relocated to the United States in 2005 to pursue her studies. Mlambo has starred on Netflix projects such as Lost in Space, Starz, among others. Mlambo has won the European Cinematography Awards for Best Experimental Film for Afrika is a Country.\n\nTinashe Kachingwe\n\nTinashe Kachingwe\n\nKachingwe is a multi-platinum-certified R&B singer, dancer, songwriter and actress. Known as Tinashe, Kachingwe was born in the United States to Zimbabwean father Michael Kachingwe and an American mother. She made acting appearances onCora Unashamed, The Polar ExpressandTwo and a Half Men.On the music scene, Tinashe hogged the limelight with the songOnfeaturing Schoolboy Q and has gone on to work with music giants such as Chris Brown.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/06074108/Danai-Gurira-Black-Panther.webp",
            "description": "<p>By Staff Reporter The United States of America has long been seen as a land of opportunity—a place where dreams in various fields can become reality. Whether that belief holds for everyone is a matter of debate. However, what is undeniable is that many Zimbabweans who have migrated to the U.S. are breaking barriers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-silicon-valley-to-hollywood-zimbabweans-making-a-mark-in-the-united-states/\">From Silicon Valley to Hollywood: Zimbabweans making a mark in the United States</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "Not an isolated case – nurses association slams govt for neglecting bedridden nurse injured on duty seven years ago",
            "url": "https://www.newzimbabwe.com/not-an-isolated-case-nurses-association-slams-govt-for-neglecting-bedridden-nurse-injured-on-duty-seven-years-ago/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Nurses Association (ZINA) has strongly condemned the governments neglect of a Bikita nurse, Progress Muzuva, who was severely injured while on duty seven years ago, calling her case a tragic example of systemic abandonment of front-line health workers.\n\nShe has since been denied compensation, medical support, and justice by the government for which she worked.\n\nIn a statement Tuesday, ZINA president Enock Dongo said Muzuvas case is not an isolated incident and demanded an investigation into the matter.\n\nZINA demands a full investigation into how this matter was handled from the district authorities all the way up to head office.\n\nThose responsible for this neglect must be held accountable. What happened to Nurse Muzuva is not an isolated incident; this is just a drop in the ocean.\n\nAcross Zimbabwe, many nurses are injured while carrying out their duties, some in ambulance accidents while escorting patients, others while lifting immobile patients in wards, Dongo said.\n\nAccording to the nurses association, many health workers get injured on duty and receive no support, treatment, nor compensation.\n\nMany are left to suffer silently in their homes, unable to afford care with the meagre salaries they earn.\n\nThis culture of abandonment is pushing nurses out of the public service and out of the country to search for greener pastures elsewhere.\n\nWe ask again: Who will care for the carers? If the system fails to protect those who risk their lives for patients, then it has failed entirely.\n\nZINA calls on all relevant stakeholders to intervene urgently in Muzuvas case. She must receive immediate medical assistance, financial support, and justice. Her case should set a precedent for change, Dongo added.\n\nMuzuva told this publication that since 2018, the Health Ministry has been refusing to help her from the district level up to the ministers office.\n\nMuzuva was attacked by a violent maternity patientwhom she was escorting to Silveira Hospital in Masvingo for emergency care.\n\nThe violent patient wanted to kill herself and her newborn baby in what medical experts say could have been a case of severe postpartum psychosis.\n\nMuzuva saved the patient and her newly born baby but injured her spine and leg in the process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04042411/Screenshot_20250804-051338_2.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Nurses Association (ZINA) has strongly condemned the government’s neglect of a Bikita nurse, Progress Muzuva, who was severely injured while on duty seven years ago, calling her case a tragic example of systemic abandonment of front-line health workers. She has since been denied compensation, medical support, and justice by the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-an-isolated-case-nurses-association-slams-govt-for-neglecting-bedridden-nurse-injured-on-duty-seven-years-ago/\">Not an isolated case – nurses association slams govt for neglecting bedridden nurse injured on duty seven years ago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "Zimbabwe platinum miners owed millions in unpaid export earnings",
            "url": "https://www.newzimbabwe.com/zimbabwe-platinum-miners-owed-millions-in-unpaid-export-earnings/",
            "content": "Zimbabwes platinum miners are owed millions of dollars in unpaid exports income under the governments foreign currency retention rules, the mining chamber has said, hurting operations in a sector battling torecoverfrom a price collapse.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171542/david-mnangagwa-2.jpg",
            "description": "<p>Reuters Zimbabwe’s platinum miners are owed millions of dollars in unpaid exports income under the government’s foreign currency retention rules, the mining chamber has said, hurting operations in a sector battling to recover from a price collapse. The southern African country requires all exporters to retain only 70% of their proceeds in foreign currency, with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-platinum-miners-owed-millions-in-unpaid-export-earnings/\">Zimbabwe platinum miners owed millions in unpaid export earnings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "A sculpture garden boosts environmental action in Harare",
            "url": "https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/",
            "content": "By Tawanda Mupatsi| DW\n\nZimbabwes capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation?\n\nIn Harare, Zimbabwes capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmentalconservation. The park is a sanctuary where sculptors carve stone works of art inspired byanimalsand other natural forms. It, in turn is designed to protectnature. Indigenous native species have been planted there to help preserve them. Artist and park manager Nicholas Kadzungura explains that they are threatened bydeforestation. The garden, founded in 1970 and named after the sacred Bateleur Eagle, serves as both a creative hub and a living classroom, where visitors learn aboutZimbabwes rich ecological and cultural heritage.\n\nMany sculptures in the park reflect Zimbabwes environmental challenges. Friend of the Rhino, a piece by the late Joseph Ndandarika, which encourages empathy and the protection ofendangered species. With only around 600 black rhinos left in Zimbabwe, the message is pressing. Marcey Mushore, the parks director, explains how animistic Shona traditions guide conservation efforts. The park also acts as agreen lungfor Hararesurban sprawl. Some 2.4 million people live in its metropolitan area and pollution and disappearing green spaces are a problem.\n\nChapungus artists are committed to sharing ancestral knowledge through sculpture workshops and educational programs. Kadzungura stresses that Zimbabwes traditional stone art is not just decorativeit carries lessons about coexistence with nature. Asclimate changeand urban development threaten the countrys wetlands andbiodiversity, the parks mission is becoming more vital. Chapungu inspires action by blending creativity, tradition, and environmental stewardship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/05181947/sculpture-garden.jpeg",
            "description": "<p>By Tawanda Mupatsi | DW Zimbabwe’s capital Harare is facing flooding, heatwaves and declining biodiversity. How does a stone sculpture park help encourage environmental conservation? In Harare, Zimbabwe’s capital, the Chapungu Sculpture Garden offers a unique fusion of art and environmental conservation. The park is a sanctuary where sculptors carve stone works of art inspired by animals and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-sculpture-garden-boosts-environmental-action-in-harare/\">A sculpture garden boosts environmental action in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        },
        {
            "title": "Labour Court orders Fidelity Life to pay former employee over US$271,000 in back pay and damages",
            "url": "https://www.newzimbabwe.com/labour-court-orders-fidelity-life-to-pay-former-employee-over-us271000-in-back-pay-and-damages/",
            "content": "By Mary Taruvinga\n\nThe Labour Court of Zimbabwe has ordered Fidelity Life Assurance and its sister company, Fidelity Funeral Assurance, to pay former employee Nickson Busu a staggering US$271,727.81 in back pay and damages, ending a protracted labour dispute that has spanned more than a decade.\n\nHanding down judgment on 31 July 2025, Justice Makamure ruled that Busu, who was dismissed from employment in July 2013, is entitled to 107 months of unpaid salary, fuel allowances, and 12 months salary as damages in lieu of reinstatement.\n\nWhat this means is that the applicant is entitled to his back pay and benefits.\n\nThese will therefore be granted as prayed.\n\nThe applicant is said to be in his sixties. This appears not to have been disputed by the respondent.\n\nThe chances of him securing alternative employment continue to diminish.\n\nRespondent, on the other hand, simply indicted that the applicant should not get more than 6 months worth of damages. Respondent did not suggest at what rate such damages should be calculated. After assessing the record, including the submissions, it is my considered view that the applicant is entitled to 12 months salary as damages in lieu of reinstatement.\n\nThe applicant is therefore entitled to the following according to his claim, ruled the judge.\n\nBusu, represented by labour lawyer Caleb Mucheche, claimed US$294,396.85 based on a gross monthly salary of US$1,192.00 as reflected in his April 2013 payslip.\n\nFidelity Life had offered damages equivalent to just six months salary, but the court rejected this.\n\nThe case was remitted to the Labour Court for quantification of damages by the Supreme Court under SC597/24, which had earlier confirmed Busus unlawful dismissal and ordered compensation in line with the Labour Act.\n\nBusu argued that he had made reasonable but unsuccessful efforts to secure alternative employment due to age and poor health.\n\nWhile he did not provide specific medical details, the court acknowledged that, at over 60 years old, his chances of re-employment were continuing to diminish.\n\nJustice Makamure cited precedent from Ambali v Bata Shoe Co Ltd 1999(1) ZLR 417 (S), emphasising that although dismissed employees have a duty to mitigate losses by seeking alternative work, employers cannot use that obligation to evade fair compensation.\n\nThe principle that it is the duty of the employer to prove that an employee made efforts to look for employment should not stop a dismissed employee from ensuring that they mitigate their loss, said the judge.\n\nThe breakdown of the court award includes 107 months salary of US$233,348.81, fuel allowance (150 litres/month for 107 months): US$24,075.00 and 12 months salary in lieu of reinstatement: US$14,304.00\n\nThe court ordered Fidelity Life Assurance and Fidelity Funeral Assurance to pay the amount or its equivalent in Zimbabwean dollars using the prevailing official exchange rate on the date of payment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13050811/labour-court.jpeg",
            "description": "<p>By Mary Taruvinga The Labour Court of Zimbabwe has ordered Fidelity Life Assurance and its sister company, Fidelity Funeral Assurance, to pay former employee Nickson Busu a staggering US$271,727.81 in back pay and damages, ending a protracted labour dispute that has spanned more than a decade. Handing down judgment on 31 July 2025, Justice Makamure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-court-orders-fidelity-life-to-pay-former-employee-over-us271000-in-back-pay-and-damages/\">Labour Court orders Fidelity Life to pay former employee over US$271,000 in back pay and damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:47",
            "date": "06 Aug 2025"
        }
    ]
}