{
    "news": [
        {
            "title": "Harare City Council under siege – residents say as government directs parcelling of land to Chiyangwa",
            "url": "https://www.newzimbabwe.com/harare-city-council-under-siege-residents-say-as-government-directs-parcelling-of-land-to-chiyangwa/",
            "content": "By Darlington Gatsi\n\nGOVERNMENTS directive to Harare City Council to award ZANU PF member and businessman Philip Chiyangwa land as compensation is unlawful, residents have said.\n\nThe Ministry of Local Government and Public Works recently instructed the Harare City Council (HCC) to allocate land to Pinnacle Holdings, owned by Chiyangwa, as compensation for property acquired by the government from the company.\n\nCombined Harare Residents Association (CHRA) director Reuben Akili said the directive violates the Constitution by interfering in local authority affairs, undermining the devolution agenda.\n\nThe government has abundant state land across Zimbabwe, including Harare, which it could use to compensate Pinnacle. The directive given to the local authority is a direct attack on Section 276 of the Constitution, which enshrines devolution.\n\nIn fact, this entire land issue is an assault on devolution as provided for in Chapter 14 of the Constitution, particularly Sections 274 and 276. Local authorities must retain autonomy in decision-making, Akili told NewZimbabwe.com.\n\nGovernment has been at loggerheads with Pinnacle Holdings over the land in Harare South which the latter claims ownership of.\n\nThe directive awaits approval from the local authority through a council resolution, which would facilitate the land transfer to Pinnacle Holdings.\n\nAkili further argued that the HCC should not be entangled in the dispute between the government and Pinnacle Holdings, as the council was not party to the original agreement.\n\nIt would be prudent for the local authority, particularly the councillors, to be guided by Chapter 14 of the Constitution on devolution.\n\nThe councillors must recognise that they cannot transfer any land to Pinnacle Holdings, which has no existing agreement with the City of Harare. In fact, Pinnacle Holdings has no locus standi in this matter, Akili said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/17022748/PHILIP-CHIYANGWA-THREE.jpg",
            "description": "<p> By Darlington Gatsi  GOVERNMENT’S directive to Harare City Council to award ZANU PF member and businessman Philip Chiyangwa land as compensation is unlawful, residents have said.    The Ministry of Local Government and Public Works recently instructed the Harare City Council (HCC) to allocate land to Pinnacle Holdings, owned by Chiyangwa, as compensation for property acquired</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-under-siege-residents-say-as-government-directs-parcelling-of-land-to-chiyangwa/\">Harare City Council under siege – residents say as government directs parcelling of land to Chiyangwa  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        },
        {
            "title": "4,912 injuries, 76 fatalities recorded in workplaces in 2024",
            "url": "https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.\n\nVarious factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.\n\nIn a speech read on behalf of the ZCTU President, Florence Taruvinga, to mark this years June 6 commemorations, the labour organ revealed that workplace injuries and fatalities rose significantly during the period.\n\nIn 2024, Zimbabwe experienced a concerning rise in occupational injuries and fatalities. It is reported that there were 4,912 injuries and 76 fatalities throughout the year. What about those accidents that went unreported? It is our demand that we cannot continue to suffer from workplace neglect as workers without the responsible authorities being brought to account for the injuries and deaths being experienced in the workplace, she said.\n\nTaruvinga said the mining industry has become synonymous with unsafe shafts, equipment failure, and weak regulations that are causing unnecessary deaths.\n\nIn Agriculture, she said, employees work without personal protective equipment and are exposed to chemicals, heat stress, and poor living conditions, while in the retail and commercial sectors, workers are exposed to long hours of work, job insecurity and poor ergonomics.\n\nTaruvinga said that in the informal sector, over 80% of workers operate with no safety laws, medical care, or recognisable rights, while the transport and manufacturing sectors have also not been spared, as workers work with very dangerous old and archaic machinery, poorly maintained and without proper safety nets.\n\nAs the voice of workers, we clearly pronounce that enough is enough. We demand the following: Full enforcement of OSH laws across all economic sectors, establishment of functional health and safety committees in every workplace and access to adequate PPE, occupational health training, and medicalservices for all workers, added Taruvinga.\n\nThe June 6 commemorations are held annually to reflect on the Kamandama Mine Disaster, in which 427 miners were killed in 1972 in a mine explosion. The accident, which was attributed to a methane gas explosion, forced the permanent closure of the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) says a total 4 912 injuries and 76 fatalities were recorded in 2024, prompting calls for urgent combative measures.    Various factors, including human error, equipment malfunction, and environmental hazards, can contribute to workplace accidents.   In a speech read on behalf of the ZCTU President, Florence</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/4912-injuries-76-fatalities-recorded-in-workplaces-in-2024/\">4,912 injuries, 76 fatalities recorded in workplaces in 2024  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        },
        {
            "title": "Why are Zimbabwe Police Chasing Off Some of the Economy’s Biggest Players?",
            "url": "https://www.newzimbabwe.com/why-are-zimbabwe-police-chasing-off-some-of-the-economys-biggest-players/",
            "content": "ByLindaMujuruandGamuchiraiMasiyiwa,GPJZimbabwe\n\nThis story was originally published byGlobalPressJournal.\n\nHARARE, ZIMBABWE  The vendors rarely see it coming. The municipal police, some in plainclothes and others in uniform, move through the crowd silent and unnoticed. When they finally strike, panic erupts. Vendors scatter, trampling their goods and grabbing what they can. A few are arrested. Their wares are seized and tossed into the back of a police truck.\n\nThey have no mercy at all. Once they take your stock, youll never get it back, says Saul Nhema, an informal vendor who has been selling vegetables for three months after losing his job as a construction worker.\n\nOn the day of this interview, the municipal police had already raided these informal vendors selling along Park Street in Harares central business district twice. As Global Press Journal reporters interviewed Nhema, they struck again. He grabbed his stock and fled in the middle of the interview.\n\nThe Harare City Council has for years waged such crackdowns on vendors, often destroying goods and deploying heavy police forces. Local government insists these crackdowns are necessary to enforce city bylaws, citing vending from illegal spots, littering and health concerns.\n\nYet the scale and intensity of recent operations, backed by expanding police presence and significant public spending, have raised questions. Critics argue that the government is wasting scarce resources targeting informal vendors all while it struggles to provide city residents with basic services, such as cleanwater.\n\nIn 2024, the councils revenue stood at just US$3 million. But policing costs for these crackdowns exceeded US$24 million, eight times the councils income.\n\nIn 2025, the council escalated its crackdown by creating a specialized police unit to target vendors, further deepening the financial strain with a slight budget increase  and pushing the total to around 12 times its income, which is projected to fall to just US$2 million.\n\nAs the councils income dwindles, the central government shoulders much of the financial burden.\n\nZvikomborero Guvheya serves customers while Saul Nhema arranges vegetables at their vending posts along a Harare sidewalk. Informal vendors like Guvheya and Nhema play a vital role in Zimbabwes struggling economy but face frequent raids, bribe demands and constant threats from municipal police crackdowns.        Photo Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nZvikomborero Guvheya serves customers while Saul Nhema arranges vegetables at their vending posts along a Harare sidewalk. Informal vendors like Guvheya and Nhema play a vital role in Zimbabwes struggling economy but face frequent raids, bribe demands and constant threats from municipal police crackdowns.        Photo Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nGlobal Press Journal made numerous requests for an interview with the mayor. He did not respond.\n\nThe additional cost of the special police unit is hard to justify, given the potential benefits of supporting informal vendors, says Reuben Akili, director of the Combined Harare Residents Association.\n\nIf we examine the funds allocated for enforcement covering salaries, fuel and operational costs, those resources could have been redirected toward rehabilitating markets or public restrooms in the city, Akili says.\n\nThe informal sector already sustains over 80% of Zimbabwes population and contributes nearly 72% to the countrys gross domestic product. Street vendors dominate the sector in many African countries, accounting for over 85% of jobs, many held by women.\n\nIn Zimbabwe, the vendors are becoming increasingly critical, as the countrys currency crisis forces many retail shops to shut down.\n\nDespite this central role in many economies across the continent, vendors face common struggles. Many work in hostile, unregulated spaces, and they are routinely evicted under the pretext of urban order or dismissed as a threat to the health of formal economies.\n\nA special municipal police unit to push out this critical population in Harare will only inflate the citys workforce, which ultimately burdens taxpayers, Akili says. Instead, he says the council should build infrastructure where vendors can comfortably work.\n\nAn aerial view shows a municipal police truck carrying goods confiscated from vendors. Vendors who are arrested during crackdowns often lose their stock permanently, with little recourse to reclaim their goods.Photo credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThere are some designated spaces within the central business district, but many vendors shun these, citing the high cost of renting stalls and a lack of foot traffic, which limits their ability to attract customers. Additionally, these spaces require a formal business license, which costs between US$400 and US$800 per year. In an economy that has struggled for decades, this cost is prohibitive for many.\n\nThe council must strike a balance between tackling these issues without undermining the livelihoods of those who depend on the informal economy, says Samuel Wadzai, director of Vendors Initiative for Social and Economic Transformation, a nonprofit that represents vendors.\n\nRaids havent been effective, he says, not even when a former minister of local government requested deployment of the army to push out vendors.\n\nDespite this central role in many economies across the continent, vendors face common struggles. Many work in hostile, unregulated spaces, and they are routinely evicted under the pretext of urban order or dismissed as a threat to the health of formal economies.\n\nDid that result in any significant change in terms of the challenges that we are seeing? I think its a big no, Wadzai says.\n\nAt times, vendors resort to bribing officers to avoid the disruption of evictions. Jesman Guvheya has worked as an informal vendor for two years. The widowed mother of five says the police sometimes demand US$1 a day from each vendor.\n\nBut there can be three or four groups that move at different times per day and you may end up paying 4 US dollars to avoid being raided, she says.\n\nAnd that bribe is never a guarantee one will trade without interruption. The police could swoop in and confiscate everything, even after a vendor has paid the bribe. Sometimes we are left with little stock that we will have secured elsewhere, she says, preparing to flee from police she has just spotted.\n\nAlthough Guvheya escaped arrest that day, her son, also a street vendor, wasnt as fortunate. The council police apprehended him, and she had to follow the truck to pay a bribe so he could be freed.\n\nLinda Mujuruis a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGamuchirai Masiyiwais a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09170953/01_gpjnews_zim_lm_vendors_-53-_l.jpeg",
            "description": "<p>By Linda Mujuru and Gamuchirai Masiyiwa, GPJ Zimbabwe   This story was originally published by Global Press Journal.     HARARE, ZIMBABWE — The vendors rarely see it coming. The municipal police, some in plainclothes and others in uniform, move through the crowd silent and unnoticed. When they finally strike, panic erupts. Vendors scatter, trampling their goods and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-are-zimbabwe-police-chasing-off-some-of-the-economys-biggest-players/\">Why are Zimbabwe Police Chasing Off Some of the Economy’s Biggest Players?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        },
        {
            "title": "Smith to retire from Kavango Resources",
            "url": "https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/",
            "content": "By Alois Vinga\n\nKAVANGO Resources Plcboard chairman David Smith has indicated the intention to retire at the end of June 2025.\n\nHe steps down after a long and illustrious career, devoting considerable experience which raised the groups flag.\n\nThe company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board. Peter, who is currently the Non-Executive Deputy Chairman, will assume the position when David steps down.\n\nPeter is an experienced lawyer who has focused on financing and managing mining companies. He has raised capital for the development of mining projects since 1990.\n\nSuccessful projects include the development of a gold mine in Zambia, a copper mine in Zimbabwe and the Skorpion zinc mine in Namibia prior to its takeover by Anglo-American. He recently retired from Mexico Resources plc, where he was the founder and executive chairman, the company said in a statement.\n\nKavango also announced the appointment of Gautam Dalal, who will join the Company as a non-executive director, the effective date is expected to be 1 July 2025. The Company welcomes Gautam Dalal to the Board. Gautam Dalal joins the Company as a non-executive director.\n\nGautam is a chartered accountant with over 30 years of experience with KPMG London, where he was a partner from 1990 to 2010. From 1993 to 1997 he was responsible for the commencement of KPMGs business in India where he was based.\n\nGautam returned to India in 2000 as Chairman and Chief Executive Officer of KPMGs Indian operations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09181535/smith-david.jpeg",
            "description": "<p>By Alois Vinga KAVANGO Resources Plc board chairman David Smith has indicated the intention to retire at the end of June 2025.  He steps down after a long and illustrious career, devoting considerable experience which raised the group’s flag.  The company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/\">Smith to retire from Kavango Resources </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        },
        {
            "title": "Trump travel ban barring citizens from 12 countries takes effect",
            "url": "https://www.newzimbabwe.com/trump-travel-ban-barring-citizens-from-12-countries-takes-effect/",
            "content": "BBC\n\nPresident Donald Trumps sweeping new travel ban which bars citizens of 12 countries from entering the United States came into effect at 00:00 ET (05:00 BST) on Monday.\n\nThe order, which Trump signed last week, restricts the nationals of Afghanistan, Myanmar, Chad, Congo-Brazzaville, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen from entering the US.\n\nNationals from a further seven countries  Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela  will face partial travel restrictions.\n\nThe US president saidthe listcould be revised if material improvements were made, while other countries could be added as threats emerge around the world.\n\nIt is the second time Trump has ordered a ban on travel from certain countries. He signed a similar order in 2017 during his first term in office.\n\nThe White House said these common sense restrictions would protect Americans from dangerous foreign actors.\n\nThere are a number of people from affected countries who may still be able to enter the US due to a number of exceptions. The order does not apply to:\n\nIn a video posted to his Truth Social website last week, Trump said the recent attack in Boulder, Colorado underscored the extreme dangers posed by foreign nationals who had not been properly vetted.\n\nTwelve people were injured in Colorado on 1 June when a man attacked a group gathering in support of Israeli hostages. The FBI called it a suspected terror attack and said the suspect had used a makeshift flamethrower, Molotov cocktails and other incendiary devices.\n\nThe man accused of carrying out the attack was identified as an Egyptian national, but Egypt has not been included on the list of banned countries.\n\nTrumps latest order, which is likely to face legal challenges, drew a swift response, at home and abroad.\n\nChad retaliated by suspending all visas to US citizens while Somalia promised to work with the US to address security issues.\n\nThe African Union, which represents all countries on the continent, called on the US to engage in constructive dialogue with the countries concerned.\n\nIn the US, Democrats were quick to condemn the move.\n\nThis ban, expanded from Trumps Muslim ban in his first term, will only further isolate us on the world stage, Congresswoman Pramila Jayapal wrote on social media.\n\nBut others support the ban.\n\nCongressman Clay Higgins of Louisiana told the BBC that travel to the US was a privilege, not a right.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09201449/TRUMP-D.webp",
            "description": "<p>BBC President Donald Trump’s sweeping new travel ban which bars citizens of 12 countries from entering the United States came into effect at 00:00 ET (05:00 BST) on Monday. The order, which Trump signed last week, restricts the nationals of Afghanistan, Myanmar, Chad, Congo-Brazzaville, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-travel-ban-barring-citizens-from-12-countries-takes-effect/\">Trump travel ban barring citizens from 12 countries takes effect</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        },
        {
            "title": "Judge dismisses Justin Baldoni’s $400m defamation lawsuit against Blake Lively",
            "url": "https://www.newzimbabwe.com/judge-dismisses-justin-baldonis-400m-defamation-lawsuit-against-blake-lively/",
            "content": "BBC\n\nA New York judge has dismissed Justin Baldonis $400m (295m) defamation lawsuit against his former co-star Blake Lively.\n\nThe pair, who both starred in the 2024 film It Ends with Us, have been locked in a legal battle for several months, with a trial set for next year.\n\nJudge Lewis Liman on Monday dismissed Baldonis countersuit, which alleged extortion, defamation and other allegations.\n\nBaldoni brought the suit after Lively filed a legal complaint last year against her former co-star, accusing him of sexual harassment and starting a smear campaign against her.\n\nLively filed a suit against Baldonis Wayfarer Studios in December 2024, alleging she was sexually harassed on set and that Baldoni retaliated against her for bringing those complaints, among other allegations.\n\nLively also shared details of the allegations in a New York Times article published before her lawsuit.\n\nBaldoni then brought defamation suits against Lively, her husband Ryan Reynolds, their publicist, claiming they were aiming to ruin his career and reputation with the allegations, as well as the New York Times.\n\nBaldonis lawsuit centred on two claims: that Lively stole the film from Baldoni and his company Wayfarer by threatening not to promote it, and that she and others promoted a false narrative that Baldoni sexually assaulted her and launched a smear campaign against her, Judge Liman explained in his opinion.\n\nBut Baldoni and his production company have not adequately alleged that Livelys threats were wrongful extortion rather than legally permissible hard bargaining or renegotiation of working conditions, he wrote.\n\nAdditionally, the judge wrote, Baldoni and his company had not proved defamation because the Wayfarer Parties have not alleged that Lively is responsible for any statements other than the statements in her lawsuit, which are privileged.\n\nThe judge also determined that evidence did not show that the New York Times acted with actual malice in publishing their story, dismissing that $250m suit as well.\n\nThe alleged facts indicate that the Times reviewed the available evidence and reported, perhaps in a dramatized manner, what it believed to have happened, he wrote. The Times had no obvious motive to favor Livelys version of events.\n\nIn a statement shared with US media, Livelys lawyers called the opinion a total victory and a complete vindication for Blake Lively, along with those that Justin Baldoni and the Wayfarer Parties dragged into their retaliatory lawsuit, including Ryan Reynolds, Leslie Sloane and The New York Times.\n\nAs we have said from day one, this $400 million lawsuit was a sham, and the Court saw right through it, her lawyers said.\n\nThe BBC has contacted Baldonis lawyers for comment.\n\nJudge Liman said Baldoni would be allowed to amend and refile his allegations related to interference with contracts by 23 June.\n\nJudge Limans dismissal comes a week after Lively asked to withdraw two of the claims in her suit against Baldoni  intentional infliction of emotional distress and negligent infliction of emotional distress.\n\nIn the original lawsuit, she claimed she experienced severe emotional distress in response to the alleged sexual harassment and smear campaign.\n\nIt Ends With Us is an adaption of a best-selling Colleen Hoover novel, which features Blake Lively as the main character, Lily Bloom, a young woman who grew up witnessing domestic abuse and finds herself in the same position years later.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09201632/BLAKE-JUSTIN.webp",
            "description": "<p>BBC A New York judge has dismissed Justin Baldoni’s $400m (£295m) defamation lawsuit against his former co-star Blake Lively. The pair, who both starred in the 2024 film It Ends with Us, have been locked in a legal battle for several months, with a trial set for next year. Judge Lewis Liman on Monday dismissed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-dismisses-justin-baldonis-400m-defamation-lawsuit-against-blake-lively/\">Judge dismisses Justin Baldoni’s $400m defamation lawsuit against Blake Lively</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        },
        {
            "title": "Warriors ready to take on Niger",
            "url": "https://www.newzimbabwe.com/warriors-ready-to-take-on-niger/",
            "content": "By Sport Reporter\n\nAfter losing 2-0 to Burkina Faso on Friday last week, Zimbabwe senior mens team will be hoping to redeem themselves on Tuesday in a friendly match against Niger.\n\nScheduled to be played at Stade Pre Jgo stadium, Tuesdays match will complete the Warriors fixtures for the June FIFA international break, which started last week.\n\nZimbabwe faced criticism from fans after a poor performance against Burkina Faso on Friday, although team coach Michael Nees said the friendly was all about giving a chance to new players and trying new combinations.\n\nNees dropped key players like captain Marvellous Nakamba, his vice Marshall Munetsi and Knowledge Musona for the two friendlies.\n\nFor the German tactician, the two friendly matches against Burkina Faso and Niger are an opportunity to develop other players.\n\nEvery match is played to win, but we must also not forget development and the bigger picture, which is AFCON.\n\nIm quite confident that the boys tomorrow will be a new team and they will give everything to try and win that game, said Warriors coach Michael Nees ahead of Niger clash.\n\nNew players that Michael Nees called up for the two friendlies are Belgium-based Bill Antonio, German-based Jonah Fabisch, Tel Ones Tawanda Macheke and goalkeeper Elvis Chipezeze.\n\nNiger is currently ranked on position 122, that is six places below Zimbabwe who are on 116.\n\nTuesdays meeting will be the first between the two nations, and for Zimbabwe, this will also serve as preparations to the 2025 AFCON finals scheduled for December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sport Reporter After losing 2-0 to Burkina Faso on Friday last week, Zimbabwe senior men’s team will be hoping to redeem themselves on Tuesday in a friendly match against Niger.  Scheduled to be played at Stade Père Jégo stadium, Tuesday’s match will complete the Warriors’ fixtures for the June FIFA international break, which started</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-ready-to-take-on-niger/\">Warriors ready to take on Niger </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "10 Jun 2025"
        }
    ]
}