{
    "news": [
        {
            "title": "A year later, Information minister belatedly appoints ZBC board",
            "url": "https://www.newzimbabwe.com/a-year-later-information-minister-belatedly-appoints-zbc-board/",
            "content": "By Staff Reporter\n\nINFORMATION, Publicity and Broadcasting Services Minister Jenfan Muswere has finally officially appointed the Zimbabwe Broadcasting Corporation (ZBC) board, a year after some of its members started work.\n\nThe 13-member board, chaired by Helliate Rushwaya, was curiously endorsed through a Government Gazette notice issued on Friday, June 13, 2025, more than a year after some of its appointees were named in January 2024.Come July lastyear, Muswere made four additional appointments to the board of the troubled State broadcaster before making further appointments February 2025. Respected lawyer Lewis Uriri, earlier appointed to the structure, quit over unspecified reasons.Information Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nThe 13-member board, chaired by Helliate Rushwaya, was curiously endorsed through a Government Gazette notice issued on Friday, June 13, 2025, more than a year after some of its appointees were named in January 2024.\n\nCome July lastyear, Muswere made four additional appointments to the board of the troubled State broadcaster before making further appointments February 2025. Respected lawyer Lewis Uriri, earlier appointed to the structure, quit over unspecified reasons.Information Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nCome July lastyear, Muswere made four additional appointments to the board of the troubled State broadcaster before making further appointments February 2025. Respected lawyer Lewis Uriri, earlier appointed to the structure, quit over unspecified reasons.\n\nInformation Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nInformation Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nIt is hereby notified that the Minister of Information, Publicity and Broadcasting Services has, in terms of section 11(13) of the Public Entities Corporate Governance Act (Chapter 10:31), appointed the persons specified in the Schedule as members of the Zimbabwe Broadcasting Corporation Board, for a period of four (4) years, reads the notice.The new ZBC board chair Rushwaya will be deputised by Advocate Tapson Dzvetero while other members are Chipo Nheta, Henry Mukono, Nannette Silukhuni, Charles Munganasa, Precious Charandura, Thandolwenkosi Nkomo, Sibongile Mpofu, Queen Mpofu and Among Craig Matambo.\n\nIt is hereby notified that the Minister of Information, Publicity and Broadcasting Services has, in terms of section 11(13) of the Public Entities Corporate Governance Act (Chapter 10:31), appointed the persons specified in the Schedule as members of the Zimbabwe Broadcasting Corporation Board, for a period of four (4) years, reads the notice.\n\nThe new ZBC board chair Rushwaya will be deputised by Advocate Tapson Dzvetero while other members are Chipo Nheta, Henry Mukono, Nannette Silukhuni, Charles Munganasa, Precious Charandura, Thandolwenkosi Nkomo, Sibongile Mpofu, Queen Mpofu and Among Craig Matambo.\n\nThe new ZBC board chair Rushwaya will be deputised by Advocate Tapson Dzvetero while other members are Chipo Nheta, Henry Mukono, Nannette Silukhuni, Charles Munganasa, Precious Charandura, Thandolwenkosi Nkomo, Sibongile Mpofu, Queen Mpofu and Among Craig Matambo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/20174306/ZBC.jpg",
            "description": "<p>By Staff Reporter   INFORMATION, Publicity and Broadcasting Services Minister Jenfan Muswere has finally officially appointed the Zimbabwe Broadcasting Corporation (ZBC) board, a year after some of its members started work. The 13-member board, chaired by Helliate Rushwaya, was curiously endorsed through a Government Gazette notice issued on Friday, June 13, 2025, more than a year</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-year-later-information-minister-belatedly-appoints-zbc-board/\">A year later, Information minister belatedly appoints ZBC board</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "Thief to spend 10 years in prison for stealing ZESA armoured copper cables",
            "url": "https://www.newzimbabwe.com/thief-to-spend-10-years-in-prison-for-stealing-zesa-armoured-copper-cables/",
            "content": "By Staff Reporter\n\nA 32-year-old man will spend the next 10 years behind bars following his conviction of theft of armoured copper cables used in electricity transmission.\n\nAccused person, Armstrong Trust Nsingo of Wedza appeared before Zvishavane Magistrates Court facing a charge of stealing armoured electrical copper cables belonging to the Zimbabwe Electricity Supply Authority (ZESA).Court heard that police officers, acting on a tip off, raided Nsingos residence around lunch hour.A search of the premises led to the recovery of several lengths of armoured copper cables and cable armour wire stashed under his bed.In total, the loot included four pieces of 10m x 7 x 2 core copper cable, an 18m x 2 core cable and 100 metres of armoured copper wire.Upon further interrogation, Nsingo failed to produce any licence or documentation authorising his possession of the electrical material, leading to his arrest.The stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\nAccused person, Armstrong Trust Nsingo of Wedza appeared before Zvishavane Magistrates Court facing a charge of stealing armoured electrical copper cables belonging to the Zimbabwe Electricity Supply Authority (ZESA).\n\nCourt heard that police officers, acting on a tip off, raided Nsingos residence around lunch hour.A search of the premises led to the recovery of several lengths of armoured copper cables and cable armour wire stashed under his bed.In total, the loot included four pieces of 10m x 7 x 2 core copper cable, an 18m x 2 core cable and 100 metres of armoured copper wire.Upon further interrogation, Nsingo failed to produce any licence or documentation authorising his possession of the electrical material, leading to his arrest.The stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\nCourt heard that police officers, acting on a tip off, raided Nsingos residence around lunch hour.\n\nA search of the premises led to the recovery of several lengths of armoured copper cables and cable armour wire stashed under his bed.In total, the loot included four pieces of 10m x 7 x 2 core copper cable, an 18m x 2 core cable and 100 metres of armoured copper wire.Upon further interrogation, Nsingo failed to produce any licence or documentation authorising his possession of the electrical material, leading to his arrest.The stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\nA search of the premises led to the recovery of several lengths of armoured copper cables and cable armour wire stashed under his bed.\n\nIn total, the loot included four pieces of 10m x 7 x 2 core copper cable, an 18m x 2 core cable and 100 metres of armoured copper wire.Upon further interrogation, Nsingo failed to produce any licence or documentation authorising his possession of the electrical material, leading to his arrest.The stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\nIn total, the loot included four pieces of 10m x 7 x 2 core copper cable, an 18m x 2 core cable and 100 metres of armoured copper wire.\n\nUpon further interrogation, Nsingo failed to produce any licence or documentation authorising his possession of the electrical material, leading to his arrest.The stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\nUpon further interrogation, Nsingo failed to produce any licence or documentation authorising his possession of the electrical material, leading to his arrest.\n\nThe stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\nThe stolen material, weighing 22.85 kilogrammes and valued at US$950, was recovered in full.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/12154831/Copper2.jpg",
            "description": "<p>By Staff Reporter  A 32-year-old man will spend the next 10 years behind bars following his conviction of theft of armoured copper cables used in electricity transmission. Accused person, Armstrong Trust Nsingo of Wedza appeared before Zvishavane Magistrates Court facing a charge of stealing armoured electrical copper cables belonging to the Zimbabwe Electricity Supply Authority</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thief-to-spend-10-years-in-prison-for-stealing-zesa-armoured-copper-cables/\">Thief to spend 10 years in prison for stealing ZESA armoured copper cables</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "Israel-Iran strikes: What are the worst-case scenarios?",
            "url": "https://www.newzimbabwe.com/israel-iran-strikes-what-are-the-worst-case-scenarios/",
            "content": "By BBC News\n\nFRIDAY night saw Israel and Iran exchange a barrage of air strikes.\n\nFor now, the fighting between Israel and Iran seems restricted to the two nations. At the United Nations and elsewhere there have been widespread calls for restraint.\n\nBut what if they fall on deaf ears? What if the fighting escalates and expands?\n\nHere are just a few possible, worst-case scenarios.\n\nAmerica gets dragged in\n\nFor all the US denials, Iran clearly believes American forces endorsed and at least tacitly supported Israels attacks.\n\nIran could strike US targets across the Middle East  such as special forces camps in Iraq, military bases in the Gulf, and diplomatic missions in the region.\n\nIrans proxy forces  Hamas and Hezbollah  may be much diminished but its supportive militias in Iraq remain armed and intact.\n\nThe US feared such attacks were a possibility and withdrew some personnel. In its public messaging, the US has warned Iran firmly of the consequences of any attack on American targets.\n\nWhat might happen if an American citizen were killed, say, in Tel Aviv or elsewhere?\n\nDonald Trump might find himself forced to act. Israels Prime Minister Benjamin Netanyahu has long been accused of wanting to drag the US into helping him defeat Iran.\n\nMilitary analysts say only the US has the bombers and bunker-busting bombs that can penetrate the deepest of Iranian nuclear facilities, especially that of Fordow.\n\nTrump promised his MAGA constituency he would not start any so-called forever wars in the Middle East. But equally many Republicans support both Israels government and its view that now is the time to seek regime change in Tehran.\n\nBut if America were to become an active combatant, that would represent a huge escalation with a long, potentially devastating consequential tail.\n\nIran is reeling from Israels unprecedented attack  and it is only the start\n\nGulf nations get dragged in\n\nIf Iran failed to damage Israels well-protected military and other targets, then it could always aim its missiles at softer targets in the Gulf, especially countries that Iran believes aided and abetted its enemies over the years.\n\nThere are lots of energy and infrastructure targets in the region. Remember Iran was accused of striking Saudi Arabias oil fields in 2019 and its Houthi proxies hit targets in the UAE in 2022.\n\nSince then, there has been a reconciliation of sorts between Iran and some countries in the region.\n\nBut these countries play host to US airbases. Some also  discreetly  helped defend Israel from Iranian missile attack last year.\n\nIf the Gulf were attacked, then it too might demand American warplanes come to its defence as well as Israels.\n\nIsrael fails to destroy Irans nuclear capability\n\nWhat if the Israeli attack fails? What if Irans nuclear facilities are too deep, too well protected? What if its 400kg of 60% enriched uranium  the nuclear fuel that is just a small step away from being fully weapons-grade, enough for ten bombs or so  is not destroyed?\n\nIts thought it may be hidden deep in secret mines. Israel may have killed some nuclear scientists but no bombs can destroy Irans knowhow and expertise.\n\nWhat if Israels attack convinces Irans leadership that its only way of deterring further attacks is to race for nuclear capability as fast as it can?\n\nWhat if those new military leaders round the table are more headstrong and less cautious than their dead predecessors?\n\nAt the very least, this could force Israel to further attacks, potentially binding the region into a continual round of strike and counter-strike. Israelis have a brutal phrase for this strategy; they call it mowing the grass.\n\nTheres a global economic shock. The price of oil is already soaring.\n\nWhat if Iran tried to close the Strait of Hormuz, further restricting the movement of oil?\n\nWhat if  on the other side of the Arabian Peninsula  the Houthis in Yemen redouble their efforts to attack shipping in the Red Sea? They are Irans last remaining so-called proxy ally with a track record of unpredictability and high risk appetite.\n\nMany countries around the world are already suffering a cost of living crisis. A rising price of oil would add to inflation on a global economic system already creaking under the weight of Trumps tariff war.\n\nAnd lets not forget, the one man who benefits from rising oil prices is President Putin of Russia who would suddenly see billions more dollars flood into Kremlin coffers to pay for his war against Ukraine.\n\nIrans regime falls, leaving a vacuum\n\nWhat if Israel succeeded in its long term aim of forcing the collapse of the Islamic revolutionary regime in Iran?\n\nNetanyahu claims his primary aim is to destroy Irans nuclear capability. But he made clear in his statement yesterday that his broader aim involves regime change.\n\nHe told the proud people of Iran that his attack was clearing the path for you to achieve your freedom from what he called their evil and oppressive regime.\n\nBringing down Irans government might appeal to some in the region, especially some Israelis. But what vacuum might it leave? What unforeseen consequences would there be? What would civil conflict in Iran look like?\n\nMany can remember what happened to both Iraq and Libya when strong centralised government was removed.\n\nSo, much depends on how this conflict progresses in coming days.\n\nHow  and how hard  will Iran retaliate? And what restraint  if any  can the US exert on Israel?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10203719/Iran-Israel.jpg",
            "description": "<p>By BBC News  FRIDAY night saw Israel and Iran exchange a barrage of air strikes. For now, the fighting between Israel and Iran seems restricted to the two nations. At the United Nations and elsewhere there have been widespread calls for restraint. But what if they fall on deaf ears? What if the fighting escalates</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/israel-iran-strikes-what-are-the-worst-case-scenarios/\">Israel-Iran strikes: What are the worst-case scenarios?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "Orlando Pirates to pay R15 million for Zimbabwean football sensation as European club shows interest",
            "url": "https://www.newzimbabwe.com/orlando-pirates-to-pay-r15-million-for-zimbabwean-football-sensation-as-european-club-shows-interest/",
            "content": "By James Muonwa\n\nHIGHLANDERS Football Club could soon be pocketing hefty transfer fees for its prodigy Prince Ndlovu after South African premiership side Orlando Pirates expressed interest in the player.\n\nAccording to recent media reports coming from across the Limpopo, Pirates are racing against European interest to sign Ndlovu, with his club demanding a record-breaking R15m.\n\nOrlando Pirates lead the local charge, but theyre not alone. Zimbabwes brightest football talent has sparked a bidding war as Highlanders FC demand a jaw-dropping R15 million for teenage winger Prince Ndlovu The move has sent shockwaves through South African football circles, an SA publication wrote.\n\nNdlovu, often referred to as the next Peter Ndlovu, has long attracted interest from top clubs, having previously trained with the Buccaneers in Houghton before a failed European stint. Now, with his stock soaring, Highlanders are playing hardball.\n\nHighlanders FC value Prince (Ndlovu) and thats why they are pricing him at around R15 million. The club believe its a fair price looking at his talent, quality and future ahead of him, a club official said, as quoted by Soccer Laduma.\n\nHighlanders play the long game as bids loom\n\nThe Bulawayo giants arent rushing to cash in. Their valuation isnt just based on local interest, its also shaped by serious attention from abroad.\n\nApart from Orlando Pirates there is a European club that has been monitoring him for some time now. Its Sturm Graz from the Austria Bundesliga, a source revealed.\n\nThis European connection could tip the scale and inflate the price further.\n\nA R15 million fee would rank among the highest for any player moving directly from the Zimbabwe Premier Soccer League. Its a bold statement from Highlanders, and a sign of just how highly they rate the 19-year-old winger.\n\nNdlovu was recently donning national colours at the COSAFA Cup in Bloemfontein, offering football scouts from across the continent a front-row seat to evaluate his explosive potential. Pirates are believed to have sent representatives to monitor him closely.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/15033221/Prince-Ndlovu-at-Highlanders-FC-Image-via-%40HighlandersFC-on-X-e1749556433910-750x520-1.webp",
            "description": "<p>By James Muonwa  HIGHLANDERS Football Club could soon be pocketing hefty transfer fees for its prodigy Prince Ndlovu after South African premiership side Orlando Pirates expressed interest in the player. According to recent media reports coming from across the Limpopo, Pirates are racing against European interest to sign Ndlovu, with his club demanding a record-breaking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/orlando-pirates-to-pay-r15-million-for-zimbabwean-football-sensation-as-european-club-shows-interest/\">Orlando Pirates to pay R15 million for Zimbabwean football sensation as European club shows interest </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "CAPS United beat Chicken Inn, break seven-year jinx",
            "url": "https://www.newzimbabwe.com/caps-united-beat-chicken-inn-break-seven-year-jinx/",
            "content": "By Sports Reporter\n\nKUNDAI Benyus header was enough to give CAPS United a 1-0 win over Chicken Inn FC Saturday afternoon to end a seven-year jinx.\n\nMakepekepes last won 2-1 against Chicken Inn FC in 2018.Despite creating more chances in the game, Chicken Inn failed to convert four clear chances, which could have buried Makepekepe.However, Benyus 64th minute header separated the two sides and gave Makepekepe the much needed three points.Other than ending a winless run against Chicken Inn, Saturdays win was the second for CAPS United coach Ian Bakala, who assumed office in May.I give credit to the boys, because l think the winning mentality is coming.We still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.CAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nMakepekepes last won 2-1 against Chicken Inn FC in 2018.\n\nDespite creating more chances in the game, Chicken Inn failed to convert four clear chances, which could have buried Makepekepe.However, Benyus 64th minute header separated the two sides and gave Makepekepe the much needed three points.Other than ending a winless run against Chicken Inn, Saturdays win was the second for CAPS United coach Ian Bakala, who assumed office in May.I give credit to the boys, because l think the winning mentality is coming.We still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.CAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nDespite creating more chances in the game, Chicken Inn failed to convert four clear chances, which could have buried Makepekepe.\n\nHowever, Benyus 64th minute header separated the two sides and gave Makepekepe the much needed three points.Other than ending a winless run against Chicken Inn, Saturdays win was the second for CAPS United coach Ian Bakala, who assumed office in May.I give credit to the boys, because l think the winning mentality is coming.We still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.CAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nHowever, Benyus 64th minute header separated the two sides and gave Makepekepe the much needed three points.\n\nOther than ending a winless run against Chicken Inn, Saturdays win was the second for CAPS United coach Ian Bakala, who assumed office in May.I give credit to the boys, because l think the winning mentality is coming.We still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.CAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nOther than ending a winless run against Chicken Inn, Saturdays win was the second for CAPS United coach Ian Bakala, who assumed office in May.\n\nI give credit to the boys, because l think the winning mentality is coming.We still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.CAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nI give credit to the boys, because l think the winning mentality is coming.\n\nWe still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.CAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nWe still have work to do, but the players now understand our working culture. So, we are going step-by-step, and l am happy, said Bakala.\n\nCAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.For Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nCAPS United continue to climb out of the relegation zone as they are now on position 13 with 16 points.\n\nFor Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.Commenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nFor Chicken Inn, Saturdays defeat worsened the situation for team head coach Joey Antipas, whose job is on the line.\n\nCommenting following the defeat, Antipas rued missed chances.All l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nCommenting following the defeat, Antipas rued missed chances.\n\nAll l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.Chicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nAll l can say is football is a crazy game, its cruel. It showed its cruelty today. If you look at the game, we dominated the game and created for clear chances but they (CAPS United ) created one.\n\nChicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.Saturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nChicken Inn is now sitting on position 15 with 13 points, five ahead of bottom-placed Kwekwe United.\n\nSaturday 14 June PSL ResultsBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nSaturday 14 June PSL Results\n\nBikita Minerals 1-1 DynamosNgezi Platinum Stars 1-1 Manica DiamondsYadah 1-1 HerentalsGreenfuel 0-1 Tel OneFC Platinum 4-0 ZPC KaribaCAPS United 1-0 Chicken Inn.\n\nBikita Minerals 1-1 Dynamos\n\nNgezi Platinum Stars 1-1 Manica Diamonds\n\nYadah 1-1 Herentals\n\nGreenfuel 0-1 Tel One\n\nFC Platinum 4-0 ZPC Kariba\n\nCAPS United 1-0 Chicken Inn.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/03094523/279847300_512370347020948_5578061637849601225_n.jpg",
            "description": "<p>By Sports Reporter KUNDAI Benyu’s header was enough to give CAPS United a 1-0 win over Chicken Inn FC Saturday afternoon to end a seven-year jinx. Makepekepe’s last won 2-1 against Chicken Inn FC in 2018. Despite creating more chances in the game, Chicken Inn failed to convert four clear chances, which could have buried</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caps-united-beat-chicken-inn-break-seven-year-jinx/\">CAPS United beat Chicken Inn, break seven-year jinx</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "Human rights violations ease in May; Zanu PF still tops perpetrators’ list— Report",
            "url": "https://www.newzimbabwe.com/human-rights-violations-ease-in-may-zanu-pf-still-tops-perpetrators-list-report/",
            "content": "By Costa Nkomo\n\nTHE Zimbabwe Peace Project (ZPP) reports a slight improvement in the countrys human rights situation, with violations dropping by 10 percent in May 2025 compared to April 2025.\n\nIn a report released Saturday, the human rights watchdog documented 83 human rights violations across various areas, including during government-led food aid distribution, instances of political harassment, and restrictions on freedom of assembly and expression.\n\nIn May 2025, the Zimbabwe Peace Project recorded a total of 83 human rights violations affecting 5,376 victims nationwide, a 10% decline from the violations recorded in May where 6,059 people were affected, part of the report reads.\n\nThese violations included breaches of personal security, acts of intimidation and harassment, assault, political discrimination in the distribution of government-sponsored food aid, restrictions on freedoms of expression, assembly, and association, as well as limited access to social services.\n\nOther incidents included unjustified arrests, unlawful evictions, malicious damage to property, inhumane and degrading treatment, and restricted access to information.\n\nFor the second consecutive month, ZanuPF has been identified as the primary perpetrator of violence, followed by the Zimbabwe Republic Police (ZRP).\n\nOf the 5,376 people affected, 3,107 were female and 2,269 were male.\n\nThe report detailed some of the alleged perpetrators.\n\nAmong the perpetrators, those affiliated with the ruling party, Zanu PF, accounted for 35.38%, followed by members of the Zimbabwe Republic Police (ZRP) at 13.77%.Other violators included local authorities (16.53%), government officials (11.44%), artisanal miners (5.93%), traditional leaders (6.14%), members of the MDC-Alliance (0.64%) and unaffiliated individuals (6.36%).Worryingly, members of the Zimbabwe National Army (ZNA) are also implicated, accounting for 0.21% of reported violations.The report highlights that other State security actors, particularly those mandated to protect the public, continue to feature prominently among perpetrators of human rights violations.Despite these concerns, the ZPP expresses cautious optimism about the potential for future improvements.It welcomed and embraced the opportunity to engage with the Zimbabwe Independent Complaints Commission (ZICC) through its goodwill ambassador to promote a rights-based, accountable approach in security operations.We are hopeful that other implicated institutions will be open to such engagements, paving the way for lasting solutions to end impunity and foster sustainable peace in Zimbabwe, the report adds.Geographically, Masvingo and Harare provinces recorded the highest number of violations in May, with 13 each.Midlands followed closely with 12 violations, while Manicaland and Mashonaland West each documented 10.Mashonaland Central experienced a significant decline, from 13 violations the previous month to just four in May.Mashonaland East recorded nine violations, while both Matabeleland North and South recorded six breaches each.ZPP commended the Zimbabwe Human Rights Commission (ZHRC) for highlighting urgent issues needing government action, including collapsing public services, a shrinking civic space, and restrictive conditions.\n\nAmong the perpetrators, those affiliated with the ruling party, Zanu PF, accounted for 35.38%, followed by members of the Zimbabwe Republic Police (ZRP) at 13.77%.\n\nOther violators included local authorities (16.53%), government officials (11.44%), artisanal miners (5.93%), traditional leaders (6.14%), members of the MDC-Alliance (0.64%) and unaffiliated individuals (6.36%).Worryingly, members of the Zimbabwe National Army (ZNA) are also implicated, accounting for 0.21% of reported violations.The report highlights that other State security actors, particularly those mandated to protect the public, continue to feature prominently among perpetrators of human rights violations.Despite these concerns, the ZPP expresses cautious optimism about the potential for future improvements.It welcomed and embraced the opportunity to engage with the Zimbabwe Independent Complaints Commission (ZICC) through its goodwill ambassador to promote a rights-based, accountable approach in security operations.We are hopeful that other implicated institutions will be open to such engagements, paving the way for lasting solutions to end impunity and foster sustainable peace in Zimbabwe, the report adds.Geographically, Masvingo and Harare provinces recorded the highest number of violations in May, with 13 each.Midlands followed closely with 12 violations, while Manicaland and Mashonaland West each documented 10.Mashonaland Central experienced a significant decline, from 13 violations the previous month to just four in May.Mashonaland East recorded nine violations, while both Matabeleland North and South recorded six breaches each.ZPP commended the Zimbabwe Human Rights Commission (ZHRC) for highlighting urgent issues needing government action, including collapsing public services, a shrinking civic space, and restrictive conditions.\n\nOther violators included local authorities (16.53%), government officials (11.44%), artisanal miners (5.93%), traditional leaders (6.14%), members of the MDC-Alliance (0.64%) and unaffiliated individuals (6.36%).\n\nWorryingly, members of the Zimbabwe National Army (ZNA) are also implicated, accounting for 0.21% of reported violations.\n\nThe report highlights that other State security actors, particularly those mandated to protect the public, continue to feature prominently among perpetrators of human rights violations.\n\nDespite these concerns, the ZPP expresses cautious optimism about the potential for future improvements.\n\nIt welcomed and embraced the opportunity to engage with the Zimbabwe Independent Complaints Commission (ZICC) through its goodwill ambassador to promote a rights-based, accountable approach in security operations.\n\nWe are hopeful that other implicated institutions will be open to such engagements, paving the way for lasting solutions to end impunity and foster sustainable peace in Zimbabwe, the report adds.\n\nGeographically, Masvingo and Harare provinces recorded the highest number of violations in May, with 13 each.\n\nMidlands followed closely with 12 violations, while Manicaland and Mashonaland West each documented 10.\n\nMashonaland Central experienced a significant decline, from 13 violations the previous month to just four in May.\n\nMashonaland East recorded nine violations, while both Matabeleland North and South recorded six breaches each.\n\nZPP commended the Zimbabwe Human Rights Commission (ZHRC) for highlighting urgent issues needing government action, including collapsing public services, a shrinking civic space, and restrictive conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/08072200/PF-Zanu.jpg",
            "description": "<p>By Costa Nkomo THE Zimbabwe Peace Project (ZPP) reports a slight improvement in the country’s human rights situation, with violations dropping by 10 percent in May 2025 compared to April 2025. In a report released Saturday, the human rights watchdog documented 83 human rights violations across various areas, including during government-led food aid distribution, instances</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/human-rights-violations-ease-in-may-zanu-pf-still-tops-perpetrators-list-report/\">Human rights violations ease in May; Zanu PF still tops perpetrators’ list— Report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "City of Harare launches blitz against businesses evading rates payment",
            "url": "https://www.newzimbabwe.com/city-of-harare-launches-blitz-against-businesses-evading-rates-payment/",
            "content": "By Staff Reporter\n\nCITY of Harare (CoH) has launched an operation to clampdown businesses operating without paying rates.\n\nIn a statement Friday, CoH warned that it will disconnect water supply to industrial and commercial properties with rates arrears or those without valid business licences.\n\nThe City of Harare is clamping down on lawlessness and illegal buisness operations in and around the city.\n\nWe urge all people who are operating businesses in and around the city to pay their rates, settle their arrears and obtain relevant business licences.\n\nThe city will disconnect water from all commercial and industrial properties that are in rates arrears and have no valid business licences, the statement reads.\n\nBusinesses without running water are required by law to be shutdown.The city also urged building owners with multiple tenants to ensure all tenants pay their rates and obtain necessary licences to avoid the entire building being closed due to non-compliance by one or more tenants.Premises with more than one tenant, are required to make sure that all of them pay their rates and business licences to avoid inconveniences caused by closure of the whole building due of non compliance by some tenant(s).Those without valid business licences are urged to urgently visit our Rowan Martin Building to regularise their operations and settle their arrears, the authority added.CoH has for years been accused of massive corruption, as it collects rates yet fails to deliver basic services, leading to many people neglecting to pay dues.The local authority has been failing to provide clean and safe water regularly, collect garbage, light up streets, among other services. It also struggles to maintain and upgrade sewage disposal systems in resulting in unchecked overflow of raw excreta posing a health hazard to residents.\n\nBusinesses without running water are required by law to be shutdown.The city also urged building owners with multiple tenants to ensure all tenants pay their rates and obtain necessary licences to avoid the entire building being closed due to non-compliance by one or more tenants.\n\nPremises with more than one tenant, are required to make sure that all of them pay their rates and business licences to avoid inconveniences caused by closure of the whole building due of non compliance by some tenant(s).\n\nThose without valid business licences are urged to urgently visit our Rowan Martin Building to regularise their operations and settle their arrears, the authority added.\n\nCoH has for years been accused of massive corruption, as it collects rates yet fails to deliver basic services, leading to many people neglecting to pay dues.\n\nThe local authority has been failing to provide clean and safe water regularly, collect garbage, light up streets, among other services. It also struggles to maintain and upgrade sewage disposal systems in resulting in unchecked overflow of raw excreta posing a health hazard to residents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31203242/Municipal-Police.jpg",
            "description": "<p>By Staff Reporter CITY of Harare (CoH) has launched an operation to clampdown businesses operating without paying rates. In a statement Friday, CoH warned that it will disconnect water supply to industrial and commercial properties with rates arrears or those without valid business licences. “The City of Harare is clamping down on lawlessness and illegal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-launches-blitz-against-businesses-evading-rates-payment/\">City of Harare launches blitz against businesses evading rates payment </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        },
        {
            "title": "Defaulters owe City of Harare over US$18 million",
            "url": "https://www.newzimbabwe.com/defaulters-owe-city-of-harare-over-us18-million/",
            "content": "By Staff Reporter\n\nCITY of Harare has launched a strict campaign against long-term tenants in council-owned properties, who have failed to pay rent and service charges, aiming to recoup more than ZiG$500 million (US$18.53 million) in outstanding debts.\n\nThe operation will focus on Dzivarasekwa, the central business district (CBD), and nearby areas.According to officials, the unpaid billsaccumulated over five year, have severely disrupted essential services in the capital.Councils first move will be to cut off water supplies to all defaulting properties, after which they will be forcibly closed under public health laws.City of Harare spokesperson Stanley Gama said the municipality will be disconnecting water to the identified premises.We are disconnecting water supplies to all properties within the CBD and industrial areaa that owe the city for rates and services.Following this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.Gama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nThe operation will focus on Dzivarasekwa, the central business district (CBD), and nearby areas.\n\nAccording to officials, the unpaid billsaccumulated over five year, have severely disrupted essential services in the capital.Councils first move will be to cut off water supplies to all defaulting properties, after which they will be forcibly closed under public health laws.City of Harare spokesperson Stanley Gama said the municipality will be disconnecting water to the identified premises.We are disconnecting water supplies to all properties within the CBD and industrial areaa that owe the city for rates and services.Following this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.Gama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nAccording to officials, the unpaid billsaccumulated over five year, have severely disrupted essential services in the capital.\n\nCouncils first move will be to cut off water supplies to all defaulting properties, after which they will be forcibly closed under public health laws.City of Harare spokesperson Stanley Gama said the municipality will be disconnecting water to the identified premises.We are disconnecting water supplies to all properties within the CBD and industrial areaa that owe the city for rates and services.Following this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.Gama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nCouncils first move will be to cut off water supplies to all defaulting properties, after which they will be forcibly closed under public health laws.\n\nCity of Harare spokesperson Stanley Gama said the municipality will be disconnecting water to the identified premises.We are disconnecting water supplies to all properties within the CBD and industrial areaa that owe the city for rates and services.Following this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.Gama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nCity of Harare spokesperson Stanley Gama said the municipality will be disconnecting water to the identified premises.\n\nWe are disconnecting water supplies to all properties within the CBD and industrial areaa that owe the city for rates and services.Following this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.Gama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nWe are disconnecting water supplies to all properties within the CBD and industrial areaa that owe the city for rates and services.\n\nFollowing this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.Gama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nFollowing this, our City Health Department will shut down these properties for operating without water, which violates the Public Health Act and the Harare Licensed Premises by-law, said Gama.\n\nGama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.This has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nGama confirmed that tenants in council-rented premises owe over ZiG500million, stressing that inflation and prolonged non-payment have deepened the crisis.\n\nThis has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.The crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nThis has led to major revenue losses, partly due to the devaluation of money from the ZWL era, while the lack of payments has severely affected service delivery, he said.\n\nThe crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.Many of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nThe crackdown could have severe consequences for small businesses, informal traders, and tuck shops operating in council properties.\n\nMany of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.While officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nMany of these tenants sublease their spaces and now risk sudden closureeven though they are not directly liable for the debts owed to the municipality.\n\nWhile officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.The council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nWhile officials did not specify when the enforcement would start, they warned that all defaulters, regardless of how long they have occupied the properties, would face action.\n\nThe council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.Recovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nThe council directly attributes years of unpaid bills to the citys crumbling infrastructure, including persistent water shortages, uncollected waste, and deteriorating roads.\n\nRecovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\nRecovering these funds, they insist, is vital to restoring basic services for Harares residents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/07/25174613/Stanley-Gama.jpg",
            "description": "<p>By Staff Reporter  CITY of Harare has launched a strict campaign against long-term tenants in council-owned properties, who have failed to pay rent and service charges, aiming to recoup more than ZiG$500 million (US$18.53 million) in outstanding debts. The operation will focus on Dzivarasekwa, the central business district (CBD), and nearby areas. According to officials,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defaulters-owe-city-of-harare-over-us18-million/\">Defaulters owe City of Harare over US$18 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "15 Jun 2025"
        }
    ]
}