{
    "news": [
        {
            "title": "Masakadza shines but Zimbabwe face monumental chase",
            "url": "https://www.newzimbabwe.com/masakadza-shines-but-zimbabwe-face-monumental-chase/",
            "content": "Zimbabwe Cricket\n\nWellington Masakadza claimed a career-best four-wicket haul, but Zimbabwe were left clinging to hope after South Africa set a towering fourth-innings target of 537 on day three of the first Test at Queens Sports Club in Bulawayo on Monday.\n\nWiaan Mulders commanding 147 formed the backbone of the visitors second-innings 369, building on their overnight score of 49 for one and a lead of 216.\n\nThe imposing total left Zimbabwe with the daunting task of pulling off the greatest chase in Test history.\n\nWith Blessing Muzarabani unavailable in the morning due to illness, the hosts turned to Tanaka Chivanga and Masakadza to spearhead the attack.\n\nThe day began promisingly for them when Tony de Zorzi, on 22 overnight, edged Chivanga to second slip, where Sean Williams held a sharp, low catch.\n\nMulder, calm and clinical, raced to his fifty with a string of crisp boundaries.\n\nHe then combined with David Bedingham for a brisk 72-run stand that extended South Africas lead beyond 300.\n\nMasakadza broke the partnership, tempting Bedingham, on 35, into a mistimed pull that found Williams at midwicket.\n\nSoon after, debutant Lhuan-dre Pretorius  fortunate to survive several chances in his first-innings hundred  was bowled for four by Vincent Masekesa, ripping one through the gate to clip the top of middle stump.\n\nMasekesa struck again moments later, removing Dewald Brevis for three as the big-hitters wild attempt to clear long-on missed entirely, and the leg-spinner knocked over his stumps to leave South Africa teetering at 155 for five.\n\nBut Mulder stood firm amid the wobble.\n\nHe brought up a well-earned hundred off 149 deliveries with a crisp back-foot drive.\n\nAt lunch, the visitors were 185 for five, leading by 352, with Mulder on 104 and Kyle Verreynne on five.\n\nAfter the break, the pair added 74 before Mulders enterprising stay came to an end.\n\nHe attempted to go aerial against Wessly Madhevere but picked out deep midwicket, where Takudzwanashe Kaitano took a fine catch.\n\nMulders 206-ball innings featured 17 boundaries and two sixes.\n\nMasakadza soon added Verreynne to his tally, drawing an edge off a sharply turning delivery that Ervine pouched at slip, reducing South Africa to 259 for seven.\n\nMaharaj and Corbin Bosch then piled on more frustration for Zimbabwe with a gritty 92-run partnership for the eighth wicket, pushing the lead beyond the 500-run mark.\n\nMuzarabani, now back in action, thought he had Bosch caught behind  only for a no-ball call to spoil the celebration.\n\nBut Bosch didnt last much longer as Masakadza bowled him for 36 after a missed slog-sweep.\n\nMasakadza then removed Maharaj, who danced down the track only to be deceived in flight and turn  the ball crashing into middle stump as South Africa fell to 352 for nine.\n\nMuzarabani wrapped up the innings by bowling Kwena Maphaka for eight, with Codi Yusuf unbeaten on the same score.\n\nMasakadza finished with four for 98, his career-best innings figures in Test cricket, while Masekesa and Chivanga chipped in with two wickets apiece.\n\nSet a colossal 537 for victory, Zimbabwe began cautiously in the final hour.\n\nOpeners Kaitano and Prince Masvaure looked solid  until the very last ball of the day.\n\nJust as the hosts seemed set to survive the session unscathed, Kaitano edged Bosch to second slip, ending a steady 32-run stand.\n\nThey closed on 32 for one, still needing 505 runs with nine wickets in hand.\n\nZimbabwe have passed 500 in an innings six times in Test cricket, most recently in December against Afghanistan at the same venue.\n\nBut their highest fourth-innings total is 331  made in a losing cause against New Zealand in 2001, also in Bulawayo.\n\nTheir most successful chase remains 174, achieved earlier this year against Bangladesh in Sylhet.\n\nThe next best, 162, came back in 1998 against Pakistan.\n\nThe world record fourth-innings chase is 418  set by the West Indies against Australia in 2003.\n\nWith history stacked high against them, Zimbabwe will need to bat with extraordinary discipline, determination and belief to salvage anything from this match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01015801/masakadza.jpg",
            "description": "<p>Zimbabwe Cricket South Africa – 418-9 declared and 369 all out in 82.5 overs (Wiaan Mulder 147, Keshav Maharaj 51, Corbin Bosch 36; Wellington Masakadza 4/98, Tanaka Chivanga 2/76, Vincent Masekesa 2/117) Zimbabwe – 251 and 32-1 in 18.2 overs (Takudzwanashe Kaitano 12, Prince Masvaure 5*; Corbin Bosch 1/1) Wellington Masakadza claimed a career-best four-wicket</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masakadza-shines-but-zimbabwe-face-monumental-chase/\">Masakadza shines but Zimbabwe face monumental chase</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "Train runs over lifeless man, another killed while lying on rail tracks",
            "url": "https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/",
            "content": "By Staff Reporter\n\nA NATIONAL Railways of Zimbabwe (NRZ) trainon Mondayran over a man who is believed to have already been dead.\n\nThe incident happened atOdzi Siding near the eastern border city of Mutare.\n\nThe NRZ confirmed the incident in a statement.\n\nA man was run over by a train early this morning at Odzi Siding near Mutare. The man was lying lifeless on the tracks and did not respond to the approaching trains sounding horn.\n\nThe train crew suspect the man was already dead by the time he was run over. The man had no identity particulars on him and the scene was attended by ZRP, reads the statement.\n\nIn a separate but similar incident, a man identified as Peter Vengesayi was run over by a train near Zvishavane, Midlands province.\n\nIn yet another tragic incident today, a man died after being run over by a train near Zvishavane.\n\nPeter Vengesayi of Village 1, Zeederburg under Chief Mafala was lying on the tracks when the incident occured. The NRZ extends its condolences to his family, said NRZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/17224403/National-Railways-of-Zimbabwe.jpg",
            "description": "<p>By Staff Reporter A NATIONAL Railways of Zimbabwe (NRZ) train on Monday ran over a man who is believed to have already been dead. The incident happened at Odzi Siding near the eastern border city of Mutare. The NRZ confirmed the incident in a statement. “A man was run over by a train early this morning at Odzi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/\">Train runs over lifeless man, another killed while lying on rail tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "EJWP backs gender policy to advance equality across Zimbabwe",
            "url": "https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) says the recently approved gender policy will go a long way inharnessinggender equality nationwide.\n\nCabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and womens empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives.\n\nIt provides a unified structure for monitoring gender equality and addresses systemic inequalities across various sectors of Zimbabwean society.\n\nSpeaking to NewZimbabwe.com this week, EJWP Executive Director, Margaret Mutsamvi, described the enactment of the blueprint as a giant step.\n\nThe recent Cabinets approval of the National Gender Policy (2025) is a significant milestone in Zimbabwes journey toward gender equality and womens empowerment. This development follows EJWPs submission of an urgent petition on 14 March 2025, calling for the renewal of the policy, which had lapsed in 2021  a gap that threatened to reverse hard-earned gains in gender equity, she said.\n\nThe CSO described the new policy as a foundation for a more inclusive, equitable and gender-responsive Zimbabwe, with clearly defined strategies to address systemic barriers across legal, economic, health, education, climate, and digital spheres.\n\nThe new policy, EJWP said, marks a shift from aspiration to action  offering a renewed national mandate to address entrenched gender disparities.\n\nAs EJWP, we remain deeply committed to supporting the full implementation of this policy, particularly around inclusive economic empowerment and accountability in public resource management. We will continue to monitor progress, engage with duty bearers, and amplify the voices of women, especially those in marginalised and economically excluded communities, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/27052230/Margaret-Mutsamvi.jpg",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) says the recently approved gender policy will go a long way in harnessing gender equality nationwide. Cabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and women’s empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives. It provides</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/\">EJWP backs gender policy to advance equality across Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwean farmers embrace AI and digital tools through FAO-led rural initiative",
            "url": "https://www.newzimbabwe.com/zimbabwean-farmers-embrace-ai-and-digital-tools-through-fao-led-rural-initiative/",
            "content": "TechAfricaNews\n\nThe Food and Agriculture Organization of the United Nations(FAO)is advancing agrifood systems through integration of effective digital technologies in Zimbabwe. Through the Fostering Digital Villages Initiative (FDiVi), FAO hosted a Digital Fair in the Masvingo province.\n\nThe digital fair brought together digital service providers, farmers, agri-entrepreneurs, and other stakeholders, creating a dynamic platform for knowledge exchange and real-time onboarding to digital agriculture solutions. The digital fair is part of the broader Fostering Digital Villages through innovative advisory and profitable market services project, which aims to transform agrifood systems in rural Malawi, Rwanda, and Zimbabwe using effective digital technologies, including artificial intelligence.\n\nThis project facilitates delivery of innovative agricultural extension services for increased productivity, enhanced market access, and advance inclusive rural transformation. It will also support local farmers, extension officers, agro-dealers, and processors, particularly the youth and women.\n\nPatrice Talla, FAO Subregional Coordinator for Southern Africa and Representative, Zimbabwe.\n\nThe digital fair held in the Bikita district is part of a series of the ongoing campaign by FAO targeting digital service providers, rural farmers, agri-entrepreneurs and other stakeholders to interact and integrate digital technologies in agriculture. The digital fair sparked renewed enthusiasm for digital transformation in agriculture among local communities.\n\nSpeaking during the digital fair, Bernard Hadzirambwi, the District Development Coordinator, praised the initiative and encouraged farmers to adopt digital technologies to enhance productivity and resilience.\n\nRural innovation thrives when communities connect and interact with digital technology.\n\nBernard Hadzirambwi, the District Development Coordinator, Zimbabwe.\n\nDuring the digital fair, our farmers explored AI-powered advisory tools, mobile market platforms, and digital extension services. I am truly encouraged by how quickly the community is embracing these innovations. Digital technologies are not just tools, they are enablers of climate-smart agriculture and inclusive rural development in our district.\n\nNobert Chiduza, District Agricultural Extension Officer in the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development, Zimbabwe.\n\nThe FDiVi is one of FAOs corporate initiatives and flagship programmes. It is an integrated development vision that enshrines digitalization at the core of rural transformation and prosperity, addressing on-farm and off-farm socio-economic elements.\n\nThe project is being implemented in the Mhondoro-Ngezi and Bikita districts where digital hubs will be equipped with digital tools and services including free internet, computers and digital literacy training materials.\n\nThe project supports local farmers, extension officers, agro-dealers, and processors through facilitating access to innovative agricultural extension services, improving market access, and promoting inclusive rural transformation.\n\nBefore the digital fair, I didnt know how much technology could change the way I farm. Now, Ive learned about AI tools that help me plan better, and I can connect directly with buyers through my phone. As a young farmer, this gives me confidence in exploring new opportunities posed through digital technologies.\n\nSheunesu Njeke, a 26-year-old farmer, Zimbabwe.\n\nGoing forward, FAO will integrate Digital Fairs in the annual District and Ward level Agriculture Shows. The project will continue to support digital innovators and entrepreneurs in breaking into the rural market and will also support farmers and other rural stakeholders to safely onboard onto digital platforms and services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01012204/farmers-FAO.png",
            "description": "<p>TechAfricaNews The Food and Agriculture Organization of the United Nations (FAO) is advancing agrifood systems through integration of effective digital technologies in Zimbabwe. Through the Fostering Digital Villages Initiative (FDiVi), FAO hosted a Digital Fair in the Masvingo province. The digital fair brought together digital service providers, farmers, agri-entrepreneurs, and other stakeholders, creating a dynamic platform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-farmers-embrace-ai-and-digital-tools-through-fao-led-rural-initiative/\">Zimbabwean farmers embrace AI and digital tools through FAO-led rural initiative</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "Insider in US$500k robbery at ex-Dynamos chairman’s shop in court, remanded in custody",
            "url": "https://www.newzimbabwe.com/insider-in-us500k-robbery-at-ex-dynamos-chairmans-shop-in-court-remanded-in-custody/",
            "content": "By Mary Taruvinga\n\nThe alleged insider behind the recent US$500,000 robbery at a shop owned by former Zimbabwe Warriors team manager and Dynamos chairman, Rafiq Adam, appeared in court Monday, charged with armed robbery.\n\nSamson Gora (35) of Acadia in Harare appeared before Magistrate Donald Ndirowei who denied him bail.\n\nHe will be back in court on July 16 for his routine remand.\n\nAccording to the state, June 16 2025 and at around 0900 hours the accused person hatched a plan to rob his employer, Adam of Merchantman Enterprises at number 93 Cameroon street, Harare.\n\nIt is alleged that he supplied information to his accomplices about where the money was being kept at his workplace.\n\nIn pursuant of their plan his accomplices Nyengerayi\n\nChikwadze alias Chipato, Oscar Muchenje and other 2 unknown South Africans, whilst armed with a pistol, approached the complainant who was seated in his reception pretending to be genuine clients.\n\nOne of the accused withdrew a pistol from his pocket and hit the complainant with a pistol butt on his forehead demanding for money, the court heard.\n\nThe complainant surrendered US$500 and safe keys, which were in his pockets.\n\nThe accused persons later force marched the complainant to his office where they unlocked a safe with those keys and stole US$600,000 which was inside.\n\nThey allegedly ransacked the offices and took an iPhone 13 Pro and a Samsung Fold cellphones which were in the Directors office, a Samsung galaxy, a Samsung 04, an Iphone 16 Promax and a V-lion cellphones from four employees who were in the cash office.\n\nThe gang then left the shop and they dropped an iPhone 16 Promax and a Samsung Galaxy along Leopold Takawira near ENBEE shop and they went away with the rest of their loot.\n\nOn 27 June 2025, Detectives from CID Homicide Harare received information to the effect that Gora was involved in the armed robbery.\n\nDetectives swiftly reacted to the information and arrested Gora who was at his place of work.\n\nThe court heard Gora was interviewed and he indicated that indeed he had supplied information about that money at his workplace to his accomplices.\n\nHe was further interviewed and indicated that he was given US$10,000 as his share by Nyengerayi Chipadze alias Chipato who alleged to have been given a total of US$20,000 by Oscar and the South Africans.\n\nGora then led the police to his brother Willard Gora where he had concealed his loot leading to the recovery of cash US$4,400, 3x Samsung Note 20 cellphones, 3x Samsung Galaxy cellphones bought for US$1,500 and a Toyota Hiace on registration numbers AFT1573 which had been bought from the proceeds.\n\nRufaro Chonzi prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga The alleged insider behind the recent US$500,000 robbery at a shop owned by former Zimbabwe Warriors team manager and Dynamos chairman, Rafiq Adam, appeared in court Monday, charged with armed robbery. Samson Gora (35) of Acadia in Harare appeared before Magistrate Donald Ndirowei who denied him bail. He will be back in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/insider-in-us500k-robbery-at-ex-dynamos-chairmans-shop-in-court-remanded-in-custody/\">Insider in US$500k robbery at ex-Dynamos chairman’s shop in court, remanded in custody</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "With tobacco output record already set, Zimbabwe eyes 400m kg milestone",
            "url": "https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/",
            "content": "Tobacco Reporter\n\nTwo weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this years crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million kg.\n\nDriving the surge is a sharp increase in smallholder participation, government-led reforms, and research-driven innovations. More than 127,000 farmers, 85% of them smallholders, are registered this season, which ensures access to inputs, training, and markets.\n\nDr. Frank Magama, CEO of Kutsaga, Zimbabwes leading tobacco research institute, credited the Tobacco Value Chain Transformation Plan introduced in 2021 for boosting productivity through better farming practices, climate-smart seed varieties, and sustainability initiatives.\n\nOver 80% of our crop was produced under contract, ensuring inputs, technical support, and guaranteed markets, Magama said. While expansion has occurred, what is more exciting is the productivity increase per unit area. With improved post-harvest handling, energy-efficient barns, and better training, the numbers are speaking for themselves.\n\nHe also warned, however, of the risks from global oversupply and stressed the importance of environmental compliance to maintain competitiveness.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31054919/Tobacco-Agriculture.jpg",
            "description": "<p>Tobacco Reporter Two weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this year’s crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/\">With tobacco output record already set, Zimbabwe eyes 400m kg milestone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "Three days of protests leave seven dead in Togo, rights groups say",
            "url": "https://www.newzimbabwe.com/three-days-of-protests-leave-seven-dead-in-togo-rights-groups-say/",
            "content": "BBC\n\nCivic rights groups say at least seven people have been killed during a crackdown on protesters who are calling for Togos leader, Faure Gnassingb, to step down and release political prisoners.\n\nSeven bodies were recovered from rivers in the capital city Lom, according to a coalition called Le Front Citoyen Togo Debout which accuses security forces and militias of committing abuses.\n\nThe Togolese government has denied these deaths were linked to last weeks demonstrations.\n\nIt is now threatening legal action against the protest organisers, calling the protests a campaign of disinformation and hatred that was orchestrated from abroad.\n\nThere is growing anger in Togo due to a crackdown on critical voices, and changes to the constitution labelled by labelled by critics and opposition figures as an institutional coup dtat.\n\nThese protests comes weeks after Gnassingb  who was president for two decades and whose family has ruled the country for 58 years  wassworn into a new post of President of the Council of Ministers, which has no official term limits.\n\nDemonstrations have been banned in the West African country since 2022, with the authorities citing security reasons.\n\nThree days of demonstrations by online activists and youth-led movements began in Lom on Thursday, before taking a violent turn on Friday and Saturday.\n\nTear gas was fired by anti-riot police at protesters, who pelted them with stones and other missiles.\n\nSome determined anti-government protesters engaged security forces in street battles in several areas considered to be opposition strongholds, including B, where police chased demonstrators into their hideouts.\n\nA coalition of 23 Togolese civil rights groups  known as the National Platform for Civic Space and Development Effectiveness  has since asked the authorities to carry out investigations into the bloody police repression.\n\nThey condemned what they described as the use of disproportionate force against peaceful demonstrators, adding that peaceful protest is a fundamental right, recognized both by the Togolese Constitution and by international instruments ratified by our country.\n\nBy Sunday calm had returned to most of Lom, with shops reopened at the main central market at Assigam and businesses operating as usual.\n\nThe recent change of regime orchestrated by the Togolese leader continues to fuel resentment. In addition to the new post which he can keep for life, constitutional reform in Togo has ended presidential elections, and introduced a parliamentary system.\n\nLast months arrest and psychiatric detention of the Togolese rapper Narcisse Essow Tchalla, also known as Aamron, acted as a catalyst for public outrage, culminating in over 50 arrests during protests earlier this month.\n\nThough most have been released, at least three people remain in custody.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01005735/Screenshot-2025-07-01-at-01.55.48.png",
            "description": "<p>BBC Civic rights groups say at least seven people have been killed during a crackdown on protesters who are calling for Togo’s leader, Faure Gnassingbé, to step down and release political prisoners. Seven bodies were recovered from rivers in the capital city Lomé, according to a coalition called Le Front Citoyen Togo Debout which accuses</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-days-of-protests-leave-seven-dead-in-togo-rights-groups-say/\">Three days of protests leave seven dead in Togo, rights groups say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwean man sentenced in Limpopo for attempt to smuggle stolen Toyota Corolla Cross",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-sentenced-in-limpopo-for-attempt-to-smuggle-stolen-toyota-corolla-cross/",
            "content": "IOL\n\nThe Mokopane Regional Court has imposed six years of direct imprisonment against a 37-year-old Zimbabwean man,Joseph Kungwengwe, after he was found in possession of a stolen vehicle, aToyota Corolla Cross.\n\nThe police intercepted and recovered the compact sport utility vehicle in Mokopane on 29 December last year.\n\nKungwengwe was subsequently arrested after the stolen vehicle was intercepted.\n\nLimpopo provincial police spokesperson, Colonel Malesela Ledwaba, said the Toyota Corolla Cross was reported stolen at Brakpan, in Gauteng province, last year.\n\nLimpopo provincial anti-smuggling team received intelligence information about a suspected stolen motor vehicle from Gauteng province driving along N1, en route to Beitbridge port of entry, said Ledwaba.\n\nHe added that the stolen vehicle was to be smuggled from the South African side of the border, into neighbouring Zimbabwe.\n\nThe team operationalized the lookout information, and the vehicle matching the description was spotted driving along N1, next to Zebediela Toll Plaza, where it was cornered, said Ledwaba.\n\nThe driver was arrested for possession of a suspected stolen motor vehicle, and the car was confiscated for further investigations.\n\nFollowing trial, the Mokopane Regional Court convicted 37-year-old Kungwengwe and sentenced him to six years of direct imprisonment for possession of a suspected stolen vehicle.\n\nMeanwhile, provincial commissioner of police in Limpopo,Lieutenant General Thembi Hadebehas applauded the provincial anti-smuggling team for their sterling work to prevent smuggling of motor vehicles.\n\nLast month, IOL reported that31-year-old man,Mikael Mlambo, appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was also being driven towards the Beitbridge port of entry.\n\nAt the time,Brigadier Hlulani Mashabatold IOL that Mlambo was remanded in custody.\n\nMikael Mlambo, a South African man, was arrested by police in Limpopo while he was allegedly driving a stolen Toyota Corolla Cross towards Zimbabwe. Image:SAPS\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen last month,around Pretoria central.\n\nOn Friday, 16 May 2025, members of the provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01005437/Screenshot-2025-07-01-at-01.52.50.png",
            "description": "<p>IOL The Mokopane Regional Court has imposed six years of direct imprisonment against a 37-year-old Zimbabwean man, Joseph Kungwengwe, after he was found in possession of a stolen vehicle, a Toyota Corolla Cross. The police intercepted and recovered the compact sport utility vehicle in Mokopane on 29 December last year. Kungwengwe was subsequently arrested after the stolen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-sentenced-in-limpopo-for-attempt-to-smuggle-stolen-toyota-corolla-cross/\">Zimbabwean man sentenced in Limpopo for attempt to smuggle stolen Toyota Corolla Cross</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        },
        {
            "title": "Ignoring government failures is patriotism – ZANU PF MPs say, push for National Ideology",
            "url": "https://www.newzimbabwe.com/ignoring-government-failures-is-patriotism-zanu-pf-mps-say-push-for-national-ideology/",
            "content": "By Darlington Gatsi\n\nRULING party ZANU PFs legislators remain resolute in pushing for legislation that criminalises criticising the governments shortcomings, despite pushback from the opposition.\n\nZANU PF MP Joseph Mapiki recently tabled a motion for Zimbabwe to adopt a National Ideology, which is currently being debated in Parliament.\n\nAccording to Mapiki, the National Ideology would entrench patriotism and foster a Zimbabwean identity.\n\nZANU PF legislator Ophias Murambiwa said the governments failures should not warrant bad-mouthing.\n\nI am very amazed that there are some Hon. Members who debated and spoke, yet they cannot show their love for the country because hospitals do not have medication.\n\nAccording to me, how can you say that you are not in love with your country when it lacks medication in hospitals? That alone is not sufficient because it does not mean that tomorrow we are not going to have the medication, said Murambiwa.\n\nMurambiwa added that there should be a law that punishes government critics.\n\nThe most important issue is to love our country, let us praise our country in all circumstances, whether in good or in bad times, during the night or during the day. Let us love our country.\n\nI also suggest that this august House must come up with a law which states that those who speak evil of their country must face the full wrath of the law and then be jailed.\n\nZANU PF has long been mooting a law that criminalises speaking ill of the country under the guise of patriotism.\n\nPushing ahead with the National Ideologya replica of ZANU PFs Herbert Chitepo School of Ideologythe ruling party plans to incorporate it into the education curriculum.\n\nHowever, this has been resisted by opposition legislators, who fear the National Ideology will be used to clamp down on dissenting voices.\n\nOpposition MP Prosper Mutseyami said Zimbabwe risks degenerating into authoritarianism.\n\nWhat then is true patriotism? Patriotism is not blind loyalty. It is not empty slogans. It is a conscious love for our country that demands honest reflection, accountability and action.\n\nTrue patriots question injustice, challenge corruption and demand systems that serve the people, not select a few. It is the voice that speaks when citizens are denied opportunities, when our youth struggle for employment, and when economic policies fail to uplift the masses.\n\nOur patriotism must ignite participation, ensuring that every Zimbabwean plays an active role in shaping the future, said Mutseyami.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/24030405/New-Parliament-.jpeg",
            "description": "<p>By Darlington Gatsi  RULING party ZANU PF’s legislators remain resolute in pushing for legislation that criminalises criticising the government’s shortcomings, despite pushback from the opposition. ZANU PF MP Joseph Mapiki recently tabled a motion for Zimbabwe to adopt a National Ideology, which is currently being debated in Parliament. According to Mapiki, the National Ideology would</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ignoring-government-failures-is-patriotism-zanu-pf-mps-say-push-for-national-ideology/\">Ignoring government failures is patriotism – ZANU PF MPs say, push for National Ideology </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "01 Jul 2025"
        }
    ]
}