{
    "news": [
        {
            "title": "In memory of AKA: Kairo Forbes, Nadia Nakai and Glammy celebrate his 37th birthday",
            "url": "https://www.newzimbabwe.com/in-memory-of-aka-kairo-forbes-nadia-nakai-and-glammy-celebrate-his-37th-birthday/",
            "content": "IOL\n\nThe lateAKAs family kept his memory alive as they celebrated what would have been the rappers 37th birthday.\n\nAKA wasgunned downoutside Wish restaurant on Florida Road, Durban KwaZulu Natal in February 2023. His friend, Chef Tebello Tibz Motsoane, was also killed in that tragic incident.\n\nKairo Forbes, the rappers daughter, joined grandmother Lynn Forbes and AKAs girlfriend, award-winning rapperNadia Nakai, for an intimate birthday celebration.\n\nThe gathering was not just a commemoration but also a testament to the enduring spirit of family and love that defines AKAs lasting impact.\n\nNakai took to Instagram to share heartfelt moments from the celebration.\n\nKairo is the ONE! , she wrote, referencing a cherished lyric from AKAs song Dangerous, featuring Blxckie.\n\nIn a touching tribute, she continued: Happy Heavenly Birthday @akaworldwide love and miss you forever!  .\n\nMzansi celebs such as Shekhinah, Nkosazanah Daughter, Nomuzi Mabena, Babes Wodumo and Amanda du-Pont took to the comments to extend their love to the family.\n\nSome of AKAs fans also took to the comments to wish Supa Mega a happy heavenly birthday.\n\n@chipotaks wrote: We will never recover from his death honestly, hai! Happy heavenly birthday AKA. We will never forget you .\n\n@neo.blacky said: Happy heavenly birthday to AKA.\n\n@sarsarnkhosi continued the songs lyrics writing: But I need someone to extend my Legacy a son with you is icing on the cake Happy heavenly birthday Supa Mega.\n\nMeanwhile, in a poignant post, Lynn reminisced about the first moments of AKAs life, capturing the profound emotions that accompanied his birth.\n\nOn this day, at 1:15 in the early morning, I heard your first cry, I felt your warmth as you were placed on my chest. Your natural birth, 37 years ago, left me exhausted yet invigorated.\n\nI couldnt take my eyes off you, Counting every tiny toe, every little finger. My tiny baby boy, my first born, Your hands wide open, long legs dangling. 2.75kg, 54cm. So perfect, so full of promise, you left me in awe.\n\nIn that moment, my heart changed forever; you made me a mother. I was yours, and you were mine. A bond unbreakable, an infinite love.\n\nLynn expressed that she couldnt bring herself to say happy heavenly birthday as the day of AKAs birth remains forever etched in her heart.\n\nI can never say happy heavenly birthday for your birth day is an occasion forever etched in my heart. Happy birthday, Kiernan.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30060322/Nadia-Nakai-Kairo-Forbes-and-Lynn-Forbes-gather-to-celebrate-the-late-AKA-Picture-Instagram.webp",
            "description": "<p>IOL The late AKA’s family kept his memory alive as they celebrated what would have been the rapper’s 37th birthday. AKA was gunned down outside Wish restaurant on Florida Road, Durban KwaZulu Natal in February 2023. His friend, Chef Tebello ‘Tibz’ Motsoane, was also killed in that tragic incident. Kairo Forbes, the rapper’s daughter, joined grandmother</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-memory-of-aka-kairo-forbes-nadia-nakai-and-glammy-celebrate-his-37th-birthday/\">In memory of AKA: Kairo Forbes, Nadia Nakai and Glammy celebrate his 37th birthday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "Zimbabwean beautician caught with 2.9kgs of heroine sentenced to 22 years in prison in India",
            "url": "https://www.newzimbabwe.com/zimbabwean-beautician-caught-with-2-9kgs-of-heroine-sentenced-to-22-years-in-prison-in-india/",
            "content": "Onmanorama\n\nIndia  Kochi: Sharon Chigwaza (33), a Zimbabwean beautician caught with 2,910 gm of heroin at Kochi airport, was sentenced to 22 years of rigorous imprisonment under two sections of the Narcotic Drugs and Psychotropic Substances (NDPS) Act on Wednesday.\n\nErnakulam Additional Sessions VII judge VPM Sureshbabu also slapped a fine of Rs 1.5 lakh each under section 21 (c) and section 23 (c) of the NDPS Act for carrying and smuggling in the narcotic drug to India. If the fine is not paid, she must serve another six months each for the two charges.\n\nD Pramila, the Intelligence Officer of the Narcotics Control Bureau (NCB) in Kochi, investigated the case.\n\nChigwaza said she was just a carrier who agreed to bring in the drugs to raise money for her treatment in Delhi.\n\nThe court, however, did not go into the reasons for the crime, said Special Public Prosecutor for the NCB Adv Sunil J. Five grams of heroin is a small quantity, and 250 gm is a commercial quantity. Chigwaza was caught with nearly 12 times the commercial quantity, said Adv Sunil.\n\nThe minimum punishment for carrying and smuggling commercial quantities of heroin is 10 years each, and the maximum punishment is 20 years each. The court factored in her poor background and the fact that she was a woman and sentenced her to 11 years for each offence, he said. The sentences will run concurrently, so she will serve only 11 years in prison, he said.\n\nAccording to her statement to investigators, Chigwaza had been living as a refugee in South Africa with her parents and two sisters. However, NCB officials said her refugee certificate was fake.\n\nOn June 19, 2021, she landed at Kochi airport from Johannesburg via Doha on a Qatar Airways flight. As she prepared to board an onward IndiGo flight to Delhi, airport security grew suspicious and detained her. They found 2,910 gm of heroin in a secret pocket in her trolley bag. She was arrested, and the case was handed over to NCB.\n\nChigwaza told the officials that she had suffered multiple miscarriages and wanted money for treatment in Delhi. She said her Nigerian friend Ifeanyi offered her $2,000 (around Rs 1.47 lakh in June 2021) if she delivered the contraband at a Delhi lodge.\n\nHe reportedly told her that his brother would pick up the package and give her the money.\n\nShe took up the offer. It was her first trip to India. Special Public Prosecutor Adv Sunil said the courts sentencing clearly communicated that irrespective of nationality or circumstances, peddling drugs is a crime against the nation and will be punished. The court also said that the three years and seven months she spent in prison before her conviction would be deducted from her sentence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30055718/white-powder-heroin-scaled-1.jpg",
            "description": "<p>Onmanorama India – Kochi: Sharon Chigwaza (33), a Zimbabwean beautician caught with 2,910 gm of heroin at Kochi airport, was sentenced to 22 years of rigorous imprisonment under two sections of the Narcotic Drugs and Psychotropic Substances (NDPS) Act on Wednesday. Ernakulam Additional Sessions VII judge VPM Sureshbabu also slapped a fine of Rs 1.5</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-beautician-caught-with-2-9kgs-of-heroine-sentenced-to-22-years-in-prison-in-india/\">Zimbabwean beautician caught with 2.9kgs of heroine sentenced to 22 years in prison in India</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "From Zimbabwe to the top of the MMA World: Nicholas Hwende’s unstoppable rise as Africa’s King of BRAVE CF!",
            "url": "https://www.newzimbabwe.com/from-zimbabwe-to-the-top-of-the-mma-world-nicholas-hwendes-unstoppable-rise-as-africas-king-of-brave-cf/",
            "content": "Black Belt\n\nNicholas Hwendes meteoric rise from the heart of Zimbabwe to global MMA stardom is a story that reads like a Hollywood blockbustergrit, redemption, and ultimate triumph. Today, as the reigning BRAVE CF Bantamweight Champion, Hwende isnt just wearing goldhes rewriting the narrative for African fighters in the world of mixed martial arts.\n\nBorn in Zimbabwe and now training out of Johannesburg, South Africa, The Sainthas stormed through the competition with a lethal mix of precision, power, and a warriors heart. Despite having just 10 professional fights, he has already left a trail of defeated opponents, proving that his dominance is no fluke. With three devastating finishes and five hard-fought decision wins, Hwende has cemented himself as one of the most dangerous fighters on BRAVE CFs roster in 2025.\n\nHwende was a force to be reckoned with in AfricasExtreme Fighting Championship, where he captured the bantamweight title and obliterated challengers with ease. But when he made his highly anticipated BRAVE CF debut at BRAVE CF 71in June 2023, reality struck hard. Against Russian powerhouse Velimurad Alkhasov, Hwende suffered the first loss of his careervia unanimous decisiona humbling moment that could have shattered lesser fighters.\n\nDecember 13, 2024, BRAVE CF 91the moment Nicholas Hwendes name would be etched in history. Facing his toughest opponent yet, fellow African warrior Nkosi Ndebele, Hwende stepped up when it mattered most. In a thrilling display of striking mastery, wrestling control, and sheer heart, he outclassed Ndebele over five grueling rounds to win by unanimous decision.\n\nWith that victory, Hwende became just the second African fighter in historyto wear BRAVE CF gold, igniting a firestorm of excitement across the continent. In a sport where Africa is rapidly becoming a powerhouse, Hwende now finds himself as a flagbearer for the next generation of MMA talent.\n\nAs 2025 kicks off, the question isnt ifNicholas Hwende can keep his beltits who dares to take it from him. Will Ndebele demand an immediate rematch to reclaim his lost crown? Or will a new contender rise from the shadows to challenge Africas bantamweight king?\n\nOne thing is certain: Hwende is just getting started.\n\nWith his relentless work ethic, unbreakable mindset, and ever-evolving fight game, The Saint is on a mission to not only dominate the BRAVE CF bantamweight division but to elevate African MMA to new heights. This isnt just about a title defenseits about a legacy.\n\nAnd if history has taught us anything, its this:Never bet against Nicholas Hwende.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30054553/nicholas-hwende.webp",
            "description": "<p>Black Belt Nicholas Hwende’s meteoric rise from the heart of Zimbabwe to global MMA stardom is a story that reads like a Hollywood blockbuster—grit, redemption, and ultimate triumph. Today, as the reigning BRAVE CF Bantamweight Champion, Hwende isn’t just wearing gold—he’s rewriting the narrative for African fighters in the world of mixed martial arts. Born</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-zimbabwe-to-the-top-of-the-mma-world-nicholas-hwendes-unstoppable-rise-as-africas-king-of-brave-cf/\">From Zimbabwe to the top of the MMA World: Nicholas Hwende’s unstoppable rise as Africa’s King of BRAVE CF!</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "Zuma’s daughter to appear in court over South Africa riots, reports say",
            "url": "https://www.newzimbabwe.com/zumas-daughter-to-appear-in-court-over-south-africa-riots-reports-say/",
            "content": "BBC\n\nThe daughter of former South African President Jacob Zuma, Duduzile Zuma-Sambudla, will be charged for her alleged involvement in the 2021 riots that left over 300 dead, her fathers party uMkhonto WeSizwe (MK) says.\n\nViolence, chaos, and fear ripped through the port city of Durban, then spread to Gauteng, after Zumas jailing sparked intense protests over four years ago.\n\nZuma-Sambudla, a controversial figure in her own right, was accused of sharing incendiary social media posts that fuelled the civil unrest.\n\nMK, of which she is a senior member, said on X she would appear in a Durban court on Thursday and urged supporters to mobilize all ground forces to attend in numbers.\n\nWhile she has not commented directly on the charges, Zuma-Sambudla shared a cryptic note on X that simply said: We see you.\n\nThis is not the first time her name has been brought up in connection to the 2021 riots, which are considered one of the bloodiest episodes in post-apartheid South Africa.\n\nZuma resigned as president in 2018 after nine years in office, plagued by corruption allegations, which he claimed were part of a political conspiracy.\n\nThree years later, he was sentenced to 15 months in prison for contempt of court after refusing to testify before a panel investigating corruption under his presidency.\n\nProtests erupted after he surrendered to serve his sentence.\n\nDuring the unrest, Zuma-Sambudla was outspoken on X, frequently sharing images of the destruction and chaos, accompanied by the caption: KZN, we see you.\n\nShe used this phrase often throughout the violence. In a now deleted post, she shared a video of someone firing an automatic rifle at a poster of President Cyril Ramaphosa.\n\nIn 2022, a spokesperson from the elite police unit, Hawks, Brig Thandi Mbambo told local media they were not directly investigating her, but she had been named in statements from sources.\n\nIn response to this, Zuma-Sambudlasaid on X, I have no fear! I will not be intimidated! I have beaten the dogs, now the masters are coming out! We see you!\n\nAt the same time,the Jacob Zuma Foundation, said in a statement the former presidents children were being targeted.\n\nLast year, the South African Human Rights Commission (SAHRC) released a report that said the riots were a carefully orchestrated event.\n\nBut it said it could find no direct link to Zumas arrest.\n\nIn 2023, a former security guard was sentenced to 12 years in prison for his role in the deadly riots.\n\nHe was the first person to be prosecuted for the riots.\n\nPresident Cyril Ramaphosa, who succeeded Jacob Zuma in 2018, described the violence as an attempted insurrection.\n\nMore than 200 shopping malls were looted and more than 150,000 jobs were estimated to have been lost during the unrest, which lasted for several days.\n\nLast year, Zumas MK ran against his former party, the ANC, in elections, gaining 15% of the vote to become the countrys third largest party.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30053914/DUDUZILE-ZUMA.webp",
            "description": "<p>BBC The daughter of former South African President Jacob Zuma, Duduzile Zuma-Sambudla, will be charged for her alleged involvement in the 2021 riots that left over 300 dead, her father’s party uMkhonto WeSizwe (MK) says. Violence, chaos, and fear ripped through the port city of Durban, then spread to Gauteng, after Zuma’s jailing sparked intense</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zumas-daughter-to-appear-in-court-over-south-africa-riots-reports-say/\">Zuma’s daughter to appear in court over South Africa riots, reports say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "Buy Zimbabwe undergoes restructuring",
            "url": "https://www.newzimbabwe.com/buy-zimbabwe-undergoes-restructuring/",
            "content": "By Staff Reporter\n\nBRAND promotions organisation, Buy Zimbabwe has undertaken a restructuring exercise to align itself with shifting market trends.\n\nIn a statement this Wednesday, the body announced the latest development that is aimed at empowering businesses.\n\nBuy Zimbabwe, has embarked on a massive transformation journey to keep in line with changing market trends to ensure that the millions of entrepreneurs and innovators who are failing to access markets are supported.\n\nIn consultation with its stakeholders, Buy Zimbabwe has realised the neccessity of embarking on a major transformation of the organisation.\n\nWhile awaiting the finalisation of the restructuring process, an interim team has been put in place that will see Munyaradzi Hwengwere assuming both the role of CEO (chief executive officer) and chairman while Alois Burutsa who was the General Manager move to the role of Marketing and Sales Consultant, reads the announcement.\n\nIn a bid to deepen the knowledge and database of current product portfolios on the local market, Buy Zimbabwe has appointed Select Research to undertake an in-depth study of consumer preferences for emerging and established brands.\n\nThe results of the study will feed into the formulation and restructuring of the prestigious Buy Zimbabwe Awards, which are being revamped into the Zimbrands Awards.\n\nTo get an appreciation of product preferences outside the capital, awards will be held in the leading provincial cities of Bulawayo, Gweru, Mutare and Masvingo, leading to the national awards to be hosted in Harare.\n\nBuy Zimbabwe remains committed to playing its part in ensuring that Zimbabwe doesnt lose the traction on local goods. To do this we will continue working with government, business and other stakeholders to push the acceptance and preference of local goods to create jobs, wealth and pride, further reads the statement.\n\nBuy Zimbabwe was established 13 years ago as a prime driver for the preference of locally produced quality goods and services.\n\nIts mission from the onset was to be a key player in the promotion of jobs, wealth and pride.\n\nWe are pleased that over the years the Buy Zimbabwe insignia has gained widespread acceptance and use by many companies and products.\n\nWe have also seen an increase in shelf space occupied by local products from 10% to over 50% for most local products.\n\nEqually, Zimbabwe has experienced the emergence of a number of new products on the market, especially from young entrepreneurs, women and the small to medium enterprises sector.\n\nThese inventors need to be supported to promote access to markets and economic growth. This is the direction that Buy Zimbabwe is now taking, Buy Zimbabwe said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30051740/Munyaradzi-Hwengwere.jpg",
            "description": "<p>By Staff Reporter BRAND promotions organisation, Buy Zimbabwe has undertaken a restructuring exercise to align itself with shifting market trends. In a statement this Wednesday, the body announced the latest development that is aimed at empowering businesses. “Buy Zimbabwe, has embarked on a massive transformation journey to keep in line with changing market trends to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/buy-zimbabwe-undergoes-restructuring/\">Buy Zimbabwe undergoes restructuring</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "ZIFA power handover set for Friday",
            "url": "https://www.newzimbabwe.com/zifa-power-handover-set-for-friday/",
            "content": "By Sport Reporter\n\nFollowing Saturdays election which saw the voting into power of a new executive to lead ZIFA, the outgoing Normalization Committee is set to officially hand over power on Friday.\n\nThe FIFA-appointed Normalization Committees term in office ends on January 31 after serving for a year and six months.\n\nSaturdays election saw Nqobile Magwizi being voted in as the new ZIFA President leading eleven team executives  two Vice Presidents and eight board members.\n\nMagwizi will be seconded by two Vice Presidents, former Premier Soccer League Chief Executive Officer Kenny Ndebele and former Herentals Queens football club captain Loveness Mukura.\n\nThe eight board members are Tafadzwa Benza, Brighton Ushendibaba, Kudzai Kadzombe, Davison Muchena, Thomas Marambanyika, Alice Zeure and two seats will be filled by the womens and mens soccer league chairpersons.\n\nThe Magwizi-led executive is expected to carry over from the Normalization Committee, which cleaned the countrys football ecosystem from a cancer of poor management for some years.\n\nPart of the mandates which FIFA gave the Normalization Committee were\n\n1) To create a Memorandum of Understanding between ZIFA and government through the Sports and Recreation Commission.\n\n2)To amend the ZIFA constitution\n\n3)To carry out a forensic audit on ZIFA financial accounts\n\n4) To pay FIFA Forward funds in time.\n\n5)To make sure the new ZIFA board receives proper financial handover.\n\nAlthough the power handover is yet to be conducted, NewZimbabwe.com has it on good authority that the new executive is already at the ZIFA house in Milton Park.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26075612/magwizi-secures-landslide-victory-in-zifa-presidential-election.webp",
            "description": "<p>By Sport Reporter Following Saturday’s election which saw the voting into power of a new executive to lead ZIFA, the outgoing Normalization Committee is set to officially hand over power on Friday. The FIFA-appointed Normalization Committee’s term in office ends on January 31 after serving for a year and six months. Saturday’s election saw Nqobile</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-power-handover-set-for-friday/\">ZIFA power handover set for Friday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "Zimbabwe dithers on confronting South Africa over the ‘massacre’ of its nationals at Stilfontein Mine",
            "url": "https://www.newzimbabwe.com/zimbabwe-dithers-on-confronting-south-africa-over-the-massacre-of-its-nationals-at-stilfontein-mine/",
            "content": "By Darlington Gatsi\n\nZIMBABWEAN authorities in South Africa are hesitant to confront the government about its role in the deaths of 20 Zimbabweans at the Buffelsfontein Gold Mine in Stilfontein.\n\nZimbabwean nationals are among over 80 bodies recovered from the mines shaft after over four months underground.\n\nConcerns have been raised over the South African governments role in the death of the illegal miners after police officers cut supplies of essentials such as food and medicine.\n\nMinister in the Presidency Khumbudzo Ntshavheni said, we will smoke them out, supporting the decision to shut food supplies to the miners.\n\nIt took the Pretoria High Court for community members and charitable organisations to provide rescue efforts and food to the miners trapped underground.\n\nSurvivors from the mine reportedly lived off cockroaches and human flesh and it is believed the deceased may have succumbed to hunger while trapped underground.\n\nAn official at the Zimbabwean Embassy in South Africa said the embassy is leaving the South African government to address the massacre of the miners.\n\nThis issue was really for South African authorities to handle through their policies, administrative processes and through their various agencies.\n\nAs you are aware it became an issue of litigation where various groups went to court in order to achieve a certain resolution of the matter. It is the court that decided that the government must provide the rescue services to get these miners out of the shafts. For Zimbabwe we have no role to play this is purely a matter that is within the sovereign government of South Africa to manage, said the source.\n\nThe disaster sparked widespread criticism of the South African government, with accusations of human rights violations.\n\nMinister of Mines Gwede Mantashe shrugged off criticism saying the government can not be held responsible for the illegal miners deaths.\n\nHarare has remained silent on the issue although most of the miners were Zimbabwean nationals.\n\nThe Zimbabwean Embassy has not been informed on the causes of death of its nationals.\n\nThat I think it is something the police If indeed they do any autopsy if it is even possible to do that, I do not know the state of the bodies or whether they were in such a state to enable them to do an autopsy but we do not have that information, said the source.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>By Darlington Gatsi ZIMBABWEAN authorities in South Africa are hesitant to confront the government about its role in the deaths of 20 Zimbabweans at the Buffelsfontein Gold Mine in Stilfontein. Zimbabwean nationals are among over 80 bodies recovered from the mine’s shaft after over four months underground. Concerns have been raised over the South African</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-dithers-on-confronting-south-africa-over-the-massacre-of-its-nationals-at-stilfontein-mine/\">Zimbabwe dithers on confronting South Africa over the ‘massacre’ of its nationals at Stilfontein Mine </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "We are with you – European Union tells Zimbabwe as US reevaluates foreign aid",
            "url": "https://www.newzimbabwe.com/we-are-with-you-european-union-tells-zimbabwe-as-us-reevaluates-foreign-aid/",
            "content": "By Thandiwe Garusa\n\nEUROPEAN Union (EU) ambassador to Zimbabwe, Jobst von Kirchmann reaffirmed its commitment to supporting Zimbabwes efforts to end Gender Based Violence (GBV).\n\nThe EU ambassador was speaking after the HeForShe march against GBV which was held in Harare Wednesday.\n\nThis comes at a time Zimbabwe faces uncertainty following newly-elected United States U.S President Donald Trumps executive orders of reevaluating and realigning his countrys foreign aid.\n\nWe are with you, yes we are with you and we support the efforts the government is doing to support against GBV, he said.\n\nAsked whether GBV programs in the country will be affected by the U.S.s decision, Women Affairs Minister Monica Mutsvangwa relayed the question to Kirchmann who further assured support to Zimbabwe.\n\nKirchmann also said the EU has mobilised over US$300 million specifically for gender equality and combating gender-based violence in Zimbabwe.\n\nThe European Union team together has mobilised over US$300 million for gender, equality and the fight against GBV in Zimbabwe only and I think you will see in the coming years lots of activities in that sense, he added.\n\nAmbassador of Canada to Zimbabwe Adler Aristide also weighed in saying his country will continue supporting Zimbabwe in the GBV fight.\n\nWe are not going to question the U.S in their decisions, we will have to see what they decide to do in three months but Canada will be here to continue their support and commitment to this cause, Aristide said.\n\nThe U.S. through USAID funds many GBV programs in Zimbabwe which will be affected if it ceases operations for good.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30050849/EU-ambassador-to-Zimbabwe-Jobst-von-Kirchmann-1-scaled.jpg",
            "description": "<p>By Thandiwe Garusa EUROPEAN Union (EU) ambassador to Zimbabwe, Jobst von Kirchmann reaffirmed its commitment to supporting Zimbabwe’s efforts to end Gender Based Violence (GBV). The EU ambassador was speaking after the HeForShe march against GBV which was held in Harare Wednesday. This comes at a time Zimbabwe faces uncertainty following newly-elected United States U.S</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-with-you-european-union-tells-zimbabwe-as-us-reevaluates-foreign-aid/\">We are with you – European Union tells Zimbabwe as US reevaluates foreign aid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "SADC schedules another extra-ordinary summit in Harare to discuss security crisis in DRC",
            "url": "https://www.newzimbabwe.com/sadc-schedules-another-extra-ordinary-summit-in-harare-to-discuss-security-crisis-in-drc/",
            "content": "By Thandiwe Garusa\n\nTHE Southern African Development Committee (SADC) is set to hold another extraordinary summit in Harare, Thursday to discuss the security situation in the Democratic Republic of Congo (DRC).\n\nThis comes after President Emmerson Mnangagwa who is also the SADC chairman vowed to take action against those responsible for attacks on UN and SADC peacekeepers in eastern DRC.\n\nAtleast 13 soldiers with peacekeeping forces in DRC were killed in clashes with the March 23 Movement (M23) rebels andover 400,000 people displacedsince the beginning of the year.\n\nThe M23, one of around 100 armed groups fighting for control in the mineral-rich region, briefly seized Goma in 2012 and reemerged in late 2021 with alleged support from Rwanda, according to the Congolese government and UN experts.\n\nThe Southern African Development Community (SADC) will convene an Extraordinary Summit of Heads of State and Government on 30thof January 2025 in Harare, Republic of Zimbabwe, to discuss the security situation in the eastern part of the Democratic Republic of Congo.\n\nThe Summit will be chaired by His Excellency Dr. Emmerson Dambudzo Mnangagwa, President of the Republic of Zimbabwe, and Chairperson of SADC.\n\nThe Summit follows the outcome of the Extraordinary Summit of the SADC Organ Troika plus the DRC and Troop Contributing Countries (TCCs) to the SADC Mission in the DRC (SAMIDRC), which was held on 28th January 2025 and was chaired by Her Excellency Dr. Samia Suluhu Hassan, the President of the United Republic of Tanzania and Chairperson of the SADC Organ on Politics Defence and Security Cooperation.\n\nThe Extraordinary Summit will be preceded by the meetings of the SADC Standing Committee of Senior Officials and the SADC Council of Ministers, the SADC Secretariat said in a statement Wednesday.\n\nMeanwhile, SADC recently held another extraordinary summit in November 2024 to discuss Mozambique and Botswana elections after having hosted the 44th SADC summit in August 2024 where Mnangagwa assumed the regional blocs rotational chairmanship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26042227/mnangagwa-sadc.jpg",
            "description": "<p>By Thandiwe Garusa THE Southern African Development Committee (SADC) is set to hold another extraordinary summit in Harare, Thursday to discuss the security situation in the  Democratic Republic of Congo (DRC). This comes after President Emmerson Mnangagwa who is also the SADC chairman vowed to take action against those responsible for attacks on UN and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-schedules-another-extra-ordinary-summit-in-harare-to-discuss-security-crisis-in-drc/\">SADC schedules another extra-ordinary summit in Harare to discuss security crisis in DRC </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        },
        {
            "title": "Three inmates slapped with a 20-year jail term each for sodomy",
            "url": "https://www.newzimbabwe.com/three-inmates-slapped-with-a-20-year-jail-term-each-for-sodomy/",
            "content": "By Staff Reporter\n\nThree inmates who took turns to sexually abuse their colleague overnight in a cell at Harare Remand Prison have been jailed for 20 years each by Harare magistrate Loice Mukunyadze.\n\nThe three are Kingswell Ngwerume (32), Kudakwashe Mazorodze (35) and Lazurus Chinobhururuka (40).\n\nThey were convicted of aggravated indecent assault after a full trial.\n\nThe State proved that on August 11 last year, the inmates were locked up for the night.\n\nMazorodze then instructed the complainant to enter Cell C2, where there were nine other inmates, including Ngwerume and Chinobhururuka.\n\nThe court heardthat the victim was awakened around midnight by Ngwerumes caresses.\n\nProsecutors also proved that Ngwerume sucked the complainants manhood.\n\nThe complainant declined Ngwerumes advances.\n\nThis infuriated Ngwerume who started assaulting the victim with the assistance of Chinobhururuka and Mazorodze.\n\nChinobhururuka allegedly forced the complainant to ingest an unidentified drink, which made him feel dizzy and powerless, said the state.\n\nThe three allegedly went on to remove the victims undergarments before taking turns to sodomise him several times.\n\nAfter the abuse, the three went back to their respective places.\n\nThe matter was reported to a prison officer who opened the cell the following morning and the victim was taken to hospital for a medical report.\n\nMunyaradzi Muza appeared for the State.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter Three inmates who took turns to sexually abuse their colleague overnight in a cell at Harare Remand Prison have been jailed for 20 years each by Harare magistrate Loice Mukunyadze. The three are Kingswell Ngwerume (32), Kudakwashe Mazorodze (35) and Lazurus Chinobhururuka (40). They were convicted of aggravated indecent assault after a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-inmates-slapped-with-a-20-year-jail-term-each-for-sodomy/\">Three inmates slapped with a 20-year jail term each for sodomy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:39",
            "date": "30 Jan 2025"
        }
    ]
}