{
    "news": [
        {
            "title": "Julius Malema convicted of firing a gun in public",
            "url": "https://www.newzimbabwe.com/julius-malema-convicted-of-firing-a-gun-in-public/",
            "content": "BBC\n\nSouth African opposition politician Julius Malema has been found guilty of discharging a firearm in public seven years ago.\n\nIn 2018, a video emerged showing the Economic Freedom Fighters (EFF) leader firing several shots in the air during his partys fifth anniversary celebrations held in the countrys Eastern Cape province.\n\nHe was charged alongside his former bodyguard Adriaan Snyman, who was acquitted.\n\nThis is Malemas second conviction in less than two months and he could face up to 15 years in prison.\n\nMalema often sparks controversy in a nation where, 31 years after apartheid ended, racial tensions still high. He was recently convicted of hate speech.\n\nMalema was convicted of five offences, including the unlawful possession of a firearm and ammunition, discharging it in a public space and reckless endangerment. The first charge carries a maximum 15-year sentence.\n\nHe was accused of firing between 14 and 15 live rounds on a stage in front of 20,000 EFF supporters, according to South African news site SowetanLIVE.\n\nIn his defence, Malema told the court the firearm was not his and that he had fired the shots to rouse the crowd, the publication added.\n\nIt took three days for magistrate Twanet Olivier to tell Malema you are found guilty as charged. The case was postponed to January 2026 for pre-sentencing.\n\nMalemas prosecution came after Afrikaner lobby group AfriForum, which has a contentious relationship with Malema and the EFF, opened a case against him after the video went viral.\n\nAfriForum was also among those who laid a hate speech complaint against the EFF MP at South Africas Human Rights Commission.\n\nThis resulted in his conviction by the countrys equality court in August this year.\n\nAfter an incident where a white man allegedly assaulted an EFF member, Malema said: No white man is going to beat me up you must never be scared to kill. A revolution demands that at some point there must be killing.\n\nThe equality court ruled that these remarks demonstrated an intent to incite harm, but the EFF said they were taken out of context.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/24191112/Julius-Malema.png",
            "description": "<p>BBC South African opposition politician Julius Malema has been found guilty of discharging a firearm in public seven years ago. In 2018, a video emerged showing the Economic Freedom Fighters (EFF) leader firing several shots in the air during his party’s fifth anniversary celebrations held in the country’s Eastern Cape province. He was charged alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/julius-malema-convicted-of-firing-a-gun-in-public/\">Julius Malema convicted of firing a gun in public</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Oct 2025"
        },
        {
            "title": "Congo’s ex-president Kabila sentenced to death in absentia by military court",
            "url": "https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/",
            "content": "Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/12005230/Joseph-Kabila-e1530910845219.jpg",
            "description": "<p>Reuters Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity. The case stems from his alleged role in backing the advance of Rwanda-backed M23 rebels in Congo’s volatile east. Kabila, who led Congo from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/\">Congo’s ex-president Kabila sentenced to death in absentia by military court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Oct 2025"
        },
        {
            "title": "HERD euthanises elephant Limpopo after fatal attack on senior carer",
            "url": "https://www.newzimbabwe.com/herd-euthanises-elephant-limpopo-after-fatal-attack-on-senior-carer/",
            "content": "IOL\n\nTHE elephant involved in a fatal incident with a senior carer at the Hoedspruit Elephant Rehabilitation and Development Trust (HERD) has been euthanised, following a failed attempt to relocate her where she showed aggression to other staff.\n\nHERD senior carer, Israel Shambira, was fatally gored by the 19-year-old female elephant named Limpopo earlier this month.\n\nIn the days following the incident, our dedicated carers remained in a state of heightened stress and concern, particularly regarding the safety of being near Limpopo. After extensive consultation among our senior carers, HERD Elephant Manager Tigere Matipedza, and founder of HERD, Adine Roode, with additional guidance from elephant behaviour expert Brett Mitchell, HERD resolved to move Limpopo along with six of her companions to a secure 35ha enclosure at the Hoedspruit Endangered Species Centre (HESC), located approximately ten kilometres away. The plan was to house the group at HESC under a temporary holding permit while a suitable long-term rewilding site could be identified. The remaining nine elephants were to remain at HERD, the organisation said.\n\n19-year-old female elephant, Limpopo. Image: Hoedspruit Elephant Rehabilitation and Development (HERD)\n\nThe available enclosure allowed for the carers to manage Limpopo and the other elephants under a protected contact type of management.\n\nThis decision was made on ethical and humane grounds to ensure the safety of HERD personnel and the responsible management of the elephants. The selection of elephants to be relocated was based on the best available data and the elephant social bonds.\n\nOn September 19, as the selected elephants started their walk from the HERD boma, within a few hundred metres, the elephants from both groups began vocalising, becoming very excitable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30150311/israel-shambira.png",
            "description": "<p>IOL THE elephant involved in a fatal incident with a senior carer at the Hoedspruit Elephant Rehabilitation and Development Trust (HERD) has been euthanised, following a failed attempt to relocate her where she showed aggression to other staff. HERD senior carer, Israel Shambira, was fatally gored by the 19-year-old female elephant named Limpopo earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/herd-euthanises-elephant-limpopo-after-fatal-attack-on-senior-carer/\">HERD euthanises elephant Limpopo after fatal attack on senior carer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Oct 2025"
        },
        {
            "title": "Zimbabwe’s gold coins top $4,000 for first time on Bullion rally",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins topped the $4,000 mark for the first time, lifted by a global rally in the metal that’s up 45% this year. The 22-carat “Mosi-Oa-Tunya” gold coins — named after Victoria Falls, a popular tourist destination, and introduced in 2022 to counter a rapid depreciation of the now-defunct local dollar — were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/\">Zimbabwe’s gold coins top $4,000 for first time on Bullion rally</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Oct 2025"
        },
        {
            "title": "OK Zimbabwe revenue tumbles by 53% amid supply chain disruptions",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-revenue-tumbles-by-53-amid-supply-chain-disruptions/",
            "content": "By Alois Vinga\n\nRetail giant OK Zimbabwe has reported a 53% decline in revenues, attributing the slump to supply chain disruptions, a liquidity crunch, and intensifying competition from the informal sector.\n\nPresenting the groups performance for the year ended March 31, 2025, OK Zimbabwe chairman Herbert Nkala said revenues fell to US$240 million, down 53% compared to the prior year, despite an average inflation rate of 15.21%.\n\nThe decline was linked to several factors, including exchange rate controls that distorted pricing and delayed supplier payments, which led to disruptions in product availability.\n\nSupply chain disruptions were as a result of the group failing to settle suppliers accounts on time leading to some withholding deliveries while others demanded payment upfront. These challenges resulted in the Groups operational capacity being impacted negatively, said Nkala.\n\nThe company carried out a comprehensive impairment review of all cash-generating units (CGUs). Due to constrained operational capacity, it recognised an impairment of US$10.3 million, as the recoverable amounts of certain CGUs fell below their carrying values.\n\nA net exchange gain of US$13.5 million was recorded, stemming from the revaluation of monetary liabilities after the devaluation of the Zimbabwe Gold (ZWG).\n\nDespite the challenges, the group has taken steps to strengthen its balance sheet. A rights issue raising US$20 million was concluded in July 2025, with proceeds received in August. An additional capital raise of US$10.5 million through the sale of immovable properties is underway, with offers currently under consideration.\n\nLooking ahead, cost optimisation and in-store as well as online sales strategies will remain central to achieving and sustaining the required growth. The recovery of the Group has started, but it will take some time to return to normal operations, added Nkala.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga Retail giant OK Zimbabwe has reported a 53% decline in revenues, attributing the slump to supply chain disruptions, a liquidity crunch, and intensifying competition from the informal sector. Presenting the group’s performance for the year ended March 31, 2025, OK Zimbabwe chairman Herbert Nkala said revenues fell to US$240 million, down 53%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-revenue-tumbles-by-53-amid-supply-chain-disruptions/\">OK Zimbabwe revenue tumbles by 53% amid supply chain disruptions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "01 Oct 2025"
        }
    ]
}