{
    "news": [
        {
            "title": "Harare woman ordered to pay ex-husband US$600k divorce settlement",
            "url": "https://www.newzimbabwe.com/harare-woman-ordered-to-pay-ex-husband-us600k-divorce-settlement/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by Abigail Makono seeking to stop the execution of a US$600,000 divorce settlement owed to her ex-husband, Charles Makono, ruling that her challenge was manifestly groundless and an abuse of court process.\n\nJustice Regis Dembure, in the October 16 judgment, ordered Abigail to pay legal costs on a higher practitionerclient scale, warning that the court will not tolerate anyone attempting to evade compliance with its orders.\n\nThe dispute arose after a consent order in April 2025 required Abigail to pay Charles US$600,000 in exchange for properties awarded to her in their divorce settlement. Instead of paying, she sought to have the writ of execution declared invalid, alleging that Charles had failed to sign property transfer documents.\n\nDembure rejected the claim, saying, A party that has failed to fulfil its own obligations in terms of the consent order cannot seek to enforce the obligations of the other party.\n\nThe court found that Charles had already complied by signing and delivering the necessary documents.\n\nAbigails lawyer, Chivhenge, later abandoned some arguments, conceding that claims about improper mixing of movable and immovable property were untenable.\n\nThere should be no debate at all, said the judge.\n\nA litigant who has defied an order of court cannot, in the same breath, seek the courts assistance to avoid paying.\n\nThe ruling reinforces the binding nature of court orders and signals a strong judicial stance against attempts to sidestep financial obligations in divorce settlements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/12181629/Divorce-image.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by Abigail Makono seeking to stop the execution of a US$600,000 divorce settlement owed to her ex-husband, Charles Makono, ruling that her challenge was “manifestly groundless” and an abuse of court process. Justice Regis Dembure, in the October 16 judgment, ordered Abigail to pay legal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-woman-ordered-to-pay-ex-husband-us600k-divorce-settlement/\">Harare woman ordered to pay ex-husband US$600k divorce settlement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "21 Oct 2025"
        },
        {
            "title": "Namibia declares Mpox outbreak following confirmed case in Swakopmund",
            "url": "https://www.newzimbabwe.com/namibia-declares-mpox-outbreak-following-confirmed-case-in-swakopmund/",
            "content": "IOL\n\nThe Ministry of Health and Social Services (MoHSS) of Namibia has declared an outbreak of Mpox following the confirmation of the first case in Swakopmund, Erongo Region, on 18 October 2025.\n\nThe patient, who is being treated at the Swakopmund District Hospital, is stable and currently isolated, undergoing comprehensive medical care.\n\nThe preliminary investigation into the outbreak has indicated that this transmission may be linked to cross-border travel within the Southern African Development Community (SADC) region. In accordance with World Health Organisation (WHO) protocols, the detection of even a single confirmed case necessitates the declaration of an outbreak, prompting health authorities to launch an immediate response.\n\nThe MoHSS has assured the Namibian public that the countrys robust surveillance system is primed to identify and monitor individuals exhibiting signs of mpox. Additional cases are being actively sought, while health authorities in the Erongo region are closely monitoring the patients immediate contacts to prevent further spread of the virus.\n\nMpox is a zoonotic disease caused by an orthopox virus, resulting in smallpox-like symptoms in humans. This outbreak follows a concerning trend, as multiple countries within Africa, including the Democratic Republic of the Congo (DRC), Zambia, Malawi, and Tanzania, are reporting active mpox cases.\n\nMpox symptoms typically manifest after an incubation period ranging from 5 to 21 days and can include:\n\nThe rash often appears on the face, palms, and soles of the feet, and can also affect the mouth, genitals, and eyes. Symptoms generally last from two to four weeks, during which the infected individuals are capable of transmitting the virus to others.\n\nHuman-to-human transmission occurs primarily through direct contact with respiratory secretions, bodily fluids, or skin lesions of an infected person. The MoHSS outlines several potential avenues for transmission, including:\n\nAs mpox can affect anyone regardless of demographic, the MoHSS urges the public to take preventive measures. These include:\n\nIn light of this outbreak, the MoHSS has mobilised necessary resources to respond effectively, emphasising the importance of public cooperation. Citizens are encouraged to remain calm and to refrain from spreading unverified information, which could instigate unnecessary panic or stigma towards affected individuals and their families.\n\nAs Namibian health officials continue to monitor the situation closely, ongoing updates will be provided to keep the public informed. The health and well-being of all citizens remain a top priority for the government and health authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14052550/mpox.jpg",
            "description": "<p>IOL The Ministry of Health and Social Services (MoHSS) of Namibia has declared an outbreak of Mpox following the confirmation of the first case in Swakopmund, Erongo Region, on 18 October 2025. The patient, who is being treated at the Swakopmund District Hospital, is stable and currently isolated, undergoing comprehensive medical care. The preliminary investigation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibia-declares-mpox-outbreak-following-confirmed-case-in-swakopmund/\">Namibia declares Mpox outbreak following confirmed case in Swakopmund</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "21 Oct 2025"
        },
        {
            "title": "Afrotellers founder Chivhanga wants Africans to reclaim ownership of their stories",
            "url": "https://www.newzimbabwe.com/afrotellers-founder-chivhanga-wants-africans-to-reclaim-ownership-of-their-stories/",
            "content": "The Citizen\n\nThere are usually grumbles about how Africa doesnt tell its stories enough, with the rest of the world being the narrators of whats happening on the continent.\n\nStorytelling is not just about remembering where we come from, its about shaping where we are going, said CEO of Thrive Afrika and Founder of Afrotellers, Willson Chivhanga.\n\nTo strengthen the ecosystem of African storytellers, The Afrotellers Conference returns to Johannesburg for its second edition this week.\n\nAcross the continent, we are seeing a new generation using stories to confront injustice, reframe history, and imagine futures rooted in dignity, said Chivhanga.\n\nThe three-day gathering is set to take place at the Market Theatre Precinct, Market Square, and the Wits University School of Arts from Thursday to Saturday.\n\nThe Afrotellers Conference is convened by social impact agency Thrive Afrika, in partnership with the Wits School of Arts and the Market Theatre Foundation.\n\nAccording to Chivhanga, the conference is a space for African storytellers to reclaim ownership of their narratives and speak about the continent, its people and its possibilities on their own terms.\n\nAfrotellers is a growing movement. It does not end when the doors close; rather its an ecosystem that connects communities through their stories, said the founder.\n\nThe first edition of the conference saw more than 130 participants from across Africa and the diaspora.\n\nAfrotellers has grown into a continental movement connecting artists, activists and thinkers through community storytelling hubs in Malawi, South Africa, Kenya, Ghana, Nigeria, DR Congo, Lesotho and Zimbabwe.\n\nFrom village gatherings to urban collectives, we are seeing a shared language of resistance, creativity and care emerging across Africa, Chivhanga said.\n\nThis years edition will build on the foundation that was laid in the previous year by exploring storytelling as infrastructure  shaping how Africans imagine themselves, relate to one another and influence how the continent is perceived globally.\n\nSome of the speakers for this years Afrotellers include playwright and scholar Dr Refiloe Lepere, Zimbabwean political organiser Gift Ostallos Siziba, visual activist Prof. Sir Zanele Muholi, Ugandan philanthropy leader Jackie Asiimwe, playwright and director Monageng Vice Motshabi and photographer Andrew Tshabangu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20203841/Chivanga-Afrotellers.jpg",
            "description": "<p>The Citizen The three-day Afrotellers Conference returns to Johannesburg for its second edition this week. There are usually grumbles about how Africa doesn’t tell its stories enough, with the rest of the world being the narrators of what’s happening on the continent. “Storytelling is not just about remembering where we come from, it’s about shaping</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afrotellers-founder-chivhanga-wants-africans-to-reclaim-ownership-of-their-stories/\">Afrotellers founder Chivhanga wants Africans to reclaim ownership of their stories</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "21 Oct 2025"
        },
        {
            "title": "Zimbabwe dominate on rain-marred opening day",
            "url": "https://www.newzimbabwe.com/zimbabwe-dominate-on-rain-marred-opening-day/",
            "content": "Cricbuzz\n\nOn a rain-marred opening day of the second Test, Zimbabwe took the honors against Afghanistan in Bulawayo. Sikandar Raza (3-30), Newman Nyamhuri (3-42) and Blessing Muzarabani (2-56) were the major stars with the ball as Afghanistan folded for a paltry total of 157. In reply, Zimbabwes opening pair of Ben Curran and Joylord Gumbie negotiated three overs before bad light forced slightly early stumps with Zimbabwe at 6/0. It capped a strong start to the game for the hosts who won a good toss earlier in the morning.\n\nIncessant rains and then wet outfield meant that the first session was entirely lost and Zimbabwes captain Craig Ervine had no hesitation to bowl on winning the toss. After a slightly erratic start with the new ball, the Zimbabwe pacers got their radar right on a pitch that had life in it. Extra bounce was on offer and some seam movement as well, although not as extravagant as generally seen at this venue. Abdul Malik and debutant Riaz Hassan weathered the early storm but both fell in quick succession once Zimbabwes new-ball pairing hit their straps.\n\nIt was, however, a run out that gave Zimbabwe the first breakthrough as Hassan fell to a direct hit from Brian Bennett. It was just the tonic the home side needed and Nyamhuri then got Malik caught behind to give Zimbabwe further momentum in the afternoon session. Rahmat Shah and Hashmatullah Shahidi prevented further damage in the session but Zimbabwe continued to make inroads after tea. The impressive Nyamhuri broke the partnership between last games heroes Rahmat and Shahidi but getting the skipper LBW. Raza then got into the act to castle Rahmat as Afghanistan continued to slip away.\n\nOnce Rahmat fell, it was a procession for the visitors as Raza and Muzarabani sliced through the lower order. If not for comeback man Rashid Khans 20-ball 25, the total would have been much lesser. Even with the tricky nature of the pitch, the Afghanistan were easily about 50-60 runs short although the pitch cannot be judged till both sides bat on it.\n\nBrief scores:Afghanistan 157 (Sikandar Raza 3-30, Newman Nyamhuri 3-30) vs Zimbabwe 6/0\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20205729/sikandar-raza-returned-3-for-3.webp",
            "description": "<p>Cricbuzz On a rain-marred opening day of the second Test, Zimbabwe took the honors against Afghanistan in Bulawayo. Sikandar Raza (3-30), Newman Nyamhuri (3-42) and Blessing Muzarabani (2-56) were the major stars with the ball as Afghanistan folded for a paltry total of 157. In reply, Zimbabwe’s opening pair of Ben Curran and Joylord Gumbie</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-dominate-on-rain-marred-opening-day/\">Zimbabwe dominate on rain-marred opening day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "21 Oct 2025"
        },
        {
            "title": "I moved from the UK to Zimbabwe – I sold my business & family’s ‘forever home’ but here’s 3 reasons it’s better",
            "url": "https://www.newzimbabwe.com/i-moved-from-the-uk-to-zimbabwe-i-sold-my-business-familys-forever-home-but-heres-3-reasons-its-better/",
            "content": "The Sun\n\nMOVING to another country is always a big decision, but for this family it made more sense to pack up their life and head to sunny Zimbabwe than stay in the UK.\n\nNat and her family decided to move after their lives began to revolve around work nonstop.\n\nY\n\nBetween seemingly endless hours of work and household chores, errands, and the risingcost of living, life in the UK didnt make sense for Nat and her family anymore.\n\nSpeaking in a viral TikTok video, Nat, who posts as @naturallyfakemum, explained she was also missing spending valuable time with her kids because of her busy lifestyle.\n\nIt was a stressful way of life, the mum said as she explained how she would drop her kids off at school before heading to the bakery where she worked, then bring them back to her work after they finished school.\n\nEventually Nat and her husband, who grew up in Zimbabwe, began to discuss making the move.\n\nHe always said he had the best childhood [in Zimbabwe] playing outside every day, going to the lake, being very sociable, Nat said.\n\nNot only that, but all of her husbands side of the family were still based in Zimbabwe, so the move felt right.\n\nThats when Nat decided to sell her bakerybusinessand the family waved goodbye to what they thought was their forever home.\n\nOne and a half years later and Nat said her family have well and truly settled into their new life in Zimbabwe.\n\nNot only is theweatherbetter, but both Nat and her husband have more free time on their hands.\n\nThe mum even raved about the quality of the food over there compared to in the UK, noting that its much more fresh.\n\nAs for her kids, she said theyre enjoying school and are playing outside more like she always wanted them to do.\n\nAfter sharing her reasons for moving, fellowTikTokusers were left divided over it.\n\nOne said: I dont get it, is the UK not better than Zimbabwe, why is everybody dying to get to the UK then?\n\nBut another commented: Food in Zimbabwe is fresh and organic, theschoolsare among the best you can find, traditional education values etc.\n\nYou know your children are safe and dont have to worry about bullying or discipline problems. The country is also safe and friendly.\n\nAnd a third agreed: Zimbabwe is beautiful, the lifestyle is unmatched.\n\nI grew up in Zimbabwe and also had the best childhood, someone else wrote.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20092405/high-angle-view-buildings-park-harare.jpg",
            "description": "<p>The Sun MOVING to another country is always a big decision, but for this family it made more sense to pack up their life and head to sunny Zimbabwe than stay in the UK. Nat and her family decided to move after their lives began to revolve around work nonstop. Y The mum waved goodbye</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-moved-from-the-uk-to-zimbabwe-i-sold-my-business-familys-forever-home-but-heres-3-reasons-its-better/\">I moved from the UK to Zimbabwe – I sold my business & family’s ‘forever home’ but here’s 3 reasons it’s better</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "21 Oct 2025"
        },
        {
            "title": "India sparkles as millions celebrate Diwali festival",
            "url": "https://www.newzimbabwe.com/india-sparkles-as-millions-celebrate-diwali-festival/",
            "content": "By Cherylann Mollan l BBC\n\nMILLIONS of Indians are celebrating Diwali, the festival of lights, one of Hinduisms most significant and widely observed festivals.\n\nWhile lamps and firecrackers light up homes and streets during the festival, they also worsen air pollution  a problem especially pronounced in northern India, where winter months already bring poor air quality.This year, the Supreme Court has permitted the sale and use of green crackers in the capital, Delhi, to help curb air pollution, ending a ban on crackers that has been in place since 2020.Green crackers claim to emit 2030% less pollution than traditional firecrackers, but critics doubt their actual effectiveness in protecting the environment.In recent years, several states have restricted or banned firecrackers to combat rising air pollution, but the rules are often flouted, further worsening air quality in the days after Diwali.Authorities have been cracking down on traditional firecrackers as pollution levels riseBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.Families prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nWhile lamps and firecrackers light up homes and streets during the festival, they also worsen air pollution  a problem especially pronounced in northern India, where winter months already bring poor air quality.\n\nThis year, the Supreme Court has permitted the sale and use of green crackers in the capital, Delhi, to help curb air pollution, ending a ban on crackers that has been in place since 2020.Green crackers claim to emit 2030% less pollution than traditional firecrackers, but critics doubt their actual effectiveness in protecting the environment.In recent years, several states have restricted or banned firecrackers to combat rising air pollution, but the rules are often flouted, further worsening air quality in the days after Diwali.Authorities have been cracking down on traditional firecrackers as pollution levels riseBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.Families prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nThis year, the Supreme Court has permitted the sale and use of green crackers in the capital, Delhi, to help curb air pollution, ending a ban on crackers that has been in place since 2020.\n\nGreen crackers claim to emit 2030% less pollution than traditional firecrackers, but critics doubt their actual effectiveness in protecting the environment.In recent years, several states have restricted or banned firecrackers to combat rising air pollution, but the rules are often flouted, further worsening air quality in the days after Diwali.Authorities have been cracking down on traditional firecrackers as pollution levels riseBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.Families prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nGreen crackers claim to emit 2030% less pollution than traditional firecrackers, but critics doubt their actual effectiveness in protecting the environment.\n\nIn recent years, several states have restricted or banned firecrackers to combat rising air pollution, but the rules are often flouted, further worsening air quality in the days after Diwali.Authorities have been cracking down on traditional firecrackers as pollution levels riseBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.Families prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nIn recent years, several states have restricted or banned firecrackers to combat rising air pollution, but the rules are often flouted, further worsening air quality in the days after Diwali.\n\nAuthorities have been cracking down on traditional firecrackers as pollution levels riseBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.Families prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nAuthorities have been cracking down on traditional firecrackers as pollution levels rise\n\nBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.Families prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nBut Diwali is about much more than fireworks. Food plays a central role in the celebrations.\n\nFamilies prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.In the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nFamilies prepare a variety of traditional Indian sweets which are shared with friends and neighbours. Festive meals often include rich curries, savoury snacks, and special breads.\n\nIn the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.Many also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nIn the days leading up to the festival, people clean and decorate their homes, shop for new clothes, and buy traditional sweets to exchange as gifts with friends and family.\n\nMany also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.Diwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nMany also create traditional and colourful rangoli designs outside their doors to invite luck and positivity. On Diwali itself, families worship Lakshmi, the Hindu goddess of wealth.\n\nDiwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.Across Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nDiwalis appeal goes beyond religion, drawing people from different communities and faiths to join in the celebrations.\n\nAcross Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\nAcross Indias cities and towns, markets bustle with shoppers buying sweets, gifts, decorations, and firecrackers, giving a significant boost to the economy each year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20062854/19a4ef50-ab23-11f0-93f3-35cf52b1b510.jpg.webp",
            "description": "<p>By Cherylann Mollan l BBC MILLIONS of Indians are celebrating Diwali, the festival of lights, one of Hinduism’s most significant and widely observed festivals. While lamps and firecrackers light up homes and streets during the festival, they also worsen air pollution – a problem especially pronounced in northern India, where winter months already bring poor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/india-sparkles-as-millions-celebrate-diwali-festival/\">India sparkles as millions celebrate Diwali festival</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:00",
            "date": "21 Oct 2025"
        }
    ]
}