{
    "news": [
        {
            "title": "I never believed my child would one day have a birth certificate – Binga villager says in salute to ongoing remote registration blitz",
            "url": "https://www.newzimbabwe.com/i-never-believed-my-child-would-one-day-have-a-birth-certificate-binga-villager-says-in-salute-to-ongoing-remote-registration-blitz/",
            "content": "By Leopold Munhende recently in Binga\n\nWITH his wife seated on the carrier and their one-year-old son on her back, Honest Mudenda (28) cycled 10 kilometres on a perry bike to register a birth certificate last Wednesday, a two-hour ride through dense forests lined with all manner of wild animals found along Lake Kariba.\n\nOnly those who witnessed the couples smiles would understand how something so ordinary, so simple for most urbanites, can make a villager in far-flung Siamusanga, Binga happy.\n\nThe Mudenda family is one of many villagers in hard to reach areas that have benefited from a Civil Registration Department (CRD) led, Swedish government-funded and UNICEF-supported initiative to register birth certificates, national identity cards and death certificates.\n\nWearing brightly lit smiles, Mudenda said they were confident the certificate would change fortunes for their baby.\n\nThey live at Mujere Fishing Camp, some 198km from Binga Centre, on the shores of Lake Kariba, where internet is a luxury, radio signal is yet to reach and Zambia is a herd mans whistle away.\n\nThat Siamusanga is hard to reach is not up for discussion.\n\nElephants roam freely on the shores of the mighty Lake Kariba, and leopards and lions are not a rare sight too deep amongst the Tonga-speaking communities there.\n\nHonest Mudenda, a beneficiary of the ongoing programme, called for it to extend to their fishing camps that are also hard to reach.\n\nI never believed that one day my child would have a birth certificate. A lot of people in our community do not have these documents because there is nowhere to get them and Binga Centre is too far for them to travel to, said a visibly happy Mudenda.\n\nThere is no transport to get here from the fishing camp I work at, I for one used a bicycle to get here with my wife and child on the carrier, cautiously riding through forests which are usually full of wild animals.\n\nWe hope this programme continues so as to benefit more people; if it is possible, they can actually visit our camps too.\n\nBefore the satellite registration centre was opened, villagers had to travel 183km to Binga Centre, a distance that would be short were it tarred.\n\nIt is, however, a gruelling seven-hour drive, and costs no less than US$15 when using public transport, which is a fortune for simple fishermen.\n\nThe only public transport they know of is a ZUPCO bus that plies their route twice a week, on Wednesdays and Sundays, and even then, it does not get anywhere near Siamusanga. Its route ends about 60km from Siamusanga, at Chunga Growth Point.\n\n39-year-old Norah Mende, who proudly brandished her fifth childs new birth certificate, called for authorities to consider building a registry office closer to their remote villages.\n\nThe process is so smooth, I now have my sons birth certificate, have changed my ID and gotten my picture taken, said Mende with a giddy laugh. She walked four kilometres to the centre.\n\nThis facility should not leave this area because a lot of people do not have these documents and without it, we have to go to Siabuwa or Binga. Our children need these documents to attend school and write examinations, now consider that children are born every year.\n\nA young lady giving details as officials take them down to process her first ever identify card at Siamusanga Primary School.\n\nBinga, just like Mwenezi, is considered a hard-to-reach area, where villagers and animals share resources, clash often, and far more depressing, where basic services are hardly accessible.\n\nThere is 150km of partially tarred road between Cross Dete (along the Bulawayo-Victoria Falls highway) and Binga, most of which is a strip of a potholed former road.\n\nThe place is so far flung, Zambia could easily have claimed it and most Zimbabweans would not know of it.\n\nUp until the Zimbabwean, Swedish governments, and UNICEFs recent intervention, tens of thousands lived and died without having procured a birth certificate or national identity document, not for a shortage of need but access.\n\nThis is part of a broader programme that the CRD is embarking on in collaboration with UNICEF, where we are going around eight rural provinces of Zimbabwe targeting hard-to-reach areas to issue birth, death certificates and national IDs, said Christina Chikerema, the CRDs Deputy Registrar General in Charge of Operations.\n\nBy targeting hard-to-reach areas, we are ensuring that we leave no one and no place behind. So far, we have been to Chikombedzi (Masvingo Province), Mhangura (Mashonaland West) and Mangwe (Matabeleland South).\n\nOur partnership with the Swedish government and development partners such as UNICEF is very key in this programme.\n\nTraditional leaders also have been roped in the drive that has seen them taking on the responsibility to teach their communities on the process, encourage them to take identity documents and also register births that occur within their areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15011841/WhatsApp-Image-2025-07-14-at-18.45.33.jpeg",
            "description": "<p>By Leopold Munhende recently in Binga WITH his wife seated on the carrier and their one-year-old son on her back, Honest Mudenda (28) cycled 10 kilometres on a perry bike to register a birth certificate last Wednesday, a two-hour ride through dense forests lined with all manner of wild animals found along Lake Kariba. Only</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-never-believed-my-child-would-one-day-have-a-birth-certificate-binga-villager-says-in-salute-to-ongoing-remote-registration-blitz/\">I never believed my child would one day have a birth certificate – Binga villager says in salute to ongoing remote registration blitz   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "15 Jul 2025"
        },
        {
            "title": "Woman smuggled baby into UK using fake birth story",
            "url": "https://www.newzimbabwe.com/woman-smuggled-baby-into-uk-using-fake-birth-story/",
            "content": "BBC\n\nLast summer, a woman was arrested at Gatwick Airport after she arrived from Nigeria with a very young baby girl.\n\nThe woman had been living in West Yorkshire with her husband and children, and before leaving the UK for Africa had told her GP she was pregnant.\n\nThat was not true.\n\nWhen the woman returned about a month later with the baby, she was arrested on suspicion of trafficking.\n\nThe case, the second the BBC has followed through the Family Court in recent months, reveals what experts say is a worrying trend of babies possibly being brought to the UK unlawfully  some from so-called baby factories in Nigeria.\n\nThe woman, who we are calling Susan, is Nigerian, but had been living in England since June 2023, with her husband and children.\n\nA careworker with leave to remain in Britain, Susan claimed she was pregnant. But scans and blood tests showed that wasnt true. Instead, they revealed Susan had a tumour, which doctors feared could be cancerous. But she refused treatment.\n\nSusan insisted her previous pregnancies had been invisible on scans, telling her employer, my babies are always hidden. She also claimed shed been pregnant for up to 30 months with her other children.\n\nSusan had travelled to Nigeria in early June 2024, saying she wanted to have her baby there, and then contacted her local hospital in Britain, to say she had given birth.\n\nDoctors were concerned and contacted childrens services.\n\nArriving back in the UK with the baby girl  who were calling Eleanor  Susan was stopped and arrested by Sussex Police.\n\nShe was bailed and the lead police force on this confirmed there is no active investigation at the moment.\n\nAfter her arrest, Susan, her husband, and Eleanor were given DNA tests. Eleanor was taken to foster carers.\n\nWhen the results show that I am Eleanors mother, I want her to be returned immediately, Susan said.\n\nBut the tests showed the baby had no genetic link with Susan or her husband. Susan demanded a second test  which gave the same result, and then she changed her story.\n\nShed had IVF treatment before moving to Britain in 2023 with a donor egg and sperm, she said, and thats why the DNA tests were negative.\n\nSusan provided a letter from a Nigerian hospital, signed by the medical director, saying shed given birth there, as well as a document from another clinic about the IVF treatment to back up her claims.\n\nShe also provided photos and videos which she said showed her in the Nigerian hospitals labour suite. No face is visible in the images and one showed a naked woman with a placenta between her legs, with an umbilical cord still attached to it.\n\nThe Family Court in Leeds sent Henrietta Coker to investigate.\n\nMs Coker, who provides expert reports to family courts in cases like this, has nearly 30 years experience as a social worker. She trained in Britain, and worked in front-line child protection in London, before moving to Africa.\n\nMs Coker visited the medical centre where Susan claimed shed had IVF. There was no record of Susan having had treatment there  staff told her the letter was forged.\n\nShe then visited the place Susan said shed given birth. It was a shabby, three bedroom flat, with stained walls and dirty carpets.\n\nThere Ms Coker was met by three young teenage girls sitting in the reception room with nurses uniforms on.\n\nShe asked to speak to the matron and was ushered into the kitchen where a teenage girl was eating rice.\n\nMs Coker then tracked down the doctor whod written a letter saying Susan had given birth there. He said, Yes, someone had given birth.\n\nMs Coker showed him a photograph of Susan, but it wasnt her, the doctor said.\n\nImpersonating people is common in this part of the world, he told Ms Coker, suggesting that Susan might have bought the baby.\n\nSupplied Henrietta Coker has decades of experience as a social worker\n\nThe practice of baby farming is well known in West Africa, Ms Coker later told the court. At least 200 illegal baby factories have been shut down by the Nigerian authorities in the last five years, she said.\n\nSome contained young girls whod been kidnapped, raped, and forced to give birth repeatedly.\n\nSometimes these girls are released, Ms Coker said, other times they die during childbirth, or are murdered and placed in the grounds of the organisation.\n\nIts not clear where baby Eleanor might have come from  though the doctor told Ms Coker he believed she would have been given up voluntarily.\n\nMs Coker was unable to establish who Eleanors real parents are.\n\nShe gave evidence to the Family Court in Leeds in March this year, along with Susan, her husband, her employer and a senior obstetrician.\n\nAt an earlier hearing the judge asked for Susans phone to be examined. Investigators found messages which Susan had sent to someone saved in her address book as Mum oft [sic] Lagos Baby.\n\nAbout four weeks before the alleged date of birth Susan wrote a text message which read:\n\nGood afternoon ma, I have not seen the hospital items\n\nThe same day, Mum Oft Lagos Babyresponded:\n\nDelivery drug is 3.4 m\n\nHospital bill 170k.\n\nAssuming those sums to be Nigerian Naira, they would be in the region of 1,700 and 85 respectively, the Family Court judge, Recorder William Tyler KC said.\n\nThe local authority pointed out the messages were set to automatic self-destruct mode  and said they represented evidence of a deal to purchase a baby.\n\nSusan tried to explain the messages in court. The Recorder said her attempts were difficult to follow and impossible to accept.\n\nRecorder Tyler, sitting as a Deputy Judge of the High Court, found Susan had staged a scene which she falsely claimed showed her giving birth to Eleanor in Nigeria.\n\nHe said Susan and her husband had put forward a fundamental lie to explain how Eleanor came to be in their care, and had tried to mislead authorities with false documents.\n\nTheyd both caused the little girl significant emotional and psychological harm, he said.\n\nIn early July, the BBC attended the final hearing in Eleanors case, held remotely.\n\nIn one little square of the Teams meeting we could see Susan and her husband, sitting upright, barely moving, focused closely on what the advocates said.\n\nThey wanted Eleanor returned to them. Their barristers said their own children were thriving  they wanted to offer her the same love and care.\n\nSusans husband saw Eleanor as a fundamental part of their family unit.\n\nVikki Horspool, representing the childs guardian, a social worker from the Independent Children and Family Child Advisory Service challenged that. She said that the couple continued to be dishonest about Eleanors real start in life and how she came to be in their care.\n\nThe judge ordered that baby Eleanor be placed for adoption, and also made a declaration of non parentage. He said he was aware of the pain this would cause Susan and her husband.\n\nThe barrister for the local authority told the court that the baby is very settled with her foster carer, taking part in activities in her community and getting medical treatment.\n\nWhen Eleanor is adopted she will have a new identity and British nationality  but she may never know who her real parents are.\n\nEleanors storyechoes the case of Lucy who was brought into Manchester Airport in 2023, by a man claiming to be her father.\n\nMs Coker believes it is likely that more children have been brought unlawfully to the UK from West Africa. She told the BBC she has worked on around a dozen similar cases since the pandemic. In her experience, baby trafficking is commonplace.\n\nMoney is getting exchanged for children on a large scale she said  not just in Africa but across the global south.\n\nSince 2021 the UK government has restricted adoptions from Nigeria, partly because of evidence of organised child trafficking within the country.\n\nBritish authorities have been aware of the problem for many years, and there have been several cases in the Family Courts over the last 20 years.\n\nTwo hearings in 2011 and 2012 involvedNigerian couples whod had fertility treatment  that led to a miracle baby.\n\nThese treatments continue, as recently exposed byinvestigative journalists at BBC Africa Eye.\n\nIn 2013, the UK High Commission in Lagos required DNA tests in certain circumstances before newborn babies could be taken from Nigeria to Britain.\n\nAmong 12 couples investigated was a former Oxford academic,prosecuted for immigration offences.\n\nHoweverthis process has since stopped.In 2018 officials were advised that such DNA testing was unlawful.\n\nThey were told they could not make people undergo DNA testing when they were asking for a visa or passport in support of an application relating to immigration status  and that had been the case since 2014.\n\nMs Coker said some clinics offer packages that include registering the babys birth. It will cost anywhere between 2,000 and 8,000, excluding any airfare, she said.\n\nShe thinks more people in Britain should be aware of this activity.\n\nIt is hard to tackle, she said  perhaps DNA testing of newborn babies and purported parents would help.\n\nBut she wasnt sure the British government can do much to stop it, she said, the issues start in countries where the children are born.\n\nPatricia Durr, CEO of the anti-trafficking charity ECPAT said cases like this were particularly heinous because they denied a child right to their identity.\n\nShe said: Every effort must be made to prevent these egregious crimes occurring.\n\nA government spokesperson said: Falsely claiming to be the parent of a child to facilitate entry to the UK is illegal. Those found doing so will face the full force of the law.\n\nBorder Force is committed to protecting individuals who cross the border and where concerns are raised, officers will take action to safeguard individuals who could be at risk.\n\nThe BBC contacted the Nigerian High Commission for comment but they did not respond.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15014039/baby.webp",
            "description": "<p>BBC Last summer, a woman was arrested at Gatwick Airport after she arrived from Nigeria with a very young baby girl. The woman had been living in West Yorkshire with her husband and children, and before leaving the UK for Africa had told her GP she was pregnant. That was not true. When the woman</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-smuggled-baby-into-uk-using-fake-birth-story/\">Woman smuggled baby into UK using fake birth story</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "15 Jul 2025"
        },
        {
            "title": "How Zimbabwe became the home of African guitar music",
            "url": "https://www.newzimbabwe.com/how-zimbabwe-became-the-home-of-african-guitar-music/",
            "content": "Chimuerenga means uprising, not in a metaphorical sense either. Its a Shona word that loosely translates into revolutionary struggle. It has been adapted into the word commonly used whenever peopleprotestand start pushing back against the political structures keeping them oppressed. In the culture of Zimbabwe, this is a word that, sadly, is deployed a lot. So much so that its developed a second meaning, describing the genre of music that came from Zimbabwe in the mid-1960s.\n\nThis was a time before the country was officially referred to as Zimbabwe as well. From 1923 to 1965, the country was under British occupation and referred to as Southern Rhodesia. After the British upped sticks, the name was shortened to Rhodesia at the insistence of its majority white government, which was desperately seeking to maintain control of the country in the face of a growing insurgency movement lead by Black nationalist groups.\n\nAll moments of civil unrest need a soundtrack and this conflict, known as the Rhodesian Bush War, had an absolute banger. Thomas Mapfumo was a native Zimbabwean who sought to take music traditional to Shona culture and combine it with American and British rock and roll music. His way into this was to take tunes, phrases and riffs that would normally be played on one of the national instruments of Zimbabwe, the mbira, andtranscribe them to the electric guitar.\n\nMapfumo first hit record came at the end of the 1970s, when the conflict between the Zimbabwean People and their government was at an all time high. The record, titledHokoyo!(Watch Out!in English) was a tense, politically charged effort that caught the attention of the government. Mapfumo was imprisoned without charge and the outrage that followed was one of the reasons that then-Rhodesian Prime Minister Ian Smith conceded to majority rule in 1978.\n\nWhile Mapfumo was the biggest name of the era, earning the nickname The Lion of Zimbabwe with his incediary protest music, he wasnt alone. The Great Sounds, OK Success, MD Rhythm Success, the Harare Mambos, the Hallelujah Chicken Run Band and the Acid Band were all taking Mapfumos mix of traditional sounds and modern instrumentation and making some of the most vital and joyous music of the era.\n\nThis coincided with a time in mainstream pop culture when the the patronisingly named concept of world music was beginning to take shape.African musicwas making headway in the mainstream in a way it had never done before, and there were several bands ready to take Chimurenga music, along with its more upbeat and poppier descendant jit music, right into charts from all over the world. One band above all others seemed set to do just that.\n\nBhundu Boys was the name given to the young boys that aided nationalist guerilla fighters in the conflict against the government in the 1970s. One of them, Biggie Tembo, started a band when the conflict ended and decided to name said band after that title. After becoming national heroes in Zimbabwe in the early 1980s, they were spotted by a number of high-profile UK music exectutives that sought to make them a name in the UK and beyond.\n\nTheir downfall is its own story, but The Bhundu Boys were living proof of one thing above all. That African music can capture an international audiencejust as well as anyone else. The likes of Tinariwen, Burna Boy and Wizkid are the descendants of Mapfumo and the Bhundu Boys, and Im sure those leading lights of the genre wouldnt have it any other way.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/15013622/How-Zimbabwe-became-the-home-of-African-guitar-music-Far-Out-Magazine.webp",
            "description": "<p>By Will Howard, Far Out Chimuerenga means ‘uprising’, not in a metaphorical sense either. It’s a Shona word that loosely translates into “revolutionary struggle”. It has been adapted into the word commonly used whenever people protest and start pushing back against the political structures keeping them oppressed. In the culture of Zimbabwe, this is a word that,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwe-became-the-home-of-african-guitar-music/\">How Zimbabwe became the home of African guitar music</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "15 Jul 2025"
        },
        {
            "title": "Man slapped with two life sentences for in-laws’ brutal murder",
            "url": "https://www.newzimbabwe.com/man-slapped-with-two-life-sentences-for-in-laws-brutal-murder/",
            "content": "By Staff Reporter\n\nTHE High Court has slapped a Plumtree man, who gruesomely killed his in-laws in 2022, with two life imprisonment sentences.\n\nTafirei Ndlovu, whose age was not given, was found guilty on two counts of murder by the High Court sitting in Bulawayo.\n\nThe court held that the cold-blooded killings were committed in Plumtree under aggravated circumstances, noting that they were premeditated and involved gratuitous violence.\n\nCourt heard that on April 14, 2022, Ndlovu, acting in connivance with his accomplice Kudzanai Mathukuthu, who is still at large, murdered his father-in-law, Xolani Mpofu and mother-in-law, Sibalungele Ncube.\n\nThe victims were savagely assaulted with axes before being dragged into a kitchen hut, which was then set alight. The harrowing incident unfolded around 2am and witnessed by Nomusa Nyoni, who is Ndlovus wife and the daughter of the deceased.\n\nIt was heard that the attack stemmed from an estrangement between Ndlovu and his wife, who had left their matrimonial home in Botswana in April 2022 after 13 years of marriage as a result of marital problems. Her return to her parents home angered Ndlovu.\n\nCourt heard that the previous day before the incident, Ndlovu contacted his mother-in-law, claiming he wanted to reconcile with his wife and the rest of the family.\n\nHowever, he arrived in the dead of the night and committed the heinous murders before kidnapping his wife, forcing her to cross back illegally into Botswana. Fortunately, she managed to alert border police on patrol and informed them of her kidnapping and her parents murder.\n\nThe pair fled the scene but Ndlovu was apprehended before making good his escape, while his co-accused disappeared and is still at large.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter THE High Court has slapped a Plumtree man, who gruesomely killed his in-laws in 2022, with two life imprisonment sentences. Tafirei Ndlovu, whose age was not given, was found guilty on two counts of murder by the High Court sitting in Bulawayo. The court held that the cold-blooded killings were committed in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-slapped-with-two-life-sentences-for-in-laws-brutal-murder/\">Man slapped with two life sentences for in-laws’ brutal murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "15 Jul 2025"
        },
        {
            "title": "10 Zimbabweans making waves in Australia",
            "url": "https://www.newzimbabwe.com/10-zimbabweans-making-waves-in-australia/",
            "content": "By Darlington Gatsi\n\nZimbabwes global diaspora continues to be a powerful force shaping narratives, industries, and communities far beyond its borders. Among the most vibrant hubs is Australia  a land of opportunity where many Zimbabweans have not only settled but thrived. From the bustling cities of Sydney and Melbourne to the academic halls of Brisbane and the cultural melting pot of Perth, Zimbabweans have made their mark with tenacity, innovation, and a deep sense of purpose.\n\nNewZimbabwe.comshines a spotlight on 10 influential Zimbabweans based in Australia who are excelling in their respective fields and contributing meaningfully to both their host country and their motherland. These individuals embody the spirit of resilience and excellence. They are entrepreneurs, health professionals, community leaders, creatives, academics, and changemakers whose stories are rooted in hard work, cultural pride, and a desire to make a lasting impact.\n\nMore than a celebration of individual success, this article serves as a reminder of the potential of diaspora communities to uplift nations, drive change, and build bridges across cultures. It also affirms that Zimbabwes greatest export remains its people  whose talents and contributions extend well beyond geographical borders.\n\nTkayMaidza\n\nTkayMaidza\n\nTkay Maidzais a Zimbabwean-Australian musician who set aside her love for tennis in favour of studio time. Since then, she has made a name for herself in the music scene. Maidza has released two albums, Tkay (2016) and Sweet Justice (2023). Last year, she was named in the Forbes 30 Under 30 Australia list.\n\nMelody mbuya vaRaphy Magengezha\n\nMelody mbuya vaRaphy Magengezha\n\nMagengezha is a mental wellness advocate who leverages her academic background as a DBT (Dialectical Behaviour Therapy) therapist and holds certifications in Trauma Therapy and Solution-Based Therapy from Australia. Magengezha uses online platforms to champion mental health awareness in Australia.\n\nKnown as Mbuya vaRaphy, she has over 20 years of experience in therapy, coaching, and community-based mental wellness support. She is the CEO of Rising Serenity Coaching and Therapy Services, an organisation that focuses on mental and emotional resilience among children, youth, young adults, and families.\n\nMagengezha has written extensively on mental health, as evidenced by her two books: Forgiveness is Key to Freedom and Stagnant or Soaring: Impact of Your Inner Circle.\n\nRecently, Magengezha was honoured with the Influencer of the Year Award (Fluxx Awards, Education Hong Kong) and Mental Health Care Expert of the Year Award (Fluxx Awards, Health and Wellness Hong Kong). These follow the honours she received in 2023: Community Leader Award (Australian Ladies in Business Initiative) and Zimbabwe Achievers Award  Community Champion of the Year.\n\nTatendaTatsNyaruwe\n\nTatendaTatsNyaruwe\n\nTatsis an Australia-based Zimbabwean content creator, also known as ManLikeTats on social media. Having left Zimbabwe at a young age for Australia, Tatshas been using digital media to shine a spotlight on his roots. He advocates for Zimbabweans abroad to stay connected with their culture. He recently won Content Creator of the Year at the Amari Gala.\n\nRutendo Mupedzi\n\nRue Mupedzi\n\nMupedzi rose to prominence after appearing in the 15th season of MasterChef Australia. An oral health therapist based in Western Australia with a passion for culinary arts, she made history as the first Zimbabwean to reach the MasterChef Australia top 10. She has also launched her sauce brand, BarbeRue, sold in Australian outlets.\n\nAudius Mtawarira\n\nAudius Mtawarira\n\nThe Zimbabwean music legend has not been off the radar, contrary to some notions. Mtawarira recently released his song Trigger, which has reminded many of the good old urban grooves era. Mtawarira has been releasing music despite last releasing an album  Seeds of Change  two years ago. Last year, he was honoured with a Lifetime Achievement Award at the Zimbabwe Achievers Awards Australia.\n\nJoyce Takaidza\n\nJoyce Takaidza\n\nThe Zimbabwe Netball team player has been a mainstay in the Gems squad. Takaidza played a crucial role in the past World Cups that Zimbabwe has featured in, including Liverpool (2019) and Cape Town (2023). In 2017, she won three awards at the Zimbabwe Achievers Awards Australia (ZAA)  Sport Personality of the Year, Peoples Choice, and Chairmans Award.\n\nLucky Ngoshi\n\nLucky Ngoshi\n\nNgoshi is an entrepreneur who began an online grocery service and has since diversified into cakes, pharmaceuticals, solar installations, carpentry, and building supplies, creating a One-Stop Shop for Zimbabweans in the diaspora. She also runs an online podcast, Keeping in Touch with Lucky.\n\nNgoshi has also established a Non-Profit Organisation (NGO), Ladies of Zimbabwe in Australia (LOZA), where close to 6,000 Zimbabwean women (living in Australia) are empowered through community engagement and professional development. Last year, she was honoured at the Zimbabwe Achievers Awards (ZAA) with a Peoples Choice Award.\n\nAnesu Mushangwe\n\nAnesu Mushangwe\n\nThe Zimbabwe Womens Cricket player has been making waves in local teams in Australia. The Adelaide Strikers Women player has become an integral part of the team. Last season, she took 33 wickets in 21 games and scored 99 runs in the same number of matches.\n\nRavai Makwara\n\nRavai Makwara\n\nMakwara, through her bold venture Madhuve Catering, has been serving Zimbabwean cuisine in Melbourne. This has made several Zimbabweans fall in love with her restaurant, which offers many nostalgic dishes. Ravai is a strong advocate for cultural awareness and inclusivity, using food as a bridge to connect communities.\n\nTendayi Ganga\n\nTendayi Ganga\n\nGanga has established herself as a champion of womens rights and social justice through her community work in Australia. With a background in medicine as a registered nurse and pastoral work, she periodically uses her YouTube channel to advocate for womens rights. In 2019, she was honoured with a double recognition at the Zimbabwean Achievers Awards (ZAA) Australia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/14165120/rutendo-mupedzi.webp",
            "description": "<p>By Darlington Gatsi Zimbabwe’s global diaspora continues to be a powerful force shaping narratives, industries, and communities far beyond its borders. Among the most vibrant hubs is Australia – a land of opportunity where many Zimbabweans have not only settled but thrived. From the bustling cities of Sydney and Melbourne to the academic halls of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/10-zimbabweans-making-waves-in-australia/\">10 Zimbabweans making waves in Australia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:50",
            "date": "15 Jul 2025"
        }
    ]
}