{
    "news": [
        {
            "title": "Bulawayo drug dealer busted with 1,9kg of crystal meth",
            "url": "https://www.newzimbabwe.com/bulawayo-drug-dealer-busted-with-19kg-of-crystal-meth/",
            "content": "By Staff Reporter\n\nA 39-year-old Bulawayo based drug peddler Tigors Tyron Seigfried has been arrested after he was found in possession of 1,900 grammes of crystal meth.\n\nSeigfired was busted at his home in Matshamhlophe, Bulawayo.\n\nThe ZRP confirms the arrest of Tigors Tyron Seigfried (39) in connection with unlawful possession of 1 900 grammes of Crystal Meth.  The drugs were found in the suspects house along Chemford, Matshehlope, Bulawayo.#notodrugandsubstanceabuse.pic.twitter.com/nLJeiplvsO\n\n Zimbabwe Republic Police (@PoliceZimbabwe)March 6, 2025\n\nZimbabwe is grappling with an alarming rise in drug and substance abuse cases, particularly among the youth.\n\nPresident Emmerson Mnangagwa last year launched a multi-sectoral drug and substance abuse plan to fight the scourgeand police has intensified crackdowns.\n\nAs at the end of February, over 10,000 drug peddlers and end users had been arrested, with close to a hundred bases destroyed.\n\nMeanwhile, eight people have been arrested in Harare and Beitbridge after they were found in possession of dagga, crystal meth and broncleer syrup.\n\nThe arrested suspects are, Mphakamiseni Dhlamini (41), Ishmael Chikara (35), Linda Jimu (26), Priviledge Muchenje alias Ndanatsei Muchenje (39), Sylia Tanyanyiwa (41), Simbarashe Maenzanise (41), Siphelile Mashamba (33) and Alice Shatirwa (29).\n\nThe arrests led to the recovery of 151 kilogrammes of dagga, 260 X 100 Broncleer Syrup and a yet to be established quantity of Crystal Meth. The bulk of the dagga has been recovered at Beitbridge Border Post, said police spokesperson Commissioner Paul Nyathiin a statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06141241/WhatsApp-Image-2025-03-06-at-15.59.56-e1741270407370.jpeg",
            "description": "<p>By Staff Reporter A 39-year-old Bulawayo based drug peddler Tigors Tyron Seigfried has been arrested after he was found in possession of 1,900 grammes of crystal meth. Seigfired was busted at his home in Matsh’amhlophe, Bulawayo. The ZRP confirms the arrest of Tigors Tyron Seigfried (39) in connection with unlawful possession of 1 900 grammes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bulawayo-drug-dealer-busted-with-19kg-of-crystal-meth/\">Bulawayo drug dealer busted with 1,9kg of crystal meth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Bombshell! ZANU PF expels “treasonous” Geza over anti-2030 crusade",
            "url": "https://www.newzimbabwe.com/bombshell-zanu-pf-expels-treasonous-geza-over-anti-2030-crusade/",
            "content": "By Darlington Gatsi\n\nOUTSPOKEN war veteran Blessed Bombshell Geza has been expelled from ZANU PF with immediate effect, paying the price for opposing the extension of President Emmerson Mnangagwas rule.\n\nGeza, a ZANU PF Central Committee member, was ejected from the party following recommendations by the partys disciplinary committee to the politburo. He stands accused of indiscipline and fostering factionalism.\n\nThis comes after he publicly opposed the extension of Mnangagwas tenure beyond the constitutionally mandated two-term limit, which is due to end in 2028.\n\nAnnouncing Gezas expulsion, ZANU PFs Secretary for Legal Affairs, Patrick Chinamasa, said that Geza had acted in a manner tantamount to treason.\n\nBlessed Geza\n\nI think all of you are aware of utterances by Cde Geza which sought to undermine the party leadership, ZANU PF and over and above that which was an attack on the state machinery, basically a treason against the state.\n\nWhat is clear, of course, is that Cde Geza was disloyal to the party in terms of Article 19(1) of the partys constitution. Blessed Geza violated all of those provisions. Any member of the party should not make or behave in a manner which brings the name of the party into disrepute.\n\nTaking all the allegations against Blessed Geza which are all in the public purview the politburo on the recommendation of the national disciplinary committee upheld that Blessed Geza should be expelled from ZANU PF with immediate effect, said Chinamasa.\n\nGeza leads a faction of disgruntled ex-combatants frustrated by the entrenchment of corruption in the country.\n\nHis expulsion comes as Mnangagwa, on Tuesday, issued a stern warning against indiscipline among ZANU PF members.\n\nGeza is among several members, including Member of Parliament (MP) Benjamin Ganyiwa and Godwin Gomwe, who have been shown the door from ZANU PF headquarters over allegations of indiscipline.\n\nChinamasa stated that the expulsion signals the partys firm stance against members who act against ZANU PFs interests.\n\nMuch of the deliberations dwelt on discipline, unity to protect the party from divisions. The decisions reflect the politburos desire to stamp its authority on issues of discipline.\n\nFrom today onwards, we will be known as a no-nonsense party to any mischief or any misdemeanors, any factionalism, any misbehaviour that will be taking place in the party. We must preserve our unity as a party, and it is very important that we must chuck out or discipline those who we feel are threatening the unity of ZANU PF, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12051453/patrick-chinamasa-e1599884108669.jpg",
            "description": "<p>By Darlington Gatsi OUTSPOKEN war veteran Blessed “Bombshell” Geza has been expelled from ZANU PF with immediate effect, paying the price for opposing the extension of President Emmerson Mnangagwa’s rule. Geza, a ZANU PF Central Committee member, was ejected from the party following recommendations by the party’s disciplinary committee to the politburo. He stands accused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bombshell-zanu-pf-expels-treasonous-geza-over-anti-2030-crusade/\">Bombshell! ZANU PF expels “treasonous” Geza over anti-2030 crusade </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "“Never entertain such applications in future” – ZimParks tells govt, opposes mining proposal in Hwange National Park",
            "url": "https://www.newzimbabwe.com/never-entertain-such-applications-in-future-zimparks-tells-govt-opposes-mining-proposal-in-hwange-national-park/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has strongly opposed a proposed coal mining project by a Chinese company, Sunny Ye Feng in Sinamatella, a section of Hwange National Park.\n\nSunny Ye Feng submitted an application for an Exclusive Prospecting Order No. 04 of 2021 in the Matabeleland North mining district.\n\nSunny Ye Feng has a past of environmental infractions, with a recent closure order from the Environmental Management Agency (EMA) due to pollution.\n\nThe proposed site is a critical habitat for black rhinos and currently supports a growing population of this endangered species.\n\nIn a statement, Thursday, ZimParks raised alarm over the negative impacts of mining within a national park, which include biodiversity and wildlife habitat destruction as well as species extinction.\n\nZimParks urges the Ministry of Mines and Mining Development to cancel the application for an exclusive prospection of mining activities in Hwange National Park, specifically targeting the Sinamatella Black Rhino Intensive Protection Zone and never to entertain such applications in future.\n\nNeedless to mention that the proposed mining project will actually increase the risk of species extinction and prospects of population recovery will be negatively affected.\n\nThe proposed mining project poses a significant threat, worsening the degradation of land, a critical concern for ZimParks, which has a mandate to ensure that at least 30% of degraded terrestrial, inland water, and ecosystems are restored by 2030.\n\nWhile we have made substantial progress in reviving wildlife populations across the nation, the introduction of mining activities in this vital area would undermine ecological conditions essential for wildlife survival and reproduction.\n\nThis compromise will hinder our ongoing efforts to maintain and restore healthy populations of wildlife, ZimParks said.\n\nZimParks also expressed worries over air, noise, and land pollution, which will harm both visitors and nature while promoting human wildlife conflict.\n\nThe authority added that allowing mining in a national park will harm Zimbabwes global reputation in sustainable conservation.\n\nApproving mining in this zone would not only contradict ZimParks conservation mandate but also tarnish Zimbabwes reputation regionally and internationally as a world leader in sustainable conservation.\n\nFurthermore, mining activities are known to create air, noise, and land pollution, which detrimentally impact visitor experiences and disrupt wildlife movement, not mentioning the increased cases of poaching.\n\nHwange National Park is home to Africas second-largest elephant population, and mining may interfere with the flow of groundwater, threatening vital water sources relied upon by our wildlife.\n\nThis disruption can worsen existing water shortages, leading to increased mortality rates in species and heightened human- wildlife conflict in surrounding communities, ZimParks added.\n\nSinamatela is home to the Bumbusi ruins, which hold historical and cultural significance for the Nambian-speaking communities dating back to the 18th century, and traditional leaders from the region visit the area annually to conduct cultural rituals and rain-making ceremonies.\n\nMeanwhile, Hwange residents and other environmental rights organisations and activists have also raised similar concerns.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26171635/Hwange-National-Park_11.jpg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Parks and Wildlife Management Authority (ZimParks) has strongly opposed a proposed coal mining project by a Chinese company, Sunny Ye Feng in Sinamatella, a section of Hwange National Park. Sunny Ye Feng submitted an application for an Exclusive Prospecting Order No. 04 of 2021 in the Matabeleland North mining district.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/never-entertain-such-applications-in-future-zimparks-tells-govt-opposes-mining-proposal-in-hwange-national-park/\">“Never entertain such applications in future” – ZimParks tells govt, opposes mining proposal in Hwange National Park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Injuries as Mozambique police fire on opposition protest",
            "url": "https://www.newzimbabwe.com/injuries-as-mozambique-police-fire-on-opposition-protest/",
            "content": "BBC\n\nAt least a dozen people were injured after Mozambican police violently dispersed a protest led by opposition leader Venncio Mondlane, the runner-up in last years disputed presidential election, Mondlanes team and a civil society group say.\n\nEyewitnesses and Mondlanes aides said the police fired live rounds at the opposition leaders convoy and the anti-government protesters who had joined him on the streets of the capital, Maputo, on Wednesday.\n\nNeither the police nor the authorities have commented.\n\nThe protests came as President Daniel Chapo, who took office in January, was due to sign a deal after talks with other political parties to end months of protests over the disputed election.\n\nMondlane, who has been calling for the protests, was excluded from the talks leading to the ceremony.\n\nA communique from Mondlanes office said the opposition leader had been leading a procession on Wednesday afternoon when his convoy came under fire.\n\nA contingent of the UIR [a rapid intervention police unit] rammed into Venncio Mondlanes convoy and began a barrage of gunfire, using live ammunition and tear gas, it added.\n\nIn response to the incident, Interior Minister Paulo Chachine told reporters that the police had a mission to prevent any attempt to disrupt the deal-signing ceremony.\n\nHe denied that there had been an attempt to kill Mondlane.\n\nSixteen people were injured, according to local civil society group Plataforma Decide. The BBC has not been able to confirm the casualty figures.\n\nMondlanes team said two children from a nearby school had died from the shooting. It said 16 people had been injured, including their camera person, with others seriously affected by tear gas.\n\nIn a statement, it said Mondlanes condition was unknown, and his whereabouts are causing concern among his entire team.\n\nA video shared on social media shows the moment when gunshots started ringing out as the procession approached what looks like an armoured vehicle on the streets. People run for safety and the crowds disappear, while the gunfire continues.\n\nMore images of people bloodied from the incident have also been shared online.\n\nA witness, who was among the protesters, told the AFP news agency that police had started shooting, as if it was an ambush scenario. It was just a march.\n\nI saw some people bleeding from their wounds. My friend was wounded in the leg. I also saw a child who was shot and lost his life in hospital, AFP quoted 27-year old protester Silvestre Alexandre as saying.\n\nMozambiques former colonial power, Portugal, has condemned the unacceptable attack on Venncio Mondlanes convoy while calling for restraint from violence and respect for fundamental rights.\n\nIn a post on X, the Portuguese foreign affairs ministry has also offered condolences to the bereavedfamilies.\n\nSince President Chapo took over in January, he has made promises for a broad political dialogue that would include various sectors of the society, in order to end the countrys post-election crisis.\n\nSome analysts have however criticised him for excluding Mondlane from the talks.\n\nOn Wednesday, Mondlane condemned the political deal, calling it an agreement of people without the people. He said that protests would continue.\n\nIf they dont do what the people want, they wont govern Mozambique, he said.\n\nSince October, close to 400 people have died in violence linked to the protests, according to civil society organisations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06134453/moza-protests.webp",
            "description": "<p>BBC At least a dozen people were injured after Mozambican police violently dispersed a protest led by opposition leader Venâncio Mondlane, the runner-up in last year’s disputed presidential election, Mondlane’s team and a civil society group say. Eyewitnesses and Mondlane’s aides said the police fired live rounds at the opposition leader’s convoy and the anti-government</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/injuries-as-mozambique-police-fire-on-opposition-protest/\">Injuries as Mozambique police fire on opposition protest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Gwanda man jailed 15 years for sodomy",
            "url": "https://www.newzimbabwe.com/gwanda-man-jailed-15-years-for-sodomy/",
            "content": "By Staff Reporter\n\nA 24-year-old Gwanda man who sexually violated another man after offering to assist him with prayers will endure the next 15 years in jail after he was found guilty of aggravated indecent assault.\n\nThe perpetrator was jailed by a Gwanda magistrate after a full trial.\n\nThe National Prosecuting Authority (NPA) proved that on January 24 this year, in Guyu, the offender engaged in non-consensual anal intercourse with the complainant, a 25-year-old male, while he was asleep.\n\nThe events leading up to the assault began in December 2024, when the offender approached the complainant, claiming someone was trying to bewitch him and offered to assist him with prayers to help resolve the issue.\n\nOn January 23, 2025, the offender visited the complainants residence late at night, rubbed oil on his stomach and back, and both fell asleep.\n\nThe complainant woke up to find the offender sexually assaulting.\n\nAfter confronting the offender, who warned him not to tell anyone, the complainant informed his parents, who advised him to report the incident to the police, the court heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/15194818/GWANDA-HIGH-COURT-680x380-1-e1676490526759.jpeg",
            "description": "<p>By Staff Reporter A 24-year-old Gwanda man who sexually violated another man after offering to assist him with prayers will endure the next 15 years in jail after he was found guilty of aggravated indecent assault. The perpetrator was jailed by a Gwanda magistrate after a full trial. The National Prosecuting Authority (NPA) proved that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gwanda-man-jailed-15-years-for-sodomy/\">Gwanda man jailed 15 years for sodomy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "First Lady Auxilia Mnangagwa extends a lifeline to Mufakose family after appeal on Destiny TV’s “Twice a Mother”",
            "url": "https://www.newzimbabwe.com/first-lady-auxilia-mnangagwa-extends-a-lifeline-to-mufakose-family-after-appeal-on-destiny-tvs-twice-a-mother/",
            "content": "By Staff Reporter\n\nFOLLOWING the airing of a Harare familys plight, whose child is living with cerebral palsy, on Destiny TVs programme Twice a Mother on national television (ZBC), First Lady Auxilia Mnangagwa responded by extending a helping hand.\n\nMnangagwa donated a wheelchair, blankets, and groceries to the family, alleviating the burden they were facing.\n\nThe childs father, Bernard Mafuka, could not hide his joy after the donation at his Mufakose residence.\n\nI am grateful for what the First Lady, our mother, has done for us. She heard our plight with a child who cannot walk and the lack of a wheelchair. His mother had no one to look after the child while performing other duties and always strapped him on her back.\n\nHowever, thanks to the First Ladys benevolence, my wife can now work achiita mabasa ake emaoko. I am truly grateful to Amai. Her love is deeper than the ocean.\n\nShe goes everywhere around the country helping those with disabilities, the elderly, the sick, widows, widowers, and among many other vulnerable groups. Her love is unmatched. We are forever grateful as a family, Mafuka said in an interview with State media.\n\nThe Mafuka family had shared with Destiny TV how they were struggling due to the lack of essential goods and a wheelchair for their childs mobility. They recounted a harrowing incident where their child was nearly bitten by a snake while they were farming.\n\nTwice a Mother is a compelling television series that delves into the lives of mothers and families with children living with disabilities. Through powerful storytelling, the programme highlights the unique challenges, joys, and resilience of these families.\n\nEach episode features in-depth interviews and real-life experiences, aiming to raise awareness, foster understanding, and inspire action within the community.\n\nTwice a Mother produced by Destiny TV, airs on ZTV on Saturdays from 17:00 to 17:30 and on the Destiny TV YouTube channel.\n\nMafukas wife, Euphrasia Mafuka, said the donation was a timely intervention.\n\nI want to thank the mother of the nation for what she has done for me and my family. Our child has cerebral palsy and he cannot walk or see properly.\n\nHe cant sit alone and even eat on his own. I went to the ZBC seeking help and our mother saw us and pasina nguva, Amai came to our rescue.Minamato yedu yakadairwa. She gave us a wheelchair and now I can work.\n\nI also thank Amai for the provisions that she gave us. I also want to thank her for remembering all those in need. The child wets himself and we did not have enough blankets. Its even worse this rainy season when the blankets take a long time to dry. The blankets from the First Lady will assist us in a big way, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06124346/Screenshot-2025-03-06-at-14.42.39.png",
            "description": "<p>By Staff Reporter FOLLOWING the airing of a Harare family’s plight, whose child is living with cerebral palsy, on Destiny TV’s programme “Twice a Mother” on national television (ZBC), First Lady Auxilia Mnangagwa responded by extending a helping hand. Mnangagwa donated a wheelchair, blankets, and groceries to the family, alleviating the burden they were facing.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/first-lady-auxilia-mnangagwa-extends-a-lifeline-to-mufakose-family-after-appeal-on-destiny-tvs-twice-a-mother/\">First Lady Auxilia Mnangagwa extends a lifeline to Mufakose family after appeal on Destiny TV’s “Twice a Mother” </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Two inmates escape from Mutimurefu prison",
            "url": "https://www.newzimbabwe.com/two-inmates-escape-from-mutimurefu-prison/",
            "content": "By Tapiwa Svondo\n\nTwo inmates are on the run after escaping from Mutimurefu Prison on Wednesday.\n\nThe Zimbabwe Prisons and Correctional Service (ZPCS) has launched a manhunt and released a picture of one of the escapees, Feliciano Simango, also known as Fidelis Jorum Mauyangwe.\n\nIn a public notice, the ZPCS National Spokesperson Assistant Commissioner Meya Khanyezi is appealing to the public for any information that could assist in locating Simango.\n\nThe Zimbabwe Prisons and Correctional Service (ZPCS) is releasing the image of Feliciano Simango AKA Fidelis Jorum Mauyangwe, one of the two inmates who escaped from Mutimurefu Prison on March 5, 2025.\n\nWe urge members of the public to be on high alert and immediately report any information that may lead to his recapture. Do not approach the escapeereport sightings to the nearest police station or correctional facility.\n\nAss Comm Meya Khanyezi 0773418132 or 0714239142, reads ZPCS statement.\n\nUPDATE: ESCAPE INCIDENT AT MUTIMUREFU PRISON\n\nThe Zimbabwe Prisons and Correctional Service (ZPCS) is releasing the image of Feliciano Simango AKA Fidelis Jorum Mauyangwe, one of the two inmates who escaped from Mutimurefu Prison on March 5, 2025.pic.twitter.com/sRaNUm0ROJ\n\n Zimbabwe Prisons and Correctional Service (@ZPCS_PR)March 6, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06105807/WhatsApp-Image-2025-03-06-at-11.53.18.jpeg",
            "description": "<p>By Tapiwa Svondo Two inmates are on the run after escaping from Mutimurefu Prison on Wednesday. The Zimbabwe Prisons and Correctional Service (ZPCS) has launched a manhunt and released a picture of one of the escapees, Feliciano Simango, also known as Fidelis Jorum Mauyangwe. In a public notice, the ZPCS National Spokesperson Assistant Commissioner Meya</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-inmates-escape-from-mutimurefu-prison/\">Two inmates escape from Mutimurefu prison</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Actor Leroy Gopal to fill DJ Ankletap’s shoes as he joins YOU FM",
            "url": "https://www.newzimbabwe.com/actor-leroy-gopal-to-fill-dj-ankletaps-shoes-as-he-joins-you-fm/",
            "content": "TshisaLive\n\nZimbabwean born actor Leroy Gopal is to replace DJ Ankletap at South African radio station You FM.\n\nLeroy is widely known for his characters onJerusalema, Yellow CardandSesTop La, among others.\n\nBryce DJ Ankletap Clarke and Themba Biznezz will leave the station, effective March 1, You FM said.\n\nWe extend our gratitude to DJ Ankletap and Themba Biznezz for their invaluable contributions to our programming in 2024 and wish them well in their future endeavours.\n\nWe are excited to introduce Leroy Gopal as the new host of our flagship breakfast show.\n\nLeroy brings a fresh perspective, energy and a wealth of experience as an actor, presenter and voice artist.\n\nWe are confident our listeners will enjoy the new direction and engaging content Leroy and his team will bring to the show. We thank our loyal listeners for their continued support and look forward to bringing them more exciting and innovative content in the future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06104131/leroy-gopal.png",
            "description": "<p>TshisaLive Zimbabwean born actor Leroy Gopal is to replace DJ Ankletap at South African radio station You FM. Leroy is widely known for his characters on Jerusalema, Yellow Card and Ses’Top La, among others. “Bryce “DJ Ankletap” Clarke and Themba “Biznezz” will leave the station, effective March 1,” You FM said. “We extend our gratitude to DJ Ankletap</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/actor-leroy-gopal-to-fill-dj-ankletaps-shoes-as-he-joins-you-fm/\">Actor Leroy Gopal to fill DJ Ankletap’s shoes as he joins YOU FM</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Parkinson’s cases could top 25 million worldwide by 2050, study suggests",
            "url": "https://www.newzimbabwe.com/parkinsons-cases-could-top-25-million-worldwide-by-2050-study-suggests/",
            "content": "TheIndependent\n\nThe number of people living with Parkinsons disease worldwide could more than double by 2050, a study suggests.\n\nThe predicted rise is largely down to an ageing population, researchers said.\n\nA modelling study led by academics in Beijing used data from the Global Burden of Disease Study 2021 to estimate the prevalence of Parkinsons disease from 2022 to 2050 in 195 countries.\n\nThe findings, published in the BMJ, suggest the number of people living with the condition in 2050 will be 25.2 million, a 112% increase compared to 2021.\n\nBy 2050 Parkinsons disease will have become a greater public health challenge for patients, their families, care givers, communities, and society, researchers said.\n\nThe team suggests the upward trend is more pronounced in men, in East Asia and in countries with middle socio-demographic index, which is a scale that measures a countrys level of development based on the likes of average income, education and fertility rate.\n\nAccording to their estimations, cases in the UK could climb from 230,000 by 2030, to 272,000 by 2040 and 307,000 by 2050.\n\nResearchers said population ageing was estimated to be the leading contributor to rising cases, adding that their projections can be used to plan control measures and call for urgent actions in meeting the increasing healthcare demands of patients with the illness.\n\nParkinsons is a progressive condition that affects the brain.\n\nSymptoms include involuntary shaking known as tremors, slow movements and stiff muscles, as well as psychological problems like depression, loss of balance, trouble sleeping and memory issues.\n\nAcademics suggest public health interventions could be promising in slowing the universal rise in cases.\n\nThey added: Given the inevitable population ageing, population growth, and disability experienced by individuals with Parkinsons disease owing to its chronic nature, an urgent need exists for future research to focus on the development of novel drugs, gene engineering techniques, and cell replacement therapies that are aimed at modifying the course of the disease and improving patients quality of life.\n\nDavid Dexter,director of research at Parkinsons UK, said: This very welcome study reminds us that Parkinsons is growing quickly across the world.\n\nYet, in the UK today, our investment in research is failing to respond to this anticipated growth and people with Parkinsons are not getting the healthcare and services they need to live well.\n\nUntil we find a cure, its vital that people with Parkinsons, regardless of their location, socioeconomic group or race, have access to research opportunities, good quality care and support that enables them to live well with the condition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06053147/Parkinsons-.webp",
            "description": "<p>TheIndependent The number of people living with Parkinson’s disease worldwide could more than double by 2050, a study suggests. The predicted rise is largely down to an ageing population, researchers said. A modelling study led by academics in Beijing used data from the Global Burden of Disease Study 2021 to estimate the prevalence of Parkinson’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parkinsons-cases-could-top-25-million-worldwide-by-2050-study-suggests/\">Parkinson’s cases could top 25 million worldwide by 2050, study suggests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        },
        {
            "title": "Lesotho shocked by Trump’s remarks that ‘nobody has heard of the country’",
            "url": "https://www.newzimbabwe.com/lesotho-shocked-by-trumps-remarks-that-nobody-has-heard-of-the-country/",
            "content": "BBC\n\nLesothos government says it is shocked by US President Donald Trump saying that nobody has ever heard of the southern African nation.\n\nTrump, addressing the US Congress in his first speech since his return to the Oval Office, made the reference as he listed cuts made to what he said was wasteful expenditure.\n\nEight million dollars to promote LGBTQI+ in the African nation of Lesotho, which nobody has ever heard of, Trump said, eliciting laughter from some US lawmakers.\n\nA spokesperson for Lesothos foreign affairs department told the BBC that Lesotho enjoyed warm and cordial relations with the US.\n\nLesotho is one of the biggest beneficiaries of the USs African Growth and Opportunity Act (Agoa), which gives favourable trade access to some countries to promote their economic growth.\n\nAccording to the US government, the two countries traded goods worth $240m (187m) in 2024, mostly exports from Lesotho to the US, in particular textiles and clothing.\n\nLesothos Foreign Affairs Minister Lejone Mpotjoane said it was shocking to hear a head of state refer to another sovereign state in that manner.\n\nTo my surprise, the country that nobody has heard of is the country where the US has a permanent mission, Mpotjoane told the BBC.\n\nLesotho is a member of the UN and of a number of other international bodies. And the US has an embassy here and [there are] a number of US organisations weve accommodated here in Maseru.\n\nHe later told the AFP news agency: We are not taking this matter lightly, adding that they would send an official protest letter to Washington.\n\nOfficials dismissed Trumps remarks as off the cuff and a political statement, adding that they were uncalled-for given the good relations between the two nations.\n\nWe maintain very warm and cordial relations with the US. Theyve got a mission in Maseru and we also have [one] in Washington, foreign affairs spokesperson Kutloano Pheko told the BBC.\n\nMr Pheko was unable to confirm Trumps comments on the funding that went to LGBTQ organisations, saying that as the money went directly to them, they would be best placed to comment.\n\nMpotjoane, on his part, confirmed that the country had been affected by Trumps sudden decision to pause aid funding to countries around the world.\n\nMany organisations, mostly non-governmental, were thrown into chaos after the Trump administration announced a permanent end to the US Presidents Emergency Plan for Aids Relief (Pepfar) funding as part of a wider cost-cutting drive to reduce US government spending.\n\nPepfar was launched in 2003 by then US President George W Bush and its finances are distributed via the US governments main overseas aid agency USAID, whose funding has also been cut.\n\nLesotho is among those countries that benefited from Pepfar, its health ministry told South African publication GroundUp in February, with TB and HIV programmes among those receiving the critical funds.\n\nBut Mpotjoane declined to criticise this decision, saying it was the USs prerogative to cut aid if they want to.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06052513/lesotho.jpg",
            "description": "<p>BBC Lesotho’s government says it is shocked by US President Donald Trump saying that “nobody has ever heard of” the southern African nation. Trump, addressing the US Congress in his first speech since his return to the Oval Office, made the reference as he listed cuts made to what he said was wasteful expenditure. “Eight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lesotho-shocked-by-trumps-remarks-that-nobody-has-heard-of-the-country/\">Lesotho shocked by Trump’s remarks that ‘nobody has heard of the country’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Mar 2025"
        }
    ]
}