{
    "news": [
        {
            "title": "In Tune with the Mind: Self-care",
            "url": "https://www.newzimbabwe.com/in-tune-with-the-mind-self-care/",
            "content": "Self-care refers to the intentional practice of taking care of ones overall well-being. It encompasses the physical, mental, and spiritual aspects of ones life. It is not selfish, but a necessary habit that we should familiarise ourselves with. Self-care produces an all-around healthy being who satisfies the WHO definition of mental health: an individual who can lead a fulfilling and productive life.\n\nOne can take care of oneself physically through practicing proper hygiene. Bathing and maintaining cleanliness improve our confidence and boost our self-esteem. Self-image is a huge contributor to mental health; how we see ourselves determines our self-esteem. Individuals with low self-esteem are likely to succumb to depression.\n\nBody shape and size are a sensitive topic. Appreciating that we are created differently andareuniquely beautiful is key to good mental health. However,it is also important to be intentional about how we take care of our bodies. Regular exercise, visiting the gymn, healthy eating all contribute to good physical appearance. As such it is essential to have a healthy routine to maintain a good weight and body shape.\n\nSleep is one of the most important aspects of self-care. A good sleep routine is a healthy habit which helps us to be rejuvenated and relaxed. As we sleep, the body produces hormones such as melatonin, GABA, serotonin, cortisol and adenosine. These hormones are responsible for mood regulation and offer many other mental health benefits, including stress regulation. As such, good sleep and hygiene will improve our mental wellbeing.\n\nOur minds also need to be taken care of through engaging in mentally stimulating activities such as puzzles, crosswords and reading. This helps us to strengthen our cognitive function and reduce or delay neuro- degenerative processes which may lead to conditions such as dementia. It is a good practice to learn a new skill and thus also improves the mind culture and function.\n\nEmotional self-care is often neglected as we focus more on physical appearances. It is important for us to have a self-care routine which covers the emotional aspects. Intentional social interactions like picnics, taking a walk, a fun evening with friends and family are crucial in enhancing good emotional health. Journaling can be very useful as it allows us to express our feelings through writing, art, and painting also contributes to emotional wellbeing. Ultimately, seeking help when we feel unwell emotionally, talking to a friend and most importantly, a mental health professional will be very beneficial in improving our mental health.\n\nBenefits of self care include stress regulation and mood regulation. Improvement of overall mental health. Self care also boosts self-esteem and confidence helping us to be more productive. Resilience can be enhanced through self care activities and we develop better coping mechanisms for our challenges and setbacks.\n\nIf you have been practicing self care, well done, keep it up. I hope you maintain the routine and to those who had not started I hope we start our journey of self care so we can benefit and embrace good overall health.\n\nNqoba Sibenke is registered with AHPCZ as an intern Counselling Psychologist and can be reached atnqoba.sibenke@icloud.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24170735/self-care-illustration.png",
            "description": "<p>By Nqoba M Sibenke Self-care refers to the intentional practice of taking care of one’s overall well-being. It encompasses the physical, mental, and spiritual aspects of one’s life. It is not selfish, but a necessary habit that we should familiarise ourselves with. Self-care produces an all-around healthy being who satisfies the WHO definition of mental health:</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-tune-with-the-mind-self-care/\">In Tune with the Mind: Self-care</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Mudiwa Hood withdraws charges against DJ Ollah, Holy Ten",
            "url": "https://www.newzimbabwe.com/mudiwa-hood-withdraws-charges-against-dj-ollah-holy-ten/",
            "content": "By Staff Reporter\n\nMUSICIAN Mudiwa Hood has withdrawn charges against journalist Owen Madondo, popularly known as DJ Ollah 7 before plea.\n\nHe also withdrew charges against rapper Holy Ten born Mukudzei Chitsamanoting that he has seen it unnecessary to pursue the case after the two made public apologies.\n\nThe two were being accused of criminal defamation following a podcastinterview they had last week.\n\nDo hereby solemnly and sincerely swear and declare the following: I filed criminal charges against Owen Madondo and Mukudzei Chitsama under CR 359/03/25 at ZRP Kopje.\n\nThese criminal charges are emanating from a Facebook account DJ OLLA 7, in which the two were having a podcast show in which I was cyberbullied and harassed.\n\nI am withdrawing charges against both accused persons because I have taken note of the public apologies made by the Facebook account DJ Olla 7 that published the podcast and I have also taken note of the public apology made by Mukudzei Chitsama, Mudiwa said in his withdrawal affidavit.\n\nMudiwa Hood also said he does not wish to pursue the criminal charges against the two as this matter has been resolved amicably outside the confines of the courts.\n\nCharges against the two accused persons can therefore be withdrawn before plea.\n\nI freely state this voluntarily without being coerced or influenced by anyone.\n\nI make the above statement conscientiously believing the same to be true, he said.\n\nThe State also declined to prosecute Dj Ollah, stating that there was no criminal element in the charge.\n\nThe journalistwho was at court had to return home beforegetting to the dock.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24101830/ollah-e1742811526193.jpeg",
            "description": "<p>By Staff  Reporter MUSICIAN Mudiwa Hood has withdrawn charges against journalist Owen Madondo, popularly known as DJ Ollah 7 before plea. He also withdrew charges against rapper Holy Ten born Mukudzei Chitsama noting that he has seen it unnecessary to pursue the case after the two made public apologies. The two were being accused of criminal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudiwa-hood-withdraws-charges-against-dj-ollah-holy-ten/\">Mudiwa Hood withdraws charges against DJ Ollah, Holy Ten</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Sweet Guluva wins ‘Big Brother Mzansi’ S5",
            "url": "https://www.newzimbabwe.com/sweet-guluva-wins-big-brother-mzansi-s5/",
            "content": "IOL\n\nSweet Guluva, 23, has been crowned the Big Brother Mzansi season 5 winner.\n\nThe wait is finally over! After an intense season of twists, turns and dramatic surprises, the winner of Big Brother Mzansi season 5 has been announced.\n\nSweet Guluva, whose real name is Akhonamathemba Mbele, has walked away with the title as well as the R2 million grand prize.\n\nThe 23-year-old was charismatic, charm and resilient from the moment he entered the house, earning him legions of fans.\n\nWith his blend of creativity, charm and determination, Guluva captivated the audience and outdid his fellow housemates.\n\nOf course, the competition was fierce and the other top four housemates Jojo, Nate, Nsuku, and Uyanda gave it their all. Each brought their own strengths and strategies to the game, making this heated season one to remember.\n\nJojo, the underdog mastermind, shocked everyone with her strategic gameplay. She made it to the finale after controlling the game like a chess master. No one saw her coming but she proved all her doubters wrong.\n\nMeanwhile, Nate played her game silently but effectively, as a silent instigator. She stirred the pot from behind the scenes, strategically placing people where she wanted them. Some housemates saw her stunts from the beginning and the others caught on late but her game was well played, which placed her in the top five.\n\nNsuku proved to be an unbreakable force, showcasing her resilience and confidence. Her unique entry into the house, where she was chosen by fellow housemates, didnt hinder her from quickly establishing herself as a confident and outspoken individual.\n\nAnd Uyanda, the fighter, was relentless in his pursuit of the crown. Its undeniable that he fought from the very beginning, showing determination and courage. If theres one thing Uyanda did during his stay in the Big Brother house, its to show just how badly he wanted the crown.\n\nBut in the end, the viewers decided and chose Sweet Guluva as the ultimate winner.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24071214/Sweet-Guluva-23-has-been-crowned-the-Big-Brother-Mzansi-season-5-winner.webp",
            "description": "<p>IOL Sweet Guluva, 23, has been crowned the ‘Big Brother Mzansi’ season 5 winner. The wait is finally over! After an intense season of twists, turns and dramatic surprises, the winner of “Big Brother Mzansi” season 5 has been announced. Sweet Guluva, whose real name is Akhonamathemba Mbele, has walked away with the title as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sweet-guluva-wins-big-brother-mzansi-s5/\">Sweet Guluva wins ‘Big Brother Mzansi’ S5</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "New Namibian President appoints a ‘shocking’ Cabinet, analyst says",
            "url": "https://www.newzimbabwe.com/new-namibian-president-appoints-a-shocking-cabinet-analyst-says/",
            "content": "By Namibia Press Agency\n\nUNIVERSITY pf Namibia lecturer and political analyst Gurvy Kavei has described president Netumbo Nandi-Ndaitwahs newly announced Cabinet as a choice that was difficult to predict for many Namibians.\n\nKavei said this in an interview with Nampa on Sunday, when approached for his views on the newly appointed ministers and their portfolios.\n\nWhat came out was a shocker to everyone. Prior to the inauguration of the ministers, there were many media speculations as to who would feature in Nandi-Ndaitwahs administration, but what came out was a big shock to everybody, he said.\n\nHe noted that Nandi-Ndaitwah during the swearing-in ceremony on Saturday highlighted that while Namibia is rich in resources, the country faces challenges in management.\n\nKavei said he believes the newly sworn-in presidents selection of ministers aligns with this perspective, as she appointed individuals capable of effectively managing national resources for the public benefit.\n\nHe also praised the administrations gender and regional representation, calling it the most balanced since Namibia attained independence in 1990.\n\nIm also very happy with the age balance. You cannot get rid of all long-serving ministers, you need to retain some of them for continuity purposes, he said.\n\nKavei further commended Nandi-Ndaitwah for reducing public expenditure following the downsizing of 21 ministries to 14, which he said previous administrations struggled to do.\n\nThe only challenge with the merging of some ministries is that you would have certain ministries that are overly bloated, which would give the minister and their executives some heavy lifting duties. The other challenge would be letting go of some ministries at regional level in terms of logistics, operations and infrastructure, he said.\n\nKavei said it is early days and there might be initial dysfunction within the merged ministries, but he believes they will eventually adapt to the new structure.\n\nOn his part, the executive director of the Institute for Public Policy Research (IPPR), Graham Hopwood, also hailed the downsizing of ministries as a positive development, saying he hopes it will produce a more effective and efficient government.\n\nHowever, Hopwood raised concerns about some ministry mergers, stating that he is not convinced the trade ministry should be merged with the Ministry of International Relations and Cooperation.\n\nThe Ministry of Education, Arts and Culture is now basically also incorporating two previous ministries, which will be a massive task for the incoming minister. These restructurings could slow down the pace of any legal and policy reform, Hopwood said.\n\nHe further argued that the youth and sports portfolio should have remained separate, given the significant youth population in Namibia.\n\nHopwood, however, supported the incorporation of the Ministry of Fisheries and Marine Resources into the agriculture ministry, provided that corruption within the fishing sector is effectively addressed by the new administration.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24070044/WhatsApp-Image-2025-03-23-at-8.53.57-PM-768x512-1.jpeg",
            "description": "<p>By Namibia Press Agency UNIVERSITY pf Namibia lecturer and political analyst Gurvy Kavei has described president Netumbo Nandi-Ndaitwah’s newly announced Cabinet as a choice that was difficult to predict for many Namibians. Kavei said this in an interview with Nampa on Sunday, when approached for his views on the newly appointed ministers and their portfolios.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-namibian-president-appoints-a-shocking-cabinet-analyst-says/\">New Namibian President appoints a ‘shocking’ Cabinet, analyst says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "China-aided borehole brings clean water, economic relief to Zimbabwean villages",
            "url": "https://www.newzimbabwe.com/china-aided-borehole-brings-clean-water-economic-relief-to-zimbabwean-villages/",
            "content": "By Xinhua\n\nBEFORE a China-aided borehole was drilled in her village, 56-year-old Hilda Mutangadura walked over two hours to fetch clean water, carrying a 20-liter container.\n\nDespite her households daily water needs exceeding 80 liters, she had to make do with a single 20-liter bucket  the most she could carry in one trip.\n\nWe used to walk for two hours to fetch water. Now its much better because there is a borehole nearby. In just five minutes, I can get my water and return home to cook for my children, she told Xinhua in a recent interview.\n\nA subsistence farmer from Chirinda village in Wedza District, Mashonaland East Province, Mutangadura said the long hours spent fetching water had cost her valuable economic opportunities.\n\nThe new borehole in her village is part of a China-aided project to drill 300 boreholes across four Zimbabwean provinces. It now provides clean water to nearly 140 households across three villages.\n\nDespite clean water being a basic human right, Mutangadura said it had long been a scarce and precious commodity in her community.\n\nWith reliable water access, she and other women can now focus on income-generating activities such as crop farming and poultry rearing without the constant worry of where to find their next bucket of water.\n\nThe impact of the borehole has rippled through her household. With clean water readily available, even her livestock is thriving.\n\nOur livestock now drinks clean water. In the past, we gave them dirty water  what was left after washing clothes or dishes. Now, they get borehole water, and they are much healthier, she said.\n\nProviding her free-range chickens with clean water has also reduced mortality and improved their health. I am healthy, my chickens are healthy, and we are all healthy, Mutangadura said.\n\nIn many rural areas, water shortages have worsened due to climate change, which has disrupted rainfall patterns and made the search for water even harder, especially during the dry season that peaks around October.\n\nMonica Maruta, 58, noted that when water is scarce, the burden falls primarily on women, who are responsible for water collection and management. Beyond health concerns, water shortages also impact food security.\n\nDuring the cropping season, we used to wake up early to fetch water  at a time when we should have been in the fields before the heat set in. By the time we finished collecting water, we were too exhausted for other productive work. Thats why we are so happy with the borehole, she said.\n\nItayi Ndudzo, minister of State for Provincial Affairs and Devolution for Mashonaland East Province, said the borehole initiative aligns with Zimbabwes national development agenda of ensuring inclusive access to water, sanitation, and sustainable growth.\n\nThis latest development assistance is yet another testament to Chinas unwavering commitment to supporting Zimbabwes socio-economic development. Through this China-aided initiative, we will reach some of the most remote communities in Mashonaland East, Ndudzo said during the unveiling of the borehole in Chirinda village on Thursday.\n\nOver the past decade, China has drilled more than 1,000 boreholes across Zimbabwe, benefiting nearly 400,000 people, most of them in rural areas.\n\nWe are grateful to the Chinese for helping us. We used to see them going about their business, but now that they have helped us. It has forged a lifelong bond, Maruta said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24064455/1980d9324e9b489a9ddc0150addfa0ed.png",
            "description": "<p>By Xinhua BEFORE a China-aided borehole was drilled in her village, 56-year-old Hilda Mutangadura walked over two hours to fetch clean water, carrying a 20-liter container. Despite her household’s daily water needs exceeding 80 liters, she had to make do with a single 20-liter bucket — the most she could carry in one trip. “We</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-aided-borehole-brings-clean-water-economic-relief-to-zimbabwean-villages/\">China-aided borehole brings clean water, economic relief to Zimbabwean villages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "ZIMASCO approaches High Court to block ‘illegal’ takeover by syndicate",
            "url": "https://www.newzimbabwe.com/zimasco-approaches-high-court-to-block-illegal-takeover-by-syndicate/",
            "content": "By Leopold Munhende\n\nZIMASCO, one of Zimbabwes largest mining and chromite ore smelting companies, has approached the High Court to block three Kwekwe businessmen from taking ownership of the company.\n\nThe tiff and confusion emanate from a High Court order in favour of Avim Investments, which approved the takeover of Sinosteel Zimasco not ZIMASCO.\n\nWith the order in hand and despite the discrepancy, ZIMASCO alleges that Shepard Tundiya, who owns Avim Investments, lawyer Wilson Manase and Denny Marandure have tried to not only access their premises but gain access to their business accounts held at Ecobank.\n\nTundiya, in collaboration with Manase and Marandure, attempted on March 17, to gain control of ZIMASCOs bank accounts at Ecobank by instructing the bank to alter the account signatories in their favour, reads a statement from ZIMASCO.\n\nEcobank, declined to comply, asserting that the court order did not pertain to ZIMASCO (Pvt) Ltd.\n\nFollowing the failed attempt at the bank, the individuals visited ZIMASCOs head office, claiming authority to take over the companys management under the purported court order.\n\nZIMASCO management contended that the order was against Sinosteel Zimasco (Pvt) Ltd, not ZIMASCO and rejected their actions.\n\nLast week, the company had to issue a statement dismissing news of it having gone under judicial management due to similar confusions around the similarity in names with Sinosteel Zimasco.\n\nPlease note that ZIMASCO is not in any way related to Sinosteel Zimasco, if at all that entity exists, read its statement last week.\n\nAccording to ZIMASCO, Tundiya moved to get another order which changed the targeted company to theirs, without them being notified hence the decision to approach the High Court.\n\nThe order was granted by Justice Joel Mambara whose conduct has been reported to the Judicial Services Commission (JSC).\n\nAdded the statement: ZIMASCO Ltd has urgently filed a High Court application to block the court order.\n\nThe company has also lodged formal complaints with the JSC regarding Mambaras handling of the matter. Manases unethical conduct has been reported to the Law Society of Zimbabwe (LSZ).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/28164326/zimasco-scaled.jpg",
            "description": "<p>By Leopold Munhende Smelting company alleges attempts to access bank accounts ZIMASCO, one of Zimbabwe’s largest mining and chromite ore smelting companies, has approached the High Court to block three Kwekwe businessmen from taking ownership of the company. The tiff and confusion emanate from a High Court order in favour of Avim Investments, which approved</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimasco-approaches-high-court-to-block-illegal-takeover-by-syndicate/\">ZIMASCO approaches High Court to block ‘illegal’ takeover by syndicate </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Street tyre traders ordered to remove stockpiles fearing they could be burnt to barricade roads during planned March 31 protests",
            "url": "https://www.newzimbabwe.com/street-tyre-traders-ordered-to-remove-stockpiles-fearing-they-could-be-burnt-to-barricade-roads-during-planned-march-31-protests/",
            "content": "By Staff Reporter\n\nSTREET-SIDE tyre vendors in Harare have been ordered to relocate stock from their makeshift stalls by the police in fear of protestors, who they argue might decide to forcibly take and burn them during demonstrations set for next Monday, March 31, 2025.\n\nThe move, confirmed by vendors in Kambuzuma, adds to news that bars in Chitungwiza have been ordered to close earlier than usual for similar reasons.\n\nNewZimbabwe.com has it on good authority that State security agencies, comprising the police and Central Intelligence Organisation (CIO), have been put on high alert ahead of the protests.\n\nThe impending protests, called for by war veterans led by Blessed Bombshell Geza, are meant to force the resignation of President Emmerson Mnangagwa, whom they accuse of entertaining gross corruption by his close associates.\n\nWe have been told to move most of our tyres from stalls and keep them away from them by the police, said a vendor who sought to sell some of his products to this reporter.\n\nThey are now doing rounds raiding anyone who has not taken the tyres off their stalls as March 31 approaches. The fear, as told by one of the officers, is that protestors will take and burn them.\n\nTyres are usually burnt and used to barricade roads during protests, as was witnessed in the January 2019 and August 1 demonstrations.\n\nIn the populous Chitungwiza suburb, some bar employees in Zengeza 2 confirmed that they had been told to close shop between 8 pm and 9 pm in what one operator described as an illegal curfew.\n\nTruckloads of officers deployed to enforce such orders have been spotted numerous times.\n\nMost of the bars have been told to close between 8 pm and 9 pm in an unsanctioned curfew we do not support, said an imbiber, who requested anonymity.\n\nMnangagwa is battling to avoid a repeat of events he led in 2017 that forced late President Robert Mugabes eventual resignation.\n\nWith the help of war veterans and the military, Mnangagwa convinced millions of Zimbabweans to march and unseat Mugabe in a manner similar to that which Geza is pursuing.\n\nGeza has over the past weeks been laying into Mnangagwa and propping up his deputy Constantino Chiwenga, whom he says will deal with corrupt elements that have captured the presidency and government.\n\nHe has named over five local businessmen, all of whom he accuses of illegally benefiting from government tenders.\n\nThe same individuals were derogatorily labelled as zvigananda by Chiwenga.\n\nGeza is wanted by the police but has remained on the run since the arrest of journalist Blessed Mhlanga for interviewing and broadcasting their conversation.\n\nI am being protected by people because I stand for peoples wishes, said the man who was known as Bombshell during Zimbabwes war for liberation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/17051009/Zimbabwe-Protests.png",
            "description": "<p>By Staff Reporter STREET-SIDE tyre vendors in Harare have been ordered to relocate stock from their makeshift stalls by the police in fear of protestors, who they argue might decide to forcibly take and burn them during demonstrations set for next Monday, March 31, 2025. The move, confirmed by vendors in Kambuzuma, adds to news</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/street-tyre-traders-ordered-to-remove-stockpiles-fearing-they-could-be-burnt-to-barricade-roads-during-planned-march-31-protests/\">Street tyre traders ordered to remove stockpiles fearing they could be burnt to barricade roads during planned March 31 protests </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Socia Media Laws",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-socia-media-laws/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discussthe laws governing social media use in Zimbabwe.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss social medialaws. The Minister of Information,Publicity and Broadcasting Services Dr. Jenfan Muswere at the Minister meet the Media event stated that the government is drafting a new social media legislation to regulate social media. What lawsarecurrently regulating social media?\n\nVM: Thank you. Ifmy memory serves me right, one of the aims of that legislation is to address the issue of ghost accounts. As the legislation has not been introduced yet, I will focus on the current legal position.\n\nTo your question on how social media is currently regulated, we have to start at the constitution level. Our constitution in Zimbabwe guarantees everyones right to propagate and express their opinions and beliefs whether in private or in public, individually or collectively. This right extends to any individuals ability to freely express or disseminate ideas through media, in this particular case, social media.\n\nHaving said that, all rights have qualifications or limitations, otherwise they will end up infringing on the other rights enjoyed by people in a democratic community. The same constitution then limits this right to freely express opinions or ideas by the media if the exercise of such right to express ideas may incite violence or be injurious to another persons reputation or dignity. The requirement in our law for injury to reputation also considers whether there was malice. Going back to the limitations, the constitution also limits the right of expression where it breaches someone elses right to privacy or it amounts to hate speech\n\nReporter: Some people argue that these limitations are wide in interpretation and have been used to infringe on peoples rights by the State, calling it subversive content\n\nVM: The laws governing what you are referring to as subversive content is found mainly in our Criminal Law (Codification and Reform) Act and our Cyber and Data Protection Act. There have been allegations of abuse of this wide interpretation, it really depends on which side of the table you are sitting and whose argument you are listening to.\n\nSubversive content is, in general terms, material that threatens state authority or incites public disorder. This material can include publishing false statements prejudicial to the state, or transmitting messages that incite violence or damage to property.\n\nThere has been some high-profile cases involving such allegations and some legal critics argue that words like prejudicial are open to selective enforcement. I suppose these are some of the issues that will be clarified by the proposed new social media laws.\n\nReporter:What is the position when it comes to defaming people using social media?\n\nVM: Defamation in terms of our laws has criminal and civil implications.\n\nOur Criminal Law Code still retains an imprisonment option when one publishes false information that is harmful to anothers reputation. The court also considers the issue of malice when the information was published in weighing the appropriate punishment. That is whether or not the motivation for the statement was malicious.\n\nThe injured person being the person who has been defamed can also approach our civil courts with a claim for defamation which can include damages. The defamed person will need to prove that the statement was false, malicious and reckless and has reduced their standing in society.\n\nSeveral cases have been brought in our civil courts with a number being successful after having met the criteria set to qualify for defamation.\n\nReporter: We have seen a number of prosecutions that include the leaking of nudes or sex tapes by exlovers?\n\nVM: There have been a number of cases alleging revenge leaks of nude images or videos of a sexual nature involving exlovers. Our censorship laws prohibit the distribution of indecent material or material regarded as obscene. The qualification here is whether the material distributed offends public morality.\n\nFurther, our Cyber and Data Protection laws criminalize posting or sharing nudes or videos of a sexual nature involving another, which in this example is an ex-lover, without their consent. The penalties from such posts may even include imprisonment.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nThesediscussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/23191622/social-media-law.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss the laws governing social media use in Zimbabwe. Reporter: Welcome back Mr. Madzima, this week we want to discuss social media laws. The Minister of Information, Publicity and Broadcasting Services Dr. Jenfan Muswere at the ‘Minister meet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-socia-media-laws/\">Legal Discussions with Vengai Madzima: Socia Media Laws</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "Geoff Nyarota and Gukurahundi massacres: Did the pen betray the people of Matabeleland and Midlands?",
            "url": "https://www.newzimbabwe.com/geoff-nyarota-and-gukurahundi-did-the-pen-betray-the-people/",
            "content": "By Staff Reporter\n\nTHE recent passing of Geoff Nyarota, an award-winning veteran journalist and writer, has reopened a painful chapter in Zimbabwes history.\n\nWhile lauded by many as a doyen of journalism, both within the country and internationally, Nyarotas tenure at the helm of the state-funded Chronicle newspaper during the early 1980s, and his perceived handling of the Gukurahundi atrocities, has undeniably left a dark stain on his legacy.\n\nThe central accusation revolves around Nyarotas alleged support for the deployment of the North Korean-trained army the Fifth Brigade in Matabeleland and some parts of Midlands.\n\nThis deployment saw the unit wreak havoc upon the region, carrying out acts of killing, maiming, and rape, overwhelmingly targeting the Ndebele-speaking population, whom they accused of harbouring dissidents and supporting Joshua Mqabuko Nyongolo Nkomo, the founder and leader of the then Zimbabwe African Peoples Union (ZAPU).\n\nIndependent human rights groups have estimated that approximately 20,000 people lost their lives during the Fifth Brigades presence in Matabeleland and some parts of Midlands, between 1982 and 1987. A period that to this day is considered a genocide by many.\n\nThe then Prime Minister, Robert Mugabe himself described this period as a moment of madness, yet he died without ever issuing an apology or accepting responsibility for the actions carried out under his command.\n\nIn the wake of Nyarotas death, Information Permanent Secretary Nick Mangwana stated that journalism was the poorer for his passing, acknowledging his impact on investigative journalism.\n\nAs a pioneering editor, he left an indelible mark on the countrys journalism landscape. His contributions to investigative journalism and robust public discourse will be remembered, Mangwana wrote on X Sunday.\n\nJob Sikhala, the former St Marys MP and National Democratic Working Group (NDWG) Chairperson, echoed these sentiments: He told it as it is as the then Editor in Chief of the Daily News until they bombed to silence it. Panyika idandaro. Rest in Eternal Peace Geoff Nyarota!!! Sikhala posted on X Sunday.\n\nNumerous other prominent figures in Zimbabwean society have also paid tribute to Nyarotas contribution to journalism, including the renowned lawyer and University of Zimbabwe (UZ) lecturer Professor Lovemore Madhuku, Alpha Media Holdings (AMH) founder and owner Trevor Ncube, and the current Information Minister, Jenfan Muswere, along with a multitude of journalists and commentators.\n\nHowever, the shadow of Gukurahundi continues to loom large, casting a long and troubling pall over Nyarotas professional reputation.\n\nCritics argue that his time at The Chronicle was nothing short of disastrous, alleging that he deliberately chose to ignore the atrocities unfolding in Matabeleland. Furthermore, some claim that he even advocated for the continued deployment of the Fifth Brigade, appealing directly to the late Mugabe to maintain their presence in the region.\n\nIt is often said that one should not speak ill of the dead, but the gravity of the accusations surrounding Nyarotas role during this period necessitate a reckoning with this controversial chapter in his career.\n\nSiphosami Malunga, a globally recognised human rights lawyer and activist, offered a particularly stark assessment of Nyarotas legacy, describing his journalistic credentials, particularly regarding his involvement in the Gukurahundi events, as terrible.\n\nFewer speak of his terrible role in aiding and abetting the Gukurahundi genocide in Matabeleland as Editor of the Chronicle newspaper. Im one of the few, alongside thousands of Gukurahundi victims, who believes thats what ultimately defines his credentials as a journalist.\n\nMalunga further asserted that Nyarota actively chose to side with the perpetrators of these appalling acts, a betrayal of his fundamental duty as a journalist.\n\nHe aided and abetted genocide. A better journalist would have sought to shine a spotlight on the horrors and the uneven impact on innocent civilians. He chose the side of the perpetrators and helped and cheered them to commit unspeakable atrocities.\n\nMalunga is far from alone in voicing these criticisms.\n\nDr. Admore Tshuma, a UK-based academic, recalls Nyarotas time at the state-funded Chronicle during the Gukurahundi years as a period of profound moral failing, allegedly endorsed by Nyarota himself.\n\nBut there is another side to his legacy, one that is etched in blood and silence.\n\nWhen I was at The Chronicle, I came across one of his editorial comments, one that shocked me to the core. In it, he pleaded with Robert Mugabe not to withdraw the 5th Brigade from Matabeleland, stating, and I quote: Ndebeles must be disciplined.\n\nThose chilling words were written at the very time when the 5th Brigade was leaving behind a trail of devastation, raped women, decapitated civilians, families shattered forever. Children grew up without parents, without homes, without even the basic dignity of schooling.\n\nTshuma added: The people of Matabeleland endured a genocide, and Geoffrey Nyarota, an editor entrusted with truth, chose not to expose the horror, but instead to endorse its execution.\n\nThe legacy of Gukurahundi continues to haunt Zanu-PF, as both late president Mugabe and President Emmerson Mnangagwa are inextricably linked to these historically appalling acts of murder and violence against the people of Matabeleland and Midlands.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/23043329/Geoffrey-Nyarota.jpg",
            "description": "<p>By Staff Reporter THE recent passing of Geoff Nyarota, an award-winning veteran journalist and writer, has reopened a painful chapter in Zimbabwe’s history. While lauded by many as a doyen of journalism, both within the country and internationally, Nyarota’s tenure at the helm of the state-funded Chronicle newspaper during the early 1980s, and his perceived</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geoff-nyarota-and-gukurahundi-did-the-pen-betray-the-people/\">Geoff Nyarota and Gukurahundi massacres: Did the pen betray the people of Matabeleland and Midlands?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        },
        {
            "title": "SADC commemorates Southern Africa Liberation Day",
            "url": "https://www.newzimbabwe.com/sadc-commemorates-southern-africa-liberation-day/",
            "content": "By Staff Reporter\n\nTHE Southern African Development Community (SADC) Chairperson, Emmerson Mnangagwa has marked the Southern Africa Liberation Day by honouring the sacrifices of the regions freedom fighters.\n\nThe day celebrated on 23 March annually, serves as a tribute to Africans who fought for independence, democracy, and sovereignty.\n\nIn a statement, Mnangagwa called on citizens to remain vigilant against threats to their independence.\n\nI urge us all, as independent peoples of SADC, to remain vigilant and be alert to the emerging challenges that threaten our hard-won independence and the general stability of our region.\n\nWe must, continue to stand in solidarity against the imposition of illegal sanctions, use of coercive measures and or any other actions that undermine our sovereignty and territorial integrity, he said.\n\nThe 82-year-old Zimbabwean leader waved solidarity with the Saharawi Arab Democratic Republic, indicating that a free Africa will be attained after the Western Sahara gets its freedom.\n\nOn this historic day, we also remember our brothers and sisters in the Saharawi Arab Democratic Republic, who are still being denied the right to determine their own destiny. Africa will not be free, until the Western Sahara, is liberated, free and independent.\n\nFurther, Mnangagwa called for the total silencing of guns in the eastern Democratic Republic of Congo.\n\nSADC remains a relatively calm and peaceful region. For this, we are proud. However, I reiterate our call for lasting peace in the eastern part of the Democratic Republic of Congo. The situation in Eastern DRC undermines the aspirations bequeathed to us by our Founding Fathers and outlined in the SADC Constitutive Act and Vision 2050.\n\nThe time to silence the guns, de-escalate tensions and hostilities as well as to engage in dialogue to secure mediated outcomes for long-lasting peace in DRC is now, said Mnangagwa.\n\nMeanwhile, the SADC chairperson flagged the need to develop modernised equipment to detect droughts as Africa has been impacted by the unpredicted climate change.\n\nOver the years, our region, has been greatly affected by recurring climate change induced disasters, leading to far reaching consequences for our people, economies, and environment.\n\nThe extreme weather patterns have resulted in frequent and severe droughts, threatening food security and livelihoods across our region.\n\nIt is our collective responsibility to take decisive action to mitigate and manage the effects of these natural disasters. To this end, the need to enhance our early warning capabilities, build resilience and adaptation capacities, leveraging on the deployment of science, technology and innovation cannot be over-emphasised, said Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/13145831/mnangagwa.jpeg",
            "description": "<p>By Staff Reporter  THE Southern African Development Community (SADC) Chairperson, Emmerson Mnangagwa has marked the Southern Africa Liberation Day by honouring the sacrifices of the region’s freedom fighters. The day celebrated on 23 March annually, serves as a tribute to Africans who fought for independence, democracy, and sovereignty. In a statement, Mnangagwa called on citizens</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-commemorates-southern-africa-liberation-day/\">SADC commemorates Southern Africa Liberation Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "24 Mar 2025"
        }
    ]
}