{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss the law of succession as it relates to agricultural land in Zimbabwe. What are the main considerations?\n\nVM:Thank you\n\nBefore delving into the laws of succession in agricultural land, it is necessary that I first address how agricultural is held in Zimbabwe. Agricultural land is held either through title deeds, 99-year leases, leases with an option to purchase, offer letters, permits or customarily as rural land under Rural District Councils.\n\nThese forms of holding confer personal rights to the holder except in title deeds, where the holder has real rights to the land. The personal rights titles emanating from Land Reform, being mainly permits, offer letters and 99-year leases, are a result of potentially one of the most significant wealth transfer events in post-colonial Africa.\n\nThe land itself is owned by the state and occupiers have usufructs on the land to use, enjoy and earn from it.\n\nThis background or understanding is necessary as it has a direct effect on succession.\n\nSuccession itself has become topical as farming by its very nature is a generational business.\n\nIf land reform started around 2000, it means the process is now 25 years old and cases of succession by heirs are now commonplace.\n\nReporter: You highlight land reform beneficiaries, that is A1 and A2. What is the process when the initial beneficiary dies?\n\nVM:It is important that we first differentiate the A1, being a small holder farm held under a permit from the government and an A2 farm being a large-scale commercial farm held under an offer letter or a 99-year lease.\n\nI understand that the current government policy is aimed at issuing deeds for these holders. I will discuss on succession for deeds later on. For now, I will restrict myself to permit, offer letter and lease holders.\n\nFirst thing to understand is that the land under these models belongs to the State and not individuals, therefore, succession in its strictest sense, which is through the Master of the High Court, is only for improvements and movable property.\n\nIf its for land, then the succession or reallocation of land to an heir has to be approved by the government who is the landowner. When the estate of the late holder is being administered, the value of the land is not included in the process as it does not belong to the estate but the government.\n\nMaking the process twotier\n\nFor A1 farms, the surviving spouse and dependants may succeed although the successor has to be approved by the Minister of Lands. The process is done through the District Lands office within 3  6 months after the death of the land owner, depending on whether or not there are disputes. In situations of disputes, spousal rights are protected and consideration is also given to potential successors who developed the farm.\n\nThe process is similar for A2 offer letters; there is a need for an application to the Ministry of Lands district office with the required documents, which is dealt with by the Valuation and Estate Management section. As part of its consideration, it will assess, among other things, the capacity to farm, whether or not the potential heir has other farms et cetera.\n\nAs for lease holders, it is governed by general inheritance laws; the executor, upon completing the beneficiary identification process, will still be required to make an application to the Minister for approval of allocation.\n\nReporter:What issues may inhibit or stop the A1 or A2 farms being re-allocated or distributed to the selected beneficiary?\n\nVM:I am forced to start by reiterating that the rights conferred by offer letters and or leases are personal in nature. This makes it necessary for the beneficiary or potential heir to prove the rights to the Ministry of Lands.\n\nSuch proof is through the offer letter, permit or lease granted to the deceased. A failure to prove implies that the late occupier may potentially have been an unlawful occupier.\n\nIn the absence of proof, the Ministry of Lands has no obligation to re-allocate the land to the selected heir. As there may be back and forth between the offices, it is important that copies of correspondence with the Ministry are kept judiciously in the event there is a need for them to be reproduced\n\nReporter: What is the inheritance position for rural kumusha land when it comes to inheritance and farms having a title deed?\n\nVM:Communal land is vested in the President and administered by the Rural district Councils through traditional leaders being chiefs and headmen. Their inheritance for use is normally through family lines.\n\nAs for farms having title deeds, they fall under our normal inheritance laws under the purview of the Master of the High Court. The Ministry of Lands does not have jurisdiction over these types of farms.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04171724/mcm-legal.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        },
        {
            "title": "Brick by Brick, Zimbabwe companies fall to foreign competitors",
            "url": "https://www.newzimbabwe.com/brick-by-brick-zimbabwe-companies-fall-to-foreign-competitors/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nNational laws aimed at redressing colonial imbalances reserve retail sectors, like that of brickmaking, for locals. But companies with outside investment, particularly from China, routinely flout the rules.\n\nHARARE, ZIMBABWE  For nearly a decade, Stanley has made a living laying out bricks for drying at Willdale Bricks, one of Zimbabwes oldest brick manufacturers. That work paid his rent and kept his three children in school. But orders at the company have slowed and, like many other colleagues, he hasnt seen a salary in two months.\n\nWe used to be self-sufficient through our salaries, says Stanley, who asked to use his middle name for fear of losing his job. That stability is gone.\n\nCompanies in Zimbabwes brickmaking sector are feeling the pressure from growing competition by foreign-backed companies expanding into the retail end of the industry.\n\nBy law, this shouldnt be happening. The countrys Indigenization and Economic Empowerment Act reserves the retail sector and others  including wholesale trade, employment agencies and advertising  for its citizens. Foreign nationals require permission from the Ministry of Industry and Commerce to operate in these sectors.\n\nThe law, passed in 2007, is among policies pursued by the former President Robert Mugabes government to redress colonial imbalances that excluded Zimbabwes black majority from owning or meaningfully participating in key sectors of the economy.\n\nBut like the land reforms, which also meant to address these imbalances, the policy has long been controversial. Some say it has mostly created regulatory uncertainty, benefited those with close links to the state, and driven away much-needed foreign direct investment, among other concerns.\n\nSince its introduction, the policy has undergone some changes under President Emmerson Mnangagwas administration to open up the economy for more investment. Through a 2018 Finance Act, the government revised the language and reserved these sectors to Zimbabwean citizens rather than indigenous Zimbabweans as the original policy stated. It also limited a 51% local ownership requirement to businesses that extract diamonds and platinum.\n\nCritics say while well-intentioned, the policy is inconsistently applied. Some foreign firms sidestep the requirements with relative ease.\n\nIn the brickmaking sector, companies like Willdale Bricks  which once dominated the industry and employs hundreds  are being edged out by foreign-backed manufacturers that are extending into retail.\n\nGlobal Press Journal directly contacted several companies registered with Zimbabwe Investment and Development Agency as brick manufacturers  including Tiger Bricks, Preedon Bricks and Obrim Bricks  all registered as foreign investments. Each confirmed they sell directly to customers.\n\nWhen asked if the companies had the permission required, the Ministry of Industry and Commerce did not respond. Global Press Journal also requested information on special licenses issued in recent years but did not get any response by the time of publication.\n\nHowever, an official in the department of economic empowerment at the ministry familiar with the matter, who did not want to be named for fear of losing his job, says that since he joined the ministry in 2019 it has not allowed any foreign companies to sell bricks. If [foreign] companies are selling bricks either through retail or wholesale without such permission, its unlawful, he says.\n\nSuch licenses usually last five years, he says, and if there are any companies that had these licenses before his arrival at the ministry, they would have lapsed by now.\n\nEven if they have licenses, its still a problem, says Godfrey Kanyenze, founding director of the Labour and Economic Development Research Institute of Zimbabwe. Brickmaking, he says, is one of the clear areas that should be reserved for locals.\n\nThere is no real point in having people come from far away to do what locals can do. Brickmaking is not a complicated economic activity that should require foreign direct investment, Kanyenze says, adding that the country should seek foreign investment in more complex capital- and skill-intensive areas.Our locals, even in the villages, make bricks.\n\nBricks move along the production line at Obrim Bricks. Despite laws reserving the retail sector for citizens, foreign companies continue to sell directly to customers, raising concerns among local producers. Photo: Linda Mujuru, GPJ Zimbabwe\n\nThe indigenization policy is increasingly tested as Zimbabwe, like many other countries in Africa, embraces Chinese investment. In 2023, the government issued about 369 new licenses to Chinese investors, accounting for 60% of all foreign investment that year and representing about 154% more investors than 2022.\n\nWhile the capital that comes from foreign direct investment can be beneficial to the country, the cost is steep. Its a double-edged sword, says Joe Muzurura, a political analyst who has written extensively about this issue in Zimbabwe. Its eroding local industries, he says, citing the example of Willdale Bricks, which is no longer the giant it used to be.\n\nIf well regulated, foreign direct investment could support local players and help grow domestic industry, Muzurura says. Instead, he says, its stifling [them].\n\nAlready, local brick companies are under strain from the countrys worsening economic conditions. Willdale Bricks 2024 annual report shows that the company was struggling with liquidity constraints and high production costs. And a 15% value-added tax introduced in 2024 on the supply of bricks has pushed customers to cheaper, often non-compliant alternatives.\n\nBeta Bricks, also a local brick manufacturing company and part of the Beta Holdings group, entered corporate rescue proceedings in January after defaulting on loans.\n\nBoth companies did not respond to Global Press Journal requests for interviews.\n\nObrim Brick Manufacturers is an investment company registered as a manufacturer and majority-owned by Chinese shareholders. Anesu Kondo, an accountant at Obrim, says their operations are fully compliant.\n\nWhile Kondo says they do not have a special license from the ministry that would allow them to operate in retail, he says selling their product directly to customers should not be mistaken as retail trade. We are not acting as middlemen. We are selling what we produce, he says.\n\nForeign companies are only filling a gap left by struggling local companies, Kondo adds. When we entered the market, the major players werent meeting demand. Local companies werent recapitalizing, and many still rely on outdated brickmaking technologies.\n\nSuch interpretation is simply stretching the law, says Nyasha Brighton Munyuru, a managing partner at Muvingi and Mugadza Legal Practitioners, adding that the law is clear: Such a company needs permission from the ministry to operate in retail.\n\nWorkers stack bricks for delivery at Obrim Bricks. Analysts warn that foreign-backed firms with greater production capacity are edging out Zimbabwean companies already struggling with rising costs and economic instability. Photo: Linda Mujuru, GPJ Zimbabwe\n\nThe government has failed to implement the law, says Henry, a senior employee at Willdale Bricks who has worked at the company for nearly 25 years. He requested the use of his first name only, for fear of losing his job.\n\nBefore a foreign business sets up its operations, there should be strict rules in place and enforcement to match. But that rarely happens, he says, adding that some foreign companies operating in the country arent formally registered with authorities.\n\nGenerally, there is a double standard in how authorities implement regulations, he says. They allow foreign investors to evade taxes and regulations, while local businesses face intense scrutiny. Were expected to comply fully, bank all our earnings, and accept local currency that constantly loses value, he says.\n\nForeign companies bypass the requirements that weigh down local producers, making it hard for locals to compete, Stanley says.\n\nOn top of that, the foreign companies have the added advantage of superior technology and greater production capacity, says Muzurura, the analyst.\n\nZimbabwe isnt the only one grappling with the ripple effects of foreign investment on local businesses.\n\nIn Zambia, Chinese-owned enterprises dominate sectors such as mining and retail, often undercutting local entrepreneurs with lower prices, according to 2018 research by the International Institute for Environment and Development.\n\nIn Sri Lanka, according to a 2023 report by the International Collective in Support for Fishworkers, the Hambantota Port project, largely funded by Chinese investment, has strained local livelihoods. The projects large-scale fishing operations have encroached on traditional fishing grounds, making access difficult for local fishermen.\n\nAnd in Vietnam, while Chinese manufacturing companies in the textiles and electronics sectors have created jobs, they also have displaced small Vietnamese producers who struggle to compete with the Chinese firms lower prices and greater production capabilities, according to a 2017 report from the Harbin Engineering Universitys School of Economics and Management.\n\nIn Zimbabwe, this shift happens at a time when the economy is fragile and unemployment is high  a dangerous mix.\n\nAs their salaries havent been guaranteed, both Stanley and Henry have had to find other means to subsist.\n\nHenry takes on side jobs to make ends meet.\n\nIn the past, working at Willdale was something to be proud of. Now, even informal vendors seem better off, Henry says. We are in a dire state.\n\nLinda Mujuruis a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04165809/Obim-bricks-GPJ-Zimbabwe.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal. National laws aimed at redressing colonial imbalances reserve retail sectors, like that of brickmaking, for locals. But companies with outside investment, particularly from China, routinely flout the rules. HARARE, ZIMBABWE — For nearly a decade, Stanley has made a living laying out</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brick-by-brick-zimbabwe-companies-fall-to-foreign-competitors/\">Brick by Brick, Zimbabwe companies fall to foreign competitors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        },
        {
            "title": "ZIFA appoints Marian Marinica new Warriors head coach",
            "url": "https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/",
            "content": "By Sports Reporter\n\nZIFA has appointed Marian MarioMarinica as the new head coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nMarinica is a Romanian national who has previously managed Malawi and Liberia.\n\nThe 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in the game.\n\nIn a statement, ZIFA said Marinica was given a one-year contract andwill becommencing duty this month.\n\nZimbabwe Football Association (ZIFA) is pleased to announce the appointment of Marian (Mario) Marinica as the new Head Coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nThroughout his distinguished career, Marinica has worked with several prestigious clubs and national teams, including Arsenal FC, Chelsea FC, Internazionale Milano, AS Monaco, Liverpool FC, and Tottenham Hotspur, as well as the national teams of Paraguay, Mauritius, Malawi, and Liberia.\n\nUnder his leadership, Malawi reached the Round of 16 at the 2022 Africa Cup of Nations, their best-ever finish, while Liberia became the highest climber in the FIFA Rankings in June 2024, reads thestatementon Marinicas appointment.\n\nHe comes in toreplaceMichael Nees, who was fired last month following a string ofpoor results.\n\nMarinicas first assignment will be the upcoming friendly matches against Qatar and Algeria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05043256/marion-coach.jpeg",
            "description": "<p>By Sports Reporter ZIFA has appointed Marian ‘Mario’ Marinica as the new head coach of the Zimbabwe Senior Men’s National Football Team, the Warriors, on a one-year contract. Marinica is a Romanian national who has previously managed Malawi and Liberia. The 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/\">ZIFA appoints Marian Marinica new Warriors head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        },
        {
            "title": "Improve our welfare or we leave – nurses tell government",
            "url": "https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/",
            "content": "By Staff Reporter\n\nNURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad.\n\nMedical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health institutions.\n\nAddressing the annual general meeting in Masvingo recently, Zimbabwe Nurses Association (ZINA) president Enock Dongo told Deputy Minister of Health and Child Welfare Sleiman Kwidini that government shouldtake care of the workforce to avoid strikes.\n\nOur covenant is that we do not engage in strike. Strike is the last resort. We should not be pushed to that limit. So when you hear us complaining it would be so that nurses receive meaningful salaries. If they get enough salaries they forget about going on strike, said Dongo.\n\nHealth professionalshave been leavingthe countryin droves, in the process affecting service delivery in public hospitals.\n\nDongo said 4 000 nurses have applied to government for verification as they attempt to leave the country.\n\nWe have a very topical issue of verification which was supposed to be given by the Nurses Council, is not being given right now. Power has been taken by the Ministry. Legally Ministry does not have the power to withhold a letter of good standing, but it is still doing that.\n\nLetter of good standing is supposed to be given so that one can go wherever he wants. If I have done anything wrong just write rather than withholding it. We have more than 4 000 verification applications by nurses is because of poor working conditions and salaries.\n\nWe do not even aim to go outside the country. All the nurses here are very patriotic, added Dongo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/05015541/Nursees-on-Strike.png",
            "description": "<p>By Staff Reporter NURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad. Medical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/\">Improve our welfare or we leave – nurses tell government </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        },
        {
            "title": "Zimbabwean mayoral candidate admits trying to rig Adelaide council election",
            "url": "https://www.newzimbabwe.com/zimbabwean-mayoral-candidate-admits-trying-to-rig-adelaide-council-election/",
            "content": "The Noticer\n\nAn Zimbabwean mayoral candidate, Jaison Midzi, has pleaded guilty to electoral fraud charges on the day he was set to go to trial for trying to rig anAdelaidecouncil election.\n\nMidzi, 44, from Seacombe Gardens, was arrested in July last year for providing fake ballot papers while running for Mayor in the City of Marion in 2022.\n\nOn Monday, he pleaded guilty to 10 counts of dishonestly exercise a vote at an election or poll under the Local Governments Act 1999, and another 16 counts were withdrawn,The Advertiserreported, despite maintaining his innocence for the past year.\n\nA day before polling in November 2022 the Electoral Commission of South Australia (ECSA) informed Marion Council candidates that it was investigating 490 returned declaration envelopes suspected of being submitted by the same people, and said it took action to ensure the integrity of the election.\n\nThe ECSA also investigated voting scams in West Torrens, and in the City of Adelaides Central Ward that led to that election being declared void in April after a court foundChinese councillor Jing Li was elected as a result of illegal practicesrelated to postal ballots involving foreign students. Li has not been accused of wrongdoing.\n\nMidzi, an immigrant and a former Citizen of the Year nominee, told reporters outside court not to misinform the public, and said he would comment further on the case after he was sentenced next month. He faces a maximum penalty of one year in jail or a $5,000 fine for each charge.\n\nHe also ran as an independent candidate in the seat of Gibson in the South Australian state election in March 2022, was elected Chairperson of the South Australia Zimbabwe Association in 2018, and ran as a City of Marion councillor in 2018.\n\nMidzi has made regular pro-diversity posts on social media, often weighs in on Zimbabwean and African politics, writing on X: One Africa is what we want. The borders came from your greedy Europeans.\n\nDuring the 2018 election he made a campaign video with a music group called the Diversity Music Collective, which included him dancing in front of the City of Marion council chambers and singing the lyrics thank you all for trusting me.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04162040/jaison-midzi.jpg",
            "description": "<p>The Noticer An Zimbabwean mayoral candidate, Jaison Midzi, has pleaded guilty to electoral fraud charges on the day he was set to go to trial for trying to rig an Adelaide council election. Midzi, 44, from Seacombe Gardens, was arrested in July last year for providing fake ballot papers while running for Mayor in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-mayoral-candidate-admits-trying-to-rig-adelaide-council-election/\">Zimbabwean mayoral candidate admits trying to rig Adelaide council election</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        },
        {
            "title": "How much do Zimbabwean domestic workers really earn in South Africa?",
            "url": "https://www.newzimbabwe.com/how-much-do-zimbabwean-domestic-workers-really-earn-in-south-africa/",
            "content": "The South African\n\nFor the past few years, many Zimbabweans have continued to relocate to South Africa in search of greener pastures, and some have settled as domestic workers.\n\nThe question is how much do they earn as domestic workers in South Africa.\n\nA domestic worker is a person who works in a private household and is entitled to receive pay.Their workgenerally includes caring for members of a household, especially children.\n\nAccording to a recentLandscape Review of South Africas Care Economyreport, domestic work in South Africa is mostly informal.\n\nThe report notes that domestic workers account for about 6.5% of the workforce and nearly all are women.\n\nResults from a recent annual survey conducted bySweepSouth, an online platform for connecting home employees to homeowners, found that Zimbabwe has more domestic workers in South Africa.\n\nAccording to SweepSouth, majority of domestic workers respondents were women and between the ages of 26 and 41.\n\nThe nationality of respondents was split between South Africa (37%) and Zimbabwe (59%), with Malawi (3%), Lesotho (1%) and other nationalities making up the remainder, reads part of the survey.\n\nHome employees fall under national minimum (NMW) wage legislation, which entitles them to earn R28.79 per hour.\n\nHowever, according to the SweepSouth survey, most home employees average hourly earnings exceed the current national minimum wage.\n\nThe report states that there islittle variation by nationality. South African home employees getR36.64per hour and foreign nationals getR33.35 per hour.\n\nThe report states: However, when breaking down hourly rates by individual worker, we found that while the bulk of workers earn above minimum wage (54%), an alarmingly large number of workers earn less than the NMW (46%).\n\nOverall, whether Zimbabwean or not, home employees earn betweenR3 105andR5 242per month, according to the recent SweepSouth report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04163201/Domestic-worker.jpg",
            "description": "<p>The South African For the past few years, many Zimbabweans have continued to relocate to South Africa in search of greener pastures, and some have settled as domestic workers. The question is how much do they earn as domestic workers in South Africa. Understanding domestic workers in South Africa A domestic worker is a person</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-much-do-zimbabwean-domestic-workers-really-earn-in-south-africa/\">How much do Zimbabwean domestic workers really earn in South Africa?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        },
        {
            "title": "Arise, Sir David – Beckham receives knighthood",
            "url": "https://www.newzimbabwe.com/arise-sir-david-beckham-receives-knighthood/",
            "content": "BBC\n\nFormer England captain Sir David Beckham has been formally knighted for his services to football and British society.\n\nThe 50-year-old, who wasnamed on King Charles Birthday Honours listearlier this year, was knighted by the King during a ceremony in Berkshire on Tuesday.\n\nI couldnt be prouder, said Beckham. People know how patriotic I am  I love my country.\n\nIve always said how important the monarchy is to my family.\n\nIm lucky enough to have travelled around the world and all people want to talk to me about is our monarchy. It makes me proud.\n\nBeckham was joined by his wife Victoria and his parents Sandra and David at Windsor Castle.\n\nVictoria, who received an OBE in 2017 for services to the fashion industry, designed and made the suit that her husband wore at the castle.\n\n[King Charles] was quite impressed with my suit, said Beckham.\n\nHes the most elegantly dressed man that I know, so he inspired quite a few of my looks over the years and he definitely inspired this look.\n\nIt was something that my wife made me.\n\nI looked at old pictures of him when he was quite young in morning suits and I was like OK, thats what I want to wear  so I gave it to my wife and she did it.\n\nBeckham played 115 times for his country and captained the Three Lions for six years between 2000 and 2006.\n\nThe former Manchester United and Real Madrid midfielder featured in three World Cups for England, as well as two European Championships.\n\nBeckham emerged from Uniteds academy in 1992 and spent 11 years in the first team before joining Real in 2003 in a 25m deal.\n\nHe played for four years in the Spanish capital before joining Major League Soccer team LA Galaxy. He had two loan spells at AC Milan during his time in Los Angeles, before finishing his career at Paris St-Germain in 2013.\n\nBut Beckhams impact extends far beyond the pitch.\n\nBorn in east London, he played a role in securing the 2012 Olympics for London.\n\nHe has worked with humanitarian aid organisation Unicef since 2005 and had a fund named in his honour in 2015 to mark a decade-long partnership between the two.\n\nBeckham, who was awarded an OBE by Elizabeth II in 2003,queued for more than 12 hoursto see the Queen lying in state following her death in 2022.\n\nIts special to be here, to celebrate and to hear the different stories that people have, Beckham said afterwards.\n\nBeckham became an ambassador for the Kings Foundation in 2024, supporting King Charles education programme and efforts to ensure young people have a greater understanding of nature.\n\nHe part-owns League Two side Salford City alongside former United and England team-mate Gary Neville, and is also co-owner of MLS side Inter Miami.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04174008/beckham.webp",
            "description": "<p>BBC Former England captain Sir David Beckham has been formally knighted for his services to football and British society. The 50-year-old, who was named on King Charles’ Birthday Honours list earlier this year, was knighted by the King during a ceremony in Berkshire on Tuesday. “I couldn’t be prouder,” said Beckham. “People know how patriotic I am</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/arise-sir-david-beckham-receives-knighthood/\">Arise, Sir David – Beckham receives knighthood</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "05 Nov 2025"
        }
    ]
}