{
    "news": [
        {
            "title": "High Court denies removal of top corporate rescue practitioner in US$600,000 dispute",
            "url": "https://www.newzimbabwe.com/high-court-denies-removal-of-top-corporate-rescue-practitioner-in-us600000-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe has dismissed a contentious application to remove Cecil Madondo, the Corporate Rescue Practitioner (CRP) for MCA Venture Capital (Pvt) Ltd, signalling a victory for procedural integrity amid allegations of misconduct.\n\nThe courts judgment arose from an application filed by South African liquidators Lizanne Chantal Muller and Mari Haywood, who sought Madondos removal over claims he failed to execute a court-approved Corporate Rescue Plan and improperly handled funds owed to creditors.\n\nIn his ruling, Justice Regis Dembure said thecourt does not order the removal of a CRP lightly.\n\nCentral to the applicants allegations was the assertion that Madondo mismanaged a crucial dividend payment of US$610,319.47 to MCA South Africa, a creditor of MCA Venture Capital, following the application for Exchange Control Approval from the Reserve Bank of Zimbabwe.\n\nThe court noted a lack of evidence that Madondo had acted unlawfully, emphasising, In the absence of approval from the RBZ, it cannot be said that the first respondent failed in his statutory duty to implement the plan.\n\nMadondo faced scrutiny for allegedly prioritising his fees and business expenses before addressing creditor claims.\n\nHowever, the judgment highlighted that his actions fell within the permissible expenses outlined in the Corporate Rescue Plan: The [Plan] explicitly allowed the first respondent to make deductions for corporate rescue costs, including his fees.\n\nIn response to the applicants concerns of conflict of interest over his dual roles, the court stated that there was insufficient proof of Madondo being influenced by MCA Ventures management, asserting, There is no conflict of interest where [the CRP] exercised his powers to pay the corporate rescue costs.\n\nThe ruling is seen as a landmark reaffirmation of the safeguards intended in corporate rescue procedures, adhering to the principle that the duty to act in the best interest of all creditors remains paramount. Madondo, in defense of his conduct throughout the rescue process, stated, I made every effort to comply with the legal requirements stipulated by both the Corporate Rescue Plan and the court.\n\nMuller and Haywoods claims painted a grim picture of mismanagement and deceit, but ultimately, the legal discourse suggested that the applicants may have acted prematurely by seeking immediate removal of the CRP without fully exploring all avenues of resolution through the Master of the High Court.\n\nDembure said, The Master must be allowed to deal with the above-stated matters first, as he supervises the first respondent.\n\nThe court ordered that the application be dismissed with costs, emphasising the need for future vigilance and cooperation among all parties involved in corporate rescues.\n\nThe judge said the issues before the Master are not issues the court should be called upon to determine in this application.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court of Zimbabwe has dismissed a contentious application to remove Cecil Madondo, the Corporate Rescue Practitioner (CRP) for MCA Venture Capital (Pvt) Ltd, signalling a victory for procedural integrity amid allegations of misconduct. The court’s judgment arose from an application filed by South African liquidators Lizanne Chantal Muller and Mari</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-denies-removal-of-top-corporate-rescue-practitioner-in-us600000-dispute/\">High Court denies removal of top corporate rescue practitioner in US$600,000 dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Charlie Kirk shooting: police search for suspect amid condemnation of ‘targeted’ killing",
            "url": "https://www.newzimbabwe.com/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing/",
            "content": "The Guardian\n\nAuthorities in the US were still searching for a suspect in the shooting of conservative activist Charlie Kirk, hours after the close ally ofDonald Trumpwas killed at a Utah university, sparking condemnation from both sides of politics and grave threats from the president.\n\nThis shooting is still an active investigation, theUtahdepartment of public safety said in a statement, adding it was working with the FBI and local police departments.\n\nTwo suspects were taken into custody, but subsequently released. The Governor of Utah, Spencer Cox, called it a political assassination, despite the motive and identity of the shooter remaining unclear.\n\nBeau Mason, the commissioner of Utahs department of public safety, said investigators were reviewing security camera images of the suspect, who wore dark clothing and possibly fired a longer distance shot from a roof.\n\nIn a video message from the Oval Office, Trump vowed that his administration would track down the suspect.\n\nMy administration will find each and every one of those who contributed to this atrocity and to other political violence, including the organisations that fund it and support it, Trump said.\n\nKirkwas shot while addressing a crowdof an estimated 3,000 people at Utah Valley University in Orem, near Salt Lake City. Video footage posted online showed Kirk being questioned by an audience member about gun violencein the moments before he was shot.\n\nVideo footage shows students scrambling to run from the sound of gunfire. Kirk was transported to a nearby hospital, where he later died, authorities said.\n\nLocal officials said the shooting was believed to be a targeted attack by a shooter from the roof of a building.\n\nHis death prompted outrage from Democrats and Republicans, while the president ordered flags to be lowered to half mast to honour him.\n\nThis is a dark day for our state. Its a tragic day for our nation, Cox, a Republican, said at a press conference, appealing for an end to the political violence.\n\nKirkwas the co-founder of Turning Point USA, the largest conservative youth organisation in the country which, played a key role in driving young voter support for Trump in November.\n\nHis appearances on podcasts and across social media brought him fame and notoriety, as he helped to amplify the presidents agenda. Kirk frequently attacked the mainstream media and engaged with culture-war issues around race, gender and immigration, often in a provocative style.\n\nThe event in Utah on Wednesday was the first in his American Comeback Tour at universities around the country. He often used such events, which typically drew large crowds of students, to invite attendees to debate him live.\n\nExperts have warned his death marks a watershed moment, with fears it could inflame an already fractured country and inspire more unrest.\n\nTrump, who routinely describes political rivals and others who stand in his way as radical left lunatics who pose an existential threat to the nation, decried violent political rhetoric in his statement on Wednesday night.\n\nViolence and murder are the tragic consequences of demonising those you disagree with  For years, those on the radical left have compared wonderful Americans like Charlie to Nazis and the worlds worst mass murderers and criminals, he said.\n\nPromising to crackdown on political violence, the president cited recent incidents including the attempts on his life last year, the killing of United Healthcare CEO Brian Thompson and the 2017 shooting of Republican congressman Steve Scalise.\n\nThe presidents list notably did not include violence against Democrats, such asthe murder of Melissa Hortman, a Minnesota state lawmaker, and her husband, or the attack on former House speakerNancy Pelosis husband.\n\nFormer president Barack Obama condemned political violence as despicable, while sending his prayers to Kirks wife and two young children. Joe Biden said there was no no place in our country for this kind of violence.\n\nHakeem Jeffries, the Democratic House minority leader, expressed a similar sentiment: Political violence of any kind and against any individual is unacceptable and completely incompatible with American values.\n\nOn Capitol Hill, an attempt to observe a moment of silence for Kirk on the floor of the House of Representatives degenerated into shouting and finger-pointing. Republican representative Anna Paulina Luna, who worked as Kirks director of Hispanic engagement at Turning Point USA yelled at Democrats, telling them You caused this!\n\nThat prompted Democratic representative Jahana Hayes, a leader on the gun violence prevention taskforce, to shout: Pass some gun laws!\n\nThe US is undergoing its most sustained period of political violence since the 1970s, according to data compiled by the Reuters news agency, which has documented more than 300 cases of politically motivated violent acts since supporters of Trump attacked the US Capitol on 6 January 6 2021.\n\nIn the first six months of the year, the US experienced about 150 politically motivated attacks, nearly twice as many as over the same period last year, Mike Jensen, a researcher at the University of Maryland, told Reuters.\n\nI think we are in a very, very dangerous spot right now that could quite easily escalate into more widespread civil unrest if we dont get a hold of it, Jensen said. This could absolutely serve as a kind of flashpoint that inspires more of it.\n\nWith Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/11071600/kirk-charlie.jpg",
            "description": "<p>The Guardian Authorities in the US were still searching for a suspect in the shooting of conservative activist Charlie Kirk, hours after the close ally of Donald Trump was killed at a Utah university, sparking condemnation from both sides of politics and grave threats from the president. “This shooting is still an active investigation,” the Utah department of public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing/\">Charlie Kirk shooting: police search for suspect amid condemnation of ‘targeted’ killing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Kaindu named Coach of the Month, Machope shines in players’ category",
            "url": "https://www.newzimbabwe.com/kaindu-named-coach-of-the-month-machope-shines-in-players-category/",
            "content": "By Sports Reporter\n\nDynamos coach Kelvin Kaindu has hit the ground running at Dembare, scooping the Premier Soccer League (PSL) Coach of the Month award for August.\n\nKaindu, who took charge at the end of July, enjoyed an unbeaten run throughout August, guiding Dynamos to both league and cup victories.\n\nThe Zambian gaffer began his tenure with a 1-0 league win over MWOS on August 2, before edging Yadah on penalties in the preliminary round of the Chibuku Super Cup just five days later. Dynamos then produced another strong performance in the first round of the same competition, beating Simba to book a quarter-final spot.\n\nIn league action, Kaindus side went on to defeat ZPC Kariba and Kwekwe, before closing the month with a thrilling 3-2 win against title contenders Scotland FC.\n\nMeanwhile, Scotland FC striker Tymon Machope was named Player of the Month after a sensational run of form that saw him score seven goals in August.\n\nMachopes exploits have pushed him to second place in the Golden Boot race, just one goal shy of Tel Ones Washington Navaya, who leads with 13 goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/12193425/KELVIN-KAINDU-10.gif",
            "description": "<p>By Sports Reporter Dynamos coach Kelvin Kaindu has hit the ground running at Dembare, scooping the Premier Soccer League (PSL) Coach of the Month award for August. Kaindu, who took charge at the end of July, enjoyed an unbeaten run throughout August, guiding Dynamos to both league and cup victories. The Zambian gaffer began his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaindu-named-coach-of-the-month-machope-shines-in-players-category/\">Kaindu named Coach of the Month, Machope shines in players’ category</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Inside Zimbabwe’s gold mines where men risk being buried alive for a few dollars",
            "url": "https://www.newzimbabwe.com/inside-zimbabwes-gold-mines-where-men-risk-being-buried-alive-for-a-few-dollars/",
            "content": "Metro UKs foreign correspondent Gergana Krasteva reports from Zimbabwe\n\nBeads of sweat drip down Gilbert Nuovus forehead as the memories of working inone of Zimbabwes gold minesrush back in.\n\nOver a year ago, the dad-of-two deserted his job after a colleague was killed when the walls of the pit caved in, burying him alive.\n\nA friend of mine died on the spot. I was afraid for my life, so I went back home, he tellsMetro.\n\nThe road into Matabeleland North, 150 miles from the city of Bulawayo, is uneven and thick with dust, but I am assured that it will eventually lead to a gold mine.\n\nIt is one of the many precious materials for which the land here has been exploited since before British colonial rule, with the first extractions made as early as the 14th century.\n\nAs our SUV crawls forward, a line of workers stretches along the footpath  boys barely into their teens and weathered men three times their age.\n\nMost are wearing the same faded blue overalls, and chipped shovels slung over their shoulders  a sign theyworkin one of the legal mines.\n\nMatabeleland North sits on some of the richest deposits of gold in Africa, and so is plagued with artisanal pits, which are not officially registered with thegovernment, making them illegal.\n\nYet, tens of thousands of men and women are forced into the trade due to unemployment, making up the majority of the mining workforce.\n\nGordon Sibanda used to be one of them.\n\nMetrospeaks with him at the Libeni PrimarySchool, where he volunteers as a chef to somehow contribute to the local community while searching for work.\n\nSitting on a wooden log and smoothing his cooking apron, he admits that poverty is what drove him to mining in 2001, when he was 39.\n\nHe says: A friend introduced me to the trade. Many of my friends are still in the pits to this day.\n\nMining is strenuous labor. You can spend months searching for a mineral you cannot see and do not know if it is actually in the earth.\n\nAnd when luck would fall on our side, you may get something.\n\nIn Zimbabwes mines, death never seems far.\n\nSo when I ask Gordon if any of his colleagues were injured or killed in the pits, he replies, almost nonchalantly, as he takes off his woolen beanie: Ah yes. Three have been killed when the mines collapsed.\n\nDisintegrated shafts, explosions, flooding  each shift carries the chance that a worker will not return home.\n\nAs many as 237 people died in incidents in 2023, making it one of the very worst years in the countrys mining history.\n\nAnd up until May this year, 59 fatal incidents were reported  most in illegal mines, like the one that Gordon worked in.\n\nTo fully comprehend the vast scale of illegal mining,Metrosits down with Pumulu Masu, government school inspector, who says that most people in Matabeleland North dig without a permit, which means the state does not profit from it.\n\nMostly, people in the area mine illegally, she explains. Lets say there is an agricultural field. Instead of a farm, they will turn it into a mine.\n\nEven in their personal properties  behind their homes  people start to dig.\n\nWe can always tell by the maps of soil. If people suspect there is gold, they will always dig no matter what the land is.\n\nWhile Gordon worked in an illegal pit, Gilbert has experience in a registered mine.\n\nTheir only piece of advice  what they want everyone to know  is do not do it, do not work in a mine, pointing to how deadly the trade is.\n\nGilbert says: The pit is not that strong as miners often dig tunnels [without much planning], making the walls weak.\n\nWe are not given helmets or boots to protect us. It is difficult to survive.\n\nThe work is just too much. In mines, there are no set working hours.You work and you stop when it is time to eat, then you go back to work. It is continuous, we do not stop.\n\nIn Zimbabwe, mining runs through generations like a vein of gold itself. It is often seen as a rite of passage for children as young as nine, and at the same time a lifeline for families in the depths of poverty.\n\nThough the pay is still meagre. All the money Gordon earned was spent on food for his large family, all 13 of them.\n\nAt the time, he was the sole breadwinner for his wife, three sons and three daughters, his own parents and siblings.\n\nHand to mouth, nothing else [is left], he adds, gesturing at his grandson, a four-year-old boy playing with his friends a few metres away.\n\nYet, despite facing unemployment, Gordon has not given mining another thought because of the precarious conditions.\n\nLike him, Gilbert also did not live a life of luxury  but he was under no such illusions when he picked up a shovel.\n\nAfter three months of digging, he was paid around $20, and only after gold was actually discovered. Miners divvy up half the proceeds, while the rest goes straight to the owners pocket.\n\nThere are other dangers too.\n\nThe industry has long been linked to human rights abuses, environmental violations and labour exploitation, particularly in lithium mines operated byChina, despite denials by Zimbabwes government. About 70% of all lithium is processed there.\n\nRobert Mugabes successor, president Emmerson Mnangagwa, of ZANU-PF, has so far supported the takeovers, arguing they will bring economic growth.\n\nPerhaps this has materialised in the capital, Harare; yet, on the ground, in Matabeleland North, the mines have brought little benefits  if any  to the local community.\n\nMetrogained access to Turk, one of the oldest gold mines in Zimbabwe, located in the Bubbi District.\n\nArmed security usually guard gold mines, but today luck has fallen on our side  at least for a few minutes.\n\nPiles of reddish earth and stones mount inside the compound. A dragline excavator in the distance seems to have dosed off, but only momentarily.\n\nThe mine itself gapes before us, an abyss carved so deep and wide that, when peering over the edge, the bottom is not visible.\n\nAcross the road from the pit, a supermarket and two bars stand shoulder to shoulder, their doors flung wide open. A few men have gathered around a plastic table, kicking dust with their feet as they chat.\n\nThis is the heart of what is accepted as the traditional mining community in Zimbabwe.\n\nThere are no clinics or schools, or in fact any other reliable infrastructure apart from the mine.\n\nBars are always the first to spring up whenever gold is unearthed, offering miners a place to unwind and spend their hard-earned cash in.\n\nAs I come to learn, this has also led to alcohol abuse among workers who use drinking as a coping mechanism.\n\nA source, who wished to remain anonymous, tellsMetro: You cannot put a figure on how many people have died because of it. Some have been found dead on pavements.\n\nWorkers deaths are often blamed on the rise in popularity of an illicit brew called krango, which can cause severe organ damage, and is associated with soaring rates of binge drinking.\n\nMy source explains that it is mostly made from ethanol concentrate diluted with large amounts of water, adding: Krango is what it is all about in rural areas. It is packed in bottles of 250ml.\n\nSanctions on Zimbabwe were first introduced in the early 2000s, mainly by the UK, the EU, and the US, amid allegations of human rights abuses, electoral fraud, and Robert Mugabes land reform programme.\n\nThese measures are not broad trade embargoes. They focus on asset freezes and travel bans on senior government officials linked to the state.\n\nThe US also brought out the Zimbabwe Democracy and Economic Recovery Act (ZDERA) in 2001, which restricted its access to international financial institutions.\n\nWhile the sanctions target political elites, the Zimbabwean government argues they have deterred foreign investment and limited lines of credit  so much so that the now vice president Constantino Chiwenga said the country had lost more than $150 billion.\n\nSome are even packed by legitimate companies. It is sold for just $0.50, and the strength is usually around 40% strength.\n\nDespite the reported issues plaguing Zimbabwes mines, the government is hellbent on expanding the industry  the faster, the better.\n\nFor a nation that fought so hard to rid itself from colonial rule, it now relies on investors from China, South Africa, Australia, Canada and the UK, and it is eager to attract more.\n\nThe sector as a whole accounts for more than 60% of export revenues and 13% of gross domestic product (GDP), according to national statistics from 2023.\n\nTo increase those numbers, the Zimbabwean government introduced the Vision 2030 plan to become an upper-middle-income economy by the end of the decade.\n\nSupposedly, one of the key objectives is to grow the mining sector to have a revenue of $12 billion per year.\n\nIt makes money, that is for sure, though not for the small miner like Gordon or Gilbert.\n\nThey are currently unemployed and living with the memories of the hell inside the mines.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10182619/gordon-sibanda.webp",
            "description": "<p>Metro UK’s foreign correspondent Gergana Krasteva reports from Zimbabwe Beads of sweat drip down Gilbert Nuovu’s forehead as the memories of working in one of Zimbabwe’s gold mines rush back in. Over a year ago, the dad-of-two deserted his job after a colleague was killed when the walls of the pit caved in, burying him alive. ‘A</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/inside-zimbabwes-gold-mines-where-men-risk-being-buried-alive-for-a-few-dollars/\">Inside Zimbabwe’s gold mines where men risk being buried alive for a few dollars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "11 Sep 2025"
        },
        {
            "title": "Polish and NATO forces scramble to shoot down Russian drones",
            "url": "https://www.newzimbabwe.com/polish-and-nato-forces-scramble-to-shoot-down-russian-drones/",
            "content": "Al Jazeera\n\nPolish and NATO forces have shot down drones violating the countrys airspace during a Russian aerial attack on neighbouring Ukraine.\n\nFighter jets were scrambled early on Wednesday as more than a dozen drones entered Polish airspace, the Polish military said. It is the first time that Polish and NATO forces have become engaged in the conflict. Ukraine said Russia is testing the West.\n\nDuring todays attack by the Russian Federation on targets in Ukraine, our airspace was repeatedly violated by drones, the Operational Command of the Polish military said in a statement.\n\nAt the request of the Operational Commander of the Armed Forces, weapons have been used, and operations are under way to locate the downed targets, the military said.\n\nThe army said Polish and NATO military aircraft were mobilised to ensure airspace safety.\n\nPolish and allied aircraft are operating in our airspace, while ground-based air defence and radar reconnaissance systems have been brought to the highest state of readiness, the Operational Command said.\n\nPolish Prime Minister Donald Tusk confirmed that an operation is under way related to multiple violations of Polish airspace.\n\nTrwa operacja zwizana z wielokrotnym naruszeniem polskiej przestrzeni powietrznej. Przeciwko obiektom wojsko uyo uzbrojenia. Jestem w staym kontakcie z Prezydentem i Ministrem Obrony. Odebraem bezporedni meldunek od dowdcy operacyjnego.\n\n Donald Tusk (@donaldtusk)September 10, 2025\n\nTranslation: An operation is under way related to multiple violations of Polish airspace. The military used armaments against the objects. I am in constant contact with the president and the minister of defence. I received a direct report from the operational commander.\n\nAn operation was also conducted to collect debris from the drones.\n\nA drone or similar object struck a residential building in Wyryki in eastern Poland, but nobody was injured, its mayor told the state-run news channel TVP Info. Footage showed a house with a damaged roof and the rafters showing.\n\nPolice in the Lublin region said they found a damaged drone in the village of Czosnowka while drone debris was also reported in the town of Czesniki.\n\nTusk confirmed that the drones originated from Russia. We are dealing with a large-scale provocation, the prime minister said.\n\nMoscow appeared to distance itself from the incident. The Russian Ministry of Defence said its drones had struck military facilities in western Ukraine but there were no plans to target sites in Poland.\n\nEarlier, Kremlin spokesperson Dmitry Peskov said the European Union and NATO accuse Russia of provocations on a daily basis, most of the time without even trying to present at least some kind of argument.\n\nTusk said he was in constant contact with NATO Secretary-General Mark Rutte. An emergency meeting of the Polish Council of Ministers was called for Wednesday.\n\nAircraft have used weapons against hostile objects, Defence Minister Wladyslaw Kosiniak-Kamysz said on social media, adding: We are in constant contact with NATO command.\n\nUkraines foreign minister said on Wednesday that the events show Russian President Vladimir Putins impunity and his expansion of the war and added that Moscow is testing the Wests willingness to respond to aggression.\n\nPutin just keeps escalating, expanding his war, and testing the West, Andrii Sybiha said on X.\n\nThis situation shows that finally the decision needs to be taken to enable partner air defence capabilities in neighbouring countries to be used to intercept drones and missiles in the Ukrainian airspace, including those approaching NATO borders.\n\nPresident Volodymyr Zelenskyy said eight Russian drones had been aimed toward Poland, and called the episode an extremely dangerous precedent for Europe.\n\nEU Defence Commissioner Andrius Kubilius called for the EU to develop a drone wall along its eastern flank.\n\nOnce again Russia tests frontier states, EU & NATO, Kubilius wrote in a post on social media. We shall work together with Member States, frontier countries and Ukraine. Russia will be stopped.\n\nRussias war is escalating, not ending. We must raise the cost on Moscow, strengthen support for Ukraine, and invest in Europes defence. The EU plays a major role and we will support initiatives like the Eastern Border Shield defence line, the EUs top diplomat, Kaja Kallas, wrote on social media.\n\nThe United States also questioned Moscows intentions after the incident with President Donald Trump weighing in on Truth Social: Whats with Russia violating Polands airspace with drones? Here we go!\n\nFour airports in Poland, including Chopin Airport in Warsaw, were closed due to military activity late on Tuesday.\n\nAccording to notices posted on the US Federal Aviation Administrations website, the other airports closed were Rzeszow-Jasionka Airport, Warsaw Modlin Airport and Lublin Airport.\n\nChopin Airport confirmed later in a post on social media that airspace over parts of Poland, including over the airport, had been closed temporarily due to the actions of state services and the military to ensure safety.\n\nPassengers whose travel plans were disrupted were asked to monitor airlines and official government announcements for updates.\n\nEarly on Wednesday, all of the airports save for Lublin, which is close to the border with Ukraine, reopened.\n\nWany komunikat dla pasaerw korzystajcych z@ChopinAirport.pic.twitter.com/kN1W7dFSLx\n\n Chopin Airport, WAW (@ChopinAirport)September 10, 2025\n\nThe military mobilisation in Poland came after Ukraines air force reported that Russian drones had entered Polish airspace, posing a threat to the city of Zamosc, but the air force later removed the statement from its Telegram messaging app.\n\nMost of Ukraine, including the western regions of Volyn and Lviv, which border Poland, were under air raid alerts for several hours overnight, according to Ukraines air force data.\n\nPoland said earlier that it planned to close its border with Belarus at midnight on Thursday (22:00 GMT on Wednesday) due to Russian-led military exercises scheduled to take place in Belarus.\n\nRussia and Belaruss large-scale military exercises, known as the Zapad drills, have raised security concerns in neighbouring Poland, Lithuania and Latvia, all NATO member states. The Zapad-2025 (West-2025) drills will be held in western Russia and Belarus from Friday.\n\nAsked about the duration of the border closure, Polish Minister of Interior Marcin Kierwinski said the border would only be reopened when the government was sure there was no more threat to Polish citizens.\n\nThe Belarusian Ministry of Foreign Affairs said it had summoned the Polish charge daffaires to complain about the border closure, which it said caused significant difficulties.\n\nIt described Polands move as an abuse of its geographical position.\n\nThe temporary suspension of passage indicates rather an intention to conceal ones own actions than the existence of any threat from Belarus, the Foreign Ministry said.\n\nLithuanias border guard said on Tuesday that the protection of its border with Belarus and Russia would be strengthened due to the exercises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10194534/polish-air-force.webp",
            "description": "<p>Al Jazeera Polish and NATO forces have shot down drones violating the country’s airspace during a Russian aerial attack on neighbouring Ukraine. Fighter jets were scrambled early on Wednesday as more than a dozen drones entered Polish airspace, the Polish military said. It is the first time that Polish and NATO forces have become engaged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polish-and-nato-forces-scramble-to-shoot-down-russian-drones/\">Polish and NATO forces scramble to shoot down Russian drones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "11 Sep 2025"
        }
    ]
}