{
    "news": [
        {
            "title": "Bombing of Job Sikhala’s house raises fears of renewed attacks targeting Zanu PF critics",
            "url": "https://www.newzimbabwe.com/bombing-of-job-sikhalas-house-raises-fears-of-renewed-attacks-targeting-zanu-pf-critics/",
            "content": "By Staff Reporter\n\nHUMAN rights defenders have criticised the recent bombing of opposition leader Job Sikhalas Chitungwiza home, amid fears of a renewed wave of raids on properties linked to exiled Zimbabweans.\n\nThe alleged bombing of Sikhalas house while he was away in South Africa raises the spectre of a fresh campaign of political persecution, says human rights activist Munacho Humbasha.\n\nHe says the attack on Sikhalas house is a chilling message to critics of Zanu PF, both at home and abroad.\n\nSikhala, a former legislator and long-time government critic, has been frequenting South Africa for medical and political engagements.\n\nHumbasha told NewZimbabwe.com that Zanu PF functionaries and State security agents have openly declared war on activists in the diaspora, with families back home being deliberately targeted.\n\nThose with houses visited in the widening campaign and searches include that of Petty Ziramba, Panganayi Mauzinyu, Ralph Dube, Fransisca Chiduku, and Shepherd Yuda, said Humbasha.\n\nIn Mabvuku, unknown men believed to be State agents raided the home of the late opposition activist Tonderai Ndira. The assailants took household property and left the house empty, promising to return and destroy their livelihoods. The family is still in shock.\n\nIn Harare, suspected operatives broke into Blessing Makeyis house and again into his family home, allegedly searching for incriminating material. Makevi has been active in diaspora protests against President Emmerson Mnangagwas government, Humbasha told NewZimbabwe.com in an interview.\n\nAlso, another dissenter, Ralph Dubes family, is living in uncertainty after receiving threatening messages, says Humbasha.\n\nBack home, he further claimed, several homes in Seke, Chitungwiza, having been visited by suspicious individuals in recent days, thereby sparking fears in the community.\n\nDespite repeated reports of break-ins and intimidation, police have not arrested anyone in connection with the incidents. Efforts to get a comment from police national spokesman, Commissioner Paul Nyathi, were fruitless by the time of publishing.\n\nVictims and their families say the inaction points to the States complicity.\n\nThis is meant to punish those of us who are in the UK and elsewhere. Our families are being harassed everyday because we speak out, said UK-based activist, Melody Magejo, who spoke to NewZimbabwe.com in a telephone interview.\n\nA human rights lawyer, who preferred anonymity, said as Mnangagwa gravitates towards entrenching his rule through his 2030 agenda, the political environment is set to worsen.\n\nThe use of Patriotic Act and Cyber Security Act 2023 will lead to many arrests of those who are actively participating in campaigns on social media.\n\nIt is without a doubt that Mnangagwas government does not want the outside world to know what is happening in the country, said the lawyer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Staff Reporter HUMAN rights defenders have criticised the recent bombing of opposition leader Job Sikhala’s Chitungwiza home, amid fears of a renewed wave of raids on properties linked to exiled Zimbabweans. The alleged bombing of Sikhala’s house while he was away in South Africa raises the spectre of a fresh campaign of political persecution,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bombing-of-job-sikhalas-house-raises-fears-of-renewed-attacks-targeting-zanu-pf-critics/\">Bombing of Job Sikhala’s house raises fears of renewed attacks targeting Zanu PF critics</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "03 Sep 2025"
        },
        {
            "title": "Zanu PF, Tshabangu share US$3.6 million in political parties finances",
            "url": "https://www.newzimbabwe.com/zanu-pf-tshabangu-share-us3-6-million-in-political-parties-finances/",
            "content": "By Leopold Munhende\n\nZANU PF will get ZW$102,343,972.50 of this years ZW$147,682,500 political parties financing purse, Justice Minister Ziyambi Ziyambi has said.\n\nThe ruling partys opposite number, the Citizens Coalition for Change (CCC), headed by controversial politician Sengezo Tshabangu, will get ZW$45,338,527, which is about US$1,133,463 on the informal market.\n\nZanu PF claimed 69.3% of the 2023 vote against CCCs 30.7%.\n\nThe percentage is what is used as per the Political Parties (Finance) Act to determine how much parties that exceed the 5% threshold are paid by the state.\n\nWith firebrand politician Nelson Chamisa having been forced out of the CCC, Tshabangu and other senior members will, as has become the norm, determine the fate of the millions.\n\nTshabangus role as leader of opposition in Parliament has been questioned since taking over the party.\n\nWords of support to President Emmerson Mnangagwa after a visit to his Precabe Farm in Kwekwe were used by analysts as evidence that he had either been bought or was a willing participant in the demise of the promising opposition party.\n\nLeft with very few loyalists in Parliament after many were recalled by Tshabangu, CCC opposition figures backing Chamisa have been left powerless.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14142859/Tshabangu-ED-e1736865004886.webp",
            "description": "<p>By Leopold Munhende ZANU PF will get ZW$102,343,972.50 of this year’s ZW$147,682,500 political parties financing purse, Justice Minister Ziyambi Ziyambi has said. The ruling party’s “opposite number,” the Citizens Coalition for Change (CCC), headed by controversial politician Sengezo Tshabangu, will get ZW$45,338,527, which is about US$1,133,463 on the informal market. Zanu PF claimed 69.3% of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-tshabangu-share-us3-6-million-in-political-parties-finances/\">Zanu PF, Tshabangu share US$3.6 million in political parties finances</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "03 Sep 2025"
        },
        {
            "title": "South Africa: Civil society pushes for urgent clarity on Zimbabwean permits",
            "url": "https://www.newzimbabwe.com/south-africa-civil-society-pushes-for-urgent-clarity-on-zimbabwean-permits/",
            "content": "The South African\n\nThe Helen Suzman Foundation (HSF) and the Consortium for Refugees and Migrants in South Africa (CoRMSA) have called on the government to urgently clarify the future of the Zimbabwean Exemption Permit (ZEP), which is due to expire in November 2025.\n\nIn a joint statement, the two organisations said thousands of Zimbabwean permit holders remain in the dark about how the court-ordered consultation process will unfold, or whether theMinister of Home Affairs plansto extend the permit.\n\nThey warned that last years last-minute extension had already left families in limbo, and that this years silence is making matters worse. The lack of clarity is creating devastating consequences, they said.\n\nAccording to HSF and CoRMSA, many Zimbabweans on the permit have already lost jobs, struggled to enrol their children for the 2026 school year, and faced difficulties accessing basic healthcare. They argue that these hardships show why the government must act well before the November deadline.\n\nHSF and CoRMSA call on the Minister of Home Affairs to urgently provide clarity on the status of the consultation process, theorganisations insisted.\n\nIf the process cannot be implemented in time, government must extend the ZEP well before the November deadline. Such action is necessary to prevent further hardship and to uphold fairness and the rule of law.\n\nThe ZEP, first introduced in 2009 to regularise the stay of Zimbabweans in South Africa, has faced years of uncertainty.\n\nA June 2023 High Court ruling ordered the Department of Home Affairs to ensure a fair process before terminating the programme, a decision later confirmed by the Constitutional Court.\n\nAs a result, the permit remains valid until late November 2025.\n\nBut with only months left before that deadline, rights groups warn that the clock is ticking and that delay is once again throwing thousands of lives into chaos.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>The South African The Helen Suzman Foundation (HSF) and the Consortium for Refugees and Migrants in South Africa (CoRMSA) have called on the government to urgently clarify the future of the Zimbabwean Exemption Permit (ZEP), which is due to expire in November 2025. ZEP holders left in the dark In a joint statement, the two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-civil-society-pushes-for-urgent-clarity-on-zimbabwean-permits/\">South Africa: Civil society pushes for urgent clarity on Zimbabwean permits</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "03 Sep 2025"
        },
        {
            "title": "Burkina Faso’s parliament votes to outlaw homosexual acts",
            "url": "https://www.newzimbabwe.com/burkina-fasos-parliament-votes-to-outlaw-homosexual-acts/",
            "content": "BBC\n\nBurkina Fasos unelected transitional parliament has passed a bill banning homosexual acts, a little over a year after a draft of an amended family code that criminalised homosexuality was adopted by the countrys cabinet.\n\nThe new measure unanimously voted through on Monday imposes punishments of up to five years in jail, and has become part of a broader crackdown on same-sex relationships across the continent.\n\nJustice Minister Edasso Rodrigue Bayala announced onstate-run mediathat, the law provides for a prison sentence of between two and five years as well as fines.\n\nHe added that foreign nationals caught breaking the law would also be deported.\n\nThe next step for the legislation is obtaining the signature of the countrys military leader Capt Ibrahim Traor, the Reuters news agency reports.\n\nCapt Traor seized power in 2022, after forcing another military ruler, Lt Col Paul-Henri Damiba, from office.\n\nThe Sahel nation had previously been among just 22 out of 54 African countries that allowed same-sex relations, which are punishable by death or lengthy prison terms in some states.\n\nAfter gaining independence from France in 1960, Burkina Faso did not inherit anti-homosexuality laws unlike Britains former colonies on the continent.\n\nThe country is socially conservative and religious with less than 10% of people thought to not follow any faith at all.\n\nBurkina Fasos new law is in keeping with increasing crackdowns on LGBT relationships across the continent.\n\nLast year, neighbouring Mali, an ally of Burkina Faso and also ruled by a junta, adopted legislation criminalising homosexuality.\n\nThere has been significant backlash and criticism against countries that have toughened their anti-gay stance in recent years, including from the World Bank that had put in place a ban on loaning money to Uganda due to their anti-LGBT stance.\n\nThe ban has since been lifted.\n\nNigeria is also among the countries on the continent that have enacted laws banning homosexuality. Ghanas parliament passed an anti-homosexuality bill last year, but the then-president did not sign it into law.\n\nOf all the countries, Uganda adopted the toughest provisions, making what it describes as aggravated homosexuality a capital offense and imposing life sentences for consensual same-sex relations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17174007/traore.webp",
            "description": "<p>BBC Burkina Faso’s unelected transitional parliament has passed a bill banning homosexual acts, a little over a year after a draft of an amended family code that criminalised homosexuality was adopted by the country’s cabinet. The new measure unanimously voted through on Monday imposes punishments of up to five years in jail, and has become</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/burkina-fasos-parliament-votes-to-outlaw-homosexual-acts/\">Burkina Faso’s parliament votes to outlaw homosexual acts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "03 Sep 2025"
        },
        {
            "title": "Zimbabwe advances $533 million railway deal with China",
            "url": "https://www.newzimbabwe.com/zimbabwe-advances-533-million-railway-deal-with-china/",
            "content": "Report Focus News\n\nZimbabwe President Emmerson Mnangagwa met China Railway International Group executives Tuesday to finalise a $533 million infrastructure deal aimed at revitalizing the southern African nations deteriorating rail network.\n\nThe discussions focused on Zimbabwes digital future, including expanding investment in ICT talent, strengthening infrastructure, and introducing advanced technologies into the country. The meeting occurred as Mnangagwa arrived in Beijing to attend Wednesdays commemoration of the 80th anniversary of Japans World War Two surrender.\n\nFinance Minister Mthuli Ncube confirmed the investment value during earlier negotiations. We believe that we could make use of their expertise and financial muscle to improve the NRZ, Finance Minister Mthuli Ncube said in a weekend interview.\n\nThe deal involves TransTech Engineering Corporation, a China Railway International Group subsidiary with extensive African infrastructure experience. The company previously built the 1,860-kilometer Tanzania-Zambia railway and Ethiopias Addis Ababa-Djibouti line.\n\nZimbabwes rail network has declined sharply from its 1990s peak when it transported 12 million tons annually. National Railways of Zimbabwe (NRZ) now hauls less than three million tons.\n\nThe infrastructure deterioration has severely impacted mineral exports, particularly from Chinese mining operations. Companies including Tsingshan Holdings, Sinosteel and Zhejiang Huayou Cobalt face transportation constraints moving lithium, chrome and coal to ports.\n\nThe modernization project includes rehabilitation of existing lines, new signaling systems, acquisition of 17 locomotives and 209 freight wagons. Additionally, NRZ is exploring a partnership with the University of Zimbabwe to develop railway solutions through the universitys innovation hub.\n\nPhase one encompasses five new stations and a critical Beitbridge-Harare line connecting to South Africa, Zimbabwes largest trading partner.\n\nZimbabwe is on the verge of clinching a deal with the Chinese Railway Group so work on this critical enabler starts, presidential spokesman George Charamba said in Beijing.\n\nNRZ Public Relations and Stakeholder Manager Andrew Kunambura confirmed that the feasibility study has been completed and a report will be presented.\n\nThe project forms part of Zimbabwes broader rail strategy involving 11 private companies. South Africas Grindrod deployed three locomotives and 150 wagons through its Beitbridge Bulawayo Railway subsidiary since March 2024.\n\nChina remains Zimbabwes largest investor with total investments exceeding $4.4 billion. In 2024 alone, trade between the two countries reached US$3.8 billion  a 24% increase from the previous year.\n\nThe railway investment addresses Zimbabwes push to achieve its $12 billion mining industry target by improving mineral transport to Mozambique and South African ports for Asian markets.\n\nFunding mechanisms remain undisclosed, though analysts expect Chinese loans and contractor financing arrangements, adding to Zimbabwes existing debt obligations to Chinese entities.\n\nThe formal announcement was initially planned for the Forum on China-Africa Cooperation in August but has been delayed pending final negotiations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/02200032/ed-china.webp",
            "description": "<p>Report Focus News Zimbabwe President Emmerson Mnangagwa met China Railway International Group executives Tuesday to finalise a $533 million infrastructure deal aimed at revitalizing the southern African nation’s deteriorating rail network. The discussions focused on Zimbabwe’s digital future, including expanding investment in ICT talent, strengthening infrastructure, and introducing advanced technologies into the country. The meeting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-advances-533-million-railway-deal-with-china/\">Zimbabwe advances $533 million railway deal with China</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "03 Sep 2025"
        }
    ]
}