{
    "news": [
        {
            "title": "CCC youths unleash violence at late MP’s funeral, damage MDC-T president Mwonzora’s car",
            "url": "https://www.newzimbabwe.com/ccc-youths-unleash-violence-at-late-mps-funeral-damage-mdc-t-president-mwonzoras-car/",
            "content": "By Staff Reporter\n\nCITIZENS Coalitions for Change (CCC) Welshman Ncube faction has condemned the violence that ensued at a legislators funeral in Glen View South over the weekend.\n\nThe attacks occured during the funeral of CCC Glen View South Member of Parliament Grandmore Hakata (56), who died last week due to diabetes complications.\n\nMDC-T leader, Douglas Mwonzoras vehicle was allegedly damaged whilst a member of his political party, Preston Mwabaya, was seriously injured in the skirmishes and is reportedly admitted in the lntensive Care Unit (ICU) at a local hospital.\n\nScreengrab from a video circulating showing CCC youths heckling Mwonzora as he leaves the funeral venue\n\nIn a statement this Sunday, CCC Ncube faction spokesperson Willias Madzimure condemned the violence, accusing former CCC leader Nelson Chamisa of causing the mayhem.\n\nThe Citizens Coalition for Change (CCC) condemns in the strongest terms the violence that erupted at the funeral of our beloved member, Hon. Hakata, who was a loyal member of the CCC led by Prof. Welshman Ncube. Hon Hakata had stood firm in his principles and refused to resign from Parliament when ordered to do so by Hon Nelson Chamisa.\n\nWe are deeply disturbed by the actions of certain individuals who sought to disrupt the peaceful proceedings and cause harm to innocent mourners.\n\nAmong those who were attacked and harassed by the perpetrators were Hon. Matsunga, Hon. P. Chitimbe, Hon. Musarurwa, and Hon. Madzimure, all of whom were present to pay their respects to the deceased.\n\nWe are disappointed that Hon. Nelson Chamisa, when he addressed his supporters and the mourners, failed to condemn the violence. As a leader, it is imperative to promote peace and stability, and we expect more from those who aspire to lead our nation, Madzimure said.\n\nHe said his party was outraged by the attack on Senator Mwonzora, the president of MDC-T party, and the damage to his vehicle and called on law enforcement agents to deal with perpetrators.\n\nThis blatant display of thuggery and intimidation is a clear indication of the lack of leadership and accountability within Hon Nelson Chamisas camp.\n\nAs a party, we value the principles of peace, tolerance, and respect for human life. We urge all our supporters and members to remain calm and peaceful, even in the face of provocation.\n\nWe call upon the authorities to investigate the violence and bring the perpetrators to justice. We also urge all Zimbabweans to promote a culture of peace, tolerance, and respect for human life, added Madzimure.\n\nAccording to witnesses and opposition members who attended the funeral, some of the youths involved in the attacks were visibly drunk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/05055436/douglas-mwonzora.jpg",
            "description": "<p>By Staff Reporter CITIZENS Coalitions for Change (CCC) Welshman Ncube faction has condemned the violence that ensued at a legislator’s funeral in Glen View South over the weekend. The attacks occured during the funeral of CCC Glen View South Member of Parliament Grandmore Hakata (56), who died last week due to diabetes complications. MDC-T leader,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-youths-unleash-violence-at-late-mps-funeral-damage-mdc-t-president-mwonzoras-car/\">CCC youths unleash violence at late MP’s funeral, damage MDC-T president Mwonzora’s car</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "New brooms: Newly elected ZIFA board full list",
            "url": "https://www.newzimbabwe.com/new-brooms-newly-elected-zifa-board-full-list/",
            "content": "By Staff Reporter\n\nSATURDAY January 25, 2025, marked a fresh chapter in Zimbabwean football following the election of a new Zimbabwe Football Association (ZIFA) executive board, led by president Nqobile Magwizi.\n\nThe previous controversy-ridden board led by Felton Kamambo was dissolved in November 2021 by FIFA and Zimbabwe banned from participating in international matches.\n\nFurther, the nation was placed under the administration of a caretaker Normalisation Committee led by Lincoln Mutasa since June 2023.\n\nThe much-hyped ZIFA board elections, which dominated media space in the past weeks, were finally held at a Harare hotel, where Magwizi emerged the biggest winner, amassing an unassailable 80 percent of the votes to land the presidency. A total 77 councillors voted.\n\nPresidential aspirants Phillemon Machana, Twine Phiri, Marshal Gore and Makwinji Phiri fell by the wayside in embarrassing fashion, all gathering less than 10 votes each.\n\nOne of the front-runners before the election, Martin Kweza withdrew his candidature just before the election citing personal reasons although it later turned out he had been selected for another plum post as board member at the Zimbabwe Broadcasting Corporation (ZBC).\n\nHereunder is the full list of the new ZIFA board;\n\nPresident  Nqobile Magwizi\n\nVice President Loveness Mukura\n\nVice President  Kenny Ndebele\n\nBoard members;\n\nAlice Zeure\n\nTafadzwa Benza\n\nDavison Muchena\n\nThomas Marambanyika\n\nBrighton Ushendibaba\n\nKudzai Kadzombe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26075612/magwizi-secures-landslide-victory-in-zifa-presidential-election.webp",
            "description": "<p>By Staff Reporter  SATURDAY January 25, 2025, marked a fresh chapter in Zimbabwean football following the election of a new Zimbabwe Football Association (ZIFA) executive board, led by president Nqobile Magwizi. The previous controversy-ridden board led by Felton Kamambo was dissolved in November 2021 by FIFA and Zimbabwe banned from participating in international matches. Further,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-brooms-newly-elected-zifa-board-full-list/\">New brooms: Newly elected ZIFA board full list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "‘I’m even embarrassed’: Actor Luthuli Dlamini opens up on his return to Zimbabwe",
            "url": "https://www.newzimbabwe.com/im-even-embarrassed-luthuli-dlamini-opens-up-on-his-return-to-zimbabwe/",
            "content": "By The South African\n\nRENOWNED Zimbabwean-born actor Luthuli Dlamini, a household name in South Africas entertainment industry, has made headlines following his recent return to his home country.\n\nIn an interview with The Chronicle, a Zimbabwean newspaper, Dlamini candidly admitted feeling embarrassed about how long he had been away but expressed excitement about reconnecting with his roots and rediscovering Zimbabwes creative scene. Dlamini returned to Zimbabwe after two decades.\n\nWill Luthuli Dlamini Return to Soapie Stardom?\n\nFans of the charismatic actor have been eager to know if Dlamini plans to grace television screens in a soapie again.\n\nHis response was characteristically playful: Yes, no, definitely, well . . . look, I dont know. The space Im currently in and have always been in is that I will work until the day I die, doing what I love doing.\n\nWhile he left his intentions ambiguous, his passion for acting remains undeniable.\n\nLuthuli Dlaminis Most Cherished Role\n\nAlthough many fans associate Dlamini with his iconic portrayal of Stan Nyathi, he revealed that his most cherished role is one that might surprise many.\n\nIt would be the role of Christopher in a stage play I did at the Liberty Theatre on Mandela Square in Sandton. This is because the play was based on an award-winning book in London that I had never read before.\n\nWhen I was offered the role, I was drawn to it because it was challenging and complex. It was a lovely piece for all of us. I understand why he won the award because it was a lovely piece, he shared.\n\nA Humble Homecoming\n\nReflecting on his long absence from Zimbabwe, Dlamini admitted: Im even embarrassed that its been this long since I was away. I need to come back and reacquaint myself with the scene. Theres a lot I have to learn and see.\n\nA New Chapter for Zimbabwes Film and Arts Scene?\n\nDlamini, celebrated for his role as Stan Nyathi in the popular eTV soapie Scandal, expressed admiration for the untapped potential in Zimbabwes arts and film industries.\n\nEver since Ive been here, Ive seen a lot of potential within the film sector and other facets of art. As I was watching a play at the Bulawayo Theatre, I could see how invested these young ones are. Theres so much more we could do to help them, he told The Chronicle.\n\nThe actors observations highlight a deep appreciation for the talent and dedication of local artists.\n\nDlamini hinted at a personal desire to contribute to the industrys growth, potentially signaling exciting collaborations and mentorship opportunities in the future.\n\nFrom Rumours to Reality\n\nDlaminis return to Zimbabwe has not been without speculation. Reports of alleged hardships, including homelessness in Johannesburg, dominated headlines in recent months.\n\nImages of the actor with his family showcase moments of connection. Reports of his involvement in new projects highlight a sense of renewal and purpose.\n\nThe actors return to Zimbabwe highlights the potential of the countrys creative industries. Whether through acting, mentorship, or advocacy, his influence is poised to leave an indelible mark.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26070349/Luthuli-Dlamini-Content-Creation-young-actors-1.jpg.webp",
            "description": "<p>By The South African  RENOWNED Zimbabwean-born actor Luthuli Dlamini, a household name in South Africa’s entertainment industry, has made headlines following his recent return to his home country. In an interview with The Chronicle, a Zimbabwean newspaper, Dlamini candidly admitted feeling embarrassed about how long he had been away but expressed excitement about reconnecting with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/im-even-embarrassed-luthuli-dlamini-opens-up-on-his-return-to-zimbabwe/\">‘I’m even embarrassed’: Actor Luthuli Dlamini opens up on his return to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Chamisa rebukes Zanu PF for ‘baffling’ plot to extend Mnangagwa incumbency amidst service delivery collapse",
            "url": "https://www.newzimbabwe.com/chamisa-rebukes-zanu-pf-for-baffling-plot-to-extend-mnangagwa-incumbency-amidst-service-delivery-collapse/",
            "content": "By Staff Reporter\n\nFORMER Citizens Coalition for Change (CCC) leader, Nelson Chamisa has taken aim at President Emmerson Mnangagwa for plotting to use a Zanu PF faction to push his stay in office beyond 2028.\n\nMnangagwa, first elected in 2018 following a coup the previous year, completes his constitutionally permissible second term in 2028 but some Zanu PF elements are urging him to hang on, ostensibly to complete unfinished developmental projects.\n\nSpeaking in his cryptic fashion during the funeral of Glenview South Member of Parliament (MP) Grandmore Hakata in Harare Saturday, Chamisa said, in apparent reference to Mnangagwa, bad governance resulting in collapsing infrastructure and poor service delivery is endemic in society, but he shockingly wanted a term extension.\n\nChinonzi mumiriri kugara nevanhu, kutaura nevanhu, kufamba nevanhu, kubuda muvanhu, uchidzokera muvanhu, uchitaura zvevanhu, usingakanganwi vanhu, usingarasi vanhu.\n\nNdaona migwagwa, ndokubva ndaona masewage ndokubva nadaona zvitoro, zvose zvaparara. Ndokubva ndabvunza kuti nhaiwe? Zvaunotaura, nekuparadza kwawaita unoti woda kuenda kuseri kwegomo nekuparadza kwawaita. Unoda kuendepi?\n\nChamisa urged opposition activists to defend virtues Hakata stood for to improve citizens welfare.\n\nThe late MP, a Chamisa loyalist, rose to prominence following his widely reported arrest a few days before the 2023 general elections for allegedly holding a car rally. He won the elections while in prison anyway, only to be released after the polls.\n\nChamisa, a lawyer-cum-politician, who quit as CCC president citing infiltration by Zanu PF, has hinted at a comeback, urging his supporters to remain steadfast in the wake of machinations to decimate alternative voices.\n\nThe charismatic 47-year-old opposition leader was cheered by mourners as he announced Mnangagwas exit was coming soon, stating he who says l am not going, is already gone.\n\nAddressing the same gathering, firebrand opposition activist and former legislator, Gift Ostallos Siziba said those opposed to Zanu PF are the majority hence must resist the term extension, which is expected to come into effect through constitutional amendments and referendums.\n\nWe are the majority, and we wont accept the 2030 agendayou cannot extend a stolen mandate.\n\nMnangagwa has no mandate to remain in office beyond 2028. The 2023 (disputed election result) has to be resolved before we talk about 2028the person elected by the people was Advocate Nelson Chamisa, said Siziba.\n\nHe said Zanu PF was using United States dollars to buy the allegiance of some sellout CCC members, a carrot that Hakata resisted and stayed loyal to the struggle for a democratic country.\n\nDespite Mnangagwa spurning overtures to extend his term courtesy of a party resolution now dubbed Resolution#1 at last years Zanu PF National Peoples Conference in Bulawayo arguing he is a constitutionalist, he is rumoured to be sponsoring factionalists pushing the 2030 agenda.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/26005003/Chamisa.jpg",
            "description": "<p>By Staff Reporter  FORMER Citizens’ Coalition for Change (CCC) leader, Nelson Chamisa has taken aim at President Emmerson Mnangagwa for plotting to use a Zanu PF faction to push his stay in office beyond 2028. Mnangagwa, first elected in 2018 following a coup the previous year, completes his constitutionally permissible second term in 2028 but</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chamisa-rebukes-zanu-pf-for-baffling-plot-to-extend-mnangagwa-incumbency-amidst-service-delivery-collapse/\">Chamisa rebukes Zanu PF for ‘baffling’ plot to extend Mnangagwa incumbency amidst service delivery collapse </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Living under oppression: A Biblical perspective",
            "url": "https://www.newzimbabwe.com/living-under-oppression-a-biblical-perspective/",
            "content": "SUNDAY MORNING TABLET\n\nText: Psalm 37:1-7, Romans 13:1-7, 1 Peter 2:13-17\n\nDear brothers and sisters in Christ,\n\nLiving under a dictatorship government can be challenging and frustrating. It is easy to feel helpless and powerless when faced with oppression and injustice.\n\nHowever, as Christians, we are called to live differently, even in the midst of adversity.\n\nIn Psalm 37:1-7, David encourages us not to fret or be envious of those who do evil. Instead, we are to trust in the Lord, do good, and dwell in the land.\n\nThis means that we should focus on living a life that honours God, even when our circumstances are difficult.\n\nIn Romans 13:1-7, Paul reminds us that all authority comes from God. While this doesnt mean that we should blindly obey unjust rulers, it does mean that we should respect the authority that God has established. We can do this by praying for our leaders, paying taxes, and obeying laws that dont contradict Gods Word.\n\nIn 1 Peter 2:13-17, Peter encourages us to submit to every human authority for the Lords sake.\n\nThis doesnt mean that we should compromise our values or principles, but rather that we should live in a way that honours God, even when we disagree with those in authority.\n\nSo, how can we live under a dictatorship government in a way that honours God? Here are a few suggestions:\n\n1. Pray for your leaders, even if you disagree with them. (1 Timothy 2:1-4)\n\n2. Respect the authority that God has established, while also standing up for justice and righteousness. (Romans 13:1-7)\n\n3. Focus on living a life that honours God, rather than GETTING bogged down in politics. (Psalm 37:1-7)\n\n4. Support and encourage one another, especially those who are suffering under oppression. (Galatians 6:2)\n\nPRAYER\n\nDear Heavenly Father,\n\nWe come before you today, praying for our brothers and sisters who are living under dictatorship governments in Africa.\n\nWe ask that you give them wisdom and discernment as they navigate these challenging circumstances.\n\nWe pray that you would protect them from harm and give them courage to stand up for justice and righteousness.\n\nWe ask that you provide for their physical and emotional needs, and that you would give them hope and encouragement in the midst of adversity.\n\nWe pray that you would change the hearts of those in authority, that they would rule with justice and compassion.\n\nAnd we pray that you would bring an end to oppression and injustice, that your people might live in peace and freedom.\n\nIn Jesus name we pray,\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>SUNDAY MORNING TABLET Text: Psalm 37:1-7, Romans 13:1-7, 1 Peter 2:13-17 Dear brothers and sisters in Christ, Living under a dictatorship government can be challenging and frustrating. It is easy to feel helpless and powerless when faced with oppression and injustice. However, as Christians, we are called to live differently, even in the midst of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/living-under-oppression-a-biblical-perspective/\">Living under oppression: A Biblical perspective </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Rebels kill 13 foreign peacekeepers in DR Congo",
            "url": "https://www.newzimbabwe.com/rebels-kill-13-foreign-peacekeepers-in-dr-congo/",
            "content": "By BBC\n\nTHIRTEEN soldiers serving with peacekeeping forces in the Democratic Republic of Congo have been killed in clashes with rebels from the M23 group.\n\nThe South African military said nine of its soldiers died helping to push back a rebel advance on the city of Goma, in eastern DR Congo, while three Malawians and a Uruguayan were also killed.\n\nFrench President Emmanuel Macron said he had spoken to the leaders of both DR Congo and Rwanda amid global calls for the violence to end.\n\nThe United Nations is pulling all non-essential staff out of Goma  a city of more than one million people  as the fighting intensifies.\n\nA UN Security Council meeting about the deadly clashes, originally set for Monday, has been moved to Sunday due to the escalating conflict.\n\nThe M23 group has called on Congolese troops in Goma to surrender in order to avoid bloodshed. While DR Congo has severed diplomatic ties with neighbouring Rwanda, accusing the country of being behind the rebellion.\n\nThe move comes after M23 fighters killed a Congolese military governor who was visiting the frontline on Thursday. Earlier in January, they captured the key eastern Congolese towns of Minova and Masisi.\n\nMacron called for an end to the fighting in separate calls with the leaders of DR Congo and Rwanda on Saturday, his office said.\n\nThe EUs foreign policy chief Kaja Kallas urged the M23 to halt its advance and condemned Rwandas support for the group, the AFP news agency reports.\n\nFurther condemnation came from Angolan President Joao Lourenco, the African Unions mediator between Rwanda and DR Congo, who denounced irresponsible actions by the M23 and its supporters and called for the immediate cessation of fighting to preserve civilian lives, according to the AFP news agency.Fighting between the M23 and DR Congos army has intensified since the start of the year, with the rebels seizing control of more territory than ever.\n\nThe conflict has already led more than 400,000 people to flee their homes this year, according to the UN.\n\nLocal leaders last week said more than 200 civilians had been killed in areas captured by the M23, with hospitals in Goma treating hundreds of patients.\n\nMartin Gordon, an Anglican bishop in Goma, told the BBC fighting in the country had gone on way too long and people will do anything for peace.\n\nIn the past few days, several countries have urged their citizens to leave Goma, including the UK, France, Germany and the US.\n\nHuman Rights Watch has warned of escalating risks to civilians as the Congolese army battles the M23 rebels. The humanitarian group has accused both sides of committing grave abuses against civilians.\n\nThe UN has warned that the ongoing conflict is worsening the humanitarian crisis in the region.\n\nThe M23 has taken control of vast swathes of mineral-rich eastern DR Congo since 2021. Hundreds of thousands of people have been displaced as a consequence.\n\nDR Congo and the UN say the M23 is backed by Rwanda. The Rwandan authorities have neither confirmed nor denied this.\n\nRwanda has previously said the authorities in DR Congo were working with some of those responsible for the 1994 Rwandan genocide against ethnic Tutsis and moderate Hutus.\n\nThe M23 formed as an offshoot of another rebel group in 2012, ostensibly to protect the Tutsi population in the east of DR Congo, which had long complained of persecution and discrimination.\n\nHowever, Rwandas critics accuse it of using the M23 to loot eastern DR Congos minerals such as gold, cobalt and tantalum.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26021018/88ad52f0-db7d-11ef-a37f-eba91255dc3d.jpg.webp",
            "description": "<p>By BBC  THIRTEEN soldiers serving with peacekeeping forces in the Democratic Republic of Congo have been killed in clashes with rebels from the M23 group. The South African military said nine of its soldiers died helping to push back a rebel advance on the city of Goma, in eastern DR Congo, while three Malawians and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rebels-kill-13-foreign-peacekeepers-in-dr-congo/\">Rebels kill 13 foreign peacekeepers in DR Congo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "South African short film, The Last Ranger, earns Oscar nomination",
            "url": "https://www.newzimbabwe.com/south-african-short-film-the-last-ranger-earns-oscar-nomination/",
            "content": "By News24\n\nSOUTH African film The Last Ranger, directed by Cindy Lee, has been nominated for Best Live Action Short Film at the 97th Academy Awards.\n\nThe film explores rhino poaching and conservation efforts in South Africa, featuring characters Litha and ranger Khuselwa.\n\nWith an impressive 13 nominations, Emilia Perez leads the list, followed by The Brutalist and Wicked with 10 nominations each, and A Complete Unknown and Conclave both securing 8 nominations.\n\nThe Academy Award ceremony, hosted by Conan OBrien, will take place on 2 March.\n\nSouth African film The Last Ranger, directed by Cindy Lee, has earned an Academy Award nomination in the category of Best Live Action Short Film.\n\nThe nominees for the 97th Academy Awards were announced in Los Angeles on Thursday. The announcement was co-hosted by actor-writer-comedians Rachel Sennott and Bowen Yang in a live presentation from the Academys Samuel Goldwyn Theater.\n\nThe nominees announcement, initially scheduled for 17 January, was postponed due to the fires in Los Angeles.\n\nThe film is produced by Six Feet Films and supported by Anele Mdoda, according to a press release.\n\nA description of The Last Ranger reads:\n\nThe film tells a captivating story about rhino poaching and the conservation efforts taking place in South Africa.\n\nIt follows a young Litha (Liyabona Mroqoza), who is taken on a wondrous journey through a game reserve by the last remaining ranger, Khuselwa (Avumile Qongqo).\n\nTheir journey takes a tragic and unexpected turn when they are ambushed by poachers, leading to a battle to protect the rhinos and ultimately uncovering a devastating secret.\n\nDirector Lee initially expressed excitement about being shortlisted last year.\n\nTo have an IsiXhosa film about rhino poaching in the running for an Oscar makes me so proud, Lee said in a statement.\n\nThis film is unique and deserves to go all the way.\n\nWinners of the industrys highest honours will be unveiled at a 2 March ceremony hosted by comedian Conan OBrien.\n\nSEE THE FULL LIST OF NOMINEES HERE:\n\nBest Picture\n\nAnora\n\nThe Brutalist\n\nA Complete Unknown\n\nEmilia Perez\n\nIm Still Here\n\nNickel Boys\n\nBest Director\n\nSean Baker, Anora\n\nBrady Corbet, The Brutalist\n\nJames Mangold, A Complete Unknown\n\nJacques Audiard, Emilia Perez\n\nCoralie Fargeat, The Substance\n\nBest Actor\n\nAdrien Brody, The Brutalist\n\nTimothee Chalamet, A Complete Unknown\n\nColman Domingo, Sing Sing\n\nRalph Fiennes, Conclave\n\nSebastian Stan, The Apprentice\n\nBest Actress\n\nCynthia Erivo, Wicked\n\nKarla Sofia Gascon, Emilia Perez\n\nMikey Madison, Anora\n\nDemi Moore, The Substance\n\nFernanda Torres\n\nBest Supporting Actress\n\nMonica Barbaro, A Complete Unknown\n\nAriana Grande, Wicked\n\nFelicity Jones, The Brutalist\n\nIsabella Rossellini, Conclave\n\nZoe Saldana, Emilia Perez\n\nBest Supporting Actor\n\nYura Borisov, Anora\n\nKieran Culkin, A Real Pain\n\nEdward Norton, A Complete Unknown\n\nGuy Pearce, The Brutalist\n\nJeremy Strong, The Apprentice\n\nBest Adapted Screenplay\n\nA Complete Unknown\n\nConclave\n\nEmilia Perez\n\nNickel Boys\n\nSing Sing\n\nBest Original Screenplay\n\nAnora\n\nThe Brutalist\n\nA Real Pain\n\nSeptember 5\n\nThe Substance\n\nAnimated Feature\n\nFlow\n\nInside Out 2\n\nMemoir Of A Snail\n\nWallace & Gromit: Vengeance Most Fowl\n\nThe Wild Robot\n\nBest International Feature Film\n\nIm Still Here, Brazil\n\nThe Girl With The Needle, Denmark\n\nEmilia Perez, France\n\nThe Seed of the Sacred Fig\n\nFlow, Latvia\n\nBest Documentary Short\n\nDeath By Numbers\n\nI Am Ready, Warden\n\nIncident\n\nInstruments of a Beating Heart\n\nThe Only Girl in the Orchestra\n\nBest Cinematography\n\nThe Brutalist\n\nDune: Part Two\n\nEmilia Perez\n\nMaria\n\nNosferatu\n\nBest Costume Design\n\nA Complete Unknown\n\nConclave\n\nGladiator II\n\nsferatu\n\nWicked\n\nFilm Editing\n\nAnora\n\nThe Brutalist\n\nConclave\n\nEmilia Perez\n\nWicked\n\nMakeup and Hairstyling\n\nA Different Man\n\nEmilia Perez\n\nNosferatu\n\nThe Substance\n\nWicked\n\nOriginal Score\n\nThe Brutalist\n\nConclave\n\nEmilia Perez\n\nWicked\n\nThe Wild Robot\n\nOriginal Song\n\nProduction Design\n\nThe Brutalist\n\nConclave\n\nDune: Part Two\n\nNosferatu\n\nWicked\n\nBest Sound\n\nA Complete Unknown\n\nDune: Part Two\n\nEmilia Perez\n\nWicked\n\nThe Wild Robot\n\nVisual Effects\n\nAlien: Romulus\n\nBetter Man\n\nDune: Part Two\n\nKingdom of The Planet of the Apes\n\nWicked\n\nDocumentary Feature\n\nBlack Box Diaries\n\nNo Other Land\n\nPorcelain War\n\nSoundtrack To A Coup DEtat\n\nSugarcane\n\nAnimated Short Film\n\nBeautiful Men\n\nIn The Shadow Of The Cypress\n\nMagic Candies\n\nWander to Wonder\n\nYuck!\n\nLive Action Short Film\n\nA Lien\n\nAnuja\n\nIm Not A Robot\n\nThe Last Ranger\n\nThe Man Who Could Not Remain Silent\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26015847/52ddefa33ed24e8fb7e2e7f2427464de.webp",
            "description": "<p>By News24 SOUTH African film The Last Ranger, directed by Cindy Lee, has been nominated for Best Live Action Short Film at the 97th Academy Awards. The film explores rhino poaching and conservation efforts in South Africa, featuring characters Litha and ranger Khuselwa. With an impressive 13 nominations, Emilia Perez leads the list, followed by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-short-film-the-last-ranger-earns-oscar-nomination/\">South African short film, The Last Ranger, earns Oscar nomination</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "Zimbabwe’s Finance minister seeks to downplay multinational exits: ‘Our own people are stepping up’",
            "url": "https://www.newzimbabwe.com/zimbabwes-finance-minister-seeks-to-downplay-multinational-exits-our-own-people-are-stepping-up/",
            "content": "By newZWire\n\nAS some multinationals head for the exits in Zimbabwe, Finance Minister Mthuli Ncube says the country is not short of locals ready to take over.\n\nThe recent departure of businesses such as Unilever and Deloitte show how multinationals, many of whom are leaving African markets, no longer see Zimbabwe as a viable market.\n\nGovernments failure to fix the long-running currency crisis and its uncertain economic policies have made Zimbabwe unattractive to investors, especially those in the service industry.\n\nBut Ncube says while his government will do all it can to keep big foreign investors in Zimbabwe, he is putting his hopes in locals to replace them.\n\nYou cannot stop companies from disinvesting, Ncube says.\n\nBut Im pleased that for some of these disinvestments, you have local investors who are ready to take over those companies. You saw it with the audit firms that exited, local partners took over the practice. I was very pleased with that.\n\nIn 2024, Deloitte exited Zimbabwe, and its operations were taken over by Axcentium, a firm led by former Deloitte partners who cited the need for flexibility and agility in Zimbabwes evolving market.\n\nPwC also left the market last year, with Vista Chartered Accountants taking its place.\n\nNot everyone shares Ncubes optimism about the exit of global accounting firms.\n\nWhen such a globally recognised institution exits a market, the ramifications are not just symbolicthey are structural. It reflects systemic economic and governance issues and sends a loud message to both local and international stakeholders about the countrys operating environment, says Brighton Musonza, an accountant and business commentator.\n\nRetailer Choppies announced its departure from Zimbabwe in December, citing the impact of Ncubes exchange rate policies which have decimated formal retail and boosted informal traders. Choppies sold its business Sai Mart, owned by Deputy Minister Raj Modi.\n\nNcube insists: If you look at Choppies, a local investor is taking over the asset. We are not short of local investors who are ready to step in to replace some of these foreign investors.\n\nBut well make sure we step in to address some of the challenges that businesses face. Well work on that to attract new investment and encourage expansion by those who are already on the ground.\n\nLast year, Unilever announced it would exit the country and use local distributors instead to sell its brands in Zimbabwe. This added to a list of other multinationals who have left the country.\n\nStandard Chartered last year sold its business to FBC Holdings for $24 million as it left Zimbabwe and several other markets around the world.\n\nHolcim disposed of its cement plant in Zimbabwe to Fossil in 2022 for $29.7 million. Nampak is currently in the process of selling its 51% stake in the countrys biggest packaging business to TSL for $25 million.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26014441/ax.jpg",
            "description": "<p>By newZWire  AS some multinationals head for the exits in Zimbabwe, Finance Minister Mthuli Ncube says the country is not short of locals ready to take over. The recent departure of businesses such as Unilever and Deloitte show how multinationals, many of whom are leaving African markets, no longer see Zimbabwe as a viable market.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-finance-minister-seeks-to-downplay-multinational-exits-our-own-people-are-stepping-up/\">Zimbabwe’s Finance minister seeks to downplay multinational exits: ‘Our own people are stepping up’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "ZIFA gets new president after Nqobile Magwizi secures landslide victory",
            "url": "https://www.newzimbabwe.com/zifa-gets-new-president-after-nqobile-magwizi-secures-landslide-victory/",
            "content": "By Staff Reporter\n\nTHE much-hyped Zimbabwe Football Association (ZIFA) elections saw Nqobile Magwizi voted as the new president.\n\nDuring polls held at a Harare hotel Saturday, the respected businessman-cum-football administrator amassed an unassailable 61 of the 77 votes cast, accounting for 80%, while his closest rival, Phillemon Machana, received six votes.\n\nIn third place was Twine Phiri, who got four, Marshall Gore received one, and Makwinji Soma Phiri failed to secure a single vote. There were five spoilt ballots\n\nThe final voter count was later reduced to 77 delegates by ZIFA Normalisation Committee chairman Lincoln Mutasa after one councillor was caught taking a picture of his voting slip, leading to his disqualification.\n\nA few hours ahead of polls, presidential aspirant Martin Kweza withdrew his from the race.\n\nMagwizi, who replaces Felton Kamambo voted into office in 2018, is expected to breathe life into the financially ailing sport whose integrity needs urgent restoration.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Staff Reporter  THE much-hyped Zimbabwe Football Association (ZIFA) elections saw Nqobile Magwizi voted as the new president. During polls held at a Harare hotel Saturday, the respected businessman-cum-football administrator amassed an unassailable 61 of the 77 votes cast, accounting for 80%, while his closest rival, Phillemon Machana, received six votes. In third place was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-gets-new-president-after-nqobile-magwizi-secures-landslide-victory/\">ZIFA gets new president after Nqobile Magwizi secures landslide victory</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        },
        {
            "title": "‘Zimbabwe will close budget deficit with fast foods and sugar taxes’— Mthuli Ncube tells Davos WEF",
            "url": "https://www.newzimbabwe.com/zimbabwe-will-close-budget-deficit-with-fast-foods-and-sugar-taxes-mthuli-ncube-tells-davos-wef/",
            "content": "By Thandi Garusa\n\nZIMBABWEs Finance Minister, Mthuli Ncube says the newly introduced slew of taxes will help close the countrys budget deficit in the wake of lack of access to external financing.\n\nZimbabwe owes international creditors a whopping US$21 billion and its failure to settle the debt has kept it excluded from global financial markets for the past 25 years.\n\nIn an interview during a session on Navigating the Fiscal Squeeze at the World Economic Forum (WEF) meeting in Switzerland, Ncube was asked how he was funding the financial gap as Zimbabwe has a budget deficit and cannot access the external financing as well.\n\nIt is not easy to fund the gap, first of all you just have to do the plain vanilla fiscal discipline just to deal with minimizing the growth in the primary deficit by running cash budgets or quasi cash budgets that is what we had to do to make sure that we live within our means, and we try to minimize borrowing.\n\nBut also, we have tried to be innovative on the revenue front in terms of domestic resource mobilization to create space for additional expenditure.\n\nWe have introduced taxes such as the intermediate money transfer tax, if you are sending money within Zimbabwe, or doing an inter-bank or whatever transaction you pay tax for that.\n\nWe even have a tax now on fast foods, if you are buying pizza, tacos you pay an extra fee, just some innovation on domestic resource mobilisation is one of the solutions to create the space to fund anything fiscally, Ncube said.\n\nMeanwhile, to address Zimbabwes arrears Ncube also said the government was also engaging in a debt restructuring exercise.\n\nWe are engaging in a debt restructuring exercise which is also political where you have to bring all parties together, spending time doing financial diplomacy, getting everybody on board to do the debt restructuring and we are making progress.\n\nWe created a debt arrears platform which involved creditors all in one room with us and then creating three channels for sets of reforms, economic, governance and land reforms channels, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/04204804/Mthuli-Ncube-addressing-56th-UNECA-Conference78.jpg",
            "description": "<p>By Thandi Garusa ZIMBABWE’s Finance Minister, Mthuli Ncube says the newly introduced slew of taxes will help close the country’s budget deficit in the wake of lack of access to external financing. Zimbabwe owes international creditors a whopping US$21 billion and its failure to settle the debt has kept it excluded from global financial markets</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-will-close-budget-deficit-with-fast-foods-and-sugar-taxes-mthuli-ncube-tells-davos-wef/\">‘Zimbabwe will close budget deficit with fast foods and sugar taxes’— Mthuli Ncube tells Davos WEF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "26 Jan 2025"
        }
    ]
}