{
    "news": [
        {
            "title": "Dynamos hit with FIFA ban",
            "url": "https://www.newzimbabwe.com/dynamos-hit-with-fifa-ban/",
            "content": "By Sports Reporter\n\nZimbabwe football giants Dynamos has been hit with a FIFA ban due to an outstanding amount of US$18,500 owed to two former players from Ghana, Emmanuel Paga and Ansa Botchway.\n\nAccording to reports, Dynamos owes Paga US$8,500, while Botchway is owed US$10,000.\n\nThe duo parted ways with Dynamos in December last year, with Paga joining Mutare-based outfits Manica Diamonds, as Botchway crossed to Scottland FC.\n\nDembare had a turbulent 2024 season campaign, with players boycotting training several times in protest over unpaid winning bonuses and sign-on fees.\n\nThis then led to a mass players exodus at the end of the season as 15 senior players left.\n\nDynamos has become the fourth Zimbabwean club to be slapped with a FIFA ban since last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29044358/paga.png",
            "description": "<p>By Sports Reporter Zimbabwe football giants Dynamos has been hit with a FIFA ban due to an outstanding amount of US$18,500 owed to two former players from Ghana, Emmanuel Paga and Ansa Botchway. According to reports, Dynamos owes Paga US$8,500, while Botchway is owed US$10,000. The duo parted ways with Dynamos in December last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-hit-with-fifa-ban/\">Dynamos hit with FIFA ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Nothing untoward about UZ strike – says Mutsvangwa as ZANU PF hopes for a solution to lecturers’ crisis",
            "url": "https://www.newzimbabwe.com/nothing-untoward-about-uz-strike-says-mutsvangwa-as-zanu-pf-hopes-for-a-solution-to-lecturers-crisis/",
            "content": "By Darlington Gatsi\n\nZANU PF is hoping the University of Zimbabwe (UZ) and striking lecturers will find an amicable solution to end the impasse and avert chaos at the institution of higher learning.\n\nUZ is facing the embarrassing prospect of postponing this years graduation as lecturers refuse to return to lecture halls, demanding a salary increase.\n\nThe strike has plunged UZ into chaos, with students missing examinations, and could potentially disrupt other academic schedules if the countrys oldest learning institution fails to resolve the deadlock with lecturers.\n\nAddressing the media at the partys headquarters on Tuesday, ZANU PF spokesperson Christopher Mutsvangwa said the strike does not signify government failure.\n\nStrikes happen in any country. There may be good reasons why the professors and lecturers are striking, but we cannot say that every strike that happens somewhere is a condemnation of the government.\n\nThere is nothing untoward about lecturers or any other Zimbabwean saying, I am not happy with what my employer is doing. It is not a political issue; it is an employer-employee relationship, said Mutsvangwa.\n\nThe Association of University Teachers, which is campaigning for a salary increase, has been met with silence from UZ.\n\nUZ responded heavy-handedly, suspending five of the striking lecturers, with reports indicating that newly recruited adjunct teachers will earn US$3 per hour.\n\nMutsvangwa said a solution must be found to avert further chaos at UZ.\n\nNo, it is an expression of the democratic nature of Zimbabwean society. There is nothing wrong with striking, but hopefully, they will sit down together and assess each others grievances and demands.\n\nThere is no way we can be permanently without lecturers at such an important institution as the University of Zimbabwe. I am sure something good will come out of it, said Mutsvangwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled-e1748490385375.jpg",
            "description": "<p>By Darlington Gatsi ZANU PF is hoping the University of Zimbabwe (UZ) and striking lecturers will find an amicable solution to end the impasse and avert chaos at the institution of higher learning. UZ is facing the embarrassing prospect of postponing this year’s graduation as lecturers refuse to return to lecture halls, demanding a salary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nothing-untoward-about-uz-strike-says-mutsvangwa-as-zanu-pf-hopes-for-a-solution-to-lecturers-crisis/\">Nothing untoward about UZ strike – says Mutsvangwa as ZANU PF hopes for a solution to lecturers’ crisis </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Chief Justice Malaba challenges judicial aspirants on tech competence as courts adopt IECMS",
            "url": "https://www.newzimbabwe.com/chief-justice-malaba-challenges-judicial-aspirants-on-tech-competence-as-courts-adopt-iecms/",
            "content": "By Mary Taruvinga\n\nChief Justice Luke Malaba on Wednesday encouraged the judicial officers to embrace technological advancements.\n\nMalaba said individuals lacking basic computer skills have no place in Zimbabwes judiciary at a time when the world is evolving technologically.\n\nThis urgent call for proficiency arose during the ongoing public interviews conducted by the Judicial Service Commission (JSC) for candidates vying for the post of Labour Court judges.\n\nThe JSC has implemented the internet-based Integrated Electronic Case Management System (IECMS), designed to streamline the digital management of court cases.\n\nTo effectively utilise this system, users must possess devices such as laptops, computers, tablets, and smartphones, along with reliable internet access.\n\nThey must also complete a registration process and receive adequate training on the IECMS platform.\n\nMalabas scrutiny fell on local lawyer Joseph Masango, who was applying for the Labour Court judge position.\n\nThe Chief Justice criticised Masangos apparent lack of initiative in keeping up with necessary skills, revealing that he had scored a zero on a test integral to the selection process.\n\nWhen Malaba inquired about Masangos computer literacy, the lawyer confidently affirmed his ability.\n\nHowever, when confronted with his test score, Masango attributed his failure to a lack of experience with IECMS, as his cases had not reached higher courts.\n\nIECMS is now a critical component in the justice system. How can you be a law officer without knowledge of using IECMS, especially since it was introduced back in 2022? Malaba remarked.\n\nYou cant pursue such a post when you score zero in a crucial test meant to prepare you for this role. All lawyers should know how to use the IECMS.\n\nHe continued to express his disappointment, saying, There is a component of laxity in you Your attitude toward IECMS is worrying. We cannot understand why a senior lawyer like you doesnt know these things or seems indifferent to the changes occurring not just in Zimbabwes judicial space but globally.\n\nIn response, Masango vowed to amend his approach if granted the position.\n\nI will never do that again. If I am given the post, I will change that attitude and put my all into this job, he said.\n\nMy CV shows that I have not been stagnant; Ive received promotions because my supervisors were satisfied with my performance. If there was laxity in my work, clients would have reported me to the Law Society. Im a go-getter, and I adhere to ethical conduct.\n\nThe JSC is interviewing 28 candidates who are competing for eight positions on the Labour Court bench. The process began on Tuesday. Initially, the commission received 53 nominations, but following a review, six submissions were invalidated, and two were withdrawn.\n\nOn April 14, 2025, 45 candidates participated in the first-level examination, with 28 qualifying for the final interviews.\n\nThe panel of interviewers includes Malaba, his deputy, Elizabeth Gwaunza, Attorney General Virginia Mabhiza, Judge President Mary Zimba Dube, and Chief Magistrate Vongai Guuriro Muchuchuti, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/13122004/Chief-Justice-Luke-Malaba.jpg",
            "description": "<p>By Mary Taruvinga Chief Justice Luke Malaba on Wednesday encouraged the judicial officers to embrace technological advancements. Malaba said individuals lacking basic computer skills have no place in Zimbabwe’s judiciary at a time when the world is evolving technologically. This urgent call for proficiency arose during the ongoing public interviews conducted by the Judicial Service</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chief-justice-malaba-challenges-judicial-aspirants-on-tech-competence-as-courts-adopt-iecms/\">Chief Justice Malaba challenges judicial aspirants on tech competence as courts adopt IECMS</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "ZWG annual inflation rate hits 92,1%",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-rate-hits-921/",
            "content": "By Alois Vinga\n\nTHE local ZWG inflation rate has surged to 92,1% amid grave concerns bytheindustry for authorities to contain the rates.\n\nData published by the Zimbabwe National Statistics Agency (ZimStat) this week revealed that annual inflation, which stood at 85% last month, surged by 7% in the month of May 2025.\n\nThe ZWG month-on-month inflation rate was 0.9 percent in May 2025, gaining 0.3 percentage points on the April 2025 rate of 0.6 percent. The ZWG year-on-year inflation rate (annual percentage change) for the month of May 2025, as measured by the all-items ZWG Consumer Price Index (CPI), was 92.1%, the statistics agency said.\n\nLast month, the Confederation of Zimbabwe Industries said the high ZWG inflation largely reflects cumulative shocks that drove month-on-month inflation in 2024. The industry grouping said a significant factor was the September 2024 exchange rate devaluation, which substantially increased the ZiG Consumer Price Index (CPI) and, in turn, elevated annual inflation compared to April 2024 levels.\n\nThe industry body said high ZWG annual inflation poses challenges for businesses, particularly due to its impact on interest rates.\n\nZimstat said the weighted month-on-month inflation rate was 0.0 percent in May 2025, shedding 0.3 percentage points on the April 2025 rate of 0.3 percent while the weighted year-on-year inflation rate for May 2025 as measured by the all-items USD Consumer Price Index (CPI), was 26.9 percent.\n\nThe USD month-on-month inflation rate was -0.3 percent in May 2025, shedding 0.5 percentage points on the April 2025 rate of 0.2 percent. The USD year-on-year inflation rate (annual percentage change) for the month of May 2025, as measured by the all-items USD Consumer Price Index (CPI), was 13.9 percent, said Zimstat.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga THE local ZWG inflation rate has surged to 92,1% amid grave concerns by the industry for authorities to contain the rates. Data published by the Zimbabwe National Statistics Agency (ZimStat) this week revealed that annual inflation, which stood at 85% last month, surged by 7%  in the month of May 2025. “The ZWG month-on-month</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-rate-hits-921/\">ZWG annual inflation rate hits 92,1%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Mnangagwa declares multi-vehicle collision which killed 12 a national disaster, victims named",
            "url": "https://www.newzimbabwe.com/mnangagwa-declares-multi-vehicle-collision-which-killed-12-a-national-disaster-victims-named/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has declared the fatal accident involving a fuel tanker, a two-tonne truck and a van, which claimed 12 lives near Kwekwe, a national disaster.\n\nThe accident occurred at the 200 kilometre peg along the Harare-Bulawayo Road near Sebakwe River.\n\nAccording to the Zimbabwe Republic Police (ZRP), the fuel tanker with two trailers, travelling towards Kwekwe, collided with a truck travelling from the opposite direction, resulting in a head-on collision with a Nissan AD van, which had 12 people on board.\n\nThe tanker dragged the van for several metres before overturning and falling on top of it, trapping the 12 occupants inside.\n\nPolice have released names of eight of the victims  James Ncube (23), Marvellous Mapanzure (20), Emilly Mpofu Mucheuki (25), Joshua Muza (35), Reward Nyatsongo (28), Farai Bisendi (47), Emmanuel Mangomana (21) and Maria Jasi (43).\n\nFour females are yet to be identified.\n\nIn a statement, Mnangagwa declared the accident a national disaster.\n\nMy heart goes out to families that have lost their loved ones in this horrific accident. Equally, I wish a speedy recovery to all those nursing injuries from the incident. I have since directed the responsible arms of my Government to declare this traffic accident a national disaster.\n\nThis crucial legal step paves the way for Government to move in and take all-round responsibility for the interment of all those who perished the accident, and for support to those hospitalised. May all the bereaved and other affected families find comfort and a solace in that our Nation joins and mourns with them in this hour of deep grief and pain, said Mnangagwa.\n\nHe urged the public to support law enforcement in addressing reckless driving.\n\nThe deadly incident adds yet another grim statistic to the needless toll which reckless driving levies on our people and our Nation. While I am pleased that the Zimbabwe Republic Police is moving speedily towards a full deployment of high-end technologies for traffic management, and for curbing waywardness on our roads, more still has to be done to arrest the ever-spiralling fatalities we face as a Nation.\n\nThe duty for safe traffic conduct squarely falls on all road users, while the responsibility to call out reckless road-users includes the general public who should support our law enforcement agencies to tame what in essence has become a traffic jungle, added Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28170019/kwekwe-accident.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has declared the fatal accident involving a fuel tanker, a two-tonne truck and a van, which claimed 12 lives near Kwekwe, a national disaster. The accident occurred at the 200 kilometre peg along the Harare-Bulawayo Road near Sebakwe River. According to the Zimbabwe Republic Police (ZRP), the fuel tanker</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-declares-multi-vehicle-collision-which-killed-12-a-national-disaster-victims-named/\">Mnangagwa declares multi-vehicle collision which killed 12 a national disaster, victims named </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Chevrons to play Proteas in Battle of Limpopo test match",
            "url": "https://www.newzimbabwe.com/chevrons-to-play-proteas-in-battle-of-limpopo-test-match/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens cricket team will in June face neighbours South Africa at Queens Sports Club in a two-Test match series dubbed the Battle of Limpopo.\n\nThe first series is scheduled will start onJune28 to July 2, while the second one will be played from July6 to 10.\n\nChevrons upcoming series against Proteas comes on the back of an innings and 45 runs defeat against England in a historical Test match, which was played at Trent Bridge.\n\nZimbabwes Test match against South Africa will mark the third Test for the Chevrons this year, following two Test encounters against Bangladesh in April and England in May.\n\nZimbabwe and South Africas last Test meeting was a single-match encounter played at Port Elizabeth in 2017, which the host won by 120 runs.\n\nChevrons two-match series against South Africa will be used as a build-up to another two-test match series against New Zealand, which is set to tour Zimbabwe at the end of July.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/01174040/Chevrons.webp",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s cricket team will in June face neighbours South Africa at Queens Sports Club in a two-Test match series dubbed the ‘Battle of Limpopo’. The first series is scheduled will start on June 28 to July 2, while the second one will be played from July 6 to 10. Chevrons’ upcoming series against</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-play-proteas-in-battle-of-limpopo-test-match/\">Chevrons to play Proteas in Battle of Limpopo test match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Harare Remand Prison inmates living in degrading, inhumane conditions – rights body",
            "url": "https://www.newzimbabwe.com/harare-remand-prison-inmates-living-in-degrading-inhumane-conditions-rights-body/",
            "content": "By Anna Chibamu\n\nTHE Zimbabwe Human Rights Commission (ZHRC) hasraised concerns over the gross violations of inmates rights at Harare Remand Prison.\n\nIn a statement released recently, the ZHRC said in line with its constitutional mandate, it conducted a human rights monitoring visit to Harare Remand Prison on April 29, 2025, where inmates are living under inhumane conditions.\n\nThe Commission reported that around 80 inmates had either been detained without trial or had their legal proceedings delayed, suffered prolonged pre-trial detention, were denied access to education and healthcare, lived in overcrowded cells, suffered police abuse and several other rights violations.\n\nThe Commissions visit was meant to ascertain and verify facts following concerns over the prolonged detention of inmates arrested for politically sensitive cases.\n\nThese included Mr. Blessed Mhlanga ( HStv Journalist) and the 94 detainees arrested in relation to the March 31, 2025 protests.\n\nThe mission aimed to investigate allegations of politically motivated pre-trial detention and to ascertain circumstances surrounding the arrest and detention of the inmates and to secure appropriate redress in line with section 243(1)(g) of the Constitution of Zimbabwe.\n\nIndeed, the visit covered all other issues affecting inmates in this prison facility, part of the ZHRC statement read.\n\nThe ZHRC team was led by the Commission chairperson, Fungayi Jessie Majome.\n\nMany detainees, including Mr. Blessed Mhlanga, have faced excessive delays in their legal proceedings, raising serious concerns regarding their rights to a fair trial.\n\nInmates held in cases of political interest suffered prolonged pretrial detention in violation of the right not to be detained without trial, and to be released on bail unless there are compelling reasons justifying such detention.\n\nAlso, Some of the inmates reported significant violations of their rights to education and healthcare. Mhlanga, a first-year law student, and another University of Zimbabwe Economics student were denied the opportunity to sit for their examinations while in custody, whilst inmates experienced inhumane living conditions, mostly due to overcrowding.\n\nPrison cells designed for 35 inmates were reportedly holding more than 80, leading to unsanitary and degrading living conditions.\n\nSeveral detainees raised allegations of police abuse during their arrests, including physical violence and theft of personal belongings.\n\nThe commission revealed there were 66 irregular migrants of different nationalities whose detention was in violation of their rights, as they were not facing any criminal charges and were not awaiting trial.\n\nZHRC urged relevant authorities to take immediate action to prioritise urgent bail applications, conduct thorough investigations into allegations of police misconduct and ensure accountability for any abuses.\n\nThe Commission called for improved prison conditions, reduced crowds, restoration ofcommunication facilities, and access to adequate medical care for all detainees.\n\nPrison officers were urged to desist from imprisoning irregular migrants whose issues should be handled without resorting to indefinite detention.\n\nInmates were advised to report any complaints to the Officer In Charge, who indicated that he was ready to receive reports of assaults by prison officers and bullying by fellow inmates.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Anna Chibamu THE Zimbabwe Human Rights Commission (ZHRC) has raised concerns over the gross violations of inmates’ rights at Harare Remand Prison. In a statement released recently, the ZHRC said in line with its constitutional mandate, it conducted a human rights monitoring visit to Harare Remand Prison on April 29, 2025, where inmates are living</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-remand-prison-inmates-living-in-degrading-inhumane-conditions-rights-body/\">Harare Remand Prison inmates living in degrading, inhumane conditions – rights body </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Zimbabwe Independent Complaints Commission now operational, 15 complaints received so far",
            "url": "https://www.newzimbabwe.com/zimbabwe-independent-complaints-commission-now-operational-15-complaints-received-so-far/",
            "content": "By Anna Chibamu\n\nTHE Zimbabwe Independent Complaints Commission (ZICC), chaired by Justice Webster Chinamora, is now operational and has so far received 15 grievances.\n\nThe ZICC is a five-member commission with the mandate to address citizen complaints against misconduct by security services  the police, army, the Zimbabwe Prisons and Correctional Services (ZPCS) and the Central Intelligence Organisation (CIO).\n\nJustice Chinamora paid a courtesy call to the Speaker Jacob Mudenda this Tuesday and told journalists that the Commission had started receiving complaints, mostly of an assault nature.\n\nSince our appointment to the Commission, we have not paid a visit to the Speaker of Parliament. It would have been a release for us not to make that visit because we are aware that Parliament is where it started. Parliament is where the Constitution was made and where that provision, Section 210 of the Constitution, was created, which enables us as the Commission to investigate cases of misconduct or violations of the Constitution by members of the security services, that is the Army, the CIO, the prison service and the police.\n\nIts mainly cases of assaults by police officers and allegations of abuse of our office, and those are the main cases, and also delays in handling of our cases when reports are made to the police about violations,Chinamora said.\n\nChinamora also highlighted that the Commission had received tremendous support from the President in the form of offices being sequenced to it from the Office of the President and Cabinet and support from the Public Service Commission (PSC).\n\nWe are also informing the Speaker that we have made a draft of the regulations which set out the procedure for receiving complaints, investigating complaints and ending the hearings when they do come to us. So, we are telling them that we did our own draft as a Commission, and we presented it to the Attorney General, and the drafters are now working on it, so that the draft crystallises into a statutory instrument.\n\nWe also got support from the Speaker himself, with very invaluable suggestions that we have a retreat with senior officers for the top brass of the Security Services, so that we build that trust which is required, and that will help us in terms of preventing the actual making of complaints if the top brass knows how to avoid cases of misconduct, how to avoid mistakes which generate the mistakes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/27065255/chinamhora.jpeg",
            "description": "<p>By Anna Chibamu THE Zimbabwe Independent Complaints Commission (ZICC), chaired by Justice Webster Chinamora, is now operational and has so far received 15 grievances. The ZICC is a five-member commission with the mandate to address citizen complaints against misconduct by security services –  the police, army, the Zimbabwe Prisons and Correctional Services (ZPCS) and the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-independent-complaints-commission-now-operational-15-complaints-received-so-far/\">Zimbabwe Independent Complaints Commission now operational, 15 complaints received so far</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        },
        {
            "title": "Mukushi lands top posts at ABSA Botswana",
            "url": "https://www.newzimbabwe.com/mukushi-lands-top-posts-at-absa-botswana/",
            "content": "By Alois Vinga\n\nTOP financial services provider, ABSA Bank Botswana Limited, has appointed Kudakwashe Mukushi as Executive Director and Finance Director.\n\nThe appointment is with effect from 1 June 2025.\n\nPost a rigorous recruitment process, the companys board of directors is pleased to announce the appointment of Kudakwashe Mukushi as Finance Director and Executive Director of the Company with effect. His appointment as an Executive Director is subject to the conclusion of the favourable voting of shareholders at the Companys 40th Annual General Meeting, reads a notice by the Botswana Stock Exchange.\n\nMukushi is a seasoned financial services executive with over twenty-three years of advancing leadership roles and expertise in financial strategy, corporate governance, and investment management within the insurance, pensions, and other financial services sectors across Southern Africa.\n\nHe is well-versed in capital management, financial reporting under IFRS, stakeholder engagement, and investment management. He also brings strategic leadership experience as a Chief Financial Officer in large and publicly listed organisations, where he was responsible for overseeing the finance, risk and compliance functions, among other key deliverables.\n\nMukushi has also served as a Non-Executive Director on numerous boards across Botswana, Malawi, and Zambia, frequently chairing audit and investment committees. His board experience spans across asset management, insurance, banking, and consulting sectors.\n\nHe is a CFA Charter holder (CFA Institute United States of America), a Fellow of both the Association of Chartered Accountants and Botswana Institute of Chartered Accountants, and a graduate of Harvard Business Schools Senior Executive Program for Africa.\n\nHe also holds a Bachelor of Business Administration in Accounting (Solusi University, Zimbabwe).\n\nOn behalf of Management, Employees and Stakeholders of the Company, the Board welcomes Kudakwashe into this new role and is confident that his wealth of experience will inspire further delivery of the Companys ambitions and resolve to provide shareholder value and contribute to the communities in which we operate, wroteABSA Botswana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28172528/Kudakwashe-Mukushi-BIHL-CFO-scaled-1.jpg",
            "description": "<p>By Alois Vinga TOP financial services provider, ABSA Bank Botswana Limited, has appointed Kudakwashe Mukushi as Executive Director and Finance Director. The appointment is with effect from 1 June 2025. “Post a rigorous recruitment process, the company’s board of directors is pleased to announce the appointment of Kudakwashe Mukushi as Finance Director and Executive Director</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mukushi-lands-top-posts-at-absa-botswana/\">Mukushi lands top posts at ABSA Botswana</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "29 May 2025"
        }
    ]
}