{
    "news": [
        {
            "title": "Brother beheads sister for rituals, goes blind on eve of trial",
            "url": "https://www.newzimbabwe.com/brother-beheads-sister-for-rituals-goes-blind-on-eve-of-trial/",
            "content": "By Mary Taruvinga\n\nA Magunje family was left shattered after their 20-year-old son murdered his own sister in cold blood, then lost his sight on the eve of his trial.\n\nHigh Court judge Justice Philda Muzofa, sitting with assessors in Chinhoyi, convicted Isaac Mashonga, now 28, of brutally killing his sister, Dadirai Mashonga, in their kitchen hut in Mashonga Village, Zvipani, Magunje, in July 2017.\n\nThe horror began when their 93-year-old father, Champion Mashonga, and his wife woke up to find their daughters headless body sprawled in blood.\n\nNo parent can imagine one of his or her children beheading his sibling in their kitchen, Muzofa said while delivering her judgment, calling it a tragedy that will haunt this family and community forever.\n\nOn the night of July 13, 2017, Isaac, then 20, arrived at his parents home in the company of a local businessman known as Giant, real name Robert Tichareva.\n\nThe businessman was arrested together with Mashonga, but has since passed on.\n\nProsecutors told the court the two had conspired to kill Dadirai for ritual purposes, with Isaac allegedly promised US$4,000 for the beheading.\n\nThat night, Dadirai was fast asleep in the kitchen hut.\n\nVillagers later testified that Isaac led Robert straight to her room.\n\nInside, she was strangled and then decapitated using a kitchen knife, axe and adze.\n\nThe pair stuffed the head into a green satchel and smuggled it out to a derelict building near the business centre.\n\nThe following morning, Isaac returned to the homestead wearing blood-soaked clothes.\n\nVillagers who gathered at the gruesome scene apprehended him, tied his hands, and later forced him to lead them to the hidden satchel. Inside was Dadirais head.\n\nHe confessed and showed us the weapons, testified his father, Champion. As a father, I had no reason to misrepresent the facts. I was simply a troubled father.\n\nAs if the ordeal was not enough, Isaac lost his sight while awaiting trial.\n\nPrison doctors confirmed he is now 80% blind, a development that deepened his elderly parents pain.\n\nFor this elderly couple, they have lost two children at the same time  one through death and one through incarceration, the judge noted.\n\nInside prison, Isaacs blindness has left him dependent on fellow inmates for food, bathing and movement. Being blind and in prison presents a double challenge, the court acknowledged, though ruling that disability could not shield him from punishment.\n\nIsaac had claimed he was drugged by Robert and acted under the businessmans instructions. But Justice Muzofa dismissed his story as far-fetched and chicanery.\n\nThe accused literally took the Court for granted, the judge said. He carried the satchel fully aware that it had his sisters head. He then went to sleep. How can a person conduct himself likewise and yet claim he was intoxicated?\n\nThe court found that Isaac acted as a willing accomplice. The proved facts admit of no other inference except that the accused was part of this grand plan, Justice Muzofa ruled.\n\nThe judge said the killing had induced a sense of shock and revulsion in the community and branded it murder in aggravating circumstances.\n\nAlthough Isaacs youth, six years in pre-trial custody and his disability were considered, the court said retribution and deterrence must prevail.\n\nHe now faces decades behind bars,blind, broken, and carrying the weight of a family curse: the brother who killed his sister and destroyed his parents twilight years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga A Magunje family was left shattered after their 20-year-old son murdered his own sister in cold blood, then lost his sight on the eve of his trial. High Court judge Justice Philda Muzofa, sitting with assessors in Chinhoyi, convicted Isaac Mashonga, now 28, of brutally killing his sister, Dadirai Mashonga, in their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brother-beheads-sister-for-rituals-goes-blind-on-eve-of-trial/\">Brother beheads sister for rituals, goes blind on eve of trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Zimbabwe targets Asian beef markets, scales up foot and mouth disease surveillance",
            "url": "https://www.newzimbabwe.com/zimbabwe-targets-asian-beef-markets-scales-up-foot-and-mouth-disease-surveillance/",
            "content": "By Alois Vinga\n\nZimbabwe is stepping up efforts to expand beef exports to Asian markets, with authorities intensifying surveillance of foot-and-mouth disease (FMD) to safeguard herd health and meet international standards.\n\nOnce a major beef exporter in the late 1980s, Zimbabwes livestock sector suffered a sharp decline at the turn of the millennium due to the Fast-Track Land Reform Programme, which disrupted large-scale commercial ranching. This, combined with repeated disease outbreaks such as FMD, led to shrinking herd sizes and the loss of lucrative export markets.\n\nIn recent years, however, the sector has shown significant potential to recover through private and government-led initiatives aimed at boosting productivity, improving quality, and opening new markets.\n\nDeputy Lands and Agriculture Minister Vangelis Haritatos told Parliament that Zimbabwe is now working on expanding its beef export base to East Asia.\n\nGovernment is currently negotiating a bilateral Beef Export Trade Protocol with Asian countries such as the United Arab Emirates and Indonesia. The main challenge affecting exports has been foot-and-mouth disease control.\n\nTo this end, Government has intensified FMD surveillance and established disease-free zones for beef production, Haritatos said.\n\nHe added that the ministry has partnered with African Livestock and Organic Welfare (ALOW) and ZimTrade to ensure beef destined for export meets international quality standards.\n\nEast Asia represents a vast market for beef imports, driven by rising demand from its growing middle class. China remains one of the worlds largest consumers, while Japan and South Korea are also among the regions top importers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10061808/beef.webp",
            "description": "<p>By Alois Vinga Zimbabwe is stepping up efforts to expand beef exports to Asian markets, with authorities intensifying surveillance of foot-and-mouth disease (FMD) to safeguard herd health and meet international standards. Once a major beef exporter in the late 1980s, Zimbabwe’s livestock sector suffered a sharp decline at the turn of the millennium due to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-targets-asian-beef-markets-scales-up-foot-and-mouth-disease-surveillance/\">Zimbabwe targets Asian beef markets, scales up foot and mouth disease surveillance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Despite progressive move to scrap death penalty, new survey reveals majority of Zimbabweans want it back",
            "url": "https://www.newzimbabwe.com/despite-progressive-move-to-scrap-death-penalty-new-survey-reveals-majority-of-zimbabweans-want-it-back/",
            "content": "By Leopold Munhende\n\nMORE than half of Zimbabweans surveyed by Afrobarometer believe the death penalty is a fair punishment for those who commit heinous crimes, the continental organisations latest report has revealed.\n\nThe survey was conducted a few months before the abolishment, on December 31, 2024.\n\nTouted as a progressive move by Amnesty International in 2024, the decision got mixed public feelings from a society caught between a non-violent culture and the desire to see those who commit ruthless crimes punished.\n\nAfrobarometer surveyed Zimbabweans to find out what they think about the death penalty as part of a broader exploration of their perceptions of the countrys judicial system, reads the reports summary.\n\nMore than half of Zimbabweans believe the death penalty is a fair punishment for those who commit the most serious crimes, although a significant minority think there is no crime for which the death penalty can be justified.\n\nZimbabwe became only the fifth African country to do away with the death sentence, an issue made easier for abolitionists by the fact that President Emmerson Mnangagwa had once been on death row in the 1960s.\n\nHe was arrested and charged with terrorism by the colonial regime against his role in the fight for independence.\n\nHis decision to abolish the death sentence saved 59 lives on death row since the early 2000s, when Zimbabwe last carried out an execution.\n\nHigh Court judges were tasked with re-sentencing criminals on death row, taking into consideration their crimes, duration of stay on death row and personal circumstances.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26182920/death-penalty.jpg",
            "description": "<p>By Leopold Munhende MORE than half of Zimbabweans surveyed by Afrobarometer believe the death penalty is a fair punishment for those who commit heinous crimes, the continental organisation’s latest report has revealed. The survey was conducted a few months before the abolishment, on December 31, 2024. Touted as a progressive move by Amnesty International in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/despite-progressive-move-to-scrap-death-penalty-new-survey-reveals-majority-of-zimbabweans-want-it-back/\">Despite progressive move to scrap death penalty, new survey reveals majority of Zimbabweans want it back</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Foreigners can’t dictate South Africa’s affairs – Operation Dudula leader hits back at Zanu PF as Zimbabweans face hospital bans",
            "url": "https://www.newzimbabwe.com/foreigners-cant-dictate-south-africas-affairs-operation-dudula-leader-hits-back-at-zanu-pf-as-zimbabweans-face-hospital-bans/",
            "content": "By Staff Reporter\n\nOPERATION Dudula leader ZandileDabula has hit back at Zanu PF spokesperson Farai Marapiras remarks that the movement betraysubuntu, insisting that no foreigner will dictate how South Africa runs its affairs.\n\nMarapira, the ruling party Zanu PFs information director, told IOL News that the ongoing campaigns against undocumented migrants were a betrayal ofubuntuand a continuation of colonial-era tactics of dividing Africans.\n\nThere is currently an ongoing xenophobic denial of healthcare access to foreign nationals who are being accused of straining the neighbouring countrys already overstretched public resources.\n\nSome of the targeted foreigners are Zimbabweans, who make up a large portion of undocumented immigrants in South Africa and are being chased out of public hospitals.\n\nZanu PF Information Director Farai Marapira\n\nResponding to Marapiras remarks on ubuntu, Dabula said foreigners cannot decide how South Africa should be governed.\n\nWe will not be dictated to by foreigners on how to run our country. We have the Constitution that is supposed to be guiding us, we have immigration laws that we use as guiding documents, shesaid.\n\nDabula added thatZanu-PF was oppressing its citizens and warned that the partys ties with the ANC pose a threat to South Africa, claiming the country risks sliding into the same crisis that Zimbabwe faces.\n\nZanu-PF is a problem for the people of Zimbabwe. They have been voted out, but they are still continuing to bully people.\n\nTheir relationship with the ANC is very problematic to us as South Africans because we can see that we are heading to the state where Zimbabwe is at currently, she added.\n\nSouth African authorities have long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10045549/Operation-Dudula-leader-Zandile-Dabula.jpeg",
            "description": "<p>By Staff Reporter OPERATION Dudula leader Zandile Dabula has hit back at Zanu PF spokesperson Farai Marapira’s remarks that the movement betrays ubuntu, insisting that no foreigner will dictate how South Africa runs its affairs. Marapira, the ruling party Zanu PF’s information director, told IOL News that the ongoing campaigns against undocumented migrants were a betrayal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/foreigners-cant-dictate-south-africas-affairs-operation-dudula-leader-hits-back-at-zanu-pf-as-zimbabweans-face-hospital-bans/\">Foreigners can’t dictate South Africa’s affairs – Operation Dudula leader hits back at Zanu PF as Zimbabweans face hospital bans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Industry worried over Central Bank MPS’s impact on demand",
            "url": "https://www.newzimbabwe.com/industry-worried-over-central-bank-mpss-impact-on-demand/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) has warned that while the Reserve Bank of Zimbabwes (RBZ) tight Monetary Policy Statement (MPS) has helped ease inflationary pressures, it has also significantly dampened demand.\n\nThe RBZ has maintained a restrictive monetary policy to stabilise prices, the exchange rate, and the Zimbabwe Gold (ZiG) currency. Current measures include a high policy rate of 35%, a statutory reserve requirement of 15% for savings and time deposits, and 30% for demand and call deposits.\n\nThe policy framework is designed to support the ZiG, which was introduced to restore confidence and stability in the economy. The central bank has been working to maintain the currencys stability against the US dollar.\n\nIn its latest inflation tracker, CZI noted that while the fall in inflation confirms the effectiveness of the current monetary stance in stabilising prices, the downside has been a steep decline in aggregate demand.\n\nWhile tight liquidity is helping stabilise prices, it also has negative implications on demand and hence business output and growth. Therefore, in the long term, monetary policy has to ease tight liquidity conditions as stability becomes sustainable, the industry grouping said.\n\nCZI said keeping inflation below 1% enhances price stability and goes a long way in broadening the use of ZiG beyond a transaction currency, while acknowledging that businesses that previously preferred to trade in USD transactions only are beginning to slowly encourage ZiG payments to help them settle some of their monthly obligations.\n\nThe industry grouping said the high annual inflation rate of 93,8% is still reflective of the September 2024 devaluation of ZiG, hence will only ease in October, provided there is no other shock in the inflation drivers to cause high month-on-month inflation.\n\nIn comparison, the US$ prices remained the same between July and August 2025 as the main driver of USD inflation (S.I. 81A of 2024) was repelled in early 2025. Some of the possible signals to be derived from the stable USD prices include greater predictability in input and output costs for businesses that largely operate in US$.\n\nThe industry grouping warned that the gap between the official and parallel market rates could motivate traders to abandon the formal market.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/07022039/Reserve-Bank.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) has warned that while the Reserve Bank of Zimbabwe’s (RBZ) tight Monetary Policy Statement (MPS) has helped ease inflationary pressures, it has also significantly dampened demand. The RBZ has maintained a restrictive monetary policy to stabilise prices, the exchange rate, and the Zimbabwe Gold (ZiG) currency.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/industry-worried-over-central-bank-mpss-impact-on-demand/\">Industry worried over Central Bank MPS’s impact on demand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "ZIMRA’s new presumptive vehicle taxes could push prices up, worsen poverty – legislator",
            "url": "https://www.newzimbabwe.com/zimras-new-presumptive-vehicle-taxes-could-push-prices-up-worsen-poverty-legislator/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Revenue Authority (ZIMRA)s newly introduced presumptive taxes will burden vulnerable citizens already struggling with stagnant salaries and rising living costs, Norton legislator Richard Tsvangirayi has said.\n\nZIMRA yesterday announced new presumptive vehicle taxes, which go up to as much as US$500.\n\nThe new presumptive monthly taxes are as follows: commuter omnibuses US$50 for 8 to 14 passengers, US$60 for 15 to 24 passengers, US$80 for 25 to 36 passengers and US$100 for 37 passengers and above.\n\nTaxi cabs of not more than 7 passengers are now required to pay US$35 per month.\n\nDriving schools will also have to pay US$50 for class 4, and US$100 for class 1 and 2.\n\nGoods vehicles more than 10 tonnes but less than 20 tonnes are now required to pay US$200 and more than 20 tonnes US$500, while 10 tonnes or less but with a combination of truck and trailers of more than 15 but less than 20 tonnes US$500.\n\nResponding to these new taxes Tuesday, Tsvangirayi warned that this will only drive up the prices of goods and services while worsening poverty.\n\nThe new presumptive taxes introduced by ZIMRA are unfair and will have a direct negative impact on the most vulnerable in our society.\n\nSalaries have remained stagnant, yet taxes continue to rise, pushing the cost of goods and services beyond the reach of many. This will only deepen poverty, running contrary to the SDGs, particularly the goal of eradicating poverty, as well as the objectives of NDS1, which seeks to reduce the cost of doing business, Tsvangirayi said.\n\nNorton MP Richard Tsvangirayi\n\nHe also urged ZIMRA to pursue incentive-based strategies to boost compliance instead of punitive measures that threaten livelihoods.\n\nWhile the intention may be to encourage companies to register, formalise their operations, and increase government revenue, alternative strategies must be pursued.\n\nThese strategies should focus on incentivising compliance rather than relying on punitive measures that exacerbate the economic hardships already faced by ordinary citizens. In this regard, ZIMRA must urgently revise these figures downwards to ensure fairness and protect livelihoods.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/06225722/zimra-taxes.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Revenue Authority (ZIMRA)’s newly introduced presumptive taxes will burden vulnerable citizens already struggling with stagnant salaries and rising living costs, Norton legislator Richard Tsvangirayi has said. ZIMRA yesterday announced new presumptive vehicle taxes, which go up to as much as US$500. The new presumptive monthly taxes are as follows: commuter</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimras-new-presumptive-vehicle-taxes-could-push-prices-up-worsen-poverty-legislator/\">ZIMRA’s new presumptive vehicle taxes could push prices up, worsen poverty – legislator</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Mob justice suspected after Zimbabwean man brutally murdered in Limpopo",
            "url": "https://www.newzimbabwe.com/mob-justice-suspected-after-zimbabwean-man-brutally-murdered-in-limpopo/",
            "content": "By Jonisayi Maromo | IOL\n\nPolice in Limpopo have launched an investigation into a suspected mob justice incident after the body of a man, believed to be a Zimbabwean national, was discovered in Mooihoek, Driekop. The victim, who is thought to be in his 30s, was found with severe injuries consistent with a brutal assault.\n\nPolice responded to a report of a murder at about 6:30 am on Sunday. On arrival, they discovered the mans body with multiple injuries, believed to have been inflicted with stones and bottles. Paramedics declared him dead at the scene.\n\nColonel Malesela Ledwaba, the provincial police spokesperson, confirmed that the motive for the killing is still under investigation and appealed for the publics help.\n\nWe are treating this as a serious case of mob justice and are appealing to community members with any information to come forward, said Ledwaba.\n\nThe circumstances around the mans death are still unknown, and we urge anyone who can assist in tracing his next of kin or can provide information that leads to the arrest of the suspects to contact the police immediately.\n\nAnyone with information is urged to contact Detective Sergeant Mmatlou Nkoana at 082 716 8075, the Crime Stop number 08600 10111, the nearest police station, or use the My SAPS App, he said.\n\nIn another case,a 34-year-old woman is expected to appear before the Malamulele Magistrates Court on Tuesday, following her arrest in connection with a mob-justice incident at Mphakati village under the Saselamani policing area.\n\nColonel Ledwaba said the horrific murder incident occurred on Sunday morning.\n\nPolice were conducting patrol duties when they were informed about members of the community who were busy assaulting a male victim at the village. They reacted swiftly and rushed to the vicinity and found a male victim lying in the middle of the road with severe injuries on his body, said Ledwaba.\n\nEmergency medical services were summoned, and he was declared dead on arrival at the scene.\n\nPreliminary investigations revealed that the deceased was forcefully dragged from his residence by a mob who accused him of stealing a laptop from a nearby house, said Ledwaba.\n\nPolice said the arrested woman was positively identified as one of the participants in the brutal attack. Several other suspects are still at large.\n\njonisayi.maromo@iol.co.za\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09172200/SA-police-.png",
            "description": "<p>By Jonisayi Maromo | IOL Police in Limpopo have launched an investigation into a suspected mob justice incident after the body of a man, believed to be a Zimbabwean national, was discovered in Mooihoek, Driekop. The victim, who is thought to be in his 30s, was found with severe injuries consistent with a brutal assault.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mob-justice-suspected-after-zimbabwean-man-brutally-murdered-in-limpopo/\">Mob justice suspected after Zimbabwean man brutally murdered in Limpopo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Zimbabwe ranked among world’s best countries to visit in 2025, according to travel experts",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranked-among-worlds-best-countries-to-visit-in-2025-according-to-travel-experts/",
            "content": "Business Insider Africa\n\nIf 2025 is the year youre finally planning that big trip, travel experts say Zimbabwe and Morocco should be high on your list. Global travel platform Kayak has named both countries among the worlds best places to visit in 2025, drawing on its latest Travel Check-in report.\n\nThe ranking highlights destinations that balance adventure with relaxationfactoring in everything from wellness escapes and city-hopping potential to opportunities for slow, low-intensity travel.\n\nZimbabwe is at the top of the list of the worlds best countries to visit in 2025. The country is a land of wild beauty and rich history. Think rocky granite outcrops rising above golden plains, acacia trees swaying under endless skies, and ancient ruins that whisper stories of the past.\n\nAt Great Zimbabwe, those iconic stone walls still stand strong, a reminder of centuries of civilisation.\n\nOver at Victoria Falls, the mighty Zambezi crashes down so hard it throws up mist that often catches the sun in fleeting rainbows.. And if youre after something calmer, the Eastern Highlands bring misty mountains, winding trails, and a kind of peace you didnt know you needed.\n\nWhy its on the radar: Zimbabwes cities are drawing fresh interest: flight searches to Bulawayo have jumped more than 80% on Kayak, while Harare has seen a 56% rise for summer travel this year.\n\nMorocco comes in 6th on the list, making it the second African country to feature. The country offers a blend of desert magic, mountain drama, and vibrant city life. Out in the Sahara, youve got endless red dunes under silent skies.\n\nThe Atlas Mountains rise tall with snowy peaks, and down in the valleys, olive and argan groves scatter the hills. In Fez, the medina is a maze of narrow alleys, tiled courtyards, and the unforgettable smell of leather dyeing.\n\nMarrakech is a whole vibelantern-lit rooftops, busy souks, metalworkers hammering away, and sunset views over minarets. By the coast, Essaouira serves up salty sea winds and seagulls circling its blue-shuttered houses. And for the dreamiest scene of all, Chefchaouens blue-painted streets wind up toward the Rif Mountains.\n\nEarlier this year, Morocco emerged as Africas most visited destination, attracting17.4 million visitors in 2024, according to its Ministry of Tourism.\n\nWhy its on the radar: Marrakech stands out as one of the best-value long-haul destinations with flight prices down 5% compared to summer last year on Kayak.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21060705/vic-falls.jpeg",
            "description": "<p>Business Insider Africa If 2025 is the year you’re finally planning that big trip, travel experts say Zimbabwe and Morocco should be high on your list. Global travel platform Kayak has named both countries among the world’s best places to visit in 2025, drawing on its latest Travel Check-in report. The ranking highlights destinations that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranked-among-worlds-best-countries-to-visit-in-2025-according-to-travel-experts/\">Zimbabwe ranked among world’s best countries to visit in 2025, according to travel experts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        },
        {
            "title": "Rasta the Artist: From sketching Mandela, honouring legends and painting Africa’s heritage",
            "url": "https://www.newzimbabwe.com/rasta-the-artist-from-sketching-mandela-honouring-legends-and-painting-africas-heritage/",
            "content": "By Jonisayi Maromo | IOL\n\nSeptember isHeritage Month in South Africa a time to celebrate the nations cultural diversity, traditions, and stories that shape its identity. Few artists embody that spirit more than Lebani Rasta Sirenje, a painter whose bold portraits of iconic figures have made him one of the most recognisable cultural voices in the country.\n\nIm Lebani David Thaka Sirenje, born in Zimbabwe, Bulawayo in Pumula East, born to a Zimbabwean mother and a Mozambican father. I grew up in Bulawayo, went to Ingwegwe Primary School, and high schooled at Magwegwe Secondary School. My love for art started when I was in primary school at seven years, when I saw myself doing sketches at school and impressing my classmates who liked my art, he recalls.\n\nHis grandmother, MamMhlanga, played a key role in shaping his artistic path.\n\nIt is my grandmothers love for art that kept me going. She used to come from the rural areas of Zimnyama in Plumtree to buy fabrics from Bulawayo, so I would sketch on those materials and she would follow with different colours of wool and make beautiful designs. I would go with her to those villages to sell, and also design their mud huts with prints like Gogo Esther Mahlangus art.\n\nAs Im doing art now, Im so happy and always treasure the love that was shown by my granny. She always said Im gonna be a big artist. I dont think she meant this big  wayesho nje ukuthi ngizoba ngumdwebi  and I went all out and became this big. Unfortunately, she never saw me escalating to these heights of art, says Rasta.\n\nRasta the Artist with his painting of former president Nelson Mandela.\n\nRastas fame began in high school, when he sketched a portrait of Nelson Mandela straight from a television screen.\n\nMy fame rose from high school when I sketched the former president Nelson Mandela, copying it from a TV screen. I took it to my class, they showed my teacher, then my teacher took it to the principal. I had to explain to myself how I did it. It felt as if I did something wrong, but I was cheered, and the whole school was amazed. We were not familiar with his face, and I illustrated Mandela. If there were socials back then, I was gonna trend, he says.\n\nFrom that moment, he realised the power of his art to connect people with history.\n\nIm inspired by daily living and people who are doing great in our lifetime, as I paint those who have passed on and those who are here with us, making a difference in our lives, to celebrate them as well when they are still alive.\n\nIt started when I saw a gap in that kind of honoring. As we put tombstones on their tombs, for me, it is to do a painting that will last in their lives and be treasured for generations to come. I painted the late Brenda Fassie, Walter Sisulu way back in 2003. So it started way back, even before socials, to say Im not here for trends but for the culture I created.\n\nHis work has since gained global recognition.\n\nI even see some artists as well doing art when there is a legend who has passed on. Good turn up to the creatives, as Im the one to remember. When you raise art, other artists applaud me and say you are great, you set the bar, they follow. Im popular in all the corners of the world, and you will hear a chat about me and my art. Im impressed that I will leave a legacy  from sketchbooks to history books, says Rasta.\n\nFor Rasta, Heritage Month is more than a calendar event  its a reminder of identity, pride, and unity. In this picture, the popular artist is seen with his portrait for Winnie Mandela Image: Rasta the Artist\n\nBeyond galleries, Rastas work has made its way into film, television, and advertising.\n\nIm featured in musical videos, films, and adverts. I did paintings in theGomorafilm and featured in the film. I didDiepCity, where I painted the late Brenda Fassie, HHP, Mandoza on a background wall, and other paintings that were at the bar. It was a big project from Black Brain. They called me again to do the walls in the rooms ofBlack Doorfilm.\n\nI did aChicken Licken advert if there were awards for adverts, I was gonna take an award hahaha. I did a Ballantines Whiskey advert as well. Im looking forward to getting these calls again and being seen doing this other kind of art, he says.\n\nBut his creativity goes beyond painting.\n\nAt a young age, I thought I was gonna be a singer as I was in the school choir and an athlete in long-distance marathon at school. Later on, we formed our own group of isicathamiya where we sang in events as young as 14 years. I still have that passion. I hope I will have a chance and go to the studio and record a song in my career. I have to do that  watch this space, Rasta laughs.\n\nFor Rasta, Heritage Month is more than a calendar event  its a reminder of identity, pride, and unity.\n\nHeritage means Imvelaphi (origin)  our culture, our religion, our beings. Its a pity that we only consider and touch our roots once a year in this month, where we wear our different traditional attire, and show the world how we love and embrace our culture.\n\nAs an artist, I get touched and wish that we can always have our cultures meet regularly, not only during Heritage Month or Heritage Day. Lets hope one day this can be recognized every month. Its so good when we see our different attire collaborating, and those colourful beads that are worn  they are closer to our being as Africans, we are proud.\n\nRasta the artist seen here with his painting of EFF leader Julius Malema. Image: Rasta the Artist\n\nAlso in art it fits. We see a lot of exhibitions, art being involved to honour these days of our Heritage Month, he says.\n\nAnd his message for Africans is clear:\n\nAfricans, lets hold hands and stand tall. This is us. No tribalism, no xenophobia acts in oneself. We are all one, Rasta declares.\n\nLooking ahead, Rasta dreams of creating an academy to nurture young artists.\n\nI wish and hope one day I will have an initiative that will cater to young upcoming artists in music, acting, craft, and visual art  an academy with a gallery to hang works for upcoming artists so they get a chance to show their works.\n\nAs a community, we need to lift one another to flourish. Im so proud to say one day I will fulfil my dreams and see artists being respected and honoured as well. I need a sponsor so we can break ground and have the building where we will create jobs and take all the youth out of the streets, and give them something to do. Skills save the lives of our youth.\n\nIn my community, there are kids and youth who ask me when I am opening my academy. Im worried because I dont have an answer. I use my own materials to help these young artists do art. Way back, I had a sponsor, I had a class in Hillbrow Theatre, Hillbrow Recreation Centre, and Mother Johnsons place in Hillbrow, but I was overpowered by a lack of funding. It was not easy to say they have to pay.\n\nI need help to get a proper studio where I work. Its not good to display my art and have a class at the same time, says Rasta.\n\njonisayi.maromo@iol.co.za\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09171915/rasta.png",
            "description": "<p>By Jonisayi Maromo | IOL September is Heritage Month in South Africa — a time to celebrate the nation’s cultural diversity, traditions, and stories that shape its identity. Few artists embody that spirit more than Lebani “Rasta” Sirenje, a painter whose bold portraits of iconic figures have made him one of the most recognisable cultural voices in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rasta-the-artist-from-sketching-mandela-honouring-legends-and-painting-africas-heritage/\">Rasta the Artist: From sketching Mandela, honouring legends and painting Africa’s heritage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:30",
            "date": "10 Sep 2025"
        }
    ]
}