{
    "news": [
        {
            "title": "DStv cuts ties with MacG’s Podcast and Chill",
            "url": "https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/",
            "content": "The Citizen\n\nFollowing a controversial statement about one of South Africas loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform.\n\nMacG has been in the hot seat after making a comment about media personality Minnie Dlaminis private part in one of the episodes. However, Dstv did not air the episode in question; it was only aired on the Podcast and Chill channel on YouTube.\n\nDstvs digital distribution partner, Leading Edge Growth, confirmed toTimeslivethat Dstv has removed the popular podcast.\n\nLeading Edge Growth CEO Lufuno Maliavusa gave the confirmation that the show has been pulled.\n\nCiting To keep our content slate dynamic and engaging, we will continue to make adjustments to our roster. Notably, season one ofPodcast and Chilland season one ofAwkward Datesare nearing their final episodes in the coming weeks, making way for fresh and exciting content to take their place in these time slots.\n\nThis follows after MultiChoice refused to confirm the news of the shows cancellation. The Group only said it licensed a slate of podcasts from Leading Edge Growth, which was responsible for curating the podcast slate, taking into account audience dynamics and content demand.\n\nHowever, MacG is reportedlyunmoved by the news, as he is pursuing other endeavours.\n\nThe episode that spoke about Dlaminireceived attention from the Deputy Ministerof Women, Youth and Persons with Disabilities, Mmapaseka Steve Letsike.\n\nShe said MacGs comments were nauseating in their vulgarity and must be regarded as an unconstitutional violation of Dlaminis rights to freedom and security of the person, equality, and human dignity as enshrined in the Constitution of the Republic of South Africa.\n\nLetsike wanted MacG to be referred to the Parliaments Portfolio Committee, however,this was declined.\n\nI think the majority of members are not in favour of us proceeding as the honorable minister, deputy minister had requested us to do, the committees chairperson Liezl van der Merwe said.\n\nShe pointed out that Dlamini had not approached Parliament nor laid a criminal case.\n\nI think all of you have touched on this point that if we do decide it is our mandate to proceed with hearing one case of cyber-bullying, it would mean that this portfolio committee would have to extend that to every other person because they cannot be selective in choosing one case.\n\nMacG has since apologisedin one his episodes, saying he never intended to offend anyone.\n\nI want to apologise, first and foremost, to all the female chillers, and women in general in SA, I might have offended with that comment. That was not the intention. We never say things to offend people, he said.\n\nI want to extend an invite to Minnie Dlamini to the show. You are more than welcome to come.\n\nThis thing started on the podcastlets end it on the podcast. She said some things, I said some things. Lets squash it once and for all.\n\nDlamini saidshe was hurt and shocked by the commentsmade about her body and personal life on the podcast.\n\nOver the past few weeks, I have watched in disbelief and deep pain as my name, body, and dignity were dragged through the mud of public discourse, she said.\n\nShe described the remarks made by MacG as vile, humiliating, and inexcusable.\n\nDlamini said she is taking legal action to stand up for herself and the dignity of women.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27042300/MacG.jpg",
            "description": "<p>The Citizen Following a controversial statement about one of South Africa’s loved celebrities by Podcast and Chill host Macgyver Mukwevho, popularly known as MacG, Dstv has decided to stop airing the show on its platform. MacG has been in the hot seat after making a comment about media personality Minnie Dlamini’s private part in one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dstv-cuts-ties-with-macgs-podcast-and-chill/\">DStv cuts ties with MacG’s Podcast and Chill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "27 May 2025"
        },
        {
            "title": "Sean Fusire eyes international debut with Zimbabwe",
            "url": "https://www.newzimbabwe.com/sean-fusire-eyes-international-debut-with-zimbabwe/",
            "content": "Footboom\n\nSean Fusire, the 19-year-old midfield dynamo who previously sharpened his skills on loan at Carlisle United, is reportedly gearing up to step onto the international stage by committing to play for Zimbabwe. The anticipation of his potential debut is palpable, as the young talent looks to make his mark on the world stage.\n\nHailing from Sheffield, with Zimbabwean roots coursing through his veins, Fusire has captured the attention of the Zimbabwean Football Association. This move could see him join a burgeoning roster of UK-based players proudly donning the Zimbabwean jersey, a decision that adds a new chapter to his promising career.\n\nIn an exciting revelation, Marshall Gore, chairperson of the Zimbabwean Football Associations global and diaspora committee, announced the news following a pivotal meeting with Fusire and his father in London. Gore enthusiastically revealed that the midfielder has officially embarked on the process of obtaining a Zimbabwean passport, setting the stage for his international representation.\n\nExciting news! Were thrilled to announce that Sheffield Wednesdays Sean Fusire has committed to represent Zimbabwe, Gore declared with enthusiasm. Sean was among the talented players scouted during the UK tour by our astute coach Michael Nees.\n\nIf Fusire pulls on the Warriors jersey, he will join a squad that already boasts several British-based talents. This includesLuton Towns Marvelous Nakamba, Wolverhampton Wanderers Marshall Munetsi,Brentfords Marley Tavaziva,Cardiff Citys Andy Rinomhota, andMotherwells Tawanda Maswanhise. Together, they form a formidable lineup that promises to bring flair and skill to the international arena.\n\nFusires stint at Carlisle United, which kicked off in January 2025, saw him make 14 appearances under the guidance of managers Mike Williamson and Mark Hughes. Notably, he was a fixture in the clubs final seven matches, where he dazzled fans and staff alike with his performances, leaving a lasting impression on all who watched.\n\nReflecting fondly on his time at Carlisle, Fusire described the experience as representing a great city and great club, underlining the profound impact this loan spell had on his development as a player.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27041455/sean-fusire-Sheffield-Wednesday.jpeg",
            "description": "<p>Footboom Sean Fusire, the 19-year-old midfield dynamo who previously sharpened his skills on loan at Carlisle United, is reportedly gearing up to step onto the international stage by committing to play for Zimbabwe. The anticipation of his potential debut is palpable, as the young talent looks to make his mark on the world stage. Hailing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-fusire-eyes-international-debut-with-zimbabwe/\">Sean Fusire eyes international debut with Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "27 May 2025"
        },
        {
            "title": "Unifreight bemoans Zimbabwe’s high operating costs",
            "url": "https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/",
            "content": "By Alois Vinga\n\nLISTED transport and logistics concern, Unifreight Africa Limited says the countrys tough economy added to high licensing fees is making operations very tough.\n\nIndustry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy are clogged with very costly, repetitive licensing fees, choking the ease of doing business.\n\nEchoing similar sentiments recently, Unifreights CEO, Richard Clarke, bemoaned the exorbitant licensing fees affecting transport sector players in the country.\n\nIn the transport sector specifically, operating costs in Zimbabwe are significantly higher than in neighbouring countries, which continues to squeeze margins. For example, fuel in Zimbabwe remains the most expensive in the region at around US$1,58 per litre, compared to about US$1,01 in Zambia. Vehicle registration and licensing fees are also exorbitantly high at roughly US$1,560 locally versus just US$132 in Zambia, he said.\n\nAdditionally, he said, diesel imports carry heavy duties (approx. USD 0.55 per litre)withexporters being forced to surrender 25% of foreign earnings for conversion into local currency (ZWG), which cannot be freely converted back to US$ at market rates.\n\nClarke said the combination of these challenges, added to currency volatility, liquidity constraints, inflationary pressures and a shortage of long-term financing in the local market, led many businesses to tighten their belts, creating a knock-on effect across supply chains.\n\nThe company said compounding cost pressures is the ongoing liquidity crunch in the banking sector prompting many financial institutions to pull back on lending, forcing companies, including Unifreight and our customers, to rely on shorter-term and more expensive financing.\n\nThese factors make operating a cross-border fleet out of Zimbabwe less attractive and more costly than regional competitors, Clarke said.\n\nMeanwhile, during the period, Unifreight Africa Limited delivered a strong start to 2025, with significant revenue growth in Q1.\n\nTotal revenues for the quarter surged by over 30% compared to the same period last year, reflecting robust demand and the success of recent strategic initiatives. Annual turnover rose from US$20.4 million in 2023 to US$24 million in 2024, and is forecast to reach US$32 million in 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03015012/Unifreight-Africa-which-operates-well-known-logistics-brands-including-Swift-Skynet-and-Bulwark-has-not-been-immune-to-these-challenges-Picture-Supplied.webp",
            "description": "<p>By Alois Vinga LISTED transport and logistics concern, Unifreight Africa Limited says the country’s tough economy added to high licensing fees is making operations very tough. Industry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/\">Unifreight bemoans Zimbabwe’s high operating costs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "27 May 2025"
        },
        {
            "title": "Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/",
            "content": "IOL\n\nThe Polokwane Magistrates Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.\n\nLast week, Mashaba said Moyo was arrested during a joint operation comprising the SAPS anti-smuggling task team, Tshimollo Security and Investigation, Reflex Anti-hijacking Security, and Tracker SA.\n\nTheToyota RAV4was intercepted at approximately 8 pm (on Wednesday) near Shell Ultra City in Polokwane on the N1 highway, said Mashaba.\n\nZimbabwean man, Mhlalisi Moyo, was remanded in custody by the Polokwane Magistrates Court after he was arrested for possession of suspected stolen motor vehicle, a Toyota RAV4. Image: SAPS\n\nThe sport utility vehicle was reported stolen in Brooklyn, Tshwane.\n\nThe 43-year-old foreign national male was arrested at the scene, said Mashaba.\n\nOn Friday,IOL reported that the Mokopane Magistrates Court remanded 34-year-old Lucky Msizi Tshabanguin custody after he was arrested in Limpopo, while driving a stolen vehicle towards Zimbabwe.\n\nAt the time, Mashaba said the case against Tshabangu was postponed to Monday, enabling him to get legal representation.\n\nTshabangu is facing charges of possession of a suspected stolen motor vehicle, as well as reckless and negligent driving after he allegedly tried to flee from police.\n\nThe 34-year-old South African national was arrested at Mokopane last week, and police believe he was travelling to Zimbabwe with the stolen vehicle.\n\nLucky Msizi Tshabangu, 34, was remanded in custody after he was arrested in Limpopo, while allegedly driving a stolen Toyota Corolla Cross vehicle towards Zimbabwe. Image: SAPS\n\nIn an intelligence-driven operation, police officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101, which was en route to the Beitbridge port of entry, said Mashaba.\n\nInvestigations revealed that this vehicle had been reported stolen from the Wierdabrug policing area in Tshwane on Friday (16 May 2025).\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has praised the vigilance of all law enforcement units involved.\n\nThe recovery of these twelve vehicles represents a significant blow to this criminal networks. Our officers and their partners continue to work tirelessly to dismantle these syndicates that threaten our communities and economy, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27035716/Screenshot-2025-05-27-at-04.55.57.png",
            "description": "<p>IOL The Polokwane Magistrate’s Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/\">Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "27 May 2025"
        },
        {
            "title": "Activists call for democracy in Swaziland, Zimbabwe at Johannesburg Africa Day march",
            "url": "https://www.newzimbabwe.com/activists-call-for-democracy-in-swaziland-zimbabwe-at-johannesburg-africa-day-march/",
            "content": "By Kimberly Mutandiro | Ground Up\n\nMore than one hundred people gathered at Fitzgerald Square in Newtown, Johannesburg, to participate in a solidarity walk for Africa Day. Activists, civil society organisations, trade unions, and immigration organisations joined the march.\n\nAfrica Day marks the day the Organisation of African Unity, the precursor to the African Union, was formed.\n\nThe event kicked off with song, dance, and speeches at Mary Fitzgerald Square. Led by drummers, they then marched through the streets of Johannesburg, bringing traffic to a halt. Along Queen Elizabeth Bridge, more speeches were made before marchers proceeded to Constitution Hill in Braamfontein.\n\nMarchers carried colourful banners showing their support for different struggles, from calling for democracy in Swaziland and peace in Palestine, to the end of coal use in South Africa. The marchers also opposed tyranny in other African countries and celebrated victories of the past, from the fall of colonialism to the defeat of apartheid.\n\nWe are calling for the end to absolute monarchy in Swaziland and an end to dictatorial leaders in Congo, Southern Cameroon, Zimbabwe, and South Sudan. We are rising on this walk to build unity and to share our unique stories as Africans, said General Moyo, one of the march conveners from the organisation Keep Left.\n\nSpeakers demanded an end to the plundering of Africas minerals. They condemned xenophobia and called for the eradication of colonial borders in Africa.\n\nOur kids are stateless because of borders, and our people are being harassed because of borders. We should fight against brutal colonial borders to create one Africa, said Rose Roshoa from the Free Basotho Movement.\n\nRoshao said people from Lesotho who work in South Africa as domestic workers and on farms were facing arrests due to struggles with documentation.\n\nMametlwe Sebei, GIWUSA president, called for unity among African workers in South Africa. He accused the ruling elites in the country of inciting xenophobia against African migrants while touting platitudes about African unity.\n\nThis article was first publishedhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27050021/africa-day.jpg",
            "description": "<p>By Kimberly Mutandiro | Ground Up More than one hundred people gathered at Fitzgerald Square in Newtown, Johannesburg, to participate in a solidarity walk for Africa Day. Activists, civil society organisations, trade unions, and immigration organisations joined the march. Africa Day marks the day the Organisation of African Unity, the precursor to the African Union,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/activists-call-for-democracy-in-swaziland-zimbabwe-at-johannesburg-africa-day-march/\">Activists call for democracy in Swaziland, Zimbabwe at Johannesburg Africa Day march</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "27 May 2025"
        }
    ]
}