{
    "news": [
        {
            "title": "A coronation not a contest – Tanzania’s first female president faces little opposition",
            "url": "https://www.newzimbabwe.com/a-coronation-not-a-contest-tanzanias-first-female-president-faces-little-opposition/",
            "content": "BBC\n\nWith no heavyweightopposition candidates cleared to compete in Wednesdays election, many Tanzanians feel the vote is less like a contest and more like a coronation for President Samia Suluhu Hassan, as she faces her first presidential election.\n\nThe 65-year-old became the East African nations first female head of state after the death in 2021 of sitting President John Magufuli. He was admired on the one hand for his no-nonsense drive to stamp out corruption but criticised on the other for his authoritarian clampdown on dissent and controversial attitude towards the Covid pandemic.\n\nPresident Samia, who had been vice-president, seemed like a breath of fresh air  and with her warmer and friendlier style, she initiated reforms that seemed to represent a radical departure from her predecessors policies.\n\nHer four Rs policy  reconciliation, resilience, reform and rebuilding  reopened Tanzania to foreign investors, restored donor relations and mollified the International Monetary Fund (IMF) and World Bank.\n\nShe made a difference, the lost relationship between Tanzania and international organisations such as World Bank was restored, political analyst Mohammed Issa told the BBC.\n\nBut over the last two years or so, the political space has drastically shrunk  and the targeting of government critics and opposition voices is said to be more ruthless now than it ever was under Magufuli, with regular abductions and killings now reported.\n\nSamia came in with a conciliatory tone, but now she has become bold and makes tough decisions that many did not expect from her, said Mr Issa.\n\nShe is now widely blamed for some things like abductions, killings, repression of opposition and other issues on security.\n\nThis is reflected in reports by Freedom House, a US-based democracy and human rights advocacy group, which ranked Tanzania as partly free in 2020 and not free last year.\n\nThe government has not commented on the allegations.\n\nSamias CCM has won every election since the reintroduction of multi-party democracy in 1992, but the campaigns are usually vibrant with robust debate between the rival parties.\n\nWhile the electoral commission has cleared 17 presidential candidates to stand this time, the main opposition party, Chadema, is barred with its leader, Tundu Lissu, currentlyon trial for treason.\n\nHe had been calling for electoral reforms before his arrest in April  and the party is now urging its supporters to boycott the poll.\n\nHis deputy, John Heche,was also arrested last week and told the BBC just before his detention that President Samias so-called reforms were hollow: Yes, rallies were allowed again, but today Chadema cant do its mandate because the promises were fake.\n\nMeanwhile, presidential hopeful Luhana Mpina, from the second largest opposition party, ACT Wazalendo, has also been disqualified  twice.\n\nHe had managed to get his candidacy reinstated by the High Court after he was barred over a procedural issue  but when the Attorney General appealed last month, the electoral commission decided to uphold the disqualification.\n\nThis leaves smaller opposition parties like Chaumma and CUF in the race, but in reality there is no chance of them stopping Samia winning her first personal mandate.\n\nThe ruling partys control, exclusion of the opposition and institutional bias undermine electoral credibility. Limited civic space and low voter engagement further weaken inclusiveness, said political analyst Nicodemus Minde in a recent report for the Institute for Security Studies (ISS) think-tank.\n\nThis has left some would-be voters, like Dar es Salaam resident Godfrey Lusana, despondent.\n\nWe do not have an election without a strong opposition. The electoral system is not independent. We already know who will win. I cant waste time to vote, he told the BBC. If the electoral commission was really independent, I would have voted.\n\nThe islanders elect their own regional president and incumbent Hussein Mwinyi of the CCM is seeking another term, but faces stiff competition from ACT-Wazalendos Othman Masoud  who has been serving as his deputy in a unity administration.\n\nOn the campaign trail on the mainland, President Samia has capitalised on the initial praise she received for her motherly approach  seeking to govern through dialogue rather than decree.\n\nThis earned her the nickname Mama Samia  and at her rallies she has been promising to bring widespread development through better infrastructure, health and education.\n\nMany women, especially those in rural communities, see her as a stabilising force.\n\nShe brings dignity, we young women look up to her. We feel her presence as the president and that gives us confidence that we can be reliable to our communities now and in the future, first-time voter Queen Castoric from the northern city of Tanga told the BBC.\n\nBut some women in urban areas, like Celina Ponsiana, who will also be casting her ballot for the first time in Dar es Salaam, are more equivocal: Leadership isnt only about tone.\n\nI believe the president has a task to do, first on unemployment. She has been supporting some but many still need help, she said.\n\nAnother young woman in Morogoro, near Dar es Salaam, said she supported the president but refused to give her name to the BBC in case she faced a backlash from her contemporaries.\n\nSamia made us believe women can lead. I would love to say more, but many youth dont talk positively about her, she said.\n\nYoung people make up the majority of Tanzanias 37.7 million people registered voters  and there is anger from some over the presidents silence on issues like the shocking abductions.\n\nAnd while some give credit to President Samia for stabilising the economy, in some quarters there is even nostalgia for Magufuli given the rising reports of corruption.\n\nHer tougher approach of late may come down to several issues.\n\nIn a traditionally male-dominated society, she has faced problems asserting her authority. At recent rallies she has been reminding voters who is boss: Dont forget I am chief of the defence forces.\n\nShe may also feel undermined by colleagues. Within the CCM, there was some opposition to the fact that she became the partys presidential candidate unchallenged.\n\nThere is also a suggestion that she has in fact become the pawn of a powerful network of business tycoons and other influential CCM backers, known colloquially as Mtandao, according to Mr Minde in his ISS report.\n\nInternal [CCM] party democracy has been stifled through an orchestrated move to make President Samia the sole candidate. While this has deepened divisions within the party, a faade of unity is being presented to the public, he said.\n\nIt is believed that Magufuli refused to take orders from the Mtandao, preferring to stick to his own anti-corruption agenda.\n\nMr Minde warns that this has all contributed to a prevailing sense of fear in the East African nation. With the self-censorship of the media and the shrinking of political discourse, public debate has retreated to private conversations and social media.\n\nAnalysts warn that such detachment, especially among young people, could hollow out Tanzanias democracy further  and create problems down the road for President Samia should there not be a big turnout and if protests kick off.\n\nFor Tito Magoti, a lawyer and young political activist, the demands remain simple.\n\nWe want a free Tanzania where anyone has the freedom to speak, he told the BBC.\n\nThe freedom of movement and the freedom to do anything they wish.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/07022606/Tanzanias-president-Samia-Suluhu-Hassan.png",
            "description": "<p>BBC With no heavyweight opposition candidates cleared to compete in Wednesday’s election, many Tanzanians feel the vote is less like a contest and more like a coronation for President Samia Suluhu Hassan, as she faces her first presidential election. The 65-year-old became the East African nation’s first female head of state after the death in 2021</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-coronation-not-a-contest-tanzanias-first-female-president-faces-little-opposition/\">A coronation not a contest – Tanzania’s first female president faces little opposition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Oct 2025"
        },
        {
            "title": "South Africa boosts deportations amid jobs crisis, minister says",
            "url": "https://www.newzimbabwe.com/south-africa-boosts-deportations-amid-jobs-crisis-minister-says/",
            "content": "Bloomberg\n\nSouth Africa is pushing to deport more undocumented migrants who compete with citizens for jobs in an economy with one of the highest unemployment rates globally, the minister overseeing the program said.\n\nThe nation is a neglected part of the global migration story, with the contestation between foreigners and locals for positions becoming a real tinderbox, Home Affairs Minister Leon Schreiber said in an interview on Bloomberg Television Friday. Weve deported 51,000 people in the last year  thats more than France and Germany combined. If we had more resources, wed be doing more of that.\n\nSouth Africa has the continents most industrialised economy and sees a constant influx of job seekers from neighbouring countries, including Zimbabwe and Mozambique. But with the unemployment rate running at 33.2%, tensions between locals and foreigners run high. About 8.4 million people are eligible to work yet dont have jobs.\n\nIn 2008, about 60 people died and 50 000 were displaced in a wave of xenophobic violence, with foreigners blamed for everything from unemployment to poor government services.\n\nThere were similar riots in 2015 and again in 2019, when President Cyril Ramaphosa was forced to apologize to other African nations who were appalled by the treatment of their citizens. Local media recently reported on incidents of foreigners being chased away from health clinics by angry residents.\n\nSouth Africa is managing the situation responsibly, said Schreiber, who is a member of the Democratic Alliance, the second-biggest member of the countrys 10-party governing coalition.\n\nWere anchoring what we do in the rule of law to make sure that we also protect social cohesion, even as we enhance our enforcement operations, he said.\n\nA so-called government of national unity was formed in June last year, when the ruling African National Congress failed to secure a parliamentary majority in a national vote for the first time since apartheid ended in 1994. The ANC and DA have since clashed repeatedly over policy and appointments, raising doubts over whether the alliance will remain intact.\n\nWere in a better space now than we were initially, Schreiber said, adding that disputes are quite normal in any society with a coalition government.\n\nThe coalition succeeded in navigating a budget impasse and with a new fiscal cycle about to begin, Schreiber said hes hopeful any differences can be resolved in a less public and destructive way.\n\nIf we can succeed in that, I think that builds another layer of confidence that we actually are working pretty well together, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23051938/leon-schreiber.jpg",
            "description": "<p>Bloomberg South Africa is pushing to deport more undocumented migrants who compete with citizens for jobs in an economy with one of the highest unemployment rates globally, the minister overseeing the program said. The nation “is a neglected part of the global migration story,” with the contestation between foreigners and locals for positions becoming “a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-boosts-deportations-amid-jobs-crisis-minister-says/\">South Africa boosts deportations amid jobs crisis, minister says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Oct 2025"
        },
        {
            "title": "Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final",
            "url": "https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/",
            "content": "By Sports Reporter\n\nHARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals.\n\nDembares ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time.\n\nSundays win gave Dynamos a chance to defend the Chibuku Super Cup, which they won in 2023 and 2024.\n\nDynamos took a first-half lead, thanks to Emmanuel Jalais 15th-minute strike.\n\nHowever, Bosso came back in the second half with determination and focus, which saw them score an equaliser in the 68th minute through Melikhaya Ncube.\n\nAfter playing a one-all draw in regulation time, the match headed straight for penalty shootouts, where they scored all their spot kicks, taking advantage of Bosso, who missed their fourth kick through Prince Ndlovu.\n\nDynamos coach Kelvin Kaindu could not hide his happiness as he praised his charges performance.\n\nIm happy; if you look, there is an improvement in how we are keeping possession as a team.\n\nOur performance was good; even in penalty shootouts, we proved to be the best, and I have to praise the boys, said Kaindu.\n\nDynamos will now play Triangle FC in the final, which is scheduled for next month on a date to be announced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter HARARE footballing giants, Dynamos have become the first club in Premier Soccer League (PSL) history to qualify for three consecutive Chibuku Super Cup finals. Dembare’s ticket to the final came after beating Highlanders 5-3 on penalties after playing a 1-1 draw in regulation time. Sunday’s win gave Dynamos a chance to defend</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-in-nail-biting-victory-against-highlanders-books-place-in-chibuku-super-cup-final/\">Dynamos in nail-biting victory against Highlanders, books place in Chibuku Super Cup final</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Oct 2025"
        },
        {
            "title": "Zimbabwe calls for unconditional removal of Western sanctions",
            "url": "https://www.newzimbabwe.com/zimbabwe-calls-for-unconditional-removal-of-western-sanctions/",
            "content": "Xinhua\n\nZimbabweans on Saturday marked Anti-Sanctions Day in Harare, the countrys capital, calling for the unconditional removal of Western sanctions imposed on the country over two decades ago.\n\nThe SADC Anti-Sanctions Day, commemorated on Oct. 25, was established by the Southern African Development Community (SADC), a 16-member regional organization, in 2019 as a collective regional initiative to denounce the sanctions, which were imposed on Zimbabwe following the countrys land reform program that redistributed land from minority white farmers to indigenous black Zimbabweans.\n\nIn his keynote address at the event, Zimbabwean President Emmerson Mnangagwa called for the complete and unconditional removal of the sanctions, saying that the country remains resolute in developing in the face of the illegal sanctions.\n\nThrough sanctions, some Western countries sought to punish us for asserting our sovereignty and pursuing equal economic development for the benefit and prosperity of the people of our beloved motherland, Zimbabwe, Mnangagwa said at the event, which was widely attended by government officials, members of the diplomatic community, business leaders, and Zimbabweans from all walks of life.\n\nMnangagwa said that despite the negative effects and other challenges and shocks such as climate change-induced droughts and public health emergencies, the national economy has been on a positive growth trajectory.\n\nOver the years, we have made tremendous progress in our efforts to promote a self-sufficient and food-secure nation. Comprehensive people-centered programs and projects have been put in place to enhance our agricultural productivity. Climate-proofing our agriculture has seen the country attain food self-sufficiency, he said.\n\nMnangagwa said that in navigating the path toward sustainable economic development, Zimbabwe requires access to flexible and reliable lines of credit, which are hindered by sanctions.\n\nRegrettably, the illegal economic sanctions have fundamentally disrupted the ability of our country to access global lines of credit. To ensure the continuity of our developmental agenda, my administration has adopted home-grown, innovative development financing models to drive our country forward, said the president.\n\nDespite the challenges posed by the sanctions, the country remains committed to multilateralism and international cooperation toward the realization of global peace, security, justice and equitable development, he added.\n\nMartin Zharare, executive director of Citizens Against Economic Sanctions, an anti-sanctions lobby group, said sanctions should be removed unconditionally as they impede economic growth.\n\nThe people of Zimbabwe stand with the governments position and say we are not going to support any initiative to have sanctions removed with conditions. We are standing firm to say the sanctions must be removed unconditionally, Zharare said.\n\nThe United States imposed sanctions on Zimbabwe in 2001 through the Zimbabwe Democracy and Economic Recovery Act, which restricted multilateral financing to the country.\n\nIn March last year, former U.S. President Joe Biden signed an executive order terminating the Zimbabwe sanctions program that had been in force since 2003 but immediately imposed sanctions on 11 individuals, including Mnangagwa and Vice President Constantino Chiwenga, over alleged human rights abuses and corruption under the Global Magnitsky Human Rights Accountability Act.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/26054937/Sanctions-10.png",
            "description": "<p>Xinhua Zimbabweans on Saturday marked Anti-Sanctions Day in Harare, the country’s capital, calling for the unconditional removal of Western sanctions imposed on the country over two decades ago. The SADC Anti-Sanctions Day, commemorated on Oct. 25, was established by the Southern African Development Community (SADC), a 16-member regional organization, in 2019 as a collective regional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-calls-for-unconditional-removal-of-western-sanctions/\">Zimbabwe calls for unconditional removal of Western sanctions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Oct 2025"
        }
    ]
}