{
    "news": [
        {
            "title": "Man kills ‘cheating’ wife after busting her with lover",
            "url": "https://www.newzimbabwe.com/man-kills-cheating-wife-after-busting-her-with-lover/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland Central province have arrested a Bindura man for killing his wife after catching her red-handed in a compromising position with another man suspected to be her lover.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Bindura arrested Justice Pondani (34) for a case of murder which occurred on February 12, 2025, at a house in Woodbooke, Chiwaridzo in Bindura.\n\nThe suspect attacked his wife Grace Chareka (34) by pushing her head several times against the wall after allegedly finding her with a boyfriend. The victim died on the spot, said Nyathi.\n\nMeanwhile, police in Nyanga are investigating circumstances surrounding a case of murder in which a form four student struck his father, Tazvionesa Chitehwe (47) to death with an axe on the head after an argument on February 13, 2025, at Nyamugafata Village.\n\nThe suspect had spent two days away from home without the victims knowledge on his whereabouts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  POLICE in Mashonaland Central province have arrested a Bindura man for killing his wife after catching her red-handed in a compromising position with another man suspected to be her lover. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in Bindura arrested Justice Pondani (34) for a case</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-kills-cheating-wife-after-busting-her-with-lover/\">Man kills ‘cheating’ wife after busting her with lover</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Beitbridge-Masvingo road accident death toll rises to 25; Police identify some victims of bus, haulage truck collision",
            "url": "https://www.newzimbabwe.com/beitbridge-masvingo-road-accident-death-toll-rises-to-25-police-identify-some-victims-of-bus-haulage-truck-collision/",
            "content": "By Staff Reporter\n\nThe death toll of the deadly accident that occurred along the Beitbridge-Masvingo road has climbed from 24 to 25.\n\nThis follows the passing away of one victim while receiving treatment in hospital.\n\nThe crash involved an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, on February 13, 2025.\n\nThe accident claimed 24 lives on the spot, while another victim died later in hospital, bringing the total death toll to 25.\n\nPolice also confirmed that 29 injured passengers are receiving treatment at Beitbridge District Hospital, while two others remain admitted at Gwanda Provincial Hospital.\n\nThirteen critically injured passengers were transferred to United Bulawayo Group of Hospitals for further medical care.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi identified 21 of the 25 deceased victims, who have already been confirmed by their next of kin.\n\nThe victims are: Gwiba Kezias (51) of Stoneridge, Harare, Mudzingwa Origin (47) of Sese Village, Masvingo, Tsitsi Mukaro of Dulibadzimu, Beitbridge, Emma Mukaro of Dulibadzimu, Beitbridge, Punich Masvenhise (45) of SDP, Beitbridge, Richard Kandororo (37) of Maridale, Norton, Vincent Bvumbe (35) of Shule Shule, Beitbridge, Petronella Murungweni (26) of Mashavire, Beitbridge, Jeke Paradzai (46) of Glen Norah, Harare,\n\nOther were named as Abel Rumbwere of Mashavire, Beitbridge, Melissa Jackson (21) of Warren Park, Harare, Natasha Tembo of SDP, Beitbridge, Gilbert Gwinyai Mafi of Mbare, Harare, Elizabeth Mauto (48) of Seke, Chitungwiza, Faustina Zhakata Chibamu of Budiriro 5, Harare, Mutsekwa Josphine of Dulibadzimu, Beitbridge, Mollicious Kahanda (37) of Holiday Inn, Beitbridge, Douglas Mandira (43) of Marlborough, Angela Tembo of SDP, Beitbridge, Taziva Nyashega of Hatcliffe, Harare, Elton Marima of Old Medium, Beitbridge.\n\nThe identities of four others remain unknown and police are calling upon the public to help identify the bodies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16025142/JCNRIWQIriKC49ZbSy4m6q7gTxTuKCOw0zmzaDlk.gif",
            "description": "<p>By Staff Reporter The death toll of the deadly accident that occurred along the Beitbridge-Masvingo road has climbed from 24 to 25. This follows the passing away of one victim while receiving treatment in hospital. The crash involved an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, on February 13, 2025.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beitbridge-masvingo-road-accident-death-toll-rises-to-25-police-identify-some-victims-of-bus-haulage-truck-collision/\">Beitbridge-Masvingo road accident death toll rises to 25; Police identify some victims of bus, haulage truck collision </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Chirewa scoops another Player of The Match award for Huddersfield in Yorkshire Derby",
            "url": "https://www.newzimbabwe.com/chirewa-scoops-another-player-of-the-match-award-for-huddersfield-in-yorkshire-derby/",
            "content": "By Sports Reporter\n\nINFORM Warriors forward, Tawanda Chirewa was on fire Saturday after staging another stellar performance for Huddersfield in their 2-1 win over Barnsley in the English League One.\n\nThe award saw Chirewa completing two Player of The Match accolades in a row at Huddersfield, a side he joined in January on loan from his parent club, Wolveshampton Wanderers.\n\nChirewas side picked Saturdays win from behind, thanks to Josh Koroma and Ben Wiles, who scored in a space of three minutes to cancel Barnsleys goal.\n\nThe 21-year-old Zimbabwean forward was involved in both goals cementing his top class show throughout the match that saw him being voted the best on the pitch.\n\nHuddersfields win against Barnsley in the Yorkshire derby increased their chances of going for Championship play offs while the home side stretched its winless run to six games.\n\nChirewa is at Huddersfield on a six months loan deal running util the end of the season.\n\nThe Wolveshampton player joined the side from Derby County where he had spent five months on loan until his contract was terminated in December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16015043/IMG-20250215-WA0099.jpg",
            "description": "<p>By Sports Reporter  INFORM Warriors forward, Tawanda Chirewa was on fire Saturday after staging another stellar performance for Huddersfield in their 2-1 win over Barnsley in the English League One. The award saw Chirewa completing two Player of The Match accolades in a row at Huddersfield, a side he joined in January on loan from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chirewa-scoops-another-player-of-the-match-award-for-huddersfield-in-yorkshire-derby/\">Chirewa scoops another Player of The Match award for Huddersfield in Yorkshire Derby</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Former Yadah striker propels Marumo Gallants to Nedbank Cup quarter finals",
            "url": "https://www.newzimbabwe.com/former-yadah-striker-propels-marumo-gallants-to-nedbank-cup-quarter-finals/",
            "content": "By Sports Reporter\n\nFORMER Yadah FC striker, Junior Zindoga was the hero for Marumo Gallants Saturday as he scored the solitary goal that gave the side a 1-0 win over Amazulu in the Nedbank Cup Round of 16 match.\n\nThe Zimbabwean international found the back of the net in the 18th minute of the match after making a solo run into the box, thanks to his huge frame which allowed him to bulldoz Amazulu defender Ramaphiwe Mphalele along the way.\n\nAmazulu had several good chances in the second half, only to be denied by veteran Zimbabwe shot stopper Washington Arubi, who fought tooth and nail to walk away with a clean sheet.\n\nThe victory saw Gallants joining Stellenbosch, SuperSport United, Durban City, who have also progressed to the quarter finals.\n\nZindoga is enjoying his stay in the Betway Premiership after completing a move from Nzingisini Hotspurs in the National First Division last month.\n\nThe 21-year-old moved to South Africa last year from Yadah FC after terminating his contract which had not been honored by popular cleric Walter Magaya-owned football side.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16014635/IMG-20250215-WA0027.jpg",
            "description": "<p>By Sports Reporter FORMER Yadah FC striker, Junior Zindoga was the hero for Marumo Gallants Saturday as he scored the solitary goal that gave the side a 1-0 win over Amazulu in the Nedbank Cup Round of 16 match. The Zimbabwean international found the back of the net in the 18th minute of the match</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-yadah-striker-propels-marumo-gallants-to-nedbank-cup-quarter-finals/\">Former Yadah striker propels Marumo Gallants to Nedbank Cup quarter finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Zimbabwe heading towards electricity crisis: Parliament report",
            "url": "https://www.newzimbabwe.com/zimbabwe-heading-towards-electricity-crisis-parliament-report/",
            "content": "By Darlington Gatsi\n\nZIMBABWE risks plunging into an energy abyss that could severely undermine its economic prospects if it fails to address its ongoing power challenges, a parliamentary report has revealed.\n\nThe dossier, recently tabled by the Parliamentary Portfolio Committee on Energy and Power Development, paints a bleak picture of the countrys electricity situation.\n\nIt revealed the significant challenges faced by the Zimbabwe Power Company (ZPC), which have led to critically low levels of electricity production.\n\nCurrently, Zimbabwes main power sources are operating far below their capacity. While these sources have a combined generation capacity of 2,570 megawatts (MW), they are producing only 1,079 MW, leaving the country with a staggering deficit of 1,560 MW.\n\nTo bridge this gap, the national utility has been forced to import electricity from neighbouring countries.\n\nThe portfolio committee warned that the situation could deteriorate further if medium and long-term solutions are not implemented urgently.\n\nHowever, in as much as the transmission and distribution lines are functioning well, ZESA management highlighted that Zimbabwe is still facing serious power outages because the distribution supply of electricity is not meeting the nations demand.\n\nThe committee noted that the major challenge is of all power plants are not producing their optimum capacity.\n\nThe committee cited that considering the state we are in as a country, if there are no strategies that are going to be implemented sooner to boost generation, the nation will be suffering for a long haul, reads the report.\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has attributed the shortfall to outdated power infrastructure, the impacts of climate change, and the theft and vandalism of power lines and substations.\n\nThe low power generation has resulted in widespread load-shedding, with residential areas experiencing power cuts lasting more than 12 hours daily.\n\nSpeaking in Parliament recently, Citizens Coalition for Change (CCC) Member of Parliament, Ropafadzo Makumire, said there are far-reaching implications of the electricity crisis on key sectors of the economy, particularly healthcare.\n\nIn the health sector, you find that there are machines like ventilators which use electricity. It means that in the district hospitals where there are no dedicated lines, there will be no electricity.\n\nSo, major surgical operations cannot go ahead in this state. It means that people die because of lack of electricity and people who will be forced to walk for long distances are brought here in Harare.\n\nThis then increases the number of people being assisted. If you look at the mortuaries where these bodies are placed, you find that it is not accessible because the bodies will be in a decomposing state. This matter should be looked at with urgency so that we do not continue with this predicament, said Makumire.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25180412/Zimbabwe-Power-Cuts-e1664125462797.jpeg",
            "description": "<p>By Darlington Gatsi  ZIMBABWE risks plunging into an energy abyss that could severely undermine its economic prospects if it fails to address its ongoing power challenges, a parliamentary report has revealed. The dossier, recently tabled by the Parliamentary Portfolio Committee on Energy and Power Development, paints a bleak picture of the country’s electricity situation. It</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-heading-towards-electricity-crisis-parliament-report/\">Zimbabwe heading towards electricity crisis: Parliament report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "HIV patients spend long hours in queues to get treatment amid nurse shortage following USAID funding cessation",
            "url": "https://www.newzimbabwe.com/hiv-patients-spend-long-hours-in-queues-to-get-treatment-amid-nurse-shortage-following-usaid-funding-cessation/",
            "content": "By Thandiwe Garusa\n\nHIV patients in Epworth constituency on the outskirts of Harare are currently facing hours-long queues for life saving medical services due to severe nurse shortages following the cessation of USAID funding.\n\nFollowing U.S. President Donald Trumps America First policy, the US Embassy in Zimbabwe paused all U.S. foreign assistance funded by or through the State Department and USAID for review.\n\nThis move has led to the temporary suspension of services at New Start Centres and truck stop clinics across the country impacting patients on antiretroviral therapy (ART) and those seeking PrEP refills.\n\nAdditionally, USAID withdrew its nursing staff.\n\nSpeaking in a parliamentary session Wednesday, Epworth Member of Parliament, Zivanai Mhetu raised concerns over shortages of nurses, condoms, and antiretroviral drugs (ARVs) in his constituency demanding to know when the government will restore normal HIV services.\n\nMhetu said condoms and ARVs were almost running out.\n\nWhen are nurses coming and when are condoms and ARVs going to be distributed?\n\nWe were mocked in the constituencies, especially from my area, there are so many long and scary queues because (USAID) withdrew the services of their nurses.\n\nBefore the condoms and ARVs finish, we want to know when those drugs are going to be distributed, Mhetu said.\n\nSpeaker of Parliament, Jacob Mudenda said the funding gap wrought by Trumps policy shift was being looked into.\n\nlt is work in progress to close the gap resulting from the withdrawal of the funding and that will include those medical devices that the people so affected require will be addressed through that task force that has been formed by the minister, said Mudenda.\n\nApproximately 1.2 million Zimbabweans benefit from the U.S Presidents Emergency Plan for AIDS Relief (PEPFAR), and over 1,600 public hospitals and clinics have received training and technical support from the U.S. government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/07/05064415/HIV-Drug.jpg",
            "description": "<p>By Thandiwe Garusa HIV patients in Epworth constituency on the outskirts of Harare are currently facing hours-long queues for life saving medical services due to severe nurse shortages following the cessation of USAID funding. Following U.S. President Donald Trump’s America First policy, the US Embassy in Zimbabwe paused all U.S. foreign assistance funded by or</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hiv-patients-spend-long-hours-in-queues-to-get-treatment-amid-nurse-shortage-following-usaid-funding-cessation/\">HIV patients spend long hours in queues to get treatment amid nurse shortage following USAID funding cessation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Kwekwe gold mine accident leaves 3 dead",
            "url": "https://www.newzimbabwe.com/kwekwe-gold-mine-accident-leaves-3-dead/",
            "content": "By Staff Reporter\n\nTHREE miners died after the hoist ferrying them to the surface plunge when a coupling securing the rope broke.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms the death of three people at Yellow Snake 37 mine, Kwekwe on February 13, 2025. The victims had entered into a mine shaft using a cage.\n\nAs the victims were getting out of the shaft a safety hook which fastening the rope to the cage broke resulting in the cage falling down the shaft. Subsequently, the cage overturned and crushed the victims, said Nyathi.\n\nThe bodies of the victims were taken to Kwekwe General Hospital for postmortem.\n\nThis latest incident highlights the low safety standards at mines in Zimbabwe, which have resulted in fatalities and injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/17202232/zimine.jpg",
            "description": "<p>By Staff Reporter  THREE miners died after the hoist ferrying them to the surface plunge when a coupling securing the rope broke. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms the death of three people at Yellow Snake 37 mine, Kwekwe on February 13, 2025. The victims</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwekwe-gold-mine-accident-leaves-3-dead/\">Kwekwe gold mine accident leaves 3 dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Pete Davidson claims he was ‘harassed’ about love life ‘because I’m ugly’ despite dating Hollywood ‘hot girls’",
            "url": "https://www.newzimbabwe.com/pete-davidson-claims-he-was-harassed-about-love-life-because-im-ugly-despite-dating-hollywood-hot-girls/",
            "content": "By Fox News\n\nFORMER Saturday Night Live star Pete Davidson is responding to the criticism hes received about his previous love life with A-list celebrity women.\n\nDavidson, 31, claimed hes been harassed about his past relationships due to his appearance.\n\nEveryone is dating everyone and its Hollywood, Davidson told Page Six.\n\nLook at Paul Mescal, Timmy [Chalamet], Barry Keough. But because Im ugly, they wrote about me. I was harassed for like five years and it made my life a living hell.\n\nThe comedian added that the scrutiny was, pretty humiliating and upsetting.\n\nDavidson rose to fame after he landed an audition through SNL alum, Bill Hader, according to NBC.\n\nHe joined the cast at the age of 20 in 2014 and left the live comedy show in 2022.\n\nThe Staten Island native hoped that fans would focus on his work on Saturday Night Live rather than his love life.\n\nDavidson continued to call the scrutiny, embarrassing because you want people to write about your work.\n\n[I] was one of the youngest ever cast members on SNL and all that got pushed to the side because of who I was dating, he remarked.\n\nIve had some pretty adult relationships with some pretty amazing women, and when its ended its been cool.\n\nHim and Arian Grande split after five months, leading Grande to create her Grammy-nominated breakup album, thank u, next. And Davidson moved on rather quickly to another celebrity, actress Kate Beckinsale.\n\nAfter splitting from Beckinsale in April 2019, the actor and stand-up comedian navigated other high-profile romances  many of them short-lived.\n\nDavidson was also linked to Margaret Qualley and model Kaia Gerber.\n\nIn 2021, Davidson and actress Phoebe Dynevor reportedly split after five months together just as Davidson started filming the rom-com Meet Cute with actress Kaley Cuoco. Dynevor started production on season 2 of her Netflix series, Bridgerton at the time.\n\nTheir relationship was over by summer 2021.\n\nLater that year, Davidson jumped into a relationship with The Kardashians star Kim Kardashian. The two became a couple after Kardashian hosted Saturday Night Live in October 2021, and after weeks of claiming they were just friends, they confirmed their relationship in November 2021.\n\nAfter nine months of dating, Davidson and Kardashian went their separate ways in August 2022.\n\nIn 2022, Kardashian shared why she believes a lot of hot girls have been in a relationship with The King of Staten Island star.\n\nPete has the best heart, the SKIMS founder previously shared on an episode of Hulus The Kardashians.\n\nI feel like people, they have this, like, idea of him that he dates all these hot girls  and he does. But hes just the sweetest, most thoughtful person, she said of the Saturday Night Live alum.\n\nShortly after his relationship with Kardashian, he continued to prove he was Hollywoods most eligible bachelor.\n\nRumors swirled that he dated model Emily Ratajkowski, as they were spotted courtside at the New York Knicks game in November 2022 at Madison Square Garden for their first public date night.\n\nThe following year, Davidson seemingly rid himself of one of his most famous tattoos  a tribute to his ex-girlfriend Kardashian.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16012323/pete-davidson-kim-kardashian.jpg",
            "description": "<p>By Fox News FORMER “Saturday Night Live” star Pete Davidson is responding to the criticism he’s received about his previous love life with A-list celebrity women. Davidson, 31, claimed he’s been “harassed” about his past relationships due to his appearance. “Everyone is dating everyone and it’s Hollywood,” Davidson told Page Six. “Look at Paul Mescal,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pete-davidson-claims-he-was-harassed-about-love-life-because-im-ugly-despite-dating-hollywood-hot-girls/\">Pete Davidson claims he was ‘harassed’ about love life ‘because I’m ugly’ despite dating Hollywood ‘hot girls’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Chinese President Xi sends congratulatory message to 38th African Union Summit",
            "url": "https://www.newzimbabwe.com/chinese-president-xi-sends-congratulatory-message-to-38th-african-union-summit/",
            "content": "By Xinhua\n\nBEIJING Chinese President Xi Jinping on Saturday sent a message to the 38th African Union (AU) Summit, extending warm congratulations to African countries and people.\n\nIn the face of the current complex and intertwined international situation, the Global South, represented by China and Africa, has grown significantly, Xi noted.\n\nOver the past year, the AU has united and led African countries in vigorously advancing integration, actively responding to regional and global challenges, and speaking in unison as the voice of Africa, Xi said.\n\nNoting that these efforts have led to a continuous boost in Africas international status and influence, he sincerely wishes African countries and people even greater success on the path of independence, self-reliance and development.\n\nXi said that the year 2024 saw vigorous development of China-Africa relations.\n\nWith the successful Beijing Summit of the Forum on China-Africa Cooperation, China and Africa have embarked on a new stage of jointly building an all-weather community with a shared future for the new era, and stayed at the forefront of building a community with a shared future for mankind, Xi noted.\n\nHe expressed readiness to work with African leaders to promote the implementation of the six proposals for jointly advancing modernization and 10 partnership actions, so as to bring more tangible results to benefit over 2.8 billion Chinese and African peoples.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/27170645/China.jpg",
            "description": "<p>By Xinhua BEIJING— Chinese President Xi Jinping on Saturday sent a message to the 38th African Union (AU) Summit, extending warm congratulations to African countries and people. In the face of the current complex and intertwined international situation, the Global South, represented by China and Africa, has grown significantly, Xi noted. Over the past year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-president-xi-sends-congratulatory-message-to-38th-african-union-summit/\">Chinese President Xi sends congratulatory message to 38th African Union Summit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        },
        {
            "title": "Zimbabwean CFO denied bail over fraudulent South African permanent residence permit",
            "url": "https://www.newzimbabwe.com/zimbabwean-cfo-denied-bail-over-fraudulent-south-african-permanent-residence-permit/",
            "content": "By IOL\n\nA ZIMBABWEAN national accused of using a fraudulent South African permanent residence permit when applying for employment has been denied bail.\n\nKudakwashe Mpofu, 33, the Chief Financial Officer at the North West Development Corporation was arrested by the Directorate for Priority Crimes Investigations (known as the Hawks) on January 28, 2025.\n\nThe National Prosecuting Authority said Mpofu who faces a charge of fraud appeared in the Mmabatho Magistrates Court in the North West.\n\nExplaining the merits of the case NPA spokesperson Sivenathi Gunya said it is alleged that in March 2021, the North West Development Corporation advertised the position of Asset Manager based in Head Office in Mafikeng.\n\nInvestigations indicate that Mpofu applied for the position.\n\nHe said as part of the application process, Mpofu attached all the necessary documents, including his permanent residence permit which is alleged to be fraudulent.\n\nHe was successfully appointed to the position on May 1, 2021.\n\nThe NPA said in June 2023 Mpofu was appointed as Chief Financial Officer of the entity.\n\nThe State alleges that Mpofu submitted a fraudulent South African permanent residence when applying for the job in North West Development Corporations.\n\nThe NPA said that the State further alleges that the permit was never issued by the Department of Home Affairs.\n\nThe court heard that Mpofu is a flight risk and might evade trial if released because he is illegally in the country.\n\nThe state further presented an affidavit from an official of the Department of Home Affairs which confirmed that the permanent residence permit of the accused was never issued by Home Affairs and it is fraudulent.\n\nThe accused will remain behind bars and will appear in the Specialised Commercial Crime Court sitting in Mmabatho on March 19, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16011315/Kudakwashe-Mpofu-during-his-arrest-by-the-Hawks-in-January-Picture-Hawks.webp",
            "description": "<p>By IOL A ZIMBABWEAN national accused of using a fraudulent South African permanent residence permit when applying for employment has been denied bail. Kudakwashe Mpofu, 33, the Chief Financial Officer at the North West Development Corporation was arrested by the Directorate for Priority Crimes Investigations (known as the Hawks) on January 28, 2025. The National</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-cfo-denied-bail-over-fraudulent-south-african-permanent-residence-permit/\">Zimbabwean CFO denied bail over fraudulent South African permanent residence permit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "16 Feb 2025"
        }
    ]
}