{
    "news": [
        {
            "title": "Former Zimbabwe Rugby Union president Aaron Jani dies",
            "url": "https://www.newzimbabwe.com/former-zimbabwe-rugby-union-president-aaron-jani-dies/",
            "content": "By Sport Reporter\n\nFormer Zimbabwe Rugby Union president Aaron Janihasdied aged 55.\n\nJani passed away on Wednesday morning after battling cancer for some time.\n\nRated one of the best administrators ever in the rugby fraternity, he led the union as president from 2017 to May 2024.\n\nHe also served at Rugby Africa as the Treasurer.\n\nJani was one of the first black players to play for the Sables in the early 90s before he retired and continued to serve the game as an administrator.\n\nIn a condolence message, the Zimbabwe Rugby Union described him as a visionary leader who helped the game to grow.\n\nAaron was a towering figure in our sporta leader, a visionary, and a passionate advocate for rugby in Zimbabwe and beyond.\n\nJani was a Sable, living for the game, and his passing marks one of the saddest days in Zimbabwe Rugby.\n\nHis unwavering dedication during his tenure as ZRU President brought stability, growth, and pride to our community, leaving an indelible mark on the Sables, junior rugby, and womens rugby development.\n\nOn behalf of the entire ZRU family, we extend our deepest sympathies to Aarons loved ones during this difficult time.\n\nHis legacy will forever inspire us as we continue to build on the foundation he so tirelessly strengthened, read part of ZRU message.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/17055951/Aaron-Jani-scaled-e1605592830868.jpg",
            "description": "<p>By Sport Reporter Former Zimbabwe Rugby Union president Aaron Jani has died aged 55. Jani passed away on Wednesday morning after battling cancer for some time. Rated one of the best administrators ever in the rugby fraternity, he led the union as president from 2017 to May 2024. He also served at Rugby Africa as the Treasurer.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-zimbabwe-rugby-union-president-aaron-jani-dies/\">Former Zimbabwe Rugby Union president Aaron Jani dies </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zimplats faces challenges as half-year production dips amid operational disruptions",
            "url": "https://www.newzimbabwe.com/zimplats-faces-challenges-as-half-year-production-dips-amid-operational-disruptions/",
            "content": "Business Report\n\nImpala Platinums Zimbabwean unit, Zimplats was affected by power supply interruptions and poor availability of trackless machinery during the half-year period to December 2024, consequently lowering mined volumes by 2.5% compared to the same period a year earlier.\n\nZimplats has completed re-development of the large Bimha mine which now has capacity of 3.1 million tons per year.\n\nHowever, during the period under review, Zimplats mined volumeswere hampered by poor trackless mobile machinery (TMM) availability at Mupfuti, Bimha andMupani mines while intermittent interruptions to power supply at operationsand a slow ramp-up at Bimha Minefollowing several lost-time injuries also weighed in.\n\nThis forced down mined volumes by2.5% to 3.9 million tonscompared to4million tonsin the comparable periodin 2023.\n\nTons milledalsodecreased by 2.6% to 3.8 million tons due to lower ore supplywhile metal in concentrateproduction declined by 2% year-on-year to 279 890 6E ounces.\n\nHowever, Zimplats 6E mill head grade improvedmarginally to 3.38grammes per ton. This has been attributed to improved miningquality across the mines and increased tonnage from higher-grade zonesat Rukodzi and Bimha mines.\n\nLower-than-planned concentrator production, increase in furnace lockup and the delayed commissioning of the expanded smelter converters impacted 6E production, which decreased by 15% to 279 890 ounces from 327 810 ounces. In total 23 191 6E ounces were accumulated between concentrate and final production in the period, said Zimplats CEO, Alex Mhembere.\n\nDuring the half year period, Zimplats suffered a 6% dip in revenues to$350.2 million (R6.4 billion). This was caused bya 13% decline in sales volumes to 279 740 6Eouncesas average metal prices were 8% higherfor the period.\n\nMoreover, cost of sales decreased by 6% to $323m on the lower sales volumes, partly offset by a 7%increase in costs to $885 per 6E ounce produced.\n\nConsequently, profit before income tax was 37% lower at $8.9m after an income tax charge of $4.7m for the half year,\n\nInterim post tax profits in Zimplatsimproved to$4.1m compared toa loss of $8.8m in the previous contrasting period, although there was no dividend declared for the period.\n\nZimplatsaccessed borrowings of US$4.5m during the half year andclosed the period with cash and cash equivalents of$41.4m .\n\nThe development and upgrade of Mupani Mine which will replace Ngwarati, Rukodzi and part of Mupfuti mines that are depleting remains on schedule, with full production of 3.6 million tonnes per annum planned for the first half of 2029.\n\nZimplats has spend a cumulative$339mas at 31 December 2024 against an approved project budgetof $386m on Mupani mine development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/15101253/IMG_20230614_124141-scaled.jpg",
            "description": "<p>Business Report Impala Platinum’s Zimbabwean unit, Zimplats was affected by power supply interruptions and poor availability of trackless machinery during the half-year period to December 2024, consequently lowering mined volumes by 2.5% compared to the same period a year earlier. Zimplats has completed re-development of the large Bimha mine which now has capacity of 3.1</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimplats-faces-challenges-as-half-year-production-dips-amid-operational-disruptions/\">Zimplats faces challenges as half-year production dips amid operational disruptions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "We can come after you – says acting principal as Roman Catholic institution is caught up in sexual harassment storm",
            "url": "https://www.newzimbabwe.com/we-can-come-after-you-says-acting-principal-as-roman-catholic-institution-is-caught-up-in-sexual-harassment-storm/",
            "content": "By Leopold Munhende\n\nAN official at Roman Catholic-run St. Peters Kubatana Industrial Training College has threatened to come after anyone who continues to write articles about a messy sexual harassment scandal, alleged to involve learners and teachers.\n\nAbout three cases of sexual harassment are said to have been swept under the carpet in the past year, with the latest raising a storm for a lecturer identified as Kudakwashe Jongwe.\n\nA parent who spoke toNewZimbabwe.comnarrated saddening exchanges between themselves and the institutions Principal, a Mr Gatsi, whose institution they allege to be shielding teachers accused of sexually exploiting students.\n\nOne Mlambo, who is the institutions Acting Principal told this publication to drop the story as the Roman Catholic Church was too big and could come after the writer.\n\nWe can come for you, this is a big institution, this is the Roman Catholic, said Mlambo in a conversation with this publication.\n\nWe dont want to comment on this issue. Why do you want to write an article that is done?\n\nIf you were the police we would consider your questions but we do not want to speak about it, this matter is dead.\n\nJongwe, who politely told this publication that he had been barred from commenting on the issue by the institution, is said to have been sending sleazy messages to students and inviting them home for what he told a local daily were extra lessons.\n\nThe parent said he got wind of the act, confiscated their daughters phone and discovered the comments she said bordered on sexual harassment.\n\nJongwe has been harassing my daughter considering his love comments to her, said the parent.\n\nAfter taking our matter to the principal, he defended him and that angered me.\n\nJongwe is also accused of having taken the daughter for a questionable shopping spree against her parents will after they got wind of it.\n\nSt. Peters Kubatana Industrial Training College is run by Roman Catholic Jesuits, a religious order of priests and brothers in the church.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26181433/st-peters.jpg",
            "description": "<p>By Leopold Munhende AN official at Roman Catholic-run St. Peter’s Kubatana Industrial Training College has threatened to come after anyone who continues to write articles about a messy sexual harassment scandal, alleged to involve learners and teachers. About three cases of sexual harassment are said to have been swept under the carpet in the past</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-can-come-after-you-says-acting-principal-as-roman-catholic-institution-is-caught-up-in-sexual-harassment-storm/\">We can come after you – says acting principal as Roman Catholic institution is caught up in sexual harassment storm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "Such policies turned Zimbabwe into a basket case – Free Market Foundation slams DA over ‘liberal betrayal’ on Expropriation Act",
            "url": "https://www.newzimbabwe.com/such-policies-turned-zimbabwe-into-a-basket-case-free-market-foundation-slams-da-over-liberal-betrayal-on-expropriation-act/",
            "content": "IOL\n\nSouth Africa  The Free Market Foundation (FMF) has said that the Democratic Alliance (DA) had only one role to play regarding the new Expropriation Act, which is unconditional and unrelenting opposition, but with the formation of the GNU, FMF said the party has allowed itself to be ideologically co-opted and has betrayed liberals.\n\nMartin van Staden, Head of Policy at the FMF, said in a statement issued on Tuesday that the DA has charted a different course, skirting around the acts fundamental constitutional, economic, and moral deficiencies and focusing instead on some peripheral formalities.\n\nThis is a weak  and failed  attempt to show its constituency that it is still againstthe Expropriation Actwhile protecting its position in the government of national unity (GNU).\n\nLiberalisms value proposition is simple: individuals and communities  society  must chart their course. The state must secure society against coercion directed at people or their property. Beyond this, the state must be severely limited by constitutional law so it cannot utilise its incredible power to deprive society of civil liberty or property.\n\nSince the establishment of the Progressive Party in 1959, followed by the Progressive Reform Party, Progressive Federal Party, the Democratic Party, and finally the DA, the DA has been the foremost representative of this political ideology in SA. However, with the formation of the GNU, the party has allowed itself to be ideologically co-opted.\n\nVan Staden added that co-option does not always mean sharing the precise philosophical imperatives of the co-opted,arguing that the DA is not yet a Marxist-Leninist party such as the ANC.\n\nUS President Donald Trump, in his usual unrefined fashion, did SA an excellent service by speaking out in favour of property ownership. He pointed out that property confiscation is now law in SA, that a class of people in SA  property owners  is being badly mistreated, and that this amounts to a human rights violation. On all counts, like him or not, Trump is right.\n\nAnd yet the DA, among the regimes usual cheerleaders in the media and academia, felt compelled to condemn Trump for speaking the truth rather than condemn Parliament and President Cyril Ramaphosa for adopting the kinds of policies that have turned relatively prosperous societies such as Zimbabwe and Venezuela into humanitarian disasters and basket cases, he said.\n\nThe FMF said the DA has been advised repeatedly and in excruciating detail about the constitutional and constitutionalist errors in the Expropriation Act.\n\nTruthfully, this should have been the final red line for the GNU\n\nIt is a betrayal that liberals and those who understand the key role property rights play in safeguarding freedom and democracy and creating the conditions for prosperity should not soon forgive the party for.The DA was supposed to be part of the solution, not part of the problem, read the FMF statement.\n\nApproached for comment, the DA dismissed the FMF statement alleging the party has been co-opted by the ANC and betrayed its supporters on the Expropriation Act.\n\nThe partys national spokesperson, Karabo Khakhau, said she is unsure what informed the FMF statement before dismissing it as baseless.\n\nAnyone with their finger on the pulse of South African politics would know that the DA has submitted court papers challenging the Act.\n\nWe are fundamentally opposed to the Act, in principle, because it opens the door to potential abuse through expropriation without compensation, which threatens property rights. Section 12 of the Act is particularly problematic.\n\nOur legal advice is that the best chance of getting a straightforward victory is to tackle the patently unconstitutional process by which it was passed.\n\nKhakhau mentioned that even if the FMF had fundamental constitutional objections to a piece of legislation, the best court strategy would provide the best chance of victory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26170156/The-Free-Market-Foundation-says-the-Democratic-Alliance-has-betrayed-liberals-on-property-rights.webp",
            "description": "<p>IOL South Africa – The Free Market Foundation (FMF) has said that the Democratic Alliance (DA) had only one role to play regarding the new Expropriation Act, which is “unconditional and unrelenting opposition”, but with the formation of the GNU, FMF said the party has allowed itself to be ideologically co-opted and has betrayed liberals.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/such-policies-turned-zimbabwe-into-a-basket-case-free-market-foundation-slams-da-over-liberal-betrayal-on-expropriation-act/\">Such policies turned Zimbabwe into a basket case – Free Market Foundation slams DA over ‘liberal betrayal’ on Expropriation Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "Latvian jailed 15 years for attempting to smuggle 8.3kgs of heroin",
            "url": "https://www.newzimbabwe.com/latvian-jailed-15-years-for-attempting-to-smuggle-8-3kgs-of-heroin/",
            "content": "By Mary Taruvinga\n\nA Latvian has been jailed for 15 years for attempting to smuggle heroin to India via Robert Mugabe International Airport two years ago.\n\nVitalis Kurdrjasovs (27) was sent to jail by Harare magistrate Donald Ndirowei after a full trial.\n\nThe state proved that he tried to smuggle 8,3 kgs of heroin which was found hidden in his luggage on September 8 2022 at the airport.\n\nKurdrjasovs was in Zimbabwe as a visitor.\n\nProsector Tendai Tapi proved that on 8 September 2022 at around 1500 hours, the accused proceeded to the Robert Gabriel Mugabe International Airport intending to leave the country on an Ethiopian Airways 1500-hour flight bound for Addis Ababa en route to India.\n\nHe had two bags of luggage.\n\nKurdrjasovs completed all the check-in formalities with Ethiopian Airlines and handed over his two bags for loading onto the aircraft.\n\nThe bags were endorsed with name tag bearing his particulars for identification. He underwent all the Customs and Immigration formalities.\n\nKurdrjasovs declared that he only had clothing as his baggage to the Airline and Customs officials.\n\nHis black bag was intercepted at the Airport Ground Zero scanner by the Airport Aviation Security after it was noticed that it had suspicious visual images, the court heard.\n\nKurdrjasovs was summoned to the scanner and questioned over the contents of his bag but he maintained that it was his clothing.\n\nThe black bag was searched in his presence, customs and the police and it was discovered that there were four packages of brownish substances suspected to be dangerous drugs stashed in the bags false compartment.\n\nA preliminary field test was carried out on the seized brownish substances and they tested positive for heroin.\n\nThe heroin was seized by customs (ZIMRA).\n\nThe seized heroin was taken to Forensic Science Laboratory for examination and it tested positive for heroin.\n\nThe seized drugs recorded a total weight of 8350,2 grammes with a street value of ZWL$6 680 160.\n\nNdirowei also ordered him to pay US$5,000 fine or face five more years in jail.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30055718/white-powder-heroin-scaled-1.jpg",
            "description": "<p>By Mary Taruvinga A Latvian has been jailed for 15 years for attempting to smuggle heroin to India via Robert Mugabe International Airport two years ago. Vitalis Kurdrjasovs (27) was sent to jail by Harare magistrate Donald Ndirowei after a full trial. The state proved that he tried to smuggle 8,3 kgs of heroin which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/latvian-jailed-15-years-for-attempting-to-smuggle-8-3kgs-of-heroin/\">Latvian jailed 15 years for attempting to smuggle 8.3kgs of heroin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "ZWG month-on-month inflation rate recedes to 0,5% – ZimStat",
            "url": "https://www.newzimbabwe.com/zwg-month-on-month-inflation-rate-recedes-to-05-zimstat/",
            "content": "By Alois Vinga\n\nThe month-on-month inflation rate has tumbled to 0,5%, giving strong signals of a positive inflationary outlook in the year ahead, Zimbabwe National Statistics Agency (Zimstat) reported Wednesday.\n\nThe stats agency said the inflation rate for the local unit tumbled to 0.5% in February 2025, shedding 10.0% on the January 2025 rate of 10,5% implying that prices as measured by the all items ZWG CPI, increased by an average of 0.5% from January 2025 to February 2025.\n\nThe ZWG month-on-month Food and Non-Alcoholic Beverages inflation rate was 0.8 percent in February 2025, shedding 6.0 percentage points on the January 2025 rate of 6.8 percent while the month-on-month non-food inflation rate was 0.3 % shedding 4,3% on the January 2025 rate of 4,6%, said Zimsat.\n\nMarket watchers have credited the latest recovery to the tight Monetary Policy stance pursued by monetary authorities but warned that such economic trends could be signals of deeper problems in the economy such as reduced productive borrowing, and disposable incomes prompting very slow economic growth.\n\nThe policy measures, if not well managed, can also choke companies capability to invest in new projects.\n\nZimstat said the US$ month-on-month inflation rate for the period stood at 0,2% in February 2025, shedding 11.3% on the January 2025 rate of 11,5% implying that prices as measured by the all items index increased by an average of 0,2% from January 2025 to February 2025.\n\nThe USD month-on-month Food and NonAlcoholic Beverages inflation rate was 0,2% in February 2025, shedding 16.6% on the January 2025 rate of 16,8%. The February 2025 USD month-on-month non-food inflation rate was 0.2 % shedding 8,9% on the January 2025 rate of 9,1%.\n\nThe USD year-on-year inflation rate (annual percentage change) for the month of February 2025 as measured by the all-items USD Consumer Price Index (CPI), was 15.1%.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The month-on-month inflation rate has tumbled to 0,5%, giving strong signals of a positive inflationary outlook in the year ahead, Zimbabwe National Statistics Agency (Zimstat) reported Wednesday. The stats agency said the inflation rate for the local unit tumbled to 0.5% in February 2025, shedding 10.0% on the January 2025 rate of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-month-on-month-inflation-rate-recedes-to-05-zimstat/\">ZWG month-on-month inflation rate recedes to 0,5% – ZimStat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "United Nations Human Rights Council: Zimbabwe hailed for abolishing death penalty",
            "url": "https://www.newzimbabwe.com/united-nations-human-rights-council-zimbabwe-hailed-for-abolishing-death-penalty/",
            "content": "By Alois Vinga\n\nCOUNTRIES attending the ongoing 58th session of the United Nations Human Rights Council have saluted Zimbabwe for successfully abolishing the death penalty.\n\nSpeaking at the high-level convention, Zimbabwes Attorney General Virginia Mabiza chronicled the countrys journey in ending the death penalty which was introduced by British colonial powers and remained in place even beyond the attainment of Zimbabwes independence in 1980.\n\nShe said at independence, Zimbabwe inherited a wide array of offences that attracted the death penalty and since then, various legislative and policy interventions have been implemented to gradually reduce the number of crimes attracting the death penalty.\n\nIn 2013, the number of offences attracting the death penalty had been reduced from nine to only murder committed in aggravating circumstances in sync with the United Nations General Assembly Resolution 52 on reducing the number of offences that attract the death penalty.\n\nUltimately, in 2024, the Government enacted the Death Penalty Abolition Act [Chapter 9:26], a significant milestone in the countrys human rights journey. The Death Penalty Abolition Act [Chapter 9:26] outlawed the imposition of the Death Penalty.\n\nIt further placed a positive legal obligation on the Minister responsible for Justice, the Prosecutor General and the Commissioner General of Prisons to do everything within their respective competencies to ensure every prisoner under the sentence of death is brought before the High Court for resentencing, Mabiza told the gathering.\n\nMaxime Prevot, Deputy Prime Minister and Minister of Foreign Affairs, European Affairs and Development Cooperation, speaking on behalf of the core group on the question of the death penalty (Belgium, Benin, Costa Rica, France, Mexico, Mongolia, Republic of Moldova, and Switzerland), hailed the recent decision of Zimbabwe to abolish the death penalty and encouraged other states to follow suit, or, pending its abolition, to impose a moratorium on its use.\n\nSwitzerland welcomed Mabizas presence at the Human Rights Council and congratulated Zimbabwe for the major step in the protection of human rights.\n\nThe High Commissioner for Human Rights Volker Trk observed that 113 countries have abolished the death penalty completely. He commended the Zimbabwean government for joining 26 other countries in Africa that have abolished the death penalty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26182920/death-penalty.jpg",
            "description": "<p>By Alois Vinga COUNTRIES attending the ongoing 58th session of the United Nations Human Rights Council have saluted Zimbabwe for successfully abolishing the death penalty. Speaking at the high-level convention, Zimbabwe’s Attorney General Virginia Mabiza chronicled the country’s journey in ending the death penalty which was introduced by British colonial powers and remained in place</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/united-nations-human-rights-council-zimbabwe-hailed-for-abolishing-death-penalty/\">United Nations Human Rights Council: Zimbabwe hailed for abolishing death penalty  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "MH370: search for missing Malaysia Airlines flight resumes after 11 years",
            "url": "https://www.newzimbabwe.com/mh370-search-for-missing-malaysia-airlines-flight-resumes-after-11-years/",
            "content": "The Guardian\n\nA new search for Malaysia Airlines flight MH370 has been launched more than a decade after the plane went missing in one ofaviations greatest enduring mysteries.\n\nMaritime exploration firm Ocean Infinity has resumed the hunt for the missing plane, Malaysian transport minister Anthony Loke said on Tuesday.\n\nLoke told reporters the contract details between Malaysia and the firm were still being finalised but welcomed the proactiveness of Ocean Infinity to deploy their ships to begin the search for the plane, which went missing in March 2014.\n\nDetails about how long the search would last had not been negotiated yet, he said. He also did not provide details about when exactly the British firm had restarted its hunt.\n\nMH370s disappeared from radar shortly after taking off from Kuala Lumpur airport in March 2014. It was bound for Beijing, with 12 crew and 227 passengers on board. The plane has never been found, and the reason for its disappearance is unknown.\n\nWere very relieved and pleased that the search is resuming once again after such a long hiatus, Malaysian Grace Nathan, 36, who lost her mother on the doomed jet, told AFP.\n\nJaquita Gonzales, 62, wife of MH370 flight supervisor Patrick Gomes, said she hoped the resumption of the search would bring her family much-needed closure.\n\nWe just want to know where it is and what happened, she said. Memories come back like yesterday, its fresh in our heads.\n\nMarine tracking website Marinetraffic.comshowedthat the Ocean Infinity vessel was in the south Indian ocean as of 23 February.\n\nMalaysia agreed to resume the search in December 2024, with Ocean Infinity conducting the search on a no-find-no-fee basis. Lokesaidthe government would sign a contract for 18 months, in return for which Ocean Infinity would receive $70m if the wreckage was located and verified. The search would cover 15,000 sq km, Loke said.\n\nOn 8 March 2024, on the tenth anniversary of the disappearance, Australia offered the Malaysian government support for a renewed search. Eight Australians were on board the flight. But on Tuesday a spokesperson for the Australian Transport Safety Bureau said that Australian authorities were not involved in the renewed search.\n\nFlight MH370, a B777-200 aircraft, departed Kuala Lumpur at 12.41am local time on 8 March 2-14, bound for Beijing. The plane was last seen on military radar at 2.14am, heading west over the strait of Malacca. Half an hour later, the airlineannounced it had lost contact with the plane, which was due to land at its destination about 6.30am.\n\nThe families of those on board are still waiting for answers about what happened to their loved ones. Sometravelled to Madagascar in 2016to comb the beaches there for debris: pieces of the planehad been foundoff the Tanzanian and Mozambican coasts.\n\nIn January 2017, after nearly three years of searching 120,000 sq km in the southern Indian Ocean, Australian authoritiesended the underwater huntfor the wreckage. On 3 October that year, Australian investigators delivered their final report on the disappearance, saying the inability to bring closure for victims families was a great tragedy and almost inconceivable in the modern age.\n\nAmong the questions that remain is why the plane made a seemingly controlled turn off course towards the Indian ocean and, critically, why two pieces of key communication and tracking equipment on the plane went silent.\n\nTheories of what happened haveranged from a pilot gone rogue to sabotageand conspiracies that the flight was shot down or disappeared by a nefarious government agency and landed at a dark site, either because of sensitive cargo or a politically significant passenger.\n\nData recovered from a home-built flight simulator owned by the pilot, Zaharie Ahmad Shah,showed that someone had plotted a course to the southern Indian Ocean.\n\nOcean Infinity, based in Britain and the United States, carried out an unsuccessful hunt in 2018.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26180848/MH370.webp",
            "description": "<p>The Guardian A new search for Malaysia Airlines flight MH370 has been launched more than a decade after the plane went missing in one of aviation’s greatest enduring mysteries. Maritime exploration firm Ocean Infinity has resumed the hunt for the missing plane, Malaysian transport minister Anthony Loke said on Tuesday. Loke told reporters the contract</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mh370-search-for-missing-malaysia-airlines-flight-resumes-after-11-years/\">MH370: search for missing Malaysia Airlines flight resumes after 11 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "Four cops convicted for taking US$60 weekly bribe from motorist for two years",
            "url": "https://www.newzimbabwe.com/four-cops-convicted-for-taking-us60-weekly-bribe-from-motorist-for-two-years/",
            "content": "By Staff Reporter\n\nTwo Zimbabwe Republic Police (ZRP) cops stationed at Chinhoyi Traffic have been found guilty of soliciting a weekly US$60 bribe from a transport operator in exchange for free passage.\n\nThe two are Desire Mangombe (30) and Macdonald Tapesa (32).\n\nThey however escaped a custodial sentence after they were ordered to perform 490 hours each of community service.\n\nFrom January 2022, the officers allegedly extorted bribes from Tafadzwa Bvunzawabaya, a manager at Wolfspack Transport Services. On September 15, 2022, a team from Police General Headquarters Harare set up a trap operation using marked US dollar notes.\n\nThe officers accepted the bribe at their station, leading to their immediate arrest and recovery of the trap money, the State proved.\n\nBoth officers were convicted of contravening Section 174(1)(a) of the Criminal Law (Codification and Reform) Act.\n\nIn a different matter two Mbare police officers Naume Dube (31) and Victoria Shonhiwa (36), both constables, were convicted of criminal abuse of duty after soliciting US$1 from every motorist passing through the police stations main gate on March 11, 2024.\n\nFollowing a tip-off, officers from the Internal Investigations Department conducted surveillance and observed the two officers accepting bribes.\n\nDube was found with US$80 in her shirt pockets, and Shonhiwa had US$40.\n\nThey also recovered a list of motor vehicle registration numbers.\n\nThe officers were arrested and handed over to the Police Anti-Corruption Unit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter Two Zimbabwe Republic Police (ZRP) cops stationed at Chinhoyi Traffic have been found guilty of soliciting a weekly US$60 bribe from a transport operator in exchange for free passage. The two are Desire Mangombe (30) and Macdonald Tapesa (32). They however escaped a custodial sentence after they were ordered to perform 490</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-cops-convicted-for-taking-us60-weekly-bribe-from-motorist-for-two-years/\">Four cops convicted for taking US$60 weekly bribe from motorist for two years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        },
        {
            "title": "Zimbabwe could clear arrears with bold reforms, World Bank says",
            "url": "https://www.newzimbabwe.com/zimbabwe-could-clear-arrears-with-bold-reforms-world-bank-says/",
            "content": "Bloomberg\n\nZimbabwe could clear its arrears and rework $21 billion in debt thats kept it locked out of international capital markets for more than a quarter of a century if it implements fiscal reforms, the World Bank said.\n\nBy adopting a bold set of fiscal reforms, it can turn the page on a prolonged history of macroeconomic instability, and set the foundations for a credible national budget that is efficient, able to manage unforeseen fiscal risks, and can ensure a stable and competitive currency, the World Bank said in its review of Zimbabwes public finances on Wednesday. In turn, this would open up the historic possibility of arrears clearance and debt resolution, which would release major additional resources in concessional multilateral financing for public and private investments.\n\nIt would also put Zimbabwe on a high-growth path and a more stable macroeconomic trajectory, the Washington-based lender said.\n\nThe southern African nation defaulted on debt from lenders such as the World Bank, the Paris Club and the African Development Bank in 1999. In the past three years, its made concerted efforts to exit default. Its enlisted AfDB President Akinwumi Adesina and former Mozambican President Joaquim Chissano to negotiate with creditors, hired Global Sovereign Advisory, a Paris-based consultancy, and started paying reparations to farmers and nations whose land it seized in the 2000s.\n\nChanges the World Bank recommends include removing monetary and exchange-rate distortions to enable low and stable inflation, reducing the public-service wage bill by eliminating duplicate and redundant roles and doing away with value-added tax exemptions and zero-rating to increase revenues.\n\nThe nation introduced the ZiG, short for Zimbabwe Gold, in April last year to eventually replace the dollar in local transactions. Multiple previous attempts at creating a local unit have failed and led to spiralling inflation.\n\nThe central bank has introduced a plethora of steps to support the ZiG including curbing the money supply and forcing companies to price their products in the local currency, favouring the informal sector that sells goods at the higher unofficial exchange rate.\n\nThe World Bank also urged Zimbabwe to reverse the trend toward informalization by removing macroeconomic obstacles, high compliance burden for small businesses and taxing formal transactions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/27201329/World-bank.jpg",
            "description": "<p>Bloomberg Zimbabwe could clear its arrears and rework $21 billion in debt that’s kept it locked out of international capital markets for more than a quarter of a century if it implements fiscal reforms, the World Bank said. “By adopting a bold set of fiscal reforms, it can turn the page on a prolonged history</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-could-clear-arrears-with-bold-reforms-world-bank-says/\">Zimbabwe could clear arrears with bold reforms, World Bank says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "27 Feb 2025"
        }
    ]
}