{
    "news": [
        {
            "title": "Kadoma man acquitted of love-triangle murder after two years behind bars",
            "url": "https://www.newzimbabwe.com/kadoma-man-acquitted-of-love-triangle-murder-after-two-years-behind-bars/",
            "content": "By Mary Taruvinga\n\nA Kadoma man accused of stabbing another miner to death in a suspected love triangle has been acquitted after the High Court ruled that police bungled investigations and relied on genuine but mistaken witnesses.\n\nJustice Philda Muzofa cleared Mashoko Midzi of murdering Stanly Mpofu, who was stabbed four times and died at Chimwendo Compound, Battlefields, on December 23, 2022.\n\nMidzi had been arrested in dramatic fashion, shot twice by police who claimed he attacked them with a machete. But in a damning judgment, the court said there was no proof he resisted arrest or carried the alleged weapon.\n\nThe evidence placed before us established police high-handedness when they arrested the accused, Justice Muzofa ruled. Of all the strange evidence placed before us, the following can take the prize Surely how can two police officers contradict each other on such a pertinent issue unless nothing of this sort happened?\n\nAccording to the State, Mpofu had clashed with Midzi earlier that day at a canteen where they argued over Beatrice Chinamasa, a young cook who had just started working there. Chinamasa later confirmed she was dating Mpofu, but said she never saw Midzi that day and did not know he was allegedly interested in her.\n\nWitness Agatha Sibanda, Mpofus aunt and the canteen owner, told the court she saw Midzi chasing her drunken nephew before he collapsed, bleeding heavily. But the judge found her evidence unreliable.\n\nHer evidence was that she saw his clothes. That is weak identification, said Justice Muzofa. Jeans and gumboots are common clothes in the mining communities for men. We conclude that Agatha was a genuine but mistaken witness.\n\nMidzi insisted from the start that he was innocent, saying he spent the night drinking beer at Fambai Bar with friends and relatives. He raised this alibi in his warned-and-cautioned statement just days after the killing.\n\nThe court criticised investigators for failing to properly test that defence. It was within the polices capacity to record statements from Moyo Mine, the accuseds companions or someone from Fambai Bar. They did not, the judge said. The alibi remained intact.\n\nAlthough the State had raised a strong suspicion that Midzi may have killed Mpofu, the judge stressed that suspicion was not enough.\n\nThe standard of proof in criminal cases is proof beyond a reasonable doubt, she ruled. In this case, the evidence raised many unanswered questions, leading to doubt. In such instances, the matter is resolved by giving the accused the benefit of doubt.\n\nMidzi was acquitted and walked free after more than two years of fighting the charge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A Kadoma man accused of stabbing another miner to death in a suspected love triangle has been acquitted after the High Court ruled that police bungled investigations and relied on “genuine but mistaken” witnesses. Justice Philda Muzofa cleared Mashoko Midzi of murdering Stanly Mpofu, who was stabbed four times and died at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadoma-man-acquitted-of-love-triangle-murder-after-two-years-behind-bars/\">Kadoma man acquitted of love-triangle murder after two years behind bars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Opposition MPs demand electoral reforms ahead of 2028 elections",
            "url": "https://www.newzimbabwe.com/opposition-mps-demand-electoral-reforms-ahead-of-2028-elections/",
            "content": "By Anna Chibamu\n\nCitizens Coalition for Change (CCC)legislators on Wednesday demanded the implementation of electoral reforms, including recommendations made in the 2023 SADC Observer Election Report, before Zimbabwe holds its next general elections.\n\nZimbabwe is scheduled to hold general elections in 2028 when President Emmerson Mnangagwas current constitutional mandate ends. However, Zanu PF has already resolved at its last Conference to push for extending his stay in office until 2030.\n\nDuring a parliamentary Question and Answer session, CCC Harare Central MP Lovemore Jimu pressed government to outline policy measures for implementing electoral reforms ahead of the next polls.\n\nResponding, Acting Leader of Government Business in Parliament Felix Mhona said the Zimbabwe Electoral Commission (ZEC) was solely responsible for administering election matters.\n\nI am very happy that we have one of our institutions, ZEC, which superintends over elections. Our Constitution outlines what must be done prior to an election. If there are any specific concerns, the Honourable Member is free to put them on the Order Paper for the relevant Minister to address, said Mhona.\n\nCCCs Ellen Shiriyedenga reminded the House that ZEC had submitted a 2023 election report with specific recommendations.\n\nWe are in the preparatory stage of the election cycle. This is the time to implement ZECs recommendations from the 2023 elections. What is ZEC currently doing to ensure this happens before 2028? she asked.\n\nMhona responded by urging her to specify which recommendations had not been addressed, adding that the SADC report had not discredited Zimbabwes elections.\n\nThey were deemed to be credible, fair and transparent. It is just like if you are in a vote scenario where you have the minority and the majority. You might raise your concerns under the minority but the obvious majority rules, Mhona said.\n\nWarren Park MP, Shakespeare Hamauswa, also asked about stakeholder dialogue in preventing disputed elections. Mhona stated that President Mnangagwas Political Actors Dialogue (POLAD) platform was still available if the opposition wants to join.\n\nWhen we say we have a listening President, he has invited all political players to engage with him. He has an open-door policy and is amenable to addressing concerns raised, he said.\n\nCCC Mbizo legislator Corban Madzivanyika insisted that the SADC report highlighted serious shortcomings, including issues around voter registration, high nomination fees, state media bias, and election materials.\n\nMinister Mhona maintained that the ruling partys electoral victory reflected the will of the people, urging the opposition to look ahead.\n\nThe fact that Zanu PF is in Parliament with a majority shows that elections were held. Let us now focus on the future and address anomalies as we prepare for the next election, he said.\n\nHowever, MP Ransome Makamure reminded the House that Zimbabwe had recently chaired SADC and could not ignore its own bodys report.\n\nWe must embrace the SADC report, not dismiss it, since we are part of the regional bloc, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/24123047/vote-mother.jpg",
            "description": "<p>By Anna Chibamu Citizens Coalition for Change (CCC) legislators on Wednesday demanded the implementation of electoral reforms, including recommendations made in the 2023 SADC Observer Election Report, before Zimbabwe holds its next general elections. Zimbabwe is scheduled to hold general elections in 2028 when President Emmerson Mnangagwa’s current constitutional mandate ends. However, Zanu PF has already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-mps-demand-electoral-reforms-ahead-of-2028-elections/\">Opposition MPs demand electoral reforms ahead of 2028 elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe Central Bank deputy says time for dollar debate is over",
            "url": "https://www.newzimbabwe.com/zimbabwe-central-bank-deputy-says-time-for-dollar-debate-is-over/",
            "content": "Bloomberg\n\nZimbabweansshould focus more on their gold-backed currency thats set to become the sole legal tender by 2030 and less on how to phase out dollar use, according to the central banks deputy governor.\n\nWe should talk about mono-currency, the time to talk about de-dollarization is over,Innocent Matshesaid at an annual finance ministry conference Wednesday held in Bulawayo, the nations second largest city. We should think about our own currency, not on how to get rid of another currency.\n\nInnocent Matshe Photographer: Cynthia R Matonhodze/Bloomberg\n\nThe comments underscore the authorities resolve to adopt the ZiG  short for Zimbabwe Gold  as the sole currency, replacing the US dollar, which has been used for transactions since 2009.\n\nThe central bank earlier this month outlined steps needed before the local unit can be fully adopted. These included building sufficient foreign currency reserves and slashing annual inflation from 94% to single digits.\n\nThe ZiG wasintroducedin April 2024, marking the southern African nations sixth effort to stand up a viable local currency after previous efforts failed amid sky-high inflation and collapsing values on foreign exchange markets.\n\nSigns of improving sentiment toward the ZiG include a slowdown in the rate at which it is exchanged for US dollars, said Matshe, citing banking data. Currently, the ZiG accounts for about 40% of transactions in the economy\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Zimbabweans should focus more on their gold-backed currency that’s set to become the sole legal tender by 2030 and less on how to phase out dollar use, according to the central bank’s deputy governor. “We should talk about mono-currency, the time to talk about de-dollarization is over,” Innocent Matshe said at an annual finance ministry conference Wednesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-central-bank-deputy-says-time-for-dollar-debate-is-over/\">Zimbabwe Central Bank deputy says time for dollar debate is over</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Avenues Clinic lays off 50 workers, accused of targeting unionised staff",
            "url": "https://www.newzimbabwe.com/avenues-clinic-lays-off-50-workers-accused-of-targeting-unionised-staff/",
            "content": "By Alois Vinga\n\nThe prestigious Avenues Clinic in Harare has begun a retrenchment exercise that will result in the layoff of 50 employees, according to insiders, who allege that this move is aimed at targeting unionised workers.\n\nThe private, multi-disciplinary hospital, a flagship facility of Medical Investments Limited (MIL), now risks being drawn into a major labour dispute.\n\nSources close to the developments toldNewZimbabwe.comthis week that the exercise appeared highly questionable.\n\nA total of 50 workers have since been served with Notices to retrench by the employer. Finer details on the reasons behind the job cuts and terminal benefits to be paid remain unclear. What boggles the mind is that the workers have since been placed on paid leave while the organisation has moved swiftly to replace some of the targeted workers, one insider said on condition of anonymity.\n\nAnother source alleged that the retrenchments disproportionately affected staff who were members of trade unions.\n\nOver and above all these shortcomings, we need to understand why the company has hurriedly replaced the affected workers in some sections, while others have been replaced through outsourcing services like cleaning. Among those recruited recently are allegations that they were warned against being unionised as a condition of service, the source claimed.\n\nThe affected employees are now expecting a reasonable termination package as they argue that the employers decision has nothing to do with the inability to pay salaries.\n\nWhen contacted for comment, MIL general manager Sibusisiwe Ndlovu neither confirmed nor denied the allegations, instead referringNewZimbabwe.comto the internal communications department, which had not responded by the time of publication.\n\nHowever, a letter seen byNewZimbabwe.com,dated September 16, 2025, and signed by Ndlovu, confirmed the institutions decision to retrench some staff. The letter, addressed to one affected employee (name withheld), reads in part:\n\nWe wish to advise you that your position has been affected by the restructuring exercise, therefore, you are among members of staff who will be retrenched. The intended retrenchment will take effect from the fourteenth day after the date of receiving this letter.\n\nEngagements with you shall commence soon, and it is our hope that a retrenchment agreement will be reached to facilitate an expeditious conclusion of this in a manner which is fair and transparent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/18062948/avenues-clinic.jpg",
            "description": "<p>By Alois Vinga The prestigious Avenues Clinic in Harare has begun a retrenchment exercise that will result in the layoff of 50 employees, according to insiders, who allege that this move is aimed at targeting unionised workers. The private, multi-disciplinary hospital, a flagship facility of Medical Investments Limited (MIL), now risks being drawn into a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/avenues-clinic-lays-off-50-workers-accused-of-targeting-unionised-staff/\">Avenues Clinic lays off 50 workers, accused of targeting unionised staff</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe’s richest man plans to build five new AI factories across Africa",
            "url": "https://www.newzimbabwe.com/zimbabwes-richest-man-plans-to-build-five-new-ai-factories-across-africa/",
            "content": "Business Insider Africa\n\nZimbabwean billionaire Strive Masiyiwa has announced plans to build five artificial intelligence (AI) factories across Africa within the next year, as part of a $720 million investment through his company Cassava Technologies.\n\nThe factories are expected to be built in South Africa, Nigeria, Kenya, Egypt and Morocco.\n\nMasiyiwa said the goal is to give major African markets access to their own advanced AI infrastructure, reducing reliance on overseas cloud providers.\n\nHe described the plan as part ofCassavas Sovereign AI Cloud strategy, which aims to allow African countries to host and run their own AI systems locally.\n\nOur AI factory provides the infrastructure for innovation to scale, empowering African businesses, start-ups, and researchers with access to cutting-edge AI infrastructure. Now they dont have to look beyond Africa to get it, he said.\n\nMasiyiwa, who isworth about $1.3 billion, is known for building Econet Wireless into one of Africas largest telecom groups.\n\nIn recent years, he has expanded Cassava from telecoms into cloud computing, fintech, cybersecurity andartificial intelligence.\n\nThefirst AI factory is already under developmentin South Africa and will run on 3,000 Nvidia graphics processing units (GPUs).\n\nCassava says much of this computing power has already been reserved by African researchers and developers.\n\nCompany officials said the new facilities will help close a major gap in Africas digital economy.\n\nOnly about 5% of African AI talent currently has access to the high-performance computing power needed to train advanced AI models.\n\nBuilding local infrastructure could allow more African researchers to develop homegrown tools in sectors like finance, education, health and agriculture.\n\nCassava also plans to link the AI factories to its wider digital network, which includes Africa Data Centres, Liquid Intelligent Technologies, and Liquid C2.\n\nThese companies already provide data storage, internet connectivity and cybersecurity services across the continent.\n\nEarlier this year, Cassava launched a dedicated AI business unit and signed partnerships with global tech firms including Microsoft, AWS, Google and Anthropic to support African developers.\n\nAnalysts say the push could helpAfrica compete in the fast-growing global AI industrywhile keeping sensitive data on the continent.\n\nIt could also reduce costs for local startups and governments, who often pay high fees to store and process data overseas.\n\nIf completed on schedule, all five factories are expected to be operational by late 2026, positioning Cassava as one of the biggest builders of AI infrastructure in Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/03054027/Strive-Masiyiwa.jpg",
            "description": "<p>Business Insider Africa Zimbabwean billionaire Strive Masiyiwa has announced plans to build five artificial intelligence (AI) factories across Africa within the next year, as part of a $720 million investment through his company Cassava Technologies. Strive Masiyiwa, Zimbabwean billionaire, will invest $720 million to establish five AI factories across Africa. These facilities, built in part</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-richest-man-plans-to-build-five-new-ai-factories-across-africa/\">Zimbabwe’s richest man plans to build five new AI factories across Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Nampak’s disposal of Zimbabwe stake falls through",
            "url": "https://www.newzimbabwe.com/nampaks-disposal-of-zimbabwe-stake-falls-through/",
            "content": "TimesLive\n\nNampaks deal to dispose of its 51.43% shareholding in Nampak Zimbabwe to TSL for as much as $25m (R435m) has been terminated, the packaging company said.\n\nThe deal was originally announced in October last year.\n\nNampak said on Tuesday it had received notification from TSL that, notwithstanding a successful due diligence and competition authority approval process, circumstances for TSL in motivating the transaction to its shareholders had changed and it had elected to withdraw from the deal, which Nampak has agreed to.\n\nNampak remained committed to its strategic plan to dispose of its Zimbabwean asset on commercially acceptable terms, it said.\n\nThe Johannesburg-based company has also exited Nigeria, where forex losses were particularly acute as the naira depreciated sharply against the dollar\n\nThe sale was part of Nampaks asset disposal plan and would havecontributed to the reduction of the groups net debt and eliminated the associated risk and volatility of the Zimbabwean economy, Nampak said at the time the deal was proposed.\n\nIt had intended to apply the proceeds towards the settlement of debt.\n\nNampak Zimbabwe manufactures paper, plastic, and metal packaging products and is part of the Nampak group of companies.\n\nNampak CEO Phil Roux. File photo. Image:SUPPLIED\n\nThe packaging supplier for companies ranging from Coca-Cola to Tiger Brands has been battling to claw its way out of a R5bn debt hole it fell into during its ill-fated expansion in Africa.\n\nSince 2023, under CEOPhil Roux, the grouphas implemented a comprehensive turnaround plan, including:\n\nIt has achieved its previously set out lender requirement to repay R720m of net debt from disposals byend-September 2024 by using the proceeds from the disposals of the Liquid Cartons businesses in SA, Nampak Zambia, Nampak Malawi and Rigid Plastic SA.\n\nThe Johannesburg-based company has also exited Nigeria, where forex losses were particularly acute as the naira depreciated sharply against the dollar, resulting in a surge in costs for raw materials funded in the US currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17154841/nampak.webp",
            "description": "<p>TimesLive Nampak’s deal to dispose of its 51.43% shareholding in Nampak Zimbabwe to TSL for as much as $25m (R435m) has been terminated, the packaging company said. The deal was originally announced in October last year. Nampak said on Tuesday it had received notification from TSL that, notwithstanding a successful due diligence and competition authority</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nampaks-disposal-of-zimbabwe-stake-falls-through/\">Nampak’s disposal of Zimbabwe stake falls through</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Ex-CIO boss Isaac Moyo appointed Zimbabwe’s ambassador to the United Arab Emirates",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-isaac-moyo-appointed-zimbabwes-ambassador-to-the-united-arab-emirates/",
            "content": "By James Muonwa\n\nFORMER director-general of the dreaded Central Intelligence Organisation (CIO), Isaac Annanias Moyo, has been appointed the countrys ambassador plenipotentiary to the United Arab Emirates (UAE).\n\nThrough an Extraordinary Government Gazette dated September 17, 2025, Chief Secretary to the Office of the President and Cabinet (OPC), Martin Rushwaya announced Moyos deployment.\n\nIt is hereby notified that His Excellency the President has, in terms of section 110 (2)(i) as read with section 204 of the Constitution of Zimbabwe Amendment (No.20) Act 2013, appointed Isaac Annanias Moyo as Ambassador Extraordinary and Plenipotentiary to United Arab Emirates, reads the notice.\n\nBefore assuming the CIOs top post after the 2017 military-assisted operation that ushered Mnangagwa to the presidency, Moyo was Zimbabwes ambassador to South Africa. He was eventually removed as CIO boss under unexplained circumstances.\n\nMeanwhile, President Mnangagwa has also made three other ambassadorial appointments through the same gazette.\n\nDavid Douglas Hamadziripi, who was ambassador to South Africa, has been shunted to the United States of America and will be replaced by Lovemore Mazemo.\n\nPatrick Ronald Mutasa has been named the countrys new representative to Cuba, a nation which has enjoyed long-standing cordial bilateral relations with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08185755/isaac-moyo.jpg",
            "description": "<p>By James Muonwa FORMER director-general of the dreaded Central Intelligence Organisation (CIO), Isaac Annanias Moyo, has been appointed the country’s ambassador plenipotentiary to the United Arab Emirates (UAE). Through an Extraordinary Government Gazette dated September 17, 2025, Chief Secretary to the Office of the President and Cabinet (OPC), Martin Rushwaya announced Moyo’s deployment. “It is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-isaac-moyo-appointed-zimbabwes-ambassador-to-the-united-arab-emirates/\">Ex-CIO boss Isaac Moyo appointed Zimbabwe’s ambassador to the United Arab Emirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        },
        {
            "title": "Cardi B reveals she’s expecting baby with Stefon Diggs, reflects on falling in love again",
            "url": "https://www.newzimbabwe.com/cardi-b-reveals-shes-expecting-baby-with-stefon-diggs-reflects-on-falling-in-love-again/",
            "content": "CBS News\n\nCardi Bis expecting her fourth child, the rapper exclusively announced Wednesday on CBS Mornings.\n\nThe 32-year-old said she feels excited and happy, while preparing to release new music and balancing motherhood.\n\nI feel like Im in a good space. I feel very strong. I feel very powerful that Im doing all this work. But Im doing all this work while Im creating a baby, me and my man, were very supportive of each other, she said.\n\nCardi B said she and Diggs share the same ambition, each determined to be the greatest in their fields. She also credited Diggs with giving her a sense of stability as she readies her next album, Am I The Drama?, which includes a track called Safe.\n\nAnd he just makes me feel safe and very confident and very strong, she said. I mean, like, two weeks ago I was literally having a panic attack. I was, like, crying and crying and crying, just because I was just getting really nervous with you know, the whole album rollout  People were coming at me very hard. You know, sometimes people love you, people hate you. And people was just saying very mean things about me.\n\nShe admitted harsh criticism sometimes makes her question releasing music.\n\nAnd Im like, see, this is why I dont put music out, because its like, this is my art and this is something that I put a lotta love and time to. And its just like, sometimes, when people just rip it apart it just hurts you and it crushes you, she said.\n\nThrough it all, Cardi B  whose real name is Belcalis Marlenis Almnzar  said Diggs support keeps her steady.\n\nHe makes me feel very confident And it makes you feel like you could take over the world.\n\nShe added that she waited to announce the pregnancy until she was able to close some deals first. She also admitted she has not yet told her parents, jokingly saying she is scared of them.\n\nCardi B, who shares three children with rapper Offset, said she was reluctant to fall in love again amid their high-profile divorce. But she recalled Diggs telling her: Let me heal you. Give me a chance for me to heal you.\n\nNow that pregnancy rumors are confirmed, Cardi B used her world-famous humor to ask fans to purchase her new album: Now yall could buy my album so I can buy Pampers and diapers and all that type of stuff. I told you. Now go support my album, cause Im a mother of four now.\n\nCardi B says her sophomore album feels complete.\n\nI feel like it touch every little thing that I want to touch. And I just feel like its something that is not out there right now.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17173351/cardi-b.webp",
            "description": "<p>CBS News Cardi B is expecting her fourth child, the rapper exclusively announced Wednesday on “CBS Mornings.” The Grammy winner revealed she is pregnant and having a baby with her boyfriend, New England Patriots wide receiver Stefon Diggs, confirming weeks of speculation about her personal life. She said the baby is due before the start of her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cardi-b-reveals-shes-expecting-baby-with-stefon-diggs-reflects-on-falling-in-love-again/\">Cardi B reveals she’s expecting baby with Stefon Diggs, reflects on falling in love again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "18 Sep 2025"
        }
    ]
}