{
    "news": [
        {
            "title": "Brendan Galloway injury update as Plymouth Argyle defender set to get all clear",
            "url": "https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/",
            "content": "Plymouth Live\n\nPlymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday.\n\nThe 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria in another friendly international last Thursday, which was played in Saudi Arabia.\n\nGalloway started the match at the Prince Abdullah Al-Faisal Stadium in Jeddah but was substituted in the 84th minute as he made his seventh appearance for Zimbabwe.\n\nGalloway will be assessed by Argyles medical department on his return to Home Park from international duty later this week.\n\nThe friendly internationals against Algeria and Qatar, under newly-appointed head coach Mario Marinica, are Zimbabwes final games before they compete at the 2025 Africa Cup of Nations in Morocco at the end of December.\n\nZimbabwe have been drawn in Group B and will play games against Egypt on December 22, South Africa on December 26 and Angola on December 29.\n\nWith Galloway expected to be included in the Warriors squad for the tournament, he is likely to miss a few matches for Argyle over the Christmas and New Year period.\n\nArgyle are bottom of League One and did not have a game at the weekend because of international call-ups, including that of Galloway, while Port Vale moved up one position to 22nd after a 0-0 draw at home to Wycombe Wanderers.\n\nPilgrims boss Tom Cleverley was among the crowd at Vale Park as he took the opportunity to get a first-hand glimpse of Darren Moores Valiants.\n\nIt was a result which moved the Staffordshire side a point clear of the Pilgrims, but they have now played one more match than them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/18042712/Brendan-Galloway.png",
            "description": "<p>Plymouth Live Plymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday. The 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/\">Brendan Galloway injury update as Plymouth Argyle defender set to get all clear</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Nov 2025"
        },
        {
            "title": "Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party",
            "url": "https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/",
            "content": "By Leopold Munhende\n\nFormer Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling partys 2013 election victory by financing its campaign.\n\nShamu, famed for his vaMugabe iCremora praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend.\n\nHe said Tagwirei, who was recently co-opted into Zanu PFs influential Central Committee, quietly provided key resources that helped secure the partys win.\n\nFormer Minister Webster Shamu\n\nI did not get to know Tagwirei today; many of us have known him for years.\n\nFor the first time in public, I will tell you that Tagwirei financed our 2013 election campaign. He gave us resources, ensured we had fuel, and provided everything we needed.\n\nWe did not say this in newspapers because he is a quiet, disciplined, and humble leader, said Shamu.\n\nZanu PF went on to claim 61.88% of the presidential vote in 2013 and secured 196 of the 270 contested parliamentary seats.\n\nTagwirei has recently taken an increasingly visible role in the ruling partys affairs and is widely viewed as a potential successor to President Emmerson Mnangagwa in 2028 or 2030, depending on whether Mnangagwas second-term extension push succeeds.\n\nHis main rival remains Vice President Constantino Chiwenga, whose presidential ambitions have long been known.\n\nWhile Chiwenga has kept a low profile, Tagwirei has been a prominent guest at party events, reportedly donating more than US$500,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>By Leopold Munhende Former Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling party’s 2013 election victory by financing its campaign. Shamu, famed for his “vaMugabe iCremora” praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend. He said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/\">Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Nov 2025"
        },
        {
            "title": "US$7 million goats scheme fraud: Mpofu, Chimombe attempt to delay sentencing fails as judge sets date for pre-sentencing proceedings",
            "url": "https://www.newzimbabwe.com/us7-million-goats-scheme-fraud-mpofu-chimombe-attempt-to-delay-sentencing-fails-as-judge-sets-date-for-pre-sentencing-proceedings/",
            "content": "By Staff Reporter\n\nThe High Court has set Wednesday for pre-sentencing proceedings for convicted businessmen Moses Mpofu and Mike Chimombe, marking what Justice Pisirayi Kwenda described as the long-overdue conclusion to their protracted, year-and-a-half legal battle.\n\nMpofu and Chimombe were recently found guilty of defrauding the Ministry of Agriculture of US$7 million after securing a US$87 million tender for the Presidential Goat Scheme using Blackdeck, a company that does not exist. The two have been in custody since their arrest in June last year after multiple failed attempts to secure bail and halt proceedings.\n\nOn Monday, the pair tried to stall the sentencing phase by demanding a written copy of the judgment convicting them. Justice Kwenda dismissed the request, noting he had already delivered the ruling in open court and that their lawyers were expected to take notes. He described the renewed demand as a delaying tactic without legal merit.\n\nThe duo then sought leave to appeal to the Supreme Court, but that application was also thrown out.\n\nLeave to appeal the ruling at the Supreme Court is dismissed, Justice Kwenda ruled. My decision is that we move to the pre-sentencing stage, and we should proceed on Wednesday. We should not keep delaying this matter. Let us all come to court on Wednesday prepared for the pre-sentencing procedures.\n\nThe case was subsequently adjourned to 19 November 2025 at 1400 hours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23060124/chimombe-mpofu-.jpg",
            "description": "<p>By Staff Reporter The High Court has set Wednesday for pre-sentencing proceedings for convicted businessmen Moses Mpofu and Mike Chimombe, marking what Justice Pisirayi Kwenda described as the long-overdue conclusion to their protracted, year-and-a-half legal battle. Mpofu and Chimombe were recently found guilty of defrauding the Ministry of Agriculture of US$7 million after securing a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us7-million-goats-scheme-fraud-mpofu-chimombe-attempt-to-delay-sentencing-fails-as-judge-sets-date-for-pre-sentencing-proceedings/\">US$7 million goats scheme fraud: Mpofu, Chimombe attempt to delay sentencing fails as judge sets date for pre-sentencing proceedings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Nov 2025"
        },
        {
            "title": "Journalist-cum scholar Garikai Chaunza appointed co-chair of Continental Academic Seminar Series in South Africa",
            "url": "https://www.newzimbabwe.com/journalist-cum-scholar-garikai-chaunza-appointed-co-chair-of-continental-academic-seminar-series-in-south-africa/",
            "content": "ByStaff Reporter\n\nRhodes University postdoctoral fellow and Zimbabwean journalist and media activist, Dr. Garikai Chaunza, has been appointed Co-Chair of the Local Organising Committee (LOC) for the African University Seminar Series  South Africa (AUSS-SA), a flagship programme of the Social Science Research Councils APDD initiative.\n\nThe appointment, confirmed in a letter from APDD programme director Dr Cyril Obi, recognises Chaunzas outstanding qualifications and his demonstrable commitment to strengthening research, academic convening, and collaborative knowledge production across the continent\n\nChaunzas selection reflects a career grounded in media activism, resistance journalism, and community-centred storytelling, shaped by nearly two decades working across Zimbabwes most contested media environments.\n\nBefore entering academia, he reported for ZBC, Radio VOP, NewZimbabwe.com, Deutsche Welle, Radio Netherlands, Free Speech Radio News (FSRN), KPFA Pacifica Radio, and other international outlets, often covering press freedom violations, political repression, and community struggles.\n\nAs Chair of the MISA Zimbabwe Harare Committee between 2015 and 2021, he led campaigns for community radio licensing, legal defence for journalists, and broader media reform during periods of state surveillance and shrinking civic space.\n\nNow based at Rhodes Universitys School of Journalism and Media Studies as a postdoctoral fellow, Chaunza teaches radio and audio studies while supervising postgraduate students.\n\nHis recent doctoral work, Activist Radio and the Struggle to Empower Audiences, examined how underground radio and alternative audio platforms challenge state narratives in hybrid regimes.\n\nColleagues describe his approach as a fusion of theory and hands-on journalistic practice, linking scholarly critique with lived experience in hostile media environments.\n\nThe AUSS-SA appointment will place Chaunza at the centre of a continental effort to convene scholars, practitioners and alumni for national seminars led by the LOC.\n\nAccording to the APDD, the initiative aims to strengthen a self-organised intellectual community capable of shaping national and regional research agendas, while promoting equity, diversity, and representation across South African institutions.\n\nIn his new role, Chaunza will coordinate academic panels, mobilise university partners across the country, and contribute to building an APDD alumni network grounded in African perspectives.\n\nThis aligns with his long-standing advocacy for decolonial media education, community storytelling, and African-led communication research, commitments reflected in his teaching, public scholarship and ongoing creative audio projects.\n\nChaunzas academic credentials include a PhD in Journalism and Media Studies from Rhodes University, an MSc and Postgraduate Diploma in Media and Society Studies (MSU), a BA in Media Studies (ZOU), and Diploma in Public Relations (ZIPR), and a certificate in Digital Marketing (UZ). He is also a recipient of the SSRC Next Generation Social Sciences Fellowship (2023).\n\nThe appointment marks a return to organised scholarly activism for a journalist whose career has consistently bridged research, teaching, and frontline media work. For many observers in the journalism education sector, Chaunza represents a generation of scholar-practitioners pushing for African media curricula rooted in community knowledge, public accountability, and resistance to repression.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/17041221/GARI-CHAUNZA.jpg",
            "description": "<p>By Staff Reporter Rhodes University postdoctoral fellow and Zimbabwean journalist and media activist, Dr. Garikai Chaunza, has been appointed Co-Chair of the Local Organising Committee (LOC) for the African University Seminar Series – South Africa (AUSS-SA), a flagship programme of the Social Science Research Council’s APDD initiative. The appointment, confirmed in a letter from APDD programme</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-cum-scholar-garikai-chaunza-appointed-co-chair-of-continental-academic-seminar-series-in-south-africa/\">Journalist-cum scholar Garikai Chaunza appointed co-chair of Continental Academic Seminar Series in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "18 Nov 2025"
        }
    ]
}