{
    "news": [
        {
            "title": "NPA bows to pressure as Chinese nationals found with cocaine face deportation",
            "url": "https://www.newzimbabwe.com/npa-bows-to-pressure-as-chinese-nationals-found-with-cocaine-face-deportation/",
            "content": "By Staff Reporter\n\nTHE National Prosecuting Authority (NPA) has succumbed to public pressure as it is in the process of deporting nine Chinese nationals who were found in possession of cocaine.\n\nThe nine Chinese nationals escaped jail with a US$150 fine, a judgement which riled the public.\n\nHarare magistrate Vakayi Chikwekwe ruled that the quantity of cocaine that the nine Chinese were in possession of was insignificant, justifying the ruling.\n\nIn a statement, NPA said the Chinese nationals are awaiting deportation for violating the countrys laws.\n\nThe NPAZ is committed to ensuring that all individuals are held accountable for their actions in accordance with the laws of Zimbabwe, regardless of their nationality or status.\n\nFurthermore, the NPAZ can confirm that the nine individuals are currently awaiting deportation. We will continue to work tirelessly to combat the scourge of dangerous drugs, as it poses a significant threat to the well-being of our nation, read the statement.\n\nThe leniency of the judgement was castigated, with Zimbabwean government accused of being too soft on the Chinese with whom they have a good relationship.\n\nIn comparison, being found in possession of drugs in China is met with a harsher punishment, in some cases death penalty.\n\nNPA said the judicial system will be tightened against individuals found in drug peddling.\n\nThe NPAZ is taking concrete and decisive steps to ensure future prosecutions for drug-related offences are handled with the utmost efficiency and effectiveness.\n\nHenceforth, all Public Prosecutors have been instructed to prefer the correct charges in all drug-related cases, and ensure that they aggressively pursue stiffer sentences in court, to secure penalties that truly reflect the seriousness of these offences.\n\nThis stance is a direct reflection of the direction that Zimbabwe has taken to combat drug abuse, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17162838/cocaine.jpg",
            "description": "<p>By Staff Reporter THE National Prosecuting Authority (NPA) has succumbed to public pressure as it is in the process of deporting nine Chinese nationals who were found in possession of cocaine. The nine Chinese nationals escaped jail with a US$150 fine, a judgement which riled the public. Harare magistrate Vakayi Chikwekwe ruled that the quantity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/npa-bows-to-pressure-as-chinese-nationals-found-with-cocaine-face-deportation/\">NPA bows to pressure as Chinese nationals found with cocaine face deportation </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe’s richest man plans to build five new AI factories across Africa",
            "url": "https://www.newzimbabwe.com/zimbabwes-richest-man-plans-to-build-five-new-ai-factories-across-africa/",
            "content": "Business Insider Africa\n\nZimbabwean billionaire Strive Masiyiwa has announced plans to build five artificial intelligence (AI) factories across Africa within the next year, as part of a $720 million investment through his company Cassava Technologies.\n\nThe factories are expected to be built in South Africa, Nigeria, Kenya, Egypt and Morocco.\n\nMasiyiwa said the goal is to give major African markets access to their own advanced AI infrastructure, reducing reliance on overseas cloud providers.\n\nHe described the plan as part ofCassavas Sovereign AI Cloud strategy, which aims to allow African countries to host and run their own AI systems locally.\n\nOur AI factory provides the infrastructure for innovation to scale, empowering African businesses, start-ups, and researchers with access to cutting-edge AI infrastructure. Now they dont have to look beyond Africa to get it, he said.\n\nMasiyiwa, who isworth about $1.3 billion, is known for building Econet Wireless into one of Africas largest telecom groups.\n\nIn recent years, he has expanded Cassava from telecoms into cloud computing, fintech, cybersecurity andartificial intelligence.\n\nThefirst AI factory is already under developmentin South Africa and will run on 3,000 Nvidia graphics processing units (GPUs).\n\nCassava says much of this computing power has already been reserved by African researchers and developers.\n\nCompany officials said the new facilities will help close a major gap in Africas digital economy.\n\nOnly about 5% of African AI talent currently has access to the high-performance computing power needed to train advanced AI models.\n\nBuilding local infrastructure could allow more African researchers to develop homegrown tools in sectors like finance, education, health and agriculture.\n\nCassava also plans to link the AI factories to its wider digital network, which includes Africa Data Centres, Liquid Intelligent Technologies, and Liquid C2.\n\nThese companies already provide data storage, internet connectivity and cybersecurity services across the continent.\n\nEarlier this year, Cassava launched a dedicated AI business unit and signed partnerships with global tech firms including Microsoft, AWS, Google and Anthropic to support African developers.\n\nAnalysts say the push could helpAfrica compete in the fast-growing global AI industrywhile keeping sensitive data on the continent.\n\nIt could also reduce costs for local startups and governments, who often pay high fees to store and process data overseas.\n\nIf completed on schedule, all five factories are expected to be operational by late 2026, positioning Cassava as one of the biggest builders of AI infrastructure in Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/03054027/Strive-Masiyiwa.jpg",
            "description": "<p>Business Insider Africa Zimbabwean billionaire Strive Masiyiwa has announced plans to build five artificial intelligence (AI) factories across Africa within the next year, as part of a $720 million investment through his company Cassava Technologies. Strive Masiyiwa, Zimbabwean billionaire, will invest $720 million to establish five AI factories across Africa. These facilities, built in part</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-richest-man-plans-to-build-five-new-ai-factories-across-africa/\">Zimbabwe’s richest man plans to build five new AI factories across Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe agrees $455 million power plant refurbishment deal with Jindal",
            "url": "https://www.newzimbabwe.com/zimbabwe-agrees-455-million-power-plant-refurbishment-deal-with-jindal/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>Reuters Zimbabwe has agreed a $455 million, 15-year concession deal with the Africa-focused unit of India’s Jindal Steel (JINT.NS), for the refurbishment of a 920 megawatt coal-fired power plant, the energy minister said. The work on six ageing units at the Hwange thermal power station is expected to take four years, July Moyo said during a post-cabinet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agrees-455-million-power-plant-refurbishment-deal-with-jindal/\">Zimbabwe agrees $455 million power plant refurbishment deal with Jindal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine",
            "url": "https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/",
            "content": "By Darlington Gatsi\n\nPRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs.\n\nThe judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of the Chinese nationals.\n\nWe call through you, Madam Speaker, for an appeal of the recent judgement of foreign nationals who were fined US$150 for being arrested in possession of dangerous drugs. We further propose the immediate deportation of these foreign nationals, who are bad apples amongst us, said Tendai Pinduka, a ZANU PF MP.\n\nHarare magistrate Vakayi Chikwekwe ruled that the quantity of cocaine the nine Chinese nationals were in possession of was insignificant.\n\nThe leniency of the judgement has been widely criticised, with the Zimbabwean government accused of being too soft on the Chinese, with whom it maintains a strong relationship.\n\nBy comparison, being found in possession of drugs in China is met with far harsher punishment, in some cases, a death penalty.\n\nThe judgement has been viewed as a mere slap on the wrist and one that undermines the governments stance on fighting drug abuse in communities.\n\nSurprisingly, foreign nationals were recently found in possession of dangerous drugs and cocaine, arrested, and fined a paltry US$150, which in our view is not deterrent enough. It further undermines the authority of His Excellency the President, Dr E.D. Mnangagwa, in combating the menace and scourge of drugs and substance abuse, said Pinduka.\n\nChinese nationals have been accused of committing crimes and escaping harsh sentences by leveraging their all-weather friendship with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26021333/new-parliament-16-1024x637-1.png",
            "description": "<p>By Darlington Gatsi PRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs. The judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/\">Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Presbytery Church Trust row deepens as High Court refuses bid to dismiss case",
            "url": "https://www.newzimbabwe.com/presbytery-church-trust-row-deepens-as-high-court-refuses-bid-to-dismiss-case/",
            "content": "By Mary Taruvinga\n\nThe High Court has refused to throw out a lawsuit filed by the Presbytery of Zimbabwe of the Uniting Presbyterian Church in Southern Africa in a bitter dispute over the control and management of church-run schools.\n\nJustice Faith Mushure dismissed an application for absolution from the instance lodged by trustees of the Presbytery of Zimbabwe Education Trust, ruling that the matter had to proceed to full trial.\n\nThis is not an appropriate case to decree absolution from the instance, ruled Justice Mushure. I must assume that the evidence placed before me is true. There is evidence upon which a court, directing its mind reasonably to such evidence, could or might find for the plaintiff.\n\nThe church is challenging the validity of the trust that oversees its schools, accusing trustees of fraudulently registering it, mismanagement, and failing to account for funds. It is also seeking the trusts dissolution.\n\nCentral to the row are two deeds of trust allegedly registered under the same number in 2010 but with different founders  Reverends Paul Neshangwe and Wilbert Runyararo Sayimani. Both clergymen denied ever appearing before a notary to establish the trust, with Justice Mushure noting their testimonies raised prima facie irregularities.\n\nThe judge stressed that the trustees could not avoid scrutiny through legal technicalities.\n\nQuoting precedent, she said: A defendant who might be afraid to go into the witness box should not be permitted to shelter behind the procedure of absolution from the instance.\n\nThe case also raised red flags over school governance, with financial statements from 2013 to 2017 accounting for only three out of nine schools under the trust. Evidence was also led of trustees allegedly deriving personal benefits and parents expressing disquiet over mismanagement.\n\nRejecting the trustees argument that the church lacked authority to dissolve the trust, Justice Mushure noted: Under common law, the court has powers both to vary or terminate trusts in certain conditions  if the trust is being run contrary to the interests and objectives of the trust.\n\nThe trial is set to resume on September 25.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17163250/Presbytery-e1758123204645.jpg",
            "description": "<p>By Mary Taruvinga The High Court has refused to throw out a lawsuit filed by the Presbytery of Zimbabwe of the Uniting Presbyterian Church in Southern Africa in a bitter dispute over the control and management of church-run schools. Justice Faith Mushure dismissed an application for absolution from the instance lodged by trustees of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/presbytery-church-trust-row-deepens-as-high-court-refuses-bid-to-dismiss-case/\">Presbytery Church Trust row deepens as High Court refuses bid to dismiss case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        },
        {
            "title": "Maningi Queens FC quits Women’s Premier Soccer League over alleged FIFA grant fraud",
            "url": "https://www.newzimbabwe.com/maningi-queens-fc-quits-womens-premier-soccer-league-over-alleged-fifa-grant-fraud/",
            "content": "By Sports Reporter\n\nManingi Queens FC has pulled out of the Zimbabwe Womens Premier Soccer League (ZWPSL), citing alleged fraud involving FIFA and CAF womens football grants.\n\nNewZimbabwe.com has it on good authority that the club, on September 15, formally wrote to the league executive notifying them of its decision to withdraw.\n\nIn its letter, the club raised several grievances, including the diversion of FIFA and CAF grants meant for womens football to mens football activities, lack of legal action on player development and training compensation by bigger teams that poach players, as well as unaffordable referees fees in a league with no sponsorship.\n\nThe club further alleged that ZIFA administrators were being bribed to corruptly clear players for bigger clubs at the expense of teams investing in development.\n\nConfirming the withdrawal Tuesday evening, the ZWPSL applauded Maningi Queens for their significant contribution to the growth of womens football despite their decision to exit.\n\nThe league acknowledges the concerns raised by the club and respects their decision to withdraw.\n\nThe ZWPSL extends its heartfelt gratitude to Maningi Youth Soccer Academy for their substantial contributions to the advancement of womens soccer.\n\nZWPSL remains committed to promoting a competitive and vibrant womens game and looks forward to continuing to work with stakeholders to advance womens football in Zimbabwe, read part of the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17162039/maningi-queens.jpg",
            "description": "<p>By Sports Reporter Maningi Queens FC has pulled out of the Zimbabwe Women’s Premier Soccer League (ZWPSL), citing alleged fraud involving FIFA and CAF women’s football grants. NewZimbabwe.com has it on good authority that the club, on September 15, formally wrote to the league executive notifying them of its decision to withdraw. In its letter,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maningi-queens-fc-quits-womens-premier-soccer-league-over-alleged-fifa-grant-fraud/\">Maningi Queens FC quits Women’s Premier Soccer League over alleged FIFA grant fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "18 Sep 2025"
        }
    ]
}