{
    "news": [
        {
            "title": "Jamaicans wake to devastation as hurricane causes floods, power cuts and splits city in two",
            "url": "https://www.newzimbabwe.com/jamaicans-wake-to-devastation-as-hurricane-causes-floods-power-cuts-and-splits-city-in-two/",
            "content": "BBC\n\nThe normal soundtrack that accompanies Jamaican life is silent this morning as many have woken to no electricity.\n\nAbout three-quarters of the island is without power and many parts of its western side are under water, with homes destroyed by strong winds after Hurricane Melissa tore across the island with catastrophic force.\n\nAs wind and rain lashed through the night, one local official said the destruction resembled the scene of an apocalypse movie.\n\nWith communications crippled, the true scale of the disaster remains unknown. Prime Minister Andrew Holness declared the island a disaster area late Tuesday, warning of devastating impacts and significant damage to hospitals, homes and businesses.\n\nAlthough no deaths have yet been confirmed, Montego Bays mayor Richard Vernon told the BBC his first task at daybreak would be to check if everybody is alive.\n\nGetty Images Trees had already been uprooted in St. Catherine before the hurricane made landfall\n\nHurricane Melissa, the strongest storm to strike Jamaica in modern history, barrelled across the country on Tuesday, leaving behind a trail of ruin.\n\nAt its peak, the hurricane sustained winds of 298 km/h (185 mph)  stronger than Hurricane Katrina, which devastated New Orleans in 2005 and killed 1,392 people.\n\nIt resembled the scene of an apocalypse movie, an MP in western Jamaica told Kingston-based journalist Kimone Francis of The Jamaica Gleaner.\n\nFrancis described the night as stressful and intense, marked by relentless heavy wind and rain.\n\nYou dont have a connection. You cant speak to the people you normally speak to, she told the BBC World Services Newsday programme.\n\nAcross Jamaicas central parishes, Francis said, floodwaters rose to the roofs of two-storey homes.\n\nOne anonymous woman told the BBC: There is water coming in through the roof of my house. I am not okay.\n\nWhile no fatalities had been confirmed, Jamaicas prime minister told CNN he feared there would be some loss of life. Damage, he said, was widespread  hitting hospitals, schools, homes and businesses.\n\nLocal government minister Desmond Mckenzie said on Tuesday afternoon that the southwestern parish of St Elizabeth was under water, with at least three families trapped in their homes in the community of Black River.\n\nRescue teams are struggling to reach them because of the dangerous conditions, he said at a news conference.\n\nVerna Genus was sheltering from the storm at her four bedroom home in the village of Carlisle, St Elizabeth, when the hurricane ripped the zinc roof off her house.\n\nThe 73-year-old vegetable farmer was in the house with her sons and baby grandchild when the hurricane made landfall over the area.\n\nVerna has lost communications due to the power lines being down. But her UK-based sister, June Powell, spoke to the BBC about what happened.\n\nShe was crying on the phone, June said, adding: You are huddled up inside and then you look up then the roof is gone. I have never heard her like that  she was wailing we are all finished.'\n\nShe is anxiously waiting for the communications networks to be restored so she can talk to her sister.\n\nSt Elizabeth, known as Jamaicas breadbasket, produces much of the islands produce. With crops submerged and fields destroyed, many farmers will struggle to financially recover.\n\nOn the north coast, Montego Bay  the heart of Jamaicas tourism industry and home to its main airport  will also take time to get back on its feet. This hurricane has put a hand around the neck of the Jamaican economy.\n\nMontego city was split in two by floodwaters, Mayor Vernon said. He told BBC Breakfast: Once the wind subsided, we started to get a lot of heavy rain and that has led to massive floods right across the city. One side of the city is now cut off from the other due to roads being inundated by flood water.\n\nHis immediate concern, he added, was simple: Check if everybody is alive.\n\nIn rural Jamaica, the storm has left people shaken. Tamisha Lee, president of the Jamaica Network of Rural Women Producers, said: Right now, what Im seeing is heavy rain, powerful wind, a lot of things flying all over the place, and trees uprooted. There is no electricity. I am feeling anxious and tense. The damage will be enormous.\n\nMeteorologists said Hurricane Melissa intensified at a speed rarely seen, its rapid strengthening fuelled by abnormally warm Caribbean waters  part of a broader trend linked to climate change.\n\nBy the time it struck Jamaica, the storm had reached Category 5 strength, with gusts fierce enough to tear roofs from concrete homes, uproot trees and snap power poles.\n\nHealth officials even issued a crocodile warning, cautioning that floodwaters could drive the reptiles into residential areas.\n\nFor thousands of tourists caught on the island, the storm brought terror and uncertainty.\n\nIve never heard anything like it, said Pia Chevallier from Cambridge, who travelled to Jamaica with her 15-year-old son on Saturday.\n\nSpeaking to BBC Radio 5 Live from her darkened hotel room, she said: The glass in the windows and patio doors was all vibrating. The doors sounded like they were slamming, even though they were closed. It was horrendous.\n\nShe added: Theres debris everywhere  palm trees, coconuts, branches, all over the place. The big palm trees with all the roots are up. Thats how strong the winds have been.\n\nOn the north coast, Wayne Gibson, a British tourist from Kent holidaying in Ocho Rios with his wife and two teenage daughters, told BBC Radio 4s Today programme that they were sheltering in a communal hall.\n\nKyle Holmes from Bolton, visiting Lucea in the north west, described the hotel as a disaster zone and said he had no idea when they will be able to get home.\n\nHurricane Melissa had moved on to make landfall in Cuba by early Wednesday morning, leaving Jamaica paralysed and silent. Though it has since weakened to a Category 3 hurricane, it remains powerful with wind speeds of over 200km/h (124mph).\n\nJamaica has a catastrophe bond  a type of insurance for the country  which will hopefully allow people to get back on their feet, but the issue is whats done in the interim.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29141656/jamaica-hurricane.webp",
            "description": "<p>BBC The normal soundtrack that accompanies Jamaican life is silent this morning as many have woken to no electricity. About three-quarters of the island is without power and many parts of its western side are under water, with homes destroyed by strong winds after Hurricane Melissa tore across the island with catastrophic force. As wind</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jamaicans-wake-to-devastation-as-hurricane-causes-floods-power-cuts-and-splits-city-in-two/\">Jamaicans wake to devastation as hurricane causes floods, power cuts and splits city in two</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "Nigerian Nobel laureate Wole Soyinka says US revoked his visa",
            "url": "https://www.newzimbabwe.com/nigerian-nobel-laureate-wole-soyinka-says-us-revoked-his-visa/",
            "content": "BBC\n\nNigerian Nobel laureate Wole Soyinka has said the US revoked his visa and banned him from the country.\n\nThe 91-year-old author, who won the Nobel Prize for literature in 1986, said the US consulate asked him to bring in his passport so his visa could be cancelled in person as new unspecified information had come to light.\n\nSoyinka called the invitation a rather curious love letter from an embassy in a news conference held on Tuesday and told organisations hoping to invite him to the US not to waste their time.\n\nThe US embassy in Nigeria has said it cannot comment on individual cases.\n\nThe Nobel laureate has previously held permanent residency in the US but renounced it in 2016, tearing up his green card in protest of President Donald Trumps election.\n\nThe green card is a permanent residence permit for the US  prized by many African immigrants to the US.\n\nSoyinka affirmed on Tuesday that he no longer had his green card  and jokingly added that it had fallen between the fingers of a pair of scissors and it got cut into a couple of pieces.\n\nThe famed author has had regular teaching engagements at US universities for the past 30 years.\n\nI have no visa. I am banned, he said on Tuesday.\n\nSoyinka has long been critical of the Trump administrations radical stance on immigration and linked the visa revocation to his outspoken criticism.\n\nHe said his recent comparison of Trump to Ugandas dictator  Idi Amin in white face  may have contributed to the current situation.\n\nWhen I called Donald Trump Idi Amin, I thought I was paying him a compliment, Soyinka said, hes been behaving like a dictator.\n\nIdi Amin was a Ugandan military officer and dictator who ruled the country from 1971 to 1979, infamous for his brutal regime and widespread human rights abuses.\n\nWhen asked if he would consider going back to the US, Soyinka said: How old am I?\n\nIn July, the US State Department announced sweeping changes to its non-immigrant visa policy for citizens of Nigeria and several other African countries.\n\nAccording to the policy, nearly all non-immigrant and non-diplomatic visas issued to Nigerians and nationals of Cameroon, Ethiopia and Ghana would now be single-entry and valid for only three months, rolling back the up to five-year, multiple-entry visas they had enjoyed previously.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29122653/wole-soyinka.webp",
            "description": "<p>BBC Nigerian Nobel laureate Wole Soyinka has said the US revoked his visa and banned him from the country. The 91-year-old author, who won the Nobel Prize for literature in 1986, said the US consulate asked him to bring in his passport so his visa could be cancelled in person as new unspecified information had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-nobel-laureate-wole-soyinka-says-us-revoked-his-visa/\">Nigerian Nobel laureate Wole Soyinka says US revoked his visa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "ZETDC Managing Director suspended over power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/zetdc-managing-director-suspended-over-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has suspended Zimbabwe Electricity Transmission and Distribution Company (ZETDC) acting Managing Director Abel Gurupira pending investigations into recent power failures that occurred during key events, including President Emmerson Mnangagwas State of the Nation Address (SONA) in Parliament on Tuesday.\n\nGurupiras suspension follows the embarrassing incident in which Mnangagwa was forced to complete his SONA using torchlight after an unexpected blackout plunged the new Parliament Building into darkness.\n\nPower was restored approximately ten minutes later, just after Mnangagwa had concluded his address.\n\nFollowing the incident, Speaker of Parliament Jacob Mudenda hinted at possible sabotage, warning that the culprit will regret the day they were born.\n\nParliament later issued a statement explaining that during the event, the building was running on generator power, with ZESA electricity on standby. However, a circuit breaker supplying the load tripped, resulting in the blackout.\n\nIn an internal memo seen by this publication, ZESA Group Chief Executive Officer Cletus Nyachowe informed Gurupira of his immediate suspension pending a full investigation.\n\nI am hereby suspending you from duty pending investigations, following a spate of power outages prior to the commencement of the ZANU PF Conference in Mutare and during the State of the Nation Address in Parliament on the 28th of October 2025, Nyachowe wrote.\n\nThe correspondence stated that Gurupira would remain on full pay and benefits during the suspension period.\n\nDuring the period of suspension, you are not to communicate with any ZESA Holdings Group staff, Nyachowe added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16170029/ZETDC-Gurupira.jpeg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Electricity Supply Authority (ZESA) has suspended Zimbabwe Electricity Transmission and Distribution Company (ZETDC) acting Managing Director Abel Gurupira pending investigations into recent power failures that occurred during key events, including President Emmerson Mnangagwa’s State of the Nation Address (SONA) in Parliament on Tuesday. Gurupira’s suspension follows the embarrassing incident in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zetdc-managing-director-suspended-over-power-outage-during-mnangagwas-sona/\">ZETDC Managing Director suspended over power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "Biti, Sikhala, Ngarivhume flee, leaving shaken Mandaza at sight of feared ZRP anti-riot officers",
            "url": "https://www.newzimbabwe.com/biti-sikhala-ngarivhume-flee-leaving-shaken-mandaza-at-sight-of-feared-zrp-anti-riot-officers/",
            "content": "By Kingston Ndabatei\n\nIBBO Mandaza, the SAPES Trust director whose institution was torched by suspected state agents Monday night, could only watch as opposition figures who had come out in solidarity fled and dumped him at the sight of ZRPs feared anti-riot officers.\n\nTendai Biti, Job Sikhala and Jacob Ngarivhume had visited SAPES Trust to check damage caused by a fire that burnt most of its main auditorium, the Seminar Room.\n\nAs they concluded speeches to the media, ZRPs paramilitary unit descended on the premises, leading to their unannounced exit even when Sikhala kept on telling others around him not to panic.\n\nSikhala dashed into his tinted, black Mercedes-Benz, whose driver appeared to have been on stand-by.\n\nUpon seeing Sikhala jumping into the vehicle, Biti bundled himself into its backseat, next to the former Zengeza West legislator.\n\nNgarivhume, who could no longer fit in the car as a result, rushed to his own Isuzu KB250, jumped in and had his driver speed off before police officers could react.\n\nMandaza, who was the last speaker amongst them, was left alone and visibly shaken. He barely finished off his last statement to journalists, sticking on stopped, a word he said seven times before the Biti, Sikhala and Ngarivhume flight.\n\nHe eventually managed to explain that they had stopped having physical discussions at SAPES Trust, having opted for online events.\n\nBiti, Sikhala and Ngarivhume are some of the countrys opposition figures campaigning against Zanu PFs proposed illegal extension of President Emmerson Mnangagwas second term. They have, on different platforms, urged Zimbabweans not to accept the blatant disrespect to their constitution.\n\nBiti and Sikhala were once senior members of the Citizens Coalition for Change (CCC) before a nasty fallout that saw their president, Nelson Chamisa, dump the outfit. Describing Chamisa as a coward and being toochurchish, they decided to go italone.\n\nBiti took over on a rotational leadership role with Bulawayo-based Welshman Ncube before quitting the arrangement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164119/biti-sikhala-sapes.jpg",
            "description": "<p>By Kingston Ndabatei IBBO Mandaza, the SAPES Trust director whose institution was torched by suspected state agents Monday night, could only watch as opposition figures who had come out in solidarity fled and dumped him at the sight of ZRP’s feared anti-riot officers. Tendai Biti, Job Sikhala and Jacob Ngarivhume had visited SAPES Trust to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/biti-sikhala-ngarivhume-flee-leaving-shaken-mandaza-at-sight-of-feared-zrp-anti-riot-officers/\">Biti, Sikhala, Ngarivhume flee, leaving shaken Mandaza at sight of feared ZRP anti-riot officers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "“Circuit breaker supplying load tripped” – Parliament in damage control after blackout during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/circuit-breaker-supplying-load-tripped-parliament-in-damage-control-after-blackout-during-mnangagwas-sona/",
            "content": "By Anna Chibamu\n\nPreliminary investigations have revealed that a circuit breaker supplying the load tripped, causing a power outage at the new Parliament Building during President Emmerson Mnangagwas State of the Nation Address (SONA), Parliamenthas said.\n\nThe unexpected blackout forced Mnangagwa to complete his address using torchlight before electricity was restored approximately ten minutes later.\n\nThis is the second power outage to occur at the Parliament Building in Mnangagwas presence. The first incident took place during Finance Minister Mthuli Ncubes 2025 National Budget Presentation in November last year, which the Zimbabwe Electricity Supply Authority (ZESA) attributed to natural causes.\n\nDespite prior arrangements to ensure backup power, the latest blackout still occurred, prompting Speaker of Parliament Jacob Mudenda to hint at possible sabotage.\n\nMudenda warned that the culprit will regret the day of their existence.\n\nNow in damage control mode, Clerk of Parliament Kennedy Chokuda released a statement explainingthe technical cause of the outage.\n\nThe loss of power supply to key systems occurred when the Parliament Building was running on a generator as the main source of supply, with ZESA power as a standby. When supplies were lost, the generator was still running but not supplying power.\n\nPreliminary investigations indicate that a circuit breaker supplying the load had tripped. The restoration took longer than expected, resulting in part of the SONA being delivered without power, Chokuda said.\n\nParliament said it is working with the Ministry of Local Government, ZESA, and other relevant government agencies to investigate the incident. The findings will be made public once investigations are complete, and measures will be put in place to prevent a recurrence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>By Anna Chibamu Preliminary investigations have revealed that a circuit breaker supplying the load tripped, causing a power outage at the new Parliament Building during President Emmerson Mnangagwa’s State of the Nation Address (SONA), Parliament has said. The unexpected blackout forced Mnangagwa to complete his address using torchlight before electricity was restored approximately ten minutes later.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/circuit-breaker-supplying-load-tripped-parliament-in-damage-control-after-blackout-during-mnangagwas-sona/\">“Circuit breaker supplying load tripped” – Parliament in damage control after blackout during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "Rapper Shebeshxt faces investigation following road rage shooting",
            "url": "https://www.newzimbabwe.com/rapper-shebeshxt-faces-investigation-following-road-rage-shooting/",
            "content": "IOL\n\nControversial rapperShebeshxt (real nameLehlogonolo Chauke)is once again in the spotlight.\n\nEarlier this month, the Ke Di Shxt Malume hitmaker allegedly shot a motorist during a heated road rage incident in Polokwane, leaving the victim in critical condition.\n\nIt is alleged that Shebeshxt pulled into a petrol station, and so did the driver of the other vehicle. The confrontation continued.\n\nAccording to the police, an exchange of insults escalated, and Shebeshxt allegedly drew a firearm and shot the man in his stomach (solar plexus) before fleeing the scene.\n\nIt has been reported that soon after the incident occurred, the victim was rushed to a local Polokwane hospital and is currently fighting for his life in the ICU.\n\nLimpopo police have since opened a case of attempted murder, which has been transferred to the provincial murder and robbery unit for further investigation.\n\nPolice spokesperson Malesela Ledwaba is reported to have said that the unit is intensifying its inquiries.\n\nOnline reports note that after the shooting, Shebeshxt turned himself in to the police, accompanied by his lawyers. He was detained for a short while but released pending the outcome of the investigation.\n\nThis case is not the first timeShebeshxthas been on the wrong side of the law.\n\nEarlier this year, a video of Shebeshxt engaging in an altercation involving a large knife circulated on social media.\n\nIn the video,Shebeshxtappears to be aggravated as he unzips his Nike jacket, pulling out a large object appearing to be a knife, and lunges it at the victim.\n\nIn 2022, the rapper was charged with attempted murder when he was accused of stabbing a man in Lebowakgomo, Limpopo.\n\nShebeshxt has not yet commented publicly on the allegations of his latest encounter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29045810/shebeshxt.jpg",
            "description": "<p>IOL Controversial rapper Shebeshxt (real name Lehlogonolo  Chauke) is once again in the spotlight. Earlier this month, the “Ke Di Shxt Malume” hitmaker allegedly shot a motorist during a heated road rage incident in Polokwane, leaving the victim in critical condition. It is alleged that Shebeshxt pulled into a petrol station, and so did the driver of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rapper-shebeshxt-faces-investigation-following-road-rage-shooting/\">Rapper Shebeshxt faces investigation following road rage shooting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "Cameroon opposition leader to face legal action over election unrest, government says",
            "url": "https://www.newzimbabwe.com/cameroon-opposition-leader-to-face-legal-action-over-election-unrest-government-says/",
            "content": "BBC\n\nCameroons Interior Minister Paul Atanga Nji says opposition leader Issa Tchiroma Bakary will face legal action over allegations he incited violent post-election demonstrations.\n\nAt least four protesters have been killed during clashes between security forces and opposition supporters since Cameroons election on 12 October, with92-year-old President Paul Biyawinning an eighth consecutive term.\n\nTchiroma Bakary insists he won the election, a claim dismissed by Biyas ruling party, the Cameroon Peoples Democratic Movement (CPDM).\n\nViolent crackdowns by police and security officers on protesters have alarmed the international community, with the UN, African Union and EU calling for restraint.\n\nOn Tuesday, Nji accused Tchiroma Bakary of organising what he said were illegal protests leading to the loss of lives, and also criticised him for declaring victory in the election.\n\nHe added that Tchiroma Bakarys accomplices responsible for an insurrectionary plan will also face legal action.\n\nPaul Biya, who came to power in 1982 and is now the worlds oldest head of state, won the 12 October election with 53.7% of the vote, compared to 35.2% for Tchiroma Bakary, according to Cameroons Constitutional Council.\n\nTchiroma Bakary is yet to respond to the governments decision to try him, but he had previously told the BBC thathe would not accept a stolen vote and that he was not afraid of being arrested.\n\nOn election result day, he said armed men opened fire on protesters assembled near his residence in Garoua, fatally wounding at least two civilians.\n\nOn Tuesday, the interior minister revealed that an investigation would be launched into violent incidents before and after the announcement of the election results.\n\nDuring these attacks, some of the criminals lost their lives, he said, without providing a specific number of protesters who have been killed in the clashes.\n\nNji added that several members of the security forces also sustained serious injuries.\n\nAlthough Nji insisted the situation nationwide was now under control, protesters remain active in some parts of the country, especially in Douala and Garoua, where demonstrators mounted roadblocks on Tuesday, and burnt tyres on the streets.\n\nAnalysts warn the post-electoral violence could plunge the country into a political crisis.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29045337/AFP-via-Getty-Images-Many-in-Cameroon-are-furious-that-Paul-Biya-has-won-an-eighth-term-as-president.webp",
            "description": "<p>BBC Cameroon’s Interior Minister Paul Atanga Nji says opposition leader Issa Tchiroma Bakary will face legal action over allegations he incited “violent post-election demonstrations”. At least four protesters have been killed during clashes between security forces and opposition supporters since Cameroon’s election on 12 October, with 92-year-old President Paul Biya winning an eighth consecutive term. Tchiroma Bakary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cameroon-opposition-leader-to-face-legal-action-over-election-unrest-government-says/\">Cameroon opposition leader to face legal action over election unrest, government says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mnangagwa hails tight policy impact on ZWG stability, inflation",
            "url": "https://www.newzimbabwe.com/mnangagwa-hails-tight-policy-impact-on-zwg-stability-inflation/",
            "content": "By Alois Vinga\n\nPresident Emmerson Mnangagwa on Tuesday praised the Reserve Bank of Zimbabwes (RBZ) tight monetary policy stance, describing it as favourable for sustaining economic activity and maintaining stability in the economy.\n\nSince taking over as RBZ Governor last year, Dr. John Mushayavanhu has implemented a restrictive monetary policy aimed at anchoring price, currency, and exchange rate stability. The approach involves maintaining a high bank policy rate, currently at 35%,to curb speculative borrowing, which has been a major driver of excess liquidity and illicit parallel market activity.\n\nOther measures, such as elevated reserve requirements, have also been introduced to control inflation while supporting long-term economic growth.\n\nAs a result, the policy has helped sustain the ZWG currency, which has enjoyed nearly a year of relative stability, encouraging broader acceptance and usage.\n\nPresenting the State of the Nation Address (SONA), Mnangagwa credited the RBZs monetary discipline for fostering a favourable economic environment.\n\nThe tight monetary and fiscal environment in the economy has remained favourable to support sustained economic activity. My Government is diligently implementing the necessary policies, measures, and initiatives to maintain the stability of the ZWG and inflation, he said.\n\nThe President added that the ongoing trend of macroeconomic stability is expected to become a permanent feature of Zimbabwes economy.\n\nHe also highlighted significant progress in the countrys foreign currency generation capacity.\n\nInflows stood at US$10.4 billion as of August 2025, an increase of 26.8% from the US$8.3 billion recorded during the same period in 2024. Consequently, foreign currency reserves rose to about US$900 million by the end of September 2025, up from US$700 million in June 2025.\n\nIn recognition of this progress, the World Bank recently ranked Zimbabwe first among the top 10 countries globally that have made significant gains in foreign currency reserve accumulation. On the fiscal front, I am pleased to advise that we remain steadfast in strengthening sustainable resource mobilisation strategies to ensure the continued provision of public services, Mnangagwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga President Emmerson Mnangagwa on Tuesday praised the Reserve Bank of Zimbabwe’s (RBZ) tight monetary policy stance, describing it as favourable for sustaining economic activity and maintaining stability in the economy. Since taking over as RBZ Governor last year, Dr. John Mushayavanhu has implemented a restrictive monetary policy aimed at anchoring price, currency,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-hails-tight-policy-impact-on-zwg-stability-inflation/\">Mnangagwa hails tight policy impact on ZWG stability, inflation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mines and Minerals Bill to be finalised during current Parliamentary session",
            "url": "https://www.newzimbabwe.com/mines-and-minerals-bill-to-be-finalised-during-current-parliamentary-session/",
            "content": "By Alois Vinga\n\nPresident Emmerson Mnangagwa on Tuesday reaffirmed his governments commitment to finalising the Mines and Minerals Bill during the current session of Parliament.\n\nThe government gazetted the Bill in June this year, bringing relief to communities that have long endured hardships caused by mining-related activities.\n\nAmong other provisions, the Bill seeks to replace the Mines and Minerals Act (Chapter 21:05) of 1961, establish a Mining Affairs Board to guide decision-making processes, and introduce clearer rules on the management of mining titles, particularly with regard to the cadastre system and exploration rights.\n\nOnce enacted, the legislation is expected to strengthen environmental compliance and land rehabilitation obligations, enhance governance through transparency and accountability mechanisms in the allocation of mining rights, and define and protect community rights, including benefit-sharing and land access protocols.\n\nResponding to long-standing calls from organisations such as Silveira House, which has worked tirelessly to promote human rights in mining communities, Mnangagwa reassured the nation of the Bills expeditious finalisation.\n\nThe Mines and Minerals Amendment Bill has been gazetted and is expected to be finalised during the current session of Parliament. My Government is committed to weeding out irresponsible mining stakeholders who cause pollution, environmental degradation, and damage to critical infrastructure.\n\nAs we welcome investors into our jurisdiction, we expect them to adhere to the Constitution and laws of our country, while also respecting our people, customs, and culture, he said.\n\nHowever, citizens have urged the government to make the Mines and Minerals Bill available in vernacular languages to ensure easier understanding and interpretation, especially within mining communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga President Emmerson Mnangagwa on Tuesday reaffirmed his government’s commitment to finalising the Mines and Minerals Bill during the current session of Parliament. The government gazetted the Bill in June this year, bringing relief to communities that have long endured hardships caused by mining-related activities. Among other provisions, the Bill seeks to replace</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mines-and-minerals-bill-to-be-finalised-during-current-parliamentary-session/\">Mines and Minerals Bill to be finalised during current Parliamentary session</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "29 Oct 2025"
        }
    ]
}