{
    "news": [
        {
            "title": "Chiwenga fires shots at Zimbabwean care workers in the UK, says they are taking care of mentally challenged former sex workers",
            "url": "https://www.newzimbabwe.com/chiwenga-fires-shots-at-zimbabwean-care-workers-in-the-uk-says-they-are-taking-care-of-mentally-challenged-former-sex-workers/",
            "content": "By Staff Reporter\n\nOUTSPOKEN evangelist, Apostle Talent Chiwenga has blasted Zimbabweans working as caregivers in the United Kingdom and other developed countries, saying they have been relegated to taking care of unwanted, mentally challenged former sex workers all because of money.\n\nChiwenga was speaking during a sermon at Jesus Revelation Ministries, a denomination he founded with controversial and strict doctrines such as the absence of wives consent within a marriage.\n\nHis comments on caregivers come at a time when Zimbabweans are leaving the country enmasse to eke out a living in greener pastures due to lack of employment opportunities locally, a faltering economy and maladministration.\n\nOver 4,500 Zimbabwean trained nurses and doctors are employed by the UKs National Health Service (NHS), thousands more went there as nurse aides while countries such as Australia, USA and New Zealand have taken in more.\n\nIt is an error for us the sons of God to be used to toiling day and night doing filthy work so that other sinners may enjoy their lives, said the charismatic preacher.\n\nYou are the one taking care of the mother suffering from dementia as they go on vacation. You will be busy taking pictures of yourself and sending them back home saying life is good.\n\nYou have never washed your mothers clothes, have never bathed her or your grandmother but you are doing it all because of money.\n\nSome of these women were commercial sex workers who were abandoned by their children and are now being taken care of by the State. Those are the people you are taking care of in England.\n\nZimbabwean caregivers in the UK form a considerable chunk of the countrys diaspora community that contributed 25% of its total foreign currency earnings last year.\n\nChiwenga, however, said that kind of work should not be tolerated as it also causes mental fatigue.\n\nHe added: When you come back from work after finishing your shift, when you have spent the day bearing their spits on your face, what kind of love would you give to your spouse.\n\nDo you know that taking care of a mental patient causes mental fatigue itself because you are spending the day with them? Their relatives looked for you to do it because they did not want to do it themselves.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/10154139/Apostle-Chiwenga-e1583855020857.jpg",
            "description": "<p>By Staff Reporter OUTSPOKEN evangelist, Apostle Talent Chiwenga has blasted Zimbabweans working as caregivers in the United Kingdom and other developed countries, saying they have been relegated to taking care of unwanted, mentally challenged former sex workers all because of money. Chiwenga was speaking during a sermon at Jesus Revelation Ministries, a denomination he founded</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiwenga-fires-shots-at-zimbabwean-care-workers-in-the-uk-says-they-are-taking-care-of-mentally-challenged-former-sex-workers/\">Chiwenga fires shots at Zimbabwean care workers in the UK, says they are taking care of mentally challenged former sex workers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Harare street vendor arrested for putting public health at risk selling fake, expired groceries",
            "url": "https://www.newzimbabwe.com/harare-street-vendor-arrested-for-putting-public-health-at-risk-selling-fake-expired-groceries/",
            "content": "By Staff Reporter\n\nA STREET vendor in Harares central business district (CBD) has been arrested by municipal police for selling fake and expired groceries.\n\nIn a statement, City of Harare (CoH) said Bornwell Dirwai was caught in possession of goods that were expired and repackaged in South African branded containers. He was trading at the intersection of Rezende and Robert Mugabe streets.\n\nMost of the groceries are expired. The repackaged products include milk packaged in South African branded containers, margarine in Buttercup margarine containers and ZimGold packages, reads the statement.\n\nCoH has warned consumers to exercise extreme caution while shopping and advised buying groceries from reputable outlets.\n\nResidents are urged to exercise extreme caution when purchasing goods.\n\nThey should only buy from reputable shops to avoid health complications caused by fake products that have flooded the market, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08131030/IMG-20250108-WA0008.jpg",
            "description": "<p>By Staff Reporter  A STREET vendor in Harare’s central business district (CBD) has been arrested by municipal police for selling fake and expired groceries. In a statement, City of Harare (CoH) said Bornwell Dirwai was caught in possession of goods that were expired and repackaged in South African branded containers. He was trading at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-street-vendor-arrested-for-putting-public-health-at-risk-selling-fake-expired-groceries/\">Harare street vendor arrested for putting public health at risk selling fake, expired groceries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zim prospect signs new contract at Sheffield Wednesday, attracts loan interest from several clubs",
            "url": "https://www.newzimbabwe.com/zim-prospect-signs-new-contract-at-sheffield-wednesday-attracts-loan-interest-from-several-clubs/",
            "content": "By Soccer24\n\nZIMBABWEAN prospect, Sean Fusire has signed a new contract at Sheffield Wednesday in the United Kingdom.\n\nThe 19-year-old penned the deal earlier this week as he committed his future to the Owls following weeks of negotiations.\n\nWednesday have not disclosed for how long the extension ties Fusire to Hillsborough.\n\nSpeaking to Sheffield Wednesday media after signing the contract, Fusire said: Its a massive thing for me and my family, and a massive step in a long journey that Im hoping to be an even longer journey.\n\nAll the people around me know me as a Sheffield Wednesday player and its a privilege to be able to continue the journey.\n\nIve been here a long time and its all positive and good memories and loads of development.\n\nFusire joined the Wednesday academy at the age of nine and climbed the ranks to pen his maiden professional contract in December 2022.\n\nHe made his senior debut in the Emirates FA Cup against Fleetwood in February 2023 and has since posted four further appearances, all in the Carabao Cup.\n\nThe Zimbabwean is a regular on the training pitches with the first team and equally at home in central midfield or on the right of the engine room.\n\nMeanwhile, there have been reports suggesting that Fusire could leave Sheffield on loan in this window.\n\nThe youngster is said to be wanted by several League Two clubs including Carlisle United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08071440/Fusire.jpg",
            "description": "<p>By Soccer24 ZIMBABWEAN prospect, Sean Fusire has signed a new contract at Sheffield Wednesday in the United Kingdom. The 19-year-old penned the deal earlier this week as he committed his future to the Owls following weeks of negotiations. Wednesday have not disclosed for how long the extension ties Fusire to Hillsborough. Speaking to Sheffield Wednesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-prospect-signs-new-contract-at-sheffield-wednesday-attracts-loan-interest-from-several-clubs/\">Zim prospect signs new contract at Sheffield Wednesday, attracts loan interest from several clubs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Man (32) stoned to death for labelling hitchhiker wearing earrings as ‘gay’",
            "url": "https://www.newzimbabwe.com/man-32-stoned-to-death-for-labelling-hitchhiker-wearing-earrings-as-gay/",
            "content": "By Staff Reporter\n\nAN unpalatable remark referring to a fellow male hitchhiker as homosexual ended in tragedy for a Harare man, who was stoned to death by the former.\n\nThe incident occurred Monday at a bus stop near Boka tobacco auction floors in Harare after the now deceased mocked the suspect and labelled him as gay.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn January 6, 2025, police in Harare arrested Benedict Rueben in connection with a case of murder which occurred at Boka bus terminus along HarareMasvingo Road.\n\nThe suspect hit the victim, Maxwell Mahanzu (32) with a stone after the victim mocked him, claiming that he was gay since he was wearing earrings. The victim died on the spot.\n\nZimbabwean society still frowns upon homosexuality which is considered taboo.\n\nMeanwhile, police confirmed the arrest of lovebirds Kudzai Taendesa Chitima (24) and Fanuel Moyo (26) in connection with a case of murder which occurred on January 2, 2025, at a house at Badala Village 3, Inyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/13180829/Crime.jpg",
            "description": "<p>By Staff Reporter  AN unpalatable remark referring to a fellow male hitchhiker as ‘homosexual’ ended in tragedy for a Harare man, who was stoned to death by the former. The incident occurred Monday at a bus stop near Boka tobacco auction floors in Harare after the now deceased mocked the suspect and labelled him as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-32-stoned-to-death-for-labelling-hitchhiker-wearing-earrings-as-gay/\">Man (32) stoned to death for labelling hitchhiker wearing earrings as ‘gay’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Wildfire rages in Los Angeles, forcing 30,000 to evacuate",
            "url": "https://www.newzimbabwe.com/wildfire-rages-in-los-angeles-forcing-30000-to-evacuate/",
            "content": "By Reuters\n\nA RAPIDLY growing wildfire raged across an upscale section of Los Angeles on Tuesday, destroying homes and creating traffic jams as 30,000 people evacuated beneath huge plumes of smoke that covered much of the metropolitan area.\n\nAt least 2,921 acres (1,182 hectares) of the Pacific Palisades area between the coastal settlements of Santa Monica and Malibu had burned, officials said, after they had already warned of extreme fire danger from powerful winds that arrived following extended dry weather.\n\nThe fire spread as officials warned the worst wind conditions were expected to come overnight, leading to concerns that more neighborhoods could be forced to flee.\n\nThe city of Santa Monica later ordered evacuations in the northern fringe of town.\n\nWitnesses reported a number homes on fire with flames nearly scorching their cars when people fled the hills of Topanga Canyon, as the fire spread from there down to the Pacific Ocean.\n\nWe feel very blessed at this point that theres no injuries that are reported, Los Angeles Fire Chief Kristin Crowley told a press conference, adding that more than 25,000 people in 10,000 homes were threatened.\n\nFirefighters in aircraft scooped water from the sea to drop it on the nearby flames. Flames engulfed homes and bulldozers cleared abandoned vehicles from roads so emergency vehicles could pass, television images showed.\n\nAs the sun set over Los Angeles, towering orange flames illuminated the hills leading to Topanga Canyon.\n\nThe fire singed some trees on the grounds of the Getty Villa, a museum loaded with priceless works of art, but the collection remained safe largely because of preventive efforts to trim brush surrounding the buildings, the museum said.\n\nWith only one major road leading from the canyon to the coast, and only one coastal highway leading to safety, traffic crawled to a halt, leading people to flee on foot.\n\nCindy Festa, a Pacific Palisades resident, said that as she evacuated out of the canyon, fires were this close to the cars, demonstrating with her thumb and forefinger.\n\nPeople left their cars on Palisades Drive. Burning up the hillside. The palm trees  everything is going, Festa said from her car.\n\nBefore the fire started, the National Weather Service had issued its highest alert for extreme fire conditions for much of Los Angeles County from Tuesday through Thursday, predicting wind gusts of 50 to 80 mph (80 to 130 kph).\n\nWith low humidity and dry vegetation due to a lack of rain, the conditions were about as bad as it gets in terms of fire weather, the Los Angeles office of the National Weather Service said on X.\n\nGovernor Gavin Newsom, who declared a state of emergency, said the state positioned personnel, firetrucks and aircraft elsewhere in Southern California because of the fire danger to the wider region, he added.\n\nHopefully, were wrong, but were anticipating other fires happening concurrently, Newsom told the press conference.\n\nA second blaze dubbed the Eaton Fire later broke out some 30 miles (50 km) inland in the foothills above Pasadena, consuming 200 acres (80 hectares), Cal Fire said.\n\nThe powerful winds changed President Joe Bidens travel plans, grounding Air Force One in Los Angeles. He had planned to make a short flight inland to the Coachella Valley for a ceremony to create two new national monuments in California but the event was rescheduled for a later date at the White House.\n\nI have offered any federal assistance that is needed to help suppress the terrible Pacific Palisades fire, Biden said in statement. A federal grant had already been approved to help reimburse the state of California for its fire response, Biden said.\n\nPacific Palisades is home to several Hollywood stars. Actor James Woods said on X he was able to evacuate but added, I do not know at this moment if our home is still standing.\n\nActor Steve Guttenberg told KTLA television that friends of his were impeded from evacuating because others had abandoned their cars in the road.\n\nIts really important for everybody to band together and dont worry about your personal property. Just get out, Guttenberg said. Get your loved ones and get out.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08060901/download-1-1.jpeg",
            "description": "<p>By Reuters A RAPIDLY growing wildfire raged across an upscale section of Los Angeles on Tuesday, destroying homes and creating traffic jams as 30,000 people evacuated beneath huge plumes of smoke that covered much of the metropolitan area. At least 2,921 acres (1,182 hectares) of the Pacific Palisades area between the coastal settlements of Santa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wildfire-rages-in-los-angeles-forcing-30000-to-evacuate/\">Wildfire rages in Los Angeles, forcing 30,000 to evacuate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Legendary South African singer Winnie Khumalo dies at 51 after short illness",
            "url": "https://www.newzimbabwe.com/legendary-south-african-singer-winnie-khumalo-dies-at-51-after-short-illness/",
            "content": "By IOL\n\nLEGENDARY South African actress and singer Winnie Khumolo, best known for her hit song Live My Life, has died at 51 after a short illness, a family representative confirmed.\n\nFamily spokesperson, Tshephi Rakeepile, confirmed that Khumalo died on Tuesday after a short illness.\n\nIn an interview with the SABC, Rakeepile expressed that the family is in deep sorrow, saying: We are deeply saddened as a family to announce the death of our dearly beloved sister, a mother, our friend, she passed away after a short illness and as a family at this stage we are deeply saddened.\n\nKhumalo was the mother of singer Rethabile Khumalo and the late boxing champion Digaan Thobelas son, Thabo Khumalo.\n\nRakeepile disclosed that Khumalo was alone when she fell in and her daughter was not present at that time.\n\nWell, yes, she was sick at that moment and her daughter was out, but it was her daughter (Rethabile) that actually came back home to come and collect her so that she could be taken to the hospital, she said.\n\nAccording to Rakeepile, Rethabile tried to help her mother when she arrived home.\n\nShe did try to help her at that time, at that moment she was really not well.\n\nRakeepile said Khumalo died on her way to the hospital to get medical attention.\n\nBut unfortunately, on their drive to the hospital, thats when she passed away, because when they arrived at the hospital, they pronounced the death on arrival.\n\nThe cause of her death is unknown at the moment, however, she said the family is at a loss and devastated by Khumalos death.\n\nKhumalo leaves behind three grandchildren and extended family who are mourning her death.\n\nWho is Winnie Khumalo?\n\nKhumalo was born in Mofolo, north Soweto, and began her music career at the age of 15. She released her debut album Hey Laitie, Tshina Tshina, which was produced by music legend Sello Chicco Twala.\n\nIn the early 1980s, she released a gospel album titled Dlamini, followed by a gospel album titled Izoni Zami in the 1990s, produced by Paster Langa Dube.\n\nKhumalo has worked with notable musicians such as the late Brenda Fassie as a backing vocalist and collaborated with the likes of Pure Magic Sipho Mbele, Brothers of Peace (B.O.P) Bongo Maffin, Zonke Dikana and Dj Cleo.\n\nKhumalo has graced small television screens on SABCs series Mponeng and Muvhango, portraying the role of a sangoma (traditional healer).\n\nShe also played in a stage play called The Journey, including Thwalas film Madluphuthu.\n\nAfter taking a break from the music industry to raise her children, Khumalo made a successful comeback in 2008, with a mature album titled I Just Wanna Live My Life, which was produced and distributed by Kalawa Jazzmee Records Oskido Oscar Mdlongwa.\n\nThe album was a hit, selling more than 25 000 copies and earned a gold record, with its smash single, I Just Wanna Live My Life, dominating the music charts, receiving nominations, including the Channel O Music Awards.\n\nKhumalo went on to take the music industry by storm by releasing another hit song titled Mina Ngiyohlala Nginje, composed by Twala, which saw her rocking the stage with former president Jacob Zuma during the 2009 African National Congress (ANC) election campaigns.\n\nFollowing the news of her death, social media has been flooded with tributes from fans, supporters and the public paying tribute and honouring the late singer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08054237/Singer-Winnie-Khumalo-has-died-aged-51-after-a-short-illness-Picture-X-PhilMphela.webp",
            "description": "<p>By IOL LEGENDARY South African actress and singer Winnie Khumolo, best known for her hit song ‘Live My Life,’ has died at 51 after a short illness, a family representative confirmed. Family spokesperson, Tshephi Rakeepile, confirmed that Khumalo died on Tuesday after a short illness. In an interview with the SABC, Rakeepile expressed that the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legendary-south-african-singer-winnie-khumalo-dies-at-51-after-short-illness/\">Legendary South African singer Winnie Khumalo dies at 51 after short illness</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "State media houses to digitalise for enhanced output, audience reach— Information minister",
            "url": "https://www.newzimbabwe.com/state-media-houses-to-digitalise-for-enhanced-output-audience-reach-information-minister/",
            "content": "By Anna Chibamu\n\nINFORMATION, Publicity and Broadcasting Services Minister, Jenfan Muswere has called for a complete overhaul of the State media inorder to improve its operations in the digital age.\n\nAddressing journalists at a Cabinet media engagement cafe this Monday at Munhumutapa offices, Muswere expressed concern over the continued decrease of copy circulation at government-controlled media institutions, reiterating the need to digitalise operations.\n\nHe said it was important to adapt to new ways of publishing and incorporate digital tools as a means to catch up with other media companies elsewhere.\n\nOn that note, Muswere highlighted that this year, his ministry will hold media training sessions in digital media incorporating AI and data analytics for media practitioners to be able to report effectively.\n\nAccording to Muswere, the number of printed copy has gone down by a huge margin compared to some years back owing to many reasons, amongst them the coming of new and digital media, respectively.\n\nThe ministers call comes at the backdrop of a number of challenges facing newsrooms, where most are at the brink of collapse due to economic hardships, hence the importance of navigating new ways of survival.\n\nWe have had quite a number of meetings with some of the executives and editors on how best we can deal with the challenges related to the low circulation per day in terms of the print media.\n\nWe are all aware that we used to print more than 200,000, and to less than 10,000 daily circulations, all print media houses combined on average, that we now need to implement digital transformation strategies.\n\nI can highlight that Zimpapers is undergoing the total transformation of the institution, focusing primarily on digital transformation, behavioural transformation of management, board, and staff, a cultural transformation, and at the same time ensuring that the institution is totally restructured to align with online media platform operations.\n\nDue to the new technology and new media, online platforms have been the favorite among Zimbabweans who now shun hard copies for online platforms.\n\nThe minister emphasised the importance of digital sovereignty to find best ways to work together with all media houses in order to ensure whatever diversity that is there, everyone should always defend Zimbabwe.\n\nThere are some of the programmes that we have put in place, starting with the ZimDigital project, which seeks to ensure that we achieve 100% media sovereignty in our country, and the ZimDigital project received funding in the last quarter of 2024, and we believe that we can catapult television coverage from 38% to 100% within a space of two years.\n\nWe can also accelerate digital transformation in terms of the ZimDigital for radio from 62% to 100% within the next two years. So, all modalities have been put in place with a steering committee that I chair to ensure that we can accelerate the ZimDigital project, said Muswere.\n\nHe expects the project will be completed within the first quarter of 2025.\n\nWe are pretty sure that before April, we will be in a position to invite the President to officially launch the ZimDigital project.\n\nThe same applies with the media and communication policy, which will now go through other government processes for refinement and approval. The same also applies with regards to the tax holidays that we have offered to the media fraternity in order to support the growth and robustness of the sector.\n\nHe said among other strategies, the ministry adopted the heritage-based broadcasting, because our language, culture, values as a people define.who we are, and we have 16 official languages, which also includes Kalanga, Chindawu, and many other local languages.\n\nSo, the primary focus is for us to be able to participate even on the digital highway, even on digital platforms, as you collect, as you gather news and content across the country, let us also support our languages as the modernisation of Montrose Studios is taking place, and this will become the center of heritage-based broadcasting.\n\nWe want broadcasters, media practitioners, to be able to contribute to the digital world in our own local languages, so that each and every Zimbabwean is not left behind. The ZBC restructuring is also taking place,\n\nMuswere said there are no enemies anymore and media houses should find each other and work towards putting Zimbabwe first regardless of differences.\n\nZimbabwe comes first, that it is the responsibility of each and every Zimbabwean, and for the media fraternity, let us always ensure that we protect, advance, and defend the interests and rights of Zimbabwe, that whatever differences.\n\nSaid the minister: I am also happy to indicate that the members of the Fourth Estate have responded appropriately in order to support nation building. We all know that genocide, wars, instabilities in other countries, its the social media, its members of the Fourth Estate.\n\nIm happy to announce that weve had a number of sessions together with the Zimbabwe Media Commission (ZMC), which commission, in terms of the ZMC Act amendments, we are strengthening the legislation in order to manage the conduct of journalism as a profession.\n\nWe need to protect members of the Fourth Estate, because what we want is diversity, what we want is pluralism, what we want is to ensure that with all those different views, we remain united to defend the media sovereignty of our country, Muswere said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16100957/Dr-Jenfan-Muswere.png",
            "description": "<p>By Anna Chibamu INFORMATION, Publicity and Broadcasting Services Minister, Jenfan Muswere has called for a complete overhaul of the State media inorder to improve its operations in the digital age. Addressing journalists at a Cabinet media engagement cafe this Monday at Munhumutapa offices, Muswere expressed concern over the continued decrease of copy circulation at government-controlled</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/state-media-houses-to-digitalise-for-enhanced-output-audience-reach-information-minister/\">State media houses to digitalise for enhanced output, audience reach— Information minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Zimbabwe ranked among Top 10 African countries with high crime rate",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranked-among-top-10-african-countries-with-high-crime-rate/",
            "content": "By Staff Reporter\n\nPOVERTY in Zimbabwe is fuelling criminal activities that have seen the Southern African nation ranked among the Top 10 countries with a high crime rating.\n\nAccording to Numbeo Crime Index, Zimbabwe is ranked seventh on the continent comparing lowly to crime-riddled South Africa, which came tops.\n\nThe Rainbow nation is Africas most crime-affected country, with a crime index score of 74.7, placing it 5th on the globe while Zimbabwe is ranked 25th globally.\n\nThe survey says inequalities and high unemployment are among the leading causes of crime globally, and Africa is no exception. Poverty, unemployment, and lack of access to education create conditions where individuals resort to illegal activities for survival.\n\nThe prevalence and types of crimes vary widely across African countries. It was also noted that crime is a universal issue, reflective of societal disparities and struggles, but its manifestations vary across regions.\n\nIn urban centres, particularly in informal settlements, these challenges are acute. Many African cities are grappling with rapid urbanisation, leaving governments struggling to provide adequate housing, sanitation, and security services. This neglect fosters environments where petty theft, burglary, and violent crime thrive, noted Numbero Crime Index.\n\nSouth Africa, the most dangerous country to be on the continent and fifth globally, faces pervasive violent crimes such as homicides, robberies, and assaults, exacerbated by unemployment and inadequate law enforcement. Despite efforts to curb crime, such as community policing initiatives and social programmes, many South Africans report feeling unsafe.\n\nNigeria ranked 11th globally with a crime index score of 66.6, confronts widespread security issues, including organised crime, armed robberies, and kidnappings.\n\nAngola follows closely, ranked 13th globally with a score of 66.3, where both violent and property crimes remain prevalent, particularly in urban areas.\n\nBelow are the top 10 African countries with the highest crime index at the start of 2025, according to Numbero Crime Index.\n\n1. South Africa 74.7 (5th globally)\n\n2. Nigeria 66.6 (11th)\n\n3. Angola 66.3 (13th)\n\n4. Cameroon 65.5 (14th)\n\n5. Somalia 63.9 (17th)\n\n6. Namibia 63.5 (19th)\n\n7. Zimbabwe 60.7 (25th)\n\n8. Mozambique 60.1 (28th)\n\n9. Ivory Coast 56.4 (35th)\n\n10. Libya 56.4 (36th)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/10/18162129/Police-helmet.jpg",
            "description": "<p>By Staff Reporter  POVERTY in Zimbabwe is fuelling criminal activities that have seen the Southern African nation ranked among the Top 10 countries with a high crime rating. According to Numbeo Crime Index, Zimbabwe is ranked seventh on the continent comparing lowly to crime-riddled South Africa, which came tops. On the African continent, Nigeria, Angola,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranked-among-top-10-african-countries-with-high-crime-rate/\">Zimbabwe ranked among Top 10 African countries with high crime rate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Aspiring homeowners urged to desist from buying residential stands from land barons",
            "url": "https://www.newzimbabwe.com/aspiring-homeowners-urged-to-desist-from-buying-residential-stands-from-land-barons/",
            "content": "By Anna Chibamu\n\nAS government is in the process of regularising informal settlements in most urban areas countrywide, a call has been made to citizens to desist from buying residential stands from land barons.\n\nWith the housing waiting list in urban Harare said to be over two million, government says people should not continue to buy stands from criminals posing as council officials or those working with officials.\n\nThousands have lost millions of dollars to suspected or known land barons, especially in Harare as they seek to own properties.\n\nAddressing journalists in Harare, Local Government Minister, Daniel Garwe said members of the public must not buy land from unscrupulous elements.\n\nHe highlighted the need to regularise all the informal settlements across the country.\n\nIf we are to speak of an upper middle income economy status by 2030, we need to make conscious decisions, not only the central government, but all Zimbabweans to ensure that we regularise. How do we start it? It starts with you and me.\n\nPlease stop buying land from land barons. That is the first call on regularisation.\n\nWe now have structures put in place to ensure that you can come to the Minister of Local Government, you can go to any local authority and be able to get information of the availability of a stand in the area of choice if they are there. So, stop buying land from criminals. Thats the first step of regularisation, Garwe said.\n\nFor already existing informal settlements such as Caledonia and Harare South, a budget is now in place to ensure that government engages developers to do servicing and put water, sewer and roads infrastructure.\n\nWe want residents to participate. How do they participate? If they are desirous of having a title deed, they pay for the land first.\n\nGarwe reiterated land belongs to the State and the public should be made aware that land barons were stealing government property and parceling it out to unsuspecting homeseekers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/24044211/Housing-development.jpg",
            "description": "<p>By Anna Chibamu AS government is in the process of regularising informal settlements in most urban areas countrywide, a call has been made to citizens to desist from buying residential stands from land barons. With the housing waiting list in urban Harare said to be over two million, government says people should not continue to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/aspiring-homeowners-urged-to-desist-from-buying-residential-stands-from-land-barons/\">Aspiring homeowners urged to desist from buying residential stands from land barons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        },
        {
            "title": "Gweru eases water rationing as supply improves from 35 to 62 megalitres per day",
            "url": "https://www.newzimbabwe.com/gweru-water-rationing-eases-as-supply-improves-from-35-to-62-megalitres-per-day/",
            "content": "By Tapiwa Svondo\n\nPARTS of the Midlands provinces city of Gweru that once endured water rationing, sometimes going days without a drop, have seen improved water supply owing to increasing levels at various dams.\n\nCurrently pumping capacity is at 62 megalitres per day up from 35 megalitres, according to Gweru Mayor, Martin Chivoko.\n\nThe mayor announced the latest development while presenting the citys 2024 achievements.\n\nIn the statement, Chivoko said the upgrade was made possible through the procurement of low-lift pumps for the Amapongokwe Dam, which has boosted the raw water production for the Gwenoro Water Treatment Plant.\n\nOne of the most notable achievements of the City of Gweru in 2024 was the improvement in its water supply.\n\nThe procurement of low-lift pumps for Amapongokwe Dam enabled the city to increase its raw water production for the Gwenoro Water Treatment Plant.\n\nAs a result, the city was able to increase its treated water pumping capacity from 35 megalitres to 62 megalitres.\n\nThis significant increase in water supply has eased water rationing, with some areas now receiving water for 5 to 6 days a week.\n\nThe improvement in the citys water supply has had a positive impact on the lives of its residents, said the premier.\n\nFurthermore, the City of Gweru is pushing its 2025 plans to increase the water supply system to high-lying areas that do not receive water.\n\nAs we look to 2025, the City of Gweru has outlined several exciting plans.\n\nOne of the citys top priorities is to increase the pumping capacity of Whitewaters Dam. This will enable the city to supply water to high-lying areas such as Ridgemont, Northgate, Hertfordshire, Harben Park, and Athlone.\n\nThe city has budgeted for this project and is expected to commence work soon, he said.\n\nIn an interview with NewZimbabwe.com, Chivoko confirmed that the water that is being supplied to its residents is treated using several chemicals and it is safe for human consumption.\n\nYes, our water is treated. We use standard water treatment chemicals, including chlorine and alum, to ensure the water is safe for consumption.\n\nOur treatment process involves coagulation, sedimentation, filtration, and disinfection. We treat the water from our dams regularly, following strict safety protocols, the mayor explained.\n\nWith a more reliable water supply, residents are now able to access clean water for drinking, cooking, and other domestic uses.\n\nThis has improved the overall health and well-being of the citys residents, particularly children and the elderly, who are most vulnerable to water-borne diseases.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/20024409/Water-Tape.jpeg",
            "description": "<p>By Tapiwa Svondo  PARTS of the Midlands province’s city of Gweru that once endured water rationing, sometimes going days without a drop, have seen improved water supply owing to increasing levels at various dams. Currently pumping capacity is at 62 megalitres per day up from 35 megalitres, according to Gweru Mayor, Martin Chivoko. The mayor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gweru-water-rationing-eases-as-supply-improves-from-35-to-62-megalitres-per-day/\">Gweru eases water rationing as supply improves from 35 to 62 megalitres per day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "08 Jan 2025"
        }
    ]
}