{
    "news": [
        {
            "title": "Police officer arrested for receiving US$40 bribe",
            "url": "https://www.newzimbabwe.com/police-officer-arrested-for-receiving-us40-bribe/",
            "content": "By Staff Reporter\n\nA POLICE officer stationed at Zengeza, Harare, landed in the dock after allegedly receiving a US$40 bribe to release a theft suspect.\n\nEdson Nangwani was caught red handed with trap money after he was reported to the Police Anti-Corruption Unit (PACU).\n\nNangwani appeared before a Chitungwiza magistrate charged with criminal abuse of office and extortion. He was granted US$100 bail.\n\nHe is expected back in court in two weeks time when he is expected to be furnished with a trial date.\n\nAllegations are that on June 7, 2025, a suspect, Tatenda Tichareva was arrested for allegedly possessing a stolen Samsung Galaxy A04E.\n\nThat same day, the suspects friend, Vincent Joni approached the investigating officer (the accused) to seek clarity on the case.\n\nInstead of offering a professional explanation, the accused demanded US$200 in exchange for the suspects release and for the matter to be shelved, said the State.\n\nThe friend reported the bribe demand to the CID Police Anti-Corruption Unit (PACU), triggering a carefully coordinated trap operation.\n\nOn the 9th of June 2025, a team of PACU detectives accompanied the friend to ZRP Zengeza, where the accused contacted the suspects friend and directed him to Office G13, and later to Office G16 for the transaction.\n\nThe court heard, under surveillance, the friend handed over US$40 in marked trap money:1 x US$20 (Serial: PH50115833C) 2 x US$10 (Serials: PK45658296B & PB36416637E) the accused received the cash inside Office G16, unaware he was being watched by detectives.\n\nMoments later, Nangwani was caught red-handed with the trap money in his left hand and immediately arrested.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/02234101/handcuffs.jpg",
            "description": "<p>By Staff Reporter A POLICE officer stationed at Zengeza, Harare, landed in the dock after allegedly receiving a US$40 bribe to release a theft suspect. Edson Nangwani was caught red handed with trap money after he was reported to the Police Anti-Corruption Unit (PACU). Nangwani appeared before a Chitungwiza magistrate charged with criminal abuse of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-arrested-for-receiving-us40-bribe/\">Police officer arrested for receiving US$40 bribe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Jun 2025"
        },
        {
            "title": "Chivhayo gifts Highlanders with US$250,000 sponsorship",
            "url": "https://www.newzimbabwe.com/chivhayo-gifts-highlanders-with-us250000-sponsorship/",
            "content": "By Sports Reporter\n\nCONTROVERSIAL businessman Wicknell Chivhayo has donated US$250,000 to Zimbabwe football giants Highlanders.\n\nChivhayo announced this on his social media handles this Wednesday.\n\nIn recognition of my beloved uncles last wishes and my personal love for the game of football, it is my greatest pleasure to avail sponsorship worth US$250,000 in cash to Highlanders FC, as my small token to assist the club in its various administrative requirements, read part of Chivhayos post.\n\nChivhayos sponsorship to Bosso comes a few months after he settled the clubs US$26,500 debt to former coach Baltermir Britto, hence bailing out the club from a FIFA ban.\n\nThe flamboyant businessman added that the sponsorship is part of US$1 million package which he will further disburse next year.\n\nThis is just but part of a broader sponsorship package of US$1 million that will run over the next year to help the club to secure new talent and cover player sign-on fees in order to foster a more competitive 2025 Premier Soccer League, further read his post.\n\nBosso had a poor 2025 pre-season preparations due to lack of finances. The Bulawayo-based side even failed to make meaningful signings of new players after losing key players to better paying clubs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/31043415/Highlanders.png",
            "description": "<p>By Sports Reporter CONTROVERSIAL businessman Wicknell Chivhayo has donated US$250,000 to Zimbabwe football giants Highlanders. Chivhayo announced this on his social media handles this Wednesday. “In recognition of my beloved uncle’s last wishes and my personal love for the game of football, it is my greatest pleasure to avail sponsorship worth US$250,000 in cash to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivhayo-gifts-highlanders-with-us250000-sponsorship/\">Chivhayo gifts Highlanders with US$250,000 sponsorship</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Jun 2025"
        },
        {
            "title": "‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP",
            "url": "https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/",
            "content": "FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomonas recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid.\n\nGeo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under the then Ministry of Local Government, led by Winston Chitando (now Mines and Mining Minister).\n\nThe company was registered by Mirel Mrtiri, an Albanian businessman linked to corruption in his home country. Its Executive Chairman and CEO, Delish Nguwaya, is a regular attendee at state functions and is known to be a close associate of President Emmerson Mnangagwas son, Sean Mnangagwa.\n\nNguwaya was previously charged with corruption over Covid-19 procurement contracts involving his company, Drax International, in 2020, but was acquitted by court in September 2023.\n\nThey have no legal mandate to independently take over public waste management under our law, Mahere posted on her X account on Wednesday.\n\nMahere, a constitutional lawyer, argued that Geo Pomona should not impose itself on residents, as their obligations lie with the CoH, not individual households.\n\nFormer Mt Pleasant MP Fadzayi Mahere\n\nThey are not a statutory body. At best, if they have a contract with City of Harare, they are the citys agent. This means that the City of Harare is the principal and public facing party with Geo Pomona working under them as an agent. They cannot do their business independently of the city and force themselves onto people with whom they have no legal relationship.\n\nMahere questioned Geo Pomonas authority to bill residents directly, stating that the company lacks the legal basis to do so.\n\nFor the avoidance of doubt, they have no right to bill or otherwise engage residents directly absent a valid agreement with individual residents to do so. Only the City of Harare can do that in line with its powers as a local authority under Zimbabwes local government laws, she said.\n\nGeo Pomona is set to receive over US$162 million from the CoH over five years, with ratepayers ultimately footing the bill.\n\nThe 30-year agreement stipulated that Harare must deliver 550 tonnes of waste, or a minimum of 200,750 tonnes per year, resulting in US$8.03 million for the company in the first year.\n\nThis has opened doors for Geo Pomona to potentially take control of the entire waste management process, from street sweeping and refuse collection to waste disposal thereby billing residents directly.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/09034942/solid-waste.jpg",
            "description": "<p>By Staff Reporter FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomona’s recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid. Geo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/\">‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Jun 2025"
        },
        {
            "title": "Teen sentenced to life for killing aunt in cold blood before violating her corpse",
            "url": "https://www.newzimbabwe.com/teen-sentenced-to-life-for-killing-aunt-in-cold-blood-before-violating-her-corpse/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge, Justice Munamato Mutevedzi has expressed concern over some cases judges preside over further noting that crimes that are being committed around Zimbabwe may suggest that the world is coming to an end.\n\nThe judge also said court officials would require psychological support for them to cope with things they hear in court everyday.\n\nMutevedzi said this while handing down sentence against one Tapiwa Mereka (19) at the Gweru High Court.\n\nMereka was found guilty of the gruesome murder of his mothers sister Mary Mereka on January 27, 2023, and also raping her lifeless body.\n\nMutevedzi said Mereka deserved capital sentence adding that he is fortunate that death penalty had been scrapped.\n\nIf it is true that on some day God will destroy the world, then that time is nigh. Some of the crimes that we preside over suggest that Armageddon is imminent.\n\nTapiwa Mereka (the offender) has a head but it is doubtful that he has a brain inside it. If he does, then his mind is so perverted and depraved that he should not be living amongst human beings.\n\nThe crime that he committed is unconscionable and would possibly win an Oscar award for horror movies.\n\nEvery one of us who took part in the trial would be thinking about this for a long time to come.\n\nIt lays bare, the oft-repeated myth that judges are inanimate.\n\nThe reality is that judicial officers and other court officials who work in the criminal courts and hear these horrific stories almost on a daily basis may suffer what is called vicarious trauma.\n\nThey all may end up requiring therapy in one form or another, Mutevedzi said.\n\nThe court heard Mereka had plotted to rape and kill his aunt for a long time.\n\nIn his warned and cautioned statement accused person admitted that he always admired her and wanted to sleep with her.\n\nHe was biding his time and waiting for an opportune moment to strike.\n\nHe said the idea became maddening some three days before the murder andcould not shake off the desire and lust to have sexual intercourse with his aunt.\n\nHe convinced himself to carry out the satanic idea on the fateful morning.\n\nI do admit to the allegations levelled against me. The deceased was my aunt but I had quite some time admiring her and I wished that I have some time to rape her.\n\nI also had the intention to kill her. I had no valid reason but I just felt that I have to kill her.\n\nSo, when I was with her in the field weeding together with her I then got the chance and took an axe which was in the field and struck her three times on the head whilst she was not expecting it.\n\nAfter striking her she fell down. I removed her pant and had sexual intercourse with her.\n\nAfter I finished I dressed her and took the axe and threw it outside the field and went to Sebakwe River with the intention to stay there, Mereka admitted.\n\nThe teenager said at the time the time of the sex, the deceased was still alive although in a vegetative state.\n\nMutevedzi said even imagining that his victim was dead by the time he committed the abomination, his actions would have amounted to the crime of violating a dead body in contravention of section 111 of the Criminal Law (Codification and Reform) Act.\n\nHe said in other jurisdictions, it would have been the crime of necrophilia, which criminalises any sexual attraction to a dead person.\n\nThe judge said this aggravates Merekas situation.\n\nHaving found that the murder is aggravated there cannot be escaping the severest punishment.\n\nBefore the abolition of the penalty of death from our statute books this was a case that would have undoubtedly attracted capital punishment.\n\nNeedless to state, that option is no longer available. The only two choices which the court has are sentencing the offender either to life imprisonment or to a determinate term of not less than 20 years.\n\nWhat is worse is that he said he was prepared to kill for no reason. He is, therefore, a dangerous individual whom the court cannot risk letting back into society.\n\nHe may kill again for nothing else other than his enjoyment.\n\nHe appears worse than a robber who kills for financial gain because it is possible to resist that more than a desire that one cannot explain.\n\nIt is like the offender gets possessed by some irresistible spirit.Given the above, our hands are, therefore, tied. It is difficult to empathise with the offender.\n\nIf he could be so sadistic as to easily kill his own mother and still find sexual gratification from her in that state of helplessness, we shudder to think what he could possibly do to a stranger or to children.\n\nHe is someone whose soul must be left to God to correct. As a court, we can do no more than administer justice.\n\nWe will permanently remove him from society and confine him to the secure walls of a prison.\n\nAccordingly, the offender is sentenced to life imprisonment, the judge ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga HIGH Court judge, Justice Munamato Mutevedzi has expressed concern over some cases judges preside over further noting that crimes that are being committed around Zimbabwe may suggest that the world is coming to an end. The judge also said court officials would require psychological support for them to cope with things they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-sentenced-to-life-for-killing-aunt-in-cold-blood-before-violating-her-corpse/\">Teen sentenced to life for killing aunt in cold blood before violating her corpse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare councillors fight undervaluation of land compensated to Chiyangwa’s Pinnacle Holdings",
            "url": "https://www.newzimbabwe.com/harare-councillors-fight-undervaluation-of-land-compensated-to-chiyangwas-pinnacle-holdings/",
            "content": "By Darlington Gatsi\n\nHARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate land to Pinnacle Holdings as compensation for property acquired by the government.\n\nPinnacle Holdings is owned by businessman Philip Chiyangwa, who is also a ZANU PF member.\n\nThe directive sparked a heated debate in a recent Council meeting, with Ward 16 Denford Ngadziore expressing concern that the council might part with the land at a value lower than its actual price.\n\nThe report is saying US$5 per square metre. So my argument is, in Malbereign and around Harare, we are selling at US$20 per square metre, whilst on the other side, it is going for US$5 per square metre.\n\nWe cannot transfer land whose value we do not know. We are not transferring tomatoes; this is land we are talking about, said Ngadziore.\n\nThe proposed compensation has angered residents, with associations labelling the move as unconstitutional and tantamount to government interference in the affairs of the local authority.\n\nAs a result, residents are calling for the compensation to Pinnacle Holdings to be halted.\n\nSeveral stands have been earmarked for compensation, subject to the Councils approval. However, anomalies have been raised regarding some of the stands.\n\nAdonia Shoko raised a red flag over stands in Kuwadzana, stating that some individuals already hold offer letters for the land.\n\nKudzai Kadzombe also raised a similar concern regarding land identified as part of the compensation to Pinnacle Holdings.\n\nI have a personal interest because, as Councillor of Ward 41, we have already raised this issue. We have a piece of land in Bluffhill which is on that list, but residents had already submitted a petition and begun mobilising to build a council school, said Kadzombe.\n\nThe HCC Finance Committee is set to deliberate on Garwes directive and conduct due diligence on the anomalies raised in the meeting.\n\nHowever, Mafume bluntly told the Council that those aggrieved should consider mounting a legal challenge.\n\nAnyone who feels aggrieved or has their property rights affected by the letter is advised to make a beeline to their lawyers, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/07224513/town-house.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands. The Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-councillors-fight-undervaluation-of-land-compensated-to-chiyangwas-pinnacle-holdings/\">Harare councillors fight undervaluation of land compensated to Chiyangwa’s Pinnacle Holdings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Jun 2025"
        },
        {
            "title": "A new approach to dealing with Africa – visiting UK minister confirms softened stance towards Mnangagwa regime",
            "url": "https://www.newzimbabwe.com/a-new-approach-to-dealing-with-africa-visiting-uk-minister-confirms-uks-softened-stance-towards-mnangagwa-regime/",
            "content": "By Leopold Munhende\n\nUNITED Kingdoms (UK) Minister for Africa, Lord Ray Collins, the first British cabinet member to visit in seven years, has confirmed their softened stance towards Zimbabwe and talked of a new approach towards the continent and former colony.\n\nCollins, who visited President Emmerson Mnangagwa at State House on Wednesday, said Prime Minister Keir Starmers government had crafted a new approach that emphasised on listening rather than talking, on Africas agenda and not only theirs.\n\nHis watered-down comments come barely a month after the UK struck off former Central Intelligence Organisation (CIO) boss Isaac Moyo, former police Commissioner General Godwin Matanga, ministers Anselem Sanyatwe, Owen Ncube and the Zimbabwe Defence Industries (ZDI) from its sanctions list.\n\nSanyatwe gained infamy for testifying, during an August 1, 2018, Commission of Inquiry in defence of soldiers, who gunned down innocent lives in Harare. Moyo and Matanga formed part of Mnangagwas brutal security apparatus, specifically targeted at dissenting political and human rights activists.\n\nWe are absolutely committed to building a partnership based on equality and respect but on a simple mission of economic growth, growth that can support both our people (and) creating a win-win situation, said Collins.\n\nI am extremely pleased and looking forward to returning to Zimbabwe.\n\nThe new government in the UK is about developing a new approach to the continent of Africa, where we actually launched a consultation last year, a consultation on our approach, which was about listening and not talking, focusing on the continents agenda and not only ours.\n\nThe dramatic shift in policy comes at a time Mnangagwa had unsuccessfully been battling to re-engage with Western countries such as America, the UK, Australia and Canada, who have always pointed out his human rights record as a red flag.\n\nIn December 2024, Collins spoke against readmitting Zimbabwe into the Commonwealth, a union of mainly former British colonies. Speaking in the UK Parliaments House of Lords, he said his Africa office did not support Zimbabwes readmission after an assessment by the Commonwealth Secretariat. He proposed further steps on democracy, government and respect for human rights.\n\nSpeaking to journalists after meeting Mnangagwa on Wednesday, Collins said their approach was not a one size fits all.\n\nHe added: That win-win situation is something that I think we all want to ensure future prosperity for Zimbabwe and future prosperity for the UK.\n\nAs we move forward, what we are absolutely clear, our approach is not one size fits all, it is about strengthening our bilateral relations. I said to His Excellency that I am very determined to return to Zimbabwe to ensure that we actually deliver what we promise.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12110325/UK-Minister-for-Africa-Lord-Ray-Collins-and-President-Emmerson-Mnangagwa.jpg",
            "description": "<p>By Leopold Munhende UNITED Kingdom’s (UK) Minister for Africa, Lord Ray Collins, the first British cabinet member to visit in seven years, has confirmed their softened stance towards Zimbabwe and talked of ‘a new approach’ towards the continent and former colony. Collins, who visited President Emmerson Mnangagwa at State House on Wednesday, said Prime Minister</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-new-approach-to-dealing-with-africa-visiting-uk-minister-confirms-uks-softened-stance-towards-mnangagwa-regime/\">A new approach to dealing with Africa – visiting UK minister confirms softened stance towards Mnangagwa regime</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:47",
            "date": "13 Jun 2025"
        }
    ]
}