{
    "news": [
        {
            "title": "Pastor loses Budiriro home after faking illiteracy to evade repaying debt",
            "url": "https://www.newzimbabwe.com/pastor-loses-budiriro-home-after-faking-illiteracy-to-evade-repaying-debt/",
            "content": "By Mary Taruvinga\n\nA retired pastor who tried to evade repaying a US$22,750 loan by falsely claiming illiteracy has lost his case at the High Court, which ordered him to settle the debt and declared his Budiriro house executable.\n\nJudges of appeal Justices Hapias Zhou and Benjamin Chikowero ruled that Pastor Stefan Pios Mumbiro knowingly signed all loan and mortgage documents binding him to businessman Collins Farai Muchada, but later attempted to take advantage of his supposed illiteracy to escape liability.\n\nThe first respondent was not illiterate. He was educated up to Grade 7, could read and write, and even successfully undertook pastoral studies, the judges said. He cannot evade responsibility by pretending not to understand what he signed.\n\nThe court condemned Mumbiros conduct, saying he had taken advantage of Muchadas trust while later seeking to hide behind claims of being duped.\n\nEvidence before the court showed that Mumbiro willingly signed an Acknowledgement of Debt, a Power of Attorney to register a Mortgage Bond, and other loan documents, all of which were verified by a handwriting expert.\n\nThe only credible evidence on record was that adduced by the appellant himself, amply corroborated by the Questioned Document Examiner, the Acknowledgement of Debt, the Power of Attorney to Pass Mortgage Bond, the Mortgage Bond, and the Forensic Examination Report, Chikowero said.\n\nThe court said Mumbiros story fell apart under cross-examination when he admitted signing blank papers, a move the judges described as a deliberate attempt to distort facts and mislead the court.\n\nCiting the long-standing legal principle of caveat subscriptor, the bench reminded litigants that a party to a contract is bound by his signature, whether or not he has read or understood the document.\n\nChikowero criticised the lower court for allowing Mumbiro to eat his cake and still have it by accepting contradictory statements about how much he borrowed.\n\nAs a result, the High Court ordered Mumbiro to repay US$22,750 plus interest and costs, and ruled that his Budiriro home, Stand 2308 of Willowvale Estate, be declared specially executable should he fail to pay.\n\nIn their judgment, the judges issued a clear warning to others attempting similar deceit.\n\nThe loud and clear message to go out from the court is: businessmen beware. If you fail to honour your contracts, dont start crying when the other party obtains an order compelling you to perform.\n\nMumbiro had earlier accused Muchada of being a fraudster who wants to con me of my house, but the judges found no proof of that claim.\n\nThe case originated at the Harare Magistrates Court, where Mumbiro initially won after convincing the magistrate that he was illiterate and had been duped. However, the High Court overturned that decision, ruling that Mumbiro had instead abused the courts sympathy and his position as a retired pastor to avoid his legal obligations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A retired pastor who tried to evade repaying a US$22,750 loan by falsely claiming illiteracy has lost his case at the High Court, which ordered him to settle the debt and declared his Budiriro house executable. Judges of appeal Justices Hapias Zhou and Benjamin Chikowero ruled that Pastor Stefan Pios Mumbiro knowingly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-loses-budiriro-home-after-faking-illiteracy-to-evade-repaying-debt/\">Pastor loses Budiriro home after faking illiteracy to evade repaying debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "08 Oct 2025"
        },
        {
            "title": "Supreme Court resurrects US$8 million chrome feud in Guruve Dyke",
            "url": "https://www.newzimbabwe.com/supreme-court-resurrects-us8-million-chrome-feud-in-guruve-dyke/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has granted chrome miner Monochrome (Pvt) Ltd permission to revive its appeal in a long-running multimillion-dollar mining battle, ruling that the company has bright prospects of success in its US$8.1 million damages claim against rivals Kehrai Investments and Labenmon Investments.\n\nThe judgment, delivered by Justice Chinembiri Bhunu condoned Monochromes procedural delays and extended time for the company to file its appeal against a High Court ruling that dismissed its US$8,173,188 claim.\n\nThe courts are generally loath to punish litigants for the sins of their lawyers unless such conduct is gross and unpardonable. The ends of justice demand that whenever possible, justice be dispensed on the merits rather than on technicalities, Bhunu said.\n\nIn 2018, when Monochrome accused Kehrai and Labenmon of illegally mining alluvial chrome on six of its claims in the Guruve North Dyke Msasa 122 to 127 and sued for damages, representing lost profits.\n\nMonochrome argued that surveys by the Ministry of Mines confirmed encroachment, supported by a geological expert who presented diagrams, pictures, and stockpile estimates of the extracted chrome.\n\nThe defendants denied wrongdoing. Kehrai failed to appear, resulting in a default judgment against it, while Labenmon insisted it mined lawfully under a contract with Kehrai, challenging Monochromes ownership and the scale of damages claimed.\n\nIn 2023, the High Court sided with Labenmon, ruling Monochrome had not proved ownership, the extent of extraction, or the US$8 million loss.\n\nBut Bhunu found that the appeal raises weighty issues, especially after Kehrai capitulated by failing to defend ownership of the disputed claims.\n\nThe applicant has sound and reasonable prospects of success on appeal given that the first respondents ownership of the mining claims has been severely dented by the extant default judgment against it, Bhunu ruled.\n\nThe second respondent is merely riding on the back of the first respondent as the source of its mining rights. That being the case, it is likely to fall with the capitulation of its principal.\n\nThe Supreme Court ordered Monochrome to file its appeal within 10 days, paving the way for a full hearing on the merits of the chrome feud.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has granted chrome miner Monochrome (Pvt) Ltd permission to revive its appeal in a long-running multimillion-dollar mining battle, ruling that the company has “bright prospects of success” in its US$8.1 million damages claim against rivals Kehrai Investments and Labenmon Investments. The judgment, delivered by Justice Chinembiri Bhunu condoned Monochrome’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-resurrects-us8-million-chrome-feud-in-guruve-dyke/\">Supreme Court resurrects US$8 million chrome feud in Guruve Dyke</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "08 Oct 2025"
        },
        {
            "title": "Chamisa urges ZEC to learn from Malawi’s electoral example",
            "url": "https://www.newzimbabwe.com/chamisa-urges-zec-to-learn-from-malawis-electoral-example/",
            "content": "By Staff Reporter\n\nFormer Citizens Coalition for Change (CCC) leader Nelson Chamisa has called on the Zimbabwe Electoral Commission (ZEC) to emulate the Malawi Electoral Commission (MEC) in conducting transparentand credible elections.\n\nLast month, Malawians elected former President Peter Mutharika, who was declared the winner after securing 57% of the vote againstLazarus Chakweras 33%. Chakwera, a former pastor, conceded defeat before the final results were announced, calling Mutharika to congratulate him on his historic win.\n\nChamisa contrasted this with Zimbabwes deeply contested electoral history, saying the country has failed to conduct free and fair elections since the turn of the millennium.\n\nIn the 2023 general elections, the Southern African Development Community (SADC) observer mission noted, for the first time since 2008, that Zimbabwes polls did not meet the basic standards of credibility. The elections were marred by logistical chaos, with ZEC failing to deliver voting materials on time in major cities, forcing some polling stations to operate in darkness or reopen the next day\n\nUrban voters, traditionally opposition strongholds, were disproportionately affected by the delays, a situation critics say benefited the ruling Zanu PF, which continues to dominate rural areas.\n\nTaking to X, Chamisa said Zimbabwe should draw lessons from Malawis example of peaceful and credible elections.\n\nZimbabwes Electoral Commission (ZEC) should take notes from Malawis example where results reflect the true will of the people and peaceful transitions are possible, Chamisa said.\n\nHe also condemned the recurring cycle of violence and intimidation surrounding Zimbabwean elections.\n\nSince independence, Zimbabwe has faced violent and contested elections punctuated by a systematic obstruction of democratic change, trapping the nation in a vicious cycle of instability and inexorable conflict. Its time for Zimbabwe to commit to CITIZENOCRACY  an accountable, citizens-centred and citizens-driven system of government, he added.\n\nChamisa recalled the 2008 elections, during which more than 300 opposition supporters were reportedly killed in politically motivated violence, mostly targeting supporters of the late Morgan Tsvangirais Movement for Democratic Change (MDC).\n\nThe opposition leader, who also challenged President Emmerson Mnangagwas victories in 2018 and 2023, has repeatedly accused ZEC of bias and continues to reject Mnangagwas legitimacy.\n\nDespite the controversies, Chamisas then-18-month-old CCC party managed to deny Zanu PF a two-thirds majority in Parliament in the 2023 elections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Former Citizens Coalition for Change (CCC) leader Nelson Chamisa has called on the Zimbabwe Electoral Commission (ZEC) to emulate the Malawi Electoral Commission (MEC) in conducting transparent and credible elections. Last month, Malawians elected former President Peter Mutharika, who was declared the winner after securing 57% of the vote against Lazarus Chakwera’s 33%. Chakwera,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chamisa-urges-zec-to-learn-from-malawis-electoral-example/\">Chamisa urges ZEC to learn from Malawi’s electoral example</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "08 Oct 2025"
        }
    ]
}