{
    "news": [
        {
            "title": "Two CUT students abducted during SRC election campaigns – union",
            "url": "https://www.newzimbabwe.com/two-cut-students-abducted-during-src-election-campaigns-union/",
            "content": "By Staff Reporter\n\nTwo students from Chinhoyi University of Technology (CUT) were allegedly kidnapped on Monday night during campaigns for the Student Representative Council (SRC) elections, the Zimbabwe National Students Union (ZINASU) has claimed.\n\nAccording to ZINASU, its members, Lindon Zanga and Marlvin Saint Madanda, were violently abducted at Mzimba Shopping Centre in Chinhoyi.\n\nThe union said the pair was taken by unidentified individuals driving an unmarked grey Isuzuthat had previously been seen on campus distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nIn a statement, ZINASU alleged that the abductions were part of a wider attempt to intimidate students and silence dissenting voices on campus.\n\nThe two student leaders were snatched in front of dozens of witnesses in a brazen act of banditry that has not only instilled fear but also exposed the modus operandi of a rogue regime seemingly afraid of open contestation of ideas.\n\nThis is a panic reaction from ZICOSU, which is directly sponsored by the ruling ZANU PF regime, and a clear attempt to silence the students voice.\n\nStudents have ceased to be seen as beacons of academic excellence. In the eyes of a jittery regime, they are viewed as terrorists who defy oppression, ZINASU said.\n\nThe student union also accused ZANU PF Youth League Political Commissar Taurai Kandishaya of being involved in the conflict.\n\nThe notorious presence of Youth League Political Commissar Taurai Kandishaya, who has a sordid history of doing everything necessary and unnecessary to please his bosses, should not be overlooked.\n\nHe is known for threatening and exposing innocent citizens who dare to think differently from the ZANU PF script. His hand is visible in this case.\n\nAn SRC election should be a democratic process giving young people a glimpse into leadership, yet rogue elements in power continue to use state resources to suppress dissent and manipulate outcomes, ZINASU added.\n\nZINASU said it is demanding the immediate release of Zanga and Saint and vowed to take legal action over the matter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11111935/CUT-ZINASU.jpeg",
            "description": "<p>By Staff Reporter Two students from Chinhoyi University of Technology (CUT) were allegedly kidnapped on Monday night during campaigns for the Student Representative Council (SRC) elections, the Zimbabwe National Students Union (ZINASU) has claimed. According to ZINASU, its members, Lindon Zanga and Marlvin Saint Madanda, were violently abducted at Mzimba Shopping Centre in Chinhoyi. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-cut-students-abducted-during-src-election-campaigns-union/\">Two CUT students abducted during SRC election campaigns – union</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "11 Nov 2025"
        },
        {
            "title": "Upcoming Premier League Changes Promise to Shake Up the Future of Football",
            "url": "https://www.newzimbabwe.com/upcoming-premier-league-changes-promise-to-shake-up-the-future-of-football/",
            "content": "The Premier League is the richest and most competitive football league in the world. But the local administration has decided to undergo its biggest transformation in decades. They consider implementing a form of salary cap, known as anchoring. It wont allow clubs to pay new players more than several times the revenue of the lowest-earning club in the league. This financial transformation can potentially reshape the Premier League and the world of football overall. But this is not the only change to be expected in modern football. The busy schedule also required an immediate solution. Read on to learn more about upcoming changes.\n\nAnchoring the Premier League\n\nThe new salary cap will link how much a club can spend on wages to the earnings of the leagues lowest-earning club. The idea is to create financial parity, preventing a few elite clubs from outspending everyone else by huge margins. This transformation promises to have a huge impact on the national league, so every reliableinternet betting serviceis currently assessing potential changes to the betting markets and odds.\n\nThe Premier League has always been a huge financial power in professional sports. Manchester City, Liverpool, and Chelsea are the top clubs, attracting the best players with massive contracts. Yet critics argue that this growing wealth gap has ruined competition, making it hardly possible for smaller clubs to reach the top. Should the anchoring proposal pass or not? It will definitely tie top clubs hands when negotiating salaries. The so-called Big Six clubs have expressed concerns that the new system would limit their ability to attract elite players, potentially damaging the reputation of the national league in the world.\n\nThe financial reform is the main topic for discussion in the Premier League. Meanwhile, other countries are discussing player overload, which is slowly becoming a serious issue. The football calendar has been expanded, with domestic, continental, and international competitions. The Club World Cup now requires teams to play up to seven matches to reach the final. Meanwhile, the Champions League format has expanded to include additional matches on the group stage. The World Cup continues welcoming new teams, increasing the total number of matchups.\n\nThe busy schedule means exciting matches for fans. But it also means more injuries among players. Not everyone can handle the pressure. Cole Palmer from Chelsea played 55 games last season. At the beginning of the new season, the 23-year-old player has already reported a groin injury that would keep him on the bench for weeks. Ousmane Dembl is also struggling with a few muscle injuries this season.\n\nAt the European Football Clubs (EFC) General Assembly, club representatives discussed possible solutions to the existing problem. They considered increasing the substitute allowance from five to six. They also discussed the idea of expanding the team registration limit from 25 to 28 players. The team will be able to rotate players more frequently, which will reduce fatigue and the risk of injury. Not everyone agrees that this could be the right solution to the problem. The Professional Footballers Association (PFA) in the UK has expressed skepticism, arguing that larger teams might not actually reduce mental fatigue. All players must attend training, travel to play matches, and remain mentally engaged throughout the season. If someone ends up without playtime, they still have to be physically and mentally prepared.\n\nOnce thing is clear: if the situation doesnt change, some players may take radical action. In Manchester United, they have already expressed its dissatisfaction with the current situation. They have even explained their failure to qualify for the main European championships with the massive fatigue among players. Will they go on strike? Or will they find other ways of solving the problem? We will know soon!\n\nThe new salary cap and the attempt to survive a busy schedule are two critical issues. The Premier League must decide whether to stay with the current system or move toward fairness and transparency. The anchoring system, if approved, would redefine financial norms in the worlds most expensive league. Increasing substitute allowance and registration limit could also be the first step toward a more reasonable football calendar. After all, player health is more important than commercial gains.\n\nYet, both measures involve a certain risk. Restricted expenses can make football less attractive to global players. Minor adjustments to squad rules may not be enough to protect players from burnout. So far, one thing is clear: change is coming. The decisions made in the coming months will shape the future of football for decades. The Premier League, once the gold standard of wealth and competition, could soon be the testing ground for a new era in world football.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11083743/stadium.jpg",
            "description": "<p>The Premier League is the richest and most competitive football league in the world. But the local administration has decided to undergo its biggest transformation in decades. They consider implementing a form of salary cap, known as “anchoring”. It won’t allow clubs to pay new players more than several times the revenue of the lowest-earning</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/upcoming-premier-league-changes-promise-to-shake-up-the-future-of-football/\">Upcoming Premier League Changes Promise to Shake Up the Future of Football</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "11 Nov 2025"
        },
        {
            "title": "Trio busted with trophies of specially protected vultures",
            "url": "https://www.newzimbabwe.com/trio-busted-with-trophies-of-specially-protected-vultures/",
            "content": "By Staff Reporter\n\nTHREE men found in possession of trophies of endangered vulture species have appeared in court following their recent arrest.\n\nThe trio of Emmanuel Genius Mombe (36) of Domboshava, Benjamin Sarewa (26) of Epworth and Shadreck Gukutu (31) of Waterfalls were arraigned before the Harare Magistrates Court on charges of unlawful possession of specially protected wildlife trophies.\n\nAccused persons were remanded in custody to November 21, 2025.\n\nThe State case is that on November 5, police received information that the suspects were seeking buyers for vulture heads.\n\nActing on the tip-off, detectives set up a meeting purporting to be prospective buyers of the trophies.\n\nThey agreed to meet at the Kopje bus terminus in Harare, where the transaction was supposed to take place. While at the scene, Gukutu produced a black plastic bag from a small cross-bag containing four dried heads of vultures. The officers immediately identified themselves and arrested the suspect.\n\nSubsequent investigations led to the arrest of the other two suspects, who were waiting nearby for the transaction to be concluded.\n\nIn a statement following the trios court appearance, the National Prosecuting Authority of Zimbabwe (NPAZ) reiterated that the illegal trade in wildlife trophies poses a serious threat to biodiversity.\n\nThe public is urged to report anyone trading or in possession of wildlife trophies without a permit, the NPAZ said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter THREE men found in possession of trophies of endangered vulture species have appeared in court following their recent arrest. The trio of Emmanuel Genius Mombe (36) of Domboshava, Benjamin Sarewa (26) of Epworth and Shadreck Gukutu (31) of Waterfalls were arraigned before the Harare Magistrates Court on charges of unlawful possession of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trio-busted-with-trophies-of-specially-protected-vultures/\">Trio busted with trophies of specially protected vultures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "11 Nov 2025"
        },
        {
            "title": "Pursue a proper career! – Hwende slammed over US$150,000 MPs loan demand",
            "url": "https://www.newzimbabwe.com/pursue-a-proper-career-hwende-slammed-over-us150000-mps-loan-demand/",
            "content": "By Staff Reporter\n\nOpposition legislator Chalton Hwende has come under fire for demanding US$150,000 loans for Members of Parliament (MPs) as part of their welfare packages.\n\nHwende made the proposal during the pre-budget seminar held in Bulawayo, arguing that legislators deserve improved conditions of service.\n\nThe Kuwadzana East MPs remarks have, however, drawn widespread criticism, particularly given the ongoing plight of civil servants who continue to decry poor salaries and working conditions in the public sector.\n\nFormer legislator Fadzayi Mahere chided Hwende for demanding the loan facility for MPs.\n\nIn my humble view, being an MP should not be viewed as a career but as a vocation and opportunity to serve. Its not the place to seek financial reward or make a living if thats what youre after.\n\nIf you want a well-paid job or to make sensible money, then pursue a proper career wholeheartedly. What youll find is that if you have a solid career, youll make what you earn monthly from being in Parliament in less than an hour, said Mahere.\n\nThis is not the first time that the MPs have raised eyebrows over loan facilities.\n\nIn 2023, MPs received US$40,000 loans from the government as part of their benefits, a move that was widely condemned by civic groups.\n\nCritics have also questioned the timing of Hwendes remarks, coming as Zanu PF pushes for constitutional amendments to extend President Emmerson Mnangagwas tenure, a process that will require parliamentary approval.\n\nIn response to the backlash, Hwende defended his comments, insisting that he was merely pointing out an existing precedent.\n\nThe uncomfortable truth is that everyone who has been an MP since 2000 for the opposition and ruling party has received cars, stands, loans, medical aid, salaries, bonuses and some even got cars from (former RBZ governor) Gono outside parliament, but they are your favourites you will pretend like you dont know, said Hwende.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26033121/Chalton-Hwende.jpeg",
            "description": "<p>By Staff Reporter Opposition legislator Chalton Hwende has come under fire for demanding US$150,000 loans for Members of Parliament (MPs) as part of their welfare packages. Hwende made the proposal during the pre-budget seminar held in Bulawayo, arguing that legislators deserve improved conditions of service. The Kuwadzana East MP’s remarks have, however, drawn widespread criticism,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pursue-a-proper-career-hwende-slammed-over-us150000-mps-loan-demand/\">Pursue a proper career! – Hwende slammed over US$150,000 MPs loan demand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "11 Nov 2025"
        }
    ]
}