{
    "news": [
        {
            "title": "Mnangagwa reiterates his Law School training claim in Zambia alongside late president Lungu",
            "url": "https://www.newzimbabwe.com/mnangagwa-reiterates-his-law-school-training-claim-in-zambia-alongside-late-president-lungu/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has claimed a shared history with the late former Zambian President Edgar Lungu, asserting they were contemporaries at law school.\n\nSpeaking at the Zambian Embassy on Thursday, where he signed the Book of Condolences following Lungus passing, Mnangagwa insisted on a connection stretching back to his student days.\n\nWe were students together at law school. There is a lot of history between me and him and several other Zambians, I did my education in Zambia, of course he was junior, Mnangagwa stated.\n\nHowever, this assertion has been met with scepticism, with critics quick to point to what they perceive as a series of legal missteps made by the President since assuming office in November 2017.\n\nThese alleged blunders have fuelled doubts about the extent of Mnangagwas legal knowledge and background.\n\nExamples cited include early constitutional gaffes, such as ministerial appointments made outside the bounds of Parliament. The public was obliged to remind him of his overreach, forcing him to rescind his decisions.\n\nFurther scrutiny arose when, during the World Economic Forum (WEF) in Davos, Switzerland, in 2018, Mnangagwa appeared to announce the 2018 elections for May, a date predating the constitutional earliest possible polling day of July 23, 2018.\n\nAdding fuel to the fire, shortly after taking office, Mnangagwa issued an ultimatum to those accused of externalising US dollars and assets, demanding they return the loot or face prosecution. This was despite the absence of any Zimbabwean law criminalising such activity at the time, a move widely interpreted as a significant oversight.\n\nThese early missteps have left many questioning the Presidents legal prowess.\n\nDespite the Presidents assertion, critics remain unconvinced. They point to a lack of tangible evidence, noting the absence of photographs or verifiable accounts from alleged classmates to support the claim of a shared legal education.\n\nThe claim, they argue, rests solely on Mnangagwas oral tradition.\n\nDespite the controversy, Mnangagwa further described Lungu as a leader of foresight in terms of development and said his passing represented a significant loss not only for Zambia but for the region as a whole.\n\nWe have lost one of our illustrious leaders he was committed not only to Zambia but to the rest of the region he was one of us he was a man who had foresight in terms of development and collaboration between several countries, he said.\n\nLungu lost the Zambian elections to Hakainde Hichilema in August 2021.\n\nHe has since reportedly enjoyed a close relationship with Zanu PF, with some suggesting Mnangagwas party was funding a potential comeback bid in Zambias 2026 elections, a claim both parties vehemently denied.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/24161755/Lungu_Mnangagwa.jpg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has claimed a shared history with the late former Zambian President Edgar Lungu, asserting they were contemporaries at law school. Speaking at the Zambian Embassy on Thursday, where he signed the Book of Condolences following Lungu’s passing, Mnangagwa insisted on a connection stretching back to his student days. “We</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-reiterates-his-law-school-training-claim-in-zambia-alongside-late-president-lungu/\">Mnangagwa reiterates his Law School training claim in Zambia alongside late president Lungu </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "14 Jun 2025"
        },
        {
            "title": "Dynamos withdraws from 2025/26 CAF Confederation Cup",
            "url": "https://www.newzimbabwe.com/dynamos-withdraws-from-2025-26-caf-confederation-cup/",
            "content": "By Sports Reporter\n\nZIMBABWE Premier Soccer League giants Dynamos have withdrawn from participating at this years CAF Confederations Cup, which is scheduled to start in August.\n\nDembare was going to represent Zimbabwe at the tournament on the merit of winning the 2024 Chibuku Super Cup.\n\nWe regret to inform our stakeholders that Dynamos FC will not beparticipating in the 2025/26 CAF Confederation Cup.\n\nAfter thorough evaluation, it has been determined that the club is not yet fullyprepared to compete at the continental level this year, notified Dynamos.\n\nDembare is currently going through financial woes, which led to a mass exodus of players at the beginning of the season.\n\nIn April, Dynamos players boycotted training in protest to outstanding sign on fees and salaries.\n\nDembare management cited some of the reasons for backtracking.\n\nWhile it has been a painstaking decision, we believe it is in the best interest of the team and everyone associated with Dynamos.We want to focus on strengthening the teams readiness for future competitions and ensure we would not participate in such tournaments just to makeup numbers.Dembare was set to go back to the CAF Confederations Cup for the second time in a row after a disastrous stint last year.During the 2024 CAF Confederations campaign, Dembare had poor players welfare as they booked them to stay in a semi standard lodge in Botswana where they were based.\n\nWhile it has been a painstaking decision, we believe it is in the best interest of the team and everyone associated with Dynamos.\n\nWe want to focus on strengthening the teams readiness for future competitions and ensure we would not participate in such tournaments just to makeup numbers.\n\nDembare was set to go back to the CAF Confederations Cup for the second time in a row after a disastrous stint last year.\n\nDuring the 2024 CAF Confederations campaign, Dembare had poor players welfare as they booked them to stay in a semi standard lodge in Botswana where they were based.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/29201533/Dynamos-players-celebrate-a-goal-during-their-4-0-win-over-Yadah-at-the-National-Sports-Stadium-on-Saturday.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE Premier Soccer League giants Dynamos have withdrawn from participating at this year’s CAF Confederations Cup, which is scheduled to start in August. Dembare was going to represent Zimbabwe at the tournament on the merit of winning the 2024 Chibuku Super Cup. “We regret to inform our stakeholders that Dynamos FC will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-withdraws-from-2025-26-caf-confederation-cup/\">Dynamos withdraws from 2025/26 CAF Confederation Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "14 Jun 2025"
        },
        {
            "title": "Parliament of Zimbabwe, Silveira House forge milestone Memorandum of Understanding",
            "url": "https://www.newzimbabwe.com/parliament-of-zimbabwe-silveira-house-forge-milestone-memorandum-of-understanding/",
            "content": "By Alois Vinga\n\nTHE Parliament of Zimbabwe has forged a partnership with Silveira House (SH) in a development, which is set to bolster the quality of input made by legislators into socio-economic issues.\n\nFounded by the renowned Roman Catholic Priest Father John Dove in 1964 and subsequently named after Father Gonalo da Silveira, the first Jesuit priest to come to Zimbabwe in the 16th century, the institution has exerted considerable influence on the countrys affairs both in the pre- and post-independence era.\n\nWidely respected for its apolitical and faith based approach, SH programmes over the years have sustained a focus on civic education for political participation, skills training, agriculture and community building.\n\nSpeaking shortly after signing the MoU, Silveira House board of directors representative, Father George Bwanali said the MoU will go a long way to strengthen ties between the two institutions.\n\nSilveira House has, for over six decades, stood at the intersection of faith, justice, and social transformation. This partnership with the Parliament of Zimbabwe is a natural and necessary evolution of our mission. It recognizes that governance is not the responsibility of government aloneit is a collective effort that must be enriched by the voices of civil society, communities, and the church, he said.\n\nThe clergyman underscored that the new chapter in the collective journey will not only reinforce democratic processes but also foster trust between the people and their elected representativesa trust he described as essential for peace, development, and national cohesion.\n\nHonourable Speaker, allow me to express our profound gratitude to your office, and to all those who have worked tirelessly to bring this MoU to life. As we sign this MoU, let it be a pledge to pursue the common good; and a covenant to work hand in hand for the betterment of every Zimbabwean, especially the most vulnerable, added Bwanali.\n\nThe partnership is set to enhance the legislators understanding of Bills presented to Parliament to ensure informed and meaningful contributions to law-making while improving the quality of parliamentary debates by promoting issue-based, constructive, and well-informed dialogue.\n\nIt will also facilitate engagement between legislators and marginalised communities, ensuring that policy and legislative processes reflect the voices and needs of all citizens.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/24030405/New-Parliament-.jpeg",
            "description": "<p>By Alois Vinga THE Parliament of Zimbabwe has forged a partnership with Silveira House (SH) in a development, which is set to bolster the quality of input made by legislators into socio-economic issues. Founded by the renowned Roman Catholic Priest Father John Dove in 1964 and subsequently named after Father Gonçalo da Silveira, the first</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-of-zimbabwe-silveira-house-forge-milestone-memorandum-of-understanding/\">Parliament of Zimbabwe, Silveira House forge milestone Memorandum of Understanding </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "14 Jun 2025"
        },
        {
            "title": "Geo Pomona’s tax holiday: Questions mount over dodgy Harare waste management deal",
            "url": "https://www.newzimbabwe.com/geo-pomonas-tax-holiday-questions-mount-over-dodgy-harare-waste-management-deal/",
            "content": "By Staff Reporter\n\nIF the controversy surrounding the Geo Pomona waste management contract was not already festering, it has now been rubbed raw by revelations that the company is enjoying a tax holiday, meaning it will not be remitting a single cent to Treasury.\n\nThis is despite the millions of United States dollars Geo Pomona is due to get from the City of Harare (CoH) under the contentious agreement.\n\nAccording to the contract, which NewZimbabwe.Com has seen, Geo Pomona stands to rake in over US$30 million annually from the CoH, yet will contribute nothing in tax revenue.\n\nThe schedule of payments and tax and duties section of the contract explicitly states that Geo Pomona has been granted duty-free and tax-free status for the entire duration of the agreement.\n\nTreasury has so far remained tight-lipped on the justification for this extraordinary concession.\n\nContracting party shall ensure that the contractor is granted duty exemption and income tax exemption for the period of the contract, the document states.\n\nThe contracting party shall pay US$2,701,404.00 (Two million Seven Hundred and one thousand four hundred and four United States Dollars only) excluding value-added tax every month with effect from signature of the contract. The amount is based on the refuse collection and street cleaning service rendered by the contractor, it continues.\n\nFurther adding to the sense of unease is the apparent erosion of the CoHs control over waste management, a function ostensibly outsourced but not supervised.\n\nFormer Mt Pleasant MP Fadzayi Mahere has also weighed in, questioning the logic behind the tax exemption.\n\nWhy does the agreement stipulate that Geo Pomona will pay 0% tax yet it is being paid so handsomely through public funds? What is the legal basis of this irrational tax exemption?, she wrote on X (formerly Twitter) on Friday.\n\nWhile Geo Pomona is ostensibly led by Chairman and Chief Executive Officer Delish Nguwaya, persistent reports suggest he is merely a figurehead. Whispers persist that the real power brokers are members of the First Family, specifically Sean Mnangagwa, son of President Emmerson Mnangagwa.\n\nThe Geo Pomona deal appears to have usurped the CoHs legal responsibility for refuse collection and street cleaning in the capital.\n\nHarare Mayor Jacob Mafume was unavailable for comment, citing his absence from the country. CoH spokesman Stanley Gama also directed inquiries to Mafume.\n\nIntriguingly, President Mnangagwa recently showered praise on Mafume, describing him as a cooperative and helpful mayor. This endorsement is somewhat unusual, given that Mafume is a member of the opposition. Critics suggest the praise is part of the complex political landscape surrounding the Geo Pomona deal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210357/mnangagwa-geo-pomona.jpeg",
            "description": "<p>By Staff Reporter IF the controversy surrounding the Geo Pomona waste management contract was not already festering, it has now been rubbed raw by revelations that the company is enjoying a tax holiday, meaning it will not be remitting a single cent to Treasury. This is despite the millions of United States dollars Geo Pomona</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geo-pomonas-tax-holiday-questions-mount-over-dodgy-harare-waste-management-deal/\">Geo Pomona’s tax holiday: Questions mount over dodgy Harare waste management deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "14 Jun 2025"
        },
        {
            "title": "Mnangagwa renames Tomlinson Depot to Chimoio Camp",
            "url": "https://www.newzimbabwe.com/mnangagwa-renames-tomlinson-depot-to-chimoio-camp/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has officially renamed the Tomlinson Depot to Chimoio Camp Depot as a way of dismantling colonial legacies.\n\nThe renaming ceremony also included the commissioning of four blocks residential flats, now called the Chimoio Police Camp Flats.\n\nSpeaking at the ceremony Friday, Mngangagwa said name changing is an important tool for preserving a countrys heritage.\n\nIt is with great honour and a sense of pride that I join you at this momentous occasion, to officiate at this ceremony marking the unveiling of the new name of Tomlinson Depot. This cantonment area will now be called, Chimoio Camp Depot.\n\nToday, we also witness the commissioning of residential flats, hereafter called the Chimoio Police Camp Flats, Mnangagwa said.\n\nThe 82-year-old Zanu PF leader also acknowledged shortage of decent accommodation for the uniformed forces, challenging relevant authorities to scale up efforts in addressing the housing needs.\n\nI am aware that with the current strength of men and women, the magnitude of resources required to provide institutional accommodation for our Police Service throughout the country, cannot be underestimated.\n\nAs such, my administration will continue to explore innovative ideas and strategies to provide decent institutional accommodation for officers.\n\nThis should ensure that the deployment or transfer of officers and their families to other stations is seamless, with minimum disruptions.\n\nI challenge the Zimbabwe Republic Police, ministries of Home Affairs and Cultural Heritage, Local Government and Public Works as well as National Housing and Social Amenities, among other stakeholders in the built environment, to scale up collaboration and innovation towards addressing the housing needs for the civil service in general, he added.\n\nThe bulk of police officers live in dilapidated and overcrowded housing across the country.\n\nThe police service also lacks sufficient resources to effectively execute their duties nationwide, particularly in rural areas where officers often have to walk long distances on foot to make arrests or escort suspects to court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/14041649/IMG-20250613-WA0015.jpg",
            "description": "<p>By Thandiwe Garusa  PRESIDENT Emmerson Mnangagwa has officially renamed the Tomlinson Depot to Chimoio Camp Depot as a way of “dismantling colonial legacies.” The renaming ceremony also included the commissioning of four blocks residential flats, now called the Chimoio Police Camp Flats. Speaking at the ceremony Friday, Mngangagwa said name changing is an important tool</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-renames-tomlinson-depot-to-chimoio-camp/\">Mnangagwa renames Tomlinson Depot to Chimoio Camp  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "14 Jun 2025"
        },
        {
            "title": "‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP",
            "url": "https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/",
            "content": "FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomonas recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid.\n\nGeo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under the then Ministry of Local Government, led by Winston Chitando (now Mines and Mining Minister).\n\nThe company was registered by Mirel Mrtiri, an Albanian businessman linked to corruption in his home country. Its Executive Chairman and CEO, Delish Nguwaya, is a regular attendee at state functions and is known to be a close associate of President Emmerson Mnangagwas son, Sean Mnangagwa.\n\nNguwaya was previously charged with corruption over Covid-19 procurement contracts involving his company, Drax International, in 2020, but was acquitted by court in September 2023.\n\nThey have no legal mandate to independently take over public waste management under our law, Mahere posted on her X account on Wednesday.\n\nMahere, a constitutional lawyer, argued that Geo Pomona should not impose itself on residents, as their obligations lie with the CoH, not individual households.\n\nFormer Mt Pleasant MP Fadzayi Mahere\n\nThey are not a statutory body. At best, if they have a contract with City of Harare, they are the citys agent. This means that the City of Harare is the principal and public facing party with Geo Pomona working under them as an agent. They cannot do their business independently of the city and force themselves onto people with whom they have no legal relationship.\n\nMahere questioned Geo Pomonas authority to bill residents directly, stating that the company lacks the legal basis to do so.\n\nFor the avoidance of doubt, they have no right to bill or otherwise engage residents directly absent a valid agreement with individual residents to do so. Only the City of Harare can do that in line with its powers as a local authority under Zimbabwes local government laws, she said.\n\nGeo Pomona is set to receive over US$162 million from the CoH over five years, with ratepayers ultimately footing the bill.\n\nThe 30-year agreement stipulated that Harare must deliver 550 tonnes of waste, or a minimum of 200,750 tonnes per year, resulting in US$8.03 million for the company in the first year.\n\nThis has opened doors for Geo Pomona to potentially take control of the entire waste management process, from street sweeping and refuse collection to waste disposal thereby billing residents directly.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/09034942/solid-waste.jpg",
            "description": "<p>By Staff Reporter FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomona’s recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid. Geo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/\">‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:43",
            "date": "14 Jun 2025"
        }
    ]
}