{
    "news": [
        {
            "title": "Legendary Italian designer Giorgio Armani dies",
            "url": "https://www.newzimbabwe.com/legendary-italian-designer-giorgio-armani-dies/",
            "content": "BBC\n\nThe Italian fashion designer and billionaire brand owner Giorgio Armani has died at the age of 91.\n\nHe was the archetype of Italian style and elegance, reimagining mens and womens suits for a modern audience.\n\nHis company Armani expanded from fashion into an empire spanning beauty, fragrance, music, sport and even luxury hotels, bringing in more than 2bn a year.\n\nDonatella Versace paid tribute to the late designer on her Instagram page,posting a picture of him, saying: The world lost a giant today, he made history and will be remembered forever.\n\nIn a statement onthe brands Instagram page, it said Armani  worked until his final days, dedicating himself to the company, the collections and the many ongoing future projects.\n\nIt also said he was indefatigable to the end and driven by relentless curiosity and a deep attention to the present and to people.\n\nThe designer was seen as a pioneer in many ways, elevating red carpet fashion to what we see today.\n\nHe was also the first designer to ban underweight models from the runway, after the death of model Ana Carolina Reston in 2006 from anorexia nervosa.\n\nGetty Images Giorgio Armani was seen as a pioneer of suit tailoring for men and women\n\nRussell Crowe described Armani as a man who made a mark acknowledged around the globe.\n\nThe actor said he adored Armani and was meant to be seeing him this month, adding that the designer was there for so many significant moments in my life.\n\nJulia Roberts shared a picture of herself in an Armani dress alongside the designer on Instagram with the words A true friend. A legend and a heartbreak emoji.\n\nBritish designer Paul Smith also spoke about his dear friend and fellow designer.\n\nHis continuity, his down-to-earth nature and his staying power in remaining as an unlisted, independent company have always been a huge inspiration for me personally,Smith wrote on social media.\n\nHe has been an enormous source of strength and creativity for many years.\n\nItalian Prime Minister Giorgia Meloni also paid tribute, saying: With his elegance, sobriety, and creativity, he was able to bring lustre to Italian fashion and inspire the entire world.\n\nAn icon, a tireless worker, a symbol of the best of Italy. Thank you for everything.\n\nIn a profile in The Financial Times, in one of the designers last interviews, Alexander Fury wrote: He put women into a uniform of suits just as radical as Chanels, creating forceful, confident clothing that helped to power the working womans social revolution of the 1980s.\n\nBy contrast, he relaxed menswear, deconstructing traditional tailoring in a manner that has affected how just about every suit in the world is made.\n\nA friend of Hollywood, he understood the power of publicity and dressed some of its biggest stars for the red carpet including for the Oscars  including Zendaya, Cate Blanchett and Julia Roberts.\n\nHe also designed stage outfits for Lady Gaga and various costumes for films American Gigolo and The Wolf of Wall Street.\n\nEven as he entered his 10th decade, Armani continued to present new collections on the French and Italian catwalks.\n\nHis March 2025 show was designed to make a statement on global politics, with him stating that he wanted to imagine new harmony as he believed that is what we all need.\n\nConcern over his health was first expressed in June this year, when he missed Milan fashion week.\n\nHe directed a couture show in Paris in July 2025, but did this remotely from his home in Milan.\n\nArmani was described as a true gentleman and titan of the industry by Vogues Laura Ingham, who paid tribute to the late designer.\n\nShe added: If you dont know anything about fashion, youll still know Giorgio Armani. Mr. Armani built a house synonymous with timeless Italian elegance and enduring style.\n\nReferencing his classic style, which included refined silhouettes and immaculate tailoring, she concluded that his legacy is woven not only into fashions past and present but will continue to shape its future for generations to come.\n\nStarting his career in medicine, he moved to fashion in the 1960s and set up his own luxury label in 1975 alongside his late partner Sergio Galeotti.\n\nHe faced much criticism during his career, including in 2015 when he said a gay man does not need to dress homosexual.\n\nHis company also reached a financial settlement with Italian tax authorities over offshore subsidiaries in 2014, though no wrongdoing was admitted.\n\nAway from fashion, he was a keen sports fan and supported Serie A football team Inter Milan and owned the Olimpia Milano basketball team.\n\nThe fashion brand also had a partnership with the Scuderia Ferrari F1 team, with one of their drivers, Charles Leclercwriting on Instagramthat it was a great honour to have had the chance to meet and work with such an amazing person.\n\nArmani was also presented with the French Legion of Honour and Italian Order of Merit for Labour for his work in fashion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/04182620/armani.webp",
            "description": "<p>BBC The Italian fashion designer and billionaire brand owner Giorgio Armani has died at the age of 91. He was the archetype of Italian style and elegance, reimagining men’s and women’s suits for a modern audience. His company Armani expanded from fashion into an empire spanning beauty, fragrance, music, sport and even luxury hotels, bringing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legendary-italian-designer-giorgio-armani-dies/\">Legendary Italian designer Giorgio Armani dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Warriors intensify preparations ahead of Benin clash",
            "url": "https://www.newzimbabwe.com/warriors-intensify-preparations-ahead-of-benin-clash/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens football team coach, Michael Nees, conducted training on Wednesday afternoon with a full squad following the arrival of European-based players.\n\nThe Warriors are in Abidjan, Ivory Coast, where they are set to play against Benin in a Group C World Cup Qualifiers encounter.\n\nZimbabwes group of players arrived on Monday, together with the technical team, followed by South African-based players on Tuesday, before the European-based players touched down on Wednesday.\n\nTeam vice captain Marshall Munetsi will not be with the squad in the Ivory Coast as he is serving a suspension; rather, he will meet with the rest of the squad on Sunday in South Africa, where they will play Rwanda on Tuesday.\n\nSpeaking ahead of Benin clash, Warriors goalkeeper Washington Arubi said the teams preparations will determine Fridays outcome.\n\nWe have had a good session, you can tell that the boys are ready to fight and we are looking forward to the game.\n\nSo for now, we are focusing on Benin and we are not thinking about the next game.\n\nOur preparations will determine if we will get the maximum points because we dont want to drop points at this stage in time, he said.\n\nZimbabwe is currently bottom in Group C of the 2026 Africa World Cup Qualifiers with 4 points and a win against Benin will keep their hopes of qualifying alive.\n\nHowever, this will depend on how group leaders South Africa (13 points) would have played against Lesotho, because a win for them will automatically shatter Zimbabwes chance of progressing despite a win against Benin.\n\nSouth Africa = 13 points\n\nBenin = 8 points\n\nRwanda = 7 points\n\nNigeria = 6 points\n\nLesotho = 5 points\n\nZimbabwe = 4 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03210657/warriors.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s football team coach, Michael Nees, conducted training on Wednesday afternoon with a full squad following the arrival of European-based players. The Warriors are in Abidjan, Ivory Coast, where they are set to play against Benin in a Group C World Cup Qualifiers encounter. Zimbabwe’s group of players arrived</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-intensify-preparations-ahead-of-benin-clash/\">Warriors intensify preparations ahead of Benin clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "No law bans tinted vehicle windows – Justice Minister says as police fines motorists",
            "url": "https://www.newzimbabwe.com/no-law-bans-tinted-vehicle-windows-justice-minister-says-as-police-fines-motorists/",
            "content": "By Anna Chibamu\n\nJustice Minister Ziyambi Ziyambi told the National Assembly on Wednesday that there is no law prohibiting tinted vehicle windows.\n\nHis remarks followed an announcement by Presidential Secretary Tafadzwa Muguti claiming that tinting had been banned, which sparked confusion and questions from legislators seeking clarification on the legal framework behind the directive.\n\nDuring the Question and Answer session, Zanu PF Zvimba East MP Kudakwashe Mananzva asked, We heard that it is now a criminal offence to tint car windows. Is it illegal to put some tint on your car?\n\nIn response, Ziyambi clarified: The law allows tinting on a vehicle, provided it does not obstruct the drivers clear line of vision. For side windows, we have not yet reached a final agreement together with Hon. (Felix) Mhona, Hon. (Kazembe Kazembe), and other stakeholders.\n\nDangamvura-Chikanga MP Prosper Mutseyami pressed further, asking whether Mugutis announcement represented government policy or his personal opinion.\n\nZiyambi stressed that only Information Minister Jenfan Muswere, Information Secretary Nick Mangwana, and Presidential Spokesperson George Charamba are authorised to speak on behalf of government. The moment someone speaks on behalf of the whole government without that authority, it becomes a mistake,he said.\n\nKuwadzana East MP Charlton Hwende revealed that some drivers had been fined by police following Mugutis announcement.\n\nZiyambi responded: There is no policeman who enforces social media announcements without a Statutory Instrument. Policemen enforce the law by quoting Statutory Instruments. If anyone was given a ticket, they have the right to go to court, and the court will take corrective measures. Our policemen are orderly; they do not do that.\n\nMP Gladys Hlatywayo questioned how government planned to address the policy discord that had caused confusion and public outcry. Ziyambi replied that the role of MPs was to provide oversight, not to set policy.\n\nEarlier, Charamba took to X (formerly Twitter) to clarify that Mugutis announcement was a miscommunication by an unauthorised official.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Anna Chibamu Justice Minister Ziyambi Ziyambi told the National Assembly on Wednesday that there is no law prohibiting tinted vehicle windows. His remarks followed an announcement by Presidential Secretary Tafadzwa Muguti claiming that tinting had been banned, which sparked confusion and questions from legislators seeking clarification on the legal framework behind the directive. During</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-law-bans-tinted-vehicle-windows-justice-minister-says-as-police-fines-motorists/\">No law bans tinted vehicle windows – Justice Minister says as police fines motorists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Love triangle turns deadly: Axe murder suspect arrested while fleeing to Zimbabwe",
            "url": "https://www.newzimbabwe.com/love-triangle-turns-deadly-axe-murder-suspect-arrested-while-fleeing-to-zimbabwe/",
            "content": "IOL\n\nPolice in Limpopo have arrested a 51-year-old Zimbabwean man who had been on the run after a violent love triangle turned deadly at Wegdraai Village, Maleboho.\n\nOn Wednesday morning,IOL reported thatthe horrific incident occurred on Monday at around 11 pm.\n\nThe suspect, who is the elder brother of a 20-year-old man arrested earlier this week, was cornered in the Alldays policing area on Tuesday night while attempting to flee the country.\n\nProvincial police spokesperson Colonel Malesela Ledwaba confirmed the arrest: The suspect, who had been on the run, was arrested at about 9 pm after he was found hiding in a truck headed towards Zimbabwe. Upon arrival, he was found carrying a bag of clothes in an attempt to flee the country. Like his younger brother, he was also found to be in the country illegally.\n\nThe case stems from the violent confrontation late on Monday after the brothers allegedly received information that the 55-year-old victim was romantically involved with the elder brothers girlfriend. They stormed into a homestead where the victim and a 38-year-old woman were present.\n\nOn arrival, a confrontation ensued, during which the elder brother allegedly attacked the man with an axe and severely injured the woman, said Ledwaba.\n\nParamedics certified the 55-year-old man dead at the scene, while the injured woman was rushed to hospital for urgent treatment.\n\nPolice swiftly arrested the younger brother at his home, where they recovered the bloodied axe, which he had allegedly tried to wash in an effort to destroy evidence. He was also confirmed to be an undocumented foreign national.\n\nBoth suspects  aged 20 and 51  face charges of murder, attempted murder, defeating the ends of justice, and contravention of the Immigration Act. They are scheduled to appear before the Senwabarwa Magistrates Court on Wednesday.\n\nMeanwhile,Limpopos provincial police commissioner, Lieutenant General Thembi Hadebe,welcomed the swift arrest and applauded community members for helping police track down the fugitive.\n\nThis was a brutal act of violence. We call upon communities to continue working closely with the police. We will not tolerate such despicable behaviour, and no one is above the law, said Hadebe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03144323/axe.png",
            "description": "<p>IOL Police in Limpopo have arrested a 51-year-old Zimbabwean man who had been on the run after a violent love triangle turned deadly at Wegdraai Village, Maleboho. On Wednesday morning, IOL reported that the horrific incident occurred on Monday at around 11 pm. The suspect, who is the elder brother of a 20-year-old man arrested earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/love-triangle-turns-deadly-axe-murder-suspect-arrested-while-fleeing-to-zimbabwe/\">Love triangle turns deadly: Axe murder suspect arrested while fleeing to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Musician Chillmaster banned from driving",
            "url": "https://www.newzimbabwe.com/musician-chillmaster-banned-from-driving/",
            "content": "By Mary Taruvinga\n\nProminent musician Kudakwashe Hombarume, better known as Chillmaster, has been banned from driving for nine months by Mbare Magistrate Tendayi Mukurunge, who convicted him three months ago.\n\nThe development comes after his case was remitted back to the lower court for the magistrate to reconsider punishment and to conduct a mandatory inquiry into whether Hombarume should be prohibited from driving under section 64(3) of the Road Traffic Act.\n\nJudge President, Justice Mary Zimba-Dube, on automatic review, slammed the magistrate for trivialising the offence after he spared him jail and committed the musician to community service.\n\nIn his latestrevised ruling, Mukurunge banned Chillmaster from driving for nine months with no other conditions.\n\nThe High Court had blasted the Mbare magistrate for imposing community service on a 24-year-old unlicensed musician ruling that the sentence trivialised the seriousness of culpable homicide arising from road traffic accidents.\n\nDelivering judgment on review, Justice Dube said the trial court misdirected itself by treating the offence as one of ordinary negligence when in fact the accuseds conduct showed gross negligence.\n\nThe facts of this case reveal a serious breach of road safety regulations by an offender who, without restraint, takes it upon himself to drive a vehicle without a licence, speeds and causes an accident leading to loss of life of an innocent person, Justice Dube wrote. Contrary to a finding of ordinary negligence, the facts disclose gross negligence.\n\nHombarume admitted driving a Honda Shuttle at up to 100 km/hr in a 60 km/h zone when he struck and killed 46-year-old Custon Charumbira in April this year.\n\nHe had no drivers licence.\n\nThe trial court sentenced him to 24 months imprisonment, wholly suspended on condition that he performs community service and does not commit a similar offence.\n\nJustice Dube said the magistrate erred by placing undue weight on the victim impact statement from Charumbiras widow, who had recommended a non-custodial sentence after the accused paid compensation, funeral expenses and pledged further support.\n\nA victim impact statement cannot trump the interests of justice, said the judge.\n\nCourts should not allow offenders to buy themselves out of a custodial sentence simply because they can pay compensation.\n\nThe judge stressed that with Zimbabwe facing high rates of accidents on our roads, courts had a duty to send a strong warning to offenders who drive without licences resulting in fatalities, that such conduct will attract censure of the courts.\n\nThe High Court withheld its confirmation of sentence, remitting the matter to the magistrate to reconsider punishment and to conduct a mandatory inquiry into whether Hombarume should be prohibited from driving under section 64(3) of the Road Traffic Act.\n\nThe aggravating features of this case do not justify community service, Justice Dube concluded. Community service imposed in circumstances such as these has the effect of trivialising the offence of culpable homicide arising from road traffic accidents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220103/Chillmaster.webp",
            "description": "<p>By Mary Taruvinga Prominent musician Kudakwashe Hombarume, better known as Chillmaster, has been banned from driving for nine months by Mbare Magistrate Tendayi Mukurunge, who convicted him three months ago. The development comes after his case was remitted back to the lower court for the magistrate to reconsider punishment and to conduct a mandatory inquiry</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musician-chillmaster-banned-from-driving/\">Musician Chillmaster banned from driving</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Parliamentary Committee report exposes revenue losses, corruption in ZINARA operations",
            "url": "https://www.newzimbabwe.com/parliamentary-committee-report-exposes-revenue-losses-corruption-in-zinara-operations/",
            "content": "By Anna Chibamu\n\nA PARLIAMENTARY Public Accounts Committee (PAC) analysis report has revealed that government lost millions of United States (US) dollars due to collusion between the Zimbabwe National Road Administration (ZINARA) officials and truck drivers at the border posts.\n\nPAC conducted an analysis of the Zimbabwe National Road\n\nAdministration (ZINARA) based on the findings of the Auditor Generals report on State-Owned Enterprises and Parastatals for the year ended December 31, 2023.\n\nThe analysis which exposed rampant corruption at ZINARA was crucial for ensuring transparency and accountability in the management of public resources.\n\nThe Auditor General reported that ZINARA improperly released 11 vehicles with ZWL $10.1 million in unpaid overload fees due to a lack of policies without any evidence of payment plans or proof of payment.\n\nThe PAC Committee, in its analysis, noted with concern the high risk of revenue loss due to potential collusion between truck owners and ZINARA officials, as evidenced by the improper release of the 11 vehicles.\n\nZINARA Finance Director, Adam Zvandasara, informed the Committee that the Vehicle Inspection Department (VID) acts as ZINARAs agent for the collection of abnormal, overload, and transit fees. The overload fees were determined and paid at VID.\n\nAccording to Zvandasara, if overloaded vehicles cannot pay on the spot, they are referred to ZINARA for payment plans. ZINARA reviews the paperwork to determine whether to release the vehicle upon fulfilment of the payment plan, with the Finance department signing off on the payment plan and following up on recovery.\n\nTo date, 52% (ZWL $5,284,507,00) of the outstanding amount has been recovered, leaving a balance of ZWL $4,964,363.50. Efforts to recover the remaining amount are ongoing, Zvandasara told the Committee during an oral evidence hearing session, read part of the PAC analysis report.\n\nAlso among the raised issues by the AGs report was the tollgate evasion, where road users bypassed tollgates using unauthorised routes.\n\nThe Committee noted that the manual system used by ZINARA was prone to corruption, as evidenced by the supervisors delayed submission of evasion lists.\n\nZINARA is transitioning from manual to automated flagging.\n\nWhile the manual system provided an audit trail, the new system ensures greater accuracy and accountability.\n\nCCTV cameras are used to validate data on flagged vehicles. The delay in migration was due to the complexity of system development and continuous improvement requests, the Committee analysis report showed.\n\nThe committee had recommended that the ZINARA Board should investigate the supervisors conduct and submit findings by the end of July 2025.\n\nIt also recommended that ZINARA should install a computerised system for recording tollgate evasions by August 2025, with evasion lists submitted to the Auditor General within one week of flagging\n\nAnother concern, regarding the Auditor Generals report, involved transit coupons where the Eskbank Tollgate had obsolete transit coupons, last used in 2018, which were not recorded in the register.\n\nThe coupons lacked security features and were intended for manual ticketing during system downtime.\n\nZvandasara highlighted that the manual coupons were historically used during power outages or system failures.\n\nPAC noted the risk of pilferage due to the lack of security features on the transit coupons.\n\nZINARA should introduce regular spot checks to ensure system integrity beginning 31 October 2025.\n\nIt should also implement additional security measures for transit coupons by 31 October 2025, read part of the PAC analysis report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03195553/tollgate.png",
            "description": "<p>By Anna Chibamu A PARLIAMENTARY Public Accounts Committee (PAC) analysis report has revealed that government lost millions of United States (US) dollars due to collusion between the Zimbabwe National Road Administration  (ZINARA) officials and truck drivers at the border posts. PAC conducted an analysis of the Zimbabwe National Road Administration (ZINARA) based on the findings</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliamentary-committee-report-exposes-revenue-losses-corruption-in-zinara-operations/\">Parliamentary Committee report exposes revenue losses, corruption in ZINARA operations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "04 Sep 2025"
        }
    ]
}