{
    "news": [
        {
            "title": "ZBC appoints Sugar Chagonda as CEO",
            "url": "https://www.newzimbabwe.com/zbc-appoints-sugar-chagonda-as-ceo/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Broadcasting Corporation (ZBC) has appointed veteran broadcaster Sugar Chagonda as its Chief Executive Officer (CEO).\n\nHis appointment comes after a series of interim leadership changes following the departure of Adelaide Chikunguru under controversial circumstances last year.\n\nChagondas return to the national broadcaster marks a full-circle moment, having worked at ZBC as a reporter and news anchor.\n\nZBC confirmed Chagondas appointment, saying his expertise will transform the public broadcaster.\n\nThe Zimbabwe Broadcasting Corporation (ZBC) Board of Directors is pleased to announce the appointment of Mr. Sugar Chagonda as the substantive Chief Executive Officer (CEO) of the national broadcaster, effective August 1, 2025.\n\nA distinguished media strategist and corporate affairs expert, Mr. Chagonda brings a wealth of experience, intellectual rigour and transformative leadership to ZBC.\n\nMr. Chagondas illustrious career spans over two decades, marked by strategic foresight and an unrelenting dedication to organisational growth, read the statement.\n\nChagonda faces an uphill task of transforming ZBC into a viable entity after it emerged that the public broadcaster is haunted by mismanagement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04122229/Sugar-Chagonda.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Broadcasting Corporation (ZBC) has appointed veteran broadcaster Sugar Chagonda as its Chief Executive Officer (CEO). His appointment comes after a series of interim leadership changes following the departure of Adelaide Chikunguru under controversial circumstances last year. Chagonda’s return to the national broadcaster marks a full-circle moment, having worked at ZBC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zbc-appoints-sugar-chagonda-as-ceo/\">ZBC appoints Sugar Chagonda as CEO </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "Edgar Lungu repatriation matter back in the High Court in Pretoria",
            "url": "https://www.newzimbabwe.com/edgar-lungu-repatriation-matter-back-in-the-high-court-in-pretoria/",
            "content": "SABC News\n\nThe impasse over the final resting place offormer Zambian President Edgar Lunguheads back to the High Court in Pretoria today for a final determination on the matter.\n\nThe Zambian government is seeking declaratory relief, which would entitle it the right to repatriate the former Presidents body to Zambia for a state funeral and burial in Embassy Park, Lusaka.\n\nLungus burial, which was set to take place in June this year, was interdicted (by agreement between parties) pending the final determination of this issue.\n\nThe Zambian government charges in papers that while former President Lungus benefits were suspended when he became engaged in active politics, that impediment fell away upon his passing.\n\nAs a result, Lungu became entitled to a state funeral and the Zambian government acquired the right to accord him such.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>SABC News The impasse over the final resting place of former Zambian President Edgar Lungu heads back to the High Court in Pretoria today for a final determination on the matter. The Zambian government is seeking declaratory relief, which would entitle it the right to repatriate the former President’s body to Zambia for a state funeral and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/edgar-lungu-repatriation-matter-back-in-the-high-court-in-pretoria/\">Edgar Lungu repatriation matter back in the High Court in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "Broken spine, leg and bedridden for seven years — The painful story of nurse injured on duty, betrayed by government she served",
            "url": "https://www.newzimbabwe.com/broken-spine-leg-and-bedridden-for-seven-years-the-painful-story-of-nurse-injured-on-duty-betrayed-by-government-she-served/",
            "content": "By Thandiwe Garusa\n\nA NURSE at Bikita Rural Hospital in Masvingo province, who was seriously injured by a violent maternity patient while on duty seven years ago, is now bedridden without compensation, support, and medical care she was denied by the government.\n\nOn the night of August 13, 2018, Progress Muzuva left Bikita Rural Hospital after she was assigned to escort a pregnant patient in need of emergency care to Silveira Mission Hospital as part of her duties.\n\nThe patient she was escorting seemed stable when they began the journey, but suddenly became violent, screaming, throwing herself against the ambulances body, and trying to leap from the moving vehicle in a bid to commit suicide.\n\nMuzuva fought to save her patient from taking her own life while the ambulance bounced along the rural road. The driver was reportedly unaware of the chaos in the back.\n\nAt one point, the woman smashed the ambulance window and tried to leap out. That is when the driver realised something was amiss and finally stopped and opened the door, only to be greeted by punches. The patient then fled.\n\nMuzuva and the driver chased her through the darkness and brought her back into the ambulance.\n\nMuzuva, fearing another outburst, refused to leave the woman alone and stayed in the back of the ambulance.\n\nMoments later, the woman went into labour and Muzuva delivered the baby with her bare hands.\n\nThe violent mother, now delusional, accused Muzuva of swapping the baby upon realising it was a girl and started screaming and trying to kill the infant.\n\nI was shielding the newly born baby from her mother who wanted to kill her with one hand holding the slippery baby while another one pushing the bleeding mother away, Muzuva narrated her ordeal to NewZimbabwe.com.\n\nMuzuva and the driver finally arrived at Silveira and handed over the baby and the mother safely; however, her own body was broken.\n\nA seasoned obstetrician and gynaecologist told NewZimbabwe.com that the patients condition may have been triggered by postnatal depression that may be caused by social circumstances.\n\nThis may have been a result of the social circumstances she was in. Maybe she was looking for a boy child for a long time and this may have made her end up rejecting the child and going through a condition called Puerperal Psychosis\n\nSometimes the patient may also have suffered from an underlying psychotic disorder, previously or bipolar.\n\nMost of these psychotic issues happen soon after delivery. About 80% of women experience postpartum blues, which usually last a few days. 20% of women also suffer from postpartum depression which most people do not take seriously as it is mild.\n\nAbout 2% to 5% of women suffer from puerperal psychosis, which happened in this situation and this is the far end of postpartum depression, he explained.\n\nDenied medical assistance by the government\n\nThe following day after the incident, Muzuva realised she had sustained serious injuries as her left leg was swollen, and she could barely walk.\n\nX-rays confirmed her leg was fractured and her spine had been injured.\n\nThe government which is the very institution she served, turned its back on her.\n\nI was given a normal sick leave instead of compensatory sick leave, which is supposed to be given to someone who has been injured while on duty. I was referred to a neurosurgeon in Gweru at Claybank Hospital, Muzuva said.\n\nHer requests for an ambulance to travel to specialist hospitals were denied. Authorities from the district office refused even to write her a letter explaining how she got injured.\n\nThe process of having to find money delayed her from getting assistance while her condition deteriorated.\n\nI struggled to get money and I finally managed to hire a commuter omnibus, removing seats and lying on a mattress just to get to my appointments as I cannot sit anymore, she narrated.\n\nShe paid for every CT scan, every X-ray, and every consultation out of her own pocket money, which she did not have.\n\nShe is now bedridden and owes US$11,000 in medical bills, and has to go through another surgery.\n\nDespite multiple specialist referrals, Muzuva was denied government assistance at every turn.\n\nMedical reports seen by NewZimbabwe.com show that a neurosurgeon confirmed that her spine was fractured and required immediate surgery.\n\nThe Ministry of Health refused to help and turned down every ambulance request or financial assistance.\n\nBetrayed by a system which does not care\n\nMuzuva only got her full salary in the first two months after sick leave and in the third month, the salary was deducted by 50%.\n\nShe kept begging the human resource (HR) manager to put her on compensatory sick leave so she could get her full salary and other assistance, but was told off.\n\nI really needed the salary for medical expenses and I kept begging the District HR to put me on compensatory sick leave and he said to me, if you now want to work here at the HR offices, you may come and I will come and sleep in that bed as you, Muzuva told NewZimbabwe.com.\n\nAfter a full year of agony, Muzuva finally underwent spinal surgery in December 2019 at Parirenyatwa Hospital.\n\nAccording to her, four days later, Bikita District HR called her to come so they could discuss her situation, and she explained to her that she could not manage as she had gone through surgery and was still recovering in the hospital.\n\nThe HR made it clear that if she failed to present herself immediately, she should not bother them with her matter. This threat forced Muzuva to hire transport and make the journey, only to be told the medical board she was supposed to meet was not available.\n\nShe had to hire a car back to Parirenyatwa Hospital in Harare to continue with her admission.\n\nHer spine continued to deteriorate, she could no longer sit, walk, or use the toilet and started wearing adult diapers.\n\nLater in 2021, while her health worsened, the government deepened its betrayal and wrote to her saying it wanted her to retire but she refused on the basis that the letter stated she was not injured at work, which meant she was not entitled to the compensation she was supposed to get.\n\nSince then, she used to do follow ups and they have ignored her.\n\nShe reached every responsible office in the ministry from the district level to the minister and has been ignored, denied access, had calls dropped, and denied appointments.\n\nAt one point, she was allegedly told by an official, one Miss Masale in Masvingo province, that I am your employer and if I am quiet, it means there is nothing which needs us to communicate, we have the whole province to run, so I do not bath to just come and handle your matter alone. So I will call you,usandinetse, she said.\n\nDoctors recommended another operation, but again, she lacked the money.\n\nIn January 2023, she underwent a second major operation to install rods and screws in her back and she was assisted by private doctors out of pity, even when she could not afford it.\n\nThe procedure was too late to stop the permanent damage and she still needs reviews, MRIs, and dynamic X-rays but she cannot afford them.\n\nIn September 2023, Muzuva had her last check-up, and two years have now passed without medical follow-up.\n\nNdonzwa kubaiwa (I feel stabbing pain when I move, when I step. The iron in my back is shifting, but I cannot go back for help, Muzuva trembled as she narrated her story to this publication.\n\nSince 2023 to date, Muzuva has been home and she went to the Masvingo Provincial Medical Director earlier this year and was denied access.\n\nShe then went to the provincial HR office where another unidentified official who was there said: munonetsa imimi handiti makati munozvigona mukaenda kuhead office saka mazovingei kuno.\n\nIn 2024, she learned that the ministry had forged a letter on her behalf showing she had accepted retirement in 2022.\n\nThrough the back and forth of trying to get her deserved assistance, Muzuva then got to know that the government had even hired a legal team to handle her case as they tried to deny she was injured at work.\n\nSeven years still investigating while her health deteriorates\n\nMeanwhile, after facing a deluge of criticism over the matter, the panicky Ministry of Health issued a press statement at the weekend saying it is reviewing Muzuvas case through legal and administrative channels.\n\nThe Ministry wishes to clarify that this case has not been ignored by the current administration. In fact, procedures are actively underway to assist her.\n\nHowever, it is important to note that resolution of such matters is not a one-day event. Reviewing a case that dates back to 2018 requires careful and thorough examination of both records and procedures.\n\nTo that end, the matter was referred to the ministrys legal advisors to assess whether all applicable legal and human resources guidelines were properly followed during her handling, including her leave, retirement, and any associated benefits, reads a statement from the underfire ministry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04042411/Screenshot_20250804-051338_2.jpg",
            "description": "<p>By Thandiwe Garusa A NURSE at Bikita Rural Hospital in Masvingo province, who was seriously injured by a violent maternity patient while on duty seven years ago, is now bedridden without compensation, support, and medical care she was denied by the government. On the night of August 13, 2018, Progress Muzuva left Bikita Rural Hospital</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/broken-spine-leg-and-bedridden-for-seven-years-the-painful-story-of-nurse-injured-on-duty-betrayed-by-government-she-served/\">Broken spine, leg and bedridden for seven years — The painful story of nurse injured on duty, betrayed by government she served</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Compulsory Land Acquisition and Compensation by the State in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-compulsory-land-acquisition-and-compensation-by-the-state-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, there was a recent landmark judgment in the Zimbabwe Courts on land acquisition and compensation by the government which may affect some acquired land, what was the case about?\n\nVM: Yes, there was indeed a landmark constitutional judgment delivered on 29thJuly, 2025 in Alistair Michael Fletcher v Minister of Lands, Agriculture, Fisheries, Water and Rural Development and others.\n\nWell, I will attempt to summarise the facts. The land in question is in Umguza on the peripheries of Bulawayo City. It was incorporated into the City of Bulawayo through a statutory instrument issued by the President in 1999. Sometime in 2000, the land was subsequently gazetted for acquisition by the State under the land reform program and caveats were placed on the title deeds to perfect the acquisition.\n\nThe main issue for contention was whether or not the land was capable of acquisition under the land reform program which targeted agricultural land, as the land had become urban land by means of the statutory instrument of 1999, I referred to and various correspondence from the Bulawayo City Council which referred to it and adjacent lands as urban territory.\n\nReporter: At face value, it appears simple enough, what where the main areas of contention?\n\nVM: It may appear so, however, there was a conflict in the understanding and application of various constitutional provisions. Main being the interpretation of S16B (2) of the old constitution which limited the rights of individual to challenge the acquisition of land for agricultural purposes after it has been gazetted and conversely, the rights of the courts to adjudicate on such cases where land was acquired under the land reform process. S16B (3) of the same constitution reserved judicial review powers with the courts where expropriation was not in terms of section 16 B(2) as was eventually decided in this case. The other constitutional questions which had to be decided included the right to hold, use and not be deprived of property and the right to equal protection and benefit of the law in situations where the application of s16B(2)a was challenged, which section is now s72 of the new constitution.,\n\nReporter: What was the decision of the court and its reasoning?\n\nVM: The Constitutional Court agreed with the decision of the High Court that the land in question was urban land by virtue of it being classified as such by law and the City of Bulawayo, that being so, the State cannot compulsorily acquire urban land without compensation by using the constitutional provisions reserved for land reform acquisitions.\n\nCompensation in land reform acquisitions is limited to improvements made on land.\n\nIn reaching its decision, the court considered the meaning of agricultural land in terms of the constitution and whether Mr. Fletchers land can be classified as agricultural land. It also considered its own jurisdiction to hear the matter on the basis of whether the land in question was agricultural or urban land.\n\nReporter: What are the key takeaways from this judgment?\n\nVM: Key takeaways are that the land reform constitutional provisions ousting the authority of the courts to hear and determine acquired land refer only to agricultural land.\n\nThe courts still retain the right to hear cases to confirm whether such acquisition was done in terms of the constitutional provisions and for cases referring to compensation of improvements.\n\nThe courts also upheld the constitutional provisions relating to right to property and equal access to the courts for all urban land.\n\nThe other takeaway is not mentioned in the judgment but is necessary as it reasserts the position that our court system still functions; this is a clear case separating the government and judiciary in their interpretation of the law.\n\nReporter: How will this judgment affect owners of tracts of land in periurban areas?\n\nVM: In my view, it brings certainty that once land is classified as urban land, it is not capable of compulsory acquisition under the land reform program or acquisition without compensation. It will assist developers and investors in their planning, knowing there is precedent from the highest court securing property rights\n\nReporter: Thank you, Mr. Madzima, we have to end here because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/03200530/Newzimbabwe.com-Artwork-750x500_20250803_202914_0000.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, there was a recent landmark judgment in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-compulsory-land-acquisition-and-compensation-by-the-state-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Compulsory Land Acquisition and Compensation by the State in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "South African court orders forfeiture of R446,000 cash and Toyota Fortuner from Zimbabwean who failed to explain money’s origins",
            "url": "https://www.newzimbabwe.com/r446000-cash-and-toyota-fortuner-forfeited-as-zimbabwean-fails-to-explain-moneys-origins/",
            "content": "By Jonisayi Maromo l IOL\n\nPOLICE in Limpopo searched a Toyota Fortuner driven by a Zimbabwean national on the N1 freeway and found R446,000 in a bag, which was then seized by the law enforcement authorities.\n\nThe High Court in Limpopo has granted a forfeiture order for a cash amount of R446,000 and a Toyota Fortuner sport utility vehicle, which were seized by police.\n\nThe Hawks asset forfeiture investigation unit and the National Prosecuting Authoritys asset forfeiture unit (AFU) worked tirelessly to ensure the forfeiture of the money and the vehicle.\n\nThis emanates from the arrest conducted by members of the South African Police Service attached to Musina in 2024. On 4 July 2024, police conducted a stop and search operation along the N1 road in Musina, said Warrant Officer Lethunya Mmuroa, provincial spokesperson for the Hawks in Limpopo.\n\nDuring the operation, the police officers stopped the Toyota Fortuner which was driven by a foreign national.\n\nDuring a search, police found a plastic bag that contained South African bank notes underneath blankets inside the boot. Police interviewed the driver, and he failed to give a clear explanation for carrying the large amount of money inside the vehicle, said Mmuroa.\n\nThe driver was immediately arrested and the money was seized.\n\nThe Hawks asset forfeiture investigation unit was consulted for asset investigation.\n\nAfter completion of the investigations, the Hawks referred the matter to the National Prosecuting Authoritys asset forfeiture unit for further handling.\n\nFollowing court processes, the High Court in Limpopo granted a preservation order for the Toyota Fortuner and the money in February, before the forfeiture order was granted last week.\n\nThe cash was deposited into the criminal asset recovery account on 29 July. The forfeited Toyota Fortuner is about to be sold on auction, said Mmuroa.\n\nEarlier this year, IOL reported that a 49-year-old man was arrested on charges of money laundering after being found in possession of about R1.2 million in cash.\n\nAt the time, provincial police spokesperson in Mpumalanga, Lieutenant Colonel Jabu Ndubane, said the arrested man had allegedly tried to bribe police officers after the money was found.\n\nThis achievement is the result of the dedication by members deployed for Operation Vala Umgodi, and the man was nabbed on 16 March 2025 at Tonga near Komatipoort, said Ndubane.\n\nShe said police officers received a tip-off about a man who was allegedly in possession of an unlicenced firearm.\n\nThey then responded swiftly and followed the information, and upon arrival at Tonga View, they found the owner of the house and conducted a search and it was during that time when they discovered the large sum of money hidden under the bed as well as inside the wardrobe, said Ndubane.\n\nThe astute members continued searching in other rooms where they further found a bag full of money. It was during the process when the man tried his luck to bribe the police officials with R50,000, but his attempts failed dismally.\n\nNdubane said the money amounted to R1.2 million in banknotes and coins, while there was also Mozambican currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/13211547/SA-Limpopo-High-Court.jpeg",
            "description": "<p>By Jonisayi Maromo l IOL POLICE in Limpopo searched a Toyota Fortuner driven by a Zimbabwean national on the N1 freeway and found R446,000 in a bag, which was then seized by the law enforcement authorities. The High Court in Limpopo has granted a forfeiture order for a cash amount of R446,000 and a Toyota</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/r446000-cash-and-toyota-fortuner-forfeited-as-zimbabwean-fails-to-explain-moneys-origins/\">South African court orders forfeiture of R446,000 cash and Toyota Fortuner from Zimbabwean who failed to explain money’s origins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "China committed to supporting Zimbabwe’s education, industrialisation: Envoy",
            "url": "https://www.newzimbabwe.com/china-committed-to-supporting-zimbabwes-education-industrialisation-envoy/",
            "content": "By Xinhua\n\nCHINA is committed to supporting Zimbabwes ambition of achieving a heritage-based, inclusive, equitable, and quality education and industrial development, Chinese Ambassador to Zimbabwe Zhou Ding has said.\n\nZhou made the remarks last Thursday at the official opening of the three-day Scholastica Expo in Bulawayo, Zimbabwes second largest city.\n\nThe expo focuses on education, training, and careers in a bid to bridge the gap between the classroom and the corporate world, providing students and professionals with insights into various career paths and developing relevant skills for the industry.\n\nZhou said China is actively contributing to Zimbabwes education and industrial transformation by energising the southern African countrys development through strategic infrastructure projects, strengthening its industrial base and workforce through transformative private-sector engagement, and nurturing its talent ecosystem.\n\nIndeed, unity is our strength. This is the essence of heritage-based progress: drawing wisdom from our shared history and building a future where education and industry flourish in harmony. Together, lets turn education into industrys spark, turn partnership into prosperity, and turn innovation into progress, said Zhou.\n\nZhou said China remains committed to supporting Zimbabwes Vision 2030 and the countrys Heritage-Based Education 5.0, two signature initiatives adopted by the Zimbabwean government.\n\nChina also stands ready to share its experience in artificial intelligence development and technological products to support Zimbabwe in enhancing its capacity building, said Zhou, adding that more than half of the African students in China are studying science, technology, engineering, and mathematics subjects, along with agriculture and medicine.\n\nIn a speech read on his behalf, Zimbabwean Minister of Higher and Tertiary Education, Innovation, Science and Technology Development Frederick Shava said Chinas success in cultivating economic resilience through a curriculum that promotes the countrys heritage offers compelling lessons for Zimbabwe in creating an education system that produces innovators and solution-providers.\n\nShava added that China effectively uses technology to promote its heritage and empower local communities to identify and leverage their unique natural and cultural assets for ecotourism and specialized agricultural products, fostering distinct regional identities and resilient local economies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/30220718/Picture5.jpg",
            "description": "<p>By Xinhua CHINA is committed to supporting Zimbabwe’s ambition of achieving a heritage-based, inclusive, equitable, and quality education and industrial development, Chinese Ambassador to Zimbabwe Zhou Ding has said. Zhou made the remarks last Thursday at the official opening of the three-day Scholastica Expo in Bulawayo, Zimbabwe’s second largest city. The expo focuses on education,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-committed-to-supporting-zimbabwes-education-industrialisation-envoy/\">China committed to supporting Zimbabwe’s education, industrialisation: Envoy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "Nigerian man who identified as a Zimbabwean national denied spousal permit",
            "url": "https://www.newzimbabwe.com/nigerian-man-who-identified-as-a-zimbabwean-national-denied-spousal-permit/",
            "content": "By Sinenhlanhla Masilela l IOL News\n\nA NIGERIAN man who also identified as a Zimbabwean national had his application for spousal permit dismissed in an unopposed matter.\n\nIn an application at the North Gauteng High Court in Pretoria, Valentine Ezihe submitted an affidavit under the name Marshall Banda. In the affidavit, he identified himself as a Zimbabwean man living in Centurion, possessing a Zimbabwean passport with an unverified number.\n\nAccording to the supporting affidavit, Ezihes spousal application had been pending for two years without a response or decision from Home Affairs.\n\nIn June 2025, he served a notice of motion on home affairs and the director general of home affairs.\n\nEzihe asked the court to direct home affairs officials to issue a decision on the outcome of his application within 30 days.\n\nIn May 2025, Bandas affidavit, which claimed to be from Ezihe, was deposed and commissioned to support the notice of motion.\n\nLater, Ezihes supplementary affidavit, which supports Bandas affidavit, was deposed and commissioned in June 2025. This occurred without the prior leave of the court.\n\nEzihes legal representative argued that there were no legal provisions requiring the parties to obtain leave before supplementing their court submissions.\n\nHowever, Judge Keitumetse Johanna Mogale said the decision to permit the filing of an additional affidavit remains within the courts discretion.\n\nJudge Mogale said if affidavits are filed without leave from the court, the affidavits can be ignored.\n\nI conclude that supplementing court papers without prior leave from the court is not allowed. Disregarding rules governing the filing of affidavits can result in the affidavit being struck from the record or the court refusing to consider it, she said.\n\nFurthermore, the judge was not impressed with the application and said it was drafted as a cut-and-paste from a template.\n\nShe further criticised Ezihes legal representative for failing to comply with procedural standards.\n\nMs. Hadebe bears the duty to uphold professional integrity in her dealings with the client, the court, and in all professional interactions, said judge Mogale.\n\nTherefore, it is my view that the applicant (Ezihe) has failed to make out a proper case for an order compelling the respondents (home affairs officials) to issue the outcome of the applicants spousal permit application, she said.\n\nEzihes application was dismissed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/15225721/SA-Home-Affairs2.jpg",
            "description": "<p>By Sinenhlanhla Masilela l IOL News A NIGERIAN man who also identified as a Zimbabwean national had his application for spousal permit dismissed in an unopposed matter. In an application at the North Gauteng High Court in Pretoria, Valentine Ezihe submitted an affidavit under the name Marshall Banda. In the affidavit, he identified himself as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-man-who-identified-as-a-zimbabwean-national-denied-spousal-permit/\">Nigerian man who identified as a Zimbabwean national denied spousal permit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        },
        {
            "title": "COP15 concludes with enhanced global resolve to wetland conservation",
            "url": "https://www.newzimbabwe.com/cop15-concludes-with-enhanced-global-resolve-to-wetland-conservation/",
            "content": "By Xinhua\n\nTHE 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) concluded Thursday in the resort city of Victoria Falls, Zimbabwe, with an increased global commitment to wetland conservation.\n\nThe COP15 ran under the theme of Protecting Wetlands for Our Common Future, drawing government representatives to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.Adopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.Related parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nThe COP15 ran under the theme of Protecting Wetlands for Our Common Future, drawing government representatives to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.\n\nAdopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.Related parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nAdopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.\n\nRelated parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nRelated parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.\n\nA key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nA key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.\n\nIn her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nIn her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.\n\nNdlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nNdlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.\n\nWe also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nWe also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.\n\nThis will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nThis will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>By Xinhua THE 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) concluded Thursday in the resort city of Victoria Falls, Zimbabwe, with an increased global commitment to wetland conservation. The COP15 ran under the theme of “Protecting Wetlands for Our Common Future,” drawing government representatives to highlight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop15-concludes-with-enhanced-global-resolve-to-wetland-conservation/\">COP15 concludes with enhanced global resolve to wetland conservation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "04 Aug 2025"
        }
    ]
}