{
    "news": [
        {
            "title": "Trump wields axe over ‘Democrat Agencies’ as shutdown blame game rages",
            "url": "https://www.newzimbabwe.com/trump-wields-axe-over-democrat-agencies-as-shutdown-blame-game-rages/",
            "content": "BBC\n\nPresident Donald Trump has said he and his budget director will work out which Democrat Agencies to cut as the US government shutdown approached its third day.\n\nHe suggested Republicans should seize the opportunity to clear out dead wood and gave no hint of concessions to Democratic demands that legislation funding the government should include healthcare insurance subsidies.\n\nRepublicans and Democrats on Capitol Hill, meanwhile, continued to blame each other for failing to keep federal agencies open.\n\nHundreds of thousands of federal workers are staying home, while others worked without pay. Some federal attractions closed to visitors while others, including the Statue of Liberty, stayed open.\n\nAnalysts dont expect either side to budge without pressure from everyday Americans, most of whom have yet to feel direct impacts on their lives.\n\nIt was unclear exactly what Trump could decide in Thursdays meeting with Russell Vought, director of the US Office of Management and Budget (OMB).\n\nWhen Congress fails to keep the US government open, the OMB director works with the president to pick which government activities should stop and which are essential.\n\nIt then gives directions to federal agencies about which employees to place on furlough, which means unpaid leave.\n\nOn the first day of the shutdown, Vought said the White House had moved to pause or cancel billions of dollars in funding meant for Democratic states, including $18bn (13.4bn) in infrastructure projects in New York  home of both Senator Chuck Schumer and the Democratic leader of the House of Representatives, Hakeem Jeffries.\n\nBoth sides must come together to pass legislation if the government is to reopen.\n\nRepublicans need eight Democratic senators to vote with them, while Democrats need 13 Republicans to side with them. Only three Democrats joined with Republicans on the last failed vote in the Senate on Wednesday.\n\nLawmakers are expected to try again on Friday afternoon to resolve the impasse with a vote in the Senate.\n\nRepublicans want to pass a funding measure without anything else attached, but Democrats want to include a renewal of health insurance subsidies for low-income individuals set to expire at the end of the year.\n\nIn duelling press conferences on Capitol Hill on Thursday, neither party appeared willing to give ground.\n\nHouse Speaker Mike Johnson called Democrats selfish, dubbed it the Democrat shutdown, and said he would not negotiate on adding insurance subsidies  or other measures  to government funding.\n\nJeffries accused Republicans of not wanting to provide working-class Americans with healthcare and said Trumps threats to fire more federal workers were pointless. He noted: They have been firing federal employees all along.\n\nLee Miringoff, director of the Marist University Institute for Public Opinion, said his polling suggested Americans were largely split down party lines when it came to assigning fault for the shutdown.\n\nMajorities of both Democratic and Republican respondents to his polls blamed the other party for the shutdown, he said, while 41% of independents said both parties shared the blame equally.\n\nBoth of the parties have mastered the finger-pointing, and all were left with is a growing number of people think the country is headed in the wrong direction, Miringoff said.\n\nHe expected Americans to put pressure on Congress to reopen the government  but not until they see the impact of a shutdown on their own lives.\n\nAs politicians traded barbs, US government services started to grind to a halt and thousands of federal workers stayed home.\n\nAbout 750,000 federal workers were expected to take unpaid leave, according to an estimate from the Congressional Budget Office (CBO).\n\nFederal employees deemed essential continued to work, though without pay. They include more than 200,000 law enforcement officers.\n\nAir traffic controllers and Transportation Security Administration (TSA) workers are considered essential, so air travel will not immediately be affected.\n\nDuring the last shutdown these employees increasingly began to call in sick, leading to some delays at major airports.\n\nTourists were turned away from museums in Washington and New York, including at Federal Hall in Manhattan.\n\nA manager told the BBC the building was closed like other federal monuments.\n\nGeorge Washington, the first US president, took the oath of office there in 1789. Now a museum, the historic building also was home to the first Congress and Supreme Court.\n\nBut not all monuments are closed.\n\nElsewhere in New York, the Statue of Liberty and Ellis Island remained open, thanks to the leadership of President Donald J Trump, a Department of the Interior spokesperson told the BBC.\n\nThe Smithsonian, which includes more than a dozen museums and attractions that drew nearly 17 million visitors last year, told the BBC it had enough money to stay open for a week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/03060922/donal-trump.webp",
            "description": "<p>BBC President Donald Trump has said he and his budget director will work out which “Democrat Agencies” to cut as the US government shutdown approached its third day. He suggested Republicans should seize the opportunity to “clear out dead wood” and gave no hint of concessions to Democratic demands that legislation funding the government should</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-wields-axe-over-democrat-agencies-as-shutdown-blame-game-rages/\">Trump wields axe over ‘Democrat Agencies’ as shutdown blame game rages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "03 Oct 2025"
        },
        {
            "title": "Parliament: Mutodi demands Finance Ministry PS Guvamatanga be summoned over alleged multimillion-dollar contractor bribes",
            "url": "https://www.newzimbabwe.com/parliament-mutodi-demands-finance-ministry-ps-guvamatanga-be-summoned-over-alleged-multimillion-dollar-contractor-bribes/",
            "content": "By Costa Nkomo\n\nThe Chairperson of the Parliamentary Portfolio Committee on Budget and Finance, Energy Mutodi, has demanded that the Permanent Secretary in the Ministry of Finance, George Guvamatanga, be summoned by Parliament to clear his name following allegations of corruption involving alarming sums in dealings with contractors.\n\nMutodi told Parliament on Thursday that Guvamatanga is allegedly demanding kickbacks of between five and ten percent from contractors, with the threat that their payments will not be processed if they fail to comply.\n\nHe added that Guvamatanga has allegedly made millions through corruption and has repeatedly refused to appear before Parliament when called upon to clear his name, all without any consequences.\n\nMutodi said it is high time Guvamatanga is invited to explain himself, as his actions are tarnishing Zimbabwes reputation.\n\nOur Government cannot be tarnished by the actions of corrupt and greedy people who occupy public office. I therefore urge this House to ensure that we call the Permanent Secretary of the Ministry of Finance, Mr. George Guvamatanga to come and appear before this August House and answer charges of corruption, answer charges of asking to be paid a five to ten percent premium by contractors and all payments made by the Treasury.\n\nWe have made several attempts to call George Guvamatanga to appear before this August House and he has deliberately refused with impunity. This cannot continue, Mutodi said.\n\nHe added that Guvamatangas conduct is now deterring contractors who are no longer interested in providing services to the government, because they fear being asked to pay kickbacks.\n\nMutodi further stated that every government employee, including Permanent Secretaries from all ministries, is accountable to the Parliament of Zimbabwe and therefore must be held to account and answer questions.\n\nIn terms of Section 119 (3) of the Constitution of Zimbabwe, all MDAs, including the Ministry of Finance, the Permanent Secretary and all directors in that office are accountable to Parliament. For that reason, these permanent secretaries, the directors and different officials in these ministries are not undertaking their own personal businesses in those offices but they are being delegated by us because it is us who are elected by the people.\n\nActing Speaker of the National Assembly, Naledi Maunganidze, said the Minister of Finance, Professor Mthuli Ncube, will be made to respond to Parliament.\n\nYesterday, Mutodi took to X, accusing Guvamatanga of sending mercenaries to intimidate him and anyone else who raises corruption issues involving his name.\n\nCorruption is rampant in Zimbabwe, with Vice President Constantino Chiwenga describing it as a national security threat.\n\nAccording to figures cited by National Prosecutor General Justice Matanda-Moyo, Zimbabwe is losing a staggering US$2 billion annually due to corruption and illicit financial dealings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Costa Nkomo The Chairperson of the Parliamentary Portfolio Committee on Budget and Finance, Energy Mutodi, has demanded that the Permanent Secretary in the Ministry of Finance, George Guvamatanga, be summoned by Parliament to clear his name following allegations of corruption involving alarming sums in dealings with contractors. Mutodi told Parliament on Thursday that Guvamatanga</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-mutodi-demands-finance-ministry-ps-guvamatanga-be-summoned-over-alleged-multimillion-dollar-contractor-bribes/\">Parliament: Mutodi demands Finance Ministry PS Guvamatanga be summoned over alleged multimillion-dollar contractor bribes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "03 Oct 2025"
        },
        {
            "title": "ZHRC urges government to strengthen social security for older persons",
            "url": "https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution.\n\nOlder persons human rights have long been overlooked due to perceptions of being non-productive, yet many remain active contributors.\n\nCommemorating the International Day of Older Persons (IDOP), which was celebrated under the theme Older Persons Driving Local and Global Action: Our Aspirations, Our Well-Being and Our Rights, the ZHRC urged the government to prioritise their well-being and rights.\n\nThe ZHRC calls on the government of Zimbabwe to domesticate and implement provisions of the AU Protocols protecting the rights of older persons it is partyto.\n\nIn particular, the commission urges the government to avail resources for the provision of social security for older persons, including meaningful pensions so that retired people do not become destitute, ZHRC said in a statement Thursday.\n\nThe African Union (AU) adopted protocols on the rights of older persons (2016) and on social protection and security (2022), both of which Zimbabwe ratified in 2024.\n\nFurthermore, the government of Zimbabwe enacted progressive laws that protect the rights and entitlements of older persons, which advance the rights of older persons to human dignity, appropriate care facilities, provision of social protection through harmonised cash transfers, food deficit mitigation programmes, assisted treatment orders, prevention of age-based discrimination, and protection from abuse, neglect and exploitation of all forms.\n\nDespite all these legislative steps, older persons in Zimbabwe still encounter obstacles in fully accessing their constitutional rights and benefits.\n\nDespite these positive legislative measures, older persons in Zimbabwe continue to face barriers to the enjoyment of their constitutional rights and entitlements.\n\nChallenges in this regard include discrimination of older persons within their family environments and in public spaces, age-based stereotyping including accusations of witchcraft directed at older women in particular, limited access to health care, inadequate social protection, prolonged isolation and loneliness, neglect and in some instances outright abuse by relatives or caregivers.\n\nThese challenges are compounded by limited or ineffective enforcement of laws that protect older persons from violations of their fundamental rights and entitlements, ZHRC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/05055346/Old-woman.jpg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution. Older persons’ human rights have long been overlooked due to perceptions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/\">ZHRC urges government to strengthen social security for older persons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "03 Oct 2025"
        },
        {
            "title": "“Not a top team” – Bafana Bafana coach dismisses Zimbabwe threat ahead of crucial World Cup Qualifier",
            "url": "https://www.newzimbabwe.com/not-a-top-team-bafana-bafana-coach-dismisses-zimbabwe-threat-ahead-of-crucial-world-cup-qualifier/",
            "content": "By Sports Reporter\n\nBafana Bafana coach Hugo Broos says he is unfazed by Zimbabwe ahead of the crucial FIFA World Cup Qualifier set for October 10.\n\nSouth Africa face the Warriors in what has become a must-win encounter following a setback earlier this week when FIFA docked them three points and three goals for fielding an ineligible player against Lesotho. The sanction has left Broos men under pressure to win their final two qualifiers against Zimbabwe and Rwanda to keep their World Cup hopes alive.\n\nDespite the blow, Broos expressed confidence, dismissing both Zimbabwe and Rwanda as not top teams.\n\nYou start doubting now because of a tricky situation, yet we are facing Zimbabwe and Rwanda, not Nigeria, Cameroon, or Egypt. These are good teams, yes, but not top teams. So why should we doubt? he said.\n\nBafana Bafana go into the clash with an edge, having beaten Zimbabwe 3-1 in the reverse fixture. Confidence is further boosted by the fact that the match will be played at Durbans Moses Mabhida Stadium, which the Warriors have adopted as their temporary home after failing to secure a CAF-approved venue in Zimbabwe.\n\nBenin  14 points\n\nSouth Africa  14 points\n\nNigeria  11 points\n\nRwanda  11 points\n\nLesotho  9 points\n\nZimbabwe  4 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/03055459/broos.webp",
            "description": "<p>By Sports Reporter Bafana Bafana coach Hugo Broos says he is unfazed by Zimbabwe ahead of the crucial FIFA World Cup Qualifier set for October 10. South Africa face the Warriors in what has become a must-win encounter following a setback earlier this week when FIFA docked them three points and three goals for fielding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-a-top-team-bafana-bafana-coach-dismisses-zimbabwe-threat-ahead-of-crucial-world-cup-qualifier/\">“Not a top team” – Bafana Bafana coach dismisses Zimbabwe threat ahead of crucial World Cup Qualifier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "03 Oct 2025"
        },
        {
            "title": "Government excludes urban-based farmers from the Pfumvudza/Intwasa Presidential Input Scheme",
            "url": "https://www.newzimbabwe.com/government-excludes-urban-based-farmers-from-the-pfumvudza-intwasa-presidential-input-scheme/",
            "content": "By Anna Chibamu\n\nGovernment has announced that this years Presidential Pfumvudza/Intwasa inputs scheme will strictly target rural households, with no provision for the 500 000 urban or peri-urban dwellers who benefited last season.\n\nAgriculture Minister Anxious Masuka told Parliament during a Wednesday Q&A session that only rural communities will be provided with farming inputs under the programme, adding that last years inclusion of urban beneficiaries had been a temporary measure to cushion against the effects of the El Nio-induced drought.\n\nPumula MP Sichelesile Mahlangu had sought the governments position regarding urban constituencies benefiting from the scheme.\n\nThese peri-urban areas are actively participating in thePfumvudza/IntwasaProgramme and are fully prepared.What is the ministers position on these constituencies? Mahlangu.\n\nThe official policy is that urban areas will not receive Presidential input this year. The exception granted last year was due to an extraordinary drought, Masuka said.\n\nThis year, the inputs will be strictly allocated to the three million rural beneficiaries. Anyone residing in an urban area who wishes to benefit must be located in designated agricultural zones, namely, communal lands, A1 resettlement areas, or small-scale farming areas. These are the targeted zones for thePfumvudza/IntwasaProgramme this season.\n\nThe Pfumvudza/Intwasa scheme, a food security programme, has over the years focused on boosting productivity among smallholder and rural farmers through climate-smart agriculture.\n\nMasuka stressed that the programme would not accommodate urban dwellers since it is designed for farming regions.\n\nHowever, it is important to note that agriculture is designated for agricultural zones. Urban areas are primarily residential and do not accommodate farming activities.\n\nIn Zimbabwe, we have established that urban agriculture is not permitted, as farming should take place on land specifically allocated for agricultural purposes, not within urban settlements, Masuka explained.\n\nHe added, I recall that during last years severe drought, the President recognised that rural farmers who typically support urban populations were facing significant challenges. In response, we extended input support to peri-urban farmers to help supplement food production.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/01030702/Anxious-Masuka.png",
            "description": "<p>By Anna Chibamu Government has announced that this year’s Presidential Pfumvudza/Intwasa inputs scheme will strictly target rural households, with no provision for the 500 000 urban or peri-urban dwellers who benefited last season. Agriculture Minister Anxious Masuka told Parliament during a Wednesday Q&A session that only rural communities will be provided with farming inputs under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-excludes-urban-based-farmers-from-the-pfumvudza-intwasa-presidential-input-scheme/\">Government excludes urban-based farmers from the Pfumvudza/Intwasa Presidential Input Scheme</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "03 Oct 2025"
        },
        {
            "title": "Gold rally fuels 45% stocks rise on Zimbabwe’s dollar bourse",
            "url": "https://www.newzimbabwe.com/gold-rally-fuels-45-stocks-rise-on-zimbabwes-dollar-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock market is riding a wave of gains, powered by gold miners cashing in on a 48% jump in the precious metal this year.\n\nThe Victoria Falls Stock Exchanges benchmark index has surged 45%, lifting its market value to $1.8 billion at the end of September.\n\nThe VFEX was set up in late 2020 to raise capital, specifically for mining companies, and has 17 listed firms. Chief Executive OfficerJustin Bgoniexpects it to add five more by the end of the year, in sectors ranging from mining to property, he said Thursday by phone.\n\nThe exchange has performed well with valuations now approaching their regional peers, he said.\n\nVFEX All-Share Indexs 45% Rise\n\nUK-basedKavango Resources, with mining interests in Filabusi in south-eastern Zimbabwe, became the third gold miner to list on the bourse last month. Others includeCaledonia Mining Corp.andPadenga Holdings Ltd., which also has interests in crocodile skins.\n\nTheir stocks have become a proxy for gold, saidIH Securitiesresearch head,Lloyd Mlotshwa. These companies invested well in time to catch the gold rush and have also ramped up production when the timing is right.\n\nAlso boosting the VFEX is a shortage of ZiGs, the local currency, which has shifted investor sentiment away from the main exchange in Harare to the dollar-only bourse, Mlotshwa said. ZiG liquidity is weak, he added Investors resort instead to using their dollars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock market is riding a wave of gains, powered by gold miners cashing in on a 48% jump in the precious metal this year. The Victoria Falls Stock Exchange’s benchmark index has surged 45%, lifting its market value to $1.8 billion at the end of September. The VFEX was set up in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-rally-fuels-45-stocks-rise-on-zimbabwes-dollar-bourse/\">Gold rally fuels 45% stocks rise on Zimbabwe’s dollar bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "03 Oct 2025"
        }
    ]
}