{
    "news": [
        {
            "title": "War veterans leader ‘a person of security interest’- State security says in leaked memo to border posts",
            "url": "https://www.newzimbabwe.com/war-veterans-leader-a-person-of-security-interest-state-security-says-in-leaked-memo-to-border-posts/",
            "content": "By Staff Reporter\n\nZimbabwe National Liberation War Veterans Association (ZNLWVA) chairman Ethan Mathibela has been placed on a security watchlist, a leaked memo from the Central Intelligence Organisation (CIO) to border posts has revealed.\n\nMathibelas war vets grouping is opposing the extension of President Emmerson Mnangagwas term beyond 2028 and has called for nationwide protests to draw attention to the economic crisis, demand government accountability, and push for economic freedom, as well as an end to corruption, tribalism, nepotism, and poor governance.\n\nIn response, State Security Minister Lovemore Matuke over the weekend said any demonstrations against Mnangagwa would be dealt with decidedly. The CIO is run by Matukes ministry and under the purview of the Office of the President.\n\nA letter seen by this publication, written by the Presidents department to regionalimmigration departments across the country,demands that Mathibela be stopped if he attempts to leave through the border posts.\n\nThis office kindly requests that you watchlist the following person of security interest who is a Zimbabwean national: Ethan Mathibela.\n\nShould he present himself at Plumtree, Maitengwe, or Mphoengs Border Posts, your office must deny him exit and inform the Presidents Department.\n\nYour usual cooperation is greatly appreciated, the letter reads.\n\nOn Monday, unidentified youths disrupted Mathibelas press briefing at the Bulawayo Media Centre.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/17114027/Ethan-Mathibela-1-1-scaled.jpg",
            "description": "<p>By Staff Reporter Zimbabwe National Liberation War Veterans Association (ZNLWVA) chairman Ethan Mathibela has been placed on a security watchlist, a leaked memo from the Central Intelligence Organisation (CIO) to border posts has revealed. Mathibela’s war vets grouping is opposing the extension of President Emmerson Mnangagwa’s term beyond 2028 and has called for nationwide protests</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-veterans-leader-a-person-of-security-interest-state-security-says-in-leaked-memo-to-border-posts/\">War veterans leader ‘a person of security interest’- State security says in leaked memo to border posts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "WATCH: Three children die in blair toilet collapse",
            "url": "https://www.newzimbabwe.com/watch-three-children-die-in-blair-toilet-collapse/",
            "content": "By Tapiwa Svondo\n\nThree children from Marshlands, Norton, died last Friday after a blair toilet they were in collapsed.\n\nA three-year-old girl had asked her father to accompany her to the toilet who then instructed his nephews to go with her.\n\nJames Chigwegwe, who lost two children, Prosper (6) and Tawanashe (4), in the toilet collapse, told NewZimbabwe.com that two died upon arrival at the hospital and another after admission.\n\nMy two kids, Prosper and Tawanashe, were told to accompany their three-year-old cousin to the toilet. After a moment, we heard screams from the toilet calling for help, and we quickly rushed there only to find that the whole toilet had collapsed, trapping the three kids inside the pit under over 90 bricks that had fallen on them.\n\nWe rushed them to the hospital, and two were declared dead upon arrival. My son Prosper tried to soldier on after admission, but he also left us at 3 PM.\n\nWhat really affected them were the bricks falling on them and the water and waste, which contains carbon. Its not normal to inhale it, so we can say the water was their biggest detriment, said Chigwegwe.\n\nThe toilet was said to be almost full of waste, but appeared functional and in good condition.\n\nChigwegwe, a miner, is convinced that there was an evil hand behind the death of his children, given how the events unfolded.\n\nLucy Sixpence, a relative, is convinced there was foul play.\n\nIts still shocking for us, and we have never heard of anything like this before. Believe me, something transpired in this whole situation because this toilet didnt have any issues, she said.\n\nProsper and Tawanashe were laid to rest on Sunday in Norton, while the three-year-old was taken to her resting place in Buhera.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19122723/chigwegwe.jpeg",
            "description": "<p>By Tapiwa Svondo Three children from Marshlands, Norton, died last Friday after a blair toilet they were in collapsed. A three-year-old girl had asked her father to accompany her to the toilet who then instructed his nephews to go with her. James Chigwegwe, who lost two children, Prosper (6) and Tawanashe (4), in the toilet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-three-children-die-in-blair-toilet-collapse/\">WATCH: Three children die in blair toilet collapse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "Environmentalist Mabvirakare dragged to court on theft allegations",
            "url": "https://www.newzimbabwe.com/environmentalist-mabvirakare-dragged-to-court-on-theft-allegations/",
            "content": "By Staff Reporter\n\nEnvironmentalist Vongai Nadia Mabvirakare has been taken to court on allegations of swindling Matiza Trust of US$15,000 that was meant for a nursery project.\n\nMabvirakare appeared before Harare magistrate Isheanesu Matova and was remanded in custody awaiting bail ruling.\n\nShe is charged with theft of trust property.\n\nThe State led evidence from the investigating officer, Fannuel Mangunda who submitted that the environmentalist is a flight risk.\n\nMangunda said Mabvirakare supplied false information to the police, including her house number and faked illness because she was aware that she is likely to get a jail term.\n\nOn March 5, we went to her place of residence but we failed to locate her. We interviewed her son, who said her mother had gone to work.\n\nAfter about 20 minutes, we phoned her and informed her of the charges she was facing and she told me that she was not in Harare. Actually, when we initially called her to the police station, she did not cooperate and she supplied a false address.\n\nIf granted bail, she is likely to abscond and interfere with witnesses. The case is still under investigation, I need to record detailed witness statements from the outstanding witnesses, he told the court.\n\nAccording to the State, Mabvirakure received US$15,200 on March 3 2025, which she was supposed to surrender to Brickforce Hardware Company as payment for utensils supplied to the company.\n\nMabvirakure allegedly diverted all the money to her personal use.\n\nAccording to the court papers, Mabvirakure received US$8,00,0 which was deposited in her account and later on received US$7,200 on two different occasions in the presence of witnesses who are yet to record their statements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12075441/Nadia-Mabvirakare-e1741762685138.jpeg",
            "description": "<p>By Staff Reporter Environmentalist Vongai Nadia Mabvirakare has been taken to court on allegations of swindling Matiza Trust of US$15,000 that was meant for a nursery project. Mabvirakare appeared before Harare magistrate Isheanesu Matova and was remanded in custody awaiting bail ruling. She is charged with theft of trust property. The State led evidence from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/environmentalist-mabvirakare-dragged-to-court-on-theft-allegations/\">Environmentalist Mabvirakare dragged to court on theft allegations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "Geza demands journalist Mhlanga’s immediate release",
            "url": "https://www.newzimbabwe.com/geza-demands-journalist-mhlangas-immediate-release/",
            "content": "By Staff Reporter\n\nExpelled Zanu-PF Central Committee member and war veteran, Blessed Geza,resurfaced on Tuesday night, unleashing a scathing attack on Zimbabwes Chief Justice Luke Malaba, ordering him to release jailed journalist Blessed Mhlanga.\n\nMhlanga was arrested after Heart and Soul Television (HSTV), which he heads, exclusively broadcast Gezas explosive press briefings. In these briefings, the war veteran called for President Emmerson Mnangagwa to step down, citing a litany of reasons, chief among them corruption, nepotism, and tribalism.\n\nGezain an online addressdemandedMhlangas immediate release from gaol.\n\nWe are deeply concerned by the arrest of journalist Blessed Mhlanga. We see this as a blatant attempt to muzzle democratic voices. We demand the unconditional and immediate release of Mhlanga, he declared.\n\nMhlanga has been charged under Section 164 of the Criminal Law (Codification and Reform) Act Chapter 9:23, with the state alleging that he transmitted a message with intent to incite public violence. This message stemmed from Gezas press briefing in which he cautioned police boss Stephen Mutamba against deploying officers to quell potential protests against Mnangagwa.\n\nGeza had warned Mutamba that if the police were to beat or shoot protesters, the citizens would take matters into their own hands in their respective communities.\n\nPreviously, the police, who had twice invited Mhlanga for questioning, seemed to be clutching at straws, unable to find a case against him. They later issued a statement claiming they were searching for Mhlanga, who then handed himself in, only to be immediately detained and appear before the Harare Magistrates Courts, where he was ultimately denied bail.\n\nMhlanga appealed against the bail denial at the High Court, and the court has reserved its judgment.\n\nGeza came out all guns blazing, warning Chief Justice Luke Malaba that he would have only himself to blame for keeping Mhlanga locked up.\n\nThe judiciary  we are warning you, we have been watching you, and this has been going on for a long time. Dont be used as a puppet by Mnangagwa to violate peoples rights, Geza stated.\n\nHe added: We fought for the right to free speech, freedom of assembly, and freedom of association.\n\nGeza warned Justice Malaba that the abuse of the judiciary has become a depressing tradition, whereby those who speak out against the government are labelled as criminals.\n\nThis didnt begin with Mhlanga. You have jailed Timba, Chibaya, Sikhala, and countless others. So where are people supposed to turn? People believe that if they go to the judiciary, they will find justice. Chief Justice Malaba, please get your house in order, or we will be coming after you very soon, he fumed.\n\nGezas sentiments regarding the judiciary echo those of Alpha Media Holdings owner Trevor Ncube, who told the press at the Magistrates Court a few weeks ago that Mnangagwa is using the courts to punish dissent. Ncube challenged Mnangagwa to arrest him, as he owns HSTV, which transmitted the message deemed to be inciting public violence.\n\nMhlangas arrest has been widely condemned by numerous media freedom advocacy groups at local, regional, and international levels.\n\nHeis currently detained at Harare Remand Prison, and his bail application appeal awaits a ruling from Justice Gibson Mandaza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter Expelled Zanu-PF Central Committee member and war veteran, Blessed Geza,  resurfaced on Tuesday night, unleashing a scathing attack on Zimbabwe’s Chief Justice Luke Malaba, ordering him to release jailed journalist Blessed Mhlanga. Mhlanga was arrested after Heart and Soul Television (HSTV), which he heads, exclusively broadcast Geza’s explosive press briefings. In these briefings,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geza-demands-journalist-mhlangas-immediate-release/\">Geza demands journalist Mhlanga’s immediate release</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "Sizwe Alakine calls out ‘Piano Pulse’ hosts: ‘Who are you to downgrade my girlfriend?’",
            "url": "https://www.newzimbabwe.com/sizwe-alakine-calls-out-piano-pulse-hosts-who-are-you-to-downgrade-my-girlfriend/",
            "content": "IOL\n\nThings took a heated turn on the latest episode of Piano Pulse when Sizwe Alakine dropped by to get some answers from hosts Thakgi Ledwaba and Sfiso Ndlovu.\n\nWhenMac Gs Podcast and Chill Networkintroduced Piano Pulse as a new addition to the network last year, they promised a mix of entertainment, industry tea, and that signature spice viewers have come to expect from Mac Gs podcast network.\n\nThe recent episode delivered just that and more!\n\nSeasoned rapper turned amapiano star, Alakine, paid a surprise visit to the Piano Pulse studios after hosts Ledwaba and Ndlovu dissed hisgirlfriend Gigi Lamayne, who is also a rapper.\n\nAlakine, whose real name is Sizwe Moeketsi, made an unannounced stop at the Piano Pulse studios to confront the hosts about their recent comments about his current girlfriend.\n\nOn a previous episode that aired last week, the hosts sparked controversy when they called Lamayne, a downgrade from his former girlfriend and baby mama,Luthando Loot Love Shosha.\n\nIt all started when Ndlovu asked a hypothetical question: Lets say Im an artist, our relationship was very well-known, and now that we are separated, I downgrade instead of getting a hotter girl. Which one would you go with?\n\nLedwaba responded by saying he wanted to know who Ndlovu was talking about before he responded since he wanted to give his answer based on facts. Ndlovu then responded by mentioning Alakine.\n\nThe artist then paid a surprise visit to the studios for a face-to-face conversation with the hosts, questioning what right they had to discuss his girlfriend the way they did.\n\nWhat downgrade? What gives you the right to sit here and discuss another mans relationship and then have an opinion that they are a downgrade?\n\nWhat are you teaching these kids here? That if youre a girl that looks like Gigi in the public perception, you are a downgrade compared to a girl that looks like Luthando?, Alakine asked.\n\nPiano Pulseis a popular podcast focused on amapiano culture, hosted by popular TikTok content creators, Ledwaba, Munaka Muthambi and artist manager, Ndlovu.\n\nThe podcast is part of MacGs podcast network, which features various shows discussing different topics. It is known for its lively discussions and provocative comments about amapiano artists.\n\nFans took to social media to react to the drama, with some praising Alakine for standing up for his girlfriend, while others criticised the hosts for overstepping their bounds.\n\nX user @uMNtuNgabantu commented: @ReasonHD good thing you went to that pod to face them as a man instead of gossiping through a live video, I respect you more. Loot Love and Gigi arent anywhere in Piano but their names are dragged in a Piano Pulse show.\n\n@ReasonHDgood thing you went to that pod to face them as a man instead of gossip through a live video,i respect you more. Loot love and Gigi arent anywhere in Piano but their names are dragged in a Piano Pulse show.\n\nThakgi & Sfiso really needed that reality check Neither of them has done the work needed to give anyone any advice, never mind the success needed to be taken seriously. They have all week to do their research & instead they gamble with MacGs credibility. Now they pull stunts, he wrote.\n\nThakgi & Sfiso really needed that reality check Neither of them has done the work needed to give anyone any advice, never mind the success needed to be taken seriously. They have all week to do their research & instead they gamble with MacGs credibility. Now they pull stunts!\n\nThe surprise visit has also sparked a heated debate about the boundaries between artists personal lives and public commentary.\n\nOne thing is certain, the award-winning rapper and amapiano star has made it clear that he will not tolerate disrespect towards those he cares about.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19100216/Hosts-of-Piano-Pulse-Thakgi-Ledwaba-Munaka-Muthambi-and-Sfiso-Ndlovu.webp",
            "description": "<p>IOL Things took a heated turn on the latest episode of “Piano Pulse” when Sizwe Alakine dropped by to get some answers from hosts Thakgi Ledwaba and Sfiso Ndlovu. When Mac G’s Podcast and Chill Network introduced “Piano Pulse” as a new addition to the network last year, they promised a mix of entertainment, industry tea,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sizwe-alakine-calls-out-piano-pulse-hosts-who-are-you-to-downgrade-my-girlfriend/\">Sizwe Alakine calls out ‘Piano Pulse’ hosts: ‘Who are you to downgrade my girlfriend?’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "Seven killed in road traffic accident at Dzivarasekwa turn-off",
            "url": "https://www.newzimbabwe.com/seven-killed-in-road-traffic-accident-at-dzivarasekwa-turn-off/",
            "content": "By Staff Reporter\n\nSEVEN people have been confirmed dead following a road traffic accident that occurred at the Dzivarasekwa turn-off, along Bulawayo road, in Harare this Wednesday morning.\n\nEight other people sustained various degrees of injuries in the fatal crash along the Bulawayo road stretch, which has become a black spot.\n\nIn a statement, Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the accident.\n\nThe ZRP confirms a fatal road traffic accident involving three vehicles, a Toyota Hiace kombi, haulage truck and UD70 truck, which occurred early this morning on March 19, 2025 at the intersection of Bulawayo Road and Dzivarasekwa turn-off near Thuli Service Station.\n\nSeven people were killed while eight others were injured. It is alleged that the kombi driver failed to give way at the traffic lights controlled junction resulting in the accident, said Nyathi.\n\nPolice said more details will be released in due course.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19095247/accident-dz-turn-off.jpeg",
            "description": "<p>By Staff Reporter SEVEN people have been confirmed dead following a road traffic accident that occurred at the Dzivarasekwa turn-off, along Bulawayo road, in Harare this Wednesday morning. Eight other people sustained various degrees of injuries in the fatal crash along the Bulawayo road stretch, which has become a black spot. In a statement, Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seven-killed-in-road-traffic-accident-at-dzivarasekwa-turn-off/\">Seven killed in road traffic accident at Dzivarasekwa turn-off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "UK: Chester man charged in connection with sexual offences investigation",
            "url": "https://www.newzimbabwe.com/chester-man-charged-in-connection-with-sexual-offences-investigation/",
            "content": "ChesterStandard\n\nA CHESTER man, Walter Chahwanda has been charged in connection with a sexual offences investigation.\n\nChahwanda, 33 and of Plemonstall Court, was arrested by Merseyside Police on Thursday, March 13.\n\nHe has since been charged with rape and sending photographs/film to cause alarm, distress or humiliation.\n\nChahwanda appeared at Liverpool Adult Remand Court on Saturday, March 15.\n\nHe was remanded into custody to appear at Liverpool Crown Court on Monday, April 14.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19080128/police-uk.jpg",
            "description": "<p>ChesterStandard A CHESTER man, Walter Chahwanda has been charged in connection with a sexual offences investigation. Chahwanda, 33 and of Plemonstall Court, was arrested by Merseyside Police on Thursday, March 13. He has since been charged with rape and sending photographs/film to cause alarm, distress or humiliation. Chahwanda appeared at Liverpool Adult Remand Court on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chester-man-charged-in-connection-with-sexual-offences-investigation/\">UK: Chester man charged in connection with sexual offences investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "‘l don’t have authority to sanction protests’ – says police boss Mutamba, dampening hopes that planned countrywide demos will go ahead",
            "url": "https://www.newzimbabwe.com/l-dont-have-authority-to-sanction-protests-says-police-boss-mutamba-dampening-hopes-that-planned-countrywide-demos-will-go-ahead/",
            "content": "By Staff Reporter\n\nZIMBABWE Republic Police (ZRP) Commissioner-General Stephen Mutamba has poured cold water on planned countrywide protests, arguing that he doesnt have the authority to greenlight nor turn down applications for such.\n\nThe police boss assertion followed a notification by a grouping of concerned citizens, who intended to embark on nationwide demonstrations this Thursday, March 20, 2025, against President Emmerson Mnangagwas governments failure to tame the ongoing socio-economic and political crisis characterised by high unemployment, a comatose economy, among other ills.\n\nIn a letterrespondingto the citizens dated March 18, 2025 shared on the ZRP social media handle, Police Commissioner-General Mutamba said the authors had misdirected their communication.\n\nReference is made to a correspondence date 14 March 2025 on the above subject, which was served at my office on the same date at 1537 hours.\n\nHaving perused the said correspondence, and particularly noting that the author(s) intended to notify the Joint Operations Command (JOC) of an intended peaceful demonstration countrywide, l am certain that it has been misdirected to my office, wrote Mutamba.\n\nJOC is a body comprising of senior officers from the Zimbabwe National Army (ZNA), Air Force of Zimbabwe (AFZ), Zimbabwe Prisons and Correctional Services (ZPCS), Central Intelligence Organisation (CIO) and ZRP, which is responsible for the coordination of state security in Zimbabwe.\n\nMutamba stated that the countrys legislation excludes his office from regulating mass gatherings such as demonstrations.\n\nThe Legislature, in its wisdom, through the Maintenance of Peace and Order Act (MOPA)(Chapter 11:23), excludes my office from regulating public gatherings and demonstrations.\n\nInfact, MOPA clearly outlines how these rights must be exercised. I, therefore, urge the concerned citizens, through their representatives, to ensure full compliance with the laws of Zimbabwe. Be guided accordingly, further wrote Mutamba.\n\npic.twitter.com/agiRp3GIPP\n\n Zimbabwe Republic Police (@PoliceZimbabwe)March 19, 2025\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/15191414/Stephen-Mutamba-e1742370092198.jpeg",
            "description": "<p>By Staff Reporter ZIMBABWE Republic Police (ZRP) Commissioner-General Stephen Mutamba has poured cold water on planned countrywide protests, arguing that he doesn’t have the authority to greenlight nor turn down applications for such. The police boss’ assertion followed a notification by a grouping of concerned citizens, who intended to embark on nationwide demonstrations this Thursday,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-dont-have-authority-to-sanction-protests-says-police-boss-mutamba-dampening-hopes-that-planned-countrywide-demos-will-go-ahead/\">‘l don’t have authority to sanction protests’ – says police boss Mutamba, dampening hopes that planned countrywide demos will go ahead </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "Pair mutilates elderly man (89) before burning his corpse",
            "url": "https://www.newzimbabwe.com/pair-mutilates-elderly-man-89-before-burning-his-corpse/",
            "content": "By Staff Reporter\n\nIN a morbid act only fit for a horror movie, two Hwange men waylaid an elderly man, killed him and ferried his body to his homestead before torching the lifeless body inside a hut.\n\nThe High Court circuit sitting at Hwange found the pair of Events Ncube (31) and Keylop Ncube (22) guilty of murder and sentenced them to 25 years imprisonment each.\n\nCircumstances were that on April 1, 2024 at around 7 pm, the now deceased Sibusisiwe Dube (89) and Tapson Munsaka were drinking beer at Maphosa business centre. The two accused persons were also at the same joint but imbibing separately.\n\nThe court heard that at around 7 pm, Dube left the bar and started walking home.\n\nThe two accused persons trailed the elderly man and caught up with him at a secluded spot, where they struck him on the head using an axe for unknown reasons. They then ferried his lifeless body using a scotch cart and placed the deceaseds body in his kitchen hut before setting it on fire.\n\nThe remains, which were burnt beyond recognition, were discovered the following day.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/17050156/hut-on-fire.jpg",
            "description": "<p>By Staff Reporter IN a morbid act only fit for a horror movie, two Hwange men waylaid an elderly man, killed him and ferried his body to his homestead before torching the lifeless body inside a hut. The High Court circuit sitting at Hwange found the pair of Events Ncube (31) and Keylop Ncube (22)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pair-mutilates-elderly-man-89-before-burning-his-corpse/\">Pair mutilates elderly man (89) before burning his corpse </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        },
        {
            "title": "Man spared jail after killing brother in row over US$5",
            "url": "https://www.newzimbabwe.com/man-spared-jail-after-killing-brother-in-row-over-us5/",
            "content": "By Staff Reporter\n\nA CHIMANIMANI man has been convicted of killing his brother during a fight over how to share US$5 they got after completing amenial job.\n\nThe High Court at Mutare sentenced James Mwafunda to a wholly suspended sentence after downgrading the offence from murder to culpable homicide.\n\nThe accused person was dragged to court following the death of his sibling, Tawanda Mwafunda, last year.\n\nThe court heard that the accused person and the now deceased completed a piece job and were paid US$5.\n\nWhile drinking beer at Masori tuck shop, the brothers started arguing over how to share the money.\n\nThe heated exchange escalated into a physical fight, resulting in James grabbing a stone, which he used to strike his brother on the head. Tawanda sustained serious injury following the attack and bled profusely while lying on the ground.\n\nAfter noticing that he had inflicted harm on his brother, James rushed to look for help and eventually police ferried the now deceased to hospital, where he was pronounced dead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19055619/mutare.png",
            "description": "<p>By Staff Reporter A CHIMANIMANI man has been convicted of killing his brother during a fight over how to share US$5 they got after completing a menial job. The High Court at Mutare sentenced James Mwafunda to a wholly suspended sentence after downgrading the offence from murder to culpable homicide. The accused person was dragged to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-spared-jail-after-killing-brother-in-row-over-us5/\">Man spared jail after killing brother in row over US$5</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "19 Mar 2025"
        }
    ]
}