{
    "news": [
        {
            "title": "Zanu PF faction fights in Mnangagwa’s corner as 2030 agenda faces resistance from war vets",
            "url": "https://www.newzimbabwe.com/zanu-pf-faction-fights-in-mnangagwas-corner-as-2030-agenda-faces-resistance-from-war-vets/",
            "content": "By Staff Reporter\n\nA ZANU PF faction has reacted angrily to recent press statements by war veterans denouncing machinations by President Emmerson Mnangagwas hangers-on to perpetuate his stay in office beyond 2028.\n\nSince Mnangagwa seemingly declined overtures to extend his incumbency courtesy of a Zanu PF National Peoples Conference 2024 resolution now dubbed Resolution #1 arguing he is a constitutionalist, his loyalists have led the 2030 agenda begging him to remain in office.\n\nA coterie of war veterans led by Zanu PF Central Committee member, Blessed Runesu Geza popularly known as Bombshell for his acerbic tongue, was first to savage Mnangagwa calling him a failed leader, who must step down or face unspecified action.\n\nGezas Harare presser was followed by yet another one by Zimbabwe National Liberation War Veterans Association (ZNLWVA) organising secretary, Ben Ncube, who said ex-combatants are at variance with the 82-year-old Zanu PF leaders ill-conceived plan to amend the Constitution in order to extend his self-serving rule beyond his 2028 second term constitutional limit.\n\nThe temerity of the two cliques of rogue war veterans tempted political observers to conclude they were mercenaries for Vice President Constantino Chiwenga, who is the frontrunner to succeed Mnangagwa whose second and final term expires in 2028.\n\nRELATED:Mnangagwa is a failure and must go now, his 2030 agenda is illegal and treacherous  say war veterans miffed by rampant corruption\n\nHowever, in a lengthy address beamed on State television, ZBC, Tuesday night Information Minister, Jenfan Muswere singled out Geza for attack describing his vitriol as unwarranted and a display of hypocrisy.\n\nMuswere said government was not amused by the bitterness, indisciplined and reactionary and unmerited polemic sentiment shared by the war veterans seeking to undermine Mnangagwa.\n\nWe are concerned about the extent to which these individuals, while purporting to be members of the ruling party (and) bona fide members of the war veterans fraternity, are not using legal and relevant structures to discuss their grievances.\n\nIt is unfortunate that these individuals have also played to the whims of demonising the President for reasons best known to them.\n\nWhat is surprising is that such individuals, including Cde Blessed Geza, was one of the lead proponents of Resolution Number 1 of the 21st National Peoples Conference, which underscores the need for the President to remain in office until 2030. Cde Geza was among the conference delegates who lobbied for that resolution to be passed.\n\nTherefore, it is surprising that today he is turning his back on a resolution he helped create. It is unfortunate that the bitterness he suffered from the 2018 primary election defeat is now causing him to go as far as rewriting the history of the President, said Muswere.\n\nThe lnformation minister claims Gezas statement was surprising, especially considering that the Second Republic respects war veterans.\n\nThis sense of self-contradiction and hypocrisy goes against the principles of basic honesty we expect from senior citizens and genuine war veterans.\n\nThis charade is very disappointing considering the magnitude of economic transformation that Zimbabwe has enjoyed under the leadership of the President His Excellency Cde Dr Emmerson Dambudzo Mnangagwa.\n\nSection 84 of the Constitution of Zimbabwe obliges all State institutions and progressive Zimbabweans to recognise Rights of Veterans of the Liberation Struggle.\n\nThese architects of our national liberation include those who fought in the War of Liberation; the virtuous gallant Sons and Daughters of the Soil who assisted the fighters in the war of liberation; and anti-colonial visionaries who were imprisoned, detained and restricted for political reasons during the liberation struggle. Through their unflinching resolve, independent Zimbabwe was born.\n\nPursuant to this clear constitutional position, the Second Republic, under the revolutionary leadership of the President of the Republic of Zimbabwe, His Excellency Cde Dr E.D. Mnangagwa has championed a deliberate welfare support for the veterans of the liberation struggle, said Muswere.\n\nWar veterans, Muswere added, were recognised by establishing a stand-alone ministry to cater for their welfare. Zanu PF has also set up a parallel wing of ex-freedom fighters.\n\nThis, Muswere claimed, was to ensure the total inclusion and participation of veterans of the liberation struggle in the economy.\n\nThe actualisation of this constitutional recognition of this important class of distinguished patriots has been facilitated by the establishment of a standalone ministry which caters for the socio-economic needs of veterans of the liberation struggle.\n\nFor the first time, four decades after the attainment of Zimbabwes independence, the Second Republic strengthened the constitutional recognition of the veterans of the liberation struggle by ensuring that the ruling Zanu PF now has a stand-alone War Veterans Wing, said Muswere, adding Mnangagwa had championed over 8,000 developmental projects since assuming office in 2017.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By  Staff Reporter A ZANU PF faction has reacted angrily to recent press statements by war veterans denouncing machinations by President Emmerson Mnangagwa’s hangers-on to perpetuate his stay in office beyond 2028. Since Mnangagwa seemingly declined overtures to extend his incumbency courtesy of a Zanu PF National People’s Conference 2024 resolution now dubbed ‘Resolution #1’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-faction-fights-in-mnangagwas-corner-as-2030-agenda-faces-resistance-from-war-vets/\">Zanu PF faction fights in Mnangagwa’s corner as 2030 agenda faces resistance from war vets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "US$40,000 robbery suspect’s mom, dad jailed for hiding stolen money in fridge",
            "url": "https://www.newzimbabwe.com/us40000-robbery-suspects-mom-dad-jailed-for-hiding-stolen-money-in-fridge/",
            "content": "By Staff Reporter\n\nTHE parents of a fugitive suspect have been convicted and jailed for concealing stolen money linked to a US$40,000 robbery committed by their son in Kwekwe.\n\nJohn Tuhwe (51) and his wife, Gciniso Ndlovu (43), appeared at Kwekwe Magistrates Court this week facing charges of concealing proceeds of crime.\n\nFollowing a full trial, the pair were found guilty and sentenced to six months imprisonment each.\n\nProsecutors proved beyond reasonable doubt that Tuhwe and Ndlovu, parents of Calvin Tuhwe who is still at large, received and stashed US$680 inside a wardrobe. Further, they wrapped US$5,200 in a plastic bag containing meat and put it in a fridge compartment.\n\nThe court heard that Calvin and his gang had on May 15, 2024, broken into an unnamed complainants house and stole the cash.\n\nThe fugitive suspect shared the loot with his parents before fleeing to an unknown destination.\n\nThe court found both parents blameworthy for knowingly assisting in concealing the whereabouts of stolen funds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/29060624/kwekwe-mag.jpg",
            "description": "<p>By Staff Reporter THE parents of a fugitive suspect have been convicted and jailed for concealing stolen money linked to a US$40,000 robbery committed by their son in Kwekwe. John Tuhwe (51) and his wife, Gciniso Ndlovu (43), appeared at Kwekwe Magistrates Court this week facing charges of concealing proceeds of crime. Following a full</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us40000-robbery-suspects-mom-dad-jailed-for-hiding-stolen-money-in-fridge/\">US$40,000 robbery suspect’s mom, dad jailed for hiding stolen money in fridge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "Govt allows Zunaid Moti’s African Chrome Fields to import 14 million litres of diesel duty-free",
            "url": "https://www.newzimbabwe.com/govt-allows-zunaid-motis-african-chrome-fields-to-import-14-million-litres-of-diesel-duty-free/",
            "content": "By Alois Vinga\n\nFINANCE and Investment Promotion Minister, Mthuli Ncube has extended South African wheeler-dealer Zunaid Motis African Chrome Fields national project status, allowing it to import 13,95 million litres of diesel duty-free up to December 2026.\n\nThe company was granted the national project status a decade ago, meaning it can procure fuel and machinery duty-free, a decision which raised eyebrows. Back then it could import 12 million litres duty-free and the extension to 2026 allows it an additional 1.95 million litres.\n\nMoti made headlines in 2023 after an independent investigation exposed a US$120 million chrome scandal involving President Emmerson Mnangagwa, his deputy Constantino Chiwenga and local tycoon Kuda Tagwireyi.\n\nAccording to the investigation by the Sentry organisation, the deal was struck on November 17, 2017, during the week-long coup that brought President Mnangagwa and Vice President Chiwenga to power. The Sentry is an investigative and policy organization that seeks to disable multinational predatory networks that benefit from violent conflict, repression, and kleptocracy.\n\nThe report made revelations that Moti paid $3 million to firms linked to Mnangagwa and Chiwenga following the signing of the chrome deal.\n\nKnown for his addiction to fast cars and cigars, Moti, dabbled in property development and private jets, but his main business in Zimbabwe was processing chrome.1 In 2014 he bought 70% of African Chrome Fields (ACF) and in 2015 applied for national project status which was granted that same year.\n\nRELATED:\n\nThe notice on the duty waiver was rubber-stamped by the Finance and Investment Promotion Minister, Mthuli Ncube under the countrys Customs regulations.\n\nIt is hereby notified that the Minister of Finance, Economic Development and Investment Promotion has in terms of Section 235 as read with Section 120 of the Customs and Excise Act made the following regulations.\n\nThe Customs and Excise Suspension Regulations, 2003, published in SI 257 of 2003 are amended in section 9 BB as follows- in subsection 2 by the deletion of the words 1stJanuary 2023 to 21stJanuary 2024 and substitution with the words 1stJanuary 2025 to 21stJanuary 2026; approved beneficiary of power generation projects eligible for suspension of duty, read SI6 of 2025.\n\nThe development comes at a time when the Civil Society has castigated some Chrome miners for leaving behind a trail of destruction after tapping into the countrys underneath.\n\nZimbabwe is home to some 19% of global chrome ore reserves  the second largest in the world. Its chrome store is also of a higher grade than other international sources, with an exceptional chrome-to-iron ratio of 2:1.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/22135546/zunaid-moti-mnangagwa.jpeg",
            "description": "<p>By Alois Vinga FINANCE and Investment Promotion Minister, Mthuli Ncube has extended South African wheeler-dealer Zunaid Moti’s African Chrome Fields national project status, allowing it to import 13,95 million litres of diesel duty-free up to December 2026. The company was granted the national project status a decade ago, meaning it can procure fuel and machinery</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-allows-zunaid-motis-african-chrome-fields-to-import-14-million-litres-of-diesel-duty-free/\">Govt allows Zunaid Moti’s African Chrome Fields to import 14 million litres of diesel duty-free</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "Volatile exchange rates push monthly inflation to 11,5%",
            "url": "https://www.newzimbabwe.com/volatile-exchange-rates-push-monthly-inflation-to-115/",
            "content": "By Alois Vinga\n\nBOTH legal currencies, the Zimbabwe Gold (ZWG) and the US$ succumbed to significant inflationary pressures in January 2025, signifying the fact that the local economy remains in deep-seated problems.\n\nData released by the Zimbabwe National Statistic Agency (Zimstat) Tuesday shows that the Weighted month-on-month inflation rate was 11,5% in January 2025, gaining 10.5 percentage points on the December 2024 rate of 1.1 percent.\n\nThe US$ month-on-month inflation rate was 11.5%t in January 2025, gaining 10,9% on the December 2024 rate of 0,6%.On the other hand, the ZWG month-on-month inflation rate was 10,5% in January 2025, gaining 6,8% on the December 2024 rate of 3,7%, said Zimstat.\n\nThe statistics agency said the year-on-year inflation rate (annual percentage change) for January 2025 as measured by the all-items USD Consumer Price Index (CPI), was 14,6 %.\n\nFor January 2025, the Weighted CPI for Food and Non-Alcoholic Beverages contributed mostly to the month-on-month change in index (inflation rate) by a magnitude of 4.7%, followed by Housing, Water, Electricity, Gas & Other Fuels with a magnitude of 3.9%.\n\nExperts attribute the current surge of month-on-month inflation to exchange rate volatility which has seen formal retailers adjusting US$ prices to cover the gap created by the formal exchange rate which is lagging behind the widely used parallel market rates.\n\nCurrently, the formal exchange rate stand at US$1:ZWG26 as opposed to about US$1:ZWG38 obtaining on the parallel market.\n\nTo make matters worse, formal retailers do not always stick to the exact parallel market rate as they peg it much higher to hedge against uncertainties.\n\nZimstat believes government spending could have a positive impact as it meant more money would be poured into various projects, which would stimulate economic growth in the months ahead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga BOTH legal currencies, the Zimbabwe Gold (ZWG) and the US$ succumbed to significant inflationary pressures in January 2025, signifying the fact that the local economy remains in deep-seated problems. Data released by the Zimbabwe National Statistic Agency (Zimstat) Tuesday shows that the Weighted month-on-month inflation rate was 11,5%  in January 2025, gaining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/volatile-exchange-rates-push-monthly-inflation-to-115/\">Volatile exchange rates push monthly inflation to 11,5%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "ZIFA Normalization Committee shoulders blame for former players’ defeat in recent elections",
            "url": "https://www.newzimbabwe.com/zifa-normalization-committee-shoulders-blame-for-former-players-defeat-in-recent-elections/",
            "content": "By Sport Reporter\n\nThe ZIFA Normalization Committees outgoing chairperson Lincoln Mutasa says the body is partly to blame after all former players who contested in the ZIFA election held on Saturday lost.\n\nThe election had seven former players contesting various posts that were making up the new executive.\n\nMakwinji Soma Phiri was the only one contesting for the presidents post, only to get zero votes.\n\nThe former Dynamos player was in the same race with Marshall Gore (1 vote), Twine Phiri (4), Philemon Machana (6) and winning candidate Nqobile Magwizi (61).\n\nCompeting for the ZIFA board member post were 39 candidates five of them being former players who garnered a combined 5 votes.\n\nFormer Warriors and Dynamos coach Sunday Chidzambwa recorded the highest amongst the group with three votes, while CAPS United legend Alois Bunjira had two votes.\n\nIt was zero votes for the other three contesting former players  Walter Musanhu, Terrence Malunga and Harlington Shereni.\n\nCommenting on former players defeat in the election, outgoing ZIFA Normalization Committe chairperson Lincoln Mutasa said, I think we as the Normalization Committe we should take some of the blame for that.\n\nWhen we insisted that we wanted a woman occupying one of the vice presidents seats and one in the six-member board team, we should have also done the same for former players.\n\nHopefully the new board will try and work to normalize that aspect.\n\nAlso, I think as former players we need to work on how we market ourselves because its not all about being a big brand in soccer for you to have votes.\n\nButtressing Mutasas point, football analyst Forget Maringa encouraged the new executive to amend the constitution and make sure it has one seat within the board reserved for a former player.\n\nHonestly as long as we have these corrupt councillors voting, former players need to have their own special seat in the board which they compete for.\n\nWhat recently happened is enough testimony that if you do not have the money you will not win the election and its not a secret that our players do not have the financial muscle, he said.\n\nZimbabwe is yet to have a former player leading ZIFA as a president or vice in its entire football history.\n\nThe only one to have occupied the football associations top post is former Dynamos player, Lincoln Mutasa, who was appointed by FIFA to lead the outgoing Normalization Committee.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/05201204/ZIFA-Normalisation-Committee-chairman-Lincoln-Mutasa.png",
            "description": "<p>By Sport Reporter The ZIFA Normalization Committee’s outgoing chairperson Lincoln Mutasa says the body is partly to blame after all former players who contested in the ZIFA election held on Saturday lost. The election had seven former players contesting various posts that were making up the new executive. Makwinji Soma Phiri was the only one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-normalization-committee-shoulders-blame-for-former-players-defeat-in-recent-elections/\">ZIFA Normalization Committee shoulders blame for former players’ defeat in recent elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "Zimbabwe records 12,483 common diarrhoea cases, 12 deaths in one week",
            "url": "https://www.newzimbabwe.com/zimbabwe-records-12483-common-diarrhoea-cases-12-deaths-in-one-week/",
            "content": "By Staff Reporter\n\nA total of 12,483 cases of common diarrhoea, including 12 deaths, were recorded across the country in the week ending January 12. Of the reported cases, 2,867 involved children under the age of five.\n\nAccording to the Health Ministry, seven of the deaths were from Harare, while the remaining five were from other parts of the country.\n\nWeekly disease surveillance report for the week ending on 12 January 2025.\n\n6506 common diarrhoea cases and seven deaths were reported this week. The deaths were reported from Sally Mugabe Hospital (6), andParirenyatwa Group of Hospital (1) in Harare Metropolitan Province.\n\nOf the reported cases of common diarrhoea, 2867 were under five years of age. The provinces that reported the highest number of cases were Mash Central (932) and Mashonaland West (1877).\n\nCumulative figures for diarrhoea are 12483 cases and 12 deaths, the ministry said in a statement.\n\nThe majority of Zimbabwes population is living without running tap water in their homes.\n\nAs a result, many have resorted to digging shallow wells and boreholes, which are tainted by raw sewage leaking from broken pipes.\n\nThis has triggered repeated outbreaks of waterborne illnesses such as cholera and diarrhoea.\n\nMeanwhile, the Health Ministry also recorded 1,138 malaria cases and four deaths in the same week, with Guruve being the most affected, reporting 639 cases and one death.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/08044936/mombeshora.webp",
            "description": "<p>By Staff Reporter A total of 12,483 cases of common diarrhoea, including 12 deaths, were recorded across the country in the week ending January 12. Of the reported cases, 2,867 involved children under the age of five. According to the Health Ministry, seven of the deaths were from Harare, while the remaining five were from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-records-12483-common-diarrhoea-cases-12-deaths-in-one-week/\">Zimbabwe records 12,483 common diarrhoea cases, 12 deaths in one week</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "Harare man to pay ex-wife US$32,500 after cheating her on property sharing",
            "url": "https://www.newzimbabwe.com/harare-man-to-pay-ex-wife-us32500-after-cheating-her-on-property-sharing/",
            "content": "By Staff Reporter\n\nThe High Court has ordered a Harare man to pay his ex-wife US$32,500 being half of the money obtained after he sold their unfinished house when they separated in 2019.\n\nKudakwashe Naison had refused to give his ex, Letwin Kadiyo the money arguing that he sorely ran his business from which the money to buy the stand was raised adding that he used the money realised from selling the stand to pay back a loan and to look after the family because his business was down.\n\nHowever, in handing down her ruling, High Court judge, Justice Ammy Tsanga ruled that each party has a real right to an undivided half share of the property.\n\nTsanga said it is common cause that they were husband and wife customarily which translates to a partnership.\n\nThis was in reality the partnership that they had. It is also not in dispute that the property they owned was in both their names and that it was sold for US$65,000.00.\n\nIn my view even if the court accepts that they were not in a business partnership, he cannot escape this obvious reality that she owned half of what they considered the marital home.\n\nBy registering the property in both names she obtained a half share.\n\nAlso, since there was no business partnership in the strict sense of that word relating to his cell phone business, the loan to Anita had nothing to do with the plaintiff.\n\nHe could not have used her half share of the proceeds from the sale of the property in which he owned half of it, to cover his own business loan.\n\nHe owes her US$32,500.00, ruled the judge before ordering Naison to pay the amount over a period of six months or such period as the parties may agree between themselves in writing.\n\nThe court heard the couple fell in love in 2013 and started living together the following year.\n\nKadiyo told the court that she gave birth to their first child in 2015 and stopped going to work.\n\nParties agreed to start a joint venture, selling mobile phones, the court heard.\n\nKadiyo said she contributed US$500 to this effect.\n\nShe said they obtained a US$35,000 loan from one Anita based in China which they paid within a month.\n\nThe couple according to Kadiya would make around US$7,000 everyday from their sales.\n\nShe would occasionally go to the shops when her husband was away on business trips as she was saddled with the responsibility of looking after a young child.\n\nThey then bought a stand in Haydon Park and started building up to the roof level whentheydecided to sell the house.\n\nShe also testified that at the time of their separation in 2023, they had cell phone stock worth US$40,000.00.\n\nKadiya had claimed US$20,000.00 as her half share of that stock but she did not have proof to that effect.\n\nIn his evidence, Naison denied that they had a business partnership.\n\nHe denied that she had ever given him US$500.00 to order more stock.\n\nNaison said the plaintiff knew of his business as a wife but that this did not make her a business partner.\n\nHe however admitted that they had bought a stand, which had been put in both their names.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter The High Court has ordered a Harare man to pay his ex-wife US$32,500 being half of the money obtained after he sold their unfinished house when they separated in 2019. Kudakwashe Naison had refused to give his ex, Letwin Kadiyo the money arguing that he sorely ran his business from which the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-man-to-pay-ex-wife-us32500-after-cheating-her-on-property-sharing/\">Harare man to pay ex-wife US$32,500 after cheating her on property sharing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "USAID suspends HIV, malaria and TB programmes in Zimbabwe",
            "url": "https://www.newzimbabwe.com/usaid-suspends-hiv-malaria-and-tb-programmes-in-zimbabwe/",
            "content": "By James Muonwa\n\nTHE United States Agency for International Development (USAID) has ordered all recipients of its funds to cease operations forthwith in Zimbabwe.\n\nThe latest development follows newly-elected U.S. President Donald Trumps executive orders of reevaluating and realigning his countrys foreign aid.\n\nUSAID has long been a significant contributor to Zimbabwes development initiatives. In 2024 alone, USAIDs funding to Zimbabwe amounted to approximately US$360 million, supporting a wide array of programmes spanning health, agriculture, and governance sectors.\n\nIn a January 27, 2025 notice to grant recipients, Andrea M. Plucknett, USAID Zimbabwe supervisory agreement officer, said recipients of funds must immediately suspend activities.\n\nDear implementing Partner: Effective January 24, 2025, the Agreement Officer hereby issues an order for the recipient to immediately suspend performance under the agreement your organisation was awarded by USAID/Zimbabwe.\n\nThe recipient shall take all reasonable steps to minimize the incurrence of costs allocable to the agreement during the period of award suspension, wrote Plucknett.\n\nRELATED:\n\nMain grant recipients and sub-grantees were also instructed not to resume work under agreements entered into with USAID until there is communication to lift the suspension.\n\nThe recipient shall not resume work under this agreement until notification has been received in writing from the Agreement Officer that this award suspension has been cancelled, further wrote Plucknett.\n\nAlso, all diversity, equity, inclusion, and accessibility (DEIA) initiatives being undertaken in Zimbabwe have been stopped.\n\nAll DEIA activities under all ongoing awards are to cease immediately. In light of the above, please have your authorised representative certify that any DEIA-related activities have completely ceased.\n\nThe Trump administration has moved to stop the supply of lifesaving drugs for HIV, malaria and tuberculosis, as well as medical supplies for newborn babies, in countries supported by USAID around the globe.\n\nAccording to the American Civil Liberties Union (ACLU), Trump administrations three executive orders targeting DEIA initiatives take a shock and awe approach that upends longstanding, bipartisan federal policy meant to open doors that had been unfairly closed.\n\nIn his first few days, Trump is undertaking a deliberate effort to obfuscate and weaponise civil rights laws that address discrimination and ensure everyone has a fair chance to compete, whether its for a job, a promotion, or an education.\n\nWith these actions, the administration is not only undoing decades of federal anti-discrimination policy, spanning Democratic and Republican presidential administrations alike but also marshalling federal enforcement agencies to bully both private and government entities into abandoning legal efforts to promote equity and remedy systemic discrimination.\n\nTrumps executive orders undermine obligations that firms doing business with the U.S. government and receiving billions in public dollars are held to the highest standards in remedying and preventing bias.\n\nACLU says for decades, federal policies have supported efforts to promote equal opportunity, enforced by administrations from both parties.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/07030414/USAID.jpg",
            "description": "<p>By James Muonwa THE United States Agency for International Development (USAID) has ordered all recipients of its funds to cease operations forthwith in Zimbabwe. The latest development follows newly-elected U.S. President Donald Trump’s executive orders of reevaluating and realigning his country’s foreign aid. USAID has long been a significant contributor to Zimbabwe’s development initiatives. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/usaid-suspends-hiv-malaria-and-tb-programmes-in-zimbabwe/\">USAID suspends HIV, malaria and TB programmes in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "Police vows action against corrupt officers aiding lawlessness on roads",
            "url": "https://www.newzimbabwe.com/police-vows-action-against-corrupt-officers-aiding-lawlessness-on-roads/",
            "content": "By Thandiwe Garusa\n\nTHEZimbabwe Republic Policehas warned that it will take decisive action against corrupt elements within its ranks who are colluding with unruly public transport operators on the roads.\n\nThis follows several reported cases of corruption which include viral videos of some police officers taking bribes to allow unfit vehicles to operate.\n\nIn a statement Tuesday, police spokesperson Commissioner Paul Nyathi urged passengers and the travelling public not to board rundown or dilapidated kombis, including those without registration plates or with windows or windscreens covered by cardboard boxes or other materials.\n\nThe ZRP command is taking decisive action against corrupt elements within the force. This includes some unregistered kombi operators who are colluding with unruly individuals to perpetuate corrupt activities on the roads.\n\nIn this regard, no unregistered kombis or pirate taxis will be permitted to operate as public service vehicles.\n\nThe Police urges all kombi owners to set an example by ensuring that anyone intending to run a public service vehicle business fully complies with the countrys road rules and regulations.\n\nIn other words, all kombis operating on the roads must be registered and licensed through the relevant government authorities, Nyathi added.\n\nNyathi also said the public should assist in promoting public safety by avoiding boarding or waiting for transport at undesignated points, as such practices disrupt the smooth flow of traffic.\n\nThe police also warned kombis from Chitungwiza against dropping off passengers from the Chitungwiza route before Seke Bridge.\n\nThe Police is also taking strong action against unregistered kombis operating on the Chitungwiza-Harare Central Business District route and dropping passengers before the Seke Bridge.\n\nThe Commissioner-General of Police, Stephen Mutamba, has directed Police Commanders to ensure that duly registered and compliant kombis are allowed passage at Police checkpoints without unnecessary inconvenience, Nyathi said.\n\nCases of armed hit-and-run accidents, robberies, kidnappings and rape, are on the rise and in most instances perpetrators use unregistered vehicles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Republic Police has warned that it will take decisive action against corrupt elements within its ranks who are colluding with unruly public transport operators on the roads. This follows several reported cases of corruption which include viral videos of some police officers taking bribes to allow unfit vehicles to operate. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-vows-action-against-corrupt-officers-aiding-lawlessness-on-roads/\">Police vows action against corrupt officers aiding lawlessness on roads</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        },
        {
            "title": "ICT Minister Mavetera under fire for leading Chiwenga diss song at National Shrine; VP’s supporters label her “reckless, provocative”",
            "url": "https://www.newzimbabwe.com/ict-minister-mavetera-under-fire-for-leading-chiwenga-diss-song-at-national-shrine-vps-supporters-label-her-reckless-provocative/",
            "content": "By Staff Reporter\n\nICT Minister Tatenda Mavetera is facing a firestorm of criticism for leading a provocative song targeting Acting President General Constantino Chiwenga. This dramatic scene unfolded yesterday at the National Heroes Acre in Harare, exposing the deep fault lines within Zanu PF.\n\nMavetera, who formed the Young Women for ED group ahead of the disputed 2023 elections, was seen in the stands leading her group in a song with the lyrics: mupanduki mupanduki nguva yakwana, chera mwena which translates to traitor, traitor, your time is up.This song, like a dagger aimed at the heart, indirectly accused Acting President Chiwenga of being a traitor.\n\nThe burial of national hero Justin Mupamhanga became a stage for open Zanu PF infighting, much to the embarrassment of the party and government.\n\nThe division was evident: two groups in the stands, as different as night and day. One group, dressed in pink Young Women For ED t-shirts and led by Mavetera, clashed with another group sharing space with soldiers.\n\nMaveteras group also waved faux crocodiles in the air, a display of loyalty to President Emmerson Mnangagwa.\n\nThese supporters of Mavetera clashed head-on with the other group, who loudly praised Chiwenga and sang in his support, with the refrain: siyanai naye Chiwenga munovengerei or leave Chiwenga alone, why do you hate him?. This pro-Chiwenga group grew even more fervent every time Chiwenga spoke against corruption  their support, like a tidal wave, building with each denunciation.\n\nNtokozo Msipha, Secretary-General of the General Chiwenga Voluntary Supporters Association, stated that Mavetera had crossed the line, calling her actions at the national shrine not just reckless but provocative.\n\nIn a statement Tuesday morning, Msipha said: Hon Minister, you have crossed the line. This must never happen again. Let this statement serve as a final warning. Discipline, respect and loyalty are the cornerstones of leadership. Those who fail to uphold them will find themselves on the wrong side of history.\n\nLast week, during the burial of three other national heroes, Chiwenga himself had described disrespect as a mortal sin which he said cannot be forgiven on earth and in heaven  a pronouncement now hanging over this conflict like a dark cloud.\n\nClive Malunga, a staunch critic of the Mnangagwa 2030 agenda and a veteran of the liberation struggle, told NewZimbabwe.Com that Mavetera was a disrespectful and a Mnangagwa bootlicker who has neglected her duties, focusing instead on pleasing one man over the needs of the country.\n\nThe calibre of ministers that we have in the current government are just bootlickers and they are always bent on pleasing an individual over the citizens of Zimbabwe. Mavetera should stop that kind of 1950s politics. She should concentrate on her ministry and constituency, Malunga said, his words dripping with disdain.\n\nPolitical analyst Lazurus Sauti, a lecturer at the University of Zimbabwe, said that Mnangagwas cabinet was not formed on merit basis.\n\nMost, if not all, public office holders are not chosen based on merit. So, they lack knowledge on how to formulate policies that can transform our economy in many respects. Mavetera is a prime example. She was busy at the national shrine dancing kongonya dissing political opponents instead of promoting ICT policies, he added, his tone critical.\n\nAttempts to get a comment from Minister Mavetera proved unsuccessful, with her mobile phone going unanswered.\n\nZanu PF spokesperson Farai Marapira distanced the party from Maveteras actions.\n\nYoung Women for ED is an affiliate of the party Zanu PF and it is an independent juristic person therefore it has its own structures that speak and defend on its own behalf. I speak on behalf of the party, Marapira said.\n\nThis event has thrown the simmering tensions within Zanu PF into sharp relief, revealing a party divided and struggling to contain its internal conflicts. The political stage is set for more drama as the rival factions continue to threaten tear each other apart.\n\nSocial media was set ablaze this morning, as many erupted with a cacophony of commentary and fervent debate surrounding Maveteras conduct at the National Heroes Acre yesterday.\n\nThe incandescent display of factionalism at the hallowed grounds of the national shrine has spurred a maelstrom of reactions, with many suggesting that the minister should perhaps commence preparations for an expeditious departure from Zimbabwe.\n\nThese voices, fuelled by historical precedent, posit that her exit strategy should mirror the abrupt exoduses of Professor Jonathan Moyo and his coterie of G40 kingpins who fled the nation during the tumultuous Operation Restore Legacy in 2017.\n\nThis military-led intervention forced the resignation of the late President Robert Mugabe, leaving key loyalists to his wife, Grace Mugabe, under the G40 banner scrambling for sanctuary in disparate locales beyond the borders of Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/28115514/MAVETERA.jpg",
            "description": "<p>By Staff Reporter ICT Minister Tatenda Mavetera is facing a firestorm of criticism for leading a provocative song targeting Acting President General Constantino Chiwenga. This dramatic scene unfolded yesterday at the National Heroes Acre in Harare, exposing the deep fault lines within Zanu PF. Mavetera, who formed the “Young Women for ED” group ahead of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ict-minister-mavetera-under-fire-for-leading-chiwenga-diss-song-at-national-shrine-vps-supporters-label-her-reckless-provocative/\">ICT Minister Mavetera under fire for leading Chiwenga diss song at National Shrine; VP’s supporters label her “reckless, provocative”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "29 Jan 2025"
        }
    ]
}