{
    "news": [
        {
            "title": "Warriors prospect Mheuka makes debut for Chelsea",
            "url": "https://www.newzimbabwe.com/warriors-prospect-mheuka-makes-debut-for-chelsea/",
            "content": "By Sport Reporter\n\nZimbabwean youngster Shumirai Mheuka on Thursday night made his debut for English Premier Soccer League side Chelsea in the Europa Conference League against Astana.\n\nThe 17-year-old came in from the bench in the 76th minute in an away match, which Chelsea won 3-1.\n\nBorn by Zimbabwean parents based in England, his father Malcolm Mheuka is a former Zimbabwean professional footballer who played for the now-defunct Zimbabwe Saints.\n\nMheuka joined Chelseas development side in 2022 coming from Brighton and Hove Academy.\n\nThe young forward recently committed to Chelsea for four more years as he signed a new contract which will see him at the Blues until 2027.\n\nAt the international level, Mheuka is eligible to play for either Zimbabwe or England.\n\nAlready the rising 17-year-old center forward boasts of 10 international goals at junior level which has scored playing for Englands under 15, 17, and 19.\n\nMheuka recently proved to be one for the future in October when he scored on his debut for Englands under-19 against France, before scoring his second goal for the side against Spain in his second cap.\n\nAlthough he is now full-time with Chelsea under 21 side, Mheuka is one of the few juniors promoted by Enzo Maresca to the senior team after a good 2023 -24 season campaign in which he scored 12 goals in 20 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/13060540/WhatsApp-Image-2024-12-13-at-00.07.17.jpeg",
            "description": "<p>By Sport Reporter Zimbabwean youngster Shumirai Mheuka on Thursday night made his debut for English Premier Soccer League side Chelsea in the Europa Conference League against Astana. The 17-year-old came in from the bench in the 76th minute in an away match, which Chelsea won 3-1. Born by Zimbabwean parents based in England, his father</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-prospect-mheuka-makes-debut-for-chelsea/\">Warriors prospect Mheuka makes debut for Chelsea</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Mnangagwa makes maiden visit to SADC Secretariat in Botswana",
            "url": "https://www.newzimbabwe.com/mnangagwa-makes-maiden-visit-to-sadc-secretariat-in-botswana/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has embarked on his maiden visit to Botswana in his capacity as chairman of the Southern African Development Community (SADC), where he is expected to tour the secretariat headquarters.\n\nAs is tradition, SADC chairpersons visit the secretariat to engage with management and address staff.\n\nMnangagwa will officiate at two other events, including the groundbreaking ceremony of the regional blocs logistics nerve centre.\n\nAccording to media reports, the Zanu PF leader is scheduled to meet and engage with the secretariat staff and unveil the recently purchased SADC Secretariat Headquarters Building. He will also preside over a ground-breaking ceremony at the construction site of the SADC Standby Force Regional Logistics Depot (RLD).\n\nMnangagwa will proceed to the Julius Nyerere SADC Library, where he will acquaint himself with the SADC History Collection. This will be followed by the unveiling of the Visiting Placard by the regional bloc chairperson.\n\nHe will proceed to confer with the SADC management team, where Deputy Executive Secretary for Corporate Affairs Judith Kateera will brief him on the mandate, functions, and structure of the secretariat and the division of responsibilities.\n\nMnangagwa will also be appraised on the priorities of SADC, and the overall status of regional integration in the region (status, emerging issues, and recommendations).\n\nThe SADC chair will then proceed to proffer guidance on the implementation of the blocs programmes going forward and preside over a meeting with all SADC secretariat staff accompanied by Botswana President Duma Boko, an awkward arrangement the octogenarian cannot conveniently avoid.\n\nThereafter, there will be a ceremonial hand-over of the SADC Headquarters Building from Bongwe Investments Proprietary Limited to Mnangagwa as chairman of the regional bloc, on behalf of the regions Heads of State and Government.\n\nPrior to its handover, the edifice was under management through a Public-Private-Partnership (PPP) Agreement involving SADC, Bongwe Investments (Proprietary) Limited as the private party and the Botswana government as a guarantor to the PPP arrangement.\n\nMnangagwa and newly-elected former opposition leader Boko will proceed to preside over the grounding-breaking ceremony of the Regional Logistics Depot at Rasesa village, located about 40km from Gaborone.\n\nThe RLD will serve as a storage for materials, equipment and end-user stocks for use by the SADC Standby Force when undertaking mandated peace support and humanitarian missions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/19090404/mnangagwa.jpg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has embarked on his maiden visit to Botswana in his capacity as chairman of the Southern African Development Community (SADC), where he is expected to tour the secretariat headquarters. As is tradition, SADC chairpersons visit the secretariat to engage with management and address staff. Mnangagwa will officiate at two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-makes-maiden-visit-to-sadc-secretariat-in-botswana/\">Mnangagwa makes maiden visit to SADC Secretariat in Botswana </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Development Literacy Institute hosts AI training for entrepreneurs",
            "url": "https://www.newzimbabwe.com/development-literacy-institute-hosts-ai-training-for-entrepreneurs/",
            "content": "By Staff Reporter\n\nIn a bid to empower young entrepreneurs with the skills needed to drive Zimbabwes transition to a digital economy, the Development Literacy Institute recently hosted a month-long AI training program.\n\nThe program, which was conducted in collaboration with Zimbabwe Information and Technology Empowerment Trust (ZITET), brought together a diverse group of young entrepreneurs who were eager to learn about transformative technologies like AI, blockchain, and FinTech.\n\nAccording to Nozipho Lorraine Nkau, Programme Manager at DLI, the program aimed to equip participants with the knowledge and skills needed to leverage AI and other emerging technologies to create innovative products and services that address pressing local challenges.\n\nBy leveraging AI, young entrepreneurs can create innovative products and services that address pressing local challenges, including those in agriculture, healthcare, and transportation, said Nkau.\n\nNkau added that the program had successfully brought together a diverse group of young people, providing them with an opportunity to not only learn but also exchange knowledge and ideas on AI, economic development, and law.\n\nThis exchange has proven to be a valuable platform for collaboration and networking, said Nkau.\n\nNkau also highlighted the importance of integrating technology, law, and economic development, saying that experts from various fields had shared insights on the importance of these intersections.\n\nThese contributions have deepened participants understanding of how these sectors intersect and the critical role they play in driving progress, said Nkau.\n\nNkau concluded by saying that the program had unlocked new opportunities for young people in Zimbabwe to contribute to economic growth, enhance legal systems, and foster innovation.\n\nAs a result, the INTELDEVLAW program has unlocked new opportunities for young people in Zimbabwe to contribute to economic growth, enhance legal systems, and foster innovation, all while preparing them for the future of a rapidly evolving world, said Nkau.\n\nBuhlebenkosi Sibanda who is responsible for Finance at DLI, also weighed in on the program, saying that it had delved into transformative technologies like AI, blockchain, and FinTech.\n\nThe month-long training, hosted by the Development Literacy Institute and ZITET, delved into transformative technologies like AI, blockchain, and FinTech, said Sibanda.\n\nSibanda added that participants had explored how these innovations could drive Zimbabwes transition to a digital economy.\n\nAs Zimbabwe forges ahead in its journey toward a digital economy, initiatives like this training lay the foundation for sustainable growth, ensuring the nation remains competitive in a tech-driven world, said Sibanda.\n\nThe Development Literacy Institute focuses on education for sustainable development, which aligns with the National Development Strategy (NDS1).\n\nThe program included experts from different fields who focused on how AI, blockchain, and other emerging technologies can drive sustainable economic growth.\n\nFurthermore, the training promoted innovation as participants were equipped with knowledge of Zimbabwes legal frameworks regulating technology globally and relevant examples were used to explain the role of emerging technologies in economic development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/13055933/WhatsApp-Image-2024-12-12-at-14.51.16.jpeg",
            "description": "<p>By Staff Reporter In a bid to empower young entrepreneurs with the skills needed to drive Zimbabwe’s transition to a digital economy, the Development Literacy Institute recently hosted a month-long AI training program. The program, which was conducted in collaboration with Zimbabwe Information and Technology Empowerment Trust (ZITET), brought together a diverse group of young</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/development-literacy-institute-hosts-ai-training-for-entrepreneurs/\">Development Literacy Institute hosts AI training for entrepreneurs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Death Penalty Abolition Bill sails through Senate",
            "url": "https://www.newzimbabwe.com/death-penalty-abolition-bill-sails-through-senate/",
            "content": "By Anna Chibamu\n\nTHE Death Penalty Abolition Bill sailed through the Senate and now awaits President Emmerson Mnangagwas approval to become law.\n\nThe last execution in Zimbabwe was nearly two decades ago in 2005 and at the moment, Zimbabwe has over 60 prisoners on death row.\n\nMnangagwa has expressed he is against capital punishment, sharing his own experience when his death sentence for blowing up a train during the 1960s war was commuted to 10 years in prison.\n\nAfter a lengthy debate, the Bill was read for the second time with few amendments and finally read for the third time without any amendments before being passed.\n\nPrior to the Senates approval of the Bill, Justice Minister Ziyambi Ziyambi warned Senate members about its sensitivity: I stand before this House to seek the abolition of the death penalty. The deliberation will be emotional.\n\nNot of this or that other human being but as part of human beings whose crimes are such of a heinous nature that our society is called to legislate that they must die if found guilty by the court of law, Ziyambi told the acting Senate President.\n\nHe added; Almost all cultures in Zimbabwe have marked out certain crimes to be deserving capital punishment. Our indigenous culture had less problems and messier than any foreign culture. The deserving of death has been perceived to be inhuman.\n\nCulturally and historically, before colonisers came to our country, we had no death penalty. In vernacular, we would say Mushonga wengozi kuiripa, kwete kuuraya.\n\nOur culture does not allow us to kill someone because they have murdered someone. In Shona we would say, Ngozi inoripwa. That is the point that I am trying to put across Mr. President.\n\nCan the death penalty actually deter crimes or not? Also, let us not forget that the death penalty is irreversible.\n\nSenator Tongogara called the death penalty, a landmark piece of legislation that seeks to fundamentally transform Zimbabwes criminal justice system.\n\nThis Bill, reflective of a growing global movement towards the abolition of capital punishment, demands our attention as legislators entrusted with the mandate to uphold justice, preserve human dignity and ensure that our legal framework aligns with the contemporary human rights standard.\n\nShe said, Globally, 112 countries had abolished the death penalty for all crimes and 142 were abolitionist in law or practice.\n\nBy joining this growing majority, Zimbabwe strengthens its position as a progressive nation committed to human rights and justice.\n\nIn Africa, Mozambique; Namibia; and South Africa abolished the death penalty long back whilst Rwanda, after the genocide abolished the death penalty in 2007.\n\nWhile some argue that the death penalty serves as a deterrent, research consistently challenges this assumption. The United Nations Office on Drugs and Crime (UNODC) reports that there is no conclusive evidence linking the death penalty to reduced crime rates. Conversely, countries with abolitionist policies have often reported declines in violent crime.\n\nIn Zimbabwe, the rate of brutal murders remains a significant concern. According to Zimbabwe Republic Police (ZRP) statistics, 1642 murder cases were recorded in 2023,Tongogara said.\n\nShe urged Zimbabwe to follow President Mnangagwa, as a longstanding advocate for the abolition of capital punishment.\n\nHowever, Senator LindaSibanda differed,I rise with a heavy heart. Being a woman, a mother, a citizen and at the same time a Senator of this country who has got a cousin who is lying in the mortuary right now, whom we have been looking for, for about two weeks now, who was found dead at Fig Tree.\n\nHilary Muleya, who was murdered by a person who we do not know even up to today. I am here to serve my time in the Senate these coming two days and in three days, I will go and bury him.\n\nIt is so painful to just spare a murderer who does not even show any remorse to a helpless young lady on the streets who just knocked off from work.\n\nSenator Christopher Mutsvangwa used Mnangagwas case to justify the death penalty abolition.\n\n10 years on death row. This is a case study at a personal level of somebody who faced the prospect of death at the hands of the State.\n\nI support the abolition of the death penalty because our criminal justice system in this country and beyond is not 100% effective,hesaid.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/11001805/Death-Penalty.png",
            "description": "<p>By Anna Chibamu THE Death Penalty Abolition Bill sailed through the Senate and now awaits President Emmerson Mnangagwa’s approval to become law. The last execution in Zimbabwe was nearly two decades ago in 2005 and at the moment, Zimbabwe has over 60 prisoners on death row. Mnangagwa has expressed he is against capital punishment, sharing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/death-penalty-abolition-bill-sails-through-senate/\">Death Penalty Abolition Bill sails through Senate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Brain drain continues to haunt Zimbabwe as close to 36,000 are granted work visas to the UK alone in just a year",
            "url": "https://www.newzimbabwe.com/brain-drain-continues-to-haunt-zimbabwe-as-close-to-36000-are-granted-work-visas-to-the-uk-alone-in-just-a-year/",
            "content": "By Anna Chibamu\n\nZIMBABWE continues to lose its skilled manpower to other countries as 35 938 skilled workers, mostly in the Health sectormigrated to the United Kingdom in just a year.\n\nAlthough reasons for emigrating to other countries vary, Home Affairs minister Kazembe Kazembe this week said between June 2023 and June this year, close to 36,000 Zimbabweans had been granted working visas by the UK mostly as health care workers.\n\nLocally, healthcare workers earn an average of US$255 per month while the least experienced stands to take home about US$2,500 in the UK.\n\nThousands more have left en-masse to Ireland, Australia, and New Zealand where the working and living conditions are better.\n\nKazembe said that the country had not been spared from the devastating effects of brain drain as nurses and doctors have emigrated from Zimbabwe en-masse.\n\nStatistics from the United Kingdom revealedthat between June 2023 and June 2024, 35 938 Zimbabweans were granted work visas to the UK, mostly as health care workers.\n\nIt may be a challenge to tame this emigration pattern as reasons for such vary, Kazembe told International Organisation for Migration (IOM) director general Amy Pope, the first IOM DG to visit Zimbabwe in several decades this week.\n\nZimbabwes health sector is mismanaged and this has been worsened by the countrys economic collapse.\n\nZimbabwe is on WHOs red list of countries with dire health service shortages.\n\nHowever, it is equally possible to replenish lost and or required skills through sound policies, added the minister.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/28072448/Nurse-UK.png",
            "description": "<p>By Anna Chibamu ZIMBABWE continues to lose its skilled manpower to other countries as 35 938 skilled workers, mostly in the Health sector migrated to the United Kingdom in just a year. Although reasons for emigrating to other countries vary, Home Affairs minister Kazembe Kazembe this week said between June 2023 and June this year, close</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brain-drain-continues-to-haunt-zimbabwe-as-close-to-36000-are-granted-work-visas-to-the-uk-alone-in-just-a-year/\">Brain drain continues to haunt Zimbabwe as close to 36,000 are granted work visas to the UK alone in just a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Zimbabwe clamps down on smuggling, counterfeit products to safeguard public safety",
            "url": "https://www.newzimbabwe.com/zimbabwe-clamps-down-on-smuggling-counterfeit-products-to-safeguard-public-safety/",
            "content": "Xinhua\n\nAuthorities in Zimbabwe are intensifying efforts to combat the smuggling of consumer goods into the country and the proliferation of counterfeit and substandard products in the market to safeguard public safety and protect the local industry.\n\nThe rise in smuggled goods is partly driven by public demand for affordable products in informal markets that operate outside regulatory frameworks, authorities said.\n\nTo address the trade in illicit goods, the Ministry of Industry and Commerce is leading a multi-agency task force, including the police and the Zimbabwe Revenue Authority, aimed at curbing smuggling.\n\nStringent anti-smuggling measures have been put in place to protect our domestic industries from unfair competition posed by illegal imports, said Zimbabwes Deputy Minister of Industry and Commerce Rajeshkumar Modi during a dissemination workshop for the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) in the capital of Harare on Tuesday.\n\nThe development of value chains also remains a priority, as the government has put in place measures to promote the procurement of domestically produced goods, he added.\n\nLaunched on Nov. 1, the ZIRGP is a short-term transitional manufacturing policy running through December 2025, focused on enforcing consumer protection and preventing the spread of smuggled, counterfeit, and substandard goods in the country. The plan builds on the recently concluded Zimbabwe National Industrial Development Policy, which ran from 2019 to 2023.\n\nAmong the governments measures to tackle smuggling are the establishment of police roadblocks along highways and inspections of retail outlets across the country.\n\nSmuggling also affects the collection of customs and excise duties and discourages investment, Finance, Economic Development, and Investment Promotion Minister Mthuli Ncube said during his 2025 national budget presentation in Parliament last month.\n\nIn addition, smuggling is a threat to public health and safety as smuggled goods, in particular, food items, medicines, and alcohol are not subject to health and safety controls, said Ncube.\n\nThe Consumer Protection Commission, a national body that safeguards consumer rights, recently reported the presence of counterfeit items in the market, including toothpaste, cooking oil, drinks, and baked beans.\n\nDont fall for fake products. They might be cheaper, but they can cost you your health, your safety, and even your life, warned the commission on X, formerly Twitter.\n\nConsumers have also raised concerns over the proliferation of products in the market.\n\nAuthorities should continue conducting impromptu inspections on retailers and vendors to protect the public especially as people do their end-of-year shopping for the holidays, said Leon Nkhata, a resident in Harare. He expressed concern about substandard goods, including repackaged and underweight products like mealie meal, rice, and sugar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12172952/fake-colgate.webp",
            "description": "<p>Xinhua Authorities in Zimbabwe are intensifying efforts to combat the smuggling of consumer goods into the country and the proliferation of counterfeit and substandard products in the market to safeguard public safety and protect the local industry. The rise in smuggled goods is partly driven by public demand for affordable products in informal markets that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-clamps-down-on-smuggling-counterfeit-products-to-safeguard-public-safety/\">Zimbabwe clamps down on smuggling, counterfeit products to safeguard public safety</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Electric cable thief’s 10-year jail-term quashed following wrong conviction",
            "url": "https://www.newzimbabwe.com/electric-cable-thiefs-10-year-jail-term-quashed-following-wrong-conviction/",
            "content": "By Mary Taruvinga\n\nThe High Court has set aside a 10-year mandatory sentence against a Chinhoyi man who was convicted for stealing an electric cable from Athenzi farm.\n\nLuckmore Mutsindiko had his sentence quashed and case was referred back for trial before a different magistrate after the upper court ruled that he was wrongly convicted and sentenced.\n\nMutsindikowas convicted after a trial for contravening s60 A (3) (1) of the Electricity Act [Chapter 13:19] the Act for cutting, destroying or interfering with apparatus used to generate, transmit or supply electricity.\n\nHe pleaded guilty to the charge.\n\nThe court found no special circumstances, it then imposed the minimum mandatory sentence of 10 years imprisonment.\n\nDespite preferring a charge under the Electricity Act, the wording of the charge revealed a simple theftbut the trial magistrate failed to pick this.\n\nOn the other hand, the facts on the State Outline showed that an offence under the Electricity Act was committed.\n\nThe trialcourt canvassed the essential elements of theft but convicted the accused on a different chargeand Chinhoyi High Court judge, Justice Philda Muzofa ruled that this was a misdirection.\n\nThe charge was poorly drafted in this case.It is first for the prosecution to make sure that the charge is properly drafted.\n\nHowever the court as the final arbiter has the ultimate duty to make sure that the charge before it is correct.\n\nAn accused must never be convicted on a charge different from the alleged facts as in this case, noted the judge.\n\nThe State alleged that on January 30 2022 Mutsindiko unlawfully took a 30-meter X 50 millimetres core (sic) from Athenzi Farm.\n\nThe charge does not allege the actus reus (actual act) that resonates with contravening s60 A (3) (b).\n\nMuzofa said Mutsindiko allegedly took action that is not synonymous with cutting to interfere with the transmission of power.\n\nThe charge reveals a simple theft of already cut core armoured cables.\n\nHe was then convicted of the serious charge under s60 A (3) (b) of the Act.\n\nThe proceedings before the trial Court show that it did not address its mind to the facts of the case, she said.\n\nMuzofa said that oversight led to the accused being convicted of theft but sentenced for some serious offence.\n\nThe judge also said to alter the charge at this stage would be incompetent since the accused did not plead guilty to contravention of s60 A (3) (b) of the Act.\n\nShe also said quashing the proceedings and releasing the accused may not be in accordance with real and substantial justice.\n\nThe best course is to quash the proceedings and remit the matter for a trial de novo before a different Magistrate, she ruled.\n\nThe judge also said in the event that Mutsindiko is convicted, in sentencing the accused the period already served must be taken into account.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has set aside a 10-year mandatory sentence against a Chinhoyi man who was convicted for stealing an electric cable from Athenzi farm. Luckmore Mutsindiko had his sentence quashed and case was referred back for trial before a different magistrate after the upper court ruled that he was wrongly convicted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/electric-cable-thiefs-10-year-jail-term-quashed-following-wrong-conviction/\">Electric cable thief’s 10-year jail-term quashed following wrong conviction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "CBZ concedes to Competition and Tariffs Commission’s decision; plots regional market penetration",
            "url": "https://www.newzimbabwe.com/cbz-concedes-to-competition-and-tariffs-commissions-decision-plots-regional-market-penetration/",
            "content": "By Alois Vinga\n\nLISTED financial services powerhouse, CBZ Holdings Limited (CBHL) has conceded to the decision taken by the Competition and Tariffs Commission (CTC) but said it remains undeterred to penetrate the regional markets before 2025 year-end.\n\nIn a major climb down this week, CBZHL informed shareholders of the decision to withdraw its proposed mandatory offer to minority shareholders of First Mutual Holdings Limited (FMHL) after the Competition and Tariff Commission (CTC) capped its stake in the insurer at 31.22%.\n\nThe move was inspired by regulatory efforts to maintain market competition and prevent over-consolidation in Zimbabwes financial and insurance sectors.\n\nThe mandatory offer, initially announced on October 31, 2024, was triggered by CBZHLs substantial shareholding in FMHL, in line with Zimbabwe Stock Exchange Listings Requirements and the Companies and Other Business Entities Act.\n\nHowever the CTCs final decision, issued on November 29, 2024, rejected any further acquisition of FMHL shares by CBZHL, effectively blocking the proposed offer.\n\nSpeaking to NewZimbabwe.com on the sidelines of the institutions Media Cocktail event held Wednesday evening, the CBZHL group chief executive officer, Lawrence Nyazema downplayed speculation that CTCs decision had crippled plans to penetrate the regional market.\n\nHe said the CTC decision was well noted and respected duly but would not at all frustrate regional market penetration plans.\n\nYes we would have wanted to go into the region faster and easier through FMHL but we still believe we can go into the region pretty fast. Our target is to be operating in two regional countries by June 30 2025.\n\nRight now my feeling is that we are likely to get into the international markets much faster and quicker using some of our subsidiaries outside the bank because going the route of the bank establishment in a foreign land tends to be over-regulated in a lot of countries and the capital requirements for setting up a bank tend to be higher, he said.\n\nNyazema said CBZHL must not be viewed as just a bank but a group with subsidiaries which can be seized to perform regional tasks.\n\nSo we have businesses that are capital lite which have done so well locally. You look at our Asset Management which trades as Datvest . What will stop us from taking this company to another region and using its success story achieved in Zimbabwe?\n\nHe expressed optimism that by June 30 2025, CBZHL, through its subsidiaries, will be present in two countries in the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/25071037/Lawrence-Nyazema.jpeg",
            "description": "<p>By Alois Vinga LISTED financial services powerhouse, CBZ Holdings Limited (CBHL) has conceded to the decision taken by the Competition and Tariffs Commission (CTC) but said it remains undeterred to penetrate the regional markets before 2025 year-end. In a major climb down this week, CBZHL informed shareholders of the decision to withdraw its proposed mandatory</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cbz-concedes-to-competition-and-tariffs-commissions-decision-plots-regional-market-penetration/\">CBZ concedes to Competition and Tariffs Commission’s decision; plots regional market penetration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Heart Main Arena takes shape",
            "url": "https://www.newzimbabwe.com/heart-main-arena-takes-shape/",
            "content": "By Staff Reporter\n\nTHE Heart Main Arena being built in Kwekwe is taking shape, with its pitch bow almost done while construction of dressing rooms and terraces is ahead of schedule.\n\nIts construction is set to be complete by the end of January, tentatively two months before the start of the 2025 Castle Lager season.\n\nOwned by Yadah proprietor Prophet Walter Magaya and business partner Richard Chahwanda, the ground is expected to ease pressure on the few pitches approved for top-flight football use in Zimbabwe.\n\nMaterial for the grandstands has arrived, bucket seats will be delivered in two weeks and work on the pitch will be finalised before this month, said Magaya.\n\nThis stadium will be bigger than The Heart Stadium in Harare in terms of seating capacity and parking space.\n\nThe VIP stand will be three stories high, and accommodate a medical clinic and offices for ZIFAs Midlands province.\n\nConstruction is being constantly directed by a CAF-approved expert as there are plans to have it homologated for use in international competitions.\n\nMagaya owns The Heart Stadium, home of his Yadah and has built two more similar facilities in Mozambique and Malawi.\n\nCurrently, Zimbabwe does not have a single stadium approved by CAF to hold international matches, a position that has seen its national team, the Warriors hosting home matches in South Africa and Uganda.\n\nDeputy Sports Minister Emily Jesaya, who toured the facility recently encouraged other private players to also take part in the rehabilitation of old sports facilities in support of government efforts.\n\nI did not expect to see such high standards when I visited this facility. It is what we hope could be replicated by the corporate sector. This will surely go a long way, said Jesaya.\n\nMagaya is expected to run for ZIFA president in January. Reports indicate that he submitted his papers on deadline day, late Wednesday.\n\nHe fancies his chances against former legislator Temba Mliswa, ex-Warriors captain Benjani Mwaruwari and Nqobile Magwizi, who are some of the heavyweights vying for the top post.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12174024/WhatsApp-Image-2024-12-11-at-19.54.05-1.jpeg",
            "description": "<p>By Staff Reporter THE Heart Main Arena being built in Kwekwe is taking shape, with its pitch bow almost done while construction of dressing rooms and terraces is ahead of schedule. Its construction is set to be complete by the end of January, tentatively two months before the start of the 2025 Castle Lager season.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heart-main-arena-takes-shape/\">Heart Main Arena takes shape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        },
        {
            "title": "Zim-born actor Luthuli Dlamini rubbishes claims he is homeless",
            "url": "https://www.newzimbabwe.com/zim-born-actor-luthuli-dlamini-rubbishes-claims-he-is-homeless/",
            "content": "By Staff Reporter\n\nZimbabwean-born South African-based actor Luthuli Dlamini has dismissed claims that he is homeless and living in an abandoned house in Randburg.\n\nThis follows reports the actor who has appeared on soapies Generations, Scandal! and Uzalo had fallen on hard times and had been forcefully evicted from his home after failing to pay rent.\n\nDlamini shared a video on his Instagram page debunking the rumours. The actor said while he appreciated the accommodation offers he had received, he was not homeless.\n\nHie, I just want to dispel a few rumours, first of all, l I just wanna say thank you to everyone whos showing support for me, everyone whos offered me a house to live in, someone whos offered me a spare room I really appreciate that.\n\nI just want to dispel all of those concerns about me being homeless, Im not homeless, not at all, he says in the video where he is captured washing clothes in a plastic tub.\n\nOnline publication Zimojahad earlier reported, Failing to pay the salary led to Luthuli occupying Merciers home forcefully after failing to pay his rent. The show never made it to the screens following the incident. Attempts to get a comment from Luthuli proved fruitless as his phone went straight to voicemail.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12055911/6045_Luthuli-Dlamini-tux-zimoja.jpg",
            "description": "<p>By Staff Reporter Zimbabwean-born South African-based actor Luthuli Dlamini has dismissed claims that he is homeless and living in an abandoned house in Randburg. This follows reports the actor who has appeared on soapies Generations, Scandal! and Uzalo had fallen on hard times and had been forcefully evicted from his home after failing to pay</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-born-actor-luthuli-dlamini-rubbishes-claims-he-is-homeless/\">Zim-born actor Luthuli Dlamini rubbishes claims he is homeless</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 08:29:17"
        }
    ]
}