{
    "news": [
        {
            "title": "UK-based Zimbabwean gospel artist Matilda Tekeshe releases sixth album",
            "url": "https://www.newzimbabwe.com/uk-based-gospel-artist-matilda-tekeshe-releases-sixth-album/",
            "content": "By James Muonwa\n\nFROM being a shy girl in the school choir to emerge as a prolific songstress, Matildah Makandiona Tekeshe has grown from strength-to-strength.\n\nHer resolve to spread the word of God has seen her release her sixth gospel music album titled Shoko/The Word of God put out on the market recently.\n\nThe United Kingdom (UK) based artist travelled back home to Zimbabwe to launch her latest album as well as receive an award.\n\nMatildah shared insights into her phenomenal music career to NewZimbabwe.com.\n\nShoko/ The Word of God album is my sixth project, and I feel so much joy and peace that this message is now birthed and being preached in song, she said.\n\nMy passion is to spread the gospel and touch lives.\n\nMatildah owes her musical success to her sister, Tsitsi Maraba.\n\nI was mentored, still being mentored and am mentoring others too. Growing up I was a very reserved, quiet, and shy person. I never dreamt of standing in front of people speaking, teaching, or singing.\n\nGod used my sister Tsitsi Maraba to prepare me for this journey. She taught me how to fast and pray. She would write many songs in a booklet and always asked me to practice with her.\n\nOur voices blended well, and we used to present songs together in church. I used to be incredibly nervous to the point of shaking within me while singing.\n\nAfter some years of singing together with my sister, I grew out of that fear and gained confidence to stand in front of people and minister, narrated Matilda.\n\nShe was born again at the age of 13 and was a highly active member of the Scripture Union during her school years leading Highfield 2 High group.\n\nShe went further, The last two years of my high school, I was the chairperson of the Scripture Union in my school. I led songs during assembly meetings.\n\nI grew and became stronger through mentorship. God raised different people at different stages of this journey to mentor me and He is still directing more people.\n\nBefore her latest album release, Matildah had five albums under her belt, namely Kugona kwaMwari (2012), Mukana Uripo (2015), The Kingdom of God (2018), Jehovah Yahweh (2020) and Seasons/ Mwaka (2023). The five albums have a combined 53 songs.\n\nIt is my desire that we continue to search God through His word and that He continues to reveal and manifest his presence in our lives in greater depth.\n\nMay God richly bless everyone who will listen to this project and give more revelation of His word to his people, the songstress said.\n\nTurning to the recent award, Matildah expressed joy for the recognition and being recipient of the Zimbabwe Community Trailblazers Award (ZCTA) 2025.\n\nZCTA honoured Matildah with the Impactful Local Gospel Music Development (UK) award at a glittering event held on January 31, 2025, in Harare.\n\nSpeaking about her relocation to UK, Matildah said in 2010 she settled in the UK, where she is a member of the ZAOGA FIF Ministries Praise and Worship team both at assembly and regional level.\n\nIt has been a journey, and I have seen people and the team growing, God raising several people among us songwriters and recording artists.\n\nI am passionate about nurturing, directing and encouraging others especially the young generation togrow and become successful recording artists/musicians and songwriters too.\n\nMatildah has performed at various high-end events, including at her husbands graduation party in 2012 supported by the Manatsas and the Green Arrows Band.\n\nShe has also featured at The Harvest International Festival in Bedford and had a successful concert at, The Bedford Corn Exchange in September 2017 featuring Madam Boss from Zimbabwe, Queen Patience, Setina Mandiveyi, Nursel, Ivy Maguraushe and Bren Mupawere.\n\nMatildah also hosted a concert, Festival of Praise in Zimbabwe in August 2019 featuring Mathias Mhere, Evangelist Mai Makenzi, Eleana Makombe, Nyasha Mutongwizo, Alpha Ngoni Gatsi and Alice Shumi Marandure. Samantha Kureya (Gonyeti) and Maggie of the Bus Stop TV were the event directors.\n\nIn March 2020, Matildah ministered at The Flame Conference hosted by GC Assemblies of God in Zimbabwe. She also sang at the Free to Worship 5 Concert.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/08050745/IMG-20250127-WA0024.jpg",
            "description": "<p>By James Muonwa FROM being a shy girl in the school choir to emerge as a prolific songstress, Matildah Makandiona Tekeshe has grown from strength-to-strength. Her resolve to spread the word of God has seen her release her sixth gospel music album titled “Shoko/The Word of God” put out on the market recently. The United</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-based-gospel-artist-matilda-tekeshe-releases-sixth-album/\">UK-based Zimbabwean gospel artist Matilda Tekeshe releases sixth album</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Trump signs order to cut funding for South Africa over land policy, ICJ case",
            "url": "https://www.newzimbabwe.com/trump-signs-order-to-cut-funding-for-south-africa-over-land-policy-icj-case/",
            "content": "By Reuters\n\nPRESIDENT Donald Trump signed an executive order to cut U.S. financial assistance to South Africa, the White House said on Friday, citing disapproval of its land policy and of its genocide case at the International Court of Justice against Washingtons ally Israel.\n\nThe United States allocated nearly $440 million in assistance to South Africa in 2023, the most recent U.S. government data shows.\n\nThe White House said Washington will also formulate a plan to resettle white South African farmers and their families as refugees.\n\nIt said U.S. officials will take steps to prioritize humanitarian relief, including admission and resettlement through the United States Refugee Admissions Program for Afrikaners in South Africa, who are mostly white descendants of early Dutch and French settlers.\n\nTrump has said, without citing evidence, that South Africa is confiscating land and that certain classes of people were treated very badly. South African-born billionaire Elon Musk, who is close to Trump, has said that white South Africans have been the victims of racist ownership laws.\n\nSouth African President Cyril Ramaphosa  who signed into law a bill last month aimed at making it easier for the state to expropriate land in the public interest  has defended the policy.\n\nHe has said the government had not confiscated any land and the policy was aimed at evening out racial disparities in land ownership in the Black-majority nation. Ramaphosa said South Africa will not be bullied.\n\nWashington has also complained about the case brought by South Africa at the International Court of Justice, where it accused Israel of genocide over Israels military assault on Gaza that has killed tens of thousands and caused a humanitarian crisis.\n\nIsrael denies the allegations, saying it acted in self-defense following a deadly Oct. 7, 2023, attack by Palestinian Hamas militants.\n\nThe White House cited that case as an example of South Africa taking positions against Washington and its allies.\n\nThe executive order signed by Trump will address human rights issues in South Africa, the White House said. Trump had threatened to cut off funding for the nation soon after taking office.\n\nThe question of land ownership is highly politically charged in South Africa, due to the legacy of the colonial and apartheid eras when Black people were dispossessed of their lands and denied property rights.\n\nWhite landowners still possess three-quarters of South Africas freehold farmland. This contrasts with 4% owned by Black people, who make up 80% of the population compared with about 8% for whites, according to the latest 2017 land audit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/10155043/Donald-Trump1.jpg",
            "description": "<p>By Reuters  PRESIDENT Donald Trump signed an executive order to cut U.S. financial assistance to South Africa, the White House said on Friday, citing disapproval of its land policy and of its genocide case at the International Court of Justice against Washington’s ally Israel. The United States allocated nearly $440 million in assistance to South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-signs-order-to-cut-funding-for-south-africa-over-land-policy-icj-case/\">Trump signs order to cut funding for South Africa over land policy, ICJ case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Negligent truck driver slapped with custodial sentence for causing deaths of 6 passengers",
            "url": "https://www.newzimbabwe.com/negligent-truck-driver-slapped-with-custodial-sentence-for-causing-deaths-of-6-passengers/",
            "content": "By Staff Reporter\n\nA NEGLIGENT truck driver, who was involved in a road traffic accident that claimed six lives, has been sentenced to four years imprisonment.\n\nDenny Taziva (36) was arraigned before the Nyanga Magistrates Court this week facing charges of culpable homicide.\n\nHe was found guilty of negligence in one or more of the following particulars: driving at an excessive speed, failure to control the vehicle and reckless driving.\n\nFurther to the custodial sentence, Taziva was banned from driving.\n\nCircumstances were that on August 13, 2024, Taziva was driving a Hino truck carrying 58 passengers on board along the Nyanga-Rwenya road.\n\nWhile on the stretch of road and on approaching a steep descent near Tangwena turn-off, the driver lost control of the vehicle which veered off the road throwing out passengers in the process.\n\nAs a result of the accident, four people died on the spot and two others passed away at Nyanga District Hospital while 50 others sustained various degrees of injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By Staff Reporter  A NEGLIGENT truck driver, who was involved in a road traffic accident that claimed six lives, has been sentenced to four years’ imprisonment. Denny Taziva (36) was arraigned before the Nyanga Magistrates Court this week facing charges of culpable homicide. He was found guilty of negligence in one or more of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/negligent-truck-driver-slapped-with-custodial-sentence-for-causing-deaths-of-6-passengers/\">Negligent truck driver slapped with custodial sentence for causing deaths of 6 passengers </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Zimbabwe struggles to promote ZiG as informal sector favors other currencies",
            "url": "https://www.newzimbabwe.com/zimbabwe-struggles-to-promote-zig-as-informal-sector-favors-other-currencies/",
            "content": "By Xinhua\n\nTHE Zimbabwean government faces challenges in promoting the Zimbabwe Gold (ZiG) currency for financial stability, as some businesses remain reluctant to accept it, preferring the U.S. dollar, which remains legal tender under the countrys multi-currency system.\n\nWhile formal businesses accept the local currency, some people, particularly in the informal sector, resist using the gold-backed ZiG, which was introduced in April 2024 to reduce Zimbabwes dependency on the U.S. dollar.Given past experiences with chronic high inflation and hyperinflation, many economic agents were traumatized by the loss of value caused by these conditions, Zimbabwean economist Prosper Chitambara told Xinhua on Friday.It will take time to fully restore trust and confidence in the ZiG. But that will depend on the authorities ability to maintain low and stable inflation over time, Chitambara added.Zimbabwe adopted a multi-currency system in 2009 after severe hyperinflation rendered the local dollar worthless. The ZiG replaced the Zimbabwean dollar, which was introduced in 2019 but failed due to inflation.The introduction of ZiG aimed to curb inflation and reduce reliance on the U.S. dollar, which accounts for over 80 percent of domestic transactions, according to the Zimbabwe National Statistics Agency. The government plans to phase out the U.S. dollar and make ZiG the sole currency by 2030.Despite efforts to stabilize the local currency, ZiG faces resistance, particularly in the informal market, where currency regulations are loosely enforced.To encourage its use, the government has mandated businesses to accept ZiG and launched a crackdown on illicit currency trading, leading many traders to vacate their usual spots in Harares central business district. The central bank has also set up a hotline for the public to report businesses that refuse to accept the currency.However, business owners argue that using ZiG is challenging because suppliers typically demand U.S. dollars.Most business expenses are in U.S. dollars, including rent, supplier payments, and even some required licenses, said Gwen Satande, a small business owner in Harare, the capital.She said that disparities between the official and unofficial exchange rates make it difficult to operate sustainably.Currently, ZiG trades officially at 26 to the U.S. dollar, while in the parallel market, it is exchanged at around 36 per dollar.To promote the use of ZiG, the central bank announced a reduction in exporters foreign currency retention threshold from 75 percent to 70 percent in its 2025 Monetary Policy Statement.This measure is intended to maintain stability in the interbank foreign exchange market by increasing the supply of foreign currency and building critical reserves to support the ZiG, Reserve Bank of Zimbabwe Governor John Mushayavanhu said Thursday during the policy presentation in Harare.\n\nWhile formal businesses accept the local currency, some people, particularly in the informal sector, resist using the gold-backed ZiG, which was introduced in April 2024 to reduce Zimbabwes dependency on the U.S. dollar.\n\nGiven past experiences with chronic high inflation and hyperinflation, many economic agents were traumatized by the loss of value caused by these conditions, Zimbabwean economist Prosper Chitambara told Xinhua on Friday.\n\nIt will take time to fully restore trust and confidence in the ZiG. But that will depend on the authorities ability to maintain low and stable inflation over time, Chitambara added.\n\nZimbabwe adopted a multi-currency system in 2009 after severe hyperinflation rendered the local dollar worthless. The ZiG replaced the Zimbabwean dollar, which was introduced in 2019 but failed due to inflation.\n\nThe introduction of ZiG aimed to curb inflation and reduce reliance on the U.S. dollar, which accounts for over 80 percent of domestic transactions, according to the Zimbabwe National Statistics Agency. The government plans to phase out the U.S. dollar and make ZiG the sole currency by 2030.\n\nDespite efforts to stabilize the local currency, ZiG faces resistance, particularly in the informal market, where currency regulations are loosely enforced.\n\nTo encourage its use, the government has mandated businesses to accept ZiG and launched a crackdown on illicit currency trading, leading many traders to vacate their usual spots in Harares central business district. The central bank has also set up a hotline for the public to report businesses that refuse to accept the currency.\n\nHowever, business owners argue that using ZiG is challenging because suppliers typically demand U.S. dollars.\n\nMost business expenses are in U.S. dollars, including rent, supplier payments, and even some required licenses, said Gwen Satande, a small business owner in Harare, the capital.\n\nShe said that disparities between the official and unofficial exchange rates make it difficult to operate sustainably.\n\nCurrently, ZiG trades officially at 26 to the U.S. dollar, while in the parallel market, it is exchanged at around 36 per dollar.\n\nTo promote the use of ZiG, the central bank announced a reduction in exporters foreign currency retention threshold from 75 percent to 70 percent in its 2025 Monetary Policy Statement.\n\nThis measure is intended to maintain stability in the interbank foreign exchange market by increasing the supply of foreign currency and building critical reserves to support the ZiG, Reserve Bank of Zimbabwe Governor John Mushayavanhu said Thursday during the policy presentation in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Xinhua THE Zimbabwean government faces challenges in promoting the Zimbabwe Gold (ZiG) currency for financial stability, as some businesses remain reluctant to accept it, preferring the U.S. dollar, which remains legal tender under the country’s multi-currency system. While formal businesses accept the local currency, some people, particularly in the informal sector, resist using the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-struggles-to-promote-zig-as-informal-sector-favors-other-currencies/\">Zimbabwe struggles to promote ZiG as informal sector favors other currencies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Bhola Hardware US$52,000 heist gang member jailed 15 years",
            "url": "https://www.newzimbabwe.com/bhola-hardware-us52000-heist-gang-member-jailed-15-years/",
            "content": "By Staff Reporter\n\nA HARARE magistrate convicted and sentenced a robber, who in 2023 was part of a gang that orchestrated the US$52,000 money heist at a reputable city hardware.\n\nTapiwanashe Murefu (26) was slapped with a 15-year imprisonment term when he appeared at the Harare Magistrates Court this week.\n\nOf the 15 years, 10 years were conditionally suspended, meaning accused person will serve an effective five years in jail.\n\nAdditionally, Murefu was ordered to restitute US$51,000 as part of his sentence.\n\nThe State case was that on March 4, 2023, in Harare, Murefu along with three co-accused persons namely Tawanda Mutuma (30), Edmond Nzombe (47) and Jefferes Chapwanyira (29) planned to steal from Bhola Hardware, where Mutuma was previously employed.\n\nUsing insider information provided by Mutuma, the gang, aided by eight others who are still at large, executed the robbery using a black Toyota Wish.\n\nThe quartet was later arrested and hauled to court.\n\nWhile Murefu was convicted, his other three co-accused persons were acquitted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter  A HARARE magistrate convicted and sentenced a robber, who in 2023 was part of a gang that orchestrated the US$52,000 money heist at a reputable city hardware. Tapiwanashe Murefu (26) was slapped with a 15-year imprisonment term when he appeared at the Harare Magistrates Court this week. Of the 15 years, 10</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bhola-hardware-us52000-heist-gang-member-jailed-15-years/\">Bhola Hardware US$52,000 heist gang member jailed 15 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Government leaves over 4,000 Mbare fire victims ‘high and dry’ as interest-free loans promise fails to materialise",
            "url": "https://www.newzimbabwe.com/government-leaves-over-4000-mbare-fire-victims-high-and-dry-as-interest-free-loans-promise-fails-to-materialise/",
            "content": "By Costa NkomoTRADERS who lost goods worth over US$20 million in an inferno at Mbare Musika last October have been let down by the government, who promised interest-free loans to help them get back on their feet.\n\nThe promises, it now appears, were simply selling them a dummy.\n\nOver 4,000 traders in Mbare saw their livelihoods reduced to ashes when the market went up in flames, leaving them with nothing.\n\nLocal Government Minister Daniel Garwe had previously claimed the fires were a blessing in disguise, providing the government with an opportunity to build a modern market and, crucially, get traders paying tax.\n\nNewZimbabwe.com visited traders in Mbare who have already created makeshift stalls and tents to continue working. They told this publication that they have received nothing from the government.\n\nOscar Mwedzi said he had received no support.\n\nWe were expecting the government to support us, but we havent received anything yet. I came back with a very small stock because I cant afford to sit at home. My family needs food, he said.\n\nAnother fire victim, Memory Chiguru, said the government only took their details days after the fire, before disappearing from the scene and leaving them stranded. They were forced to turn to well-wishers for help.\n\nOur names were taken down two days after the fire. They asked us about our families, dependents, and the value of our goods that were burnt.\n\nBut since then, no support has come our way. As for me personally, I took out a loan from the bank to restart my business. A few relatives helped me, she said.\n\nEfforts to get a comment from the government were fruitless as Garwe was unavailable.\n\nWomen Affairs, Small and Medium Enterprise Minister Monica Mutsvangwa referred questions to the Civil Protection Unit (CPU).\n\nHowever, CPU deputy director Farai Hokonya told NewZimbabwe.Com that government officials will tour the new market next week and will be able to provide an update then.\n\nMeanwhile, traders are also raising concerns about the registration and allocation of vending stalls, following a questionable list released through a state-owned newspaper last month. The list contained blatant errors that embarrassed the government.\n\nSources close to those who compiled the list told NewZimbabwe.com that it is dominated by Zanu-PF supporters, the majority of whom were not among the traders who lost goods in the October fire.\n\nCity of Harare Small and Medium Enterprise Committee chairperson, Denford Ngadziore said council has the responsibility of allocating vending spaces at the new Mbare Musika Market. This signals a potential clash with the government.\n\nNgadziore added that the new Mbare Musika, which nears completion, is a joint venture between the council and the government.\n\nThe council is the one that enjoys the responsibility to allocate space to traders, not the government.Any allocation by anyone else will be illegal. The allocation will prioritise those who lost goods in the fire last year, he said.\n\nMbare market is considered to have a significant influence on Zimbabwes economic activities and performance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/09132158/Mbare-9.png",
            "description": "<p>By Costa Nkomo TRADERS who lost goods worth over US$20 million in an inferno at Mbare Musika last October have been let down by the government, who promised interest-free loans to help them get back on their feet. The promises, it now appears, were simply selling them a dummy. Over 4,000 traders in Mbare saw</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-leaves-over-4000-mbare-fire-victims-high-and-dry-as-interest-free-loans-promise-fails-to-materialise/\">Government leaves over 4,000 Mbare fire victims ‘high and dry’ as interest-free loans promise fails to materialise</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Vietnam bartender arrested over toxic alcohol deaths of South African-British couple",
            "url": "https://www.newzimbabwe.com/vietnam-bartender-arrested-over-toxic-alcohol-deaths-of-south-african-british-couple/",
            "content": "By News24\n\nA BARTENDER has been arrested in Vietnam for making toxic alcohol that led to the deaths of a South African and British couple. Methanol poisoning was the cause of death.\n\nIt was found that the 46-year-old bartender used medical alcohol mixed with water, lemonade and sugar to make limoncello.\n\nA bartender was arrested in Vietnam on Friday for making toxic liquor that led to the deaths of a British and South African couple in January, state media said.\n\nThe bodies of the couple  South African-born Arno Els and his British fiance, Greta Otteson  were found at a resort villa in the central city of Hoi An on 26 December, without any signs of physical trauma, violence or a break-in.\n\nAccording to an autopsy report in January carried out by Vietnamese authorities, methanol poisoning was the cause of their deaths.\n\nPolice in Hoi arrested a 46-year-old bartender Le Tan Gia on Friday, state-run Tuoi Tre newspaper said.\n\nOfficers concluded Gia had used 70% medical alcohol, mixing it with water, lemonade and sugar to make limoncello on 24 December.\n\nAfter taking the drinks, the two suffered serious methanol poisoning, leading to their death, the report said.\n\nPolice confiscated several used alcohol bottles at the crime scene in January.\n\nThe case came after six tourists died of suspected methanol poisoning after a night out in the Laos backpacker hotspot of Vang Vieng.\n\nAccording to international reports, this was also believed to have been what killed six young travellers  from Australia, Denmark, the US and the UK  and landed another six in hospital in neighbouring Laos in November.\n\nIn a joint statement in January, when it was revealed methanol poisoning was the cause of death, the couples families said the Vietnamese police confirmed the cause of death was methanol poisoning, as verified by the autopsy results.\n\nWe are grateful to the Vietnamese authorities for their thorough and professional handling of this case. While the investigation is under way, procedural requirements and due diligence are being followed.\n\nBoth families are aligned with the authorities in our shared goal of holding those responsible accountable, they said.\n\nThere have been several incidents of methanol poisoning from tainted liquor in Southeast Asia in recent years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/08014303/b746e413dd204c0293b08bbf32d66d1a.jpg",
            "description": "<p>By News24 A BARTENDER has been arrested in Vietnam for making toxic alcohol that led to the deaths of a South African and British couple. Methanol poisoning was the cause of death. It was found that the 46-year-old bartender used medical alcohol mixed with water, lemonade and sugar to make limoncello. A bartender was arrested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vietnam-bartender-arrested-over-toxic-alcohol-deaths-of-south-african-british-couple/\">Vietnam bartender arrested over toxic alcohol deaths of South African-British couple</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Harare mayor’s controversial house an illegal structure violating regulations— says city top official",
            "url": "https://www.newzimbabwe.com/harare-mayors-controversial-house-an-illegal-structure-violating-regulations-says-city-top-official/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume is under scrutiny for using his position to circumvent his City of Harare by-laws while renovating his controversial luxurious home, a top council official has said.\n\nDirector of Housing Edmore Nhekairo poked holes in the process of erecting the house alleging it was done without an application of change of use.\n\nMafume is at the center of a growing controversy following revelations at the ongoing Commission of Inquiry of lawlessness and non-adherence to stipulated regulations by top officials.\n\nHis residence in Belvedere is under particular scrutiny, with the commission alleging Mafume deliberately bypassed laid-down procedures, an allegation he vehemently denies.\n\nDuring a hearing of the probe team, Mafume presented a building plan for his house, which was closely examined by evidence leader Tapiwa Godzi. Questions were raised about the authenticity of the building plan, with suspicions that it may have been fabricated.\n\nAdditionally, Mafume failed to produce an application for change of use from the council, which is a prerequisite when altering the purpose of a property.\n\nI have not made an application for a change of use, Mafume told the commission.\n\nHe argued that the application to change the property from residential to commercial use could be made at a later stage after the building has been constructed.\n\nWhen you want to turn it into a boarding house you then apply for the change of use. Normally people apply as they are building. You can start by building. You can use the premise for a living (if not approved), he said.\n\nHowever, failing to apply for a change of use is a violation of the City Council bylaws.\n\nAccording to the City council regulations, individuals must pay application fees for the approval of plans, and development fees, and obtain approved plans to undertake any project.\n\nMafume said the facility will be used as accommodation for the Harare Institute of Technology (HIT) students upon completion.\n\nIt is the application that must be tendered first with council. You apply to the Department of Planning The circulation to the district officer, the councillor to ZESA and other utility providers. All those must comment on that application. If the application is favourable then it will be presented to the committee.\n\nIf it is rejected, you cannot build. It is not proper (to build before application). It is an illegal development. If that illegal development has occurred someone is given 48 hour notice to ensure the illegality is corrected. You have to dismantle the property so that you can salvage the salvageable materials, said Nhekairo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Darlington Gatsi  HARARE Mayor Jacob Mafume is under scrutiny for using his position to circumvent his City of Harare by-laws while renovating his controversial luxurious home, a top council official has said. Director of Housing Edmore Nhekairo poked holes in the process of erecting the house alleging it was done without an application of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-mayors-controversial-house-an-illegal-structure-violating-regulations-says-city-top-official/\">Harare mayor’s controversial house an illegal structure violating regulations— says city top official</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "Zimbabwe’s Central Bank orders exporters to surrender 30% foreign currency",
            "url": "https://www.newzimbabwe.com/zimbabwes-central-bank-orders-exporters-to-surrender-30-foreign-currency/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has compelled all exporters to surrender 30% of their earned foreign currency in exchange for the ZWG at the obtaining interbank exchange rate.\n\nPresenting the Monetary Policy Statement (MPS) premised under the theme, Fostering Price, Currency and Exchange Rate Stability Through Balancing Confidence, Trust, Credibility, Efficiency, Stability Growth the RBZ Governor John Mushayavanhu ordered exporters to surrender more US$.\n\nThe foreign currency retention level for exporters has been reduced from 75% to 70%, with immediate effect. This implies that the effective surrender portion of export proceeds has been increased from 25% to 30%, he said.\n\nHe said the initiative is aimed at guaranteeingcontinued stability in the interbank foreign exchange market through augmenting the supply of foreign currency, as well as building the critical foreign currency reserves needed to anchor the ZWG.\n\nHowever, the initiative to raise foreign currency by taking away the hard-earned US$ from the exporters comes at a time when most companies are crying foul over due to choking shortages of foreign currency.\n\nIndications on the ground are that the measure is likely to complicate an already tough situation.\n\nThis review is consistent with the increased use of ZiG in the economy. The additional 5% will ensure that exporters mobilise sufficient ZiG to meet local currency obligations and other expenses, including tax payments, going forward, said Mushayavanhu.\n\nThe central bank also moved to introduce a US Dollar Denominated Deposit Facility (USDDDF) where the export surrender proceeds will have an option to invest the funds in a USDDDF at the RBZ which they can withdraw in ZWG on demand, at the prevailing interbank exchange rate on the settlement date.\n\nGoing forward, Authorized Dealers are expected to on-sell foreign exchange purchased from willing sellers, including the RBZ at a margin consistent with international best practices.\n\nThe limits on funds that can be accessed from the Foreign Exchange Interbank Market had been set at US$500,000 and US$100,000 for Primary and Secondary users of foreign exchange, respectively, per week. The central bank issued streamlined Foreign Exchange Interbank Market Guidelines to operationalise the refinements on the exchange rate management system and removal of foreign exchange trading limits.\n\nIn order to promote the use of prepaid international debit and credit cards, the Reserve Bank has, with immediate effect, reviewed upwards the annual limit from US$500,000 to US$1,000,000. This review will also enhance the ease of doing business and reduce the use of foreign currency cash for cross-border transactions, the exchequer said.\n\nThe Bank Policy Rate was maintained at 35% per annum, as assessed to be appropriate to support the current tight Monetary Policy Stance (MPS).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has compelled all exporters to surrender 30% of their earned foreign currency in exchange for the ZWG at the obtaining interbank exchange rate. Presenting the Monetary Policy Statement (MPS) premised under the theme, “Fostering Price, Currency and Exchange Rate Stability Through Balancing Confidence, Trust, Credibility, Efficiency,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-central-bank-orders-exporters-to-surrender-30-foreign-currency/\">Zimbabwe’s Central Bank orders exporters to surrender 30% foreign currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        },
        {
            "title": "‘We will not be bullied’: Ramaphosa’s strong message to global foes",
            "url": "https://www.newzimbabwe.com/we-will-not-be-bullied-ramaphosas-strong-message-to-global-foes/",
            "content": "TimesLive\n\nPresident Cyril Ramaphosa used his State of the Nation Address to send a strong message to his countrys detractors, warning that the South Africa he leads will not cower to bullies.\n\nSouth Africa, he said, was very capable of navigating the ever-changing and treacherous waters of the world and its geopolitics.\n\nHe said the country was witnessing the rise of nationalism, protectionism and the pursuit of narrow interests by global leaders.\n\nThis is the world that we, a developing economy, must now navigate. But we are not daunted to navigate our path through this world that constantly changes, said Ramaphosa.\n\nWe will not be deterred. We are a resilient people and we will not be bullied.\n\nThis stern message by Ramaphosa, which received loud applause and cheers in the National Assembly, comes after South Africa was in the past two weeks under an international microscope after leaders of the US and Rwanda censured the country.\n\nIt started with Rwandas Paul Kagame, who along with government officials criticised the presence of South African troops in the eastern DRC, claiming it was not for peacekeeping but to protect financial interests of many, including Ramaphosa himself.\n\nKagame also accused Ramaphosa of lying on the outcomes of their telephone conversation, where Ramaphosa is said to have warned that the continued firing towards the South African troops by M23 and the Rwandan Defence Force would be viewed as a declaration of war.\n\nUS President Donald Trump also zoomed into the affairs of South Africa this week, voicing what he says are concerns over the Expropriation Act that Ramaphosa signed into law.\n\nHe claimed that the country under Ramaphosa was doing very wrong things and that there was confiscation of private properties.\n\nBut Ramaphosa said South Africa had survived apartheid, which sought to dehumanise its people, suggesting the county would also defend and survive this.\n\nWe will stand together and speak with one voice in defence of our national interests, our sovereignty and our constitutional democracy by standing true to our values, by harnessing our unique strengths and endowments, and by forging a common purpose we can turn these trying circumstances to our advantage and propel our country forward.\n\nHe said South Africa stood for peace and justice, equality and solidarity. We stand for a non-racial future and we stand for democracy and tolerance as well as compassion. We stand for equal rights for women and people living with disability and members of the LGBTQIA+ community. We stand for our shared humanity, not for the survival of the fittest, he said.\n\nHis comments come after he had a telephonic conversation with Trumps right hand-man Elon Musk to try to explain that their view on what was happening in South Africa was completely wrong.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/07042857/ramaphosa-SONA.jpg",
            "description": "<p>TimesLive President Cyril Ramaphosa used his State of the Nation Address to send a strong message to his country’s detractors, warning that the South Africa he leads will not cower to bullies. South Africa, he said, was very capable of navigating the ever-changing and treacherous waters of the world and its geopolitics. He said the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-not-be-bullied-ramaphosas-strong-message-to-global-foes/\">‘We will not be bullied’: Ramaphosa’s strong message to global foes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:07",
            "date": "08 Feb 2025"
        }
    ]
}