{
    "news": [
        {
            "title": "Cape Verde, Zimbabwe and South Africa projects triumph at Durban FilmMart",
            "url": "https://www.newzimbabwe.com/cape-verde-zimbabwe-and-south-africa-projects-triumph-at-durban-filmmart/",
            "content": "ScreenDaily\n\nProjects from South Africa, Cape Verde and Zimbabwe were among the big winners at the 16th edition of the Durban FilmMart (DFM), which wrapped this week.\n\nThis years market was attended by 1,364 filmmakers and industry professionals from 63 countries, and culminated in the presentation of 39 awards for projects focused on African storytellingincluding development grants, co-production opportunities, festival invitations, and industry mentorships.\n\nCape Verde documentary projectPlastic Atlantis, about the link between slavery and ocean pollution in Cape Verde, won six prizes including the Sundance Institute Documentary Fund New Voices Award, a Climate Story Labs award, plus prizes from OIF-ACP-EU, Sheffield Doc Fest,DOC-A and Women Make Movies. It is directed by Samira Vera-Cruz and produced by Pedro Soul through Cape Verde-based Kriolscope (KS).\n\nZimbabwean feature documentaryGoldenwon three prizes: a Red Sea Film Fund award, a Canal+ development grant, and the DOK.fest Mnchen award. The documentary traces Zimbabwe womens national hockey teams road to the 2025 Womens FIH Hockey Junior World Cup  45 years after the countrys only Olympic medal in a team sport. It is directed by Rumbi Katedzaand produced by Rumbi Katedza and Ingrid Martens through Mai Jai Films.\n\nSouth African dark comedy projectThe Second Coming, about a man convinced he is the Messiah, won three prizes including a Red Sea Film Fund award, a National Film and Video Foundation of South Africa (NFVF) best fiction grant, and the Inkaba Award.The Second Coming isdirected by Durban-based Michael James and produced by Siyabonga Xaba of Maverick Resistance.\n\nWe are delighted to have hosted such a dynamic array of filmmakers from across the African continent. They entrusted us with their projects and ideas, and generously shared their time, expertise, and passion through enriching conversations, creating a truly African event, said Magdalene Reddy, director of the Durban FilmMart Institute (DFMI).\n\nDFM 2025, took place from 18  21 July in Durban.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24201001/1455962_dfm2025awardwinnersanddfmteam_120356_crop.jpg",
            "description": "<p>ScreenDaily Projects from South Africa, Cape Verde and Zimbabwe were among the big winners at the 16th edition of the Durban FilmMart (DFM), which wrapped this week. This year’s market was attended by 1,364 filmmakers and industry professionals from 63 countries, and culminated in the presentation of 39 awards for projects focused on African storytelling—including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cape-verde-zimbabwe-and-south-africa-projects-triumph-at-durban-filmmart/\">Cape Verde, Zimbabwe and South Africa projects triumph at Durban FilmMart</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "25 Jul 2025"
        },
        {
            "title": "What the Eastern Cape High Court ruling means for foreign employee terminations",
            "url": "https://www.newzimbabwe.com/what-the-eastern-cape-high-court-ruling-means-for-foreign-employee-terminations/",
            "content": "IOL\n\nSOUTH AFRICA  A foreign national employee must be provided with proper notice of their termination in line with the Basic Conditions of Employment Act (BCA). Failure to provide such notice may result in the termination being unlawful.\n\nThis is the warning of employment law experts at Cliffe Dekker Hofmeyr (CDH), following a recent Eastern Cape High Court judgment.\n\nThis was after an application by a research assistant and Zimbabwean national, Samuel Nyakudya.\n\nHe was granted a temporary residence permit allowing him to reside in South Africa and seek employment in the category of general work as provided for under the Immigration Act.\n\nHis employer, the OR Tambo District Municipality, however, terminated his employment contract due to allegations of its unlawfulness and irregularity.\n\nCommenting on the case, CDH said that this area of termination has just become a lot clearer for employers after the recent ruling, stating that employing a foreign national without a work visa does not automatically grant an employer the right to summarily terminate the employment contract.\n\nThis indicates a key warning for employers highlighting their responsibility to act lawfully and in accordance with the BCA, CDH said.\n\nThe experts explained that a foreign national employee must be provided with proper notice of their termination in line with the BCA. Failure to provide such notice may result in the termination being unlawful. The dismissal may also be found to be unfair in the CCMA (Commission for Conciliation, Mediation and Arbitration).\n\nNyakudya was employed on successive fixed-term contracts, but following the expiration of his last contract, the municipality allowed him to continue working without a new fixed-term contract.\n\nThroughout his employment, Nyakudya was not consistently in possession of a work visa. In November 2023, the municipality notified him that his contract had expired on March 31, 2022, and that he had failed to provide a copy of his South African identity document, despite being requested to do so.\n\nConsequently, the municipality claimed it had no choice but to terminate his employment immediately, citing the unlawful nature of his contract due to the expiration of his work visa.\n\nWhile Nyakudya could have contested the fairness of his dismissal before the CCMA, he opted to challenge the termination in the High Court.\n\nThe court ultimately ruled that Nyakudyas employment contract termination was unlawful..\n\nCDH said the Immigration Act outlines an employers responsibilities regarding the employment of foreign nationals, specifically in Section 38, which prohibits the employment of illegal foreigners or those whose status does not authorise them to work.\n\nIt said the court also referenced Section 49(3) of the Immigration Act, which states that employing an illegal foreigner or a foreigner in violation of the Act constitutes a criminal offence.\n\nThe court confirmed that such employment is punishable by fines or imprisonment upon conviction.\n\nRegarding the summary termination of Nyakudyas contract, the court considered Section 37(1) of the BCEA, which stipulates the notice period required for termination based on the duration of employment.\n\nThe court highlighted that the purpose of providing notice is to allow employees to prepare for a smooth transition.\n\nNyakudyas lack of a work visa or South African identity document was a critical factor in the case. The court determined that employing a foreign national without a work visa is prohibited, and thus, the municipalitys immediate termination of Nyakudyas contract was unlawful.\n\nThis case serves as a significant reminder that employing a foreign national without a work visa does not automatically grant an employer the right to terminate the employment contract summarily, CDH warned.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24202404/Screenshot-2025-07-24-at-21.20.52.png",
            "description": "<p>IOL SOUTH AFRICA – A foreign national employee must be provided with proper notice of their termination in line with the Basic Conditions of Employment Act (BCA). Failure to provide such notice may result in the termination being unlawful. This is the warning of employment law experts at Cliffe Dekker Hofmeyr (CDH), following a recent</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-the-eastern-cape-high-court-ruling-means-for-foreign-employee-terminations/\">What the Eastern Cape High Court ruling means for foreign employee terminations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "25 Jul 2025"
        },
        {
            "title": "Tens of thousands knocked offline after software failure at Musk’s Starlink",
            "url": "https://www.newzimbabwe.com/tens-of-thousands-knocked-offline-after-software-failure-at-musks-starlink/",
            "content": "The Guardian\n\nSpaceXs Starlink suffered one of its biggest international outages on Thursday when an internal software failure knocked tens of thousands of users offline, a rare disruption forElon Musks powerful satellite internet system.\n\nUsers began experiencing the outage at around 3pm EDT (1900 GMT), according to Downdetector, a crowdsourced outage tracker that said as many as 61,000 user reports to the site had been made.\n\nStarlink, which has more than 6 million users across roughly 140 countries and territories, later acknowledged the outage on its X account and said we are actively implementing a solution.\n\nStarlink service mostly resumed after 2.5 hours, Michael Nicolls, Starlink vice-president of Starlink Engineering, wrote on X.\n\nThe outage was due to failure of key internal software services that operate the core network, Nicolls said, apologizing for the disruption and vowing to find its root cause.\n\nMusk also apologized. Sorry for the outage.SpaceXwill remedy root cause to ensure it doesnt happen again, the SpaceX CEO wrote on X.\n\nThe outage was a rare hiccup for SpaceXs most commercially sensitive business that had experts speculating whether the service, known for its resilience and rapid growth, had been beset by a glitch, a botched software update or even a cyber-attack.\n\nDoug Madory, an expert at the internet analysis firm Kentik, said the outage was global and that such a sweeping interruption was unusual.\n\nThis is likely the longest outage ever for Starlink, at least while it became a major service provider, Madory said.\n\nAs Starlink has gained more users, SpaceX has focused heavily in recent months on updating its network to accommodate demands for higher speed and bandwidth.\n\nThe company, in a partnership with T-Mobile, is also expanding the constellation with larger, more powerful satellites to offer direct-to-cell text-messaging services, a line of business in which mobile phone users can send emergency text messages through the network in rural areas.\n\nSpaceX has launched more than 8,000 Starlink satellites since 2020, building a uniquely distributed network in low Earth orbit that has attracted intense demand from militaries, transportation industries and consumers in rural areas with poor access to traditional, fiber-based internet.\n\nId speculate this is a bad software update, not entirely dissimilar to the CrowdStrike mess with Windows last year, or a cyber-attack, said Gregory Falco, director of a space and cybersecurity laboratory at Cornell University.\n\nAn update to CrowdStrikes widely used cybersecurity software led to worldwide flight cancellations and affected industries around the globe in July last year. The outage disrupted internet services, affecting 8.5 million Microsoft Windows devices.\n\nIt was unclear whether Thursdays outage affected SpaceXs other satellite-based services that rely on the Starlink network. Starshield, the companys military satellite business unit, has billions of dollars worth of contracts with the Pentagon and US intelligence agencies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/22182245/starlink.jpeg",
            "description": "<p>The Guardian SpaceX’s Starlink suffered one of its biggest international outages on Thursday when an internal software failure knocked tens of thousands of users offline, a rare disruption for Elon Musk’s powerful satellite internet system. Users began experiencing the outage at around 3pm EDT (1900 GMT), according to Downdetector, a crowdsourced outage tracker that said as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tens-of-thousands-knocked-offline-after-software-failure-at-musks-starlink/\">Tens of thousands knocked offline after software failure at Musk’s Starlink</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "25 Jul 2025"
        },
        {
            "title": "Central Bank’s Financial Intelligence Unit officials arrested over US$2,500 extortion",
            "url": "https://www.newzimbabwe.com/central-banks-financial-intelligence-unit-officials-arrested-over-us2500-extortion/",
            "content": "By Staff Reporter\n\nTwo officials from the Reserve Bank of Zimbabwes Financial Intelligence Unit (FIU) have been arrested on allegations of extorting US$2,500 from a Bulawayo businessman, promising to facilitate the unfreezing of his bank accounts.\n\nThe two are Tonderai Makoni and Wisdom Mutami.\n\nAccording to the Zimbabwe Anti-Corruption Commission (ZACC), which arrested the two, their alleged accomplice, Clemence Nyamima, is still at large.\n\nThe two accused persons, acting in common purpose with a third accomplice, Clemence Nyamima (still at large), allegedly demanded money from a Bulawayo-based businessman whose accounts are frozen by the FIU, claiming Makoni will facilitate the unfreezing.\n\nIt is alleged that in May 2025, Mutami approached a businessman whose accounts are frozen by FIU, claiming he can facilitate the unfreezing of accounts by his relative, Makoni, ZACC said in a statement.\n\nIt is alleged that Mutami demanded US$3,000, which was later negotiated down to US$2,500.\n\nThe complainant made an initial payment of US$520 to Nyamimas mobile wallet, on Makonis instructions.\n\nThe balance of US$2,000 was later handed over in cash.\n\nDespite these payments, the complainants accounts remained frozen, and the accused persons became evasive, prompting the complainant to lodge a report with ZACC.\n\nMutami was arrested in Bulawayo on 23 July 2025 while Makoni was arrested in Harare.\n\nThe two are due to appear in court for initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>By Staff Reporter Two officials from the Reserve Bank of Zimbabwe’s Financial Intelligence Unit (FIU) have been arrested on allegations of extorting US$2,500 from a Bulawayo businessman, promising to facilitate the unfreezing of his bank accounts. The two are Tonderai Makoni and Wisdom Mutami. According to the Zimbabwe Anti-Corruption Commission (ZACC), which arrested the two,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/central-banks-financial-intelligence-unit-officials-arrested-over-us2500-extortion/\">Central Bank’s Financial Intelligence Unit officials arrested over US$2,500 extortion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "25 Jul 2025"
        },
        {
            "title": "Mineral wealth must benefit all Zimbabweans, not just a few – Mnangagwa",
            "url": "https://www.newzimbabwe.com/mineral-wealth-must-benefit-all-zimbabweans-not-just-a-few-mnangagwa/",
            "content": "By Anna Chibamu\n\nDeputy Finance Minister David Mnangagwa has said the Mines and Minerals Amendment Bill represents a bold step toward equitable economic reform, insisting Zimbabwes vast mineral wealth must uplift all citizens, not only a privileged minority.\n\nSpeaking Wednesday at a meeting with Zanu PF youths, government, and party officials at the partys headquarters, Mnangagwa said the long-awaited Bill offers a blueprint for a more inclusive and transparent mining sector.\n\nAmong the attendees were Youth Minister Tino Machakaire and Zanu PF National Political Commissar Munyaradzi Machacha. The gathering deliberated on the far-reaching provisions of the Bill.\n\nFrom the Ministry of Finances perspective, this Bill presents an opportunity not only to modernise the countrys mining governance framework, but also to lay the foundation for a more inclusive, transparent, and fiscally sustainable mining economy, Mnangagwa said.\n\nHe added that the ministry was particularly encouraged by the deliberate and progressive fiscal support mechanisms embedded in the Bill,provisions he said would attract new investment, improve compliance, and ensure Zimbabweans benefit fully from their mineral resources.\n\nZimbabwes mining sector, according to Mnangagwa, contributes over 60% of export earnings and nearly 13% of the national GDP. It directly and indirectly employs hundreds of thousands and is a key pillar in the countrys drive toward attaining Vision 2030.\n\nHowever, he lamented that outdated regulations, opaque licensing systems, and weak institutional coordination had long stifled growth in the sector.\n\nThe Mines and Minerals Amendment Bill responds directly to these challenges by introducing a robust and transparent framework that enables better fiscal planning, incentivises investment, and enhances accountability in the exploitation of mineral resources, he said.\n\nThe meeting also featured open dialogue with youths, who raised concerns over limited access to information and markets.\n\nRobert Togarepi, a youth from Gutu, highlighted the lack of resources available to young people seeking to participate in the mining sector. Meanwhile, Kumbirai Maunganidze from Harare expressed frustration over the absence of domestic markets for semi-precious stones.\n\nWe have vast amounts of semi-precious minerals, but theres no market for them in Zimbabwe. How can we be assisted to market these special stones, other than just gold? Maunganidze asked.\n\nIn response, Mnangagwa reaffirmed the ministrys commitment to implementing the fiscal tools in the Bill with diligence, integrity, and accountability.\n\nWe believe the Bill strikes the right balance between encouraging investment and ensuring that the State and citizens receive their fair share of the value extracted from our natural resources, he said.\n\nNotably, the Bill promotes local value addition by offering a full rebate on royalties for minerals used entirely within Zimbabwe. It also mandates the publication of mining contracts and revenue data, a move aligned with global best practices under the Extractive Industries Transparency Initiative (EITI).\n\nMnangagwa stressed that legislation alone is insufficient. He said the government was also rolling out complementary policy and institutional reforms, including the deployment of digital systems to enable real-time monitoring of mineral production and revenue flows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171542/david-mnangagwa-2.jpg",
            "description": "<p>By Anna Chibamu Deputy Finance Minister David Mnangagwa has said the Mines and Minerals Amendment Bill represents a bold step toward equitable economic reform, insisting Zimbabwe’s vast mineral wealth must uplift all citizens, not only a privileged minority. Speaking Wednesday at a meeting with Zanu PF youths, government, and party officials at the party’s headquarters,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mineral-wealth-must-benefit-all-zimbabweans-not-just-a-few-mnangagwa/\">Mineral wealth must benefit all Zimbabweans, not just a few – Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "25 Jul 2025"
        },
        {
            "title": "Impala triples platinum smelting in Zimbabwe with new plant",
            "url": "https://www.newzimbabwe.com/impala-triples-platinum-smelting-in-zimbabwe-with-new-plant/",
            "content": "Bloomberg\n\nThe plant, part of Zimplats Holdingss $1.8 billion expansion plan, has the capacity to process 380,000 tons of concentrate annually, Zimplats Chair Thandi Orleyn said at the smelters commissioning ceremony in Selous, 80 kilometers (50 miles) west of the capital Harare. The countrys biggest platinum miner has already allocated $1.1 billion of its 10-year investment plan, which runs through 2031, she added.\n\nThe plant is well positioned to handle feeds from other PGM producers presently in existence and in the future, she said, referring to so-called platinum group metals used in several industries for their resistance to corrosion and heat, as well as catalytic properties.\n\nThe expansion reflects a wider push across Africa to add value to natural resources before exporting them. Several mining operations in the continent have been seized or disrupted due to disputes with governments over taxes and investments, such as Barrick Mining Corps Loulo-Gounkoto gold complex in Mali. In Zimbabwe, the central banks retention of hard currency from exporters has been one of the challenges faced by producers.\n\nOrleyn told Bloomberg on the sidelines of the ceremony that the company has raised concerns about the countrys currency volatility with the Zimbabwean authorities.\n\nThere is a sense that this is a long-term relationship and the currency volatility in a geopolitical environment as we are facing at the moment is something to be expected, she said\n\nThe Southern African nation has the worlds third-largest platinum reserves after Russia and South Africa.\n\nZimbabwe generates more than half of its revenues from exports of minerals including gold, chrome and diamonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24195933/implats.jpg",
            "description": "<p>Bloomberg Impala Platinum Holdings Zimbabwe unit is tripling its processing capacity in the country and plans to handle concentrates from other mining firms at its new smelter. The plant, part of Zimplats Holdings’s $1.8 billion expansion plan, has the capacity to process 380,000 tons of concentrate annually, Zimplats Chair Thandi Orleyn said at the smelter’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/impala-triples-platinum-smelting-in-zimbabwe-with-new-plant/\">Impala triples platinum smelting in Zimbabwe with new plant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:14",
            "date": "25 Jul 2025"
        }
    ]
}