{
    "news": [
        {
            "title": "In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight",
            "url": "https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/",
            "content": "A power outage plunged parliament into darkness during President Emmerson Mnangagwas State of the Nation Address (SONA), forcing him to complete his speech using a torchlight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>A power outage plunged parliament into darkness during President Emmerson Mnangagwa’s State of the Nation Address (SONA), forcing him to complete his speech using a torchlight. Below are some images captured during the address. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/\">In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "Power outage disrupts SONA, President Mnangagwa completes speech using torchlight",
            "url": "https://www.newzimbabwe.com/power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/",
            "content": "By Mary Taruvinga\n\nPresident Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlightafter the New Parliament Building was plunged into darkness.\n\nThe unexpected blackout disrupted proceedings for several minutes, leaving the National Assembly in confusion.\n\nSome ruling party legislators shouted that the incident was an act of sabotage, while others murmured in disbelief.\n\nUnfazed, Mnangagwa continued reading his speech for nearly 10 minutes in the dark, earning applause from ZANU PF lawmakers for his composure.\n\nPower was restored shortly after Mnangagwa concluded his speech.\n\nIt was not immediately clear whether the power outage was caused by load-shedding or a technical fault.\n\nWe see it proper that we apologise to the President for the power outage. We shall go beyond and chase the culprit\n\nThe person who switched off electricity while the President was speaking will regret the day he was born, the Speaker of Parliament, Jacob Mudenda, said.\n\nThis is the second time such an incident has occurred during the Presidents address.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>By Mary Taruvinga President Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlight after the New Parliament Building was plunged into darkness. The unexpected blackout disrupted proceedings for several minutes, leaving the National Assembly in confusion. Some ruling party legislators shouted that the incident was an act</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/\">Power outage disrupts SONA, President Mnangagwa completes speech using torchlight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "Kadewere likely to miss AFCON due to knee injury",
            "url": "https://www.newzimbabwe.com/kadewere-likely-to-miss-afcon-due-to-knee-injury/",
            "content": "By Sports Reporter\n\nWarriors striker Tino Kadewere is likely to miss the 2025 Africa Cup of Nations (AFCON) after sustaining a knee injury.\n\nKadeweres injury was confirmed by his Greek club, Aris Thessaloniki, in a statement released on Monday.\n\nAccording to the club, the 29-year-old Zimbabwe international will be sidelined for up to three months as he is set to undergo surgery.\n\nUnfortunately, the news is not good for Tino Kadewere. According to the MRI results, the 29-year-old Zimbabwe international striker, who was injured in training, suffered a torn medial meniscus in his right knee and will undergo immediate surgery, Aris Thessaloniki said.\n\nThe injury setback comes barely a week after Kadewere returned from a one-month layoff due to a separate injury.\n\nHe also missed Zimbabwes World Cup qualifiers against South Africa and Lesotho earlier this year.\n\nKadeweres absence would be a major blow for the Warriors, who are preparing for their return to the continental stage at AFCON 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28062700/Tino-Kadewere.webp",
            "description": "<p>By Sports Reporter Warriors striker Tino Kadewere is likely to miss the 2025 Africa Cup of Nations (AFCON) after sustaining a knee injury. Kadewere’s injury was confirmed by his Greek club, Aris Thessaloniki, in a statement released on Monday. According to the club, the 29-year-old Zimbabwe international will be sidelined for up to three months</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-likely-to-miss-afcon-due-to-knee-injury/\">Kadewere likely to miss AFCON due to knee injury</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "SAPES Trust firebombed, guard abducted ahead of National Press Conference challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/sapes-trust-firebombed-guard-abducted-ahead-of-national-press-conference-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nThe Southern Africa Political Economy Series (SAPES) Trusts premises were gutted by fire in a suspected arson attack and a security guard on duty was allegedly abducted by unknown assailants around midnight.\n\nSAPES Trust Director, Ibbo Mandaza, said the attack targeted the seminar room, which is regularly used as a venue for meetings and press conferences.\n\nSAPES Trust is scheduled to host a National Press Conference this morning against ZANU PFs Agenda 2030, which Mandaza says will go ahead despite the setback.\n\nSAPES Trust Director Ibbo Mandaza\n\nThis is to announce that theres been another arson attack (the first was in August 2023 ahead of the elections) at SAPES Trust at midnight, with the PanAfrika Restaurant on fire and the security staff overtaken by a group of armed attackers.\n\nThis is hardly a coincidence: thereis the National Press Conference against the 2030 Agenda scheduled for 11 am at SAPES Trust today 28 October.\n\nIt was an organised attack at 12:40 am today: the main target was the SAPES Trust Seminar Room, the usual venue for meetings, which has been left gutted to the ground by fire; and then they abducted the guard on duty after locking up the gate with two padlocks, Mandaza said on his X account on Tuesday.\n\nThe attack follows a fierce debate on X and public forums regarding the constitutional procedures that must be followed to amend the Constitution to allow Mnangagwa to rule until 2030, beyond his term limit ending in 2028.\n\nTop Harare lawyer, Thabani Mpofu, condemned the attack, describing itas an act of cowardice.\n\nThis is just not right. This cowardly act must be condemned in the strongest terms possible. How can we live in a country that fears words? Mpofu wrote on his X account on Tuesday morning.\n\nWriting on his X account on Tuesday morning, self-exiled former Cabinet Minister, Saviour Kasukuwere, said the bombing of SAPES Trust is a shameful act.\n\nThis is shameful. A leopard cannot change its spots! We have to choose hope over fear.\n\nAlthough Mnangagwa styles himself as a constitutionalist and has declined to plan for running beyond 2028, he has done little to stop those who are canvassing support for him to continue in power until 2030.\n\nThe calls for Mnangagwa to continue beyond 2028 have caused fissures within his ruling party, Zanu PF.\n\nAnalysts have warned that the succession battle in Zanu PF could cause chaos and violence in the country, as they believe that the calls for Mnangagwa to go beyond 2028 are purely a strategy to frustrate his deputy, Rtd Constantino Chiwenga, who is widely expected to take over.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28062421/sapes.jpeg",
            "description": "<p>By Staff Reporter The Southern Africa Political Economy Series (SAPES) Trust’s premises were gutted by fire in a suspected arson attack and a security guard on duty was allegedly abducted by unknown assailants around midnight. SAPES Trust Director, Ibbo Mandaza, said the attack targeted the seminar room, which is regularly used as a venue for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sapes-trust-firebombed-guard-abducted-ahead-of-national-press-conference-challenging-mnangagwas-term-extension/\">SAPES Trust firebombed, guard abducted ahead of National Press Conference challenging Mnangagwa’s term extension</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "When constitutions are trampled, democracy dies – regional labour body rejects ZANU PF plan to extend Mnangagwa’s term",
            "url": "https://www.newzimbabwe.com/when-constitutions-are-trampled-democracy-dies-regional-labour-body-rejects-zanu-pf-plan-to-extend-mnangagwas-term/",
            "content": "By Alois Vinga\n\nThe African Regional Organisation of the International Trade Union Confederation (ITUC-Africa), which represents over 18 million workers across the continent, has strongly rejected ZANU PFs plans to extend President Emmerson Mnangagwas term.\n\nThe ruling ZANU-PF party recently endorsed a proposal to delay the 2028 general elections, extending Mnangagwas term by two years to 2030. The resolution, adopted at the partys annual conference in Mutare, directed the ruling partys Legal Affairs Secretary to begin drafting the necessary constitutional amendments.\n\nMnangagwa is currently serving his second and final term, as is mandated by the constitution. While he has previously described himself as a constitutionalist, adding he will step down in 2028, he has done nothing to oppose his loyalists, who are pushing for him to hang onto power.\n\nIn a statement of solidarity with the Zimbabwe Congress of Trade Unions (ZCTU), ITUC-Africa Secretary General Joel Odigie said African workers have consistently upheld democracy and constitutionalism as the foundation of peace, justice, and shared prosperity.\n\nITUC-Africa Secretary General JoelOdigie\n\nWe join ZCTU in urging African citizens, civil society, and the labour movement to remain vigilant and steadfast in defending the integrity of their constitutions, said Odigie.\n\nSocieties that work are those governed by the rule of law, not the law of force. When constitutions are trampled, democracy dies and with it, the hopes of workers for decent work, social justice, and equitable development.\n\nOdigie called on African Union member states, regional economic communities, and global partners to reaffirm their commitment to constitutional rule and accountable democratic governance as essential pillars of Africas transformation agenda.\n\nThe continental labour leader also rejected military involvement in civil governance and condemned civilian coups, where leaders manipulate constitutions to unlawfully extend their stay in power.\n\nHe further criticised attempts to silence opposition voices, manipulate electoral systems, or stage sham elections designed to entrench authoritarian rule, saying such actions erode hard-won democratic gains.\n\nWe commend leaders across Africa who have resisted the temptation to alter term limits or manipulate constitutions for personal gain. These are true statespersons, guardians of constitutional democracy worthy of respect by future generations, Odigie said.\n\nHe added that leaders who dismantle constitutional order and weaken democratic institutions for the sake of political survival corrode governance, polarise societies, and expose their nations to instability, insecurity, and economic decline.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Alois Vinga The African Regional Organisation of the International Trade Union Confederation (ITUC-Africa), which represents over 18 million workers across the continent, has strongly rejected ZANU PF’s plans to extend President Emmerson Mnangagwa’s term. The ruling ZANU-PF party recently endorsed a proposal to delay the 2028 general elections, extending Mnangagwa’s term by two years</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/when-constitutions-are-trampled-democracy-dies-regional-labour-body-rejects-zanu-pf-plan-to-extend-mnangagwas-term/\">When constitutions are trampled, democracy dies – regional labour body rejects ZANU PF plan to extend Mnangagwa’s term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals",
            "url": "https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/",
            "content": "By Thandiwe Garusa\n\nA police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura.\n\nThe weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two counts of murder, attempted murder, and possession of an illegal firearm.\n\nNational police spokesperson Assistant Commissioner Paul Nyathi confirmed the findings, saying, The gun which killed the policeman is the same pistol which killed the businessman Mutangadura.\n\nMutangadura was murdered on the night of August 17, 2025, when seven armed robbers wearing balaclavas stormed his farmhouse. They attacked a security guard and the businessmans son before shooting him.\n\nSo far, police have arrested three suspects: Given Mandizadza (34), Phillip Mutasa (38), and Vengesai Jabulani Mutasa, while four other accomplices remain at large.\n\nVengesai Jabulani Mutasa\n\nVengesai initially shot Detective Constable Ngwenya of CID Homicide, who was part of a team trying to apprehend him for Mutangaduras murder, before fleeing arrest.\n\nHe later went to the police station on Sunday, where he found Constable Courage Muchechesi taking a statement from Abraham Mavayo, who was reporting an assault case.\n\nPolice said Vengesai confronted officers at the station, accusing homicide detectives of stealing US$1,000 from his home and demanding to see them.\n\nHe allegedly forced Constable Muchechesi and Mavayo to lie down while demanding money before shooting Muchechesi in the stomach.\n\nMuchechesi staggered out of the building, calling for help, and collapsed near the single quarters where he was later found dead by fellow officers.\n\nHe fled the station and was later arrested by residents from Sanyati, Kadoma, Chakari, and Patchway who had joined forces to track him down.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Thandiwe Garusa A police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura. The weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/\">Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "28 Oct 2025"
        }
    ]
}