{
    "news": [
        {
            "title": "e.tv cancels SAFTA-winning Scandal! after two decades of TV drama",
            "url": "https://www.newzimbabwe.com/e-tv-cancels-safta-winning-scandal-after-two-decades-of-tv-drama/",
            "content": "News24\n\nScandal! the SAFTA award-winning soap opera that has been the heartbeat of South African television for more than two decades, will conclude its broadcast on e.tv in June 2026.\n\nAfter more than twenty years of keeping us on the edge of our seats, the beloved drama is taking its final bow.\n\nOver the years and since its debut in January 2005, Scandal! became more than a TV show  it was, for many South Africans, an appointment that couldnt be missed.\n\nThe ever-changing television landscape requires broadcasters to consistently review all programming and scheduling, and we believe that Scandal! has reached the end of its life cycle, e.tv said in a statement.\n\nWe would like to sincerely thank the millions of loyal fans who have welcomed Scandal! into their homes over the years and supported it in becoming one of the most successful long-running soap operas in South African television history.\n\nWhat made Scandal! special wasnt just its dramatic plot twists or memorable characters -though there were plenty of both.\n\nThe series became a mirror reflecting the complexities of everyday South African life, tackling real issues that resonated with viewers across the country. For almost two decades, it sparked conversations in homes, workplaces and social media spaces, providing entertainment that felt authentically local.\n\nIt gave local actors, writers, directors, and production teams a platform to showcase their talents while telling South African stories.\n\nHelga Palmer, group head of local programming and strategy at eMedia, captured the bittersweet nature of this farewell:We are proud of what Scandal! has achieved, not only as a top-rated television property but also as a vital part of South Africas cultural landscape.\n\nWe thank the entire production team, the cast past and present, and our loyal viewers for making this journey extraordinary.\n\ne.tv has extended heartfelt gratitude to Ochre Media, the production company that brought Scandal! to life throughout its run.\n\nStan Joseph, executive producer at Ochre Moving Pictures, reflected on what the series has meant to everyone involved:Producing Scandal! has been an incredible journey and a true labour of love. For close to twenty years, our writers, directors, actors and crew have poured their hearts into bringing authentic South African stories to life.\n\nJoseph continued: We are deeply grateful to e.tv for their trust and to our audiences for their unwavering support. While it is bittersweet to say goodbye, we are proud of the legacy that Scandal! leaves behind.\n\nScandal! will continue to air until the end of June 2026, giving viewers time to process this goodbye while ensuring the series receives the send-off it deserves.\n\nFor fans, this means they have a few more months to savour every episode, every plot twist, every character moment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/26164213/scandal.jpg",
            "description": "<p>News24 Scandal! the SAFTA award-winning soap opera that has been the heartbeat of South African television for more than two decades, will conclude its broadcast on e.tv in June 2026. After more than twenty years of keeping us on the edge of our seats, the beloved drama is taking its final bow. Over the years</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/e-tv-cancels-safta-winning-scandal-after-two-decades-of-tv-drama/\">e.tv cancels SAFTA-winning Scandal! after two decades of TV drama</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "26 Sep 2025"
        },
        {
            "title": "Malawi football giants hit by FIFA ban after failing to settle Ronald Chitiyo’s debt",
            "url": "https://www.newzimbabwe.com/malawi-football-giants-hit-by-fifa-ban-after-failing-to-settle-ronald-chitiyos-debt/",
            "content": "By Sports Reporter\n\nFIFA has banned Malawi football giants Nyasa Big Bullets from registering new players for the next three seasons after the club failed to pay Zimbabwe international midfielder Ronald Chitiyo his outstanding dues.\n\nNyasa Big Bullets was found guilty of terminating Chitiyos contract without following proper procedures and was ordered to pay the player US$15,200 in compensation. The club failed to settle the amount within the 45-day deadline.\n\nChitiyo signed a three-year contract with Nyasa Big Bullets on 2 April 2024, but he played only one season before his contract was unlawfully terminated. During his time at the club, he was coached by Zimbabwean Kalisto Pasuwa, who has since left Nyasa Big Bullets and now leads the Malawi mens national team.\n\nChitiyo currently plays for Green Fuel FC, a club he joined upon returning from Malawi earlier this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/03055156/Zimbabwean-Ronald-Chitiyo-joins-FCB-Nyasa-Big-Bullets-on-a-three-year-deal-until-March-2027-1024x707-1.jpeg",
            "description": "<p>By Sports Reporter FIFA has banned Malawi football giants Nyasa Big Bullets from registering new players for the next three seasons after the club failed to pay Zimbabwe international midfielder Ronald Chitiyo his outstanding dues. Nyasa Big Bullets was found guilty of terminating Chitiyo’s contract without following proper procedures and was ordered to pay the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malawi-football-giants-hit-by-fifa-ban-after-failing-to-settle-ronald-chitiyos-debt/\">Malawi football giants hit by FIFA ban after failing to settle Ronald Chitiyo’s debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "26 Sep 2025"
        },
        {
            "title": "High Court lifts asset freeze on businessman Zangairai’s 24 properties, slams Prosecutor-General for “inaction”",
            "url": "https://www.newzimbabwe.com/high-court-lifts-asset-freeze-on-businessman-zangairais-24-properties-slams-prosecutor-general-for-inaction/",
            "content": "By Mary Taruvinga\n\nThe High Court has lifted a two-year asset freeze on properties belonging to businessman Tobias Zangairai, ruling that the Prosecutor-General failed to act on allegations of unexplained wealth despite obtaining an interim order in 2023.\n\nJustice Benjamin Chikowero said it would be unjust to keep the order in place indefinitely without prosecution or civil forfeiture proceedings.\n\nThe order was never meant to remain in force in perpetuity, ruled Justice Chikowero. The Prosecutor-General has not taken advantage of that order by taking positive action. As I write this judgment, no criminal prosecution of the applicant for any serious crime vis--vis some or all of those properties has seen the light of day.\n\nThe case dates back to January 27, 2023, when the court, at the request of the Prosecutor-General, granted an unexplained wealth order and an interim freezing order against Zangairai.\n\nHe was required to explain how he acquired 24 immovable and movable assets, including residential stands across Harare, Bulawayo, Beitbridge, Mutare, and a fleet of vehicles ranging from a Toyota Hilux to a Nissan Civilian bus.\n\nZangairai complied, submitting a sworn statement to the Zimbabwe Republic Polices Asset Forfeiture Unit within the required 30 days.\n\nHowever, since then, the state took no further steps to prosecute him or apply for civil forfeiture.\n\nIn his defence, Zangairai argued that the prolonged freeze violated his constitutional right to use and enjoy his property.\n\nSection 71(2) of Zimbabwes Constitution guarantees every citizen the right to acquire, hold, occupy, use, transfer, hypothecate, lease or dispose of all forms of property.\n\nThe judge criticised the Prosecutor-Generals office for keeping Zangairais assets in limbo for more than two-and-a-half years without justification.\n\nIn these circumstances, it was not surprising that counsel for the first respondent was unable to make any meaningful submissions, Justice Chikowero said.\n\nIt would be unjust not to accede to the application for the setting aside of the interim freezing order.\n\nThe court ruled that Zangairai can now freely deal with his 24 assets, which include prime land in Marlborough, Salisbury Township, Mahatshula in Bulawayo, Chikanga in Mutare, and multiple stands in Beitbridge, along with vehicles such as a Toyota Nadia, Nissan Hardbody, Mazda Capella, and several Toyota Hiace minibuses.\n\nThe High Court formally granted Zangairais application, struck out a related case (HCHACC 130/24), and ordered that each party bear its own legal costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has lifted a two-year asset freeze on properties belonging to businessman Tobias Zangairai, ruling that the Prosecutor-General failed to act on allegations of unexplained wealth despite obtaining an interim order in 2023. Justice Benjamin Chikowero said it would be “unjust” to keep the order in place indefinitely without prosecution</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-lifts-asset-freeze-on-businessman-zangairais-24-properties-slams-prosecutor-general-for-inaction/\">High Court lifts asset freeze on businessman Zangairai’s 24 properties, slams Prosecutor-General for “inaction”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "26 Sep 2025"
        },
        {
            "title": "VP Chiwenga declares zero tolerance to corruption, tender manipulation amid Zanu PF succession tensions",
            "url": "https://www.newzimbabwe.com/vp-chiwenga-declares-zero-tolerance-to-corruption-tender-manipulation-amid-zanu-pf-succession-tensions/",
            "content": "By Staff Reporter\n\nVice President Constantino Chiwenga has once again pledged zero tolerance for tender manipulation and corrupt practices, which continue to plague Zimbabwe and undermine service delivery.\n\nHis latest remarks, delivered Thursday at the Construction Industry Federation of Zimbabwe annual congress in Masvingo, come just days after he reportedly presented an explosive corruption dossier at a Zanu PF Politburo meeting in Harare.\n\nThe dossier is said to have stoked tensions within the ruling party, allegedly prompting President Emmerson Mnangagwa to cut short his trip to the United Nations General Assembly in New York. This at a time when Zimbabwe is lobbying for a seat on the UN Security Council.\n\nWe cannot and will not tolerate corruption, tender manipulation, or unethical dealings that undermine confidence and compromise delivery, Chiwenga declared.\n\nHe painted a grim picture of the damage corruption has done to Zimbabwes global reputation, stressing that economic growth rests on honesty and sacrifice.\n\nAll thriving economies the world over were built through sacrifice, honesty, and hard work, he said. Unethical dealings result in public outrage and diminished consumer confidence, which can significantly damage the reputation of companies and individuals, ultimately affecting future business opportunities and national development.\n\nChiwenga has previously derided corrupt business figures as zvigananda,a Shona term describing those who amass ill-got wealth. While he has not publicly named tycoons such as Wicknell Chivayo, Kudakwashe Tagwirei, or Paul Tungwarara, reports suggest their names feature in the dossier he presented to the Politburo.\n\nControversial businessman Wicknell Chivayo has been implicated in a US$40 million tender awarded by the Zimbabwe Electoral Commission (ZEC) to supply electoral materials for the 2023 general elections, where prices were allegedly inflated by 235%. He was also linked to a scandal over a government contract worth approximately US$437 million for the supply of cancer treatment equipment, awarded without a transparent tendering process.\n\nMnangagwas adviser to the UAE, Paul Tungwarara, through his company Prevail Group International, was contracted under the Presidential Borehole Scheme to drill thousands of solar-powered boreholes across the country, a tender critics say was awarded opaquely.\n\nSimilarly, Sakunda Holdings, a company linked to Kudakwashe Tagwirei, secured contracts worth over US$1 billion to supply inputs under Zimbabwes Command Agriculture scheme without an open tender, with more than US$280 million in funds reported as unaccounted for.\n\nThe VPsanti-graft salvo comes amid an intensifying succession battle between factions loyal to Mnangagwa and Chiwenga, with some analysts warning the rift could escalate to a coup.\n\nMnangagwa recently reshuffled the Politburo, demoting Chiwenga ally Obert Mpofu from the influential post of Secretary General to a less significant ICT portfolioan apparent move to weaken Chiwengas hand in the power struggle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/26072826/Chiwenga-scaled.webp",
            "description": "<p>By Staff Reporter Vice President Constantino Chiwenga has once again pledged zero tolerance for tender manipulation and corrupt practices, which continue to plague Zimbabwe and undermine service delivery. His latest remarks, delivered Thursday at the Construction Industry Federation of Zimbabwe annual congress in Masvingo, come just days after he reportedly presented an explosive corruption dossier</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vp-chiwenga-declares-zero-tolerance-to-corruption-tender-manipulation-amid-zanu-pf-succession-tensions/\">VP Chiwenga declares zero tolerance to corruption, tender manipulation amid Zanu PF succession tensions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "26 Sep 2025"
        },
        {
            "title": "Sikandar Raza banks on home support as T20 World Cup Africa Qualifiers begin",
            "url": "https://www.newzimbabwe.com/sikandar-raza-banks-on-home-support-as-t20-world-cup-africa-qualifiers-begin/",
            "content": "By Sports Reporter\n\nZimbabwe mens T20 captain Sikandar Raza says home support will be key as the Chevrons begin their campaign in the ICC Mens T20 World Cup Africa Qualifiers, which kick off this Friday in Harare.\n\nThe tournament, running until October 4, will be staged across two venues,Takashinga Sports Club in Highfield and Harare Sports Club.\n\nZimbabwe have been drawn in Group B alongside Botswana, Tanzania, and Uganda, while Group A features Malawi, Namibia, Nigeria, and Kenya. The top two teams will qualify for the 2026 ICC Mens T20 World Cup, set to be hosted by Sri Lanka and India.\n\nRaza expressed confidence ahead of the competition, insisting that playing at home should inspire rather than pressure the side.\n\nI feel very confident that we will be at the World Cup. Some may look at playing at home as pressure, but I see it as support. Our fans give us so much energy, and I believe wewill be the team with the biggest backing throughout the tournament. I cannot wait for the competition to start, he said.\n\nZimbabwe begin their campaign against Uganda at Harare Sports Club on Friday, while Tanzania face Botswana at Takashinga. Both matches start at 13:50.\n\nThe Chevrons head into the tournament in buoyant form, having defeated Kenya by nine wickets on Monday before sealing a 47-run victory over Nigeria in Wednesdays warm-up match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/09154225/Sikandar-Raza-on-Fire.png",
            "description": "<p>By Sports Reporter Zimbabwe men’s T20 captain Sikandar Raza says home support will be key as the Chevrons begin their campaign in the ICC Men’s T20 World Cup Africa Qualifiers, which kick off this Friday in Harare. The tournament, running until October 4, will be staged across two venues, Takashinga Sports Club in Highfield and Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sikandar-raza-banks-on-home-support-as-t20-world-cup-africa-qualifiers-begin/\">Sikandar Raza banks on home support as T20 World Cup Africa Qualifiers begin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "26 Sep 2025"
        }
    ]
}