{
    "news": [
        {
            "title": "ZCTU decries globalisation’s impact on workers’ rights",
            "url": "https://www.newzimbabwe.com/zctu-decries-globalisations-impact-on-workers-rights/",
            "content": "THE Zimbabwe Congress of Trade Unions (ZCTU) has bemoaned globalisations impact on workers rights on the back of calls for stakeholders to devise strategies to ease the tide.\n\nSpeaking at the occasion to launch the Association for Labour Practitioners in Zimbabwe (ALPZ) last week, acting ZCTU Secretary General, Runesu Dzimiri said despite the positives derived from globalisation it has presented challenges for the working class.\n\nGlobalisation significantly impacts local labour laws, potentially leading to increased competition and pressure for deregulation. globalisation, characterised by increased international trade and investment, creates a competitive landscape where businesses seek to minimise costs, including labour costs.\n\nThis pressure can lead to demands for deregulation of labour laws, such as weakening minimum wage laws, reducing worker protections, and undermining collective bargaining rights. Companies may relocate production or services to countries with lower labour costs, leading to job losses and economic hardship in developed nations, he said.\n\nDzimiri said globalisation can lead to a race to the bottom where countries compete to attract investment by lowering labour standards, potentially leading to exploitation of workers.\n\nHe charged labour practitioners in the country to ensure the crafting of trade agreements that promote fair labour standards and enforcing labour laws.\n\nThe ZCTU leader said governments can strengthen labour laws and enforcement mechanisms to protect workers rights, including minimum wages, collective bargaining rights, and workplace safety regulations.\n\nRaising public awareness about the impacts of globalisation on labour rights can help to build support for policies that protect workers, added Dzimiri.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/09190825/Granite-mine-Zimbabwe_Alamy_2HJAHWD.jpeg",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) has bemoaned globalisation’s impact on worker’s rights on the back of calls for stakeholders to devise strategies to ease the tide. Speaking at the occasion to launch the Association for Labour Practitioners in Zimbabwe (ALPZ) last week, acting ZCTU Secretary General, Runesu Dzimiri said despite</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zctu-decries-globalisations-impact-on-workers-rights/\">ZCTU decries globalisation’s impact on workers’ rights</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Africa’s debt crisis under-reported: AFRODAD",
            "url": "https://www.newzimbabwe.com/africas-debt-crisis-under-reported-afrodad/",
            "content": "By Mary Taruvinga in Johannesburg\n\nAFRICAN Forum and Network on Debt and Development (AFRODAD) Executive Director Jason Braganza has expressed concern over how challenges arising from debt servicing to international monetary facilities by African countries are going unreported due to lack of information and statistics among other challenges.\n\nBraganza was speaking at the official opening of the 5th edition of the AFRODAD Media Initiative (AFROMedI) held in Sandton, Johannesburg, South Africa recently.\n\nWith half of the continent currently being in debt distress, Braganza said the need to capacitate the media for the benefit of the public and holding authorities accountable.\n\nDespite these very grave economic challenges, the role of media in reporting these challenges and the diversion of much-needed resources to debt servicing is largely going unreported.\n\nLack of information, accompanied by inaccessible debt statistics and public reporting, is undermining the publics ability to interact and play its role in holding government to account.\n\nIn Africa, as of today, more than half of the continent is facing a situation of being in debt distress or at high risk of being in debt distress, he said.\n\nFour countries have already defaulted on their debt: these are Zambia, Chad, Ethiopia, and more recently, Ghana.\n\nAccording to Braganza close to half the continents countries are paying more in debt service interest repayments than on investments in public services such as education, health, water, and sanitation.\n\nThe fifth edition of the AFROMedi was attended by 45 journalists drawn from 31 African countries.\n\nAfrodad is a Pan-African civil society organisation established over 25 years ago with the single objective of advancing African voices on issues of public debts and development finance. We are currently headquartered in Zimbabwe.\n\nThrough this years AFROMedi V, journalists were capacitated to link reparations to global development processes and to prioritise in-depth reporting that advances Africas position on reparative justice with a keen focus on public debt and related issues including taxation, trade, labour, climate finance, and legal elements of debt among others.\n\nAfrodad Executive Director urged journalists to keep in mind how this situation is undermining Africas sovereignty, emancipation from a neo-liberal, private profit-based world order, leaving Africans in a perpetual state of poverty, inequality, and indebtedness.\n\nIt is, therefore, fitting that the African Union theme of 2025 is on reparations and reparative justice for the continent, he said.\n\nSpeaking at the same event, Christian Ayiku, Afrodads Trustee member and Ghanaian economic analyst based in South Africa echoed Braganzas sentiments stating that the current debt crises Africa is facing threatens to reverse years of development gains and historical debt relief efforts.\n\nFrom the African Debt Risk Map, countries like Sudan, Somaliland, Somalia, Ghana, Sao Tome & Principe, Congo Republic, Zambia, Mozambique, Malawi, Zimbabwe, Cameroon, Angola, Central African Republic, South Sudan, Ethiopia, Chad, Eritrea, Djibouti, Gambia, Guinea-Bissau, Sierra Leone, Tunisia and Kenya are struggling from a heavy burden of debt.\n\nThe role of the media in this campaign is crucial as they are empowered to set the agenda that works for the people of the continent, he said.\n\nAFRODAD through AFROMedi, and its partners, has been working with the media to set public debt and linked issues on the agenda as a priority.\n\nThis has also played a key role in democratising the debt discourse, thus giving citizens the power to influence debt policy through electoral choices.\n\nThe media plays a crucial role in shaping public discourse, influencing policy decisions and bringing attention to socio-economic issues.\n\nTherefore, empowering journalists to set an agenda that aims at ensuring accountability and keeping people informed on key processes remains crucial.\n\nIt is important to engage journalists in this process to ensure citizens are informed and engaged.\n\nIn a nutshell, AfroMedi will offer increased capacity to report on debt reparative justice, through humanising the issues, focusing on data-driven reporting, offering historical context of injustice and proffering policy solutions from interviews with technical persons in the civil society space.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30043408/Gm4TGpcXUAA0YhU.jpeg",
            "description": "<p>By Mary Taruvinga in Johannesburg  AFRICAN Forum and Network on Debt and Development (AFRODAD) Executive Director Jason Braganza has expressed concern over how challenges arising from debt servicing to international monetary facilities by African countries are going unreported due to lack of information and statistics among other challenges. Braganza was speaking at the official opening</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africas-debt-crisis-under-reported-afrodad/\">Africa’s debt crisis under-reported: AFRODAD</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Zanu PF activists’ homes vandalised as intra-party violence escalates amid Mnangagwa’s 2030 agenda push",
            "url": "https://www.newzimbabwe.com/zanu-pf-activists-homes-vandalised-as-intra-party-violence-escalates-amid-mnangagwas-2030-agenda-push/",
            "content": "By Staff Reporter\n\nA WAVE of politically motivated violence rocked in Zvimba West constituency Friday night as unknown assailants targeted the homes of two Zanu PF officials, smashing all their windows.\n\nThe first attack took place at the residence of Gloria Padzarondora, the Vice Chairlady of Manyame Zanu PF District, while the second, occurring just 2km away, targeted Thomas Mapfumo, another district member.\n\nThe coordinated nature of the incidents has heightened fears of escalating political violence in the constituency.\n\nThe victims are part of Zanu PF activists opposed to President Emmerson Mnangagwas 2030 agenda.\n\nA disturbing incident of vandalism occurred last night in Chiyangwa village, Zvimba West constituency, where Gloria Padzarondoras house was targeted.\n\nAll the windows were smashed by a gang of unknown assailants, who then fled the scene in a white twin-cab vehicle.\n\nWhat makes this incident even more concerning is that Padzarondora is a prominent figure in the area, serving as the Vice Chairlady of Manyame Zanu PF District.\n\nHer involvement in the last election, campaigning for Mercy Dinha against Justice Minister Ziyambi Ziyambi, may have contributed to the suspected politically motivated violence, sources told NewZimbabwe.com.\n\nMeanwhile, another district member in Zanu PF Manyame district Thomas Mapfumos house was also vandalised.\n\nAnother disturbing incident of vandalism has occurred in Zvimba West constituency, where Thomas Mapfumos house was targeted, with all windows smashed by unknown assailants.\n\nWhat is even more concerning is that this incident happened on the same night as the vandalism at Gloria Padzarondoras residence, which is approximately 2km away.\n\nThe fact that both incidents occurred on the same night suggests a possible connection or a coordinated effort by the perpetrators.\n\nIt is essential for the authorities to investigate these incidents thoroughly and take necessary measures to prevent such occurrences in the future, sources added.\n\nRecently, another vocal anti-2030 advocate, Gifford Gomwes house and car were destroyed in another attack suspected to have been the genesis of a terror campaign to silence opponents of Mnangagwas push for a third presidential term or suspension of elections due in 2028.\n\nThis comes at a time political tensions in the ruling party Zanu PF are heating up with two factions publicly fighting each other.\n\nOne loyal to Mnangagwa is advocating for the suspension of the 2028 elections to allow him to remain in power until 2030 and the other, believed to be aligned to Vice President Constantino Chiwenga, pushing for adherence to the constitutional term limits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/30042037/IMG-20250328-WA0026.jpg",
            "description": "<p>By Staff Reporter A WAVE of politically motivated violence rocked in Zvimba West constituency Friday night as unknown assailants targeted the homes of two Zanu PF officials, smashing all their windows. The first attack took place at the residence of Gloria Padzarondora, the Vice Chairlady of Manyame Zanu PF District, while the second, occurring just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-activists-homes-vandalised-as-intra-party-violence-escalates-amid-mnangagwas-2030-agenda-push/\">Zanu PF activists’ homes vandalised as intra-party violence escalates amid Mnangagwa’s 2030 agenda push</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "15 perish in weekend road accidents",
            "url": "https://www.newzimbabwe.com/15-perish-in-weekend-road-accidents/",
            "content": "By Staff Reporter\n\nA TOTAL of 15 people died in road accidents on Saturday while several others were injured, the Zimbabwe Republic Police (ZRP) has announced.\n\nThe fatal accidents, according to police spokesperson, Commissioner Paul Nyathi took place in Norton, Chegutu and Mutare.\n\nOne among those who died is an infant.\n\nIn one of the road traffic accidents, seven people were killed while 12 others were injured when a Nissan Caravan kombi with 20 passengers on board veered off the road and overturned before landing on its left side at the 30 kilometre peg along Harare-Bulawayo road at around 1625 hours.\n\nAs a result, three adults and an infant died on the spot while three others succumbed to the injuries upon admission at Norton Hospital, Nyathi said.\n\nAnother accident took place at the 85 kilometre peg along Harare -Bulawayo Road at around 1732 hours.\n\nThree people were killed while two others were injured when a Chevrolet Trail Blazer vehicle with five passengers on board collided with a Toyota Hilux vehicle with seven passengers on board.\n\nThe Chevrolet Trail Blazer vehicle had allegedly tried to overtake the Toyota Hilux vehicle which was turning right.\n\nSubsequently, the Chevrolet Trail Blazer vehicle hit the Toyota Hilux vehicle on the right lamp. The Toyota Hilux vehicle overturned before landing on its left side, Nyathi said.\n\nTwo injured victims were admitted at Chegutu General Hospital.\n\nTwo people were killed while nine others were injured when a Toyota Townace truck with eleven passengers on board veered off the road at a curve along Pickstone-Burn Bank Road, Chegutu at around 1545 hours.\n\nAs a result, all the passengers in the loading box were thrown out of the vehicle.\n\nThe bodies of the victims were taken to Chegutu General Hospital mortuary for post-mortem while the injured are admitted at the same hospital.\n\nIn Mutare, three people were killed when a Volvo haulage truck with three passengers on board veered off the road and overturned before landing on its roof at around 1030 hours along Harare-Mutare road near Wise Owl turn-off.\n\nThe bodies of the victims were taken to Victoria Chitepo Provincial Hospital mortuary for post mortem.\n\nThe police implored motorists to observe all road rules and regulations and exercise extreme caution to safeguard lives on the roads.\n\nDrivers should be patient, observant, avoid speeding and overtaking in situations which are not safe to do so.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/23153441/Mpilo-hospital-CEO-Mabhande-accident.jpeg",
            "description": "<p>By Staff Reporter  A TOTAL of 15 people died in road accidents on Saturday while several others were injured, the Zimbabwe Republic Police (ZRP) has announced. The fatal accidents, according to police spokesperson, Commissioner Paul Nyathi took place in Norton, Chegutu and Mutare. One among those who died is an infant. “In one of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/15-perish-in-weekend-road-accidents/\">15 perish in weekend road accidents  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Myanmar earthquake: death toll rises to almost 700 as search for survivors continues",
            "url": "https://www.newzimbabwe.com/myanmar-earthquake-death-toll-rises-to-almost-700-as-search-for-survivors-continues/",
            "content": "By The Guardian\n\nTHE death toll from a huge earthquake that hit Myanmar has reached almost 700, as rescuers dig through the rubble of collapsed buildings in a desperate search for survivors.\n\nThe shallow 7.7-magnitude quake struck northwest of the city of Sagaing in central Myanmar in the early afternoon, followed minutes later by a 6.7-magnitude aftershock.\n\nThe quake destroyed buildings, downed bridges, and buckled roads across swathes of Myanmar, with severe damage reported in the second biggest city, Mandalay.\n\nAt least 694 people were killed and nearly 1,700 injured in Myanmars Mandalay region  believed to be the worst affected  the ruling junta said in a statement. About 10 more deaths have also been confirmed in Bangkok, the Thai capital, where a high rise building under construction collapsed.\n\nBut with communications badly disrupted, the true scale of the disaster has yet to emerge from the isolated military-ruled state, and the toll is expected to rise significantly.\n\nIt was the biggest quake to hit Myanmar in over a century, according to US geologists, and the tremors were powerful enough to severely damage buildings across Bangkok, hundreds of kilometres (miles) away from the epicentre.\n\nRescuers in the Thai capital laboured through the night searching for workers trapped when a 30-storey skyscraper under construction collapsed, reduced in seconds to a pile of rubble and twisted metal by the force of the shaking.\n\nBangkok governor Chadchart Sittipunt told AFP that about 10 people had been confirmed killed across the city, most in the skyscraper collapse.\n\nBut up to 100 workers were still unaccounted for at the building, close to the Chatuchak weekend market that is a magnet for tourists.\n\nBangkok city authorities said they will deploy more than 100 engineers to inspect buildings for safety after receiving over 2,000 reports of damage.\n\nWhile there was no widespread destruction, the shaking brought some dramatic images of rooftop swimming pools sloshing their contents down the side of many of the citys towering apartment blocks and hotels.\n\nEven hospitals were evacuated, with one woman delivering her baby outdoors after being moved from a hospital building. A surgeon also continued to operate on a patient after evacuating, completing the operation outside, a spokesperson told AFP.\n\nBut the worst of the damage was in Myanmar, where four years of civil war sparked by a military coup have ravaged the healthcare and emergency response systems.\n\nJunta chief Min Aung Hlaing issued an exceptionally rare appeal for international aid, indicating the severity of the calamity. Previous military regimes have shunned foreign assistance even after major natural disasters.\n\nThe country declared a state of emergency across the six worst-affected regions after the quake, and at one major hospital in the capital, Naypyidaw, medics were forced to treat the wounded in the open air.\n\nOne official described it as a mass casualty area.\n\nMandalay, a city of more than 1.7 million people, appeared to have been badly hit. Photos showed dozens of buildings reduced to rubble.\n\nA rescue worker from Amarapura, an ancient city and now a township of Mandalay, said the bodies of 30 people had been recovered from collapsed multistorey apartment blocks.\n\nI have never experienced anything like this before  our town looks like a collapsed city, he said, estimating that about a fifth of the buildings had been destroyed.\n\nA resident reached by phone told AFP that a hospital and a hotel had been destroyed, and said the city was badly lacking in rescue personnel.\n\nAnother witness in Mandalay, who asked not to be named, said eight people had been killed and others were feared to be trapped after a construction building in Pyigyitagon township collapsed.\n\nThe whole of Mandalay city was affected by the earthquake. The rescue teams and hospitals are now overrun. We are managing with the resources we have in the neighbourhood, they said.\n\nImages published by Khit Thit Media, a news agency based in Myanmar, showed piles of bricks and rubble outside a damaged mosque, also in Mandalay. At least 20 people had died there, it reported, though it was not possible to verify this figure.\n\nA huge queue of buses and lorries lined up at a checkpoint to enter Naypyidaw early on Saturday.\n\nOffers of foreign assistance began coming in, with President Donald Trump on Friday pledging US help.\n\nIts terrible, Trump told reporters in the Oval Office about the quake when asked if he would respond to the appeal by Myanmars military rulers.\n\nIts a real bad one, and we will be helping. Weve already spoken with the country.\n\nIndia, France and the European Union offered to provide assistance, while the WHO said it was mobilising to prepare trauma injury supplies. Chinas President Xi Jinping extended condolences, state media reported.\n\n(Agence France-Presse and Reuters contributed to this report).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/29052717/FY25_MyanmarEQ_MOB1img.jpg",
            "description": "<p>By The Guardian  THE death toll from a huge earthquake that hit Myanmar has reached almost 700, as rescuers dig through the rubble of collapsed buildings in a desperate search for survivors. The shallow 7.7-magnitude quake struck northwest of the city of Sagaing in central Myanmar in the early afternoon, followed minutes later by a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/myanmar-earthquake-death-toll-rises-to-almost-700-as-search-for-survivors-continues/\">Myanmar earthquake: death toll rises to almost 700 as search for survivors continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Big at home, small elsewhere: CBZ lays out plan to go international",
            "url": "https://www.newzimbabwe.com/big-at-home-small-elsewhere-cbz-lays-out-plan-to-go-international/",
            "content": "By newZWire\n\nCBZ is Zimbabwes largest bank, but CEO Lawrence Nyazema sees it as a big fish in a small pond. He says its time for the bank to expand beyond the countrys bordersstarting this year.\n\nCBZ had planned to grow through mergers and acquisitions, including deals with First Mutual Limited and ZB, but competition regulators blocked the moves. Despite this setback, the bank is still convinced it can go international.\n\nWe cannot remain a Zimbabwean play, our partners are venturing out into the world, and we cannot leave them to go there alone, Nyazema told a meeting of top clients on Wednesday.\n\nCBZ will take its first steps outside Zimbabwe by the end of the year. Its first target is South Africa, which accounts for 70% of Africas insurance revenues. The bank is also looking at Botswana and other markets beyond Africa.\n\nWe like Botswana not as a market where we generate revenue, but we like Botswana because its friendly from a capital perspective, he said. We believe well be able to raise reasonably priced capital either to deploy in Botswana or to deploy elsewhere in the world.\n\nNyazema wants to see CBZ expanding into Africa, the Middle East, and the Americas. Our goal is to be present in seven African countries, one Middle Eastern country, and two South American countries.\n\nZimbabwean companies, especially banks, dont exactly have a stellar record in their attempts to operate in the region. The list of companies that tried and ran back home is long. Nyazema says CBZ will be more cautious, given the size of more experienced operators in the region.\n\nThe company is adopting a measured approach, acknowledging its relative size compared to established players in the target markets, he says. We acknowledge our size; we may be big in Zim, but we are very small elsewhere.\n\nTo scale up, CBZ will explore joint ventures or mergers and acquisitions where it can.\n\nThe bank is also looking to underwrite more business. After raising US$50 million in credit lines from Afreximbank in February, CBZ now plans to raise up to US$500 million this year. With Zimbabwe shut out of international markets, Nyazema sees this as a major achievement.\n\nRaising half a billion dollars is our goal, but it must be under the right conditions. If we achieve this, it will greatly benefit the economy by stimulating trade, supporting business activities across various sectors, and ultimately enhancing overall economic growth, Nyazema said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27051258/lawrence-cbz.jpg",
            "description": "<p>By newZWire  CBZ is Zimbabwe’s largest bank, but CEO Lawrence Nyazema sees it as a big fish in a small pond. He says it’s time for the bank to expand beyond the country’s borders—starting this year. CBZ had planned to grow through mergers and acquisitions, including deals with First Mutual Limited and ZB, but competition</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/big-at-home-small-elsewhere-cbz-lays-out-plan-to-go-international/\">Big at home, small elsewhere: CBZ lays out plan to go international</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Govt says security services ‘on high alert’ amid calls for protests",
            "url": "https://www.newzimbabwe.com/govt-says-security-services-on-high-alert-amid-calls-for-protests/",
            "content": "By Staff Reporter\n\nThe government has upped security across the country as disgruntled war vet Blessed Bombshell Geza calls for demonstrations against President Emmerson Mnangagwa.\n\nGeza has been opposing the extension of Mnangagwas tenure and demanding his immediate resignation, levelling allegations of corruption, tribalism and cronyism. Earlier this month, he was expelled from Zanu PF, where he was a Central Committee member over allegations of indiscipline.\n\nThe war vet has recently done explosive live broadcasts calling on citizens to take to the streets on March 31.\n\nIn a statement, Thursday, Home Affairs Minister Kazembe Kazembe warned citizens against participating in the planned protests.\n\nThe illegal acts being mobilised undermine the prevailing security, peace and stability.The retrogressive intents should be dismissed with the contempt they deserve. Those fronting the mobilisation should stand warned.\n\nThe countrys security services are on high alert to ensure the sustained safety and security of the public. The Zimbabwean Republic Police has made adequate deployments to guarantee an environment conducive to socio-economic development and unhindered movement of people in all parts of the country, reads part of the statement.\n\nPolice have since issued a two-month-long prohibition order from March 27 until May 31, barring the carrying of weapons including swords, knobkerries, axes, daggers, machetes and catapults in Harare and Bulawayo.\n\nThere has also been a heavy deployment of police officers in both urban and rural areas to maintain peace and order.\n\nAdded Kazembe, May I also remind the public of the need to abide by the provisions of the Criminal Law (Codification and Reform) Act Chapter 24, which is categorical on the maintenance of public order. Equally, I need not emphasize that we are all expected to remain guided by the provisions of Section 164 of the Criminal Law (Codification and Reform) Act and Section 164 of the Cyber Security and Data Protection Act on offences relating to electronic communications and materials.\n\nThe relevant instruments would be invoked to deal with those who unlawfully engage in transmitting, broadcasting and distributing data messages to any person, group of persons or to the public with the intent to incite acts of violence against any persons or to cause damage to any property.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/25185424/Home-Affairs-Minister-Kazembe-Kazembe.jpg",
            "description": "<p>By Staff Reporter The government has upped security across the country as disgruntled war vet Blessed “Bombshell” Geza calls for demonstrations against President Emmerson Mnangagwa. Geza has been opposing the extension of Mnangagwa’s tenure and demanding his immediate resignation, levelling allegations of corruption, tribalism and cronyism. Earlier this month, he was expelled from Zanu PF,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-says-security-services-on-high-alert-amid-calls-for-protests/\">Govt says security services ‘on high alert’ amid calls for protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Transport ministry announces road closure to allow upgrade",
            "url": "https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-allow-upgrade/",
            "content": "By Staff Reporter\n\nTHE Ministry of Transport and Infrastructural Development (MTID) has announced the closure of Simon Mazorodze Road from Harare Drive to Willowvale Road/St George Street.\n\nThe closure, effective 27 March until further notice, is part of a project contracted to Tensor Systems aimed at upgrading and rehabilitating the road.\n\nIn a public notice the MTID announced the temporary traffic changes to ensure a smooth flow of transport and pedestrians.\n\nAll pedestrians and the motoring public who use the affected road are advised as follows: construction of the carriageway)  detours northbound (city-bound citybound (or northbound) traffic may use watts road (the service road adjacent to Simon Mazorodze) by exiting Simon Mazorodze at the Chinzou roundabout and joining the service lane.\n\nTraffic may shift back into Simon Mazorodze after the construction zone. Alternatively, city-bound traffic may turn left onto Harare Drive, then right onto Willowvale road, or continue to highfield road. Southbound (Masvingo bound) traffic may continue using the southbound carriageway. During this period, Watts shall operate as a one-way street, reads the notice.\n\nTraffic will continue on the southbound carriageway initially, but later shift to the northbound lane as construction progresses.\n\nConstruction of the southbound (Masvingo bound Tensor Systems carriageway)  detours northbound (city bound) traffic shall continue to use Watts road, which shall continue to operate as a one-way street as described above. southbound (Masvingo-bound) traffic will be moved the then completed northbound carriageway.\n\nAlternatively, southbound traffic may turn left into Daniel Street then immediately right into Mbirimi Drive, left into St Georges street, right into Waterfalls avenue then back into Simon Mazorodze road, further reads the notice.\n\nMotorists are advised to follow all traffic signs, allow extra travel time, and give way to construction vehicles. Further updates on detours will be provided as necessary.\n\nOther diversion routes will be advised as they are prepared. Additional diversions shall be added to allow bridge construction. Road users are free to use any other roads of their choice but the ministry will only be responsible for the designated routes.\n\nRoad users are advised to follow the traffic signs strictly and at all times cooperate with traffic controllers posted around the construction zone.\n\nAllow for extra time to reach intended destinations. Give right of way to all construction machinery, including all vehicles branded tensor systems, to ensure safety to all road users, the ministry said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/05162122/Road-Construction.jpg",
            "description": "<p>By Staff Reporter  THE Ministry of Transport and Infrastructural Development (MTID) has announced the closure of Simon Mazorodze Road from Harare Drive to Willowvale Road/St George Street. The closure, effective 27 March until further notice, is part of a project contracted to Tensor Systems aimed at upgrading and rehabilitating the road. In a public notice</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/transport-ministry-announces-road-closure-to-allow-upgrade/\">Transport ministry announces road closure to allow upgrade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Tel One F.C plots victory against CAPS United",
            "url": "https://www.newzimbabwe.com/tel-one-f-c-plots-victory-against-caps-united/",
            "content": "By Sports Reporter\n\nGWERU-based topflight league side Tel One FC is eyeing to cause an upset against league giants CAPS United when they face off Saturday at Bata Stadium.\n\nThe Wi-Fi Boys are enjoying a good start in the topflight league where they are sitting on position eight with four points, three behind log leaders MWOS FC.\n\nTel One has lost once against Herentals on matchday one before thrashing Triangle 4-1 and picking and draw against Dynamos before the international break.\n\nCommenting ahead of the CAPS United game team, head coach Herbert Maruwa said the only option for them is to win.\n\nIts not going to be an easy game, CAPS United is a big team, but we have our own targets, to make sure we collect maximum points.\n\nThe team is doing well and Saturday against CAPS we have to give our best. We are coming from a draw away from home against Dynamos, but now we are now home we have to utilise our home advantage and get maximum points.\n\nCAPS United walks into Saturdays match with confidence after picking its first win against Triangle a fortnight ago.\n\nMakepekepe had a slow start in the league, as they started of with a 1-1 draw against Green Fuel before losing to Scottland on the second matchday.\n\nCurrently they occupy position nine with four points.\n\nMATCHHAY 4 FIXTURES\n\nSATURDAY\n\nTELONE FC VS CAPS UNITED F.C. (Bata Stadium)\n\nHIGHLANDERS FC VS SCOTTLAND F.C.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/14064152/telone.jpeg",
            "description": "<p>By Sports Reporter GWERU-based topflight league side Tel One FC is eyeing to cause an upset against league giants CAPS United when they face off Saturday at Bata Stadium. The Wi-Fi Boys are enjoying a good start in the topflight league where they are sitting on position eight with four points, three behind log leaders</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-f-c-plots-victory-against-caps-united/\">Tel One F.C plots victory against CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        },
        {
            "title": "Chevrons to host New Zealand and South Africa in T20 tri-nations series",
            "url": "https://www.newzimbabwe.com/chevrons-to-host-new-zealand-and-south-africa-in-t20-tri-nations-series/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens cricket team, popularly known as the Chevrons, is set to host New Zealand and South Africa in a T20-tri nations series.\n\nThe series is scheduled to run from the 14th of July to the 26 th.\n\nNeighbours South Africa are scheduled to land earlier in the country as they have a two match test series against the Chevrons before they play the tri nations series.\n\nThe test matches series will be played at Queens Sports Club in Bulawayo, the first one scheduled for June 28 to July 2, before the second match will which run from July 6 to 10.\n\nBoth sides will then shift base to Harare for the tri-nations series clash in crickets shortest format at Harare Sports Club, where the stage will be opened by the two sides on July 14, before South Africa face off with New Zealand two days later.\n\nThe Chevrons will then bounce back in action on July 18 with a clash against New Zealand before facing off the the Proteas in the second leg on the 20th.\n\nAction will then continue on July 22 when South Africa face the Black Caps for the second leg, before Zimbabwe rounds off group games on the 24th with the same opponents.\n\nThe T20 series will end on the 26th of July when top two teams from the two legged round robbin group stages face off in the final.\n\nCommenting on the tri-series, Zimbabwe Cricket managing director Givemore Makoni said, This is the biggest international home season we have had in years.\n\nIt is an incredible opportunity for our players to test themselves against two of the worlds cricketing powerhouses.\n\nHosting South Africa and New Zealand for both Test cricket and an exciting T20I tri-series is a fantastic development for the growth of the game in Zimbabwe.\n\nWe are looking forward to welcoming the teams and putting on a great spectacle for our passionate cricket fans.\n\nZimbabwe last hosted a T20I tri-nation series in July 2018, featuring Australia and Pakistan, with Pakistan emerging victorious.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/17061815/ZIM-T20-CHEVRONS.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s cricket team, popularly known as the Chevrons, is set to host New Zealand and South Africa in a T20-tri nations series. The series is scheduled to run from the 14th of July to the 26 th. Neighbours South Africa are scheduled to land earlier in the country as they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-host-new-zealand-and-south-africa-in-t20-tri-nations-series/\">Chevrons to host New Zealand and South Africa in T20 tri-nations series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "30 Mar 2025"
        }
    ]
}