{
    "news": [
        {
            "title": "Man jailed 20 years for sexually abusing five-year-old",
            "url": "https://www.newzimbabwe.com/man-jailed-20-years-for-sexually-abusing-five-year-old/",
            "content": "By Staff Reporter\n\nA 19-year-old Guruve man has been slapped with a 20-year jail term following his conviction for sexually abusing a five-year-old neighbour on three occasions.\n\nProsecutors proved that the victim, a girl attending ECD B, was repeatedly targeted by the offender.\n\nOn the first occasion, it was proved that the victim went to play at the offenders homestead.\n\nWhile playing, the offender lifted her onto a stool and inserted his finger into her privates.\n\nThe childs cries for help caused him to stop, and he attempted to pacify her by lifting and carrying her, the court heard.\n\nOnce the victim had stopped crying, the offender again lowered her onto the stool and continued to caress her privates.\n\nHe only stopped when he heard the childs mother calling for her.\n\nThe minor did not disclose the abuse to her mother at that time.\n\nOn another occasion, the complainant was sent by her mother to collect tomatoes from the offenders home.\n\nShe found him alone, sitting on a stool.\n\nHe lifted her onto the stool, removed her underwear, and again caressed her privates before inserting his finger.\n\nHe only stopped when he saw the childs mother approaching, said the state.\n\nAgain, the child remained silent, fearing her mothers reaction.\n\nThe abuse came to light on the 12th of April, 2025, when the complainant, while attending a church conference, confided in her grandmother.\n\nThe grandmother then informed the childs mother.\n\nA police report was filed, leading to the offenders arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A 19-year-old Guruve man has been slapped with a 20-year jail term following his conviction for sexually abusing a five-year-old neighbour on three occasions. Prosecutors proved that the victim, a girl attending ECD B, was repeatedly targeted by the offender. On the first occasion, it was proved that the victim went to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-20-years-for-sexually-abusing-five-year-old/\">Man jailed 20 years for sexually abusing five-year-old</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Pambili Natural Resources seeks to raise C$1-mln for Zim venture",
            "url": "https://www.newzimbabwe.com/pambili-natural-resources-seeks-to-raise-c1-mln-for-zim-venture/",
            "content": "By Alois Vinga\n\nPAMBILI Natural Resources Corporation seeks to raise C$1 million whose proceeds will be injected towards the Zimbabwe unit.\n\nThe firm said it intends to raise the funds through a non-brokered private offering of stake of up to 20 million units on the TSX Venture Exchange.\n\nAccordingly, each unit is offered atC$0.05and comprises one common share and one common share purchase warrant with an exercise price ofC$0.10, exercisable for a period of one year from closing of the Offering.\n\nPambili said it intends to pay a finders fee of 5% of the Proceeds in Units. Other than being non-transferable, each Finders Warrant shall otherwise be on the same terms as the Warrants. The Units will be offered pursuant to available prospectus exemptions set out under applicable securities laws and instruments, including National Instrument 45-106  Prospectus Exemptions.\n\nThe participation by Insiders in the Offering will constitute a related party transaction within the meaning of Multilateral Instrument 61 101 Protection of Minority Security Holders in Special Transactions (MI 61-101). The Company intends to rely on exemptions from the formal valuation and minority shareholder approval requirements provided under subsections 5.5(a) and 5.7(a) of MI 61-101 on the basis that participation in the Offering by Insiders will not exceed 25% of the fair market value of the Companys market capitalization.\n\nThe Proceeds will provide general working capital for business development and will be allocated to: Continued development of the CompanysGolden ValleyA1 mining claim (GVM) near Bulawayo,Zimbabwe\n\nCompletion of due diligence at theLondon Wall(LW) project near Gwanda,Zimbabwe. Pambili owns an option to purchase LW (the Option) as previously announced onNov. 19, 2024. The due diligence at LW is expected to lead to pilot production ahead of potential acquisition of LW.\n\nPambili CEO Jon Harris\n\nPambili CEO, Jon Harris expressed optimism over the potential within the LW project.\n\nGiven current gold prices and good historic project fundamentals, we are excited about the potential at the London Wall. This financing will allow us to rehabilitate the historic East Shaft and complete the survey of the old development drives. Our aim is to commence pilot production as soon as possible to enable us to assess the mines commercial viability, he said.\n\nPambili Natural Resources Corporationis a natural resources exploration and development company currently developing gold projects inZimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25050239/pambili.jpg",
            "description": "<p>By Alois Vinga PAMBILI Natural Resources Corporation seeks to raise C$1 million whose proceeds will be injected towards the Zimbabwe unit. The firm said it intends to raise the funds through a non-brokered private offering of stake of up to 20 million units on the TSX Venture Exchange. Accordingly, each unit is offered at C$0.05 and comprises</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pambili-natural-resources-seeks-to-raise-c1-mln-for-zim-venture/\">Pambili Natural Resources seeks to raise C$1-mln for Zim venture</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Proteas arrive in Zimbabwe ahead of two Test matches against Chevrons",
            "url": "https://www.newzimbabwe.com/proteas-arrive-in-zimbabwe-ahead-of-two-test-matches-against-chevrons/",
            "content": "By Sports Reporter\n\nICC World Test Champions South Africa arrived in Bulawayo Tuesday ahead of their much-anticipated two-Test series against Zimbabwe at Queens Sports Club.\n\nThe Test games will see the first one running from Saturday the June 28 to July 2, with the second match scheduled for July 6-10.\n\nProteas walk into the Test coming from ICC World Test Series, where they were crowned champions early this month after beating Australia in the final.\n\nThey will however, be without team captain Themba Bavuma who has been sidelined due to an injury.\n\nAfter the two-match Test, Zimbabwe and South Africa will shift base to Harare, where they will face off in the tri-nations T20I series with New Zealand.\n\nThe three-match series will run from July 14-25, with all games slated for Harare Sports Club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25045551/WhatsApp-Image-2025-06-24-at-20.56.01.jpeg",
            "description": "<p>By Sports Reporter ICC World Test Champions South Africa arrived in Bulawayo Tuesday ahead of their much-anticipated two-Test series against Zimbabwe at Queens Sports Club. The Test games will see the first one running from Saturday the June 28 to July 2, with the second match scheduled for July 6-10. Proteas walk into the Test</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/proteas-arrive-in-zimbabwe-ahead-of-two-test-matches-against-chevrons/\">Proteas arrive in Zimbabwe ahead of two Test matches against Chevrons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Govt increases surveillance at border posts to curb drug trafficking",
            "url": "https://www.newzimbabwe.com/govt-increases-surveillance-at-border-posts-to-curb-drug-trafficking/",
            "content": "By Mary Taruvinga\n\nZimbabwean government has upped surveillance by introducing drones at border posts to reduce drug trafficking.\n\nAs the fight against drug use continues, during the period from March to June 2 2025, a cumulative 206 raids were conducted nationwide, leading to the dismantling of 39 illicit drug bases and 1,445 suspects.\n\nSpeaking at a post-cabinet briefing Tuesday Information Minister Jenfan Muswere said, Regarding the update on the Supply Reduction Pillar, the Criminal Investigations Departmentreceived five drones from the Ministry of Local Government and Public Works for surveillance purposes at border posts.\n\nForty-one drug kingpins were named and shamed during the period and individuals were sentenced to custodial terms ranging from 12 months to 15 years in prison.\n\nHe said the liquor licensing board inspected 461 premises, 429 of which were licensed.\n\nA total of 32 unlicensed premises were fined US$40 each.\n\nMuswere said the government is committed to empowering youths which will in turn reduce drug and substance abuse in the country.\n\nA total of 70 survivors of drug and substance use are currently undergoing training.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/17045402/Caledon-River-Properties-Pty-Ltd-and-Profteam-CC-were-stripped-of-the-multi-million-rand-profits-they-made-after-erecting-a-weak-mesh-fence-at-Beit-Bridge-border-File-Image.webp",
            "description": "<p>By Mary Taruvinga Zimbabwean government has upped surveillance by introducing drones at border posts to reduce drug trafficking. As the fight against drug use continues, during the period from March to June 2 2025, a cumulative 206 raids were conducted nationwide, leading to the dismantling of 39 illicit drug bases and 1,445 suspects. Speaking at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-increases-surveillance-at-border-posts-to-curb-drug-trafficking/\">Govt increases surveillance at border posts to curb drug trafficking </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Never side with oppressors whose hands drip blood –  MMA star shreds Mnangagwa, blames ‘scarf’ for 28 seconds defeat",
            "url": "https://www.newzimbabwe.com/never-side-with-oppressors-whose-hands-drip-blood-mma-star-shreds-mnangagwa-blames-scarf-for-28-seconds-defeat/",
            "content": "By Staff Reporter\n\nMIXED Martial Arts (MMA) fighter Themba The Answer Gorimbo has taken aim at President Emmerson Mnangagwa, accusing him of overseeing an oppressive government.\n\nIn a recent outburst, Gorimbo launched into a tirade against President Mnangagwa, whom he met in 2021 when he was the Extreme Fighting Championship (EFC) heavyweight champion.\n\nGorimbo accused those close to Mnangagwa of corruption, claiming they demanded a bribe for facilitating his meeting with the Zanu PF leader at the State House.\n\nI left Zimbabwe in 2009 for South Africa. I have never worked in Zimbabwe once. Ndakaita garden boy ku Cape Town (handina hangu kubira McMillan family) ndikashanda nesimba mu sport yangu.\n\nNdakashinga kusvika ndaita champion. Then zvikanzi huya uone mukuru wenyika after vaona pic ndina Rama. Ndaenda muface akainda neni aitodawo something (mutonyoro), said Gorimboin now-deleted social media posts.\n\nGorimbo blamed his meeting with President Mnangagwa for his subsequent misfortunes in the octagon.\n\nMunyama wandakaita next fight. Dislocated my shoulder 28 seconds into the fight. Apa ndakapiwa ma scarf kuti ndipfeke. From that day ndakaziva usafa wakainda same side nevanhu vane ropa mumaoko avo iwe une zodzo (kwete ra Dhuterere rekunyepa izvo iye achigamuchira zvokuba nekushaya, kuita zvekutengerwa marriage nemunhu akatorambawo mukadzi wake, he added.\n\nGorimbo is no stranger to criticising the government, having previously clashed with former Minister of Sports, Arts and Culture Kirsty Coventry after she ignored his pleas to include the national flag on his fighting kit.\n\nHe labelled Coventry the worst Sports Minister Zimbabwe has ever had.\n\nPresident Mnangagwa is the latest target of Gorimbos criticism, with the fighter also mocking him for commissioning minor development projects.\n\nLast month, Mnangagwa officially opened the US$88 million Trabablas Interchange.\n\nImagine kubata vanhu face muchiti roundabout what what, kutoiita official ceremony kuhvura road even flying helicopters and wasting state funds to go open roundabout.\n\nMu South Africa umo Rama angasimuka kuinda Pitori kundo opener road? said Gorimbo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25043728/gorimbo.jpg",
            "description": "<p>By Staff Reporter MIXED Martial Arts (MMA) fighter Themba “The Answer” Gorimbo has taken aim at President Emmerson Mnangagwa, accusing him of overseeing an oppressive government. In a recent outburst, Gorimbo launched into a tirade against President Mnangagwa, whom he met in 2021 when he was the Extreme Fighting Championship (EFC) heavyweight champion. Gorimbo accused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/never-side-with-oppressors-whose-hands-drip-blood-mma-star-shreds-mnangagwa-blames-scarf-for-28-seconds-defeat/\">Never side with oppressors whose hands drip blood –  MMA star shreds Mnangagwa, blames ‘scarf’ for 28 seconds defeat </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zimbabwe initiates process to join BRICS bloc",
            "url": "https://www.newzimbabwe.com/zimbabwe-initiates-process-to-join-brics-bloc/",
            "content": "TRT Global\n\nZimbabwe formally initiated the process to join the BRICS grouping of emerging economies Monday after a high-level diplomatic engagement with Brazil, the blocs current chair, in the capital Harare.\n\nThe engagement was between Zimbabwes Foreign Affairs and International Trade Minister Amon Murwira and Brazils Ambassador to Zimbabwe, Vilmar Rogeiro Coutinho Jr.\n\nSpeaking to reporters after the talks, Murwira said they discussed Zimbabwes formal application to be associated with BRICS, with Brazil guiding on the steps to be taken by the southern African nation.\n\nWe have had a lot of positive exchanges and good guidance from Brazil as chair of BRICS on steps that we must take, which we are already taking, he said.\n\nNew members\n\nBrazil currently holds the rotating chairmanship ofthe BRICS bloc, which comprises original members Brazil, Russia, India, China and South Africa and new members Egypt, Ethiopia, Iran, Saudi Arabia, the United Arab Emirates and Indonesia.\n\nZimbabwe has received valuable guidance from Brazil on the procedural steps for membership, Murwira added.\n\nSeparately, Coutinho said the two countries were working together towards a successful conclusion of Zimbabwe becoming a BRICS member.\n\nAs the minister highlighted, Zimbabwe has expressed a clear interest in joining BRICS, and we are working together towards a successful conclusion, he added.\n\nThe BRICS group was established in 2006 and South Africa joined the original four members in 2010 as a first African member state to the bloc.\n\nBRICS aims to promote and strengthen south-south cooperation and foster development through shared initiatives, among other goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24134447/brics.webp",
            "description": "<p>TRT Global Zimbabwe formally initiated the process to join the BRICS grouping of emerging economies Monday after a high-level diplomatic engagement with Brazil, the bloc’s current chair, in the capital Harare. The engagement was between Zimbabwe’s Foreign Affairs and International Trade Minister Amon Murwira and Brazil’s Ambassador to Zimbabwe, Vilmar Rogeiro Coutinho Jr. Speaking to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-initiates-process-to-join-brics-bloc/\">Zimbabwe initiates process to join BRICS bloc</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Case against ‘abusive’ guardians stalls as victim is transported to Zimbabwe",
            "url": "https://www.newzimbabwe.com/case-against-abusive-guardians-stalls-as-victim-is-transported-to-zimbabwe/",
            "content": "The Citizen\n\nA child abuse case has stalled after the alleged perpetrators, the guardians of a Grade 5 learner from Skeen Primary School, reportedly took her to Zimbabwe, leaving police struggling to gather evidence.\n\nThe family violence, child protection, and sexual offenses commander confirmed that the child was taken out of South Africa before critical evidence could be obtained. The learners statement was not yet obtained and she had not been taken to a doctor. The learner must be taken to the doctor to prove the case.\n\nThe investigating officer said he suspects the accused guardians took the child to Zimbabwe to kill the case. This was corroborated by Skeen Primary School deputy principal Masilo Lebeya, who revealed that the guardians took the child away swiftly, in the wake of allegations of abuse, and ahead of her June examinations, without informing the school. We only learned of her whereabouts when a social worker contacted one of the suspects, who admitted taking her to Zimbabwe, Lebeya said, adding that the school subsequently opened a case of abuse at the Sandringham Police Station.\n\nWhen asked if there were early, telltale signs that the victim was being abused, Lebeya said they were only seen at a later stage, and that the process of counselling the victim was only initiated when they confirmed that she had a family problem. Remember, we are dealing with a lot of children here. You might find that, by the time a teacher notices that she needs to intervene, it is a bit late. It shows that the child has been suffering in silence, he noted, further emphasising that the school has a strong support system and they have always encouraged children to share their problems.\n\nMatheba said they are trying to get the accused guardians to co-operate. He stressed that, without it, the police will not be able to build a case. Matheba said if they do not co-operate, the police will have to work with home affairs immigration authorities to verify the victims legal status in South Africa. If she was here illegally, then we would have to involve authorities on that side, to get her a passport so that she can be transported back to South Africa, and that will be a long process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24133706/women-abuse-1.jpg",
            "description": "<p>The Citizen A Grade 5 learner from Skeen Primary School, allegedly abused by her guardians, has been secretly taken to Zimbabwe, and without critical evidence, such as her medical report or statement, the suspects remain free. A child abuse case has stalled after the alleged perpetrators, the guardians of a Grade 5 learner from Skeen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/case-against-abusive-guardians-stalls-as-victim-is-transported-to-zimbabwe/\">Case against ‘abusive’ guardians stalls as victim is transported to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        },
        {
            "title": "Mutasa lands Uni Africa Regional presidency",
            "url": "https://www.newzimbabwe.com/mutasa-lands-uni-africa-regional-presidency/",
            "content": "By Alois Vinga\n\nTHE Uni Africa Region has appointed trade unionist Peter Mutasa as president of the continents Finance and Insurance Trade Unions.\n\nMutasawas unanimously nominated at the global labour organs 6th Uni Global Union Africa Conference in Maputo, Mozambique.\n\nThe event is running under the theme Consolidate Working Class Power.\n\nUnder his new role, Mutasa will lead the team in proffering the best labour practices for the continents finance-related trade Unions. Africa Finance is a structure of the Uni Global Union which boasts an estimated 20 million members. Each continent is known as a Region with different industrial sectors like Finance and Engineering forming structures under the international labour organ.\n\nIn his acceptance speech, Mutasa vowed to leave no stone unturned in securing the best labour standards for the Continents Finance sector.\n\nAfrican Finance workers are facing many challenges that require strong unions to address. These include massive retrenchments due to digitalisation and AI, as well as poor working conditions. We have come up with a clear plan of action that will guide our agenda for the next four years, he said.\n\nThe incoming Uni Africa Region Finance President has a long history, which kicked off when he was a labour activist and Workers Committee member at Standard Chartered Bank, Zimbabwe.\n\nHe rose through the ranks of one of the countrys highly organised labour unions, the Zimbabwe Banks and Allied Workers Union (ZIBAWU), to his current position of General Secretary.\n\nMutasa served as President of the Zimbabwe Congress of Trade Unions (ZCTU) between 2016 and 2021 andis the current chairperson of the Crisis In Zimbabwe Coalition ( CiZC).\n\nMutasa holds a Masters in Public Policy and is currently pursuing a PhD.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/07040019/ZCTU-Peter-Mutasa-addressing-delegates-1.jpg",
            "description": "<p>By Alois Vinga THE Uni Africa Region has appointed trade unionist Peter Mutasa as president of the continent’s Finance and Insurance Trade Unions. Mutasa was unanimously nominated at the global labour organ’s 6th Uni Global Union Africa Conference in Maputo, Mozambique. The event is running under the theme “Consolidate Working Class Power.” Under his new role,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutasa-lands-uni-africa-regional-presidency/\">Mutasa lands Uni Africa Regional presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "25 Jun 2025"
        }
    ]
}