{
    "news": [
        {
            "title": "Cassper Nyovest embarks on weight loss journey after social media criticism",
            "url": "https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/",
            "content": "TshisaLive\n\nCassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29.\n\nAfter facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey.\n\nI was doing cardio all week. This time its a bit more fun because Im playing tennis. Next week Ill start weight training. The comments at the weekend were harsh. It hurt my feelings a bit but sometimes thats what you need, a little push, he said.\n\nIt is a projection, about how you feel about yourself. Body shaming and all of that. You dont know what Im going through. Im going to turn the lemons into lemonade.\n\nThis is not the first time Cassper has undergone a weight loss journey before his Fill Up concerts.\n\nIn 2022 Cassper did it before his Fill Up Mmabatho concert in Mahikeng.\n\nI cant explain how proud I am of myself. This was by far the hardest weight loss journey for me because I have done this three times and I now knew what it would take for me to get back in shape. To be honest, mentally I didnt feel like I was as strong as I once was and I was demoralised.\n\nIts supposed to get easier by the day but it got harder and harder. I just kept waking up and going. Lost touch with a lot of relationships and people because I zoned into this goal and I had no time for anyone but myself.\n\nLooking at these pictures now Im in awe of myself. I owe it to myself never to let myself go like that again. Big shout out to my training and nutrition team. Shout out to Fight Club for always having their doors open for me at any time I wanted to train. We four weeks out Boys! Lets put on a show! Im back!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09051311/nyovest.jpg",
            "description": "<p>TshisaLive Cassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29. After facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey. “I was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/\">Cassper Nyovest embarks on weight loss journey after social media criticism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Mount Sinai: One of the world’s most sacred places is being turned into a luxury mega-resort",
            "url": "https://www.newzimbabwe.com/mount-sinai-one-of-the-worlds-most-sacred-places-is-being-turned-into-a-luxury-mega-resort/",
            "content": "BBC\n\nFor years, visitors would venture up Mount Sinai with a Bedouin guide to watch the sunrise over the pristine, rocky landscape or go on other Bedouin-led hikes.\n\nNow one of Egypts most sacred places  revered by Jews, Christians and Muslims  is at the heart of an unholy row over plans to turn it into a new tourism mega-project.\n\nKnown locally as Jabal Musa, Mount Sinai is where Moses is said to have been given the Ten Commandments. Many also believe that this is the place where, according to the Bible and the Quran, God spoke to the prophet from the burning bush.\n\nThe 6th century St Catherines Monastery, run by the Greek Orthodox Church, is also there  and seemingly its monks will stay on now that Egyptian authorities, under Greek pressure, have denied wanting to close it.\n\nHowever, there is still deep concern about how the long-isolated, desert location  a Unesco World Heritage site comprising the monastery, town and mountain  is being transformed. Luxury hotels, villas and shopping bazaars are under construction there.\n\nThe long-isolated desert location is being transformed\n\nIt is also home to a traditional Bedouin community, the Jebeleya tribe. Already the tribe, known as the Guardians of St Catherine, have had their homes and tourist eco-camps demolished with little or no compensation. They have even been forced to take bodies out of their graves in the local cemetery to make way for a new car park.\n\nThe project may have been presented as desperately needed sustainable development which will boost tourism, but it has also been imposed on the Bedouin against their will, says Ben Hoffler, a British travel writer who has worked closely with Sinai tribes.\n\nThis is not development as the Jebeleya see it or asked for it, but how it looks when imposed top-down to serve the interests of outsiders over those of the local community, he told the BBC.\n\nA new urban world is being built around a Bedouin tribe of nomadic heritage, he added. Its a world they have always chosen to remain detached from, to whose construction they did not consent, and one that will change their place in their homeland forever.\n\nLocals, who number about 4,000, are unwilling to speak directly about the changes.\n\nBen Hoffler Construction in the Plain of el-Raha in 2024\n\nSo far, Greece is the foreign power which has been most vocal about the Egyptian plans, because of its connection to the monastery.\n\nTensions between Athens and Cairo flared up after an Egyptian court ruled in May that St Catherines  the worlds oldest continuously used Christian monastery  lies on state land.\n\nAfter a decades-long dispute, judges said that the monastery was only entitled to use the land it sits on and the archaeological religious sites which dot its surroundings.\n\nArchbishop Ieronymos II of Athens, head of the Church of Greece, was quick to denounce the ruling.\n\nThe monasterys property is being seized and expropriated. This spiritual beacon of Orthodoxy and Hellenism is now facing an existential threat, he said in a statement.\n\nIn a rare interview, St Catherines longtime Archbishop Damianos told a Greek newspaper the decision was a grave blow for us and a disgrace. His handling of the affair led to bitter divisions between the monks and his recent decision to step down.\n\nThe Greek Orthodox Patriarchate of Jerusalem pointed out that the holy site  over which it has ecclesiastical jurisdiction  had been granted a letter of protection by the Prophet Muhammad himself.\n\nIt said that the Byzantine monastery  which unusually also houses a small mosque built in the Fatimid era  was an enshrinement of peace between Christians and Muslims and a refuge of hope for a world mired by conflict.\n\nWhile the controversial court ruling remains in place, a flurry of diplomacy ultimately culminated in a joint declaration between Greece and Egypt ensuring the protection of St Catherines Greek Orthodox identity and cultural heritage.\n\nBen Hoffler Mount Sinai, known locally as Jabal Musa, is where Moses is said to have been given the Ten Commandments\n\nEgypt began its state-sponsored Great Transfiguration Project for tourists in 2021. The plan includes opening hotels, eco-lodges and a large visitor centre, as well as expanding the small nearby airport and a cable car to Mount Moses.\n\nThe government is promoting the development as Egypts gift to the entire world and all religions.\n\nThe project will provide all tourism and recreational services for visitors, promote the development of the town [of St Catherine] and its surrounding areas while preserving the environmental, visual, and heritage character of the pristine nature, and provide accommodation for those working on St Catherines projects, Housing Minister Sherif el-Sherbiny said last year.\n\nWhile work does appear to have stalled, at least temporarily, due to funding issues, the Plain of el-Raha  in view of St Catherines Monastery  has already been transformed. Construction is continuing on new roads.\n\nThis is where the followers of Moses, the Israelites, are said to have waited for him during his time on Mount Sinai. And critics say the special natural characteristics of the area are being destroyed.\n\nDetailing the outstanding universal value of the site, Unesco notes how the rugged mountainous landscape around forms a perfect backdrop for the Monastery.\n\nIt says: Its siting demonstrates a deliberate attempt to establish an intimate bond between natural beauty and remoteness on the one hand and human spiritual commitment on the other.\n\nBen Hoffler The area is known for its natural beauty and rugged mountainous landscape\n\nBack in 2023, Unesco highlighted its concerns and called on Egypt to stop developments, check their impact and produce a conservation plan.\n\nThis has not happened.\n\nIn July, World Heritage Watch sent an open letter calling on Unescos World Heritage Committee to place the St Catherines area on the List of World Heritage Sites in Danger.\n\nCampaigners have also approached King Charles as patron of the St Catherine Foundation, which raises funds to help conserve and study the monasterys heritage with its collection of valuable ancient Christian manuscripts. The King has described the site as a great spiritual treasure that should be maintained for future generations.\n\nThe mega-project is not the first in Egypt to draw criticism for a lack of sensitivity to the countrys unique history.\n\nBut the government sees its series of grandiose schemes as key to reinvigorating the flagging economy.\n\nEgypts once-thriving tourism sector had begun to recover from the effects of the Covid-19 pandemic when it was hit by the brutal war in Gaza and a new wave of regional instability. The government has declared an aim of reaching 30 million visitors by 2028.\n\nUnder successive Egyptian governments, commercial development of the Sinai has been carried out without consulting the indigenous Bedouin communities.\n\nThe peninsula was captured by Israel during the 1967 Middle East War and only returned to Egypt after the two countries signed a peace treaty in 1979. The Bedouin have since complained of being treated like second-class citizens.\n\nThe construction of Egypts popular Red Sea destinations, including Sharm el-Sheikh, began in South Sinai in the 1980s. Many see similarities with what is happening at St Catherines now.\n\nThe Bedouin were the people of the region, and they were the guides, the workers, the people to rent from, says Egyptian journalist Mohannad Sabry.\n\nThen industrial tourism came in and they were pushed out  not just pushed out of the business but physically pushed back from the sea into the background.\n\nBen Hoffler A hotel under construction in the Plain of el-Raha in 2024\n\nAs with the Red Sea locations, it is expected that Egyptians from elsewhere in the country will be brought in to work at the new St Catherines development. However, the government says it is also upgrading Bedouin residential areas.\n\nSt Catherines Monastery has endured many upheavals through the past millennium and a half but, when the oldest of the monks at the site originally moved there, it was still a remote retreat.\n\nThat began to change as the expansion of the Red Sea resorts brought thousands of pilgrims on day trips at peak times.\n\nIn recent years, large crowds would often be seen filing past what is said to be the remnants of the burning bush or visiting a museum displaying pages from the Codex Sinaiticus  the worlds oldest surviving, nearly complete, handwritten copy of the New Testament.\n\nNow, even though the monastery and the deep religious significance of the site will remain, its surroundings and centuries-long ways of life look set to be irreversibly changed.\n\n",
            "image_url": null,
            "description": "<p>BBC For years, visitors would venture up Mount Sinai with a Bedouin guide to watch the sunrise over the pristine, rocky landscape or go on other Bedouin-led hikes. Now one of Egypt’s most sacred places – revered by Jews, Christians and Muslims – is at the heart of an unholy row over plans to turn</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mount-sinai-one-of-the-worlds-most-sacred-places-is-being-turned-into-a-luxury-mega-resort/\">Mount Sinai: One of the world’s most sacred places is being turned into a luxury mega-resort</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups",
            "url": "https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/",
            "content": "By Staff Reporter\n\nHIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwas son.\n\nHarare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto Road in Highlands. The potential buyer of the land, believed to be Collins Mnangagwa, is constructing a multi-storey building in the area and intends to close part of the public road.\n\nThe residents have been given a month to lodge objections and reasons with the City Council regarding the land.\n\nThe Highlands Residents Association has, via a petition, objected to the sale of the portion of the road by the City Council.\n\nWe, the undersigned residents and community members of Highlands and surrounding areas, hereby submit our formal objection to the proposed permanent road closure of a portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue hereinafter referred to as Otto Road as per the public notice), Highlands, Harare, as advertised in the Public Notice placed in The Herald on Tuesday 2 September 2025, read the petition.\n\nThe residents lashed out at the City Council for the lack of transparency in the process, arguing that the sale of the land deprives the public of the benefits it carries.\n\nOtto Road is public land. Its permanent closure and subsequent sale would deprive current and future residents of their right to access and benefit from public infrastructure.\n\nOtto Road provides a safe and established route for domestic workers, security guards, gardeners, pedestrians, cyclists, schoolchildren, walkers and joggers. Closing it will force vulnerable users onto busier, more dangerous routes.\n\nMany people who rely on Otto Road do not own cars. Closure would disproportionately harm women, children, and low-income workers who depend on safe non-motorised routes.\n\nThe proposed closure appears to serve private interests at the expense of the broader community. Council has a duty to uphold transparency and protect public assets for collective benefit, read the petition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Staff Reporter HIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwa’s son. Harare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/\">Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe",
            "url": "https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhalas home, describing it as a barbaric act of violence and urged authorities to thoroughly investigate and arrest perpetrators.\n\nThe incidentreportedlyoccurredon August 30while Sikhala was in South Africa launching his book,Footprints in the Chains: The Life Story of Job Sikhala.\n\nThe bomb attack came after Sikhalas book launch in Masvingo was violently disrupted by suspected Zanu PF activists who confiscated and tore some books, broke furniture and also physically assaulted some panelists at the launch.\n\nIn a statement Monday, ZHRC voiced grave concern over the safety of Sikhalas family, noting that children were reportedly inside the house when the incident occurred.\n\nThe ZHRC is concerned about this dangerous explosion, which, if it is an attack, it strongly condemns as a barbaric act of violence which threatens the enjoyment of a number of constitutionally guaranteed human rights, particularly the right to life.\n\nThe ZHRC is deeply concerned about the safety and well-being of Mr. Sikhalas family, especially the children who were reportedly present when the explosion took place.\n\nChildren must be shielded from all forms of violence, abuse, and neglect. Exposure of children to such traumatic events can have enduring psychological and emotional consequences, ZHRC said.\n\nThe human rights commission also urged law enforcement authorities to investigate the matter and bring the perpetrators to book.\n\nThe ZHRC acknowledges the swift response by thepoliceand otherstate agencies in attending to the scene and initiating investigations.\n\nIt commends these efforts and urges the authorities to pursue a timely,thoroughand impartial investigation toidentify andprosecute those responsible so that they are punished in a deterrent manner, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhala’s home, describing it as a “barbaric act of violence” and urged authorities to thoroughly investigate and arrest perpetrators. The incident reportedly occurred on August 30 while Sikhala was in South Africa launching his book, “Footprints in the Chains: The Life</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/\">Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Judge rejects father’s bid to reclaim house from son",
            "url": "https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a fathers attempt to revoke a property registered in his sons name, saying the case reflected evidence of a broken family.\n\nOnias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had purchased and donated to him.\n\nJustice Philda Muzofa, sitting in Chinhoyi, noted the unusual family feud: It is never easy for a father to drag his son to courts; this is just evidence of a broken family. Something must have gone seriously wrong.\n\nOnias argued the property was a donation that could be revoked because Pride had become disrespectful and violent towards him, and had even tried to sell it against his wishes.\n\nBut the court ruled there was never a valid donation. There was never an intention to gratuitously and without obligation give the 1st respondent the property, Justice Muzofa said. There were strings attached. The applicant intended to continue to derive a benefit from the property.\n\nThe judge stressed that while Onias funded the purchase, the house was always registered in Prides name. The evidence before the Court strongly shows that the applicant purchased the property for the 1st respondent and he had strings attached, the judge said.\n\nDismissing the claim with costs, the judge concluded: Revocation can only be made where there is a valid donation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a father’s attempt to revoke a property registered in his son’s name, saying the case reflected “evidence of a broken family.” Onias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/\">Judge rejects father’s bid to reclaim house from son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Motorist loses US$10,000 and pistol to attendant at Harare car wash",
            "url": "https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/",
            "content": "By Staff Reporter\n\nA HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle.\n\nThe offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his clients car at a Mabelreign washing bay in March.\n\nChimukuyu was slapped with 13 months imprisonment, of which five months were conditionally suspended. He will, therefore, serve an effective eight months behind bars.\n\nCourt heard that on March 21, 2025, the complainant left the money and firearm inside his Mercedes-Benz before handing it over to the offender for cleaning.\n\nInstead of performing his duties, Chimukuyu fled with the bag containing the valuables.\n\nIt was further heard that following a tip-off, police detectives arrested the offender at Pamuzinda Lodge, Claudia in Harare and recovered US$1,850 in his trousers pocket. The stolen pistol and bag were later recovered during a follow-up search.\n\nOf the stolen cash, only US$3,450 was recovered.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) urged motorists to avoid leaving large sums of money and firearms unattended in vehicles, even when dealing with trusted service providers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09045858/Car-wash_.png",
            "description": "<p>By Staff Reporter A HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle. The offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his client’s car at a Mabelreign washing bay in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/\">Motorist loses US$10,000 and pistol to attendant at Harare car wash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Teen jailed for attempted murder after stabbing passerby who refused to share cigarette",
            "url": "https://www.newzimbabwe.com/teen-jailed-for-attempted-murder-after-stabbing-passerby-who-refused-to-share-cigarette/",
            "content": "By Staff Reporter\n\nA GWERU magistrate has sentenced a 19-year-old man for stabbing a passerby who refused to share a cigarette.\n\nNation Muyashu, who was facing an attempted murder charge, was arraigned before the Gweru Magistrates Court in Midlands province this Monday for sentencing.\n\nMuyashu was sentenced to nine years imprisonment, with three years suspended for five years on condition of good behaviour. He will, therefore, serve an effective six-year jail term.\n\nThe States case was that on July 16, 2025, the offender was walking alongside his unnamed girlfriend in the Mahamara area of Lalapanzi. It is said he encountered victim, Simon Ngazimbi, and asked him for a cigarette, but he refused.\n\nCourt heard that as Ngazimbi walked away, an argument ensued and in a fit of rage, the teenager drew out a knife and stabbed the victim once in the abdomen, causing his intestines to protrude from the wound. The victim fell to the ground and lost consciousness.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) encouraged members of the public to desist from physical abuse and senseless assaults.\n\nIts a sobering fact that a significant number of murder cases originate from seemingly meaningless altercations. We advise individuals to seek third-party mediation as a constructive alternative to violence, the NPAZ said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09050538/cigarette-.jpg",
            "description": "<p>By Staff Reporter A GWERU magistrate has sentenced a 19-year-old man for stabbing a passerby who refused to share a cigarette. Nation Muyashu, who was facing an attempted murder charge, was arraigned before the Gweru Magistrates Court in Midlands province this Monday for sentencing. Muyashu was sentenced to nine years imprisonment, with three years suspended</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-jailed-for-attempted-murder-after-stabbing-passerby-who-refused-to-share-cigarette/\">Teen jailed for attempted murder after stabbing passerby who refused to share cigarette</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        },
        {
            "title": "Sending your people to deal with me only confirms your father runs a terrorist organisation – dazed Holy Ten tells Mnangagwa’s son",
            "url": "https://www.newzimbabwe.com/sending-your-people-to-deal-with-me-only-confirms-your-father-runs-a-terrorist-organisation-dazed-holy-ten-tells-mnangagwas-son/",
            "content": "By Leopold Munhende\n\nHOLY Ten, an eccentric character on Zimbabwes Hip Hop scene by any margin, has told President Emmerson Mnangagwas son Collins not to entertain thoughts of sending people after him, as that will only confirm that his father runs a terrorist organisation, Zanu PF.\n\nHoly Ten, born Mukudzei Chitsama, broke the internet over the weekend when he went on an online rant, laying into Collins and his twin brother Sean for sending Central Intelligence Organisation (CIO) and army officers to his home.\n\nIn other posts, shared on Facebook and Instagram, he sent coded messages that they had been showering him with expensive gifts such as a house and cars, which he said they could now take back.\n\nHe went as far as declaring that he was bigger than the ruling Zanu PF party and could take the whole institution down, in what many have interpreted as a message passed in drunken stupor.\n\nHis last post on X, formerly Twitter, took aim at Collins, whose brother Sean is also an Army Major.\n\nDear Collins Mnangagwa, you cant touch me and the moment you try, youre really proving to all of us that you and your father run a terrorist organisation. Leave me alone, said Holy Ten.\n\nOnce the fastest rising talent in Zimbabwes music industry, Holy Tens career took a nasty nose dive after he laid into popular Zim Dance Hall chanter Winky D.\n\nHis tirade against Winky D, which came after the release of a red hot collaboration,Ibotso, was blamed on unidentified drugs and alcohol, a challenge he has accepted to have been dealing with for over two years. Ibotso, which he disputed, highlighted how the high and mighty were taking all that was supposed to benefit the downtrodden.\n\nHis tweet, however, comes a day after he apologised for his online tirade, captured live on Instagram.\n\nI joined Zanu PF because I was trying to clean the reputation, the image of Zanu PF. What you did, boys, I can finish all of you off. I can end the Zanu PF today. Im bigger than the Zanu PF, he said\n\nHoly Ten has in the past posted images of himself clad in army regalia, brandishing the Zanu PF clenched fist and openly campaigned for Mnangagwa.\n\nAccording to sources closer to his circle of friends, he was gifted, by the Mnangagwa twins, a fully furnished house and numerous cars, one of which he presented to his wife, Kimberly Richards, before repossessing it to pay a debt.\n\nUnconfirmed reports from Zimbabwean socialites indicate that Richards could have been in an extramarital affair with one of Mnangagwas sons, something that could be leading to his constant meltdowns.\n\nRichards, the Mnangagwa twins, Zanu PF, government and Mnangagwa himself are yet to comment on the matter that has raised questions on abuse of CIO and military personnel for personal benefits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/08202033/holy-ten-.jpg",
            "description": "<p>By Leopold Munhende HOLY Ten, an eccentric character on Zimbabwe’s Hip Hop scene by any margin, has told President Emmerson Mnangagwa’s son Collins not to entertain thoughts of sending “people” after him, as that will only confirm that his father runs a terrorist organisation, Zanu PF. Holy Ten, born Mukudzei Chitsama, broke the internet over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sending-your-people-to-deal-with-me-only-confirms-your-father-runs-a-terrorist-organisation-dazed-holy-ten-tells-mnangagwas-son/\">Sending your people to deal with me only confirms your father runs a terrorist organisation – dazed Holy Ten tells Mnangagwa’s son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "09 Sep 2025"
        }
    ]
}