{
    "news": [
        {
            "title": "Rights doctors push for Commission of Inquiry into Zimbabwe’s collapsing public health sector",
            "url": "https://www.newzimbabwe.com/rights-doctors-push-for-commission-of-inquiry-into-zimbabwes-collapsing-public-health-sector/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Association of Doctors for Human Rights (ZADHR) has urged President Emmerson Mnangagwa to institute a Commission of Inquiry on the state of the health sector.\n\nThis follows Mnangagwasvisits to Parirenyatwa and Sally MugabeHospitals on Monday.\n\nThere has been an uproar over thedilapidatedstateof public hospitals where there is a lack of basic medicines, malfunctioning equipmentand low morale among the healthcare professionals.\n\nDoctors said Mnangagwa has had an opportunity to have a first-hand account of the situation and should institute an inquiry in a bid to address the challenges.\n\nZADHR believes that the visit provided President Mnangagwa with an opportunity to appreciate, first-hand, the state of public health services delivery system in Zimbabwe, which is generally plagued by dilapidated infrastructure, shortages of drugs and consumables and demoralised human resources.\n\nZADHR also takes this opportunity to urge President Mnangagwa to institute a Commission of Inquiry on the state of the health sector, said Doctors in a statement.\n\nAccording to ZADHR, the Commission of Inquiry should be mandated to enquire into the situation of health service provision by government and its agencies with a view to ensuring service delivery that responds to the obligations created by the Constitution, which under section 76 guarantees the right to health care.\n\nIn such an enquiry, the Commission of Inquiry may need to scrutinise the current health financing mechanisms in Zimbabwe and the challenges and opportunities.\n\nZimbabwes performance in relation to the Abuja Declaration commitments on health financing and the amounts raised by government using specific health-related taxes such as the sugar tax since their inception, and their utilisation and utility, and\n\nThe current situation in public hospitals, with a focus on referral institutions, including staffing levels in relation to the staff establishment for these institutions and the poor remuneration of all medical practitioners and addressing the massive exodus in this critical sector.\n\nThe process must, therefore, be robust with full engagement of public health institutions, health workers, communities and other relevant stakeholders on the state of affairs.\n\nCitizens must also be allowed to give evidence of their actual experiences of the health sector, doctors said.\n\nRecently, nurses also issued a statement urging the government to immediately intervene as the situation has already gotten out of hand.\n\nNurses said they are working under impossible conditions.\n\nAs nurses, we are working under impossible conditions. We are forced to improvise daily just to preserve life. But we cannot continue like this. The system has failed, and the suffering is unbearable.\n\nWe call on the government of Zimbabwe to urgently prioritise the health sector. Equip hospitals. Support nurses. Save lives. This situation must be addressed without delay, nurses said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30041701/Parirenyatwa-Hospital.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Association of Doctors for Human Rights (ZADHR) has urged President Emmerson Mnangagwa to institute a Commission of Inquiry on the state of the health sector. This follows Mnangagwa’s visits to Parirenyatwa and Sally Mugabe Hospitals on Monday. There has been an uproar over the dilapidated state of public hospitals where there is a lack of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-doctors-push-for-commission-of-inquiry-into-zimbabwes-collapsing-public-health-sector/\">Rights doctors push for Commission of Inquiry into Zimbabwe’s collapsing public health sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "UZ using conciliation hearings to buy time – striking lecturers say as job action clocks day 66",
            "url": "https://www.newzimbabwe.com/uz-using-conciliation-hearings-to-buy-time-striking-lecturers-say-as-job-action-clocks-day-66/",
            "content": "By Staff Reporter\n\nThe Association of University Teachers (AUT) has accused the University of Zimbabwe (UZ) of stalling negotiations while profiting from the labour of adjunct staff filling the roles of striking lecturers.\n\nWith the UZ lecturers wage strike now entering its third month, lecturers remain resolute in their demand for salaries to be raised to US$2,250.\n\nIn a recent interview with NewZimbabwe.com, AUT spokesperson Professor Obvious Vengeyi said that no substantial offer has been made by the government, despite previous assurances.\n\nAs a response to the ongoing impasse, coalition meetings among various university unions have been convened to strategise next steps, reinforcing their commitment to a united front in this labour dispute.\n\nAll state universities unions including non-academics and academics, attended conciliation hearings yesterday 17 June 2025.\n\nThe proceedings were again adjourned to 08 July 2025. We feel that this is a strategy by the employer to endlessly buy time while we are working as their slaves for free. Its cruel.\n\nBut in principle, non-academics and academics are on the same page, there is no going back.\n\nThey have resolved to join AUT in the industrial job action. There is no going back, he said.\n\nStudents also said they are worried that the situation has remained unresolved for a long time.\n\nZinasu spokesperson for UZ Chapter, Darlington Chigwena, said their future has already been compromised as the review of UZ qualifications has gone down.\n\nHe said students will fight in the corner of their lecturers because they are excessively affected.\n\nThe return of our lecturers means that we are going to have credible and quality education.\n\nWe are together with lecturers, we are working hand in glove.\n\nAlso, as students, we are not only showing substantial solidarity to the lecturers because we are aware that if they are treated in a proper manner, it means that we are going to excel as students.\n\nWe are also aware that as students we are workers in transit so if the rights are being respected it means that our rights as future workers are also going to be respected so the picket which is going to happen on Monday, we are going to partake, we are goi g to participate as students, we are going to be there as many as the sand of the sea showing our solidarity with them making sure that justice prevails both for the lecturers and the students, he said.\n\nThe next picketing will be held on Monday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28030530/UZ-strike-10-scaled-e1748490385375.jpg",
            "description": "<p>By Staff Reporter The Association of University Teachers (AUT) has accused the University of Zimbabwe (UZ) of stalling negotiations while profiting from the labour of adjunct staff filling the roles of striking lecturers. With the UZ lecturers’ wage strike now entering its third month, lecturers remain resolute in their demand for salaries to be raised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-using-conciliation-hearings-to-buy-time-striking-lecturers-say-as-job-action-clocks-day-66/\">UZ using conciliation hearings to buy time – striking lecturers say as job action clocks day 66</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Detergents, edible oils sector agrees to pay 70% of salaries in US$",
            "url": "https://www.newzimbabwe.com/detergents-edible-oils-sector-agrees-to-pay-70-of-salaries-in-us/",
            "content": "By Alois Vinga\n\nTHE Detergents, Edible Oils and Fats Sector has reached a Collective Bargaining Agreement (CBA) which approved to pay workers 70% of their salaries in foreign currency.\n\nThe CBA covers the period commencing January to June 30 2025. The agreement should be read as one with clause 6 (Grading and Wages) of the Agreement published in Statutory Instrument 194 of 2018 in accordance with the provisions of the Labour Act as amended.\n\nThe US$/ZWL payment ratio has been adjusted from the current 55^ US$: 45% ZWG to 70:30 split starting May 1 2025. From January 2025 to April 2025the USD: ZWG split remains at US$55% and ZWG 45%. The USD 70%: ZWG 30% portions shall be paid in the currency split. The 30% ZWG portion shall be paid at the prevailing exchange rate as at the date of Payment, the CBA reads in part.\n\nHowever, the agreement did not alter monthly allowances, which include Transport allowance and Housing Allowance, which have remained stuck at US$44,88 per month and US$61,20 per month, respectively.\n\nThe concept of 70%:30% ZWG split shall apply to NEC levies and trade union dues, the CBA added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/16072658/cooking-oil.jpg",
            "description": "<p>By Alois Vinga THE Detergents, Edible Oils and Fats Sector has reached a Collective Bargaining Agreement (CBA) which approved to pay workers 70% of their salaries in foreign currency. The CBA covers the period commencing January to June 30 2025. The agreement should be read as one with clause 6 (Grading and Wages) of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/detergents-edible-oils-sector-agrees-to-pay-70-of-salaries-in-us/\">Detergents, edible oils sector agrees to pay 70% of salaries in US$</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Getbucks corners Magaya over US$400k debt, moves to liquidate his estate",
            "url": "https://www.newzimbabwe.com/getbucks-corners-magaya-over-us400k-debt-moves-to-liquidate-his-estate/",
            "content": "By Darlington Gatsi\n\nPROPHETIC Healing and Deliverance Ministries founder Walter Magaya is in hot soup following his failure to pay a US$420,140 debt owed to GetBucks Microfinance.\n\nGetBucks has approached the High Court seeking to liquidate his estate after the cleric allegedly frustrated efforts by the company to recover its money declaring he has nothing.\n\nLast year, the High Court granted an order against the self-proclaimed prophet, his wife Tendai and their firm Planet Africa (Private) Limited in which the two are directors for payment of US$420,140.72 together with interest to Getbucks.\n\nA writ of execution was subsequently issued resulting in the attachment of the principal debtors immovable property being a certain piece of land called the Remainder of Stand 166 of Prospect measuring 3, 2323 hectares held under Deed of Transfer number 407 6118 dated 27th July 2018 by the principal debtor Planet Africa (Private) Limited which was declared executable by the High Court and was due for sale on March 28 2025 as the debt security.\n\nIn the current application, GetBucks said efforts to execute the judgement have been unsuccessful as Magaya and wife have committed acts of insolvency.\n\nThe court has been told that a couple of days before the sale in execution, the respondent voluntarily resolved to place the principal debtor under Corporate Rescue which position frustrated the sale in execution of the immovable property.\n\nThere being no further assets of the 1st and 2nd Respondent and after frustration of all execution avenues to frustrate the judgment of this court and to render it a brutum fulmen, it follows that the two are insolvent and their estates should be liquidated.\n\nThe 1st and 2nd Respondents are generally unable to pay debts which are due and payable. Procedures have been abused to frustrate execution. Entities linked to the applicant have been used to frustrate genuine execution of court orders.\n\nThese include the PHD Ministries and The Walter Magaya Family Trust, saidGetBucks in the application.\n\nIt also said Magaya and his wife are popular figures in the society with Magaya being a prophet at PHD Ministries.\n\nThe two have presented themselves as individuals with nothing and have used entities as agents. They should show the court how they are settling personal obligations and sustaining themselves, reads the application.\n\nA prima facie case has been made entitling the applicant to be granted a provisional order pending confirmation for the liquidation process to promptly commence.\n\nGetBucks also prayed for costs on a higher scale.\n\nThis is classic abuse of proceedings to frustrate court orders and the creditor. Applicant has been put out of pocket unnecessarily by the 1st Respondent and have been forced to resort to this application. Costs on a punitive scale are warranted in cases of abuse of processes, reads the application.\n\nThe matter was set down for a virtual hearing, Wednesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Darlington Gatsi PROPHETIC Healing and Deliverance Ministries founder Walter Magaya is in hot soup following his failure to pay a US$420,140 debt owed to GetBucks Microfinance. GetBucks has approached the High Court seeking to liquidate his estate after the cleric allegedly frustrated efforts by the company to recover its money declaring he has nothing.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/getbucks-corners-magaya-over-us400k-debt-moves-to-liquidate-his-estate/\">Getbucks corners Magaya over US$400k debt, moves to liquidate his estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "City to City promises fireworks as young stars brace for HICC spotlight",
            "url": "https://www.newzimbabwe.com/city-to-city-promises-fireworks-as-young-stars-brace-for-hicc-spotlight/",
            "content": "By Darlington Gatsi\n\nPREPARATIONS for the City to City concert, slated for 28 June at the Harare International Conference Centre (HICC), are well on course, with interest heightening, organisers have said.\n\nAfter successful concerts across the country, the City to City show is on its final leg in Harare, with several musicians expected to perform.\n\nFreeman, Master H, Tammy Moyo, Killer T, Enzo Ishall, Nisha Ts, and Chillmaster complete the line-up of performers for the end-of-the-month show, which is being held in conjunction with Gateway Stream.\n\nGateway Stream Media manager Elton Kurima said the event has garnered significant interest.\n\nThere has been a fair uptake in terms of ticket sales. The fans have accepted that we have a good gig coming up, and the tickets are moving quite well. As for the preparations for the show, they are 90% done. All service providers have been engaged. Preparations are going as planned, so I can say we are 90% ready for the event, said Kurima in a statement.\n\nThe City to City show is a test of character for young musicians to stake a claim by pulling in big numbers at the hard-to-fill HICC.\n\nContemporary musician Tammy Moyo hailed the event for giving an opportunity to young and fresh artists.\n\nI feel honoured, joyful, and privileged to be part of this incredible line-up for the City to City concerts. Everyone performing has put in their all, and I believe this is going to be a game-changer.\n\nIt is fantastic to see new faces, including mine, young talent on the rise, which is truly exciting. As a female headlining such a major show, I am proud to be paving the way for other young women in the creative industry. I am thrilled to be part of this line-up and hope to inspire others, said Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27024548/IMG-20250126-WA0020.jpg",
            "description": "<p>By Darlington Gatsi PREPARATIONS for the City to City concert, slated for 28 June at the Harare International Conference Centre (HICC), are well on course, with interest heightening, organisers have said. After successful concerts across the country, the City to City show is on its final leg in Harare, with several musicians expected to perform.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-to-city-promises-fireworks-as-young-stars-brace-for-hicc-spotlight/\">City to City promises fireworks as young stars brace for HICC spotlight </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "19 Jun 2025"
        },
        {
            "title": "Mzembi welcome to rejoin Zanu PF – ruling party says",
            "url": "https://www.newzimbabwe.com/mzembi-welcome-to-rejoin-zanu-pf-ruling-party-says/",
            "content": "By Staff Reporter\n\nTHE ruling Zanu PF party has said it is willing to readmit jailedformer Foreign Affairs Minister Walter Mzembi to the party if he wishes toand meets the requirements.\n\nMzembi, who was exiled in Zambia, returned to Zimbabwe last week and was arrested at the airport.\n\nWhen he left the country in 2018, he was on trial for criminal abuse of office and theft of trust propertyand has three outstanding arrest warrants for failing to attend trial.\n\nMzembi was reportedly scheduled to meet President Emmerson Mnangagwa upon his return and possibly rejoin Zanu PF.\n\nSpeaking to local radio station ZiFM, Zanu PF Information Director Farai Marapira on Wednesday said Mzembi will only be allowed to rejoin the party if he formally applies and meets all internal requirements.\n\nIf he wishes to rejoin, there are processes through which this is done, and if these processes are fulfilled and the requirements that are needed for his reentry are fulfilled again, then of course the party will take him in.\n\nThe party is always looking for new members or old members to rejoin, but he has to be in fulfillment of the requirements and dictates of the party.\n\nIt has to be in the partys wisdom to see if it is worthwhile to readmit him or not to do so, so if he wishes to rejoin, I am sure he knows how to apply since he is a former member, Marapira said.\n\nMeanwhile, Mzembi was denied bail and remanded in custody until July 1 for the resumption of his corruption trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Staff Reporter THE ruling Zanu PF party has said it is willing to readmit jailed former Foreign Affairs Minister Walter Mzembi to the party if he wishes to and meets the requirements. Mzembi, who was exiled in Zambia, returned to Zimbabwe last week and was arrested at the airport. When he left the country in 2018,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mzembi-welcome-to-rejoin-zanu-pf-ruling-party-says/\">Mzembi welcome to rejoin Zanu PF – ruling party says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "19 Jun 2025"
        }
    ]
}