{
    "news": [
        {
            "title": "Nasty C’s eleven country Ivyson tour kicks off this weekend in Harare",
            "url": "https://www.newzimbabwe.com/nasty-cs-eleven-country-ivyson-tour-kicks-off-this-weekend-in-harare/",
            "content": "SlikourOnLife\n\nNasty C is not wasting time after dropping his highly anticipated and well-received new album, FREE. The rapper has launched an eleven-country, seventeen-stop Ivyson Tour, kicking off in Harare this weekend.\n\nOther stops include Nigeria, Ghana, Namibia, Zambia, Uganda, Eswatini, and his home country South Africa, among others.\n\nThe tour marks another milestone in Nasty Cs growing global reach, taking South African hip hop beyond borders and across the continent. The Ivyson Tour, now a staple of the rappers brand, continues to evolve, serving as both a live experience for fans and a platform for showcasing new material.\n\nThis years edition of the Ivyson Tour also comes with expanded production and staging across several countries, signaling a continued investment in the tours overall experience. Local support acts are expected to join the lineup in various cities.\n\nThe tour is scheduled to run with multiple stops in West, Southern, and East Africa. Tour dates and venues have been released via Nasty Cs official platforms, and ticket sales are underway in several cities.\n\nNasty C has consistently used the Ivyson Tour as a vehicle to connect directly with fans and expand his presence across Africa and beyond. The tours growing scale reflects both the artists rising profile and the increasing demand for live hip hop experiences across the continent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25151514/nasty-c.jpeg",
            "description": "<p>SlikourOnLife Nasty C is not wasting time after dropping his highly anticipated and well-received new album, FREE. The rapper has launched an eleven-country, seventeen-stop Ivyson Tour, kicking off in Harare this weekend. Other stops include Nigeria, Ghana, Namibia, Zambia, Uganda, Eswatini, and his home country South Africa, among others. The tour marks another milestone in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nasty-cs-eleven-country-ivyson-tour-kicks-off-this-weekend-in-harare/\">Nasty C’s eleven country Ivyson tour kicks off this weekend in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "26 Sep 2025"
        },
        {
            "title": "Gold glitters for Zimbabwean luxury crocodile skins supplier",
            "url": "https://www.newzimbabwe.com/gold-glitters-for-zimbabwean-luxury-crocodile-skins-supplier/",
            "content": "IOL\n\nGold is glittering for Zimbabwean crocodile skin supplier, Padenga Holdings, as luxury markets reels from global economic uncertainty and a growing shift to bullion as a store of value.\n\nPadengadiversified into gold mining in 2019 through the acquisition of Zimbabwe gold mining operations. Analysts said at the time that the diversification representedan unusual pairing but is value accretive through enhancement of forex earningspotential.\n\nNow, the company is reaping the benefits of that diversification, with gold prices spiking to highest levels. Spot gold prices traded above $3 700 per ounce in early trade on Thursday.\n\nFor the half year to end June, gold Prices closed$3 264per ounce for Padenga compared to$2 402per ounceat the beginning of the year. This represents36% increase over the period, with theupturn in the gold pricesalso complementing sterling financial performance at the companys gold miningdivision, Dallaglio.\n\nPadengas gold mining unit contributed 94% of the groups revenues of $130.68 million which was 38% stronger compared to same period last year.\n\nThis was afterDallaglio produced 1 292kgs of gold inthe first half year under review, 7% higher compared to the previous contrasting period attributable tostronger grades and higher plant recoveries.\n\nIn the prior contrasting period, Dallaglio accounted for 88% of Padengas overall revenues.\n\nHalf year profitsbefore taxfor the 2025 half year amounted to$41.31m, up 204% compared to thecontrasting period.\n\nA turnover of $123.37m was achievedfor Padengas gold operations,representing a 41% increase.\n\nEarnings before interest, tax, depreciation and amortisation for the half-year sprung up 114% $49.14m, with cash generated from operations also leaping up 183% to $38.12m attributable to continued investment in strategic growth and debt reduction strategies.\n\nPadenga is additionally investing in capital projects to further ramp up bullion production, with phase 3 of the underground project atitsPickstone mineprogressing according to schedule as access to Level 10 was established during the periodwhiledevelopmentistargeting commissioning of the loading and hoisting infrastructureby the end of this year.\n\nIn addition, Pickstone mine will embark on the addition of a pre-oxidation facility in the second half of the year, said Padenga chairman Themba Sibanda.\n\nThis facility will improve leachability of ore going into the Carbon-in-Leach (CIL) stage and enhance overall plant recovery. Procurement for the project will commence in Q3 and commissioning is targeted for Q1 2026.\n\nWhile the company is sinking capital investment into its gold mining assets, it is slowing down investment in its crocodile farming business as demand slows down.\n\nPadenga, which supplies crocodile skins to international luxury brands, says it has reduced costs by reducing its crocodile farms from three to two.\n\nIts less rosy prospects from the sale of crocodile skins, a business that was once brisk, are a consequence of aluxury industrythatis facing a significant slowdown that has hit even top brands hard,according to McKinsey.\n\nFor the first time since 2016 (excluding 2020), luxury value creation is expected to create less value than the previous year, notes McKinsey in a recent report.\n\nSeveral of theluxuryindustrys growth-driving engines have stalled(and) price increases have reached a ceiling, and higher prices are negatively affecting demandfrom luxury consumers.\n\nIn the first half period under review,sales ofcrocodile skins by Padenga slipped by 5% to13,919 skins. Moreover, the companysUme Crocodile Farm operationshave been discontinued due to the challenging market conditions, that have resulted in reduced demandforcrocodileskins.\n\nApart from supplying crocodile skins to global luxury brands, Padenga also exports crocodile meat to Asian and other markets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25153227/crocodile-gold.png",
            "description": "<p>IOL Gold is glittering for Zimbabwean crocodile skin supplier, Padenga Holdings, as luxury markets reels from global economic uncertainty and a growing shift to bullion as a store of value. Padenga diversified into gold mining in 2019 through the acquisition of Zimbabwe gold mining operations. Analysts said at the time that the diversification represented an “unusual pairing”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-glitters-for-zimbabwean-luxury-crocodile-skins-supplier/\">Gold glitters for Zimbabwean luxury crocodile skins supplier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "26 Sep 2025"
        },
        {
            "title": "Politburo Reshuffle: Mpofu demoted over failure to unite Zanu PF, suspected links to corruption dossier",
            "url": "https://www.newzimbabwe.com/politburo-reshuffle-mpofu-demoted-over-failure-to-unite-zanu-pf-suspected-links-to-corruption-dossier/",
            "content": "By Staff Reporter\n\nZanu PFs Obert Mpofu was removed from his influential position as the ruling party Secretary General amid suspicions he had knowledge of the origins of a corruption dossier recently tabled before the politburo.\n\nPresident Emmerson Mnangagwa reassigned Mpofu to the relatively minor post of Secretary for Information and Communication Technology (ICT) in a politburo reshuffle announced this week.\n\nZanu-PFs politburo is the partys highest decision-making body, and its resolutions are binding.\n\nAccording to Zanu PF activist Tonderai Chidawa, Mpofus demotion reflects concerns within the party over his leadership and his possible ties to the dossier that implicated senior officials in corruption.\n\nChidawa alleges Mpofu failed to unite the party, whose membership, he claims, is fragmented.\n\nMpofu was replaced by the Speaker of the National Assembly, Jacob Mudenda, who previously served as Treasurer General.\n\nSpeaking to a local online TV channel, Chidawa said, He (Mpofu) was failing to unite the party. The party is disintegrated.\n\nChidawa further questioned why Mpofus name was absent from the dossier, suggesting this as evidence that Mpofu had an idea of its source.\n\nWhy is his name not being mentioned in the dossier?\n\nOn Monday, Zanu PF spokesperson Christopher Mutsvangwa stated that the politburo did not discuss the dossier at length, claiming its originator was unknown but believed to be based in South Africa.\n\nThe dossier, which Mutsvangwa said the politburo barely acknowledged, included names such as controversial business tycoons Wicknell Chivayo and Kudakwashe Tagwirei. Vice President Constantino Chiwenga reportedly questioned Mnangagwa as to why those named as corrupt had not been arrested.\n\nChidawa also claimed that Zanu PFs grassroots support in the Matebeleland Provinces erupted in celebration upon hearing news of Mpofus demotion.\n\nPeople are celebrating. There are celebrations in Matebeleland. We are talking of the downfall of a man who owns many big buildings in Bulawayo and Victoria Falls, he said.\n\nThe Zanu PF succession war is reaching a new crescendo as factions aligned to Mnangagwa and Chiwenga vie for power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/02042119/Obert-Mpofu.jpg",
            "description": "<p>By Staff Reporter Zanu PF’s Obert Mpofu was removed from his influential position as the ruling party Secretary General amid suspicions he had knowledge of the origins of a corruption dossier recently tabled before the politburo. President Emmerson Mnangagwa reassigned Mpofu to the relatively minor post of Secretary for Information and Communication Technology (ICT) in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/politburo-reshuffle-mpofu-demoted-over-failure-to-unite-zanu-pf-suspected-links-to-corruption-dossier/\">Politburo Reshuffle: Mpofu demoted over failure to unite Zanu PF, suspected links to corruption dossier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "26 Sep 2025"
        },
        {
            "title": "South African house duo Liquideep reunites after hiatus",
            "url": "https://www.newzimbabwe.com/south-african-house-duo-liquideep-reunites-after-hiatus/",
            "content": "Kaya 959\n\nBeloved South African house music duo Liquideep has officially reunited, ending a long hiatus that left fans longing for their signature sound.\n\nThe group, composed of Jonathan Ziyon Hamilton and Thabo Ryzor Shokgolo, made the exciting announcement on 24 September 2025, through a humorous video posted on the social media platform X.\n\nThe clip, which quickly went viral, shows the pair comically discussing their past fame before teasing their reunion, sparking a wave of excitement across social media.\n\nFormed in Johannesburg in 2007, Liquideep quickly rose to prominence, becoming a staple in the local music scene. Their debut album,Fabrics of the Heart, achieved multi-platinum status, producing chart-topping hits like Alone and Fairytale.\n\nThe duos success was cemented at the 2011 South African Music Awards, where they took home several accolades, solidifying their place as one of the countrys most successful house acts.\n\nFollowing their reunion announcement, Liquideep has already lined up several performances, with a show scheduled in Durban on 1 November and another in Bloemfontein. While the duo has not yet announced a new album, a recent remake of their classic track BBM has fans speculating about new material.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25160715/Liquideep-1.jpg",
            "description": "<p>Kaya 959 Beloved South African house music duo Liquideep has officially reunited, ending a long hiatus that left fans longing for their signature sound. The group, composed of Jonathan “Ziyon” Hamilton and Thabo “Ryzor” Shokgolo, made the exciting announcement on 24 September 2025, through a humorous video posted on the social media platform X. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-house-duo-liquideep-reunites-after-hiatus/\">South African house duo Liquideep reunites after hiatus</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "26 Sep 2025"
        },
        {
            "title": "Nketsi denies rumours she is dating Mbau’s partner Kudzai Mushonga",
            "url": "https://www.newzimbabwe.com/nketsi-denies-rumours-she-is-dating-mbaus-partner-mushonga/",
            "content": "The Citizen\n\nReality TV star Faith Nketsi has set the record straight on claims she is dating Khanyi Mbaus partner, Kudzai Mushonga.\n\nGossip blogMaphepha Ndabaclaimed Nketsi was Mushongas new flame, posting a picture of the two together.\n\nNketsi has since denied the rumours, explaining that Mushonga and another man, who was cropped out of the picture, asked to take a photo with her.\n\nPlease neh. Since no one wants to come forward and say something, therefore creating a false narrative. Im not with Kudzai. NEVER WILL, NEVER BEEN AND NEVER WOULD BE. Can a girl just travel in peace? Nketsi wrote on her Instagram Stories.\n\nNketsi has not gone public with a relationship since her split from businessman Nzuzo Njilo, which ended in divorce in November 2023, less than a year aftertheir April 2022 wedding.\n\nNketsi and herHave Faithcast member and friend Andzelo Tivani are currently travelling.\n\nA few days ago, they jetted off to Germany for Drakes $ome $pecial $hows 4 EU ($$$4EU) tour, which made a stop in Hamburg.\n\n24 hours in Germany to catch Drake concert, Nketsi wrote, captioning pictures and videos of their trip.\n\nOn Wednesday, she shared more travel content from Italy, including a boat cruise and lunch at a beachside restaurant.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/25154030/nketsi-kudzai.png",
            "description": "<p>The Citizen Reality TV star Faith Nketsi has set the record straight on claims she is dating Khanyi Mbau’s partner, Kudzai Mushonga. Gossip blog Maphepha Ndaba claimed Nketsi was Mushonga’s new flame, posting a picture of the two together. Nketsi has since denied the rumours, explaining that Mushonga and another man, who was cropped out of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nketsi-denies-rumours-she-is-dating-mbaus-partner-mushonga/\">Nketsi denies rumours she is dating Mbau’s partner Kudzai Mushonga</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:34",
            "date": "26 Sep 2025"
        }
    ]
}