{
    "news": [
        {
            "title": "FIFA instructor hails Zimbabwean referees’ progress on international stage",
            "url": "https://www.newzimbabwe.com/fifa-instructor-hails-zimbabwean-referees-progress-on-international-stage/",
            "content": "By Sports Reporter\n\nFIFA referees instructor Felix Tangawarima has heaped praise on Zimbabwean match officials.\n\nHe was speaking on the sidelines of a one-week Referees MA Course being held at ZIFA Village in Harare.\n\nNow serving as an instructor, Tangawarima said Zimbabwean referees are doing well in international duty, a sign of how much they have improved.\n\nI can safely say that, as FIFA, we are extremely happy with how these local referees are performing at the international level.\n\nYou can see that there is an increase in the number of referees we are assigning to handle international games, so they are not doing badly, he said.\n\nZimbabwe currently has reigning Referee of the Year Brighton Chimene at the ongoing CHAN tournament as one of the match officials.\n\nOther than Chimene, six local referees are also on the COSAFA panel.\n\nTangawarima is Zimbabwes most successful referee in history. In 2000, he became the first local referee to officiate at AFCON.\n\nCurrently, he is the Head of Referees at COSAFA, leading all referees in the Southern African Region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20072542/felix-tangawarima.jpg",
            "description": "<p>By Sports Reporter FIFA referees instructor Felix Tangawarima has heaped praise on Zimbabwean match officials. He was speaking on the sidelines of a one-week Referees MA Course being held at ZIFA Village in Harare. Now serving as an instructor, Tangawarima said Zimbabwean referees are doing well in international duty, a sign of how much they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fifa-instructor-hails-zimbabwean-referees-progress-on-international-stage/\">FIFA instructor hails Zimbabwean referees’ progress on international stage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "20 Aug 2025"
        },
        {
            "title": "Growing informal sector riles CFI Holdings",
            "url": "https://www.newzimbabwe.com/growing-informal-sector-riles-cfi-holdings/",
            "content": "By Alois Vinga\n\nLISTED agro-industrial concern, CFI Holdings, has bemoaned the unsustainable informal sector market growth for continuing to bleed the established markets potential.\n\nZimbabwe is ranked among the five most informalised economies globally, a situation which places the economyunder intense pressure to generate adequate resources through taxation to support the most critical needs.\n\nAgainst the backdrop, the informalised players continue to reap more benefits as they often flood the markets with goods which are often sold beyond the taxmans scrutiny, putting pressure on the few formalised entities.\n\nPresenting a trading update for the third quarter ended June 30 2025, CFI Holdings said they were feeling the heat exerted by the shadowy economy.\n\nNotwithstanding the economic positives, major businesses continued to grapple with the growing influence of informal retailers, who operate outside the compliance with statutory obligations, lowering their costs of doing business.\n\nThese largely unregulated competitors created additional pressure on margins and customer retention. Management is hopeful the Authorities will continue to intervene in this matter to promote fair competition in the operating environment, said the company.\n\nDuring the period, Farm & City Centre (FCC) sales volumes increased by 9% compared to the comparative period prior year on the back of the agro sectors rebound following the prior years drought.\n\nNotwithstanding increased competition, the entity continued to enjoy the fruits of mutually beneficial relations with its suppliers for key revenue drivers, which have continued to guarantee the businesss stability. The entity continues to implement enhanced product diversification strategies.\n\nIn the same reporting period, Agrifoods sales volumes increased by 13.9% during the quarter against a comparative prior year period, attributable to improved aggregate demand for its products.\n\nManagement remains focused on growing Agrifoods market share notwithstanding increased competition in the feed sector. The business remains responsive to evolving market dynamics and customer needs, with focused engagement and adaptive strategies deployed across operations.\n\nDuring the quarter, Victoria Foods sales volumes declined by 3% compared to the same period the prior year, influenced by grain shortages caused by the drought from the prior year and the late start of the maize harvest.\n\nGoing forward, the Group anticipates the FY2025 economic outturn to remain challenging, influenced by liquidity constraints and reduced aggregate demand. Ongoing cost containment measures will continue to be implemented, added CFI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/07025827/Farm-and-cityCFI.jpeg",
            "description": "<p>By Alois Vinga LISTED agro-industrial concern, CFI Holdings, has bemoaned the unsustainable informal sector market growth for continuing to bleed the established market’s potential. Zimbabwe is ranked among the five most informalised economies globally, a situation which places the economy under intense pressure to generate adequate resources through taxation to support the most critical needs. Against</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/growing-informal-sector-riles-cfi-holdings/\">Growing informal sector riles CFI Holdings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "20 Aug 2025"
        },
        {
            "title": "Traffic diversion in Mabvuku from September for interchange construction – Transport Ministry announces",
            "url": "https://www.newzimbabwe.com/traffic-diversion-in-mabvuku-from-september-for-interchange-construction-transport-ministry-announces/",
            "content": "By Staff Reporter\n\nTRAFFIC in the Mabvuku area will be diverted to detour routes from 9 September 2025 to pave way for construction of the Mabvuku Interchange, the Transport Ministry has announced.\n\nIn a statement on Tuesday, the Ministry of Transport and Infrastructural Development said the move is aimed at ensuring the safety of motorists and construction workers while rehabilitation works progress.\n\nThe Ministry of Transport and Infrastructural Development wishes to inform the motoring public and all road users that traffic will be diverted to detour routes for the Mabvuku Interchange construction project.\n\nDetour will be opened to traffic on Tuesday,9 September 2025, to facilitate smooth and safe rehabilitation works.\n\nThis temporary diversion has been necessitated by the commencement of the construction of the Mabvuku Interchange, ensuring the safety of both motorists and construction personnel while allowing progress on the upgrades.\n\nClear signage will be in place to guide motorists through the alternative routes.\n\nThe Ministry regrets any inconvenience caused and appreciates the publics patience and cooperation during this period, the statement reads.\n\nThree months ago, during the commissioning of the Trabablas Interchange, formerly known as Mbudzi Roundabout, President Emmerson Mnangagwa announced that the government would build new multiple interchanges at busy road points across Harare.\n\nThese include Mabvuku Junction, several spots along Harare Drive and at major traffic circles like Westgate and Kuwadzana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20071441/mabvuku.jpg",
            "description": "<p>By Staff Reporter  TRAFFIC in the Mabvuku area will be diverted to detour routes from 9 September 2025 to pave way for construction of the Mabvuku Interchange, the Transport Ministry has announced. In a statement on Tuesday, the Ministry of Transport and Infrastructural Development said the move is aimed at ensuring the safety of motorists</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/traffic-diversion-in-mabvuku-from-september-for-interchange-construction-transport-ministry-announces/\">Traffic diversion in Mabvuku from September for interchange construction – Transport Ministry announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "20 Aug 2025"
        },
        {
            "title": "High Court upholds infanticide conviction after magistrates clash over contradictory records",
            "url": "https://www.newzimbabwe.com/high-court-upholds-infanticide-conviction-after-magistrates-clash-over-contradictory-records/",
            "content": "By Mary Taruvinga\n\nThe High Court has confirmed the conviction and sentence of a 41-year-old woman for infanticide after resolving contradictions that had led a Regional Magistrate to question whether the case ought to have been treated as concealment of birth.\n\nJusticeMoses Foroma delivered the review judgment in the case of Annie Ferenando after the accused pleaded guilty to contravening Section 48 of the Criminal Law (Codification and Reform) Act [Chapter 9:23].\n\nFerenando gave birth to a baby boy on November 23, 2024, but left the child unwrapped, resulting in his death from exposure.\n\nShe later threw the infants body into a blair toilet pit.\n\nI left him unwrapped and then he got cold, she told the trial court. Asked if she admitted that death would result, she responded: Yes The child died.\n\nThe trial magistrate sentenced her to 12 months in prison, of which four were suspended for good behaviour. The remaining eight months were wholly suspended on condition she performed 280 hours of community service at Sunge Police Station.\n\nHowever, during routine scrutiny, the Regional Magistrate raised concerns over inconsistencies between the charge sheet and the state outline.\n\nThe charge sheet stated the child had been left unwrapped, while the outline erroneously recorded that the baby had been wrapped.\n\nHe also highlighted that the post-mortem listed the cause of death as indeterminate, questioning whether the child had been born alive.\n\nI am of the view that it is not clear if she gave birth to a live baby and hence should have been charged with concealment, the Regional Magistrate wrote in referring the case for review.\n\nForoma, however, found that the contradiction stemmed from a clerical omission  the word not had been dropped in the state outline.\n\nHad the scrutinising Magistrate read in between the lines, the reason for the contradiction would have become apparent, he ruled.\n\nThe High Court further held that the accuseds mental state and circumstances  central to the charge of infanticide under Section 48(3)  were canvassed adequately during sentencing.\n\nForoma concluded: It is clear that the proceedings under review were conducted in a manner that resulted in real and substantial justice being achieved. I confirm that the proceedings were conducted in a manner that ensured the achievement of real and substantial justice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has confirmed the conviction and sentence of a 41-year-old woman for infanticide after resolving contradictions that had led a Regional Magistrate to question whether the case ought to have been treated as concealment of birth. Justice Moses Foroma delivered the review judgment in the case of Annie Ferenando after the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-upholds-infanticide-conviction-after-magistrates-clash-over-contradictory-records/\">High Court upholds infanticide conviction after magistrates clash over contradictory records</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "20 Aug 2025"
        },
        {
            "title": "Court strikes blow against tenants in battle with Harare City Council’s Rufaro Marketing",
            "url": "https://www.newzimbabwe.com/court-strikes-blow-against-tenants-in-battle-with-harare-city-councils-rufaro-marketing/",
            "content": "By Mary Taruvinga\n\nThe High Court has struck off the roll a case brought by three bar operators against Rufaro Marketing (Pvt) Ltd, a Harare City Councilowned company, in a ruling that gives the municipal entity the upper hand in an ongoing battle over leases and sub-tenancy rights.\n\nThe applicants, Ilack Moyo, John Musara and Tendayi Mhembere had sought a declaratory order blocking Rufaro Marketing from collecting rentals directly from their subtenants at Zororo II Bar in Dzivarasekwa, Mabvuku Bar and Willowvale Bar in Highfield.\n\nJusticeMaxwell Takuva ruled that the dispute could not be entertained while related proceedings were already pending before the Magistrates Court.\n\nThis court cannot intervene in the proceedings in the Magistrates Court lest it risks the possibility of conflicting judgments, Takuva said.\n\nWhatever decision that the Magistrate reaches will be able to guide the parties as to how to proceed from there onwards.\n\nThe bar operators accused Rufaro Marketings new management of unlawfully diverting rental payments from their subtenants, undermining agreements they had entered into with the companys previous chief executive officer.\n\nThey argued that this move crippled their ability to meet rental obligations.\n\nHowever, Takuva found the tenants case misdirected, stressing that once they had withdrawn a previous High Court application, they could not stop the respondent from pursuing its own legal remedies.\n\nWhen a party decides to withdraw its matter, it cannot therefore stay the other parties from proceeding to pursue their own application to court, the judge ruled.\n\nStriking the matter off the roll, the court ordered the applicants to pay costs.\n\nWith the case now resting in the Magistrates Court, Rufaro Marketing retains control of rental collections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/19182107/rufaro-marketing-.jpg",
            "description": "<p>By Mary Taruvinga The High Court has struck off the roll a case brought by three bar operators against Rufaro Marketing (Pvt) Ltd, a Harare City Council–owned company, in a ruling that gives the municipal entity the upper hand in an ongoing battle over leases and sub-tenancy rights. The applicants, Ilack Moyo, John Musara and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-strikes-blow-against-tenants-in-battle-with-harare-city-councils-rufaro-marketing/\">Court strikes blow against tenants in battle with Harare City Council’s Rufaro Marketing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "20 Aug 2025"
        },
        {
            "title": "Ambitious refugee Tawanda Muyeye is now a star of The Hundred",
            "url": "https://www.newzimbabwe.com/ambitious-refugee-tawanda-muyeye-is-now-a-star-of-the-hundred/",
            "content": "The Voice\n\nAMBITIOUS refugee Tawanda Muyeye is now a star of The Hundred. In early 2021, months before signing his professional contract with Kent Cricket, Tawanda had his right to remain in the United Kingdom approved by the Home Office.\n\nBorn and bred in Zimbabwe, Tawanda moved to England at the age of 17 and attended Eastbourne College on a cricket scholarship, while spending some time with the Sussex Academy.\n\nNow a batter for Kent Cricket and the Oval Invincibles, Tawanda is set to compete at The Hundred, where he will be one of the few Black players at the tournament.\n\nFor me to be a Black player, playing cricket in England, it just shows that there are no boundaries, Tawanda toldThe Voice.\n\nIf you have dreams, you can achieve them. The colour of your skin doesnt matter. Of course, therell be hurdles along the way, but I think being a player of colour and being a representative is quite a big thing because it just shows that anything is possible.\n\nWhile his professional career began in England, Tawandas love for cricket was born in Zimbabwe when he was just a child.\n\nFor me to be a Black player, playing cricket in England, it just shows that there are no boundaries\n\nMy brother was the person who got me into cricket. On the weekends, when hed come back home from boarding school, I would play cricket with him. Thats how it all started.\n\nIn the High School that I attended, theyd just built a high performance cricket centre, which is unheard of in Zimbabwe, unless youre playing for the national team.\n\nThere werent many high performance centres, especially not in schools, so that was a massive thing, and I spent a lot of my time in there.\n\nWhen I moved to England, I think the biggest change was the weather! Goodness, I found that change difficult, even in April, May, it was still quite chilly for a Zimbabwean kid.\n\nTawanda made a big impression during his time at Eastbourne College. His runs led him to be namedWisdensSchools Cricketer of the Year for 2020, and Kent took notice.\n\nKent are a big reason Im where I am today. They had to jump through some hurdles to get me to this point because Im a refugee, and my family are refugees.\n\nThere was a man named Paul Downton, he was the Director of Cricket at Kent, and he went out of his way to help me. Kent gave me the opportunity to grow and develop as a player, and theyve given me the platform to showcase what I can do.\n\nLooking back four years later, Im just very grateful for Kent and everything theyve done for me.\n\nIve just signed a new contract with them, and I want to give them a shoutout because it wasnt easy for them initially, but they made my life easier and treated me like a normal person and welcomed me with open arms.\n\nTawanda has achieved so much already, and it is the 24-year-olds mindset which keeps him moving forward.\n\nFor me, its about striving to be the best that I can be, not comparing myself to others, because I believe comparison is the thief of all joy.\n\nWhen you get into the professional game, it becomes a bit more complex, and the transition isnt easy. However, I think because I have that desire to be the best that I can be, it keeps me going and keeps me motivated to achieve my goals.\n\nMy main aspiration is to play cricket for England, to play as many Test matches as I can for England. However, I dont just want to play for England once, I want to play for a long time and be good enough to achieve that goal.\n\nKent had to jump through some hurdles to get me to this point because Im a refugee, and my family are refugees.\n\nWhile his focus is on cricket, Tawanda hopes he is remembered for so much more than just the sport. When I do finish playing cricket, I hope people remember me as a person first and foremost, because Im a human being. I go through everything that every other human being goes through.\n\nI dont want people to put me on a pedestal, because no one is bigger than anyone or bigger than the sport. If people are to think about me when I finish playing, I just want them to think that I was entertaining, and a fun person to watch.\n\nI just want to be myself, go out there, be free and play with a smile on my face and inspire people to have fun with what theyre doing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/19164854/muyeye.jpg",
            "description": "<p>The Voice AMBITIOUS refugee Tawanda Muyeye is now a star of The Hundred. In early 2021, months before signing his professional contract with Kent Cricket, Tawanda had his right to remain in the United Kingdom approved by the Home Office. Born and bred in Zimbabwe, Tawanda moved to England at the age of 17 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ambitious-refugee-tawanda-muyeye-is-now-a-star-of-the-hundred/\">Ambitious refugee Tawanda Muyeye is now a star of The Hundred</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "20 Aug 2025"
        }
    ]
}