{
    "news": [
        {
            "title": "Double-digit US$ inflation figure a cause for concern- Industry says",
            "url": "https://www.newzimbabwe.com/double-digit-us-inflation-figure-a-cause-for-concern-industry-says/",
            "content": "By Alois Vinga\n\nA double-digit US$ inflation rate is cause for concern considering the economy is already highly dollarized, industry lobby group Confederation of Zimbabwe Industries (CZI) has said.\n\nZimbabweis battling to maintain sustainable inflation rates with a series of measures being implemented time and again to achieve the goal.\n\nLast year, the Reserve Bank of Zimbabwe (RBZ) introduced the ZWG currency  a minerals and foreign currency backed local unit and presented it as the lasting solution to decades-old currency problems.\n\nSix months after its introduction,the ZWG sufferedmassive depreciation against the greenback on the alternative market. The central bank was forced to swallow the bitter pill after intervening by unilaterallydeclaring a 43% devaluation rate in a bid to align with realistic market trends.\n\nHowever, inflationary rates published by the Zimbabwe National Statistics Agency (Zimstat) last month indicated that the countrys safe-haven, the US$ endured severe inflation blows after the year-on-year US$ inflation rate for January 2025 jumped to 14.6%, thereby gaining 12,1% from a rate of 2,5% in December 2024.\n\nAgainst the background, double-digit USD inflation under a highly dollarized environment is a cause for concern, as prices are generally expected to be stable in USD terms, the industry grouping inflation tracker said.\n\nRecords show that US$ inflation rate has been stable since January 2021 with current trends departing from the years long gains.\n\nIn Zimbabwe, US$ inflation is normally a response to ZWG inflation, as retailers adjust their prices in line with ZWG prices to avoid being accused by the RBZs Financial Intelligence Unit (FIU) for using the parallel market rates, the CZI analysis said.\n\nThe US$ month-on-month inflation began the year at a higher rate of about 11,5% for January 2025, which is an all-time high rate over the past four years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>By Alois Vinga A double-digit US$ inflation rate is cause for concern considering the economy is already highly dollarized, industry lobby group Confederation of Zimbabwe Industries (CZI) has said. Zimbabwe is battling to maintain sustainable inflation rates with a series of measures being implemented time and again to achieve the goal. Last year, the Reserve Bank</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/double-digit-us-inflation-figure-a-cause-for-concern-industry-says/\">Double-digit US$ inflation figure a cause for concern- Industry says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "After ignoring council regulations in property renovations, Mafume’s Belvedere hostel now faces demolition",
            "url": "https://www.newzimbabwe.com/after-ignoring-council-regulations-in-property-renovations-mafumes-belvedere-hostel-now-faces-demolition/",
            "content": "By Staff Reporter\n\nHaving presided over the City of Harares demolition of homes in Belvedere last year, insisting they bypassed due process, Harare Mayor Jacob Mafume is about to find the boot on the other foot.\n\nA City of Harare inspector, David Wadarwa, Monday told the Commission of Inquiry, led by retired Judge Justice Maphios Cheda, that he will recommend the demolition  of unauthorised renovations to Mafumes own Belvedere property. It could be a classic case of hoist by his own petard.\n\nMafume, it seems, has transformed his residential pad into a hostel, a commercial venture that blatantly ignores council rules. He has admitted the foul play  neglecting to apply for a change of use permit.\n\nDuring his commission testimony, Wadarwa appeared like a rabbit caught in the headlights, completely floundering when quizzed about his inspection of Mafumes property.\n\nThe commission grilled Wadarwa relentlessly, demanding an explanation for how he greenlighted the inspection on a building that did not match the plans.\n\nWhy were you signing for developments which are not in accordance with the plan? lead evidence Tapiwa Fresh Godzi pressed.\n\nWadarwa replied, To me, its normal that I sign and then recommend that changes are made.\n\nWhen pushed further, he stammered, It was an error on my part, Sir. An error repeated six times, apparently, each one carefully signed off on  queried Justice Cheda.\n\nWadarwa claims he was pressured by his boss and dashed through the process, forging dates as he signed off on all six approvals in a single day. The commission then inquired about Wadarwas remedy to his mistakes.\n\nI will advise the owner of the property to demolish the alterations made to his property and revert to the original approved plan. I will write a letter to my seniors informing them about this, he said.\n\nMafume, despite admitting to bending the rules, is clinging to the hope of regularisation  relying on a loophole in the by-laws.\n\nBut City of Harare Urban Planning Acting Director Samuel Nyabeza said it is not possible. He branded the inspection signatures on Mafumes property plan as highly suspicious, noting the impossibility of such frequent inspections.\n\nNyabeza also insisted that Mafume must rectify his error by returning the property to its original residential status.\n\nMafume is understood to have jetted out of the country but will be back next week to face the commission.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05173756/mafume-and-home.png",
            "description": "<p>By Staff Reporter Having presided over the City of Harare’s demolition of homes in Belvedere last year, insisting they bypassed due process, Harare Mayor Jacob Mafume is about to find the boot on the other foot. A City of Harare inspector, David Wadarwa, Monday told the Commission of Inquiry, led by retired Judge Justice Maphios</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-ignoring-council-regulations-in-property-renovations-mafumes-belvedere-hostel-now-faces-demolition/\">After ignoring council regulations in property renovations, Mafume’s Belvedere hostel now faces demolition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "Harare losing US$10 million a year due to opaque billing system – says Mayor Mafume, last council audit done five years ago",
            "url": "https://www.newzimbabwe.com/harare-losing-us10-million-a-year-due-to-opaque-billing-system-says-mayor-mafume-last-council-audit-done-five-years-ago/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume has shockingly revealed that the City Council is losing more than US$10 million due to leakages, exacerbated by the lack of a functional Enterprise Resource Planning (ERP) system, depriving the municipality of much-needed revenue.\n\nMafume made these revelations at the ongoing Commission of Inquiry, which is investigating the operations of Harare City Council since 2017.\n\nIn recent years, Harare City Council has been operating using an opaque billing system, which has created opportunities for corruption and embezzlement by senior officials.\n\nThe Auditor General has repeatedly flagged the financial mismanagement at Harare City Council, with more than US$200 million unaccounted for, raising suspicions of corruption within the municipality.\n\nHowever, Mafume suggested that the amount identified by the Auditor General might be lower than the actual losses incurred by the council.\n\nI am unable to provide exact figures because management has ensured that no audits have been conducted at the Council from 2019 to date. However, we have anecdotal evidence. Millions are paid out, duplicate payments are made, and some ratepayers fees are waived.\n\nWe could be looking at losses of around US$10 million per year. The City Council has been haemorrhaging funds, said Mafume.\n\nFollowing the withdrawal of Quill Associates, which had been supplying the City Council with a billing system, the municipality implemented SAGE, a system riddled with inefficiencies.\n\nThis has resulted in the City Council being unable to account for a significant amount of money, which Parliament in 2022 suggested could amount to billions.\n\nHarare City Council has failed to audit its accounts for over five years, raising serious concerns about corporate governance at the Town House.\n\nAccording to Mafume, top officials at the City Council have formed a corruption cartel, profiting from the chaos.\n\nLast year Mafume revealed that as a result of the lack of ERP, more than 100,000 households are not in the system of the Council, shortchanging the local government.\n\nMafume also claimed that the Harare City Council Executive has been obstructing his efforts to implement a functional ERP system.\n\nI have tried everything to get an ERP system installed at the Council. I end up being accused of interference, but I have done everything humanly possible to get an ERP in place. We cannot function without an ERP.\n\nThis is a deliberate act by our procurement department and management. They do not want an ERP system implemented, said Mafume\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06142935/mafume-mayor.jpg",
            "description": "<p>By Darlington Gatsi HARARE Mayor Jacob Mafume has shockingly revealed that the City Council is losing more than US$10 million due to leakages, exacerbated by the lack of a functional Enterprise Resource Planning (ERP) system, depriving the municipality of much-needed revenue. Mafume made these revelations at the ongoing Commission of Inquiry, which is investigating the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-losing-us10-million-a-year-due-to-opaque-billing-system-says-mayor-mafume-last-council-audit-done-five-years-ago/\">Harare losing US$10 million a year due to opaque billing system – says Mayor Mafume, last council audit done five years ago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "Zimbabwe mandates companies to report in local currency amid forex struggle",
            "url": "https://www.newzimbabwe.com/zimbabwe-mandates-companies-to-report-in-local-currency-amid-forex-struggle/",
            "content": "IOL\n\nZimbabwes central bank has issued a new directive for listed companies to report their financial results in the countrys struggling local currency, and also reduced the portion of proceeds that exporters retain in foreign currency.\n\nStretched for foreign exchange resources and struggling to entrench usage of the Zimbabwe Gold (ZiG) local unit of exchange, the administration of President Emerson Mnangagwa has been scrambling for ways to contain company closures, de-stocking by retailers and decimation of the formal economy.\n\nThis has resulted in new monetary measures announced by the Reserve Bank of Zimbabwe governor, John Mushayavanhu, including a requirement that companies listed on the Zimbabwe Stock Exchange report their financials in the ZiG currency.\n\nWith the economy highly dollarised, most Zimbabwe listed companies had started to report their financials in US dollars, mirroring the currency of transactions processed by their businesses.\n\nGiven the need to ensure comparability of financial statements, the Reserve Bank, following consultations with the Public Accountants and Auditors Board (PAAB), requires that all entities adopt a common presentation currency, ZiG, for reporting purposes, with immediate effect, including for the 2024 audited financial statements, Mushavanhu said last week.\n\nAlthough listed companies such as Delta Corporation have noted that more than 70% of transactions were in US dollars, Mushayavanhu said the requirement to report financials in local currency was consistent with the increase in the number and value of transactions settled in ZiG.\n\nZimbabwe introduced the ZiG currency in April last year.\n\nApart from this, the Zimbabwean central bank has reduced the portion of earnings that exporters can retain in foreign currency. Zimbabwean exporters and other businesses argue that all their inputs and working capital is in US dollars.\n\nThe Horticultural Development Council said lowering of the forex retention threshold from 70% to 75% presents significant challenges for the horticulture sector that relies heavily on foreign currency earnings to sustain production.\n\nUnder the forex retention policy, exporters in Zimbabwe get 75% of their earnings in foreign currency while 25% is paid out in the local currency equivalent at the official exchange rate that often trails the thriving parallel exchange rate.\n\nThe horticulture industry operates within tight cost margins, with most inputssuch as power, fuel, seed, fertilisers, packaging, and freightdenominated in US dollars, said Linda Nielsen, CEO of HDC.\n\nThe reduction in forex retention means exporters will have less hard currency to meet these critical expenses, placing strain on cash flow and investment in the sector.\n\nZimbabwean retailers have been among the most affected by the countrys currency uncertainty, with many wholesale and retail companies folding up, rationalising operations and destocking.\n\nThe Confederation of Zimbabwe Retailers said over the weekend that the reduction of the foreign currency retention threshold posed challenges for the retail and wholesale sector in terms of supply chain stability and pricing.\n\nExporters, who also supply goods to local formal retailers and wholesalers, rely heavily on foreign currency for key inputs in their various fields, said Denford Mutashu, head of the Zimbabwe retailers grouping.\n\nWith reduced forex retention, these exporters may struggle to meet their USD-denominated expenses, leading to higher production costs and possibly further dollarising supply chains.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/13154056/Harare-Car-Supermarkets.png",
            "description": "<p>IOL Zimbabwe’s central bank has issued a new directive for listed companies to report their financial results in the country’s struggling local currency, and also reduced the portion of proceeds that exporters retain in foreign currency. Stretched for foreign exchange resources and struggling to entrench usage of the Zimbabwe Gold (ZiG) local unit of exchange,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-mandates-companies-to-report-in-local-currency-amid-forex-struggle/\">Zimbabwe mandates companies to report in local currency amid forex struggle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "Remembering AKA: Exploring the South African rapper’s most streamed songs",
            "url": "https://www.newzimbabwe.com/remembering-aka-exploring-the-south-african-rappers-most-streamed-songs/",
            "content": "IOL\n\nAs South Africa continues to mourn the loss of one of its most profound musical voices,Kiernan Jarryd Forbes,better known to the Megacy as AKA, remains an indelible part of the nations cultural fabric.\n\nThecelebrated rapperand songwriter, tragically taken from us on February 10, 2023, left behind a legacy transcending mere entertainment; his music captures universal themes of love, ambition, and resilience.\n\nIn remembering AKA, we take a closer look at some of his most YouTube-streamed songs, which not only showcase his artistic brilliance but also define an era in SA hip hop.\n\nAmong his most iconic tracks is the pulsating anthem Fela in Versace, featuring Nigerian producer Kiddominant. With a staggering 17 million views, this track draws inspiration from the legendary Nigerian music icon, Fela Kuti.\n\nThe accompanying music video is a visual feast, capturing the very essence of the song  energetic beats matched by compelling visuals.\n\nIts no wonder that Fela in Versace has found its place as a significant milestone in AKAs career, resonating widely with fans both locally and across the continent.\n\nAnother standout hit is All Eyes on Me, featuring a stellar lineup that includes Burna Boy, JR, and Da L.E.S.\n\nWith 13 million views, this dynamic collaboration reflects AKAs distinct flair for uniting diverse artistic voices within the African music landscape.\n\nThe song encapsulates the essence of a house party, offering listeners a vivid portrayal of the vibrant and celebratory spirit of Mzansi culture.\n\nIn a recent interview with podcast hosts Mac G and Sol Phenduka, JR shared insights into the creation process, relaying how AKAs vision evolved into a track that danced between hip hop and dancehall influences.\n\nNot to be overlooked is Victory Lap, a testament to perseverance with a relatively modest 140,000 views.\n\nThis powerful anthem, featured on his acclaimed album Altar Ego, speaks not just to his journey as an artist, but serves as a beacon of hope for many listeners facing their own challenges.\n\nIt showcases AKAs ability to transform personal trials into relatable experiences, encouraging fans to chase their dreams with determination.\n\nThis track marked a pivotal moment, announcing AKA as a formidable force in the music industry and launching him fully into the mainstream consciousness.\n\nIt captures a sense of aspiration as AKA reflects on his own journey and the desire to reach similar heights  an intimate glimpse into the mind of an artist deeply rooted in personal experiences.\n\nAs we track AKAs extensive catalogue, its clear that his music does more than simply entertain  it profoundly impacts lives, prompting listeners to confront their own emotions and experiences.\n\nHis talent for blending diverse genres, including hip hop, kwaito, and Afrobeat, set AKA apart as a unique force wielding significant influence on the music scene in SA and beyond.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/04030512/AKA-Profile.jpeg",
            "description": "<p>IOL As South Africa continues to mourn the loss of one of its most profound musical voices, Kiernan Jarryd Forbes, better known to the Megacy as AKA, remains an indelible part of the nation’s cultural fabric. The celebrated rapper and songwriter, tragically taken from us on February 10, 2023, left behind a legacy transcending mere entertainment; his music captures</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/remembering-aka-exploring-the-south-african-rappers-most-streamed-songs/\">Remembering AKA: Exploring the South African rapper’s most streamed songs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "Rival Zanu PF factions clash at Heroes Acre as succession fight intensifies",
            "url": "https://www.newzimbabwe.com/rival-zanu-pf-factions-clash-at-heroes-acre-as-succession-fight-intensifies/",
            "content": "By Staff Reporter\n\nRIVAL Zanu PF supporters Monday clashed at the Heroes Acre where songs calling for President Emmerson Mnangagwa were drowned in chants that favour his deputy Constantino Chiwenga.\n\n2030 ndeya Emmerson, siyanai naye Mnangagwa, sang hundreds of supporters at the burial of national hero Tinaye Chigudu.\n\nChigudu was one of the first combatants trained under the Zimbabwe Peoples Revolutionary Army (ZPRA) in North Korea.\n\nHe spent 12 years in prison during the fight for liberation and continued with the fight for independence after his release.\n\nThe 2030 statement chanted at Zimbabwes national shrine was in reference to efforts by sections within Zanu PF which want Mnangagwa to stay in power beyond his constitutionally mandated two terms.\n\nAlthough his second term ends in 2028, some within the party want to delay Chiwengas ascent by extending Mnangagwas term by two years.\n\nAs Mnangagwas supporters sang, another section chanted: Siyanai naye Mukanya.\n\nMukanya is Chiwengas totem.\n\nThe clash had been anticipated seeing as the succession battle in Zimbabwes ruling party continues to heat up.\n\nDespite his conspicuous silence, Chiwenga is reportedly eyeing the Presidency.\n\nHe has however publicly denigrated some of Mnangagwas allies, much recently when he seemed to attack controversial tenderprenuer Wicknell Chivayo whom he described as a Chigananda.\n\nMnangagwa on the other hand has already made inroads toward achieving the term extension with provinces and leagues in Zanu PF having already started endorsing him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/13054207/Chiwenga-Mnangagwa.png",
            "description": "<p>By Staff Reporter RIVAL Zanu PF supporters Monday clashed at the Heroes Acre where songs calling for President Emmerson Mnangagwa were drowned in chants that favour his deputy Constantino Chiwenga. “2030 ndeya Emmerson, siyanai naye Mnangagwa,” sang hundreds of supporters at the burial of national hero Tinaye Chigudu. Chigudu was one of the first combatants</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rival-zanu-pf-factions-clash-at-heroes-acre-as-succession-fight-intensifies/\">Rival Zanu PF factions clash at Heroes Acre as succession fight intensifies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "Fraud-accused Mpofu, Chimombe’s trial fails to take off",
            "url": "https://www.newzimbabwe.com/fraud-accused-mpofu-chimombes-trial-fails-to-take-off/",
            "content": "By Staff Reporter\n\nThe trial in which businessmen Moses Mpofu and Mike Chimombe are accused of duping the state of US$7 million in a botched goat tender has failed to commence as one of the lawyers is currently attending a family bereavement.\n\nOne of the lawyers, Advocate Tapson Dzvetero, lost his brother-in-law last night, High Court judge Justice PisirayiKwenda was told.\n\nMr Dzvetero is attending the funeral of his brother-in-law who was electrocuted at the Support Unit last night.\n\nBurial is expected on Wednesday or Thursday and my principal, Mr Dzvetero will not be availablebut I received instructions that he might be available on the 19th /20th of February going forward,said Chapeta who was standing in for Dzvetero.\n\nThe trial which was initially set for this entire week on a continuous roll is now expected to commence on February 20.\n\nWitness Mabhaudhi confirmed that he had been informed of the funeral.\n\nWe are left with only one month to complete the term, the judge said, noting that the matter should be finalised before the term ends.\n\nSeven witnesses were in attendance.\n\nThe first to testify will be Titus Mbambi, Fungai Kapfunde and Beverly Mutsikamahwe.\n\nMpofu and Chimombe face allegations of corruptionin which the State alleges they defrauded the Ministry of Lands of US$7 million after applying and securing a tender using a non-existent firm.\n\nThe two have been in jail since June last year.\n\nAll their efforts to secure freedom have failed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Staff Reporter The trial in which businessmen Moses Mpofu and Mike Chimombe are accused of duping the state of US$7 million in a botched goat tender has failed to commence as one of the lawyers is currently attending a family bereavement. One of the lawyers, Advocate Tapson Dzvetero, lost his brother-in-law last night, High</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fraud-accused-mpofu-chimombes-trial-fails-to-take-off/\">Fraud-accused Mpofu, Chimombe’s trial fails to take off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "Kendrick Lamar’s Super Bowl show was one big tease",
            "url": "https://www.newzimbabwe.com/kendrick-lamars-super-bowl-show-was-one-big-tease/",
            "content": "BBC\n\nI want to play their favourite song but you know they love to sue, said Kendrick Lamar, a couple of minutes into his Super Bowl half-time show.\n\nEveryone knew what he was referring to. Not Like Us, his brutal takedown of rap rival Drake, was one of last years breakout hits, earning one billion streams on Spotify and five Grammy Awards, including song of the year.\n\nBut there were questions over whether Lamar would play it  or even could play it  at the Super Bowl, afterDrake filed a defamation lawsuitfor lyrics that branded him a sexual predator, which he denies.\n\nLamar leaned into the dilemma, teasing the song over and over during his set, before finally giving the audience what they wanted.\n\nWhen the song finally played, Kendrick self-censored the most contentious lyric, in which he calls Drake a certified paedophile.\n\nBut he looked directly into the camera with a mischievous grin as he called out Drakes name; and left intact the songs notorious double-entendre: Tryin to strike a chord and its probablyA minor.\n\nThat lyric echoed around the Caesars Superdome in Louisiana, indicating that no amount of legal action could ever hope to diminish the songs popularity.\n\nIn playing it, Lamar was expected to have reached more than 120 million TV viewers who had tuned in to see the game in which thePhiladelphia Eagles defeated the Kansas City Chiefs 40-22to deny them an unprecedented third straight Super Bowl.\n\nThe performance was further heightened by the surprise appearance of tennis star Serena Williams, who performed the Crip Walk  a notorious Los Angeles dance move  as Lamar prowled the stage.\n\nDrakes lawyers are suing Lamars record label Universal Music Group over the track, accusing it of trying to create a viral hit out of a song that made false factual allegations about the star.\n\nGetty Images Serena Williams was the only unannounced guest star during the set\n\nSunday marked the first time that a solo rapper had headlined the Super Bowl, and Lamar brought an elaborate stage show, full of dancers, fireworks and special guests.\n\nBut the rappers lyrics have always explored the contradictions between ego and self-doubt, and his Super Bowl set put that conflict in the spotlight.\n\nHe performed on a giant noughts and crosses board, flipping between introspective deep cuts (typically staged inside the Xs) and crowd-pleasing chart hits (which took place in the Os).\n\nActor Samuel L Jackson, dressed as Uncle Sam, acted as emcee  berating Lamar when he became too self-indulgent, and praising his duets with R&B singer SZA.\n\nThats what Im talking about, Jackson said, after the duo performed All The Stars, a ballad from the soundtrack to Marvels Black Panther movie.\n\nThats what America wants, nice and calm.\n\nGetty Images Kendrick arrived on stage atop a black Buick GNX car  the same model his father drove home from hospital after he was born in 1987\n\nBut whatever Lamar performed, the energy was electrifying.\n\nEarly highlights included Humble and DNA, both taken from the rappers Pulitzer Prize-winning album DAMN, and whose tectonic beats rattled around the stadium.\n\nThe set,which is available to watch on YouTube, also included Squabble Up, Man At The Garden and another Drake diss track, Euphoria.\n\nUnlike most Super Bowl performers, Lamar isnt much of a mover, but he had a charismatic swagger as he walked in step with his dancers; and clever staging gave the show momentum  especially on nervy, angular tracks like Peekaboo.\n\nSZA also gave the set a lift, with supple vocals and improbably flexible choreography that helped soften Lamars edgier instincts.\n\nGetty Images SZA and Lamar have been frequent collaborators, appearing on each others albums since 2017\n\nReuters Samuel L Jackson was the ringleader of Lamars elaborate Super Bowl set\n\nNot Like Us was the undoubted climax, but Lamar took a victory lap on the bouncy West Coast anthem TV Off, where he boasted, yeah, somebody gotta do it.\n\nHe was joined on stage by the songs producer, Mustard, who clutched a football while sporting the worlds baggiest jeans  before Lamar pointed an imaginary remote control at the camera and intoned, Game Over.\n\nFor fans, it was a powerful performance, full of Easter eggs  including a snippet of the unreleased song Bodies.\n\nCasual viewers might have agreed more with Samuel L Jacksons plea for Lamar to keep it light; especially as some of his more densely-written lyrics were rendered unintelligible by the stadiums cavernous echo.\n\nAnd it was noticeable that Lamar omitted to play his civil rights anthem Alright, in a year where the NFL chose to remove the phrase end racism from the end zone of the football field.\n\nThe phrase had been present at the Super Bowl since 2020, amid the Black Lives Matter protests  for which Alright had become the unofficial soundtrack.\n\nMany had expected Lamar to make a bigger statement, especially with President Donald Trump in attendance, but the stars performance remained resolutely uncontroversial  unless, of course, your name is Drake.\n\nGetty Images A protester unveiled a flag during Not Like Us\n\nNonetheless, Lamars show was sleek and streamlined  as many fans had expected, afteraudio of the backing track leakedon Thursday.\n\nThe only interruption came at the climax of the 13-minute set, when a protester climbed on top of Lamars black Buick GNX car and unfurled a combined Palestinian and Sudanese flag, before being tackled by security officers.\n\nThe NFL later said in a statement that the protester was part of the 400-member cast who took part in the show.\n\nGetty Images\n\nThe career-spanning set crammed 11 songs into 13 minutes. Heres what Kendrick played.\n\nReuters Taylor Swift was there to support her boyfriend Travis Kelce, whose team were in the final for the third consecutive year\n\nBefore the show, it had been rumoured that Taylor Swift might swoop down from her VIP suite to join Lamar on stage.\n\nThe pair duetted on a remix of her single Bad Blood in 2015  and fans hoped they might perform it live for the first time at the Super Bowl.\n\nIn the end, Swift opted just to watch the show, along with other celebrity attendees including Paul McCartney, Stormzy, Lady Gaga, Jay-Z, Ice Spice, Doechii, Paul Rudd, Bradley Cooper and Winnie Harlow.\n\nMaybe it was for the best: Some reports suggested that Swift had been booed at the stadium, where almost 80% of fans supported the Philadelphia Eagles, rather than her boyfriend Travis Kelces team.\n\nFox Lady Gaga taped her segment earlier in the week\n\nBefore kick-off, Lady Gaga made a surprise appearance on Bourbon Street, in the middle of New Orleans historic French Quarter.\n\nThe star, who played her own Super Bowl half-time show in 2017, played a touching rendition of her song Hold My Hand, honouring the victims of the New Years Day terror attack that claimed the lives of 14 people in the city.\n\nGaga was surrounded by first responders as she played a black baby grand piano in the middle of the road.\n\nHere on Bourbon Street, always the heart and soul of New Orleans, this year began with a terror attack that tried to shatter its spirit, said former American footballer Michael Strahan during the pre-filmed segment.\n\nBut the resilience of New Orleans is matched by the resolve of our country.\n\nGetty Images Jon Batiste became the first musician to perform the US National Anthem at the Super Bowl in front of a sitting president\n\nMusical performances before the game also included R&B artist Ledisi, who performed Lift Every Voice and Sing, often referred to as the Black National anthem, joined by 125 youth choir members.\n\nMusician Troy Andrews, popularly known as Trombone Shorty, and Christian singer-songwriter Lauren Daigle played America the Beautiful  giving the track a feel-good New Orleans vibe.\n\nAnd just before the game began, New Orleans native Jon Batiste sang the American National Anthem, adding a few jazz flourishes from his multi-coloured grand piano.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10071528/kendrick-super-bowl.webp",
            "description": "<p>BBC “I want to play their favourite song… but you know they love to sue,” said Kendrick Lamar, a couple of minutes into his Super Bowl half-time show. Everyone knew what he was referring to. Not Like Us, his brutal takedown of rap rival Drake, was one of last year’s breakout hits, earning one billion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kendrick-lamars-super-bowl-show-was-one-big-tease/\">Kendrick Lamar’s Super Bowl show was one big tease</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "This is the player I appreciate – Vitor Pereira gives verdict on Marshall Munetsi after debut for Wolves in Blackburn win",
            "url": "https://www.newzimbabwe.com/this-is-the-player-i-appreciate-vitor-pereira-gives-verdict-on-marshall-munetsi-after-debut-for-wolves-in-blackburn-win/",
            "content": "Molineux\n\nWolves are into the fifth round of the FA Cup after beating Blackburn Rovers  and fans got their first look at new signing Marshall Munetsi.\n\nWolveswon 2-0 at Ewood Park courtesy of goals from Joao Gomes and Matheus Cunha.\n\nIt was ultimately a great day at the office for Wolves having started the game a little slowly, and there were several top individual performances at Ewood Park.\n\nVitor Pereirawent strong with his team selection, just as he did against Bristol City.\n\nNew signingMarshall Munetsiwas named on the bench, as was Nasser Djiga  and the Zimbabwean was called into action midway through the second-half.\n\nWolves fans enjoyed Munetsis display against Blackburn, after the game, Pereira gave his thoughts about the new Wolves number 5.\n\nPereira started Gomes and Jean-Ricner Bellegarde as a midfield two against Blackburn, and the pair did a great job.\n\nJust after the hour mark, Munetsi came on in place of Bellegarde, and it was a lively debut from the former Reims ace.\n\nMunetsi played in midfield but regularly pushed up high and even found himself in the box a few times.\n\nHe had a few chances to score, including a headed opportunity after a delicious cross from the magnificent Rodrigo Gomes.\n\nMunetsi is a holding midfielder by trade, but did actually have a good goalscoring record at Reims.\n\nAnd seemingly, Pereira wont be afraid to use him higher in games.\n\nHe said of his new signing after todays game (as quoted by Nathan Judah): Hes a transition midfielder with the physicality to break & score & then be defending, this is the player I appreciate Hes a midfielder that score goals, its normal for him, he has a good record.\n\nFurther quotes from Pereira on Munetsi and the other newbies have appeared on theWolves official websitesaying: Hes a strong player. The three players that we brought in this window, they are strong  physically strong, and they can add a lot. They can help us a lot in this long season that we have to face.\n\nIt was a positive debut for Munetsi against Blackburn and fans will hope he can soon push the likes of Gomes, Andre and Bellegarde for a starting spot.\n\nHe looks like he will add physicality for Wolves, but clearly, he does also have an eye for goal as well, and Pereira looked like he wanted to take advantage of Munetsis attacking prowess against Blackburn.\n\nThe star has come from the same team as Emmanuel Agbadou, and fans will hope Munetsi can have a similar impact to that of the Ivorian.\n\nAll of a sudden, this Wolves squad feels much more competitive, and hopefully, the second half of the season will be radically different to the first.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>Molineux Wolves are into the fifth round of the FA Cup after beating Blackburn Rovers – and fans got their first look at new signing Marshall Munetsi. Wolves won 2-0 at Ewood Park courtesy of goals from Joao Gomes and Matheus Cunha. It was ultimately a great day at the office for Wolves having started</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/this-is-the-player-i-appreciate-vitor-pereira-gives-verdict-on-marshall-munetsi-after-debut-for-wolves-in-blackburn-win/\">This is the player I appreciate – Vitor Pereira gives verdict on Marshall Munetsi after debut for Wolves in Blackburn win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        },
        {
            "title": "A fitness club in Zimbabwe cemetery aims to outpace death one step at a time",
            "url": "https://www.newzimbabwe.com/a-fitness-club-in-zimbabwe-cemetery-aims-to-outpace-death-one-step-at-a-time/",
            "content": "By VOA\n\nHARARE  At dawn, 65-year-old Nelly Mutandwa swapped her pajamas for leggings, a T-shirt and sneakers. She grabbed a bottle of water before heading to an unconventional workout spot: a cemetery in Zimbabwes capital, Harare.\n\nSurrounded by rows of graves, she joined other members of the Commandos Fitness Club in an hour-long session of squats, lunges and stretches as upbeat music blared. For Mutandwa, the daily routine is more than exercise. Its her lifeline in managing diabetes.\n\nThey are resting, she said, pointing to the graves. I just dont want to join them yet. That means I have to do the hard work here.\n\nWith limited fitness facilities such as gyms in their neighborhoods, older Zimbabweans are exercising wherever they can to combat Africas growing problem of non-communicable diseases like heart problems, high blood pressure and diabetes. Other groups exercise along highways or disused railway lines.\n\nGlobally, non-communicable diseases, which are conditions that cannot be directly passed from person to person, are the leading cause of death, responsible for 41 million, or 74%, of annual fatalities, according to the World Health Organization.\n\nNon-communicable diseases currently account for about 40% of deaths annually in Zimbabwe, according to its ministry of health and child care.\n\nIn Zimbabwe and the rest of sub-Saharan Africa, non-communicable diseases are set to overtake communicable diseases such as HIV, tuberculosis, malaria and cholera as the leading cause of death or illness by 2030, according to WHO.\n\nPreviously associated with older people, non-communicable diseases are increasingly spreading to children and young adults due to smoking, frequent alcohol use, unhealthy diets and lack of physical activity.\n\nThis has sparked huge concern among experts and governments on a continent that is experiencing the worlds fastest population growth and is home to its youngest population.\n\nDr. Johannes Marisa, a public health specialist in Harare and president of the Medical and Dental Private Practitioners of Zimbabwe Association, said doctors are witnessing a rapid change as more children and young people are diagnosed with NCDs.\n\nHe attributed it partly to sedentary lifestyles as many people spend much of their time glued to their smartphone screens at the expense of physical movement, as well as growing substance abuse and unhealthy diets.\n\nWhile climate change-induced droughts have left many rural people in Zimbabwe scrounging for food, traders in urban areas are racing to get a piece of the fast food market thats widely blamed for obesity.\n\nIn Harare and other urban areas, franchises such as KFC compete with a mushrooming number of cheaper local restaurants and informal roadside stalls, public markets and even homes where one can grab a fried piece of chicken, a burger or a fries-and-sausage combo for a dollar.\n\nIn response, Finance Minister Mthuli Ncube in the 2025 national budget imposed a modest 0.5% tax on sales of doughnuts and other foods including tacos, pizza, hot dogs, shawarma, fries, chicken and burgers by retailers to encourage healthier dietary choices and mitigate the prevalence of non-communicable diseases.\n\nMeanwhile, some older Zimbabweans are taking up physical exercise.\n\nFor Mutandwa and her Commandos Fitness Club crew, the surroundings of the cemetery suffice. Coached by Joseph Nekati, whose mothers stroke in 2023 inspired him to help others, the free club has become a sanctuary for older fitness buffs. Eight of the clubs roughly 20 members are older people, Nekati said.\n\nI weighed 86 kilograms (189 pounds) and struggled to stand up. I would struggle to breathe just walking in my house. Now, Im down to 76 kilograms (167 pounds) and I can walk long distances, said Susan Gomo, a 64-year-old grandmother managing high blood pressure and arthritis.\n\nThe group exercise is also meant to encourage other older people to work out. Some of my age mates are reluctant, Gomo said. They end up just eating and sitting at home. They might change their minds when they see me in great shape.\n\nMutandwa said she picked up the habit of power walks when she visited her daughter in the United Kingdom in 2022. She decided to try it back home in Zimbabwe, but the roads in her township were potholed and crowded. She went for solo walks on a nearby hill, but she felt unsafe.\n\nLast year, she noticed the fitness club in the cemetery, where a wide and well-maintained path provides a convenient workout spot. With three of her neighbors, she approached the coach, who happily took them in.\n\nNow the cemetery has come to symbolize Mutandwa and others quest to live healthier and outpace death  one step at a time.\n\nIts serene, its safe and we have a lot of space with minimal disturbances. Hopefully the (local) council can build proper facilities for us, she said, preparing to stroll back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10065303/VOA.jpg",
            "description": "<p>By VOA HARARE — At dawn, 65-year-old Nelly Mutandwa swapped her pajamas for leggings, a T-shirt and sneakers. She grabbed a bottle of water before heading to an unconventional workout spot: a cemetery in Zimbabwe’s capital, Harare. Surrounded by rows of graves, she joined other members of the Commandos Fitness Club in an hour-long session</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-fitness-club-in-zimbabwe-cemetery-aims-to-outpace-death-one-step-at-a-time/\">A fitness club in Zimbabwe cemetery aims to outpace death one step at a time</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "11 Feb 2025"
        }
    ]
}