{
    "news": [
        {
            "title": "COP15 opens in Zimbabwe with call for global efforts in wetland preservation",
            "url": "https://www.newzimbabwe.com/cop15-opens-in-zimbabwe-with-call-for-global-efforts-in-wetland-preservation/",
            "content": "Xinhua\n\nThe 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) opened on Thursday in Zimbabwes resort city of Victoria Falls, with a call for international cooperation in the global wetland preservation.\n\nRunning under the theme of Protecting Wetlands for Our Common Future, the COP15 brought together its contracting parties to strengthen international commitments for wetland conservation and to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.\n\nAddressing the opening ceremony, Musonda Mumba, secretary general of the Convention on Wetlands, said global efforts are crucial in safeguarding wetlands, as they play a vital role in the health of the ecosystem.\n\nShe noted that through global efforts, the convention offers a platform for collaboration and for science-based action. Across the world and even here in Africa, the change has been seen. Countries are working very hard.\n\nMumba urged policymakers and responsible stakeholders to make decisions and adopt policies that prioritize wetland protection.\n\nLet us make this moment where political leadership meets practical action, when commitments become implementation, and where wetlands are finally recognized as the backbone of sustainability, she added.\n\nYan Zhen, deputy head of Chinas National Forestry and Grassland Administration, noted that in recent years, China has continuously improved its legal and institutional framework for wetland conservation, comprehensively protected wetland ecosystems, and actively engaged in international cooperation, continuously contributing to global wetland protection efforts.\n\nThe Chinese delegation said they will engage in open dialogue to share experiences and build consensus with all contracting parties to help produce meaningful and impactful outcomes from the conference.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>Xinhua The 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) opened on Thursday in Zimbabwe’s resort city of Victoria Falls, with a call for international cooperation in the global wetland preservation. Running under the theme of “Protecting Wetlands for Our Common Future,” the COP15 brought together its</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop15-opens-in-zimbabwe-with-call-for-global-efforts-in-wetland-preservation/\">COP15 opens in Zimbabwe with call for global efforts in wetland preservation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "25 Jul 2025"
        },
        {
            "title": "Journalist Edmund Kudzayi seeks reversal of US$100,000 defamation award to Mahere",
            "url": "https://www.newzimbabwe.com/journalist-edmund-kudzayi-seeks-reversal-of-us100000-defamation-award-to-mahere/",
            "content": "By Mary Taruvinga\n\nJournalist Edmund Kudzayi has formally requested the High Court to rescind a default judgment that awarded US$100,000 in damages to top lawyer Fadzayi Mahere in a defamation case.\n\nThe case stemmed from allegations by the Kukurigo owner that Mahere was dating a married businessman, Tinashe Murapata which had caused the collapse of his marriage.\n\nKudzayi argues that the judgment was issued without proper legal procedure, and he claims a bona fide defense against the allegations made by Mahere.\n\nKudzayi, through his legal representatives at Gunje Legal Practice in Harare, stated that he was neither in wilful default nor was he given adequate opportunity to present his defense.\n\nThe default judgment, which was granted on July 10, 2025, arose from a civil claim filed by Mahere in case number HC3060/22.\n\nThe crux of Kudzayis argument rests on a series of procedural irregularities.\n\nHe said the case had previously been struck off the court roll due to Maheres failure to prosecute, alleging further that her claims regarding the status of the case were misrepresented to the court.\n\nAt all material times, I have been participating in the matter, filing all papers on time, demonstrating my desire to have my defense ventilated and vindicated in open court, Kudzayi stated.\n\nKudzayi also contends that he was obstructed from attending a crucial hearing due to security restrictions at the High Court, an incident he claims was acknowledged by both Mahere and her legal representatives.\n\nIt is his argument that this obstruction led to his defense being struck off without his knowledge or the proper legal foundation.\n\nMy defence was struck out and the matter placed on the unopposed my knowledge, apparently without a formal application (I certainly one on the consolidated record) after a hearing on 24 March 2025 before Hon Justice Wamambo, a hearing I was obstructed from attending by High Court security even though I was in the High Court building.\n\nThe fact that I was obstructed from attending the hearing by security at the High Court is known to the Court and the Defendant and her legal practitioners who, as officers of the Court, would have known that I was not in wilful default and should not have chosen to snatch at a judgment but sought to have the matter heard on the merits.\n\nEven if the judgment is rescinded and the matter is set back to where it was, I have reasonable grounds for success in the main action, he said.\n\nIn his application, Kudzayi also said that Maheres claims are not only unfounded but also benefit from an exaggerated damages award.\n\nHe draws attention to previous defamation judgments in Zimbabwe, noting that the US$100,000 award is unprecedented and significantly higher than any earlier awards, including Maheres own cases, where damages did not exceed US$18,000.\n\nHe said, Fraud vitiates everything, highlighting what he describes as misleading representations made by Mahere during the reinstatement process.\n\nEven if I am found to have been in wilful default or go on to lose the main action, this judgment must still be rescinded on the basis that it was erroneously granted as no court in Zimbabwe would award the quantum of damages awarded to the respondent as it is so extraordinary as to constitute a manifest injustice, he said.\n\nThe defamation claim itself revolves around Kudzayis allegations of Maheres extramarital affair, which he argues serves the public interest.\n\nHis legal team insists that Mahere cannot substantiate her claims without proper cross-examination and that the judgments value is disproportionate to the alleged damages.\n\nKudzayis application for rescission also focuses on the implications of allowing the judgment to stand.\n\nHe argues that the case has spiralled into a deliberate and calculated deception, undermining the integrity of the judicial process.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/28044431/Fadzai-Mahere-1.png",
            "description": "<p>By Mary Taruvinga Journalist Edmund Kudzayi has formally requested the High Court to rescind a default judgment that awarded US$100,000 in damages to top lawyer Fadzayi Mahere in a defamation case. The case stemmed from allegations by the Kukurigo owner that Mahere was dating a married businessman, Tinashe Murapata which had caused the collapse of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-edmund-kudzayi-seeks-reversal-of-us100000-defamation-award-to-mahere/\">Journalist Edmund Kudzayi seeks reversal of US$100,000 defamation award to Mahere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "25 Jul 2025"
        },
        {
            "title": "Central Bank’s Financial Intelligence Unit officials arrested over US$2,500 extortion",
            "url": "https://www.newzimbabwe.com/central-banks-financial-intelligence-unit-officials-arrested-over-us2500-extortion/",
            "content": "By Staff Reporter\n\nTwo officials from the Reserve Bank of Zimbabwes Financial Intelligence Unit (FIU) have been arrested on allegations of extorting US$2,500 from a Bulawayo businessman, promising to facilitate the unfreezing of his bank accounts.\n\nThe two are Tonderai Makoni and Wisdom Mutami.\n\nAccording to the Zimbabwe Anti-Corruption Commission (ZACC), which arrested the two, their alleged accomplice, Clemence Nyamima, is still at large.\n\nThe two accused persons, acting in common purpose with a third accomplice, Clemence Nyamima (still at large), allegedly demanded money from a Bulawayo-based businessman whose accounts are frozen by the FIU, claiming Makoni will facilitate the unfreezing.\n\nIt is alleged that in May 2025, Mutami approached a businessman whose accounts are frozen by FIU, claiming he can facilitate the unfreezing of accounts by his relative, Makoni, ZACC said in a statement.\n\nIt is alleged that Mutami demanded US$3,000, which was later negotiated down to US$2,500.\n\nThe complainant made an initial payment of US$520 to Nyamimas mobile wallet, on Makonis instructions.\n\nThe balance of US$2,000 was later handed over in cash.\n\nDespite these payments, the complainants accounts remained frozen, and the accused persons became evasive, prompting the complainant to lodge a report with ZACC.\n\nMutami was arrested in Bulawayo on 23 July 2025 while Makoni was arrested in Harare.\n\nThe two are due to appear in court for initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>By Staff Reporter Two officials from the Reserve Bank of Zimbabwe’s Financial Intelligence Unit (FIU) have been arrested on allegations of extorting US$2,500 from a Bulawayo businessman, promising to facilitate the unfreezing of his bank accounts. The two are Tonderai Makoni and Wisdom Mutami. According to the Zimbabwe Anti-Corruption Commission (ZACC), which arrested the two,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/central-banks-financial-intelligence-unit-officials-arrested-over-us2500-extortion/\">Central Bank’s Financial Intelligence Unit officials arrested over US$2,500 extortion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "25 Jul 2025"
        },
        {
            "title": "Mineral wealth must benefit all Zimbabweans, not just a few – Mnangagwa",
            "url": "https://www.newzimbabwe.com/mineral-wealth-must-benefit-all-zimbabweans-not-just-a-few-mnangagwa/",
            "content": "By Anna Chibamu\n\nDeputy Finance Minister David Mnangagwa has said the Mines and Minerals Amendment Bill represents a bold step toward equitable economic reform, insisting Zimbabwes vast mineral wealth must uplift all citizens, not only a privileged minority.\n\nSpeaking Wednesday at a meeting with Zanu PF youths, government, and party officials at the partys headquarters, Mnangagwa said the long-awaited Bill offers a blueprint for a more inclusive and transparent mining sector.\n\nAmong the attendees were Youth Minister Tino Machakaire and Zanu PF National Political Commissar Munyaradzi Machacha. The gathering deliberated on the far-reaching provisions of the Bill.\n\nFrom the Ministry of Finances perspective, this Bill presents an opportunity not only to modernise the countrys mining governance framework, but also to lay the foundation for a more inclusive, transparent, and fiscally sustainable mining economy, Mnangagwa said.\n\nHe added that the ministry was particularly encouraged by the deliberate and progressive fiscal support mechanisms embedded in the Bill,provisions he said would attract new investment, improve compliance, and ensure Zimbabweans benefit fully from their mineral resources.\n\nZimbabwes mining sector, according to Mnangagwa, contributes over 60% of export earnings and nearly 13% of the national GDP. It directly and indirectly employs hundreds of thousands and is a key pillar in the countrys drive toward attaining Vision 2030.\n\nHowever, he lamented that outdated regulations, opaque licensing systems, and weak institutional coordination had long stifled growth in the sector.\n\nThe Mines and Minerals Amendment Bill responds directly to these challenges by introducing a robust and transparent framework that enables better fiscal planning, incentivises investment, and enhances accountability in the exploitation of mineral resources, he said.\n\nThe meeting also featured open dialogue with youths, who raised concerns over limited access to information and markets.\n\nRobert Togarepi, a youth from Gutu, highlighted the lack of resources available to young people seeking to participate in the mining sector. Meanwhile, Kumbirai Maunganidze from Harare expressed frustration over the absence of domestic markets for semi-precious stones.\n\nWe have vast amounts of semi-precious minerals, but theres no market for them in Zimbabwe. How can we be assisted to market these special stones, other than just gold? Maunganidze asked.\n\nIn response, Mnangagwa reaffirmed the ministrys commitment to implementing the fiscal tools in the Bill with diligence, integrity, and accountability.\n\nWe believe the Bill strikes the right balance between encouraging investment and ensuring that the State and citizens receive their fair share of the value extracted from our natural resources, he said.\n\nNotably, the Bill promotes local value addition by offering a full rebate on royalties for minerals used entirely within Zimbabwe. It also mandates the publication of mining contracts and revenue data, a move aligned with global best practices under the Extractive Industries Transparency Initiative (EITI).\n\nMnangagwa stressed that legislation alone is insufficient. He said the government was also rolling out complementary policy and institutional reforms, including the deployment of digital systems to enable real-time monitoring of mineral production and revenue flows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171542/david-mnangagwa-2.jpg",
            "description": "<p>By Anna Chibamu Deputy Finance Minister David Mnangagwa has said the Mines and Minerals Amendment Bill represents a bold step toward equitable economic reform, insisting Zimbabwe’s vast mineral wealth must uplift all citizens, not only a privileged minority. Speaking Wednesday at a meeting with Zanu PF youths, government, and party officials at the party’s headquarters,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mineral-wealth-must-benefit-all-zimbabweans-not-just-a-few-mnangagwa/\">Mineral wealth must benefit all Zimbabweans, not just a few – Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "25 Jul 2025"
        },
        {
            "title": "New Zealand crushes Zimbabwe by 60 runs to keep perfect record at T20 tri-series",
            "url": "https://www.newzimbabwe.com/new-zealand-crushes-zimbabwe-by-60-runs-to-keep-perfect-record-at-t20-tri-series/",
            "content": "AP\n\nNew Zealand stayed perfect at the T20 tri-series with a crushing 60-run win over host Zimbabwe on Thursday.\n\nTim Seifert (75) smashed his second successive half century and Rachin Ravindra made an entertaining 63 runs off 39 balls as New Zealand posted the tournaments highest total of 190-6 with its fourth straight win of the league stage.\n\nNew Zealand and South Africa had already secured their places in Saturdays final.\n\nLeg-spinner Ish Sodhi, one of four changes for New Zealand, grabbed a career-best 4-12 in four overs as Zimbabwe was dismissed for 130 in 18.5 overs.\n\nZimbabwe lost all four games.\n\nMitchell Santner became the first captain in the tournament to choose to bat first on a tricky wicket after winning the toss.\n\nTim Robinson (10) couldnt capitalize on Ryan Burls dropped catch in the slips before he had scored and was out to Zimbabwes best bowler, Richard Ngarava (4-34).\n\nZimbabwe was scrappy in the field when Seifert got a lucky escape on 13 as Tony Munyonga missed a catching opportunity at deep backward square leg.\n\nTogether with Ravindra, Seifert raised 108 runs for the second wicket before Zimbabwe hit back.\n\nFast bowler Tinotenda Maposa had both Ravindra and Mark Chapman caught in the outfield in the space of three balls and Ngarava chipped in with three wickets in his return spell.\n\nSeifert feathered a catch to wicketkeeper Clive Madande after Ngarava outfoxed him with a slower ball while Bevon Jacobs was spectacularly caught by Munyonga at backward point.\n\nMichael Bracewell made a 16-ball 26 and Trevor Gwandu (0-51) went for 21 runs off his final over.\n\nDifferent guys stepping up at different times is a good thing, although it can be a selection headache at times, Santner said. We know we have a massive game in a couple of days time.\n\nZimbabwe opener Dion Myers (22) smashed four boundaries in a brisk start before Sodhi struck three times inside the batting powerplay and the hosts were reduced to 37-4.\n\nSodhi clean bowled Myers and Madande after Brian Bennett was caught when he failed to clear Jacobs at extra cover as he tried to show early aggression against the leg-spinner.\n\nOff-spinner Bracewell made it 44-5 when he took a well judged caught-and-bowled off Burls miscued hit before Munyonga (40 in 30) and Tashinga Musekiwa (21) resisted with a 51-run partnership.\n\nSodhi returned in the 14th over and picked up his 150th T20 wicket when Munyonga holed out at long-off.\n\nNew Zealands pace then finished off the tail in quick succession with Matt Henry taking 2-34.\n\nWe keep digging ourselves a hole and when we try to climb out of it, we dont, Zimbabwe captain Sikandar Raza said.\n\nThe catches we dropped hurt us. As much as we wanted to be upbeat, it took us a bit of time to get into the game. One of the things I will speak (to players) is that it is never a dead rubber for Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24174619/New-Zealand-beat-Zimbabwe-by-60-runs-2025-07-bc44d44ba5b5c501fb174f5db6ea2d06-16x9-1.webp",
            "description": "<p>AP New Zealand stayed perfect at the T20 tri-series with a crushing 60-run win over host Zimbabwe on Thursday. Tim Seifert (75) smashed his second successive half century and Rachin Ravindra made an entertaining 63 runs off 39 balls as New Zealand posted the tournament’s highest total of 190-6 with its fourth straight win of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-zealand-crushes-zimbabwe-by-60-runs-to-keep-perfect-record-at-t20-tri-series/\">New Zealand crushes Zimbabwe by 60 runs to keep perfect record at T20 tri-series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "25 Jul 2025"
        },
        {
            "title": "Hulk Hogan dies aged 71",
            "url": "https://www.newzimbabwe.com/hulk-hogan-dies-aged-71/",
            "content": "Sky News\n\nHulk Hogan, the legendary WWE wrestler and actor has died aged 71.\n\nPolice have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest before he died later in hospital.\n\nHogan, whose real name is Terry Bollea, is perhaps the most iconic star in WWEs five-decade history  known for his distinctive blonde moustache and colourful headbands.\n\nHis charisma and theatrics in the ring are credited with helping to transform professional wrestling into a family entertainment sport.\n\nHogan was the main draw for the first-ever WrestleMania in 1985 and was a fixture for years in its signature event, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon.\n\nHe won six WWE championships and was inducted into the WWE Hall of Fame in 2005 by Sylvester Stallone.\n\nWWE said a post this evening: WWE is saddened to learn WWE Hall of Famer Hulk Hogan has passed away. One of pop cultures most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s. WWE extends its condolences to Hogans family, friends, and fans.\n\nHogan was also able to transcend his Hulkamania fan base to become a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, Hogan Knows Best.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24173634/hulk-hogan.jpg",
            "description": "<p>Sky News Hulk Hogan, the legendary WWE wrestler and actor has died aged 71. Police have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest before he died later in hospital. Hogan, whose real name is Terry Bollea, is perhaps the most iconic star in WWE’s five-decade history –</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hulk-hogan-dies-aged-71/\">Hulk Hogan dies aged 71</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "25 Jul 2025"
        }
    ]
}