{
    "news": [
        {
            "title": "UK Prime Minister Keir Starmer accused of ‘behaving like Robert Mugabe’ after considering delaying elections",
            "url": "https://www.newzimbabwe.com/uk-prime-minister-keir-starmer-accused-of-behaving-like-robert-mugabe-after-considering-delaying-elections/",
            "content": "ExpressUK\n\nReform UK leader Nigel Faragehas accused Prime Minister Sir Keir Starmer of behaving like Robert Mugabe amid further claims that the Government is considering postponing local elections scheduled for the Spring.\n\nMugabe, who served as President of Zimbabwe for 30 years, became notorious for putting off democratic elections. He was eventually ousted in 2017 in what was widely regarded as a coup detat.\n\nReports last week suggested that the Labour government, led by Prime Minister SirKeir Starmer, is considering the controversial move as part of a shake-up of local government.\n\nAnd a recent report inThe TimessuggestedEssexCounty Council elections, as well as those in the unitary boroughs of Southend-on-Sea and Thurrock, were almost certain to be postponed.\n\nA leaked Thurrock Council report says that as a consequence of participation in the Government Devolution Priority Programme the Leader and Chief Executive approve a letter to the Secretary of State asking to postpone local elections to be held on May 1, 2025.\n\nThe GB News host, whose own seat, Clacton, is likewise in Essex, wasted little time making his feelings plain as he shared the news on X.\n\nHe commented: This is outrageous.Keir Starmeris behaving like Robert Mugabe.\n\nThe reforms, aimed at restructuring councils and enhancing devolution across England, are being spearheaded by Deputy Prime MinisterAngela Rayner.\n\nWe use your sign-up to provide content in ways youve consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time.\n\nThey involve merging or disbanding existing councils to create more streamlined and efficient local governance structures.\n\nLocal Government Minister Jim McMahon has acknowledged that elections in areas undergoing reorganisation might be deferred.\n\nHe explained that if a council is set to be restructured and will not exist in its current form for the full term following the elections, it is customary to postpone the elections and instead elect a shadow body to oversee the transition.\n\nSuch an approach aims to prevent electing representatives to councils that are on the verge of significant structural changes.\n\nThe Government has not yet provided a definitive list of councils that will be affected by the postponements.\n\nThe situation remains fluid, with further details expected to emerge as the government continues to outline its devolution agenda and local government restructuring plans.\n\nStakeholders and the public await more comprehensive information to understand the full implications of these proposed changes on local democracy.\n\nA Ministry of Housing, Communities and Local Government spokesperson said: No decisions have been taken to postpone elections in specific areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/15084443/Robert-Mugabe-1.jpg",
            "description": "<p>ExpressUK Reform UK leader Nigel Farage has accused Prime Minister Sir Keir Starmer of “behaving like Robert Mugabe” amid further claims that the Government is considering postponing local elections scheduled for the Spring. Mugabe, who served as President of Zimbabwe for 30 years, became notorious for putting off democratic elections. He was eventually ousted in 2017</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-prime-minister-keir-starmer-accused-of-behaving-like-robert-mugabe-after-considering-delaying-elections/\">UK Prime Minister Keir Starmer accused of ‘behaving like Robert Mugabe’ after considering delaying elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "At least 120 killed in South Korea as plane crashes on landing at Muan airport",
            "url": "https://www.newzimbabwe.com/at-least-120-killed-in-south-korea-as-plane-crashes-on-landing-at-muan-airport/",
            "content": "Al Jazeera\n\nAt least 120 people have been killed when a passenger plane caught fire after skidding off a runway and crashing at an airport in South Koreas Muan city, the countrys National Fire Agency said.\n\nThe accident occurred on Sunday at 9.03am local time (00:03 GMT) as the Jeju Air flight, carrying 175 passengers and six crew from the Thai capital Bangkok, landed at Muan International Airport located about 289km (179 miles) southwest of the capital Seoul.\n\nThe National Fire Agency confirmed that 120 people have been killed, and two people have been rescued  both crew members. The fire that engulfed the plane has been extinguished, the agency said.\n\nCiting fire agency officials, South Koreas Yonhap news agency said that hopes are fading for survivors.\n\nThere seems to have been some kind of malfunction with the landing gear and images which have been on the media here do appear to show the plane landing on its belly, skidding along the runway, followed then by a huge explosion, Al Jazeeras Rob McBride, reporting from Seoul, said.\n\nEyewitness accounts have talked then about a series of explosions and certainly images that we have been seeing have shown a catastrophic fire, he said.\n\nThe plane, a 15-year-old Boeing 737-800 jet, was reported to be carrying two Thai passengers and the rest were believed to be South Koreans.\n\nThailands Prime Minister Paetongtarn Shinawatra has expressed deep condolences to the families of the crash victims.\n\nThailands Ministry of Foreign Affairs has been ordered to investigate if Thai passengers were on the plane and to provide assistance immediately, the prime minister said in a post on social media.\n\nOne photo shared by local media showed thick clouds of black smoke coming out of the plane. Another showed the tail section of the jet engulfed in flames on what appeared to be the side of the runway, with firefighters and emergency vehicles nearby.\n\nThe Yonhap news agency reports that the crash is believed to have been caused by contact with birds, resulting in malfunctioning landing gear as the plane attempted to land at the airport.\n\nThe countrys News1 agency reported that a passenger texted a relative to say a bird was stuck in the wing. The persons final message was, Should I say my last words?\n\nAn official from South Koreas Transport Ministrys aviation department said a bird strike was among several theories for the accident that have not been verified and that an investigation was ongoing.\n\nSouth Koreas Acting President Choi Sang-mok, meanwhile, ordered all-out efforts for rescue operations at Muan airport.\n\nAll related agencies must mobilise all available resources to save the personnel, he told officials in a statement.\n\nJeju Air, one of South Koreas largest low-cost carriers, which was set up in 2005, issued an apology for the crash, saying it would do everything in our power in response to this accident.\n\nThe crash is the first fatal accident for Jeju Air, though in August 2007, a Bombardier Q400 operated by the airline and carrying 74 passengers came off the runway due to strong winds at the southern Busan-Gimhae airport, resulting in a dozen injuries.\n\nExperts say that South Koreas aviation industry has a solid track record for safety.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29061022/241229-jeju-air-crash-cc-1214a-f75953.webp",
            "description": "<p>Al Jazeera At least 120 people have been killed when a passenger plane caught fire after skidding off a runway and crashing at an airport in South Korea’s Muan city, the country’s National Fire Agency said. The accident occurred on Sunday at 9.03am local time (00:03 GMT) as the Jeju Air flight, carrying 175 passengers</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/at-least-120-killed-in-south-korea-as-plane-crashes-on-landing-at-muan-airport/\">At least 120 killed in South Korea as plane crashes on landing at Muan airport</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "WATCH | Angry festival attendees burn down stage after Makhadzi’s no-show",
            "url": "https://www.newzimbabwe.com/watch-angry-festival-attendees-burn-down-stage-after-makhadzis-no-show/",
            "content": "TshisaLive\n\nMakhadzi has responded to the controversy surrounding her absence from the Kwaslondon Fun, Games & Musical Festival.\n\nThe event, which took place on the Day of Goodwill, descended into chaos when Makhadzi failed to appear on stage, allegedly prompting fans to react violently which resulted in equipment and the stage being burnt down.\n\nAccording to a statement released by Makhadzis team, the musician was booked to perform at the festival, but the promoter, Ismael, failed to meet the payment terms outlined in the contract.\n\nThe contract specified that a 50% deposit was required before any promotional activities on social media, and the full payment was due 14 days before the event.\n\nMakhadzis team stated that while a deposit was received, along with an additional R3,000 for a promotional video, the balance was not paid within the specified time frame. As a result, Makhadzi and her team were not informed of the event and she did not appear on stage.\n\nWe sincerely apologise to our dedicated fans in Matwasa, read the statement.\n\nWe did not receive the balance within the 14-day period and, as per the terms outlined in the contract, we were not obligated to perform.\n\nThe controversy surrounding Makhadzis no-show has many tongues wagging, with some fans taking to social media to express their disappointment and frustration.\n\nHowever, others have come out in support of the musician, citing the importance of honouring contractual agreements and respecting the value of artists work.\n\nWATCH THE VIDEOS BELOW:\n\nThis is a developing story.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/29122914/Makhadzi-1.png",
            "description": "<p>TshisaLive Makhadzi has responded to the controversy surrounding her absence from the Kwaslondon Fun, Games & Musical Festival. The event, which took place on the Day of Goodwill, descended into chaos when Makhadzi failed to appear on stage, allegedly prompting fans to react violently which resulted in equipment and the stage being burnt down. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/watch-angry-festival-attendees-burn-down-stage-after-makhadzis-no-show/\">WATCH | Angry festival attendees burn down stage after Makhadzi’s no-show</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "SABC employee in hot water after allegedly making racist remarks and disrupting flight",
            "url": "https://www.newzimbabwe.com/sabc-employee-in-hot-water-after-allegedly-making-racist-remarks-and-disrupting-flight/",
            "content": "TimesLive\n\nAn SABC employees festive season has turned sour after she allegedly made racist remarks and disrupted a FlySafair flight.\n\nIn several videos that have gone viral on social media, the woman is seen in a heated altercation with flight attendants who are trying to calm her down.\n\nIn one of the widely circulated videos, she is heard allegedly making racially-sensitive remarks against the coloured community.\n\nYoure a coloured from Mitchells Plain, all these gold rings but no degree. Right now when we land, Im going to take an Uber home. You dont even have a [drivers] licence. You dont even have a car.\n\nThe SABC released a statement on Saturday acknowledging the woman was an employee and condemning her actions.\n\nThe South African Broadcasting Corporation has noted with concern audiovisual material circulating on various social media platforms featuring a staff member travelling on a South African airline.\n\nThe woman also allegedly threatened to get the airline employees fired and the incident broadcast on SABC news channels.\n\nThe SABC distanced itself from her remarks, as it could compromise the organisations editorial integrity.\n\nIn the video clip, this staff member mentions the SABC and states that this incident will be broadcast on SABC News. We would like to reiterate that SABC News is guided by the editorial code and maintains its editorial independence, and the decisions pertaining to all news items are made in the newsroom and not influenced by non-editorial staff members.\n\nThe public broadcaster said it was looking to use the relevant channels in line with its internal procedures to engage the staff member.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29060005/sabc.jpg",
            "description": "<p>TimesLive An SABC employee’s festive season has turned sour after she allegedly made racist remarks and disrupted a FlySafair flight. In several videos that have gone viral on social media, the woman is seen in a heated altercation with flight attendants who are trying to calm her down. In one of the widely circulated videos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sabc-employee-in-hot-water-after-allegedly-making-racist-remarks-and-disrupting-flight/\">SABC employee in hot water after allegedly making racist remarks and disrupting flight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "Cooperation with China boosts Zimbabwe’s agriculture sector",
            "url": "https://www.newzimbabwe.com/cooperation-with-china-boosts-zimbabwes-agriculture-sector/",
            "content": "Xinhua\n\nThe year 2024 has witnessed significant milestones in China-Zimbabwe cooperation in the agriculture sector, a cornerstone of Zimbabwes economy.\n\nTrade between the two sides increased, while Chinas support for Zimbabwes technical expertise and human resources development in the agriculture sector also expanded.\n\nAccording to the Zimbabwe Investment and Development Agency, a national investment promotion body, the agriculture sector sustains more than 60 percent of Zimbabwes population, provides 63 percent of raw materials for the manufacturing sector, generates 30 percent of export earnings, and contributes 15 percent to gross domestic product.\n\nIn a bid to further open Chinas market to Zimbabwean agricultural products, a trade protocol on the export of Zimbabwean avocados was inked during Zimbabwean President Emmerson Mnangagwas state visit to China in September, ahead of the 2024 Summit of the Forum on China-Africa Cooperation.\n\nRodwell Choto, an avocado farmer from Bindura, Mashonaland Central Province, is among those preparing to meet the expected surge in demand from China.\n\nExports to China will give us foreign currency, our economy will grow, and our livelihoods will improve, Choto told Xinhua in a recent interview, noting that avocado farmers are ramping up production.\n\nAccording to the Horticultural Development Council, an organization representing horticultural exporters in Zimbabwe, the Southeast African country is projected to produce a record 6,000 metric tons of avocados in 2024, with its avocado industry set to expand the growing area from the current 1,500 hectares to 4,000 hectares by 2030.\n\nThis builds on earlier successes, including a 2022 trade agreement enabling the export of fresh citrus to China, which saw its first shipment in 2023.\n\nThis is a chance for African agriculture now to become part of the global food value chain, said Christopher Mutsvangwa, politburo member and secretary for information and publicity at the ruling Zimbabwe African National Union-Patriotic Front (ZANU PF) party.\n\nZimbabwes tobacco sub-sector has also flourished in 2024, bolstered by Chinas market access.\n\nTobacco, an important economic activity and a major foreign currency earner for Zimbabwe, Africas largest tobacco producer, saw exports to China rise 38.3 percent to 790 million U.S. dollars in the first nine months of 2024, accounting for 40.6 percent of Zimbabwes total exports to China, according to data released by the Chinese Embassy in Zimbabwe.\n\nThe overall trade figures between Zimbabwe and China grew 25.6 percent to 3 billion dollars in the same period, the Chinese embassy added.\n\nDespite these significant milestones this year, a severe drought has caused crop failures and livestock losses, greatly undermining the agriculture sector. In response, China launched a project to drill 300 boreholes in four provinces of the country.\n\nThese boreholes will not only provide safe water to the affected community, but will also serve as a stepping stone towards resilience building in view of the current El Nino-induced drought, and will also save the lives of our livestock which is also in dire need of water, said Zimbabwes Minister of National Housing and Social Amenities Daniel Garwe.\n\nChinas support extends beyond infrastructure to human resource development. Collaborative efforts have focused on capacity building and technical assistance to enhance agricultural productivity.\n\nAs part of this initiative, Zimbabwean officials and professionals have attended seminars and workshops in China, equipping them with skills to modernize agriculture.\n\nJotamu Dondofema, director of agricultural education in the Ministry of Lands, Agriculture, Fisheries, Water, and Rural Development, is among the officials who attended a seminar on the construction of green, low carbon, and circular economic systems in China this year.\n\nThis program has already yielded significant benefits. We have witnessed large numbers of successfully trained personnel, improved technologies in the agricultural value chains, the establishment of renewable energy sources and systems, and information and technology-sharing platforms anchoring capacity-building initiatives. These efforts have enhanced the employability and competitiveness of Zimbabwean professionals while also promoting the adoption of green technologies and sustainable practices, Dondofema said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/29055712/Nyaguse.jpeg",
            "description": "<p>Xinhua The year 2024 has witnessed significant milestones in China-Zimbabwe cooperation in the agriculture sector, a cornerstone of Zimbabwe’s economy. Trade between the two sides increased, while China’s support for Zimbabwe’s technical expertise and human resources development in the agriculture sector also expanded. According to the Zimbabwe Investment and Development Agency, a national investment promotion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cooperation-with-china-boosts-zimbabwes-agriculture-sector/\">Cooperation with China boosts Zimbabwe’s agriculture sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "If it ends in marriage, good for them – Sonja reacts to ex-husband Chivayo flaunting new bae",
            "url": "https://www.newzimbabwe.com/if-it-ends-in-marriage-good-for-them-sonja-reacts-to-ex-husband-chivayo-flaunting-new-bae/",
            "content": "By Staff Reporter\n\nCONTROVERSIAL businessman Wicknell Chivayos ex-wife Sonja Madzikanda has said she was once close to his new girlfriend Lulu, whom she described as absolutely beautiful. She added that it would be good for the new couple if it ends in marriage.\n\nThis comes after Chivayo flaunted Lulu Muteke on social media, sharing photos of their vacation in Victoria Falls.\n\nHe further revealed plans to pay a US$100k bride price for her.\n\nSonja addressed her Instagram followers after photos of Chivayo and Lulu went viral online.\n\nIf he has moved on and has found love and wants to be a better guy for this chic, then to be honest with you, we should all clap hands and say well done.\n\nI am happy that he launched this because now anything to do with him in 2025 has nothing to do with me.\n\nI think that Lulu girl is absolutely beautiful, I used to bake scones for her. I am sure her and Wicknell will make a lovely couple and if it ends in marriage good for them, shesaid.\n\nChivayo and Sonja divorced after seven years of marriage.\n\nThe couple tied the knot in an intimate ceremony in 2017 and a bride price of US$50k was reportedly paid.\n\nTheir marriage hadbeen nothing short of drama with messy fights splilling ontosocial media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/28152708/lulu-chivayo.jpg",
            "description": "<p>By Staff Reporter CONTROVERSIAL businessman Wicknell Chivayo’s ex-wife Sonja Madzikanda has said she was once close to his new girlfriend Lulu, whom she described as “absolutely beautiful.” She added that it would be good for the new couple “if it ends in marriage.” This comes after Chivayo flaunted Lulu Muteke on social media, sharing photos</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/if-it-ends-in-marriage-good-for-them-sonja-reacts-to-ex-husband-chivayo-flaunting-new-bae/\">If it ends in marriage, good for them – Sonja reacts to ex-husband Chivayo flaunting new bae</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "47 murdered in one week – police",
            "url": "https://www.newzimbabwe.com/47-murdered-in-one-week-police/",
            "content": "By Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Thandiwe Garusa AT LEAST 47 people were murdered across Zimbabwe between December 20 and 26, police have said. In a statement on Friday, police spokesperson Commissioner Paul Nyathi expressed concern over the murder cases and urged the public to resolve disputes without resorting to violence. “47 cases of murder have been received during the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/47-murdered-in-one-week-police/\">47 murdered in one week – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "WestProp offers lucrative brick discount",
            "url": "https://www.newzimbabwe.com/westprop-offers-lucrative-brick-discount/",
            "content": "By Business Reporter\n\nLISTED property firm, WestProp Holdings is offering its residential property customers at Pomona City the opportunity of a lifetime to pay 50 percent deposit for their brick requirements and enjoy a two-year instalment payment.\n\nThe company is setting up a US$1 million brick moulding company to assist the realisation of the one billion bricks vision by 2050 and to speed development after encountering delays in brick delivery and at times below standard bricks.\n\nOf all its development projects so far  only customers at Pomona City are building their own homes while at other developments the company is offering complete turn-key products.\n\nOnly 29 residential stands remain at Pomona phases 1B & C and 1A out of the initial 765 ahead of the introduction of the exciting leasehold concept next year.\n\nThe brick factory is designed to supply bricks to WestProp projects and with growth the company will then be able to supply excess bricks to outside customers.\n\nWestProp Holdings CEO Ken Sharpe says the new venture is in response to market delays in delivering bricks to the companys construction sites and a quest to manage brick quality.\n\nAs of March, next year, we start production. Those bricks are pre-sold. They are going to our customers. Our customers will pay a 50 percent deposit and pay the balance in instalments over two years, he said.\n\nThe initiative is meant to incentivise the customers to build and not be burdened by paying lump sums towards the bricks and then failing to buy other building materials.\n\nThe purchase price of $0.14 a brick will include transportation costs to the building site.\n\nSpeaking at a Christmas and excellence recognition awards ceremony for WestProp employees, Sharpe stressed the concept of urgency in service delivery to meet customer expectations.\n\nHe rallied the employees to embrace the one billion brick vision adding that their hands would be imprinted on the achievements of the vision.\n\nWhatever we do with the billion bricks stands forever. For the test of time, he said.\n\nSharpe reiterated his love for Zimbabwe noting that he formed the company to make a difference and provide livelihoods to thousands of people whose value chain depends on WestProp.\n\nI set up this business to be a public company. Not to enrich myself. I have enough money. I set it up so that you can benefit from it, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Business Reporter LISTED property firm, WestProp Holdings is offering its residential property customers at Pomona City the opportunity of a lifetime to pay 50 percent deposit for their brick requirements and enjoy a two-year instalment payment. The company is setting up a US$1 million brick moulding company to assist the realisation of the one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/westprop-offers-lucrative-brick-discount/\">WestProp offers lucrative brick discount</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "Zimbabwe’s inflation slows to 3.7% in December",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-slows-to-3-7-in-december/",
            "content": "Xinhua\n\nZimbabwes inflation slowed to 3.7 percent in December, down from 11.7 percent recorded the previous month, according to data released by the Zimbabwe National Statistics Agency (ZIMSTAT) on Friday.\n\nAccording to the ZIMSTAT, the downward trend in inflation in November and December, from a peak of 37.2 percent in October, reflects the prevailing stability of prices and the local currency, the Zimbabwe Gold (ZiG), after the central bank devalued it by 43 percent in September.\n\nWhile presenting the 2025 national budget to Parliament in November, Finance Minister Mthuli Ncube said he expects the ZiG month-on-month inflation to remain stable and average below 3 percent next year, backed by tight fiscal and monetary policies.\n\nHe said the 2025 fiscal plan was built on single-digit inflation and a stable exchange rate to create a favorable business environment.\n\nAny deviation from these assumptions, including the widening of the premium between the official and parallel markets, will severely impact macroeconomic stability, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Xinhua Zimbabwe’s inflation slowed to 3.7 percent in December, down from 11.7 percent recorded the previous month, according to data released by the Zimbabwe National Statistics Agency (ZIMSTAT) on Friday. According to the ZIMSTAT, the downward trend in inflation in November and December, from a peak of 37.2 percent in October, reflects the prevailing stability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-slows-to-3-7-in-december/\">Zimbabwe’s inflation slows to 3.7% in December</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        },
        {
            "title": "Mnangagwa pampers ‘neglected’ Mbare Chimurenga choirs",
            "url": "https://www.newzimbabwe.com/mnangagwa-pampers-neglected-mbare-chimurenga-choirs/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa on Thursday gave the Mbare Chimurenga Choirs gifts in recognition of their contribution to Zimbabwes cultural heritage.\n\nThe Mbare Chimurenga Choirs received Christmas hampers and money.\n\nSpeaking during the donation event, Mnangagwa urged the choirs to bring in fresh talent, keep their music alive, and explore new ways of distributing their music.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups.\n\nIt is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms, Mnangagwa said.\n\nThe groups are well known for their revolutionary songs and energetic dance moves that motivate the ruling party Zanu PF and the nation for national cohesion, unity, patriotism and development.\n\nRecently, the groups made headlines after reports surfaced that they were struggling to secure funds to record new music.\n\nAccording to some choir members, during the late former President Robert Mugabes era, they were often invited to perform at nearly every gala in Zimbabwe, and the government would arrange hotel accommodations for them, ensuring they had all they needed.\n\nHowever, they claim they are no longer invited to perform at most events.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27184520/mbare-chimurenga.jpeg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa on Thursday gave the Mbare Chimurenga Choirs gifts in recognition of their contribution to Zimbabwe’s cultural heritage. The Mbare Chimurenga Choirs received Christmas hampers and money. Speaking during the donation event, Mnangagwa urged the choirs to bring in fresh talent, keep their music alive, and explore new ways of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-pampers-neglected-mbare-chimurenga-choirs/\">Mnangagwa pampers ‘neglected’ Mbare Chimurenga choirs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "29 Dec 2024"
        }
    ]
}