{
    "news": [
        {
            "title": "Maswanhise signs new contract to extend stay at Motherwell FC",
            "url": "https://www.newzimbabwe.com/maswanhise-signs-new-contract-to-extend-stay-at-motherwell-fc/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanise has signed a new contract with Scottish side Motherwell FC.\n\nMaswanhises new commitment will see him staying at the club until 2027.\n\nThe 22-year-old Zimbabwean international joined the side in July last year from Leicester and made an instant impact during 2024-25 season.\n\nWith four goals to his name already this season, Motherwell FC could not wait longer to tie down the Zimbabwean, whom they have given a two-year contract with an option to extend.\n\nSpeaking after signing his contract, Maswanhise said, I have truly enjoyed my time here.\n\nUltimately, I wanted to stay, and signing this deal was a straightforward choice. The fans, players, and staff are all fantastic. Ive felt valued by everyone, which motivates me to keep contributing my best.\n\nI will keep working hard and giving my all for this football club. Its an exciting time.\n\nSince arriving at Motherwell, Maswanhise has made 40 appearances, in the process, he scored 10 goals and provided several assists.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/14164801/tawanda-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanise has signed a new contract with Scottish side Motherwell FC. Maswanhise’s new commitment will see him staying at the club until 2027. The 22-year-old Zimbabwean international joined the side in July last year from Leicester and made an instant impact during 2024-25 season. With four goals to his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-signs-new-contract-to-extend-stay-at-motherwell-fc/\">Maswanhise signs new contract to extend stay at Motherwell FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "14 Aug 2025"
        },
        {
            "title": "Malloti in court for insulting Passion Java – granted US$100 bail",
            "url": "https://www.newzimbabwe.com/malloti-in-court-for-insulting-passion-java-granted-us100-bail/",
            "content": "By Mary Taruvinga\n\nA Harare socialite, Malloti, well-known for uttering vulgar words, was Thursday hauled before the court for insulting controversial cleric Passion Java on social media.\n\nMillicent Chimonyo (26), popularly known as Malloti, appeared before Harare Magistrate Tapiwa Kuhudzayi, facing cyberbullying charges.\n\nThe State represented by Nomsa Kangara did not oppose bail.\n\nMalloti was granted $100 bail.\n\nThe State alleged that on May 14 Malloti recorded a video of herself uttering unprintable words regarding Javas involvement in Zim Dancehall music.\n\nIn the video, she accused Java of taking Zim dancehall for granted and as pornography.\n\nThe said utterances by the accused person were in violation of the law, reads the State outline.\n\nAs part of her bail conditions, Malloti was ordered to report to the police once a fortnight until her case is finalised.\n\nShe was also ordered to continue residing at her given address and not to interfere with state witnesses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26150458/malloti.jpg",
            "description": "<p>By Mary Taruvinga A Harare socialite, Malloti, well-known for uttering vulgar words, was Thursday hauled before the court for insulting controversial cleric Passion Java on social media. Millicent Chimonyo (26), popularly known as Malloti, appeared before Harare Magistrate Tapiwa Kuhudzayi, facing cyberbullying charges. The State represented by Nomsa Kangara did not oppose bail. Malloti was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malloti-in-court-for-insulting-passion-java-granted-us100-bail/\">Malloti in court for insulting Passion Java – granted US$100 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "14 Aug 2025"
        },
        {
            "title": "Harare City Council threatens to evict Mbare flats residents",
            "url": "https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/",
            "content": "By Staff Reporter\n\nDESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in.\n\nHarare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted.\n\nIn a notice dated June 18 2025, the director of housing, Addmore Nhekairo gave the residents an ultimatum to settle the arrears the City Council is owed by the residents.\n\nPlease be advised that since you have ignored various reminders and notices to clear the outstanding rental arrears, you are hereby served with a final notice to pay the outstanding amount or vacate the property to avoid continuous prejudice to council.\n\nYou are advised to settle your obligations within 14 days from date of receipt of this final notice. Failure to pay monthly rentals is a serious breach of the agreement of lease which mandates City of Harare to evoke the conditions of lease and recover holding costs from the same.\n\nNotwithstanding the availability or none of the lease agreement, council shall not be prejudiced in its rights to recover holding costs from the lessee for breach of mutual understanding, read the notice.\n\nThe notice comes on the back of Harare City, on the drive to recover money it is being owed by tenants leasing their properties.\n\nHowever, in Mbare, Harare City is under pressure to renovate the flats which are becoming uninhabitable.\n\nLast year, the High Court ordered Harare City Council to renovate the flats to match decent living standards. The City fathers have appealed the judgement.\n\nIn an interview with NewZimbabwe.com, Combined Harare Residents Association (CHRA) director, Ruben Akili, said the deplorable living conditions have dissuaded tenants from paying their rentals.\n\nThese are the same flats which we had a court order for renovations. As you are aware all the flats in Mbare were supposed to be renovated. The situation in Mbare is unacceptable sewer is gushing all over and many things are just happening and many things are happening.\n\nFrom CHRAs perspective is that some residents are paying and some are not paying. Local Authority should address the fundamental problems that speaks to the reasons why residents are not paying, said Akili.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Staff Reporter DESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in. Harare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/\">Harare City Council threatens to evict Mbare flats residents </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "14 Aug 2025"
        },
        {
            "title": "Bishop’s ‘brutal’ marathon challenge raises £35,000 for Zimbabwean education",
            "url": "https://www.newzimbabwe.com/bishops-brutal-marathon-challenge-raises-35000-for-zimbabwean-education/",
            "content": "Church Times\n\nTHEBishop of Kingston, Dr Martin Gainsborough, has completed his mission to run the full 268 miles of the Pennine Way in ten days, accompanied by his border collie, Jem. He has raised more than 35,000 forcharityas a result.\n\nThe bishop and his dog completed the challenge on Sunday, having averaged a marathon a day across some of Englands wildest terrain  from Edale in the Peak District to Kirk Yetholm just over the Scottish border  with an incline of nearly 40,000 feet.\n\nDr Gainsborough said on Tuesday: Running the equivalent of a marathon a day for ten days was pretty brutal as it is wild and mountainous terrain, and it is quite easy to lose the path.\n\nTo say that he enjoyed the experience would be overstating it, he said, but to have made it through without injury was deeply exhilarating. He said: Jem, who was magnificent throughout, is now enjoying a more sedentary pace in Southfields.\n\nThe Bishop set out on 1 August with an initial target of raising 30,000 to improve education in the diocese of Matabeleland, inZimbabwe, with whichSouthwark dioceseis linked.\n\nHe had been inspired by the children and teachers he met on a visit to the region last year, where many children currently walk up to 10km to get to their nearest school  a dangerous journey which means that many, particularly girls, are unable to attend.\n\nMartinGainsborough/Diocese of SouthwarkCamping out on the Pennine Way\n\nThe money raised will help to build new schools like St Cecilias School in Lupane, which is still under construction, but already offers an education to local children.\n\nSupport along the way included a video, on the fifth day, of the Bishop of Matabeleland, the Rt Revd Cleophas Lunga, outside the cathedral with members of the Mothers Union and senior clergy of his diocese, singing heartily of journeying with Jesus.\n\nBishop Lunga said: We are delighted that you are doing a very good, good thing, not only for your spirit and body, but also for us in Matabeleland. The gifts donated would go a long way to improving the lives of the young people in the villages, he said.\n\nOnline donations have since reached 27,000, with a further 8000 donated offline. The total raised currently stands at 35,389, and further donations are welcome.\n\nDr Gainsborough concluded: I have been amazed how my run has captured peoples imagination  reflected in a huge amount of support and prayers, and incredible generosity in fundraising.\n\nTo be able to make a difference to the lives of children in our link diocese of Matabeleland so they no longer have to walk long distances to school means more than I can say and makes all the pain and heartache worth it. Thanks be to God!\n\njustgiving.com/crowdfunding/bishop-martin-kingston\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13154007/bishop.jpeg",
            "description": "<p>Church Times THE Bishop of Kingston, Dr Martin Gainsborough, has completed his mission to run the full 268 miles of the Pennine Way in ten days, accompanied by his border collie, Jem. He has raised more than £35,000 for charity as a result. The bishop and his dog completed the challenge on Sunday, having averaged a marathon a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bishops-brutal-marathon-challenge-raises-35000-for-zimbabwean-education/\">Bishop’s ‘brutal’ marathon challenge raises £35,000 for Zimbabwean education</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "14 Aug 2025"
        },
        {
            "title": "Fatal road accidents surge over Heroes and Defence Forces holiday – police",
            "url": "https://www.newzimbabwe.com/fatal-road-accidents-surged-during-heroes-holiday-police/",
            "content": "By Mary Taruvinga\n\nRoad carnage worsened over the Heroes and Defence Forces holidays, with fatalities jumping from 16 last year to 24 this year, and fatal crashes rising from eight to 13, according to police statistics.\n\nThe total number of accidents recorded during the period climbed from 149 to 196, with 96 people injured.\n\nPolice spokesperson Commissioner Paul Nyathi said the accidents were mostly caused by reckless driving, speeding, mechanical faults and dangerous overtaking.\n\nAmong the worst incidents was the 11 August MutareMasvingo Road disaster in which six Zion Christian Church congregants were killed and 16 injured when a hired Quantum veered off the road and overturned near the 283km peg. The passengers were travelling from Gokwe to Chimanimani.\n\nA day later, four people died and 17 were injured on the BinduraShamva Road when a Toyota Hiace tyre burst, sending the overloaded vehicle off the road.\n\nOther fatal crashes included a Toyota Hilux overturning on the MasvingoMbalabala Road on 11 August, killing two, and a ChechecheRimai Road tragedy in which a 16-year-old girl died after falling from a moving sand-laden lorry and being run over.\n\nPedestrians were also victims. In Harare, a man was killed on Delport Road in Hatfield on 12 August after being hit by a Toyota Spade, while another was injured on High Glen Road the previous day.\n\nDespite commending public service operators for cooperation during the period, police urged motorists to service vehicles, avoid speeding, and adhere strictly to road rules.\n\nAbove all, drivers should adhere to all road rules and regulations in order to curb the continuous loss of lives through road traffic accidents, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/11080754/accident.jpg",
            "description": "<p>By Mary Taruvinga Road carnage worsened over the Heroes and Defence Forces holidays, with fatalities jumping from 16 last year to 24 this year, and fatal crashes rising from eight to 13, according to police statistics. The total number of accidents recorded during the period climbed from 149 to 196, with 96 people injured. Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fatal-road-accidents-surged-during-heroes-holiday-police/\">Fatal road accidents surge over Heroes and Defence Forces holiday – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "14 Aug 2025"
        }
    ]
}