{
    "news": [
        {
            "title": "High Court dismisses ZAPU application challenging Gukurahundi public hearings",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-zapu-application-challenging-gukurahundi-public-hearings/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Munamato Mutevedzi has dismissed an application by the Zimbabwe African Peoples Union (ZAPU) which sought to stop the chiefs-led Gukurahundi community outreach hearings.\n\nZAPU had filed an urgent chamber application complaining that the hearings set to begin Tuesday were unlawful and unconstitutional.\n\nEarlier this year, ZAPU encouraged survivors to avoid exposing themselves to possible retribution by the state through certain utterances during the hearings.\n\nIn the present application, ZAPU said the National Council of Chiefs was unlikely to be impartial.\n\nZAPU sought an interim interdict to halt the hearings pending a final court ruling.\n\nZAPU also proposed an alternative process involving an independent commission.\n\nIt argued that the current initiative protects perpetrators and fails to deliver justice.\n\nIn dismissing the application, Justice Mutevedzi said, ZAPU did not act when they initially felt agrieved but waited for the day of the hearings to start and then bring their case to court.\n\nPresident Emmerson Mnangagwa, the Local Government and Public Works minister and the National Council of Chiefs were cited as respondents in the application.\n\nOver 20,000 civilians were killed by a crack military unit known as the Fifth Brigade, deployed by Mugabe between 1980 and 1987 under the guise of putting down an insurrection in the western parts of the country.\n\nHowever, some argue the campaign was aimed at hunting down the opposition Zapu leader Joshua Nkomos supporters.\n\nFour decades later, victims have not been compensated and perpetrators walk scot free.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10153513/Gukurahundi.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Munamato Mutevedzi has dismissed an application by the Zimbabwe African Peoples Union (ZAPU) which sought to stop the chiefs-led Gukurahundi community outreach hearings. ZAPU had filed an urgent chamber application complaining that the hearings set to begin Tuesday were unlawful and unconstitutional. Earlier this year, ZAPU encouraged survivors</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-zapu-application-challenging-gukurahundi-public-hearings/\">High Court dismisses ZAPU application challenging Gukurahundi public hearings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "SADC Ministers convene in Zimbabwe to boost regional energy, water co-operation",
            "url": "https://www.newzimbabwe.com/sadc-ministers-convene-in-zimbabwe-to-boost-regional-energy-water-co-operation/",
            "content": "Channel Africa\n\nMinisters from the Southern African Development Community (SADC) responsible for energy and water have gathered in Harare this week for a joint meeting.\n\nThe meeting aims to strengthen regional co-operation and review progress on key projects in both sectors.\n\nThe meeting, which began on Monday and will continue for four days, brings together senior officials from member states to discuss pressing challenges and opportunities.\n\nThis session marks the 30th anniversary of the Southern African Power Pool, established by SADCs Council of Ministers in August 1995 to promote regional power sharing and integration.\n\nThe meeting comes at a time when climate change is having a serious impact on energy production across Southern Africa. Zambia and Zimbabwe are among the hardest hit countries, facing frequent power outages due to reduced water levels in Lake Kariba, which have caused a 25% drop in hydroelectric output.\n\nParticipants are expected to review the progress of the Mission 300 initiative, a project backed by the World Bank and African Development Bank that aims to expand energy access to 600 million people in the region by 2030, with the first target being 300 million.\n\nThe agenda also includes discussions on developing the petroleum and gas sectors, as well as adopting emerging technologies such as green hydrogen and smart grids. The Ministers will consider recommendations from a recent regional dialogue on ensuring a just transition to sustainable energy in Southern Africa.\n\nOn the water front, the meeting will evaluate advances in transboundary water management projects, led by River Basin Organisations and other shared institutions, including groundwater and livelihood support programmes.\n\nProfessor Obert Jiri, Permanent Secretary in Zimbabwes Ministry of Lands, Agriculture and Water Development and Chair of the water officials committee, highlighted the critical link between energy and water resources.\n\nSolar power and energy recovered from landfill gases demonstrate the close relationship between water and energy, he said. Managing water resources effectively is vital, not just for energy generation but also as a response to climate change. A small rise in temperature can significantly reduce water availability in our region, affecting agriculture and livelihoods.\n\nHe added that this meeting is crucial for exploring ways to improve water access for irrigation and energy production, both of which are essential for the regions development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/12122242/Screenshot-2024-11-12-at-14.20.53.png",
            "description": "<p>Channel Africa Ministers from the Southern African Development Community (SADC) responsible for energy and water have gathered in Harare this week for a joint meeting. The meeting aims to strengthen regional co-operation and review progress on key projects in both sectors. The meeting, which began on Monday and will continue for four days, brings together</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-ministers-convene-in-zimbabwe-to-boost-regional-energy-water-co-operation/\">SADC Ministers convene in Zimbabwe to boost regional energy, water co-operation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "Mugabe’s son Chatunga in court over five assault charges",
            "url": "https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/",
            "content": "By Mary Taruvinga\n\nBellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals.\n\nChatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo.\n\nThe trio were released on US$200 bail each.\n\nThere are five complainants in the case.\n\nIn the first count, the complainant is Ntandoyokuza Nyathi (31).\n\nHe is employed as an external security guard at Ultimate Mine, Mazowe.\n\nAccording to the state, on June 25, at around 1600 hours, the complainant was on duty at Ultimate Mine, Mazowe, where he was guarding the premises with a security dog.\n\nHe was at the boundary of Ultimate Mine and Grace Mugabes Iron Mask farm when the accused persons approached him in pursuit of illegal miners allegedly evading arrest from Iron Mask security guards.\n\nOne of the accused persons fired a shot from an unidentified pistol and the illegal miners escaped. The accused persons charged towards the complainant whom they accused of harbouring illegal miners.\n\nThey altogether assaulted the complainant with open hands and fists before he fell, the court heard.\n\nIt is alleged that the trio stomped on the complainant several times whilst he was lying down.\n\nThey ordered the complainant to carry a sack of gold ore to their premises, where they also took turns to assault him using wooden logs and an iron bar.\n\nThe complainant sustained several injuries and went to report the matter at ZRP Mazowe where he was referred to the hospital for medical treatment and examination.\n\nIn the second count, the complainant in this case is Philip Chipara, employed as an internal security supervisor at Ultimate Mine, Mazowe.\n\nHe was also on duty at Ultimate Mine when he was assaulted.\n\nHe heard a gunshot sound at the boundary of the Ultimate Mine and Iron Mask farm and went to investigate.\n\nUpon arrival, he saw his colleague, Nyathi, who was patrolling with a dog being assaulted with fists, booted feet and a shambock all over the body by the accused persons.\n\nThe complainant enquired as to why they were assaulting their security guard.\n\nThe accused persons charged towards the complainant and started assaulting him with fists and booted feet all over the body, the court heard.\n\nIt is alleged that the three handcuffed Chipara, together with Elvis Bvumbe and later released them.\n\nBvumbe is the other complainant.\n\nChatunga and his bodyguards also assaulted Collen Muchemwa and Waddington Mutadza who were also on duty at the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/17191946/Chatunga.jpeg",
            "description": "<p>By Mary Taruvinga Bellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals. Chatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo. The trio were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/\">Mugabe’s son Chatunga in court over five assault charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "Televangelist Jimmy Swaggart, whose ministry was toppled by prostitution scandals, dies at 90",
            "url": "https://www.newzimbabwe.com/televangelist-jimmy-swaggart-whose-ministry-was-toppled-by-prostitution-scandals-dies-at-90/",
            "content": "CNN\n\nTelevangelist Jimmy Swaggart, who became a household name amassing an enormous following and multimillion-dollar ministry only to be undone by his penchant for prostitutes, has died.\n\nSwaggart died decades after his once vast audience dwindled and his name became a punchline on late night television. His death was announced Tuesday on his public Facebook page. A cause wasnt immediately given, though at 90 he had been in poor health.\n\nThe Louisiana native was best known for being a captivating Pentecostal preacher with a massive following before being caught on camera with a prostitute in New Orleans in 1988, one of a string of successful TV preachers brought down in the 1980s and 90s by sex scandals. He continued preaching for decades, but with a reduced audience.\n\nSwaggart encapsulated his downfall in a tearful 1988 sermon, in which he wept and apologized but made no reference to his connection to a prostitute.\n\nI have sinned against you, Swaggart told parishioners nationwide. I beg you to forgive me.\n\nHe announced his resignation from the Assemblies of God later that year, shortly after the church said it was defrocking him for rejecting punishment it had ordered for moral failure. The church had wanted him to undergo a two-year rehabilitation program, including not preaching for a full year.\n\nSwaggart said at the time that he knew dismissal was inevitable but insisted he had no choice but to separate from the church to save his ministry and Bible college.\n\nSwaggart grew up poor, the son of a preacher, in a music-rich family. He excelled at piano and gospel music, playing and singing with talented cousins who took different paths: rock-n-rollerJerry Lee Lewisand country singerMickey Gilley.\n\nIn his hometown of Ferriday, Louisiana, Swaggart said he first heard the call of God at age 8. The voice gave him goose bumps and made his hair tingle, he said.\n\nEverything seemed different after that day in front of the Arcade Theater, he said in a 1985 interview with the Jacksonville Journal-Courier in Illinois. I felt better inside. Almost like taking a bath.\n\nHe preached and worked part time in oil fields until he was 23. He then moved entirely into his ministry: preaching, playing piano and singing gospel songs with the barrelhouse fervor of cousin Lewis at Assemblies of God revivals and camp meetings.\n\nSwaggart started a radio show, a magazine, and then moved into television, with outspoken views.\n\nHe called Roman Catholicism a false religion. It is not the Christian way, and claimed that Jews suffered for thousands of years because of their rejection of Christ.\n\nIf you dont like what I say, talk to my boss, he once shouted as he strode in front of his congregation at his Family Worship Center in Baton Rouge, where his sermons moved listeners to speak in tongues and stand up as if possessed by the Holy Spirit.\n\nSwaggarts messages stirred thousands of congregants and millions of TV viewers, making him a household name by the late 1980s. Contributors built Jimmy Swaggart Ministries into a business that made an estimated $142 million in 1986.\n\nHis Baton Rouge complex still includes a worship center and broadcasting and recording facilities.\n\nSwaggarts downfall came in the late 1980s as other prominent preachers faced similar scandals. Swaggart said publicly that his earnings were hurt in 1987 by the sex scandal surroundingrival televangelist Jim Bakkerand a former church secretary at Bakkers PTL ministry organization.\n\nJimmy Swaggart Ministry/WBRZ-TV/Bettmann/Getty Images\n\nThe following year, Swaggart was photographed at a hotel with Debra Murphree, an admitted prostitute who told reporters that the two did not have sex but that the preacher had paid her to pose nude.\n\nShe later repeated the claim  and posed nude  for Penthouse magazine.\n\nThe surveillance photos that crippled Swaggarts career apparently stemmed from his rivalry with preacher Marvin Gorman, whom Swaggart had accused of sexual misdeeds. Gorman hired the photographer who captured Swaggart and Murphree on film. Swaggart later paid Gorman $1.8 million to settle a lawsuit over the sexual allegations against Gorman.\n\nMore trouble came in 1991, when police in California detained Swaggart with another prostitute. The evangelist was charged with driving on the wrong side of the road and driving an unregistered Jaguar. His companion, Rosemary Garcia, said Swaggart became nervous when he saw the police car and weaved when he tried to stuff pornographic magazines under a car seat.\n\nSwaggart was later mocked by the late TV comic Phil Hartman, who impersonated him on NBCs Saturday Night Live.\n\nThe evangelist largely stayed out of the news in later years but remained in the pulpit at Jimmy Swaggart Ministries, often joined by his son, Donnie, a fellow preacher. His radio station broadcast church services and gospel music to 21 states, and Swaggarts ministry boasted a worldwide audience on the internet.\n\nTheres been no greater example of a good and faithful servant than my father. No ifs, ands and buts about it. A man who lived his life for the cause of Christ, Donnie Swaggart said in avideo message sharedon social media Sunday about his dads final days.\n\nThe preacher caused another brief stir in 2004 with remarks about being looked at amorously by a gay man.\n\nAnd Im going to be blunt and plain: If one ever looks at me like that, Im going to kill him and tell God he died, Jimmy Swaggart said, to laughter from the congregation. He later apologized.\n\nSwaggart made few public appearances outside his church, save for singing Amazing Grace at the 2005 funeral of Louisiana Secretary of State Fox McKeithen, a prominent name in state politics for decades.\n\nIn 2022, he shared memories at thememorial servicefor Lewis, his cousin and rock n roll pioneer. The pair had released The Boys From Ferriday, a gospel album, earlier that year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01194346/Screenshot-2025-07-01-at-20.43.32.png",
            "description": "<p>CNN Televangelist Jimmy Swaggart, who became a household name amassing an enormous following and multimillion-dollar ministry only to be undone by his penchant for prostitutes, has died. Swaggart died decades after his once vast audience dwindled and his name became a punchline on late night television. His death was announced Tuesday on his public Facebook</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/televangelist-jimmy-swaggart-whose-ministry-was-toppled-by-prostitution-scandals-dies-at-90/\">Televangelist Jimmy Swaggart, whose ministry was toppled by prostitution scandals, dies at 90</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "Electronic Know Your Customer (eKYC) Explained",
            "url": "https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/",
            "content": "As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently?\n\nThe answer lies in eKYCshort for electronic Know Your Customer. This digital approach to verifying customer identity is now a cornerstone of modern financial services, enabling fast, secure, and scalable customer onboarding.\n\neKYCis the digital counterpart of traditional KYC procedures. It allows companies to verify identities without requiring physical presence or paper-based documentation. By using biometric data, document scanning, and real-time analytics, eKYC systems authenticate users remotely, ensuring compliance and security while streamlining the user experience.\n\nWhile both eKYC and traditional KYC aim to prevent financial crime such as money laundering and terrorism financing, the key difference lies in how they operate. Traditional KYC relies on physical documents and in-person checks, whereaseKYC solutionsare fully automated, using facial recognition, liveness detection, and AI to validate identities.\n\nAdopted globally, eKYC technology has become especially prominent since 2022. Regulatory bodies, such as the Qatar Central Bank, have already established frameworks for eKYC verification, including allowing non-residents to onboard digitally with official approval.\n\nThe debate of eKYC vs KYC is really about automation and scale. Heres how they differ:\n\nAspect\n\nTraditional KYC\n\neKYC\n\nDocument Submission\n\nIn-person, physical documents\n\nOnline upload, real-time capture\n\nVerification Method\n\nManual inspection\n\nAutomated checks with AI and biometrics\n\nSpeed\n\nDays\n\nSeconds\n\nAccessibility\n\nLimited to branch hours\n\n24/7 global access\n\nCost\n\nHigh operational costs\n\nLower due to automation\n\nUltimately, eKYC solutions provide a faster, more efficient route to customer identity verificationespecially for remote and mobile-first environments.\n\nLets break down how a typical eKYC verification workflow works:\n\nIn a well-optimized flow, all these steps occur in secondsthanks to automated eKYC verification and seamless eKYC processes.\n\nAdopting eKYC technology offers organizations numerous advantages:\n\nThere are multiple eKYC types, depending on the channel and depth of verification:\n\nEach type offers a different balance of user convenience, speed, and regulatory compliance.\n\neKYC verification is being rapidly adopted across various sectors:\n\nExample: N26, a German neobank, uses automated eKYC solutions to autofill user data after scanning a document, expediting form completion.\n\nExample: Binance restricts unverified users to withdrawals only. Kraken mandates full eKYC verification to trade.\n\nAcross these industries, eKYC technology ensures security, compliance, and a frictionless customer experience.\n\nAs AI-generated photos and videos become more convincing, electronic Know Your Customer systems face rising fraud risks. A Regula study found over half of firms in Crypto and FinTech had encountered AI-driven spoofing.\n\nRegulations vary by region. For example, the Qatar Central Bank now mandates active liveness detectione.g., head movementson mobile apps and kiosks.\n\nRobust eKYC systems require high-performance servers, secure APIs, and advanced IDV tools. Companies must balance security with usability.\n\nFraudsters may exploit customer eKYC by mimicking reverification requests. Customers who recently completed verification are more likely to fall for scams.\n\nSolution: Launch fraud awareness hubs like Danske Banks support portal to educate users.\n\nThe shift toward digital banking and identity services makes eKYC more important than ever. With eKYC verification now a regulatory expectation in many countries, businesses that adopt this approach early will gain a competitive edge.\n\nWhether youre launching a neobank, enhancing a FinTech app, or optimizing compliance in crypto, investing in eKYC technology ensures secure and seamless customer onboarding. And as digital identity wallets and verifiable credentials evolve under initiatives like the EUs eIDAS update, eKYC solutions will only grow more robust and reusable.\n\nNow is the time to modernize your identity verification strategy. With partners like Regula, you can deploy advanced document verification, facial recognition, and liveness detection toolsready to support your transformation into the future of secure digital finance.\n\n",
            "image_url": null,
            "description": "<p>As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently? The answer lies in eKYC—short for electronic Know Your Customer. This digital</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/\">Electronic Know Your Customer (eKYC) Explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "Former Minister Mzembi challenges placement on remand",
            "url": "https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/",
            "content": "By Mary Taruvinga\n\nFormer Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand.\n\nMzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application.\n\nHis lawyer, Killian Mandiki, intends to file written submissions before the State responds.\n\nFollowing his arrest last month, Mzembi had his bail revoked by a Harare magistrate who trashed his application for cancellation of arrest warrants, ruling that he failed to report back on time when he got the opportunity.\n\nMandiki had told the court that the former minister was not in wilful default.\n\nMzembi said he was sick with a life-threatening condition and was hospitalised most of the time.\n\nHe also said he only decided to come back home after noticing that his health had improved.\n\nBut the magistrate said Mzembi was not sick to the extent that he could not attend court.\n\nIn revoking Mzembis bail, the magistrate also noted that Mzembi was the campaigning manager for fellow former minister Saviour Kasukuwere, who is currently exiled in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01102551/mzembi.png",
            "description": "<p>By Mary Taruvinga Former Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand. Mzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application. His lawyer, Killian Mandiki, intends to file written submissions before the State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/\">Former Minister Mzembi challenges placement on remand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "Train runs over lifeless man, another killed while lying on rail tracks",
            "url": "https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/",
            "content": "By Staff Reporter\n\nA NATIONAL Railways of Zimbabwe (NRZ) trainon Mondayran over a man who is believed to have already been dead.\n\nThe incident happened atOdzi Siding near the eastern border city of Mutare.\n\nThe NRZ confirmed the incident in a statement.\n\nA man was run over by a train early this morning at Odzi Siding near Mutare. The man was lying lifeless on the tracks and did not respond to the approaching trains sounding horn.\n\nThe train crew suspect the man was already dead by the time he was run over. The man had no identity particulars on him and the scene was attended by ZRP, reads the statement.\n\nIn a separate but similar incident, a man identified as Peter Vengesayi was run over by a train near Zvishavane, Midlands province.\n\nIn yet another tragic incident today, a man died after being run over by a train near Zvishavane.\n\nPeter Vengesayi of Village 1, Zeederburg under Chief Mafala was lying on the tracks when the incident occured. The NRZ extends its condolences to his family, said NRZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/17224403/National-Railways-of-Zimbabwe.jpg",
            "description": "<p>By Staff Reporter A NATIONAL Railways of Zimbabwe (NRZ) train on Monday ran over a man who is believed to have already been dead. The incident happened at Odzi Siding near the eastern border city of Mutare. The NRZ confirmed the incident in a statement. “A man was run over by a train early this morning at Odzi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/\">Train runs over lifeless man, another killed while lying on rail tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        },
        {
            "title": "Ladysmith Black Mambazo honoured with prestigious award",
            "url": "https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/",
            "content": "TshisaLive\n\nLadysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence.\n\nThegroup, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing ofumculo wesintu, South Africas indigenous music.\n\nIn their acceptance speech, the group thanked Ukhozi FM for this recognition.\n\nWe stand humbled and honoured. Ukhozi FM celebrated us for the role weve played in nurturing and growingumculo wesintu our indigenous music. From the hills of Ladysmith to stages around the world, weve carried the sounds of our ancestors with pride,said Sibongiseni Tshabalala, the son of the founder of Ladysmith Black Mambazo,JosephTshabalala.\n\nThank you, Ukhozi FM, for this beautiful recognition.Siyabonga,thank you for walking this journey with us.\n\nThe group were among other notable artists  Nothembi Mkhwebane, Ringo and Makhadzi  who graced the stage with captivating performances.\n\nThis year marks 65 years of Ladysmith Black Mambazo in the music industry and to celebrate the milestone they are undertaking a special tour.\n\nAfter wrapping up their US tour and the first instalment of the national tour in Johannesburg, the group have performances lined up in Durban and Cape Town.\n\nIts such an amazing experience to walk in the footsteps of our father, the founder of the group Joseph Shabalala, and all others who founded the group. I have realised that I have been with the group for more than 30 years now, said Sibongiseni.\n\nThis means the legacy of the group is continuing to grow from glory to glory. In a few years from now we will celebrate 70 years, an incredible milestone in the history of music. We thank South Africans , the continent and the world for supporting us throughout this journey.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01014629/black-mambazo.png",
            "description": "<p>TshisaLive Ladysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence. The group, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing of umculo wesintu, South Africa’s indigenous music. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/\">Ladysmith Black Mambazo honoured with prestigious award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:48",
            "date": "02 Jul 2025"
        }
    ]
}