{
    "news": [
        {
            "title": "Floyd Shivambu plots new political party amid Zuma coup accusations",
            "url": "https://www.newzimbabwe.com/floyd-shivambu-plots-new-political-party-amid-zuma-coup-accusations/",
            "content": "IOL\n\nFormer MK party secretary-general, Floyd Shivambu, has declared the start of the process to create a new political party following accusations that he attempted to topple former president Jacob Zuma as the MKP leader.\n\nSpeaking at a press briefing at the Mhulu Luxury Boutique Hotel in Midrand on Thursday, Shivambu said they will be consulting with all traditional leaders, church leaders, and civilians over the next few months on the formation of the party.\n\nWe will be seeking the wisdom of ordinary South Africans, including all the churches of Zion Christian Church of Nazareth Baptist Church and IPCC Michael Nkuna, Dr Irvin Khoza, Patrice Motsepe, and Kaizer Motaung on the need to form a new political party.\n\nIf yes, what should be the values of that political party and what should differentiate it from other political parties? he said.\n\nHowever, Shivambu insisted he was not leaving MKP, brushing off the question about dual membership.\n\nI have not resigned from uMkhonto weSizwe. I will never resign from uMkhonto weSizwe, he said, sticking to his word that joining Zumas party was the best decision ever.\n\nShivambu stated that the consultations needed to be the answer to why and how the party should be funded.\n\nHe said the party on the pipelines is not going to be a personal project, a cult or a group of friends. He added that they will announce the leadership that is going to lead the consultations.\n\nShivambu dropped a political bombshell during a media briefing, claiming hed been accused of plotting to overthrow Zuma and take over.\n\nHe slammed what he called a bizarre and fabricated intelligence report, alleging it accused him of wielding supernatural powers capable of making people vanish  charges he dismissed as absurd and politically motivated.\n\nTheres nothing I do in private that I wont own publicly, Shivambu declared defiantly.\n\nHis explosive comments come amid a wave of infighting thats torn through the MK Party.\n\nShivambu, once a dominant policy voice in the EFF, was recently booted from his position as the MKPs sixth secretary-general.\n\nThe dismissal followed internal rebellion from both traditional leaders and a powerful Mpumalanga faction.\n\nThe final straw? His controversial Easter visit to the church of fugitive Malawian pastor Shepherd Bushiri  a move party insiders claim contradicted MKPs official line and sealed his political fate.\n\nRumours of Shivambus imminent departure had been swirling after he went rogue and called an unsanctioned press conference on Wednesday  a bold act that now appears to confirm his break from the partys inner circle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04022058/floyd-shivambu.png",
            "description": "<p>IOL Former MK party secretary-general, Floyd Shivambu, has declared the start of the process to create a new political party following accusations that he attempted to topple former president Jacob Zuma as the MKP leader. Speaking at a press briefing at the Mhulu Luxury Boutique Hotel in Midrand on Thursday, Shivambu said they will be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/floyd-shivambu-plots-new-political-party-amid-zuma-coup-accusations/\">Floyd Shivambu plots new political party amid Zuma coup accusations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "19 Jun 2025"
        },
        {
            "title": "Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak",
            "url": "https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/",
            "content": "By Staff Reporter\n\nThe government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan.\n\nThis Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna Resort in Harare, marking the start of a process to craft the countrys five-year economic blueprint 2026-2030.\n\nThe indaba drew participants from industry and commerce, farmers organisations, the clergy, civil society and academia.\n\nSpeaking on the sidelines of the event, Minister of Finance, Economic Development and Investment Promotion, Mthuli Ncube, said a draft of NDS 2 should be ready by October.\n\nThe NDS 2 will be a successor to NDS 1. We have appointed consultants to do an evaluation of NDS 1 and their observations will serve as the base for NDS 2, which will be crafted following wide consultations, at the provincial and district levels. We should have a draft ready by October, said Ncube.\n\nAlthough Ncube emphasised that as NDS 1 approaches its end in December 2025, Zimbabwe remains solidly on track to attain an upper-middle-income society status, poverty and unemployment remain widespread among the general populace. The nation is reeling from a liquidity crunch amid a faltering Zimbabwe Gold (ZiG) currency.\n\nNcube said NDS 2 will serve as the crucial five-year plan to leapfrog the country towards the ambitious Vision 2030, by which Zimbabwe will attain upper-middle-class society status.\n\nNcube said chairpersons of 10 national priorities that will underpin the strategy were hitting the ground running to contribute to the national document.\n\nThe final document is expected to be tabled by November 2025, ahead of the National Budget presentation. Thereafter, it will be officially launched by the President.\n\nFollowing NDS 2s launch, Ncube said there will be public awareness campaigns by amplifiers to extensively disseminate its contents so that there is buy-in for the important national blueprint.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Staff Reporter The government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan. This Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/\">Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "19 Jun 2025"
        },
        {
            "title": "Rapist, robber jailed 75 years",
            "url": "https://www.newzimbabwe.com/rapist-robber-jailed-75-years/",
            "content": "By Staff Reporter\n\nA MAGISTRATE has meted a deterrent sentence to a rapist robber, condemning him to 75 years imprisonment.\n\nAccused person, John Foroma (38) appeared at Chipinge Magistrates Court, where he pleaded guilty to all five counts of rape, two counts of aggravated indecent assault, and one of robbery.\n\nHe was sentenced to 15 years for each of the five counts of rape and indecent assault. He was also slapped with five years imprisonment for the robbery count. The sentences run consecutively, resulting in a total effective term of 75 years.\n\nThe court heard that during the night of May 3 this year, in the Chief Ngungunyana area, he unlawfully entered a house, where a 13-year-old victim and her siblings were sleeping. He threatened her with a knife before raping her three times.\n\nThe assailant went on to sexually assault the other two minor girls, aged 9 and 11.\n\nIn another count, Foroma used violence against a 63-year-old woman to steal her Hisense cellphone. He later sold the gadget, which was tracked by police, leading to his arrest on June 15.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A MAGISTRATE has meted a deterrent sentence to a rapist robber, condemning him to 75 years imprisonment. Accused person, John Foroma (38) appeared at Chipinge Magistrates Court, where he pleaded guilty to all five counts of rape, two counts of aggravated indecent assault, and one of robbery. He was sentenced to 15</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rapist-robber-jailed-75-years/\">Rapist, robber jailed 75 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "19 Jun 2025"
        }
    ]
}