{
    "news": [
        {
            "title": "Stirling and Campher help Ireland to win over Zimbabwe",
            "url": "https://www.newzimbabwe.com/stirling-and-campher-help-ireland-to-win-over-zimbabwe/",
            "content": "By BBC Sport\n\nA 144-run partnership between captain Paul Stirling and Curtis Campher steered Ireland to a six-wicket victory over Zimbabwe as they levelled the ODI series in Harare.\n\nThe hosts were dimissed for 245 with Wesley Madhevere (61) and Sikandar Raza (58) putting on 74 for the fourth wicket.\n\nStirling (89) and Campher (63), who also took 3-13, set the Irish on course for victory and they reached 249-4 with eight balls to spare.\n\nZimbabwe secured a 49-run win in Fridays opener and the sides will meet again at the Harare Sports Club on Tuesday for the decider.\n\nIreland won the toss on Sunday and elected to field with the Chevrons moving to 73-3 before Madhevere and Sikandar Raza put them in a good position.\n\nCampher trapped Madhevere and followed it up with two wickets in two balls to swing the momentum in Irelands favour.\n\nSikandar Raza steadied Zimbabwes innings and from 157-6 they were bowled out for 245 with an over remaining with Mark Adair claiming 4-54.\n\nAndrew Balbirnie fell for 11 before fellow opener Stirling and Campher took Ireland to 171-1.\n\nLorcan Tucker (30*) and George Dockrell (20*) were at the creased as victory was sealed.\n\nI think we were better [than the first ODI]  theres no lull in that middle period, Sikandar and Wesley battled really well and thats when we were under the most pressure, said Stirling.\n\nI chucked the ball to Curtis and he really turned the game on its head. I think 250 was about right for us to chase and we got there.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16191945/81dd7330-ec74-11ef-a752-01fd95f2553a.jpg.jpeg",
            "description": "<p>By BBC Sport Zimbabwe 245 (49.0 overs): Madhevere 61, Sikander Raza 58; Adair 4-54 Ireland 249-4 (48.4 overs): Stirling 89, Campher 63; Gwandu 2-50 Ireland won by six wickets A 144-run partnership between captain Paul Stirling and Curtis Campher steered Ireland to a six-wicket victory over Zimbabwe as they levelled the ODI series in Harare.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stirling-and-campher-help-ireland-to-win-over-zimbabwe/\">Stirling and Campher help Ireland to win over Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Images of accident victims in “cardboard casts” spark public outrage; Zimbabwe’s government under spotlight over collapsed health system",
            "url": "https://www.newzimbabwe.com/images-of-accident-victims-in-cardboard-cast-spark-public-outrage-zimbabwes-government-under-spotlight-over-collapsed-health-system/",
            "content": "By Costa Nkomo\n\nPRESIDENT Emmerson Mnangagwas government is facing a firestorm of criticism after the appalling response to the latest road traffic accident, where victims at local hospitals were captured on camera with limbs supported by cardboard makeshift casts, cellotape and cloths.\n\nThe grim reality of Zimbabwes healthcare system has been laid bare, as harrowing images of survivors from the Lutumba Tollgate bus accident, which occurred along the Masvingo-Beitbridge highway, circulate online.\n\nPictures showing broken limbs crudely splinted with cardboard and tape have gone viral, sparking outrage across social media.\n\nThe tragic collision, involving a Beitbridge-bound Urban Connect bus and a haulage truck carrying magnesium to Chirundu near the Lutumba toll gate on the Beitbridge-Masvingo highway last Thursday, claimed 25 lives and left scores seriously injured, fighting for their lives in critical condition.\n\nLast year, Neshuro District Hospital, one of the closest medical facilities to the accident site, was already creaking under the strain of inadequate resources.\n\nReports had it that the hospital lacked a functional mortuary, kitchen, and even a washing machine, with nurses resorting to using sticks to clean hospital linen  a telling sign of the neglect plaguing the health system nationwide.\n\nCabinet ministers, who descended upon the accident scene and later visited victims in hospital, seemed unfazed by the desperate situation.\n\nVictims lay helpless before them, while doctors and nurses, working their fingers to the bone, struggled to save lives, only to be let down by a government that seemingly does not prioritize proper healthcare infrastructure capable of responding to such crises.\n\nTransport Minister Felix Tapiwa Mhona, Local Government Minister Daniel Garwe, and Matebeleland South Provincial Minister Eveline Ndlovu were photographed posing at an unnamed hospital, believed to be Neshuro District Hospital, with accident victims whose limbs were held together by cardboard and tape  a photo opportunity that has been widely condemned as a callous public relations stunt.\n\nFurther adding insult to injury, it emerged that the Urban Connect bus, responsible for 24 deaths, was operating without a valid route permit, and the driver lacked a valid retest certificate, pointing to a wider problem of lax regulations and enforcement.\n\nSince Saturday, critics have been pulling no punches in their condemnation of Mnangagwas government, describing the incident as an utter embarrassment and a damning indictment of the governments unwillingness to invest in well-equipped hospitals for the benefit of ordinary citizens.\n\nRenowned lawyer and former Mt Pleasant MP Advocate Fadzayi Mahere wasted no time in holding Information Permanent Secretary Nick Mangwana to account, peppering him with pointed questions.\n\nThe former Zanu PF representative in the United Kingdom and Europe remains conspicuously silent, likely feeling the sting of the criticism himself.\n\nWe are not letting this healthcare issue go, Mahere posted on X on Sunday.\n\nWhy is the practice of using makeshift cardboard boxes to treat fractures so widespread in our public hospitals? Where is the dignity? Surely, you must all resign. This level of incompetence borders on the criminal. Its a mess. We need new leaders.\n\nMahere continued her broadside in another post on X Sunday, February 16, 2025: They promised us affordable, quality healthcare. Instead, they have given us cardboard boxes to use as casts to treat fractures, no clean water in public hospitals, torn hospital beds and no medication. Its a mess.\n\nSelf-exiled Zanu PF loyalist Kudzai Mutisi, based in South Africa, also weighed in, lambasting his own partys ministers as useless, unable to deliver even the most basic services to the people.\n\nA Cabinet Minister is witnessing FIRST HAND how his colleague in the Ministry of Health and Child Care has FAILED to do simple things. Felix Mhona will leave the hospital and SAY NOTHING about a dysfunctional system he witnessed.\n\nIn fact, he might join the 2030ists asking for more time to play. If you cant do it now, then you certainly wont do it even if given 40 more years. The current team of ministers lacks urgency and has misplaced priorities, said Mutisi in his X post on Sunday.\n\nA Cabinet Minister is witnessing FIRST HAND how his colleague in the@MoHCCZimhas FAILED to do simple things.@MhonaFelixwill leave the hospital & SAY NOTHING about dysfunctional system he witnessed. In fact, he might join the 2030ists asking for more time to play.\n\nIf youpic.twitter.com/GIsv46xn41\n\n   (@KMutisi)February 16, 2025\n\nEven former cabinet minister Saviour Kasukuwere, who served under the late President Robert Mugabe and is himself considered by many to bear some culpability for the systemic deficiencies crippling Zimbabwes healthcare, has now weighed in, adding his voice to the chorus of condemnation levelled at Mnangagwas government over the deplorable treatment of accident victims.\n\npic.twitter.com/SGKB0frfSG\n\n Saviour Kasukuwere (@Hon_Kasukuwere)February 16, 2025\n\nThis is not normal, he posted Sunday.\n\nThey promised us affordable, quality healthcare. Instead, they have given us cardboard boxes to use as casts to treat fractures, no clean water in public hospitals, torn hospital beds and no medication. Its a mess.\n\nWe need new leaders.pic.twitter.com/CdIlWuSTwt\n\n Fadzayi Mahere (@advocatemahere)February 16, 2025\n\nHe joins the fray with a clear vested interest, as it would be imprudent to discount how much the issue will improve his standing amongst the masses.\n\nKasukuweres erstwhile colleague, former cabinet minister Professor Jonathan Moyo  a figure currently out of favour with many both within and outside Zanu PF, and seemingly sitting on the fence regarding Mnangagwas 2030 term extension, waiting to see which way the wind blows  could not remain silent, despite his recent show of support for the government.\n\nHe posted on his X account on Sunday: This dispiriting image is an indictment of the state of the administration and delivery of public health in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16183713/WhatsApp-Image-2025-02-16-at-20.28.15.jpeg",
            "description": "<p>By Costa Nkomo   PRESIDENT Emmerson Mnangagwa’s government is facing a firestorm of criticism after the appalling response to the latest road traffic accident, where victims at local hospitals were captured on camera with limbs supported by cardboard makeshift casts, cellotape and cloths. The grim reality of Zimbabwe’s healthcare system has been laid bare, as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/images-of-accident-victims-in-cardboard-cast-spark-public-outrage-zimbabwes-government-under-spotlight-over-collapsed-health-system/\">Images of accident victims in “cardboard casts” spark public outrage; Zimbabwe’s government under spotlight over collapsed health system </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Pomona Flats: A golden investment opportunity in Harare North",
            "url": "https://www.newzimbabwe.com/pomona-flats-a-golden-investment-opportunity-in-harare-north/",
            "content": "By Staff Reporter\n\nIN the heart of Harare North, a vibrant and thriving suburb, a new residential development is taking shape.\n\nThe Pomona Flats, part of the ambitious US$4 billion Pomona City project, are now selling off-plan, offering investors a unique opportunity to be part of a revolutionary city within a city concept.\n\nEach block of the Pomona Flats will comprise 15 spacious apartments, designed to provide comfortable and modern living. These will comprise of one, two and three bedroomed units, complete with fixtures and quality finishes.\n\nThe development is strategically located with easy access to Harare drive and the rest of Harare. Pomona City located in Harare North, which will offer residents easy access to top-rated schools, shopping centres, and entertainment hubs within the Estate.\n\nInvesting in the Pomona Flats comes with numerous benefits. For one, the development is part of a larger master-planned community, which will feature a range of amenities, including office spaces, shopping centres, restaurants, and recreational facilities.\n\nThis live, work, shop, and play concept will create a vibrant and dynamic community, where residents can enjoy a convenient and fulfilling lifestyle.\n\nFurthermore, the Pomona City project is expected to boost economic growth in the area, creating new job opportunities and stimulating local businesses. As a result, property values are likely to appreciate, making the Pomona Flats an attractive investment opportunity.\n\nHarare North, where the Pomona Flats are located, is a highly sought-after suburb, known for its tranquil atmosphere, scenic views, and excellent infrastructure. Residents of the Pomona Flats will enjoy easy access to major highways, making it an ideal location for professionals and families.\n\nWe are excited to offer investors the opportunity to be part of this ground breaking development, said WestProp chief executive Ken Sharpe.\n\nThe Pomona Flats offer a unique blend of modern living, convenience, and investment potential, making them an attractive option for those looking to invest in Harares property market.\n\nWith its prime location, modern design, and range of amenities, the Pomona Flats are poised to become one of Harares most desirable residential addresses. Dont miss out on this opportunity to invest in a thriving community and be part of the Pomona City vision, said Sharpe.\n\nAdded to the residential enclave is a fruit orchard to feed residents and help foster community and social connection while enhancing the estates ambience, property values and general appeal.\n\nThe orchard which is set on two residential stands big enough to fit two apartment blocks is part of the companys commitment to sustainability and environmental stewardship.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/26130733/Ken-Sharpe.jpeg",
            "description": "<p>By Staff Reporter IN the heart of Harare North, a vibrant and thriving suburb, a new residential development is taking shape. The Pomona Flats, part of the ambitious US$4 billion Pomona City project, are now selling off-plan, offering investors a unique opportunity to be part of a revolutionary “city within a city” concept. Each block</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pomona-flats-a-golden-investment-opportunity-in-harare-north/\">Pomona Flats: A golden investment opportunity in Harare North</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Man kills ‘cheating’ wife after busting her with lover",
            "url": "https://www.newzimbabwe.com/man-kills-cheating-wife-after-busting-her-with-lover/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland Central province have arrested a Bindura man for killing his wife after catching her red-handed in a compromising position with another man suspected to be her lover.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nPolice in Bindura arrested Justice Pondani (34) for a case of murder which occurred on February 12, 2025, at a house in Woodbooke, Chiwaridzo in Bindura.\n\nThe suspect attacked his wife Grace Chareka (34) by pushing her head several times against the wall after allegedly finding her with a boyfriend. The victim died on the spot, said Nyathi.\n\nMeanwhile, police in Nyanga are investigating circumstances surrounding a case of murder in which a form four student struck his father, Tazvionesa Chitehwe (47) to death with an axe on the head after an argument on February 13, 2025, at Nyamugafata Village.\n\nThe suspect had spent two days away from home without the victims knowledge on his whereabouts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  POLICE in Mashonaland Central province have arrested a Bindura man for killing his wife after catching her red-handed in a compromising position with another man suspected to be her lover. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “Police in Bindura arrested Justice Pondani (34) for a case</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-kills-cheating-wife-after-busting-her-with-lover/\">Man kills ‘cheating’ wife after busting her with lover</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Beitbridge-Masvingo road accident death toll rises to 25; Police identify some victims of bus, haulage truck collision",
            "url": "https://www.newzimbabwe.com/beitbridge-masvingo-road-accident-death-toll-rises-to-25-police-identify-some-victims-of-bus-haulage-truck-collision/",
            "content": "By Staff Reporter\n\nThe death toll of the deadly accident that occurred along the Beitbridge-Masvingo road has climbed from 24 to 25.\n\nThis follows the passing away of one victim while receiving treatment in hospital.\n\nThe crash involved an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, on February 13, 2025.\n\nThe accident claimed 24 lives on the spot, while another victim died later in hospital, bringing the total death toll to 25.\n\nPolice also confirmed that 29 injured passengers are receiving treatment at Beitbridge District Hospital, while two others remain admitted at Gwanda Provincial Hospital.\n\nThirteen critically injured passengers were transferred to United Bulawayo Group of Hospitals for further medical care.\n\nIn a statement, police spokesperson Commissioner Paul Nyathi identified 21 of the 25 deceased victims, who have already been confirmed by their next of kin.\n\nThe victims are: Gwiba Kezias (51) of Stoneridge, Harare, Mudzingwa Origin (47) of Sese Village, Masvingo, Tsitsi Mukaro of Dulibadzimu, Beitbridge, Emma Mukaro of Dulibadzimu, Beitbridge, Punich Masvenhise (45) of SDP, Beitbridge, Richard Kandororo (37) of Maridale, Norton, Vincent Bvumbe (35) of Shule Shule, Beitbridge, Petronella Murungweni (26) of Mashavire, Beitbridge, Jeke Paradzai (46) of Glen Norah, Harare,\n\nOther were named as Abel Rumbwere of Mashavire, Beitbridge, Melissa Jackson (21) of Warren Park, Harare, Natasha Tembo of SDP, Beitbridge, Gilbert Gwinyai Mafi of Mbare, Harare, Elizabeth Mauto (48) of Seke, Chitungwiza, Faustina Zhakata Chibamu of Budiriro 5, Harare, Mutsekwa Josphine of Dulibadzimu, Beitbridge, Mollicious Kahanda (37) of Holiday Inn, Beitbridge, Douglas Mandira (43) of Marlborough, Angela Tembo of SDP, Beitbridge, Taziva Nyashega of Hatcliffe, Harare, Elton Marima of Old Medium, Beitbridge.\n\nThe identities of four others remain unknown and police are calling upon the public to help identify the bodies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16025142/JCNRIWQIriKC49ZbSy4m6q7gTxTuKCOw0zmzaDlk.gif",
            "description": "<p>By Staff Reporter The death toll of the deadly accident that occurred along the Beitbridge-Masvingo road has climbed from 24 to 25. This follows the passing away of one victim while receiving treatment in hospital. The crash involved an Urban Connect bus and an Auro Transport Haulage truck near Lutumba Tollgate, on February 13, 2025.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beitbridge-masvingo-road-accident-death-toll-rises-to-25-police-identify-some-victims-of-bus-haulage-truck-collision/\">Beitbridge-Masvingo road accident death toll rises to 25; Police identify some victims of bus, haulage truck collision </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Chirewa scoops another Player of The Match award for Huddersfield in Yorkshire Derby",
            "url": "https://www.newzimbabwe.com/chirewa-scoops-another-player-of-the-match-award-for-huddersfield-in-yorkshire-derby/",
            "content": "By Sports Reporter\n\nINFORM Warriors forward, Tawanda Chirewa was on fire Saturday after staging another stellar performance for Huddersfield in their 2-1 win over Barnsley in the English League One.\n\nThe award saw Chirewa completing two Player of The Match accolades in a row at Huddersfield, a side he joined in January on loan from his parent club, Wolveshampton Wanderers.\n\nChirewas side picked Saturdays win from behind, thanks to Josh Koroma and Ben Wiles, who scored in a space of three minutes to cancel Barnsleys goal.\n\nThe 21-year-old Zimbabwean forward was involved in both goals cementing his top class show throughout the match that saw him being voted the best on the pitch.\n\nHuddersfields win against Barnsley in the Yorkshire derby increased their chances of going for Championship play offs while the home side stretched its winless run to six games.\n\nChirewa is at Huddersfield on a six months loan deal running util the end of the season.\n\nThe Wolveshampton player joined the side from Derby County where he had spent five months on loan until his contract was terminated in December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16015043/IMG-20250215-WA0099.jpg",
            "description": "<p>By Sports Reporter  INFORM Warriors forward, Tawanda Chirewa was on fire Saturday after staging another stellar performance for Huddersfield in their 2-1 win over Barnsley in the English League One. The award saw Chirewa completing two Player of The Match accolades in a row at Huddersfield, a side he joined in January on loan from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chirewa-scoops-another-player-of-the-match-award-for-huddersfield-in-yorkshire-derby/\">Chirewa scoops another Player of The Match award for Huddersfield in Yorkshire Derby</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Former Yadah striker propels Marumo Gallants to Nedbank Cup quarter finals",
            "url": "https://www.newzimbabwe.com/former-yadah-striker-propels-marumo-gallants-to-nedbank-cup-quarter-finals/",
            "content": "By Sports Reporter\n\nFORMER Yadah FC striker, Junior Zindoga was the hero for Marumo Gallants Saturday as he scored the solitary goal that gave the side a 1-0 win over Amazulu in the Nedbank Cup Round of 16 match.\n\nThe Zimbabwean international found the back of the net in the 18th minute of the match after making a solo run into the box, thanks to his huge frame which allowed him to bulldoz Amazulu defender Ramaphiwe Mphalele along the way.\n\nAmazulu had several good chances in the second half, only to be denied by veteran Zimbabwe shot stopper Washington Arubi, who fought tooth and nail to walk away with a clean sheet.\n\nThe victory saw Gallants joining Stellenbosch, SuperSport United, Durban City, who have also progressed to the quarter finals.\n\nZindoga is enjoying his stay in the Betway Premiership after completing a move from Nzingisini Hotspurs in the National First Division last month.\n\nThe 21-year-old moved to South Africa last year from Yadah FC after terminating his contract which had not been honored by popular cleric Walter Magaya-owned football side.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/16014635/IMG-20250215-WA0027.jpg",
            "description": "<p>By Sports Reporter FORMER Yadah FC striker, Junior Zindoga was the hero for Marumo Gallants Saturday as he scored the solitary goal that gave the side a 1-0 win over Amazulu in the Nedbank Cup Round of 16 match. The Zimbabwean international found the back of the net in the 18th minute of the match</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-yadah-striker-propels-marumo-gallants-to-nedbank-cup-quarter-finals/\">Former Yadah striker propels Marumo Gallants to Nedbank Cup quarter finals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Zimbabwe heading towards electricity crisis: Parliament report",
            "url": "https://www.newzimbabwe.com/zimbabwe-heading-towards-electricity-crisis-parliament-report/",
            "content": "By Darlington Gatsi\n\nZIMBABWE risks plunging into an energy abyss that could severely undermine its economic prospects if it fails to address its ongoing power challenges, a parliamentary report has revealed.\n\nThe dossier, recently tabled by the Parliamentary Portfolio Committee on Energy and Power Development, paints a bleak picture of the countrys electricity situation.\n\nIt revealed the significant challenges faced by the Zimbabwe Power Company (ZPC), which have led to critically low levels of electricity production.\n\nCurrently, Zimbabwes main power sources are operating far below their capacity. While these sources have a combined generation capacity of 2,570 megawatts (MW), they are producing only 1,079 MW, leaving the country with a staggering deficit of 1,560 MW.\n\nTo bridge this gap, the national utility has been forced to import electricity from neighbouring countries.\n\nThe portfolio committee warned that the situation could deteriorate further if medium and long-term solutions are not implemented urgently.\n\nHowever, in as much as the transmission and distribution lines are functioning well, ZESA management highlighted that Zimbabwe is still facing serious power outages because the distribution supply of electricity is not meeting the nations demand.\n\nThe committee noted that the major challenge is of all power plants are not producing their optimum capacity.\n\nThe committee cited that considering the state we are in as a country, if there are no strategies that are going to be implemented sooner to boost generation, the nation will be suffering for a long haul, reads the report.\n\nThe Zimbabwe Electricity Supply Authority (ZESA) has attributed the shortfall to outdated power infrastructure, the impacts of climate change, and the theft and vandalism of power lines and substations.\n\nThe low power generation has resulted in widespread load-shedding, with residential areas experiencing power cuts lasting more than 12 hours daily.\n\nSpeaking in Parliament recently, Citizens Coalition for Change (CCC) Member of Parliament, Ropafadzo Makumire, said there are far-reaching implications of the electricity crisis on key sectors of the economy, particularly healthcare.\n\nIn the health sector, you find that there are machines like ventilators which use electricity. It means that in the district hospitals where there are no dedicated lines, there will be no electricity.\n\nSo, major surgical operations cannot go ahead in this state. It means that people die because of lack of electricity and people who will be forced to walk for long distances are brought here in Harare.\n\nThis then increases the number of people being assisted. If you look at the mortuaries where these bodies are placed, you find that it is not accessible because the bodies will be in a decomposing state. This matter should be looked at with urgency so that we do not continue with this predicament, said Makumire.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25180412/Zimbabwe-Power-Cuts-e1664125462797.jpeg",
            "description": "<p>By Darlington Gatsi  ZIMBABWE risks plunging into an energy abyss that could severely undermine its economic prospects if it fails to address its ongoing power challenges, a parliamentary report has revealed. The dossier, recently tabled by the Parliamentary Portfolio Committee on Energy and Power Development, paints a bleak picture of the country’s electricity situation. It</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-heading-towards-electricity-crisis-parliament-report/\">Zimbabwe heading towards electricity crisis: Parliament report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "HIV patients spend long hours in queues to get treatment amid nurse shortage following USAID funding cessation",
            "url": "https://www.newzimbabwe.com/hiv-patients-spend-long-hours-in-queues-to-get-treatment-amid-nurse-shortage-following-usaid-funding-cessation/",
            "content": "By Thandiwe Garusa\n\nHIV patients in Epworth constituency on the outskirts of Harare are currently facing hours-long queues for life saving medical services due to severe nurse shortages following the cessation of USAID funding.\n\nFollowing U.S. President Donald Trumps America First policy, the US Embassy in Zimbabwe paused all U.S. foreign assistance funded by or through the State Department and USAID for review.\n\nThis move has led to the temporary suspension of services at New Start Centres and truck stop clinics across the country impacting patients on antiretroviral therapy (ART) and those seeking PrEP refills.\n\nAdditionally, USAID withdrew its nursing staff.\n\nSpeaking in a parliamentary session Wednesday, Epworth Member of Parliament, Zivanai Mhetu raised concerns over shortages of nurses, condoms, and antiretroviral drugs (ARVs) in his constituency demanding to know when the government will restore normal HIV services.\n\nMhetu said condoms and ARVs were almost running out.\n\nWhen are nurses coming and when are condoms and ARVs going to be distributed?\n\nWe were mocked in the constituencies, especially from my area, there are so many long and scary queues because (USAID) withdrew the services of their nurses.\n\nBefore the condoms and ARVs finish, we want to know when those drugs are going to be distributed, Mhetu said.\n\nSpeaker of Parliament, Jacob Mudenda said the funding gap wrought by Trumps policy shift was being looked into.\n\nlt is work in progress to close the gap resulting from the withdrawal of the funding and that will include those medical devices that the people so affected require will be addressed through that task force that has been formed by the minister, said Mudenda.\n\nApproximately 1.2 million Zimbabweans benefit from the U.S Presidents Emergency Plan for AIDS Relief (PEPFAR), and over 1,600 public hospitals and clinics have received training and technical support from the U.S. government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/07/05064415/HIV-Drug.jpg",
            "description": "<p>By Thandiwe Garusa HIV patients in Epworth constituency on the outskirts of Harare are currently facing hours-long queues for life saving medical services due to severe nurse shortages following the cessation of USAID funding. Following U.S. President Donald Trump’s America First policy, the US Embassy in Zimbabwe paused all U.S. foreign assistance funded by or</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hiv-patients-spend-long-hours-in-queues-to-get-treatment-amid-nurse-shortage-following-usaid-funding-cessation/\">HIV patients spend long hours in queues to get treatment amid nurse shortage following USAID funding cessation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        },
        {
            "title": "Kwekwe gold mine accident leaves 3 dead",
            "url": "https://www.newzimbabwe.com/kwekwe-gold-mine-accident-leaves-3-dead/",
            "content": "By Staff Reporter\n\nTHREE miners died after the hoist ferrying them to the surface plunge when a coupling securing the rope broke.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms the death of three people at Yellow Snake 37 mine, Kwekwe on February 13, 2025. The victims had entered into a mine shaft using a cage.\n\nAs the victims were getting out of the shaft a safety hook which fastening the rope to the cage broke resulting in the cage falling down the shaft. Subsequently, the cage overturned and crushed the victims, said Nyathi.\n\nThe bodies of the victims were taken to Kwekwe General Hospital for postmortem.\n\nThis latest incident highlights the low safety standards at mines in Zimbabwe, which have resulted in fatalities and injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/17202232/zimine.jpg",
            "description": "<p>By Staff Reporter  THREE miners died after the hoist ferrying them to the surface plunge when a coupling securing the rope broke. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms the death of three people at Yellow Snake 37 mine, Kwekwe on February 13, 2025. The victims</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwekwe-gold-mine-accident-leaves-3-dead/\">Kwekwe gold mine accident leaves 3 dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "16 Feb 2025"
        }
    ]
}