{
    "news": [
        {
            "title": "Cardi B reveals she’s expecting baby with Stefon Diggs, reflects on falling in love again",
            "url": "https://www.newzimbabwe.com/cardi-b-reveals-shes-expecting-baby-with-stefon-diggs-reflects-on-falling-in-love-again/",
            "content": "CBS News\n\nCardi Bis expecting her fourth child, the rapper exclusively announced Wednesday on CBS Mornings.\n\nThe 32-year-old said she feels excited and happy, while preparing to release new music and balancing motherhood.\n\nI feel like Im in a good space. I feel very strong. I feel very powerful that Im doing all this work. But Im doing all this work while Im creating a baby, me and my man, were very supportive of each other, she said.\n\nCardi B said she and Diggs share the same ambition, each determined to be the greatest in their fields. She also credited Diggs with giving her a sense of stability as she readies her next album, Am I The Drama?, which includes a track called Safe.\n\nAnd he just makes me feel safe and very confident and very strong, she said. I mean, like, two weeks ago I was literally having a panic attack. I was, like, crying and crying and crying, just because I was just getting really nervous with you know, the whole album rollout  People were coming at me very hard. You know, sometimes people love you, people hate you. And people was just saying very mean things about me.\n\nShe admitted harsh criticism sometimes makes her question releasing music.\n\nAnd Im like, see, this is why I dont put music out, because its like, this is my art and this is something that I put a lotta love and time to. And its just like, sometimes, when people just rip it apart it just hurts you and it crushes you, she said.\n\nThrough it all, Cardi B  whose real name is Belcalis Marlenis Almnzar  said Diggs support keeps her steady.\n\nHe makes me feel very confident And it makes you feel like you could take over the world.\n\nShe added that she waited to announce the pregnancy until she was able to close some deals first. She also admitted she has not yet told her parents, jokingly saying she is scared of them.\n\nCardi B, who shares three children with rapper Offset, said she was reluctant to fall in love again amid their high-profile divorce. But she recalled Diggs telling her: Let me heal you. Give me a chance for me to heal you.\n\nNow that pregnancy rumors are confirmed, Cardi B used her world-famous humor to ask fans to purchase her new album: Now yall could buy my album so I can buy Pampers and diapers and all that type of stuff. I told you. Now go support my album, cause Im a mother of four now.\n\nCardi B says her sophomore album feels complete.\n\nI feel like it touch every little thing that I want to touch. And I just feel like its something that is not out there right now.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17173351/cardi-b.webp",
            "description": "<p>CBS News Cardi B is expecting her fourth child, the rapper exclusively announced Wednesday on “CBS Mornings.” The Grammy winner revealed she is pregnant and having a baby with her boyfriend, New England Patriots wide receiver Stefon Diggs, confirming weeks of speculation about her personal life. She said the baby is due before the start of her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cardi-b-reveals-shes-expecting-baby-with-stefon-diggs-reflects-on-falling-in-love-again/\">Cardi B reveals she’s expecting baby with Stefon Diggs, reflects on falling in love again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zimbabwe agrees $455 million power plant refurbishment deal with Jindal",
            "url": "https://www.newzimbabwe.com/zimbabwe-agrees-455-million-power-plant-refurbishment-deal-with-jindal/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>Reuters Zimbabwe has agreed a $455 million, 15-year concession deal with the Africa-focused unit of India’s Jindal Steel (JINT.NS), for the refurbishment of a 920 megawatt coal-fired power plant, the energy minister said. The work on six ageing units at the Hwange thermal power station is expected to take four years, July Moyo said during a post-cabinet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agrees-455-million-power-plant-refurbishment-deal-with-jindal/\">Zimbabwe agrees $455 million power plant refurbishment deal with Jindal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine",
            "url": "https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/",
            "content": "By Darlington Gatsi\n\nPRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs.\n\nThe judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of the Chinese nationals.\n\nWe call through you, Madam Speaker, for an appeal of the recent judgement of foreign nationals who were fined US$150 for being arrested in possession of dangerous drugs. We further propose the immediate deportation of these foreign nationals, who are bad apples amongst us, said Tendai Pinduka, a ZANU PF MP.\n\nHarare magistrate Vakayi Chikwekwe ruled that the quantity of cocaine the nine Chinese nationals were in possession of was insignificant.\n\nThe leniency of the judgement has been widely criticised, with the Zimbabwean government accused of being too soft on the Chinese, with whom it maintains a strong relationship.\n\nBy comparison, being found in possession of drugs in China is met with far harsher punishment, in some cases, a death penalty.\n\nThe judgement has been viewed as a mere slap on the wrist and one that undermines the governments stance on fighting drug abuse in communities.\n\nSurprisingly, foreign nationals were recently found in possession of dangerous drugs and cocaine, arrested, and fined a paltry US$150, which in our view is not deterrent enough. It further undermines the authority of His Excellency the President, Dr E.D. Mnangagwa, in combating the menace and scourge of drugs and substance abuse, said Pinduka.\n\nChinese nationals have been accused of committing crimes and escaping harsh sentences by leveraging their all-weather friendship with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26021333/new-parliament-16-1024x637-1.png",
            "description": "<p>By Darlington Gatsi PRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs. The judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/\">Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Maningi Queens FC quits Women’s Premier Soccer League over alleged FIFA grant fraud",
            "url": "https://www.newzimbabwe.com/maningi-queens-fc-quits-womens-premier-soccer-league-over-alleged-fifa-grant-fraud/",
            "content": "By Sports Reporter\n\nManingi Queens FC has pulled out of the Zimbabwe Womens Premier Soccer League (ZWPSL), citing alleged fraud involving FIFA and CAF womens football grants.\n\nNewZimbabwe.com has it on good authority that the club, on September 15, formally wrote to the league executive notifying them of its decision to withdraw.\n\nIn its letter, the club raised several grievances, including the diversion of FIFA and CAF grants meant for womens football to mens football activities, lack of legal action on player development and training compensation by bigger teams that poach players, as well as unaffordable referees fees in a league with no sponsorship.\n\nThe club further alleged that ZIFA administrators were being bribed to corruptly clear players for bigger clubs at the expense of teams investing in development.\n\nConfirming the withdrawal Tuesday evening, the ZWPSL applauded Maningi Queens for their significant contribution to the growth of womens football despite their decision to exit.\n\nThe league acknowledges the concerns raised by the club and respects their decision to withdraw.\n\nThe ZWPSL extends its heartfelt gratitude to Maningi Youth Soccer Academy for their substantial contributions to the advancement of womens soccer.\n\nZWPSL remains committed to promoting a competitive and vibrant womens game and looks forward to continuing to work with stakeholders to advance womens football in Zimbabwe, read part of the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17162039/maningi-queens.jpg",
            "description": "<p>By Sports Reporter Maningi Queens FC has pulled out of the Zimbabwe Women’s Premier Soccer League (ZWPSL), citing alleged fraud involving FIFA and CAF women’s football grants. NewZimbabwe.com has it on good authority that the club, on September 15, formally wrote to the league executive notifying them of its decision to withdraw. In its letter,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maningi-queens-fc-quits-womens-premier-soccer-league-over-alleged-fifa-grant-fraud/\">Maningi Queens FC quits Women’s Premier Soccer League over alleged FIFA grant fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Parliament: Justice advocate pushes for mandatory DNA testing in maintenance cases",
            "url": "https://www.newzimbabwe.com/parliament-justice-advocate-pushes-for-mandatory-dna-testing-in-maintenance-cases/",
            "content": "By Anna Chibamu\n\nKadoma-based entrepreneur and litigation expert, Believe Guta, has petitioned Parliament, calling for mandatory DNA testing inmaintenance cases, saying no man should face jail for defaulting on child support before paternity is proven.\n\nAppearing before the Justice and Legal Parliamentary Portfolio Committee, chaired by Masvingo Central MP Edson Zvobgo (Jnr) on Tuesday, Guta urged lawmakers to amend Section 23 of the Maintenance Act [Chapter 5:09] to require confirmation of biological parentage before prosecution.\n\nHe argued that many men in Zimbabwe had been jailed for defaulting on maintenance orders only to later discover through DNA tests that they were not the biological fathers of the children in question.\n\nSection 49(1)(a) of the Constitution guarantees the right to personal liberty, which should not be arbitrarily deprived, Guta said. Yet under the current law, numerous men have been imprisoned in circumstances where paternity was disputed or later disproved.\n\nBelieve Guta\n\nFounder of Big Brains Legal Aid Trust, Guta said the current system had caused irreparable harm, including loss of liberty, reputational damage, and psychological trauma.\n\nThere is no ministry responsible for men, yet we have one for Womens Affairs. The plight of men has been neglected. Many are suffering in silence, he told the committee.\n\nHe proposed the insertion of a new subsection to the Maintenance Act: No proceedings shall be instituted unless the paternity of the child has been established by voluntary acknowledgement, court declaration, or DNA testing where paternity is disputed.\n\nGuta further suggested that Parliament introduce a statutory review mechanism to reassess past cases where men were imprisoned without conclusive proof of paternity.\n\nCiting statistics, he said the African Institute of Bio-Medical Research found that 32% of maintenance-related disputes in 2019 revealed non-biological fathers, while Global DNAs data indicated up to 72% exclusion rates in tested cases\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/19163303/DNA-test.jpg",
            "description": "<p>By Anna Chibamu Kadoma-based entrepreneur and litigation expert, Believe Guta, has petitioned Parliament, calling for mandatory DNA testing in maintenance cases, saying no man should face jail for defaulting on child support before paternity is proven. Appearing before the Justice and Legal Parliamentary Portfolio Committee, chaired by Masvingo Central MP Edson Zvobgo (Jnr) on Tuesday, Guta</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-justice-advocate-pushes-for-mandatory-dna-testing-in-maintenance-cases/\">Parliament: Justice advocate pushes for mandatory DNA testing in maintenance cases</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "17 Sep 2025"
        },
        {
            "title": "Mufakose residents forced to vacate homes as raw sewage floods yards",
            "url": "https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/",
            "content": "By Darlington Gatsi\n\nFRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges.\n\nMufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation.\n\nCombined Harare Residents Association (CHRA) blasted the lackadaisical approach by the city fathers in addressing the plight of Mufakose residents.\n\nThe City of Harare has been reluctant to resolve the issue, and the residents continue to be affected since registering their first complaint with the Mufakose District office a month ago.\n\nThe situation is dire to the extent that some residents have since vacated their houses following the flow and flooding of their houses with raw sewerage.\n\nUnfortunately, residents have now resorted to open defecation in bushes as an alternative, since their toilets and bathrooms are no longer accessible due to sewer flooding and gushing from toilets, said CHRA in a statement.\n\nThis comes amid reports that Harare City Council employees are on strike, having declared incapacitation following the deaths of colleagues.\n\nHarare residents have been made to endure the city fathers failure to deliver services to the capitals populace.\n\nThe CHRA said the situation is a ticking time bomb that might cause disease outbreaks in the high-density area of Mufakose.\n\nFormal and informal complaints have been made to the local City of Harare District Officer but have yielded no result in addressing the sewerage bursts/blockages.\n\nWe are of the view that the following rights provided in Chapter 4 of the Constitution of Zimbabwe are being infringed or being violated;\n\nSection 73(1) Right to an environment that is not harmful to health or wellbeing; the magnitude of the sewerage bursts are exposing residents to waterborne diseases, and so far residents who reside in Nondo Street have been complaining of stomach pains and diarrhoea and the epicentre of the diarrhoea cases is Nondo Street.\n\nHouses are no longer habitable and at No 18 and 16 Nondo Street residents have evacuated from their houses, and the houses are no longer occupied due to the flooding of the sewer in the houses and yards. In addition, the stench coming out from the sewer is choking, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16215440/mufakose.jpeg",
            "description": "<p> By Darlington Gatsi FRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges. Mufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation. Combined Harare Residents Association (CHRA) blasted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/\">Mufakose residents forced to vacate homes as raw sewage floods yards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "17 Sep 2025"
        }
    ]
}