{
    "news": [
        {
            "title": "Zanu PF wins Gutu East, Insiza North by-elections",
            "url": "https://www.newzimbabwe.com/zanu-pf-wins-gutu-east-insiza-north-by-elections/",
            "content": "By Staff Reporter\n\nTHE ruling party, Zanu PF, has won two parliamentary seats in by-elections held in Insiza North and Gutu East over the weekend.\n\nAccording to results announced by the Zimbabwe Electoral Commission (ZEC), in Insiza North, Zanu PFs Delani Moyo secured victory after polling 7,171 votes, defeating independent candidate Leslie Dube, who garnered 1,974 votes.\n\nThe seat became vacant following the death of Farai Taruvinga, who had served as the MP since 2018 on a Zanu PF ticket.\n\nZECs Insiza North constituency elections officer, Dube Iwani Zelembu, who presided over the election, confirmed the poll results.\n\nI, Dube Iwani Zelembu, being the constituency elections officer for Insiza North constituency, do hereby declare that I have, in accordance with the Electoral Act Chapter 2:13 and the regulations made thereunder, ascertained the result of the said constituency.\n\nThe votes were as follows: Dube Leslie (Independent candidate)  1,187 votes; Mlotshwana Thabani (ZAPU Party)  114 votes; Moyo Delani (Zanu PF Party)  7,171 votes; and Moyo Mbongeni (ZNRP Party)  131 votes.\n\nI do hereby declare the said Moyo Delani this day to be duly elected Member of the National Assembly for the Insiza North Constituency, said Zelembu.\n\nMeanwhile, Gutu East constituency also held by-elections on the same day, where Zvarevashe Masvingise of the Zanu PF party won with 9,321 votes.\n\nIndependent candidate Gift Gonese received 2,269 votes, while Zivanai Nzvenga of the NCA Party scrapped a paltry 173 votes.\n\nThe Gutu East seat became vacant following the expulsion of the former Member of Parliament, Benjamin Ganyiwa, from Zanu PF.\n\nThe opposition Citizens Coalition for Change (CCC) party boycotted the elections in both the Insiza North and Gutu East constituencies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/19035604/Zanu-PF-supporters.png",
            "description": "<p>By Staff Reporter THE ruling party, Zanu PF, has won two parliamentary seats in by-elections held in Insiza North and Gutu East over the weekend. According to results announced by the Zimbabwe Electoral Commission (ZEC), in Insiza North, Zanu PF’s Delani Moyo secured victory after polling 7,171 votes, defeating independent candidate Leslie Dube, who garnered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-wins-gutu-east-insiza-north-by-elections/\">Zanu PF wins Gutu East, Insiza North by-elections</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "15 Jun 2025"
        },
        {
            "title": "A year later, Information minister belatedly appoints ZBC board",
            "url": "https://www.newzimbabwe.com/a-year-later-information-minister-belatedly-appoints-zbc-board/",
            "content": "By Staff Reporter\n\nINFORMATION, Publicity and Broadcasting Services Minister Jenfan Muswere has finally officially appointed the Zimbabwe Broadcasting Corporation (ZBC) board, a year after some of its members started work.\n\nThe 13-member board, chaired by Helliate Rushwaya, was curiously endorsed through a Government Gazette notice issued on Friday, June 13, 2025, more than a year after some of its appointees were named in January 2024.Come July lastyear, Muswere made four additional appointments to the board of the troubled State broadcaster before making further appointments February 2025. Respected lawyer Lewis Uriri, earlier appointed to the structure, quit over unspecified reasons.Information Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nThe 13-member board, chaired by Helliate Rushwaya, was curiously endorsed through a Government Gazette notice issued on Friday, June 13, 2025, more than a year after some of its appointees were named in January 2024.\n\nCome July lastyear, Muswere made four additional appointments to the board of the troubled State broadcaster before making further appointments February 2025. Respected lawyer Lewis Uriri, earlier appointed to the structure, quit over unspecified reasons.Information Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nCome July lastyear, Muswere made four additional appointments to the board of the troubled State broadcaster before making further appointments February 2025. Respected lawyer Lewis Uriri, earlier appointed to the structure, quit over unspecified reasons.\n\nInformation Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nInformation Permanent Secretary Nick Mangwana announced the ZBC appointments, done in accordance with the Public Entities Corporate Governance Act Chapter 10:31, through the gazette on Friday.\n\nIt is hereby notified that the Minister of Information, Publicity and Broadcasting Services has, in terms of section 11(13) of the Public Entities Corporate Governance Act (Chapter 10:31), appointed the persons specified in the Schedule as members of the Zimbabwe Broadcasting Corporation Board, for a period of four (4) years, reads the notice.The new ZBC board chair Rushwaya will be deputised by Advocate Tapson Dzvetero while other members are Chipo Nheta, Henry Mukono, Nannette Silukhuni, Charles Munganasa, Precious Charandura, Thandolwenkosi Nkomo, Sibongile Mpofu, Queen Mpofu and Among Craig Matambo.\n\nIt is hereby notified that the Minister of Information, Publicity and Broadcasting Services has, in terms of section 11(13) of the Public Entities Corporate Governance Act (Chapter 10:31), appointed the persons specified in the Schedule as members of the Zimbabwe Broadcasting Corporation Board, for a period of four (4) years, reads the notice.\n\nThe new ZBC board chair Rushwaya will be deputised by Advocate Tapson Dzvetero while other members are Chipo Nheta, Henry Mukono, Nannette Silukhuni, Charles Munganasa, Precious Charandura, Thandolwenkosi Nkomo, Sibongile Mpofu, Queen Mpofu and Among Craig Matambo.\n\nThe new ZBC board chair Rushwaya will be deputised by Advocate Tapson Dzvetero while other members are Chipo Nheta, Henry Mukono, Nannette Silukhuni, Charles Munganasa, Precious Charandura, Thandolwenkosi Nkomo, Sibongile Mpofu, Queen Mpofu and Among Craig Matambo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/20174306/ZBC.jpg",
            "description": "<p>By Staff Reporter   INFORMATION, Publicity and Broadcasting Services Minister Jenfan Muswere has finally officially appointed the Zimbabwe Broadcasting Corporation (ZBC) board, a year after some of its members started work. The 13-member board, chaired by Helliate Rushwaya, was curiously endorsed through a Government Gazette notice issued on Friday, June 13, 2025, more than a year</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-year-later-information-minister-belatedly-appoints-zbc-board/\">A year later, Information minister belatedly appoints ZBC board</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "15 Jun 2025"
        },
        {
            "title": "Orlando Pirates to pay R15 million for Zimbabwean football sensation as European club shows interest",
            "url": "https://www.newzimbabwe.com/orlando-pirates-to-pay-r15-million-for-zimbabwean-football-sensation-as-european-club-shows-interest/",
            "content": "By James Muonwa\n\nHIGHLANDERS Football Club could soon be pocketing hefty transfer fees for its prodigy Prince Ndlovu after South African premiership side Orlando Pirates expressed interest in the player.\n\nAccording to recent media reports coming from across the Limpopo, Pirates are racing against European interest to sign Ndlovu, with his club demanding a record-breaking R15m.\n\nOrlando Pirates lead the local charge, but theyre not alone. Zimbabwes brightest football talent has sparked a bidding war as Highlanders FC demand a jaw-dropping R15 million for teenage winger Prince Ndlovu The move has sent shockwaves through South African football circles, an SA publication wrote.\n\nNdlovu, often referred to as the next Peter Ndlovu, has long attracted interest from top clubs, having previously trained with the Buccaneers in Houghton before a failed European stint. Now, with his stock soaring, Highlanders are playing hardball.\n\nHighlanders FC value Prince (Ndlovu) and thats why they are pricing him at around R15 million. The club believe its a fair price looking at his talent, quality and future ahead of him, a club official said, as quoted by Soccer Laduma.\n\nHighlanders play the long game as bids loom\n\nThe Bulawayo giants arent rushing to cash in. Their valuation isnt just based on local interest, its also shaped by serious attention from abroad.\n\nApart from Orlando Pirates there is a European club that has been monitoring him for some time now. Its Sturm Graz from the Austria Bundesliga, a source revealed.\n\nThis European connection could tip the scale and inflate the price further.\n\nA R15 million fee would rank among the highest for any player moving directly from the Zimbabwe Premier Soccer League. Its a bold statement from Highlanders, and a sign of just how highly they rate the 19-year-old winger.\n\nNdlovu was recently donning national colours at the COSAFA Cup in Bloemfontein, offering football scouts from across the continent a front-row seat to evaluate his explosive potential. Pirates are believed to have sent representatives to monitor him closely.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/15033221/Prince-Ndlovu-at-Highlanders-FC-Image-via-%40HighlandersFC-on-X-e1749556433910-750x520-1.webp",
            "description": "<p>By James Muonwa  HIGHLANDERS Football Club could soon be pocketing hefty transfer fees for its prodigy Prince Ndlovu after South African premiership side Orlando Pirates expressed interest in the player. According to recent media reports coming from across the Limpopo, Pirates are racing against European interest to sign Ndlovu, with his club demanding a record-breaking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/orlando-pirates-to-pay-r15-million-for-zimbabwean-football-sensation-as-european-club-shows-interest/\">Orlando Pirates to pay R15 million for Zimbabwean football sensation as European club shows interest </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "15 Jun 2025"
        },
        {
            "title": "Human rights violations ease in May; Zanu PF still tops perpetrators’ list— Report",
            "url": "https://www.newzimbabwe.com/human-rights-violations-ease-in-may-zanu-pf-still-tops-perpetrators-list-report/",
            "content": "By Costa Nkomo\n\nTHE Zimbabwe Peace Project (ZPP) reports a slight improvement in the countrys human rights situation, with violations dropping by 10 percent in May 2025 compared to April 2025.\n\nIn a report released Saturday, the human rights watchdog documented 83 human rights violations across various areas, including during government-led food aid distribution, instances of political harassment, and restrictions on freedom of assembly and expression.\n\nIn May 2025, the Zimbabwe Peace Project recorded a total of 83 human rights violations affecting 5,376 victims nationwide, a 10% decline from the violations recorded in May where 6,059 people were affected, part of the report reads.\n\nThese violations included breaches of personal security, acts of intimidation and harassment, assault, political discrimination in the distribution of government-sponsored food aid, restrictions on freedoms of expression, assembly, and association, as well as limited access to social services.\n\nOther incidents included unjustified arrests, unlawful evictions, malicious damage to property, inhumane and degrading treatment, and restricted access to information.\n\nFor the second consecutive month, ZanuPF has been identified as the primary perpetrator of violence, followed by the Zimbabwe Republic Police (ZRP).\n\nOf the 5,376 people affected, 3,107 were female and 2,269 were male.\n\nThe report detailed some of the alleged perpetrators.\n\nAmong the perpetrators, those affiliated with the ruling party, Zanu PF, accounted for 35.38%, followed by members of the Zimbabwe Republic Police (ZRP) at 13.77%.Other violators included local authorities (16.53%), government officials (11.44%), artisanal miners (5.93%), traditional leaders (6.14%), members of the MDC-Alliance (0.64%) and unaffiliated individuals (6.36%).Worryingly, members of the Zimbabwe National Army (ZNA) are also implicated, accounting for 0.21% of reported violations.The report highlights that other State security actors, particularly those mandated to protect the public, continue to feature prominently among perpetrators of human rights violations.Despite these concerns, the ZPP expresses cautious optimism about the potential for future improvements.It welcomed and embraced the opportunity to engage with the Zimbabwe Independent Complaints Commission (ZICC) through its goodwill ambassador to promote a rights-based, accountable approach in security operations.We are hopeful that other implicated institutions will be open to such engagements, paving the way for lasting solutions to end impunity and foster sustainable peace in Zimbabwe, the report adds.Geographically, Masvingo and Harare provinces recorded the highest number of violations in May, with 13 each.Midlands followed closely with 12 violations, while Manicaland and Mashonaland West each documented 10.Mashonaland Central experienced a significant decline, from 13 violations the previous month to just four in May.Mashonaland East recorded nine violations, while both Matabeleland North and South recorded six breaches each.ZPP commended the Zimbabwe Human Rights Commission (ZHRC) for highlighting urgent issues needing government action, including collapsing public services, a shrinking civic space, and restrictive conditions.\n\nAmong the perpetrators, those affiliated with the ruling party, Zanu PF, accounted for 35.38%, followed by members of the Zimbabwe Republic Police (ZRP) at 13.77%.\n\nOther violators included local authorities (16.53%), government officials (11.44%), artisanal miners (5.93%), traditional leaders (6.14%), members of the MDC-Alliance (0.64%) and unaffiliated individuals (6.36%).Worryingly, members of the Zimbabwe National Army (ZNA) are also implicated, accounting for 0.21% of reported violations.The report highlights that other State security actors, particularly those mandated to protect the public, continue to feature prominently among perpetrators of human rights violations.Despite these concerns, the ZPP expresses cautious optimism about the potential for future improvements.It welcomed and embraced the opportunity to engage with the Zimbabwe Independent Complaints Commission (ZICC) through its goodwill ambassador to promote a rights-based, accountable approach in security operations.We are hopeful that other implicated institutions will be open to such engagements, paving the way for lasting solutions to end impunity and foster sustainable peace in Zimbabwe, the report adds.Geographically, Masvingo and Harare provinces recorded the highest number of violations in May, with 13 each.Midlands followed closely with 12 violations, while Manicaland and Mashonaland West each documented 10.Mashonaland Central experienced a significant decline, from 13 violations the previous month to just four in May.Mashonaland East recorded nine violations, while both Matabeleland North and South recorded six breaches each.ZPP commended the Zimbabwe Human Rights Commission (ZHRC) for highlighting urgent issues needing government action, including collapsing public services, a shrinking civic space, and restrictive conditions.\n\nOther violators included local authorities (16.53%), government officials (11.44%), artisanal miners (5.93%), traditional leaders (6.14%), members of the MDC-Alliance (0.64%) and unaffiliated individuals (6.36%).\n\nWorryingly, members of the Zimbabwe National Army (ZNA) are also implicated, accounting for 0.21% of reported violations.\n\nThe report highlights that other State security actors, particularly those mandated to protect the public, continue to feature prominently among perpetrators of human rights violations.\n\nDespite these concerns, the ZPP expresses cautious optimism about the potential for future improvements.\n\nIt welcomed and embraced the opportunity to engage with the Zimbabwe Independent Complaints Commission (ZICC) through its goodwill ambassador to promote a rights-based, accountable approach in security operations.\n\nWe are hopeful that other implicated institutions will be open to such engagements, paving the way for lasting solutions to end impunity and foster sustainable peace in Zimbabwe, the report adds.\n\nGeographically, Masvingo and Harare provinces recorded the highest number of violations in May, with 13 each.\n\nMidlands followed closely with 12 violations, while Manicaland and Mashonaland West each documented 10.\n\nMashonaland Central experienced a significant decline, from 13 violations the previous month to just four in May.\n\nMashonaland East recorded nine violations, while both Matabeleland North and South recorded six breaches each.\n\nZPP commended the Zimbabwe Human Rights Commission (ZHRC) for highlighting urgent issues needing government action, including collapsing public services, a shrinking civic space, and restrictive conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/08072200/PF-Zanu.jpg",
            "description": "<p>By Costa Nkomo THE Zimbabwe Peace Project (ZPP) reports a slight improvement in the country’s human rights situation, with violations dropping by 10 percent in May 2025 compared to April 2025. In a report released Saturday, the human rights watchdog documented 83 human rights violations across various areas, including during government-led food aid distribution, instances</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/human-rights-violations-ease-in-may-zanu-pf-still-tops-perpetrators-list-report/\">Human rights violations ease in May; Zanu PF still tops perpetrators’ list— Report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:28",
            "date": "15 Jun 2025"
        }
    ]
}