{
    "news": [
        {
            "title": "Cameroon opposition leader to face legal action over election unrest, government says",
            "url": "https://www.newzimbabwe.com/cameroon-opposition-leader-to-face-legal-action-over-election-unrest-government-says/",
            "content": "BBC\n\nCameroons Interior Minister Paul Atanga Nji says opposition leader Issa Tchiroma Bakary will face legal action over allegations he incited violent post-election demonstrations.\n\nAt least four protesters have been killed during clashes between security forces and opposition supporters since Cameroons election on 12 October, with92-year-old President Paul Biyawinning an eighth consecutive term.\n\nTchiroma Bakary insists he won the election, a claim dismissed by Biyas ruling party, the Cameroon Peoples Democratic Movement (CPDM).\n\nViolent crackdowns by police and security officers on protesters have alarmed the international community, with the UN, African Union and EU calling for restraint.\n\nOn Tuesday, Nji accused Tchiroma Bakary of organising what he said were illegal protests leading to the loss of lives, and also criticised him for declaring victory in the election.\n\nHe added that Tchiroma Bakarys accomplices responsible for an insurrectionary plan will also face legal action.\n\nPaul Biya, who came to power in 1982 and is now the worlds oldest head of state, won the 12 October election with 53.7% of the vote, compared to 35.2% for Tchiroma Bakary, according to Cameroons Constitutional Council.\n\nTchiroma Bakary is yet to respond to the governments decision to try him, but he had previously told the BBC thathe would not accept a stolen vote and that he was not afraid of being arrested.\n\nOn election result day, he said armed men opened fire on protesters assembled near his residence in Garoua, fatally wounding at least two civilians.\n\nOn Tuesday, the interior minister revealed that an investigation would be launched into violent incidents before and after the announcement of the election results.\n\nDuring these attacks, some of the criminals lost their lives, he said, without providing a specific number of protesters who have been killed in the clashes.\n\nNji added that several members of the security forces also sustained serious injuries.\n\nAlthough Nji insisted the situation nationwide was now under control, protesters remain active in some parts of the country, especially in Douala and Garoua, where demonstrators mounted roadblocks on Tuesday, and burnt tyres on the streets.\n\nAnalysts warn the post-electoral violence could plunge the country into a political crisis.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/29045337/AFP-via-Getty-Images-Many-in-Cameroon-are-furious-that-Paul-Biya-has-won-an-eighth-term-as-president.webp",
            "description": "<p>BBC Cameroon’s Interior Minister Paul Atanga Nji says opposition leader Issa Tchiroma Bakary will face legal action over allegations he incited “violent post-election demonstrations”. At least four protesters have been killed during clashes between security forces and opposition supporters since Cameroon’s election on 12 October, with 92-year-old President Paul Biya winning an eighth consecutive term. Tchiroma Bakary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cameroon-opposition-leader-to-face-legal-action-over-election-unrest-government-says/\">Cameroon opposition leader to face legal action over election unrest, government says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mines and Minerals Bill to be finalised during current Parliamentary session",
            "url": "https://www.newzimbabwe.com/mines-and-minerals-bill-to-be-finalised-during-current-parliamentary-session/",
            "content": "By Alois Vinga\n\nPresident Emmerson Mnangagwa on Tuesday reaffirmed his governments commitment to finalising the Mines and Minerals Bill during the current session of Parliament.\n\nThe government gazetted the Bill in June this year, bringing relief to communities that have long endured hardships caused by mining-related activities.\n\nAmong other provisions, the Bill seeks to replace the Mines and Minerals Act (Chapter 21:05) of 1961, establish a Mining Affairs Board to guide decision-making processes, and introduce clearer rules on the management of mining titles, particularly with regard to the cadastre system and exploration rights.\n\nOnce enacted, the legislation is expected to strengthen environmental compliance and land rehabilitation obligations, enhance governance through transparency and accountability mechanisms in the allocation of mining rights, and define and protect community rights, including benefit-sharing and land access protocols.\n\nResponding to long-standing calls from organisations such as Silveira House, which has worked tirelessly to promote human rights in mining communities, Mnangagwa reassured the nation of the Bills expeditious finalisation.\n\nThe Mines and Minerals Amendment Bill has been gazetted and is expected to be finalised during the current session of Parliament. My Government is committed to weeding out irresponsible mining stakeholders who cause pollution, environmental degradation, and damage to critical infrastructure.\n\nAs we welcome investors into our jurisdiction, we expect them to adhere to the Constitution and laws of our country, while also respecting our people, customs, and culture, he said.\n\nHowever, citizens have urged the government to make the Mines and Minerals Bill available in vernacular languages to ensure easier understanding and interpretation, especially within mining communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>By Alois Vinga President Emmerson Mnangagwa on Tuesday reaffirmed his government’s commitment to finalising the Mines and Minerals Bill during the current session of Parliament. The government gazetted the Bill in June this year, bringing relief to communities that have long endured hardships caused by mining-related activities. Among other provisions, the Bill seeks to replace</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mines-and-minerals-bill-to-be-finalised-during-current-parliamentary-session/\">Mines and Minerals Bill to be finalised during current Parliamentary session</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        },
        {
            "title": "It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa",
            "url": "https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/",
            "content": " claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga\n\nBy Leopold Munhende\n\nZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed.\n\nSpeaking to journalist Violet Gonda, Mliswa likened Tagwireis fast-track promotion to opposition leader Nelson Chamisa, describing it in similar terms that were used when the latter took over after the passing of pro-democracy icon Morgan Tsvangirai a generational consensus.\n\nAn ongoing factional fight within Zanu PF has pitted President Emmerson Mnangagwas deputy, Constantino Chiwenga with Tagwirei.\n\nThe two are in a race to succeed Mnangagwa, either in 2028 or beyond, if his term is illegally extended as is being rallied for by sections in the party.\n\nThat Tagwirei has become a strong contender is no longer secret, even hardline critics of the businessman such as Zanu PF spokesperson Christopher Mutsvangwa, have changed their stance.\n\nMliswa said it was time senior party members allowed younger members to take over.\n\nIt is a generational consensus just like when we had national consensus in making sure that people marched (in 2017). It is the generational consensus that Tagwirei must make it because he is young, said Mliswa.\n\nWe have given our liberators time to liberate us from an economic point of view but they have not done what we expected them to do, they have done their best but it is about time that we took over.\n\nWe do not have liberation history but we have economic ability to be able to transform the country and equally transform its fortunes.\n\nMliswa, who was fired from Zanu PF in 2015, has emerged as one of Tagwireis fervent supporters, frequently laying into Chiwenga.\n\nChiwenga is pushing for Tagwireis arrest on a string of corruption allegations. His attempts to get the partys stamp, however, fell by the wayside as he was advised to report all of the alleged graft to Zimbabwe Anti-Corruption Commission (ZACC) or the police.\n\nTagwireis meteoric rise is being supported by claims that he financed the 2017 coup that toppled late leader Robert Mugabe and governments agriculture programme, Command Agriculture.\n\nAdded Mliswa: It is a generational consensus which you cannot stop.\n\nThat is the reason why the opposition moved from the late Morgan Tsvangirai to Nelson Chamisa. Now Zanu PF has moved to Tagwirei.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>–  claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga By Leopold Munhende ZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed. Speaking to journalist Violet Gonda, Mliswa likened Tagwirei’s fast-track promotion to opposition leader Nelson Chamisa, describing it in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/\">It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        },
        {
            "title": "Chipezeze the hero as Magesi falls to Orlando Pirates",
            "url": "https://www.newzimbabwe.com/chipezeze-the-hero-as-magesi-falls-to-orlando-pirates/",
            "content": "By Sports Reporter\n\nWarriors goalkeeper Elvis Chipezeze was the standout performer for Magesi FC on Tuesday evening, earning the Man of the Match award despite his teams 2-1 loss to Orlando Pirates in the Carling Knockout Tournament quarter-finals.\n\nThe defeat saw Magesi crash out of the competition, ending their hopes of defending the title they won last year.\n\nAlthough his side lost, Chipezeze kept Magesi in contention throughout the first half, pulling off several crucial saves to deny Pirates at least three clear chances, ensuring the match remained goalless at halftime.\n\nThe Zimbabwean shot-stopper was eventually beaten five minutes into the second half by Thapelo Morena, who fired a powerful long-range strike to give Pirates the lead.\n\nChipezeze continued to frustrate the Buccaneers, producing another stunning save in the 60th minute to keep his team in the game. However, Pirates eventually doubled their lead in the 87th minute through Evidence Makgopa to make it 2-0.\n\nMagesi managed to pull one back in stoppage time, but it was too late to change the outcome.\n\nAfter the match, Chipezeze was voted Man of the Match and walked away with R100,000 in prize money.\n\nTuesdays accolade marks his second Man of the Match award this season in the tournament, and his sixth overall, including last seasons campaign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28193935/chipezeze.jpeg",
            "description": "<p>By Sports Reporter Warriors goalkeeper Elvis Chipezeze was the standout performer for Magesi FC on Tuesday evening, earning the Man of the Match award despite his team’s 2-1 loss to Orlando Pirates in the Carling Knockout Tournament quarter-finals. The defeat saw Magesi crash out of the competition, ending their hopes of defending the title they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chipezeze-the-hero-as-magesi-falls-to-orlando-pirates/\">Chipezeze the hero as Magesi falls to Orlando Pirates</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mnangagwa warns foreign investors over pollution, labour abuses",
            "url": "https://www.newzimbabwe.com/mnangagwa-warns-foreign-investors-over-pollution-labour-abuses/",
            "content": "By Anna Chibamu\n\nPresident Emmerson Mnangagwa has issued a stern warning to foreign investors, particularly those in the mining sector, adding that government is finalising measures to hold polluters and labour rights violators accountable.\n\nDelivering his State of the Nation Address (SONA) at the new Parliament Building in Mt Hampden on Tuesday, Mnangagwa said authorities will no longer tolerate companies that exploit workers or degrade the environment.\n\nWe expect that they will adhere to the Constitution and laws of our country while respecting our people and our culture, Mnangagwa said.\n\nHis remarks come amid growing public outrage over the conduct of some foreign-owned mining firms, especially from China, accused of flouting labour laws, underpaying local workers, and causing extensive environmental damage.\n\nIn recent years, Zimbabwes investment drive has drawn criticism from communities who say many investors operate with impunity, polluting rivers, creating unsafe working conditions, and offering little benefit to surrounding areas.\n\nMnangagwas warning signals mounting government pressure on errant investors amid increasing calls for tighter regulation and enforcement in the mining sector, a key pillar of Zimbabwes struggling economy.\n\nMeanwhile, the President said the long-awaited Mines and Minerals Amendment Bill should be completed during the third session of the 10th Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164746/Mnangagwa-SONA.jpg",
            "description": "<p>By Anna Chibamu President Emmerson Mnangagwa has issued a stern warning to foreign investors, particularly those in the mining sector, adding that government is finalising measures to hold polluters and labour rights violators accountable. Delivering his State of the Nation Address (SONA) at the new Parliament Building in Mt Hampden on Tuesday, Mnangagwa said authorities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-warns-foreign-investors-over-pollution-labour-abuses/\">Mnangagwa warns foreign investors over pollution, labour abuses</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        },
        {
            "title": "Diaspora Insurance HQ opens its arms to all Africans abroad",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-hq-opens-its-arms-to-all-africans-abroad/",
            "content": "By Own Correspondent\n\nDiaspora Insurance proudly hosted an exclusive Zamalawi Pre-Event Show at its vibrant Birmingham headquarters, theDiaspora InsuranceHouse, to celebrate African unity and identity whilst reinforcing its role as a home for Africans living abroad.\n\nOrganised by Lifetime Entertainment, the star-studded event brought together talented Zambian and Malawian musicians, meeting their fans and sponsors, creating an unforgettable celebration of African culture. The line-up included Trimple M, Danny Kaya, Yo Maps, Saint Realest, Chanda Na Kay, Zeze Kingston, Neo, Chile One, Namadingo, and Driemo.Diaspora Insurancebrand ambassador and celebrity musician Exq also attended, adding star power to the presser. Fans, community leaders, and artists from across Africa gathered in a cosy, intimate setting to witness the powerful connection of Africans in the diaspora.\n\nA Warm Welcome from Diaspora Insurance\n\nIn his heartfelt welcome remarks, Diaspora Insurance CEO Jeff Madzingo welcomed guests, reinforcing the companys mission of inclusivity and empowerment for Africans everywhere.\n\nThis is your home, said Madzingo.\n\nDiaspora Insurance House is not just our head office, it is a home that welcomes all Africans abroad and within the UK. Whether you are from Malawi, Zambia, Zimbabwe, South Africa, Nigeria, or any part of our beautiful continent, you belong here.\n\nBefore the meet-and-greet session with fans, the Zamalawi artists toured Diaspora Insurance House, exploring the companys operations and global reach. They were also hosted in the headquarters executive boardroom, where they engaged in professional discussions with staff on how culture and business can collaborate to uplift African communities abroad.\n\nCelebrating African Culture and Cuisine\n\nAfter meeting fans and completing the press conference formalities, the stars enjoyed a spread of traditional African cuisine and drinks, immersing themselves in the authentic tastes and warmth of home. The atmosphere was filled with laughter, music, and pride, reflectingDiaspora Insurancesmission of unity and cultural celebration.\n\nWith operations in 25 African countries,Diaspora Insurancecontinues to provide tailored financial solutions that empower Africans worldwide. Diaspora Insurance House has hosted numerous high-profile events, including appearances by South African singer Kelly Khumalo, Stewart Murisa during his book launch, Benjani Mwaruwari, ZIFA stakeholder engagements, and other cultural showcases. The success of the Zamalawi Pre-Event Show and sponsorship of the main event reaffirm thatDiaspora Insuranceis more than an insurance provider but a true home that opens its arms to all Africans abroad, uniting the continents heartbeat in the heart of Birmingham. With 14 years of solid operations and a track record of hosting stars from sports, music, and social influence, Diaspora Insurance proves it is a fully operational, reputable company with a physical and traceable location.\n\nInside view of the ZaMalawi pre-event press conference at Diaspora Insurance HQ, Birmingham\n\nKodak moment: Diaspora Insurance CEO Jeff Madzingo poses with Zambian superstar Tripple M during the pre-event press conference at Diaspora Insurance HQ\n\nDr. Sibert Mandega, Executive Director of Diaspora Insurance, engages with Malawian artist Saint at the ZaMalawi concert press conference held at Diaspora Insurance HQ in Birmingham.\n\nA star-studded lineup of ZaMalawi musicians gathered and relaxed inside the Diaspora Insurance HQ boardroom in Birmingham\n\nA star-studded lineup of ZaMalawi musicians gathered and relaxed inside the Diaspora Insurance HQ boardroom in Birmingham.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31170830/Diaspora-Insurance-House.png",
            "description": "<p>By Own Correspondent Diaspora Insurance proudly hosted an exclusive Zamalawi Pre-Event Show at its vibrant Birmingham headquarters, the Diaspora Insurance House, to celebrate African unity and identity whilst reinforcing its role as a home for Africans living abroad. Organised by Lifetime Entertainment, the star-studded event brought together talented Zambian and Malawian musicians, meeting their fans</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-hq-opens-its-arms-to-all-africans-abroad/\">Diaspora Insurance HQ opens its arms to all Africans abroad </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        },
        {
            "title": "Why Zimbabwe missed Africa’s top 100 banks list for the second year",
            "url": "https://www.newzimbabwe.com/why-zimbabwe-missed-africas-top-100-banks-list-for-the-second-year/",
            "content": "Finance in Africa\n\nZimbabwe is among the two African nations  alongside Zambia  that are again absent from the Top 100 African Banks 2025 list, according to African Business Magazine.\n\nTheannual ranking, which measures banks financial strengthbased on Tier 1 Capital  the sum of a banks core equity, reserves, and retained earnings  features banks from 20 African countries, including the Democratic Republic of Congo, Togo, Mozambique, Cte dIvoire, Angola, and Gabon.\n\nAccording to the London-based IC publication, Zimbabwes exclusion stems from years of economic shocks, hyperinflation, and currency instability that have eroded the balance sheets of local banks and diminished investor confidence.\n\nGrowth has been stronger since the COVID-19 pandemic, and the World Bank forecasts a 6% increase in GDP this year, so the countrys banks could re-enter our rankings if the economic environment continues to improve, African Business said. Sound government and governance will be key.\n\nDespite recent signs of recovery, Zimbabwes financial sector remains fragile. With a population of about 17 million, the country has faced some of the worlds highest inflation rates, a volatile exchange-rate regime, and frequent shifts in its monetary framework  from the launch of the ZiG (Zimbabwe Gold) currency in April 2024 to ongoing struggles with dollarisation.\n\nAlthough the World Bank classifies Zimbabwe as a lower-middle-income country, its economy continues to be constrained by policy inconsistencies, low foreign investment, and chronic power shortages.\n\nIn 2024, the Bank said GDP growth slowed to 1.7% largely due to drought-induced agricultural declines and energy supply disruptions.\n\nZimbabwe continues to be in debt distress, with high and unsustainable public debt that limits its access to international financing. Due to the accumulation of external arrears and legacy debts, total public debt reached $23.2 billion in 2024 (72.9% of GDP), the multilateral lender said in a recent report.\n\nThe country has been in non-accrual status to the World Bank since 2000 and is also in arrears to the African Development Bank and the European Investment Bank.\n\nBut last July, Finance Minister Mthuli Ncube projected that growth would rebound to around six percent in 2025, supported by improved crop yields and stronger commodity prices. However, according to International Monetary Fund data, inflation remains above 30%, while access to credit is still limited.\n\nThese structural weaknesses have made it difficult for Zimbabwean banks to meet the capitalisation thresholds required to compete with their peers across the continent.\n\nIn contrast, Mauritius has positioned itself as one of Africas leading financial centres. The government, through the Mauritius International Financial Centre, is leveraging the African Continental Free Trade Area (AfCFTA) to facilitate cross-border trade and attract regional investment.\n\nThe Mauritius Commercial Bank (MCB) remains the largest nonSouth African lender, with Tier 1 capital of $1.5 billion, up from $1.4 billion last year. Six Mauritian banks are now ranked among Africas top 20. Angola and Mozambique each contributed three banks, while Namibia had two.\n\nMCB operates across Kenya, Madagascar, Mozambique, Seychelles, and South Africa, and has expanded internationally to Dubai, France, and the Maldives.\n\nIt has also embraced technology by adopting a unified Temenos banking platform and introducing AI-driven credit scoring to strengthen lending and manage non-performing loans.\n\nSouth Africas financial giants once again dominate the Southern African rankings, occupying the top six positions. Despite the rise of digital-first banks, none have yet broken into the regional top 20.\n\nStandard Bank remains the largest lender in Africa, while Absa Bank recorded the highest growth in Tier 1 capital, rising from $4.7 billion in 2024 to $5.6 billion in 2025.\n\nThe combined capital of the top 20 banks in Southern Africa climbed from $37.4 billion to $40.4 billion over the past year, though growth was largely concentrated among the biggest players.\n\nIn West and Central Africa, total Tier 1 capital fell from $15.6 billion to $14.9 billion as lenders grappled with macroeconomic headwinds. Nigeria still dominates the region with 12 banks on the list, followed by Cte dIvoire (3), Ghana (2), and one each from Togo, Gabon, and the DRC.\n\nAccess Bank has overtaken FirstBank and now trails Zenith Bank, which ranks as the biggest lender in the region. Ecobank Transnational remains the largest non-Nigerian bank, followed by BGFI Gabon, whose Tier 1 capital surged to $1.3 billion from $844 million in 2024.\n\nAfrican Business noted that Nigerias banking sector continues to evolve through waves of consolidation driven by the Central Bank of Nigerias new capital requirements.\n\nIn March 2024, the CBN raised minimum capital thresholds to 500 billion ($333 million) for international banks, 200 billion ($134 million) for national banks, and 50 billion ($33 million) for regional and merchant banks.\n\nNorth Africa remains the continents most financially robust region, led by Egypt and Morocco.\n\nEgypts National Bank of Egypt tops the regional table with $7.3 billion in Tier 1 capital, followed by Moroccos Attijariwafa Bank ($6.2 billion), Banque Centrale Populaire ($5.2 billion), and Egypts Banque Misr ($4.8 billion).\n\nMoroccan banks continue to benefit from early expansion into sub-Saharan Africa, boosting profits and cross-border connections. BCP, which operates in 32 countries (18 in Africa), reported a 16.8% increase in half-year profit to 3.5 billion dirhams ($386 million) in 2025.\n\nKenya continues to drive East Africas banking growth, led by Equity Bank ($1.9 billion), KCB Group ($1.7 billion), and Co-operative Bank of Kenya ($927 million)  all ranking among the fastest-growing institutions by Tier 1 capital.\n\nEthiopia isalso emerging as a rising player, with six banks now in the East African top 20, following banking-sector liberalisation. The countrys rapid 9% annual economic growth and large population of 135 million position it for further expansion as deregulation opens space for domestic and foreign lenders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/19231739/RBZ-Zimbabwean-Banks.jpg",
            "description": "<p>Finance in Africa Zimbabwe is among the two African nations — alongside Zambia — that are again absent from the Top 100 African Banks 2025 list, according to African Business Magazine. The annual ranking, which measures banks’ financial strength based on Tier 1 Capital — the sum of a bank’s core equity, reserves, and retained earnings —</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-zimbabwe-missed-africas-top-100-banks-list-for-the-second-year/\">Why Zimbabwe missed Africa’s top 100 banks list for the second year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "29 Oct 2025"
        }
    ]
}