{
    "news": [
        {
            "title": "Tough economy forces NTS to delist from ZSE",
            "url": "https://www.newzimbabwe.com/tough-economy-forces-nts-to-delist-from-zse/",
            "content": "By Alois Vinga\n\nNATIONAL Tyre Services (NTS) has tabled plans to delist from the Zimbabwe Stock Exchange (ZSE) due to insignificant returns prompted by a tough economic environment and the influx of cheaper imports.\n\nIn a Circular to shareholders published this week, NTS said after a comprehensive review of the companys listing requirements, it was agreed that the benefits of maintaining the listing status no longer pay off as was the case in the previous years.\n\nThe company, which has been on the ZSE listing since 1969, is now seeking shareholder approval to green-light the move.\n\nThe operating environment has, however, been characterised by persistent macroeconomic instability over the past decades. The business has been adversely affected by severe exchange rate volatility, liquidity constraints and shortages of foreign currency, all of which have materially hindered the importation of tyres and raw materials, the company said.\n\nThe Zimbabwean tyre industry has, in recent years, experienced heightened competition due to low entry barriers and the influx of imported brands, resulting in a loss of market share for the company said limited access to long-term and affordable capital has also constrained the companys ability to execute its expansion strategy and maintain adequate working capital levels.\n\nDespite numerous efforts to secure funding through the local banking system, borrowing has remained prohibitively expensive. Operationally, NTS continues to face significant challenges, such as power supply deficits have disrupted production at the retreading factory, where capacity utilisation has averaged approximately 30%.\n\nIn conjunction with the proposed delisting, major shareholder Radun Investments (Private) Limited is extending a mandatory offer to acquire all shares held by minority shareholders. The offer is for a cash consideration of US$0.0248 per share. This provides a clear and structured opportunity for minority shareholders to exit their investment at a price deemed fair and reasonable by Independent Financial Advisors, said NTS.\n\nThe total indicative share trading liquidity for National Tyre Services Limited (NTS.zw) in the past 12 months, as of 1st October 2025, is US$1.06million (ZWG28.41million). An average of US$88,170 (ZWG2.37 million) per month.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/03/06063255/National-Tyre-service.png",
            "description": "<p>By Alois Vinga NATIONAL Tyre Services (NTS) has tabled plans to delist from the Zimbabwe Stock Exchange (ZSE) due to insignificant returns prompted by a tough economic environment and the influx of cheaper imports. In a Circular to shareholders published this week, NTS said after a comprehensive review of the company’s listing requirements, it was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tough-economy-forces-nts-to-delist-from-zse/\">Tough economy forces NTS to delist from ZSE</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        },
        {
            "title": "Underfire Tanzanian authorities deport human rights activist Vava",
            "url": "https://www.newzimbabwe.com/underfire-tanzanian-authorities-deport-human-rights-activist-vava/",
            "content": "By Staff Reporter\n\nPANICKY Tanzanian authorities have reportedly denied entry to Zimbabwean human rights activist Blessing Vava before deporting him, amid rising tensions following the countrys tumultuous presidential election.\n\nVava, the Director of the Crisis in Zimbabwe Coalition (CiZC), was barred from entering Tanzania and deported on Tuesday. He had travelled to meet with civil society organisations (CSOs) to discuss rights violations and to offer solidarity.\n\nCiZC described Vavas deportation as a barbaric act of repression.\n\nIn a statement, CiZC condemned the treatment of its director, describing it as an attack to human rights.\n\nWe are disturbed by the continued harassment and deportations of human rights defenders and election observers whose work is not criminal but aimed at promoting human rights, good governance and democracy, the statement read.\n\nCiZC criticised President Samia Suluhu Hassan and her regime for trampling on the values of ubuntu and pan-Africanism that the countrys founding president, Julius Nyerere, stood for.\n\nVava reportedly arrived at Julius Nyerere International Airport in Dar es Salaam on 28 October as part of a regional solidarity mission to engage with CSOs and social movements. The mission aimed to discuss concerns over the escalating crackdown on dissent under what the coalition called the increasingly authoritarian regime which has also shut down the internet.\n\nUpon arrival, Vavas passport was reportedly confiscated by immigration officials, who subjected him to hours of interrogation and profiling in restricted airport rooms. He was later informed that he was not welcome in Tanzania and labelled a security risk-without any formal explanation.\n\nThe coalition said Vava spent the night detained in a holding cell at the airport without blankets before being deported on 29 October.\n\nTanzanian officials have remained mum on the incident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/31035543/blessing-vava.gif",
            "description": "<p>By Staff Reporter PANICKY Tanzanian authorities have reportedly denied entry to Zimbabwean human rights activist Blessing Vava before deporting him, amid rising tensions following the country’s tumultuous presidential election. Vava, the Director of the Crisis in Zimbabwe Coalition (CiZC), was barred from entering Tanzania and deported on Tuesday. He had travelled to meet with civil</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/underfire-tanzanian-authorities-deport-human-rights-activist-vava/\">Underfire Tanzanian authorities deport human rights activist Vava</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        },
        {
            "title": "Six killed, 40 injured in bus crash",
            "url": "https://www.newzimbabwe.com/six-killed-40-injured-in-bus-crash/",
            "content": "By James Muonwa\n\nA FATAL road traffic accident along the Harare-Mukumbura road in Mashonaland Central province has left six people dead, while 40 were injured.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the accident, which occurred on Thursday morning.\n\nThe ZRP confirms a fatal road traffic accident which occurred at the 131-kilometre peg along HarareMukumbura Road on October 30, 2025 at around 0430 hours.\n\nA Yutong bus with 55 passengers on board, travelling towards Bindur,a allegedly had a tyre burst, resulting in the driver losing control of the bus. The bus overturned once and landed on its side. As a result, six people died on the spot, while 40 others were injured, said Nyathi.\n\nThe bodies of the victims were taken to Bindura Provincial Hospital for post-mortem examination, while the injured were referred to Karanda, Madziwa, Mt Darwin and Bindura Hospitals for treatment.\n\nPolice said the names of the victims will be released once identification has been made by their next of kin.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa A FATAL road traffic accident along the Harare-Mukumbura road in Mashonaland Central province has left six people dead, while 40 were injured. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the accident, which occurred on Thursday morning. “The ZRP confirms a fatal road traffic accident which occurred at the 131-kilometre</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/six-killed-40-injured-in-bus-crash/\">Six killed, 40 injured in bus crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        },
        {
            "title": "Two more suspects arrested over murder of Ruwa businessman Mutangadura",
            "url": "https://www.newzimbabwe.com/two-more-suspects-arrested-over-murder-of-ruwa-businessman-mutangadura/",
            "content": "By Staff Reporter\n\nThe net has closed in on two more suspects linked to the brutal murder of Ruwa businessman Joseph Mutangadura in August this year.\n\nPolice have confirmed the arrest of Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with the killing, which shocked the nation.\n\nZimbabwe Republic Police (ZRP) national spokesperson Commissioner Paul Nyathi confirmed the development.\n\nThe ZRP confirms the arrest of Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with the murder of businessman Joseph Mutangadura (67) in Ruwa on August 17, 2025, said Nyathi.\n\nThe arrests come shortly after the dramatic capture of another suspect, Vengesai Jabulani Mutasa (41), who was apprehended after fatally shooting a police officer in Sanyati, Mashonaland West Province, over the weekend.\n\nThis brings the total number of suspects arrested in connection with Mutangaduras murder to six. Police said further details will be released in due course.\n\nIn recent weeks, law enforcement officers also apprehended Given Mandizadza (34), Phillip Mutasa (38), and Anesu Machadu (32), who have since appeared in court facing murder charges.\n\nMutangadura was killed on the night of August 17, when a gang of seven armed men stormed his farmhouse in Ruwa, just outside Harare, and shot him dead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Staff Reporter The net has closed in on two more suspects linked to the brutal murder of Ruwa businessman Joseph Mutangadura in August this year. Police have confirmed the arrest of Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with the killing, which shocked the nation. Zimbabwe Republic Police (ZRP) national spokesperson Commissioner</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-more-suspects-arrested-over-murder-of-ruwa-businessman-mutangadura/\">Two more suspects arrested over murder of Ruwa businessman Mutangadura</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        },
        {
            "title": "Mliswa takes aim at Chiwenga’s wife – accuses her of sabotaging Mnangagwa, says she should quit army position",
            "url": "https://www.newzimbabwe.com/mliswa-takes-aim-at-chiwengas-wife-accuses-her-of-sabotaging-mnangagwa-says-she-should-quit-army-position/",
            "content": "By Darlington Gatsi\n\nDEPUTY President Constantino Chiwengas wife, Minoyothabo Baloyi, has been drawn into the ZANU PF succession fight, with Temba Mliswa accusing her of using her military position to sabotage President Emmerson Mnangagwa.\n\nMliswa, who has made Chiwenga the centre of his attacks, has now taken aim at Miniyothabo, whom he accuses of misusing her position in the army to further her husbands ambitions.\n\nThe problem that we have which I must say to the nation, is that we also have the wife of the Vice President, who is part of the intelligence of the army which is MID. That being the case, she certainly has the interests of her husband. We know the interests. We know how eager he is to become the president of the country; in so doing, she will serve the interests of her husband and not the country, said Mliswa.\n\nMliswas tirade against her follows an embarrassing power outage at the new Parliament Building, which forced President Emmerson Mnangagwa to complete his State of the Nation Address (SONA) using torchlight.\n\nMliswa says the hiccup was not a coincidence but sabotage against Mnangagwa.\n\nThe former Norton legislator accuses Miniyothabo of establishing a parallel structure within the military ranks.\n\nShe is running a parallel structure and it is important that the President knows. My expos of my passport and my boarding card, which was done on social media by Ali Naka, came through her. She has been doing that. What is also important is that the commander of MID certainly does not tolerate her. In not tolerating her, she is able to run a parallel structure. You can not have a parallel structure from a security perspective, he said.\n\nDespite being a colonel in the army, Miniyothabo has become a darling of the public and has never publicly declared any political ambitions.\n\nThe attack by Mliswa also comes as factionalism is deepening in ZANU PF over the succession of Mnangagwa, whose term of office expires in 2028. His loyalists are campaigning for an extended term of office by two years, until 2030.\n\nAdded Mliswa,I had already suggested and proposed that she can not be in office, being the wife of the Vice President, because she is already compromised. When people see her, they see the Vice President. How do you expect them not to take instructions from her? If you do not take instructions from her, you are fired. Why is it taking so long to retire her?\n\nThis is very important and for as long as this is not attended to, these issues will continue. There is a parallel structure which is being run from a security perspective.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051524/zdf-chiwengas.jpeg",
            "description": "<p>By Darlington Gatsi DEPUTY President Constantino Chiwenga’s wife, Minoyothabo Baloyi, has been drawn into the ZANU PF succession fight, with Temba Mliswa accusing her of using her military position to sabotage President Emmerson Mnangagwa. Mliswa, who has made Chiwenga the centre of his attacks, has now taken aim at Miniyothabo, whom he accuses of misusing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-takes-aim-at-chiwengas-wife-accuses-her-of-sabotaging-mnangagwa-says-she-should-quit-army-position/\">Mliswa takes aim at Chiwenga’s wife – accuses her of sabotaging Mnangagwa, says she should quit army position</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        },
        {
            "title": "Broken promises: the collapse of Zimbabwe’s land compensation",
            "url": "https://www.newzimbabwe.com/broken-promises-the-collapse-of-zimbabwes-land-compensation/",
            "content": "Farmers Weekly\n\nBorn and bred in Zimbabwe, 68-year-old farmer Stuart Brentwas evicted from Kilvington Farm in Norton, just outside Harare, in September 2002.\n\nIn April this year, local media reported that the government had started paying white farmers compensation for the land grabs that occurred under the so-called Fast-track Land Reform Programme (FTLRP).\n\nIt reported thatinvestors whose farms were protected under Bilateral Investment Promotion and Protection Agreements (BIPPAs) would be compensated for land and improvements, while those who lost land through the FTLRP would be compensated for improvements only.\n\nThe Valuation Consortium (Valcon), a Zimbabwean valuation company, and the governments Land Compensation Committee came up with a valuation figure of US$5,2 billion (R90 billion) for improvements on farms.\n\nAccording to the Compensation Steering Committee (CSC), the Commercial Farmers Union came up with a compensation figure of US$10 billion (R174 billion), while independent professional valuers settled for US$8,5 billion (R148 billion). Both figures included the value of land, which was US$3,2 billion (R56 billion).\n\nAfter lengthy negotiations, the government adjusted its figure to US$3,5 billion (R61 billion), a figure that is currently operational.\n\nBrent said that initially, improvements on his farm were valued at US$1,6 million (R28 million), but as the government was opposed to paying that amount, negotiations saw the payment reduced to US$800000 (R14 million).\n\nHe said he had bought the farm in 1990 after getting a certificate from the government that it had no interest in that property, hence he could purchase it. He then took a loan from Standard Chartered Bank that he repaid over five years.\n\nBrent moved to Nigeria in 2009 with the hope of starting commercial farming there, but the expedition turned into a terrible flop due to a lack of promised finance and backing from the Nigerian government.\n\nI left Nigeria after living in tents in the middle of the bush for a year, he explained.\n\nHe added that no amount of compensation would ever make up for the suffering he endured due to the loss of his home, business, and his only profession, farming.When he returned to Zimbabwe, he lived off savings and gratuity payments.\n\nHe said he used to grow tobacco, maize, Rhodes grass seed for export, had cattle, and had just started an ostrich project when he was evicted from his land. Brent nowlives in a retirement home near Harare with his 65-year-old wife.\n\nDeon Theron, a farmer who rejected the compensation deal, said most dispossessed farmers decided not to sign up for compensation because the deal violated the countrys laws that stated payment should be fair and paid within a reasonable time.\n\nTheron, a CSC member, said the deal was discriminatory. He explained that Zimbabwean citizens, considered indigenous and foreigners, covered under BIPPA were paid the full price in cash for the land and improvements. However, citizens not deemed indigenous were treated differently.\n\nThe way forward is to talk to the international community and the government of Zimbabwe to find a way forward of financing fair compensation for everyone. This is possible, and we are busy talking to the government and various embassies and international financial institutions, he added.\n\nTheron said that after 1980, over a period of 37 years, he managed to buy three farms through loans from the Agricultural Finance Corporation.\n\nI lost my third farm with everything on it through violence in 2000. It is now settled with hundreds of A1 settlers.\n\nI lost my second farm in 2004 and my first farm in 2008. It was my main farm where we lived, and it was a dairy farm I built from scratch, he said.\n\nWhen I visited the farm a few years ago, there was very little going on. I saw a few goats and about seven people hanging around.\n\nAccording to Theron, about 90% of acquired farms were valued by Valcon, and the valuation exercise was largely funded by the EU.\n\nHe said the law required that people be paid within a reasonable time and stipulated that interest should be paid if compensation was delayed, yet he had not received a cent in more than two decades.\n\nThe question remains: why am I being discriminated against as a born-and-bred Zimbabwean when foreigners are treated differently? I am being discriminated against because of the colour of my skin.\n\nOur constitution does not allow discrimination against any race, he added.\n\nA liberation war was fought to end racial discrimination. Now we are back to doing exactly what that was opposed.\n\nAnthony Purkis, director of Valcon, said that when it became cleararound 2002 that farm expropriations were a reality, most farmers wanted valuations before they lost their properties.\n\nHe added that the only way to meet the demand was to employ mass valuation methods, which led to the formation of the farmdatabase.\n\nPurkis said it wasnt until 2017 when then-president Robert Mugabe lost power to Emmerson Mnangagwa that real communication started between Valcon and the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development; the Ministry of Finance; and other government departments.\n\nIn July 2020, the government signed an agreement called the Global Compensation Deed (GCD) with farmers, Valcon, and other stakeholders, based on the US$3,5 billion (R61 billion) payout.\n\nPurkis said the GCD promiseda 50% down payment 12 months after acceptance of the deed, followed by 12,5% in each of the subsequent four years.\n\nHe added that the farmers did not receive any payment within the set time frame, and the government came up with another offer,the Farmers Compensation Agreement (FCA), in 2023.\n\nThe [FCA] is a 10-year deal with a mix of small amounts of cash and Treasury bills/bonds. Approximately 1 000 applications have been accepted for the FCA, and 631 of those have received a 1% cash payment to various bank accounts here or in other countries in US dollars. That is the 1% allocated in the agreement of the value of the improvements only.\n\nThe Land Acquisition Act and the Constitution make it quite clear that land will not be compensated by this country, only improvements to the land, which include buildings, roads, fencing, irrigation, and so on.\n\nThe remainder of the compensation is to be paid in Treasury bonds over 10 years, maturing yearly with2% interest on outstanding value, he explained.\n\nPurkis said thecompensation figure for improvements was initially recordedas US$5,2 billion (R90 billion) but was deemed unaffordable by the government and reduced through bargaining to US$3,5 billion (R61 billion), which most farmers reluctantly accepted and was still the accepted FCA figure.\n\nHe added that the Valcon database included over 90% of all commercial farms registered for compensation. Although it recorded 4700 farms, they were owned by just 2450 farmers, highlighting that some farmers owned more than one farm.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/16155649/farm.jpg",
            "description": "<p>Farmer’s Weekly Born and bred in Zimbabwe, 68-year-old farmer Stuart Brent was evicted from Kilvington Farm in Norton, just outside Harare, in September 2002. In April this year, local media reported that the government had started paying white farmers compensation for the land grabs that occurred under the so-called Fast-track Land Reform Programme (FTLRP). It reported</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/broken-promises-the-collapse-of-zimbabwes-land-compensation/\">Broken promises: the collapse of Zimbabwe’s land compensation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        },
        {
            "title": "ZIFA to announce new Warriors Coach as over 300 apply for post",
            "url": "https://www.newzimbabwe.com/zifa-to-announce-new-warriors-coach-as-over-300-apply-for-post/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) is set to announce the new Warriors head coach on Monday following an overwhelming response to the vacancy, which attracted more than 300 applications from both local and international coaches.\n\nZIFA president Nqobile Magwizi revealed the announcement date during an interview with SuperSports Soccer Africa on Thursday night, saying the process was now at an advanced stage.\n\nThe process of appointing the Warriors coach is at an advanced stage. We will announce by Monday at the latest; it should be Tuesday, said Magwizi.\n\nThe post became vacant after Michael Nees was dismissed due to a string of poor results, leaving the national team without a coach just two weeks before the November FIFA international break.\n\nSources say the online application portal, which closed Thursday, drew a stampede of interest, with over 300 curriculum vitae submitted. Among the notable applicants is former Tottenham Hotspur, Newcastle United, and Ghana national team manager Chris Hughton, who is said to be among the frontrunners.\n\nZIFA has set a minimum requirement of a CAF or UEFA Pro License, effectively ruling out local coaches, none of whom currently hold such qualifications.\n\nThe new coach will immediately begin preparations for the Warriors upcoming friendly matches against Algeria on November 13 in Saudi Arabia, and Qatar four days later as part of the build-up to the Africa Cup of Nations (AFCON) scheduled for December 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) is set to announce the new Warriors head coach on Monday following an overwhelming response to the vacancy, which attracted more than 300 applications from both local and international coaches. ZIFA president Nqobile Magwizi revealed the announcement date during an interview with SuperSport’s Soccer Africa on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-to-announce-new-warriors-coach-as-over-300-apply-for-post/\">ZIFA to announce new Warriors Coach as over 300 apply for post</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:42",
            "date": "31 Oct 2025"
        }
    ]
}