{
    "news": [
        {
            "title": "Tobacco selling season kicks off with first bale fetching US$4,65 per kg",
            "url": "https://www.newzimbabwe.com/tobacco-selling-season-kicks-off-with-first-bale-fetching-us465-per-kg/",
            "content": "By Alois Vinga\n\nTHE 2025 tobacco selling season kicked off in Harare, Wednesday, with the first bale selling at US$4,65, indicating improved golden leaf yields.\n\nSpeaking to stakeholders at the official opening of the selling season, the Tobacco Industry Marketing Boards (TIMB) chairman, Patrick Davenish said this season 32 buyers and 43 contractors are buying from 56 selling points across Zimbabwe.\n\nHe reiterated TIMBscommitment to ensuring that all tobacco growers have fair and convenient market access, and we are continuously engaging stakeholders to explore ways to improve accessibility\n\nThe debut price at US$4,65 is quite higher than last years US$4,35 in a development signifying better times for the golden leafs farmers.\n\nThe Board has also approved decentralized contract sales to be conducted at 56 selling points and 7 centers.Concerning payment modalities, the Reserve Bank of Zimbabwe (RBZ) advised that the foreign currency retention for tobacco is 70% in line with the retention level for other market players. This means that 30% will be paid in local currency, said Davenish.\n\nHowever, farmers who spoke to NewZimbabwe.com expressed grave concerns over the RBZ policy directive to retain 30% of US$ earnings for the farmers and pay the equivalent at the official exchange rate.\n\nAll the implements are priced strictly in US. We owe some product suppliers who expect payment in foreign currency, and yet the central bank will withhold 30% of our US$ earnings. This will even impinge our planning modalities for the coming season, said one farmer on the condition of anonymity.\n\nAcknowledging the overwhelming concerns on foreign currency retention thresholds, Davenish committed to continuously engage the RBZ over the matter.\n\nAs a Board, we will continue to lobby that the RBZ hears the cries of tobacco growers. We value them because they are our primary stakeholders, and their viability is at the epicenter of what we do, he said.\n\nDavenish called on farmers to place environmental sustainability at the heart of their operations by adopting environmentally responsible practices throughout the value chain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/05104659/2025-Tobacco-selling-season-kick-off.jpg",
            "description": "<p>By Alois Vinga THE 2025 tobacco selling season kicked off in Harare, Wednesday, with the first bale selling at US$4,65, indicating improved golden leaf yields. Speaking to stakeholders at the official opening of the selling season, the Tobacco Industry Marketing Board’s (TIMB) chairman, Patrick Davenish said this season 32 buyers and 43 contractors are buying</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tobacco-selling-season-kicks-off-with-first-bale-fetching-us465-per-kg/\">Tobacco selling season kicks off with first bale fetching US$4,65 per kg</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Rachel Chinouriri opens as Sabrina Carpenter kicks off European tour with incredible performance in Dublin",
            "url": "https://www.newzimbabwe.com/rachel-chinouriri-opens-as-sabrina-carpenter-kicks-off-european-tour-with-incredible-performance-in-dublin/",
            "content": "Goss.ie\n\nSabrina Carpenter has kicked of the European leg of her Short n Sweet tour with an incredible performance in Dublin.\n\nThe 25-year-old will play another sold-out night in the 3arena tonight, following her incredible show last night.\n\nRachel Chinouriri was the opening act, an English singer-songwriter who just released her debut album.\n\nThe star played all her biggest hits including Espresso, Please Please, Please, Taste, Juno and Bad Chem.\n\nThe 25-year-old also played songs for her long-time fans, from her album Emails I cant send.\n\nThe 25-year-old pulled out the stops with numerous outfit changes, including a stunning green piece, just for her Irish fans.\n\nIn a segment of the show, the former Disney star spun a wheel to reveal a bonus song, performing 15 minutes, a song from her deluxe album.\n\nThe star also replaced much loved song Read Your Mind with new song Busy Woman.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/05092220/rachel-sabrina.jpg",
            "description": "<p>Goss.ie Sabrina Carpenter has kicked of the European leg of her Short n Sweet tour with an incredible performance in Dublin. The 25-year-old will play another sold-out night in the 3arena tonight, following her incredible show last night. Rachel Chinouriri was the opening act, an English singer-songwriter who just released her debut album.   The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rachel-chinouriri-opens-as-sabrina-carpenter-kicks-off-european-tour-with-incredible-performance-in-dublin/\">Rachel Chinouriri opens as Sabrina Carpenter kicks off European tour with incredible performance in Dublin</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Mwonzora says Zanu PF punishing him for resisting 2030 agenda after High Court nullified party’s 2022 ordinary congress",
            "url": "https://www.newzimbabwe.com/mwonzora-says-zanu-pf-punishing-him-for-resisting-2030-agenda-after-high-court-nullified-partys-2022-ordinary-congress/",
            "content": "By Staff Reporter\n\nMOVEMENT for Democratic Change (MDC-T) president Douglas Mwonzora is seething with anger after the High Court nullified the opposition partys 2022 ordinary congress.\n\nMwonzora says Zanu PF was behind the ruling in order to pacify his calls for Zimbabweans to resist President Emmerson Mnangagwas 2030 agenda to extend his incumbency beyond the constitutionally permissible two terms that expire in 2028.\n\nHigh Court judge Justice Hapias Zhou last week ordered Mwonzora to resign and pave way for a fresh congress within six months due to irregularities in the 2022 MDC-T Extraordinary Congress that catapulted him to the helm of the party.\n\nResponding to the ruling, Mwonzora took aim at Zanu PFs Mnangagwa and his 2030 agenda proponents.\n\nI want to say we are going to attenuate our fight against the 2030 agenda. We will never allow anybody to intimidate us against fighting the 2030 agenda.\n\nSo, if there is a faction within Zanu PF which has a hand in this judgment, we say tough luck to you. We are going to intensify our fight against the 2030 agenda. We will never allow the emasculation of our Constitution, we will never allow being bullied against defending our Constitution, charged Mwonzora.\n\nHe said his party was a stakeholder of the 2013 Constitution of Zimbabwe, having participated in its drafting while Zimbabweans owned it after giving their opinions during the consultative process and referendum.\n\nThe people of Zimbabwe are stakeholders, they spoke during the outreach programme about what they wanted in the Constitution. They spoke during the referendum on what they wanted in this Constitution. What they said they wanted in this Constitution was that a President must run the country for a maximum of 10 years, after which they must go home.\n\nWe are saying, President Mnangagwa, after the expiry of your term in 2028, go home, and nothing is going to intimidate us from this path, said Mwonzora.\n\nMwonzora claimed MDC-T had consummated a coalition with other progressive forces, including political parties, the church, civil society, and war veterans to push back against Mnangagwas ambitious plan to be life president.\n\nTurning to the courts ruling that MDC-T must hold fresh polls to choose new leaders, Mwonzora said he was ready to defend his positionas leaderthrough the ballot.\n\nwhen the time comes, we will hold congress and l, as president of the MDC-T am willing to face anyone in a congress. I am willing to face Mudzuri, anybody, in congress, and we all know what the outcome of the congress will be. We know they will be defeated, Zanu PF knows that they will be defeated, Mwonzora added.\n\nAt the 2020 extraordinary congress, Mwonzora annihilated Thokozani Khupe, Elias Mudzuri and Morgen Komichi, who were also vying for the MDC-T presidency. Before vote counting could start, Khupe and Komichi walked out, accusing Mwonzoras camp of using violence and a fraudulent voters roll. Mudzuri also left the congress shortly after.\n\nDespite the protests, voting continued into the night, and Mwonzora was declared the opposition president with 883 votes, Khupe got 118 votes, Mudzuri scrapped 14, and Komichi a paltry 9 votes.\n\nOn December 18, 2022, the MDC-T held an ordinary congress where the party endorsed Mwonzora as its sole presidential candidate for the 2023 general elections. The congress also confirmed Chief Ndlovu as the first vice president and Paurina Mpariwa as the second vice president, both of whom were unopposed.\n\nMudzuri and three other applicants later filed a case in the High Court, challenging the validity of the 2020 congress and seeking an order for a fresh congress.\n\nLast Friday, February 28, 2025, Justice Zhou handed a surprise ruling declaring that the 2022 congress was null and void arguing that it fell short of meeting requirements of the MDC-T Constitution.\n\nThe purported National Congress held in December 2022 by the second respondent as the National Congress of the first respondent be and is hereby declared null and void for noncompliance with the first respondents Constitution, part of the ruling reads.\n\nThe court ordered that a new national congress be held within six months, under an independent election commission as stipulated in the MDC-T Constitution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter  MOVEMENT for Democratic Change (MDC-T) president Douglas Mwonzora is seething with anger after the High Court nullified the opposition party’s 2022 ordinary congress. Mwonzora says Zanu PF was behind the ruling in order to pacify his calls for Zimbabweans to resist President Emmerson Mnangagwa’s 2030 agenda to extend his incumbency beyond the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwonzora-says-zanu-pf-punishing-him-for-resisting-2030-agenda-after-high-court-nullified-partys-2022-ordinary-congress/\">Mwonzora says Zanu PF punishing him for resisting 2030 agenda after High Court nullified party’s 2022 ordinary congress</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Catholic bishops say third-term debate distracting the nation from real crises",
            "url": "https://www.newzimbabwe.com/catholic-bishops-say-third-term-debate-distracting-the-nation-from-real-crises/",
            "content": "By Staff Reporter\n\nZIMBABWE Catholic Bishops Conference (ZCBC) members have expressed concern over the governments fixation on the Third Term debate while bread-and-butter concerns like business closures, and crippling taxes threaten to plunge the nation further into crisis.\n\nZanu PF is currently facing internal divisions, with one faction supporting President Emmerson Mnangagwas third term and another demanding adherence to constitutional limits.\n\nThese internal divisions have spilled into the public domain, weakening the ruling partys unity; several government ministers and parliamentarians are supporting the move to disregard the constitution and extend Mnangagwas rule until 2030.\n\nIn a Lenten Pastoral Letter dated March 3, 2025, ZCBC members said they are worried about the countrys struggling economy as politicians focus on non-essential issues.\n\nWe are all worried about the situation in the country. Politically, instead of focusing on bread-and-butter issues, we are caught up in distractions such as the Third term conversations. Something that has brought with it divisions and unnecessary diversions from the things that do matter.\n\nEconomically, we are not faring well. Businesses are closing, and many people are losing their jobs. The few who are still lucky to be working are burdened under the regime of taxes.\n\nCorruption is rampant and seems tobe out of control. At the rate at which it is taking place, cutting through various sectors, the nation isdoomed. One wonders why the corrupt seemuncensoredand even rewarded whilsthemorrhagingthe nation, the letter reads.\n\nThe bishops criticized economic policies for favoring the elite while most Zimbabweans struggle with poverty.\n\nIt must be said that in our society there is an ever-widening gap between the poor and the rich.\n\nFew individuals seem to be benefiting from the wealth of the nation. We would like to remind our people that Poverty in the world today is not simply a misfortune, bad luck or inevitable -the result of laziness or ignorance or a lack of development. Poverty in the world today is the direct result of political and economic policies of governments, political parties, and big business.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051558/zdf-Mnangagwa-0.jpeg",
            "description": "<p>By Staff Reporter ZIMBABWE Catholic Bishops Conference (ZCBC) members have expressed concern over the government’s fixation on the “Third Term” debate while bread-and-butter concerns like business closures, and crippling taxes threaten to plunge the nation further into crisis. Zanu PF is currently facing internal divisions, with one faction supporting President Emmerson Mnangagwa’s third term and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/catholic-bishops-say-third-term-debate-distracting-the-nation-from-real-crises/\">Catholic bishops say third-term debate distracting the nation from real crises</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "NSSA urged to consider early payments due to rampant job cuts",
            "url": "https://www.newzimbabwe.com/nssa-urged-to-consider-early-payments-due-to-rampant-job-cuts/",
            "content": "By Alois Vinga\n\nA local workers rights group has called on the National Social Security Authority (NSSA) to consider processing early payments for workers in the wake of rampant job cuts.\n\nAccording to the International Labour Organisation (ILO), the unemployment rate is around 20%, with records showing that formal employment has been depleting over the years, leaving many citizens in the informal sector where salaries are often low.\n\nDespite government efforts to ease the situation, formalisation continues to spiral out of control, creating untold carnage which has forced several companies to fold operations, leaving many jobless.\n\nThe Commercial Workers Union of Zimbabwe (CWUZ) General Secretary, Cuthbert Chikwekwete, implored NSSA to adjust its operations in line with obtaining trends on the job markets.\n\nThe way in which NSSA is operating urgently needs to be transformed in line with job market dynamics. Currently, most workers in our sector and Zimbabwe in general are losing their jobs way before the retirement age, he said.\n\nThe CWUZ leader said that due to the pressing situation and the rampant job cuts, very few of those who lose their jobs will manage to secure new employment, with some not even getting a job again until they surpass retirement age.\n\nIt is therefore against this background that we implore relevant authorities to urgently compel NSSA to consider processing payouts earlier rather than waiting for one to reach the retirement age. This will go a long way to assist the affected workers to raise funds and venture into other self-sustaining projects, he said.\n\nChikwekwete said the situation bedevilling axed workers is very dire with risks of exposing such workers to chronic and mental health illnesses.\n\nNSSAs intervention by processing timely payments will go a long way to alleviate such kinds of negative impacts, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/03053310/nssa.jpeg",
            "description": "<p>By Alois Vinga A local workers’ rights group has called on the National Social Security Authority (NSSA) to consider processing early payments for workers in the wake of rampant job cuts. According to the International Labour Organisation (ILO), the unemployment rate is around 20%, with records showing that formal employment has been depleting over the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nssa-urged-to-consider-early-payments-due-to-rampant-job-cuts/\">NSSA urged to consider early payments due to rampant job cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Makandiwa calls for return of G40 members, says they are harmless",
            "url": "https://www.newzimbabwe.com/makandiwa-calls-for-return-of-g40-members-says-they-are-harmless/",
            "content": "By Darlington Gatsi\n\nPopular cleric Emmanuel Makandiwa says President Emmerson Mnangagwa should allow the safe return of the defeated Zanu PF faction, G40, labelling them harmless.\n\nA number of G40 members, who were vying for leadership in Zanu PF at the height of factionalism within the party in 2017, are in self-imposed exile, fearing persecution from Mnangagwas government.\n\nFormer cabinet ministers Saviour Kasukuwere, Walter Mzembi, Jonathan Moyo, and Patrick Zhuwawo are among the G40 kingpins who fled into exile after Mnangagwa assumed the countrys leadership.\n\nDuring a recent sermon at his Chitungwiza basilica, Makandiwa said the remnants of G40 should be allowed to return to Zimbabwe, as they are now powerless.\n\nI have so much respect for Walter Mzembi. It is unfortunate that they are in a foreign land as we speak. You look at Walter Mzembihe is harmless. He is pure. If they can allow them back into their country, it will be a blessing for your nation. There is nothing wrong with that. No one is powerful besides the power that you give them, said Makandiwa.\n\nWhen Robert Mugabe was deposed, Mzembi and Kasukuwere were brought before the courts, accused of corruption during their time in the previous cabinet. They, however, dismissed the allegations as a political witch hunt.\n\nMakandiwa claimed that he had warned Mugabe during his presidency that he would be deposed and that Mnangagwa would succeed him.\n\nThe cleric further urged Zimbabweans living abroad, who have sought greener pastures due to the countrys economic challenges, to return home.\n\nZimbabwe is full of blessings. Bring your children who are in the diaspora. They are blessings that have left, Makandiwa added.\n\nMakandiwa is no stranger to dabbling in the countrys politics. In 2023, he invited Mnangagwa to his church, where he publicly endorsed him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/02163737/President-Emmerson-Mnangagwa-xchanging-greetings-with-Prophet-Emmanuel-Makandiwa.jpg",
            "description": "<p>By Darlington Gatsi Popular cleric Emmanuel Makandiwa says President Emmerson Mnangagwa should allow the safe return of the defeated Zanu PF faction, G40, labelling them harmless. A number of G40 members, who were vying for leadership in Zanu PF at the height of factionalism within the party in 2017, are in self-imposed exile, fearing persecution</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/makandiwa-calls-for-return-of-g40-members-says-they-are-harmless/\">Makandiwa calls for return of G40 members, says they are harmless </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "African Sun Limited not exiting the hospitality industry – board chairperson",
            "url": "https://www.newzimbabwe.com/african-sun-limited-not-exiting-the-hospitality-industry-board-chairperson/",
            "content": "By Alois Vinga\n\nLEADING Hospitality group African Sun Limited (ASL) has dismissed speculations that it plans to exit the industry, maintaining that the strategic decisions are aimed at positioning the group as a market leader.\n\nASL has placed its three assets, the Beitbridge Express Hotel, Great Zimbabwe Hotel in Masvingo and the Monomotapa Hotel in Harares CBD on sale, prompting market speculators to suggest that ASL could be on its way out of the hospitality industry.\n\nBut speaking exclusively to NewZimbabwe.com this week, the ASL board chairperson Lloyd Mhishidismissed the claims and maintained that the recent developments are part of a broader strategy to strengthen the group.\n\nTo the contrary, the organization is consolidating its portfolio through channeling its resources to particular assets with a view to unlocking shareholder value and driving sustained growth. It is not true that ASL is disposing of its top hotels, but it is exiting some of its assets that do not align with the vision espoused above.\n\nA good example of the enhancing of value is the Hwange Safari Lodge and TroutbeckResort, which haverecentlyreceived massive refurbishments that have transformed and repositioned them well for the target market, and which has led to all the right boxes being ticked currently, he said.\n\nQuizzed on why ASL took the bold step of disposing of the prestigious Monomotapa Hotel, Mhishi said various factors, including the current economic climate being a major factor, prompted ASL to explore alternative fund-raising activities.\n\nHe added that the company decided to dispose of non-core properties that generate minimal revenue, with the decision being based on a thorough evaluation of their fit within ASLs strategic thrust and performance matrix.\n\nSuch disinvestments are not a new phenomenon as we have been implementing such a strategy over the pastfifteen years, again with the aim of focusing on enhancing shareholder valueand guest experience.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/06070051/Mhishi.jpg",
            "description": "<p>By Alois Vinga LEADING Hospitality group African Sun Limited (ASL) has dismissed speculations that it plans to exit the industry, maintaining that the strategic decisions are aimed at positioning the group as a market leader. ASL has placed its three assets, the Beitbridge Express Hotel, Great Zimbabwe Hotel in Masvingo and the Monomotapa Hotel in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-limited-not-exiting-the-hospitality-industry-board-chairperson/\">African Sun Limited not exiting the hospitality industry – board chairperson</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Man pelts ‘prayerful’ neighbour’s house with stones; convicted of malicious damage to property",
            "url": "https://www.newzimbabwe.com/man-pelts-prayerful-neighbours-house-with-stones-convicted-of-malicious-damage-to-property/",
            "content": "By Staff Reporter\n\nA HWANGE man has been hauled before a local magistrate for malicious damage to property belonging to his next-door neighbour.\n\nThe offender, Edmore Muleya (39) of Makwika village, Hwange, appeared at Hwange Magistrates Court, where he was convicted of property damage.\n\nHe was ordered to perform 103 hours of community service.\n\nThe States case was that on January 26, 2025 at around 9 pm, complainant Siphatisiwe Mathe was praying while inside her house.\n\nThe court heard that the accused person started throwing stones towards his neighbours house, thereby smashing 14 asbestos sheets, and caused damage to a deep freezer, a door and a bucket with a combined value of US$614.\n\nThe complainant reported the incident to the police, leading to Muleyas arrest and subsequent court appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A HWANGE man has been hauled before a local magistrate for malicious damage to property belonging to his next-door neighbour. The offender, Edmore Muleya (39) of Makwika village, Hwange, appeared at Hwange Magistrates’ Court, where he was convicted of property damage. He was ordered to perform 103 hours of community service. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-pelts-prayerful-neighbours-house-with-stones-convicted-of-malicious-damage-to-property/\">Man pelts ‘prayerful’ neighbour’s house with stones; convicted of malicious damage to property</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Scottland not a team yet – Ndiraya",
            "url": "https://www.newzimbabwe.com/scottland-not-a-team-yet-ndiraya/",
            "content": "By Darlington Gatsi\n\nSCOTTLAND coach Tonderai Ndiraya is not naive to the task that the moneyed side faces in the Castle Lager Premier Soccer League (PSL).\n\nThe newly promoted team had an underwhelming debut in the top flight last Friday, securing a last-minute win through an own goal by Triangle defender Blessing Chiota.\n\nWhile there were huge expectations on Scottland to make light work of Triangle, they found the going tough despite being bolstered by expensive signings.\n\nThe team was disjointed, with a clear lack of cohesion from the galaxy of stars. In comparison, Triangle fielded veteran players who are past their prime, such as Ali Sadiki and Thabani Kamusoko, but managed to frustrate the Mabvuku side.\n\nNdiraya pleaded for more time for Scottland to gel and play as a unit in the PSL after a busy signing spree.\n\nDespite having a galaxy of stars in our team, I think it is important to understand that football is a process. You may buy whoever you want from the market, but at the end, the players have to understand each other and play as a team in the long run.\n\nSo that it is a process. It does not happen in one day. With more games, the team will start to play as a team. At the moment, we are not a team yet, said Ndiraya.\n\nOn Friday, Ndiraya fielded last years Soccer Stars of the Year finalists, Lynoth Chikuhwa, Walter Musona, and Tymon Machope. Khama Billiat was omitted due to injury.\n\nThe quartet scored a combined 51 goals last season. Such is the quality of the arsenal that Ndiraya has at his disposal.\n\nIt is the signings that have made Scottland favourites to clinch the 2025 PSL title among bookmakers.\n\nNdiraya said there is still a long way to go before his team starts to deliver statement performances.\n\nWith more time on the pitch, at training we will come good. We will start to play as a team and be where we are expected to play. We are building a team. Putting a galaxy of players together is one thing, and making them play as a team is another.\n\nIt is a process, and we are very patient. Hopefully, after a few games, we can then start to play the way we want and the way that everyone will understand. The expectation is for the team to win 5-0. But football is not like that; you will have to work for it, he said.\n\nScottland face CAPS United on Sunday at Rufaro in a potentially exciting match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/04190715/scottland.jpg",
            "description": "<p>By Darlington Gatsi SCOTTLAND coach Tonderai Ndiraya is not naive to the task that the moneyed side faces in the Castle Lager Premier Soccer League (PSL). The newly promoted team had an underwhelming debut in the top flight last Friday, securing a last-minute win through an own goal by Triangle defender Blessing Chiota. While there</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-not-a-team-yet-ndiraya/\">Scottland not a team yet – Ndiraya </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        },
        {
            "title": "Three Zimbabweans in court for kidnapping Cape Town man, demanding R5 million ransom",
            "url": "https://www.newzimbabwe.com/three-zimbabweans-in-court-for-kidnapping-cape-town-man-demanding-r5-million-ransom/",
            "content": "Cape Argus\n\nThree Zimbabwean nationals accused of kidnapping a Cape Town man and demanding R5m ransom appeared in the Stellenbosch Regional court on Monday.\n\nLuckmore Tawanda Muzhira, Takudzwa Trust Nzounhenda and Itai Elvis Takawira face charges of assault, extortion, robbery and kidnapping. The matter has been postponed to March 14 for a formal bail application. The trio, aged 28, 35 and 39 were arrested on Friday during a multi-disciplinary intelligence-led operation involving the Hawks the Directorate of Priority Crime Investigation and the Polices Provincial Organised Crime, Hostage Negotiation Team (HNT) and Boland K9 Unit.\n\nPolice spokesperson Lieutenant Colonel Siyabulela Vukubi said the team was following up on a complaint that the victim who was visiting a shop in Stellenbosch last Thursday did not return home. Vukubi said the family received a ransom demand in the millions and that a video was also sent to them of the loved one, whose hands were tied and was blindfolded.\n\nIt was reported that the family received a WhatsApp message whereby the sender stated that heknew the whereabouts of the victim and demanded R100 000.00in exchange for his location, he explained.\n\nThe sender of the message further claimed to be a middleman andmentioned that the kidnappers were demanding R5 million but that he personally needed R100 000.00 fearing for the victims life. On the same day, the victims brother allegedly received another WhatsApp message containing a video showing the victim with his hands tiedand eyes blindfolded. Further threatening messages followed, warning thatthe victim would be killed.\n\nVukubi added that their quick-thinking team managed to rescue the man from his kidnappers. The victim was left injured but stable. Meticulous investigation by the multi-disciplinary team led to the identification of two suspected vehicles on February 28, he detailed.\n\nOne of the suspected vehicles, a black VW, was stopped by the Boland K9 Unit near Stellenbosch. The victim was found inside the vehicle and was rescued. He was taken to hospital for medical examination with serious head injuries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/22051732/The-Hawks-arrested-a-director-at-the-Department-of-Agriculture-for-land-fraud-Picture-Henk-Kruger-African-News-Agency-ANA.webp",
            "description": "<p>Cape Argus Three Zimbabwean nationals accused of kidnapping a Cape Town man and demanding R5m ransom appeared in the Stellenbosch Regional court on Monday. Luckmore Tawanda Muzhira, Takudzwa Trust Nzounhenda and Itai Elvis Takawira face charges of assault, extortion, robbery and kidnapping. The matter has been postponed to March 14 for a formal bail application.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-zimbabweans-in-court-for-kidnapping-cape-town-man-demanding-r5-million-ransom/\">Three Zimbabweans in court for kidnapping Cape Town man, demanding R5 million ransom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "05 Mar 2025"
        }
    ]
}