{
    "news": [
        {
            "title": "NetOne CEO granted US$500 bail in US$1.2 million fraud case",
            "url": "https://www.newzimbabwe.com/netone-ceo-granted-us500-bail-in-us1-2-million-fraud-case/",
            "content": "By Mary Taruvinga\n\nNetOne Cellular (Pvt) Ltd Chief Executive Officer, Raphael Mushanawani (60) has been granted US$500 bail after he appeared in court facing fraud charges involving more than US$1.2 million.\n\nMushanawani, who is the Group CEO and Accounting Officer of the state-owned mobile operator, appeared before Harare Magistrate Marewanazvo Gofa on Wednesday.\n\nThe state had opposed bail but the magistrate ruled that Mushanawani was not a flight risk.\n\nHe is employed and a man of fixed abode, Gofa said in her ruling.\n\nAs part of his bail conditions, Mushanawani was ordered to surrender his passport to the clerk of court and not to interfere with State witnesses.\n\nThe complainant in the case is NetOne, represented by its Board Chairperson, Engineer Taurayi Maurukira.\n\nAccording to the State, sometime in 2022, NetOne initiated a procurement process to replace its SAGE 1000 system with a new Enterprise Resource Planning (ERP) system. The tender was approved by the NetOne board, with Farevic Systems (Pvt) Ltd awarded the contract worth US$2,422,500 to supply and implement the SAP system.\n\nProsecutors allege that while Farevic was still implementing the project, Mushanawani, acting in connivance with other NetOne managers who are yet to be arrested, devised a scheme to siphon company funds. He allegedly misled the Executive Management Committee and the board into believing that it was necessary to upgrade the old SAGE 1000 system, which was already being phased out.\n\nThrough this misrepresentation, Mushanawani allegedly signed a separate contract with Lunartech Solutions (Pvt) Ltd worth US$257,600 for the so-called SAGE 1000 upgrade. He later signed several addendums, inflating the cost of the project to US$1.2 million.\n\nTo date, NetOne has allegedly paid Lunartech US$654,331.60 without the knowledge or approval of the board.\n\nThe State further alleges that Mushanawani and his accomplices fraudulently committed the company to a separate consultancy contract with Diztech valued at US$79,467.49, even though the same services were already included and paid for under the original Farevic contract.\n\nAs a result, NetOne was allegedly prejudiced of US$654,331.60, with a potential further prejudice of US$625,135.89.\n\nMushanawani is expected back in court on October 22 for his routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30061209/NETONE-CEO-Raphael.jpeg",
            "description": "<p>By Mary Taruvinga NetOne Cellular (Pvt) Ltd Chief Executive Officer, Raphael Mushanawani (60) has been granted US$500 bail after he appeared in court facing fraud charges involving more than US$1.2 million. Mushanawani, who is the Group CEO and Accounting Officer of the state-owned mobile operator, appeared before Harare Magistrate Marewanazvo Gofa on Wednesday. The state</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netone-ceo-granted-us500-bail-in-us1-2-million-fraud-case/\">NetOne CEO granted US$500 bail in US$1.2 million fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "01 Oct 2025"
        },
        {
            "title": "Julius Malema convicted of firing a gun in public",
            "url": "https://www.newzimbabwe.com/julius-malema-convicted-of-firing-a-gun-in-public/",
            "content": "BBC\n\nSouth African opposition politician Julius Malema has been found guilty of discharging a firearm in public seven years ago.\n\nIn 2018, a video emerged showing the Economic Freedom Fighters (EFF) leader firing several shots in the air during his partys fifth anniversary celebrations held in the countrys Eastern Cape province.\n\nHe was charged alongside his former bodyguard Adriaan Snyman, who was acquitted.\n\nThis is Malemas second conviction in less than two months and he could face up to 15 years in prison.\n\nMalema often sparks controversy in a nation where, 31 years after apartheid ended, racial tensions still high. He was recently convicted of hate speech.\n\nMalema was convicted of five offences, including the unlawful possession of a firearm and ammunition, discharging it in a public space and reckless endangerment. The first charge carries a maximum 15-year sentence.\n\nHe was accused of firing between 14 and 15 live rounds on a stage in front of 20,000 EFF supporters, according to South African news site SowetanLIVE.\n\nIn his defence, Malema told the court the firearm was not his and that he had fired the shots to rouse the crowd, the publication added.\n\nIt took three days for magistrate Twanet Olivier to tell Malema you are found guilty as charged. The case was postponed to January 2026 for pre-sentencing.\n\nMalemas prosecution came after Afrikaner lobby group AfriForum, which has a contentious relationship with Malema and the EFF, opened a case against him after the video went viral.\n\nAfriForum was also among those who laid a hate speech complaint against the EFF MP at South Africas Human Rights Commission.\n\nThis resulted in his conviction by the countrys equality court in August this year.\n\nAfter an incident where a white man allegedly assaulted an EFF member, Malema said: No white man is going to beat me up you must never be scared to kill. A revolution demands that at some point there must be killing.\n\nThe equality court ruled that these remarks demonstrated an intent to incite harm, but the EFF said they were taken out of context.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/24191112/Julius-Malema.png",
            "description": "<p>BBC South African opposition politician Julius Malema has been found guilty of discharging a firearm in public seven years ago. In 2018, a video emerged showing the Economic Freedom Fighters (EFF) leader firing several shots in the air during his party’s fifth anniversary celebrations held in the country’s Eastern Cape province. He was charged alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/julius-malema-convicted-of-firing-a-gun-in-public/\">Julius Malema convicted of firing a gun in public</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "01 Oct 2025"
        },
        {
            "title": "NetOne CEO’s lawyers demand his release, blame “boardroom politics” for arrest",
            "url": "https://www.newzimbabwe.com/netone-ceos-lawyers-demand-his-release-blame-boardroom-politics-for-arrest/",
            "content": "By Mary Taruvinga\n\nLawyers representing NetOne CEO Raphael Mushanawani have written to the Zimbabwe Anti-Corruption Commission (ZACC) demanding his immediate release, insisting their client is the victim of a calculated power grab within the organisation.\n\nMushanawani was arrested Monday on fraud allegations involving US$1.2 million. However, his legal team claims the charges are fabricated by rivals seeking to force him out, using the names of influential politicians to strengthen their plot.\n\nIn a letter dated September 30, 2025, and seen byNewZimbabwe.com, Mushanawanis lawyer Admire Rubaya argued that the arrest was unlawful, describing his client as being punished for doing things right at the parastatal.\n\nRubaya alleged that ZACC had been misled, insisting that all the CEOs actions were above board and backed by board approval, contrary to claims that he engaged companies without authorisation.\n\nThere are certain individuals who are targeting his post who have approached you (ZACC) on the basis of name dropping very powerful individuals who sit in the high echelons of power and politics in this country yet there is no involvement of any such political figures. The grand plan is for these instigators to take over as the people at the helm of NetOne, the letter states.\n\nZACC accuses Mushanawani of breaching company procedures by secretly engaging Lunartech Solutions (Pvt) Ltd to upgrade NetOnes SAGE 1000 system, which was meant to be replaced under a separate US$3.5 million contract awarded to Farevic Systems (Pvt) Ltd in 2022.\n\nThe commission alleges that Mushanawani did so without the approval of the Executive Committee or the Board.\n\nHowever, his lawyers insist the upgrade was necessary, approved at the board level, and vital to safeguard NetOnes operations.\n\nOur client is at a loss as to why he finds himself languishing in police custody over an issue which exposes your officers lack of understanding of IT systems, the lawyers wrote.\n\nThey explained that the SAP ERP system being implemented by Farevic was distinct from the SAGE 1000 system NetOne had been using for years. SAGE had reached its end-of-sale stage, with support from its South African vendor scheduled to end on December 31, 2024, creating what they said was a significant operational risk.\n\nContrary to your claims, the upgrading of the SAGE ERP 1000 to SAGE L200 was imperative  This was key and had been approved by the board, the lawyers said.\n\nThey further argued that both systems had to run in parallel until the new one was proven fully functional.\n\nThe lawyers also rejected claims that Mushanawani signed addenda worth US$1.2 million to upgrade the SAGE system.\n\nThis is false, and you are challenged to provide such evidence. For your information, the only payments which have been made thus far are for US$184,800 and US$88,002.57, the letter reads.\n\nThey equally dismissed allegations that Mushanawani entered into an unapproved consultancy contract with Diztech (Pvt) Ltd for US$79,467.\n\nFor the record, there is no contract that was signed between Diztech (Pvt) Ltd and NetOne as alleged, neither has there been any payment of even a dime to Diztech (Pvt) Ltd  since no such services were ever provided, the lawyers said.\n\nMushanawanis defence team maintains that the allegations are part of a deliberate campaign to oust him from his position. They attached board documents to support their case and warned ZACC against being used in what they called an orchestrated plot.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30061209/NETONE-CEO-Raphael.jpeg",
            "description": "<p>By Mary Taruvinga Lawyers representing NetOne CEO Raphael Mushanawani have written to the Zimbabwe Anti-Corruption Commission (ZACC) demanding his immediate release, insisting their client is the victim of a calculated power grab within the organisation. Mushanawani was arrested Monday on fraud allegations involving US$1.2 million. However, his legal team claims the charges are fabricated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netone-ceos-lawyers-demand-his-release-blame-boardroom-politics-for-arrest/\">NetOne CEO’s lawyers demand his release, blame “boardroom politics” for arrest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "01 Oct 2025"
        },
        {
            "title": "Congo’s ex-president Kabila sentenced to death in absentia by military court",
            "url": "https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/",
            "content": "Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/12005230/Joseph-Kabila-e1530910845219.jpg",
            "description": "<p>Reuters Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity. The case stems from his alleged role in backing the advance of Rwanda-backed M23 rebels in Congo’s volatile east. Kabila, who led Congo from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/\">Congo’s ex-president Kabila sentenced to death in absentia by military court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "01 Oct 2025"
        },
        {
            "title": "Zimbabwe’s gold coins top $4,000 for first time on Bullion rally",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins topped the $4,000 mark for the first time, lifted by a global rally in the metal that’s up 45% this year. The 22-carat “Mosi-Oa-Tunya” gold coins — named after Victoria Falls, a popular tourist destination, and introduced in 2022 to counter a rapid depreciation of the now-defunct local dollar — were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/\">Zimbabwe’s gold coins top $4,000 for first time on Bullion rally</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "01 Oct 2025"
        },
        {
            "title": "Robbery spree targeting schools: Zimbabwean man shot dead in Limpopo",
            "url": "https://www.newzimbabwe.com/robbery-spree-targeting-schools-zimbabwean-man-shot-dead-in-limpopo/",
            "content": "IOL\n\nPolice at Ritavi, in Limpopo, have launched a manhunt for two suspects after a series of violent incidents at schools in the area, which left one suspect dead, another arrested, and several items stolen.\n\nAccording to provincial police spokesperson Colonel Malesela Ledwaba, between midnight and 4 am on Sunday, three armed suspects targeted three schools in the Ritavi policing area. The gang stole cellphones and laptops and attempted to break into an administration block at one of the schools around 3 am.\n\nThe on-duty security guard became suspicious and confronted the suspects. Police said the suspects opened fire in the guards direction before fleeing.\n\nThe guard later discovered one of the suspects lying on the ground with a gunshot wound. Paramedics certified the suspect dead at the scene. A post-mortem will be conducted to determine the exact cause of death, said Ledwaba.\n\nThe provincial murder and robbery unit, together with the Mopani tracking team, attended the scene and identified the deceased as a 36-year-old man from Seshego. The deceased is also reported to be a Zimbabwean national.\n\nFurther investigations led to the tracing of a vehicle allegedly used in the crimes. The driver, a 41-year-old man from Seshego, was arrested and is due to appear in the Nkowankowa Magistrates Court on Tuesday.\n\nPolice confirmed that two suspects remain at large and are actively being pursued.\n\nSAPS has urged anyone with information on the outstanding suspects to contact investigating officer Sergeant Eric Mathebula on 083 239 0977, call theCrime Stop number 08600 10111, report to the nearest police station, or use the My SAPS App.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30181434/LIFELESS-ZIM-MAN.png",
            "description": "<p>IOL Police at Ritavi, in Limpopo, have launched a manhunt for two suspects after a series of violent incidents at schools in the area, which left one suspect dead, another arrested, and several items stolen. According to provincial police spokesperson Colonel Malesela Ledwaba, between midnight and 4 am on Sunday, three armed suspects targeted three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robbery-spree-targeting-schools-zimbabwean-man-shot-dead-in-limpopo/\">Robbery spree targeting schools: Zimbabwean man shot dead in Limpopo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:43",
            "date": "01 Oct 2025"
        }
    ]
}