{
    "news": [
        {
            "title": "South Africa to lead global PGM supply rebound next year after dragged output",
            "url": "https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/",
            "content": "IOL\n\nLower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the worlds biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year.\n\nThe World Platinum Investment Council said on Wednesday that global PGM supplywas flatin the third quarter year on year weighed on by lower South African mineproduction.\n\nThis was after refined volumes fromValterra(formerly Anglo American Platinum) fell inSouth Africa.\n\nThis was reflective of a significant destocking of semi-finished inventory in Q324.\n\nImplats own refined production was, however, little changed year-on-year, although scheduled processing maintenance led to a further build in already elevated work-in-progress stocks.\n\nSouth African production contracted 2% year-on-year to 1 028 koz, said WIPC in a quarterly report.\n\nNonetheless, following the unusually high rainfall and flooding that disrupted South African mining operations earlier this year, as well as theprocessing constraints that curtailed refined volumes,PGMsupply is expected to recover over the latter half of the year.\n\nThe completionof maintenance at Implats South African smelters should allow some destocking of excess inventory that had been deferredearlier in the year, partly due to disruptions to water, power and hydrogen supply to the refineries, further noted WIPC.\n\nAlthough South African mine production is forecast to contract 5% to 3,945 koz, mine supply for PGM from the country is projected to rise by 2% year-on-year in 2026, with gains from South Africa and Zimbabwe partially offset by a modest decline from North America and Russia.\n\nOutput from major South African producers is expected to rise, with improved processing availability anticipated to support a modestincrease in output from Implats, aided by the drawdown of excess semi-finished inventory.\n\nInvestor sentiment in South African platinum miners and future pricing prospects has brightened with the commoditys recent good run in prices providing favourable momentum among fund managers.\n\nLong dogged by suppressed investor sentiment due to low prices and uncertainty that demand could be subdued due to popularity and uptake of electric vehicles, platinum group metals have been on a rebound in the past few weeks.\n\nThis is despite the World Platinum Investment Council saying earlier this year that full-year output will still be 6% lower than last year, since South African producers will not benefit from the large drawdown of work-in-process inventory that occurred last year.\n\nBesides the inclination towards platinum, the South African fund managers have exhibited lowpositioninginhealthcare,offshore,telecomandcash. Thebiggest fallswere recorded forheavyindustrialsand cash, according to Bank of America analysts.\n\nZimbabweanPGMproduction slipped 10% to 119 koz, largely reflecting significant destocking of semi-processed material at Unki, owned by Valterra.\n\nOutput from Zimplats,Zimbabweslargest producer, edged lower owing to furnace repairs.\n\nThus, PGM supply from Zimbabwe is expected to contract by 4% year-on-year to 493 koz, retreating from the record level achieved in 2024.\n\nThe decline primarily reflects the absence of a drawdown of semi-finished stock that boosted last years volumes, said WIPC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20044527/gold-platinum.jpg",
            "description": "<p>IOL Lower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the world’s biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year. The World Platinum Investment Council said on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/\">South Africa to lead global PGM supply rebound next year after dragged output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation",
            "url": "https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/",
            "content": "By Anna Chibamu\n\nMining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned.\n\nSpeaking in the Senate recently, Goromonzis Chief Chikwaka said that while Zimbabwe remains open for business, some foreign miners were wreaking havoc in the communities where they operate.\n\nWhat is government policy regarding the allocation of licences where you find miners displacing local communities? This is affecting peoples livelihoods. You would find that people are just relocated without improving their livelihoods.\n\nWhat is the government policy in terms of people who are being displaced by mining activities, where you find, them being relocated to areas which are not conducive? he said.\n\nHis concerns come just two months after President Emmerson Mnangagwa directed Parliament to expedite the long-overdue Mines and Minerals Bill to address ongoing disputes between miners, farmers, and communities.\n\nResponding to the issue, Mines and Mining Development Deputy Minister responsible for Oil and Gas Research and other Strategic Minerals Exploration, Caleb Makwiranzou, acknowledged the challenges.\n\nThe Deputy Minister said, Before giving permission to miners, we require a report, which is called the Environmental Impact Assessment (EIA), which is a report, which looks at the community which is going to be affected, and where they are going to be relocated. If they going to receive houses where they are going to be relocated, then after getting that report, that is where we allow mining companies to go ahead.\n\nMakwiranzou also highlighted provisions in the new law.\n\nI want to inform this House that the new law [H. B. 1, 2025] allows that if someone has their field or their farm and there is a need for mining to be done in that field, that person is given the first option. The person is asked whether they allow the miners, and then they can discuss with whoever wants to mine if there is an allocation of shares. The person can then be given shares.\n\nOn the other hand, if that person is to be relocated, it should be consensual. They must give consent because the previous law was causing disputes where there was conflict between the Minerals Act and the Agricultural Act, said Makwiranzou.\n\nHowever, Chief Chikwaka argued that, in reality, no environmental impact assessments were being conducted before mining begins.\n\nThere is no Environmental Impact Assessment, which is being done. You would find that miners are just coming into the community. They start drilling in peoples fields. They start mining and excavating in peoples fields and leave such fields open.\n\nThey do not cover the pits and the original farmer cannot farm on his land because there are pits. There is a need for consultation with stakeholders, Chief Chikwaka said.\n\nMakwiranzou stressed that operating without an EIA is illegal, adding that government would send inspectors to the affected communities and block the mining activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26023525/Chinese-Mining-Operations.png",
            "description": "<p>By Anna Chibamu Mining activities in several communities have taken a disturbing turn, with foreign investors accused of displacing villagers, disrupting livelihoods, and failing to compensate affected families or rehabilitate damaged land, Mashonaland East Senator Chief Chikwaka has warned. Speaking in the Senate recently, Goromonzi’s Chief Chikwaka said that while Zimbabwe remains open for business,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/senator-raises-alarm-over-destructive-mining-by-foreign-investors-as-communities-are-displaced-without-compensation/\">Senator raises alarm over destructive mining by foreign investors as communities are displaced without compensation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe strengthens integrated cancer services to improve women’s health",
            "url": "https://www.newzimbabwe.com/zimbabwe-strengthens-integrated-cancer-services-to-improve-womens-health/",
            "content": "WHO\n\nZimbabwe is intensifying efforts to improve the prevention, early detection and treatment of breast and cervical cancers by integrating cancer and chronic disease services into primary health care. This approach aims to bring essential health services closer to communities and ensure women have equitable access to quality care.\n\nCervical cancer accounts for almost 41% of all cancers among women in the country, followed by breast cancer at 13%, according to Zimbabwes National Cancer Registry. To address the burden, the Ministry of Health and Child Care (MoHCC), with support from the World Health Organisation (WHO) and partners, is implementing measures to strengthen integrated cancer services across the health system.\n\nIn July 2025, WHO handed over medical equipment worth US$20,000 to the MoHCC to support service delivery at the primary health level. The specialised equipment can be used to screen for noncommunicable diseases, including diabetes and hypertension.\n\nBuilding on this support, the MoHCC and WHO held training-of-trainers sessions in August 2025 for health professionals from Mashonaland West and Matabeleland South provinces.\n\nMany cancers are preventable. Let us spread the word and let all women know about it, says Esther Ngaru, one of the trainees and reproductive health officers at MOHCC.\n\nTwenty-five health professionals were trained on integrating the management of breast and cervical cancers, mental health and chronic diseases, as well as coordinated provision of prevention, screening, diagnosis, treatment and care services.\n\nThe trainers are disseminating this knowledge to frontline health workers to strengthen prevention, screening, and treatment at the community level.\n\nThanks to this training, our screening will be more effective than ever, says Audrey Musorowembudzi, a nurse at Hurungwe Rural Health Centre. At my facility, I will share this knowledge with my colleagues so that no woman is left behind.\n\nIn Karoi, a town in Mashonaland West Province, seven primary health care nurses and village health workers have already benefited from these trainings.\n\nVillage health worker Angeline Mukusa from Chigumbura Village says she will use the lessons learned to raise awareness in her community. Cancer is a major concern where I live, she says. I will encourage early detection and HPV vaccination for girls. Cancer is treatable if detected early and this will save many lives.\n\nAccording to the districts medical officer Dr Munyaradzi Chidaushe this approach is already improving service delivery. This work is transformative. Village health workers can identify and refer women suspected of breast or cervical cancer more easily. Prevention is key to protecting communities, he says.\n\nThese activities are part of the Womens Integrated Care for Cancer Services (WICS) project, led by the WHO Regional Office for Africa with support from Roche. Implemented in Cte dIvoire, Kenya and Zimbabwe, the project aims to strengthen integrated breast and cervical cancer services within primary health care. Zimbabwe was selected because its established cervical cancer programme provides a foundation for integrating additional services for cancer and chronic diseases.\n\nThrough the commitment of health workers, the leadership of MOHCC, and the support of WHO and partners, Zimbabwe is taking a decisive step towards reducing the burden of breast and cervical cancer, says Dr Desta Tiruneh WHO Representative in Zimbabwe. These efforts bring the country closer to a future where no woman dies from a preventable or treatable cancer and where health systems truly serve communities with equity and compassion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19142432/cancer-screening-zim.jpg",
            "description": "<p>WHO Zimbabwe is intensifying efforts to improve the prevention, early detection and treatment of breast and cervical cancers by integrating cancer and chronic disease services into primary health care. This approach aims to bring essential health services closer to communities and ensure women have equitable access to quality care. Cervical cancer accounts for almost 41%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-strengthens-integrated-cancer-services-to-improve-womens-health/\">Zimbabwe strengthens integrated cancer services to improve women’s health</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Nov 2025"
        },
        {
            "title": "Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda.\n\nMatatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO), Asher Walter Tapfumaneyi.\n\nTapfumaneyi had been named ZNA Chief of Staff in May.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2 of the Constitution of Zimbabwe as read with sections 7(1) and 8(2 of the Defence Act [Chapter 11:02], promoted Lieutenant Genera Emmanuel Matatu to the rank of General and appointed him Commander of the Zimbabwe Defence Forces with effect from 21 November 2025.\n\nThe appointment follows the retirement of outgoing Commander of the Zimbabwe Defence Forces, General Philip Valerio Sibanda, Rushwaya said\n\nSibanda is expected to take up a role in the ruling Zanu PF politburo.\n\nIn 2023, Mnangagwa briefly appointed him to the partys politburo before reversing the decision following a backlash from civil society. His appointment was scheduled for review at the end of his army tenure.\n\nWith tensions reportedly deepening over Mnangagwas succession, analysts view the elevation of his close allies to key military positions as a move to consolidate and secure his political interests.\n\nThe military played a pivotal role in the 2017 coup that propelled Mnangagwa to power, making control of the security sector crucial in maintaining his hold on the state.\n\nTapfumaneyi was placed under US sanctions in 2024 for his alleged role in disrupting the 2023 general elections through the Forever Association of Zimbabwe (FAZ), which was accused of intimidating voters at polling stations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27184152/matatu.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda. Matatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/\">Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Nov 2025"
        }
    ]
}