{
    "news": [
        {
            "title": "South African man sentenced for attempting to smuggle stolen Toyota Hilux to Zimbabwe",
            "url": "https://www.newzimbabwe.com/south-african-man-sentenced-for-attempting-to-smuggle-stolen-toyota-hilux-to-zimbabwe/",
            "content": "IOL\n\nA South African man who was arrested in July while attempting to smuggle a stolen Toyota Hilux bakkie from Tshwane to Zimbabwe has been sentenced to eight years direct imprisonment.\n\nThe Mokopane Regional Court on Wednesday convicted and sentenced 34-year-oldSolomon Chiloane for possession of stolen property following his arrestduring an intelligence-driven operation earlier this year.\n\nChiloane was intercepted on 14 July 2025 while driving a white Toyota Hilux Club Cab high-raised body along the R101 into Mokopane. The vehicle had been reported stolen in the Lyttelton policing area in Tshwane and was believed to be en route to Zimbabwe.\n\nPolice said the arrest was made through a joint operation involving the Limpopo Provincial Tracking Team, Tshimollo Security and Investigation, Shadowsecure Security, and Tracker Connect.\n\nAt the time, IOL reported that Chiloane was remanded in custody after his bail application was denied. Sergeant Lucas Letlotlo Ledwaba of the Provincial Investigation Unit led the case, which culminated in this weeks conviction and sentencing.\n\nDespite being a first-time offender, Chiloane was handed an eight-year direct imprisonment term, with the court saying the sentence should serve as a deterrent to others involved in vehicle theft and smuggling.\n\nSolomon Chiloane has been sentenced to eight years imprisonment after he was intercepted in Limpopo while driving a stolen Toyota Hilux to Zimbabwe\n\nActing provincial commissioner of police in Limpopo, Major General Jan Scheepers, applauded the teamwork between police and private security firms.\n\nThe ongoing joint effort in fighting syndicates involved in organised crime or vehicle smuggling has proven time and again that criminal elements have no space in our province, and any such effort will be stopped, said Scheepers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/07040820/simon-chiloane.jpg",
            "description": "<p>IOL A South African man who was arrested in July while attempting to smuggle a stolen Toyota Hilux bakkie from Tshwane to Zimbabwe has been sentenced to eight years’ direct imprisonment. The Mokopane Regional Court on Wednesday convicted and sentenced 34-year-old Solomon Chiloane for possession of stolen property following his arrest during an intelligence-driven operation earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-african-man-sentenced-for-attempting-to-smuggle-stolen-toyota-hilux-to-zimbabwe/\">South African man sentenced for attempting to smuggle stolen Toyota Hilux to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "07 Nov 2025"
        },
        {
            "title": "Mutapa Fund injects US$40 million to revive struggling parastatals",
            "url": "https://www.newzimbabwe.com/mutapa-fund-injects-us40-million-to-revive-struggling-parastatals/",
            "content": "By Alois Vinga\n\nThe Mutapa Investment Fund (MIF) has disbursed US$40 million to revive struggling state-owned enterprises (SOEs) across Zimbabwe as part of its ongoing efforts to restore the viability of key public entities.\n\nFormerly known as the Sovereign Wealth Fund of Zimbabwe, the MIF was established under the Sovereign Wealth Fund Act (Chapter 22:20) to manage national resources and support government-backed projects. The fund draws its capital from balance-of-payments surpluses, foreign currency operations, privatisation proceeds, fiscal savings, and natural resource revenues.\n\nIn an update this week, Mutapa Fund CEO Dr. John Mangudya said the latest funding marks significant progress in efforts to restructure and strengthen the performance of critical SOEs.\n\nThis funding is designed to enhance the performance of parastatals and align them with the national economic agenda, said Dr. Mangudya. Among the entities benefiting from this support are the Cold Storage Company (CSC), which recently emerged from corporate rescue, ZUPCO, Silo Foods, and the National Railways of Zimbabwe (NRZ), among others.\n\nSince its inception, the Mutapa Fund has played a central role in revitalising distressed parastatals, particularly by steering the CSC out of corporate rescue and improving governance and operational efficiency across several other enterprises.\n\nThe fund manages a diversified portfolio of state-owned companies, grouped into key economic clusters, including mineral resources, energy and trading, ICT, transport and logistics, agriculture and industry, financial services, and real estate.\n\nThrough these targeted investments, the Mutapa Investment Fund continues to anchor Zimbabwes broader strategy for state enterprise reform, economic stability, and sustainable growth.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/21044343/Mangudya-2.jpg",
            "description": "<p>By Alois Vinga The Mutapa Investment Fund (MIF) has disbursed US$40 million to revive struggling state-owned enterprises (SOEs) across Zimbabwe as part of its ongoing efforts to restore the viability of key public entities. Formerly known as the Sovereign Wealth Fund of Zimbabwe, the MIF was established under the Sovereign Wealth Fund Act (Chapter 22:20)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-injects-us40-million-to-revive-struggling-parastatals/\">Mutapa Fund injects US$40 million to revive struggling parastatals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "07 Nov 2025"
        },
        {
            "title": "Zimbabwean man, British woman stand accused of murdering 37–year–old model found dying in the street",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-british-woman-stand-accused-of-murdering-37-year-old-model-found-dying-in-the-street/",
            "content": "Daily Mail\n\nA British woman accused of murdering a 37yearold model sobbed uncontrollably as she appeared in the dock.\n\nNatalie Chadwick, 27, struggled to confirm her name, age and address while in court, charged with killing Luke Harden.\n\nShe is accused of one count of murder with co-defendant Bhekisani Matabiswana, a Zimbabwean national known locally as Nick.\n\nMr Harden was found on a pavement and despite receiving treatment from paramedics at the scene, including CPR, died of his injuries.\n\nMatabiswana, 26, and Chadwick only spoke to confirm their details during the fiveminute hearing at Blackburn Magistrates Court on Wednesday.\n\nMr Hardens family and girlfriend were sat in the public gallery, supported by police officers. Members of Chadwicks family sat just yards away.\n\nChadwick  wearing a grey hoodie and tracksuit bottoms  had to be helped to the cells by security staff as she was led away.\n\nMatabiswana  wearing a blue Lonsdale hoodie  bowed his head.\n\nMr Harden was found on Newchurch Road in Bacup, Lancashire on Saturday at 12.35am.\n\nPolice are asking for dashcam and doorbell footage of the area on Saturday between 11:45pm to 12:35am\n\nChadwick and Matabiswana, both from Bacup, are set to appear at Preston Crown Court on Friday.\n\nLancashire Police previously said its thoughts were with Mr Hardens family, who are being supported by specially trained officers.\n\nHis family have been updated on the latest developments into the police investigation.\n\nIn a tribute, his family said: There are no words to describe how devastated we all are.\n\nWe wish our Luke could see the outpouring of love from everyone who knows him.\n\nHe is and will always be special to us all, as a son, brother, grandson, nephew, cousin, uncle, boyfriend and friend.\n\nTributes poured in from the community for the 37yearold, describing him as someone who would light up the room with his smile\n\nYou will be forever in our hearts and minds, and we are comforted knowing we can shut our eyes and your beautiful face will always be smiling back at us.\n\nRest in peace, our gorgeous Luke, until we will meet again.\n\nBefore Mr Harden was officially named, tributes also poured in on social media from the community.\n\nOne said: Cant believe the news. You were the life and soul of the party. You had a lot of time for everyone and I had a lot of time for you. Rest in peace Duke.\n\nAnother added: Been a tough one to process this morning and still quite hasnt sunk in. Duke would literally light a room up with that smile of his. Thinking of all his family and close friends at this sad time.\n\nThe charity Mr Harden supported through DJing, The Ginger Heart Foundation also paid its respects.\n\nHe helped plan an anniversary event in memory of Shaun Taylor, who took his own life in 2021 after a night out with friends.\n\nDetectives are continuing their investigation and appealing for eyewitnesses who were drinking at Rosemount Working Mens Club on Friday night.\n\nA spokesperson said: We are deeply saddened by the tragic loss of Luke. He kept in touch with us regularly and played a huge part in helping to plan our first anniversary event in memory of Shaun.\n\nLuke brought excitement, creativity, and a real zest for life to everything he did. He and a wonderful team of friends dedicated their time and energy to making that event truly special for the whole community.\n\nThe charity said Mr Harden brought laughter, love and an unforgettable spirit to the event.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06114936/blackburn.webp",
            "description": "<p>Daily Mail A British woman accused of murdering a 37–year–old model sobbed uncontrollably as she appeared in the dock. Natalie Chadwick, 27, struggled to confirm her name, age and address while in court, charged with killing Luke Harden. She is accused of one count of murder with co-defendant Bhekisani Matabiswana, a Zimbabwean national known locally</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-british-woman-stand-accused-of-murdering-37-year-old-model-found-dying-in-the-street/\">Zimbabwean man, British woman stand accused of murdering 37–year–old model found dying in the street</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "07 Nov 2025"
        },
        {
            "title": "Robert Mugabe Jnr issued with arrest warrant",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand.\n\nHarare magistrate Lisa Mutendereki issued the warrant after Mugabes name was called three times with no response.\n\nMugabe who is out on bail, was arrested last month for unlawful possession of dagga. He was nabbed during a police traffic blitz after driving against a one-way street along Second Street Extension in Harare.\n\nProsecutors allege police recovered two sachets of dagga, a pack of rizla, and a dagga crusher from his sling bag. The drugs, weighing two grams and valued at US$30, were verified at Harare Main Post.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand. Harare magistrate Lisa Mutendereki issued the warrant after Mugabe’s name was called three times with no response. Mugabe who is out on bail,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/\">Robert Mugabe Jnr issued with arrest warrant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "07 Nov 2025"
        },
        {
            "title": "Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nA GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora.\n\nMwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling partys controversial resolution to extend President Emmerson Mnangagwas tenure to 2030 or beyond.\n\nIn a statement, the opposition party saidthe attackers armed with guns were donning Zanu PF regalia.\n\nMwonzora had made a brief stop at the MDC Bulawayo Provincial Office to address party members and journalists on Zanu PFs Agenda 2030.\n\nYesterday a group of Zanu PF vigilantes calling themselves Boys  dzaMudhara disrupted a peaceful meeting of the MDC in Bulawayo. We shall never bow down to thuggery. Our fight against desecration of our constitution and the 2030 agenda will be intensified.pic.twitter.com/yHJnTicoqS\n\n Sen Douglas Mwonzora (@DMwonzora)November 6, 2025\n\nTrouble reportedly started after Mwonzora finished addressing journalists.\n\nSoon after the members of the Press left, members of the police mainly from PISI and CID and youths wearing Zanu PF regalia entered the office from the back door, numbering about 20, armed with guns and knives and started dismissing people as they advanced towards the MDC leader threateningly.\n\nThey were chanting 2030 ino budirira chete (The 2030 agenda will succeed), said the opposition.\n\nA stampede then followed as members of the security whisked away the president (Mwonzora).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter A GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora. Mwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling party’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/\">Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "07 Nov 2025"
        },
        {
            "title": "German nurse gets life in jail after murdering 10 to reduce workload",
            "url": "https://www.newzimbabwe.com/german-nurse-gets-life-in-jail-after-murdering-10-to-reduce-workload/",
            "content": "BBC\n\nA palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others.\n\nProsecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to ease his workload during shifts overnight.\n\nThe offences were committed between December 2023 and May 2024 in a hospital in Wuerselen, in western Germany.\n\nInvestigators are reported to be looking into several other suspicious cases during his career.\n\nAccording to media outlet Agence France-Presse (AFP), the unnamed man had been employed at the hospital in Wuerselen since 2020, after completing training as a nursing professional in 2007.\n\nProsecutors told a court in Aachen that he showed irritation and a lack of empathy to patients who required a higher level of care, and accused him of playing master of life and death.\n\nThe court was told that he injected patients with large doses of morphine and midazolam, a type of sedative, in an effort to reduce his workload during night shifts.\n\nHe was arrested in 2024.\n\nWhen issuing the life sentence, the court said that the mans crimes carried a particular severity of guilt which should bar him from early release after 15 years.\n\nHe will be able to appeal the verdict.\n\nProsecutors have told AFP that exhumations are taking place to identify further potential victims, which could see the man put on trial again.\n\nThe case bears similarityto that of former nurse Niels Hgel, who was handed a life sentence in 2019 after he was convicted of murdering 85 patients at two hospitals in northern Germany.\n\nA court found that he administered lethal doses of heart medication to people in his care between 1999 and 2005.\n\nHe is believed to be the most prolific killer in Germanys modern history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06105744/morphine-injection.webp",
            "description": "<p>BBC A palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others. Prosecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/german-nurse-gets-life-in-jail-after-murdering-10-to-reduce-workload/\">German nurse gets life in jail after murdering 10 to reduce workload</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "07 Nov 2025"
        }
    ]
}