{
    "news": [
        {
            "title": "Impala triples platinum smelting in Zimbabwe with new plant",
            "url": "https://www.newzimbabwe.com/impala-triples-platinum-smelting-in-zimbabwe-with-new-plant/",
            "content": "Bloomberg\n\nThe plant, part of Zimplats Holdingss $1.8 billion expansion plan, has the capacity to process 380,000 tons of concentrate annually, Zimplats Chair Thandi Orleyn said at the smelters commissioning ceremony in Selous, 80 kilometers (50 miles) west of the capital Harare. The countrys biggest platinum miner has already allocated $1.1 billion of its 10-year investment plan, which runs through 2031, she added.\n\nThe plant is well positioned to handle feeds from other PGM producers presently in existence and in the future, she said, referring to so-called platinum group metals used in several industries for their resistance to corrosion and heat, as well as catalytic properties.\n\nThe expansion reflects a wider push across Africa to add value to natural resources before exporting them. Several mining operations in the continent have been seized or disrupted due to disputes with governments over taxes and investments, such as Barrick Mining Corps Loulo-Gounkoto gold complex in Mali. In Zimbabwe, the central banks retention of hard currency from exporters has been one of the challenges faced by producers.\n\nOrleyn told Bloomberg on the sidelines of the ceremony that the company has raised concerns about the countrys currency volatility with the Zimbabwean authorities.\n\nThere is a sense that this is a long-term relationship and the currency volatility in a geopolitical environment as we are facing at the moment is something to be expected, she said\n\nThe Southern African nation has the worlds third-largest platinum reserves after Russia and South Africa.\n\nZimbabwe generates more than half of its revenues from exports of minerals including gold, chrome and diamonds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24195933/implats.jpg",
            "description": "<p>Bloomberg Impala Platinum Holdings Zimbabwe unit is tripling its processing capacity in the country and plans to handle concentrates from other mining firms at its new smelter. The plant, part of Zimplats Holdings’s $1.8 billion expansion plan, has the capacity to process 380,000 tons of concentrate annually, Zimplats Chair Thandi Orleyn said at the smelter’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/impala-triples-platinum-smelting-in-zimbabwe-with-new-plant/\">Impala triples platinum smelting in Zimbabwe with new plant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "New Zealand crushes Zimbabwe by 60 runs to keep perfect record at T20 tri-series",
            "url": "https://www.newzimbabwe.com/new-zealand-crushes-zimbabwe-by-60-runs-to-keep-perfect-record-at-t20-tri-series/",
            "content": "AP\n\nNew Zealand stayed perfect at the T20 tri-series with a crushing 60-run win over host Zimbabwe on Thursday.\n\nTim Seifert (75) smashed his second successive half century and Rachin Ravindra made an entertaining 63 runs off 39 balls as New Zealand posted the tournaments highest total of 190-6 with its fourth straight win of the league stage.\n\nNew Zealand and South Africa had already secured their places in Saturdays final.\n\nLeg-spinner Ish Sodhi, one of four changes for New Zealand, grabbed a career-best 4-12 in four overs as Zimbabwe was dismissed for 130 in 18.5 overs.\n\nZimbabwe lost all four games.\n\nMitchell Santner became the first captain in the tournament to choose to bat first on a tricky wicket after winning the toss.\n\nTim Robinson (10) couldnt capitalize on Ryan Burls dropped catch in the slips before he had scored and was out to Zimbabwes best bowler, Richard Ngarava (4-34).\n\nZimbabwe was scrappy in the field when Seifert got a lucky escape on 13 as Tony Munyonga missed a catching opportunity at deep backward square leg.\n\nTogether with Ravindra, Seifert raised 108 runs for the second wicket before Zimbabwe hit back.\n\nFast bowler Tinotenda Maposa had both Ravindra and Mark Chapman caught in the outfield in the space of three balls and Ngarava chipped in with three wickets in his return spell.\n\nSeifert feathered a catch to wicketkeeper Clive Madande after Ngarava outfoxed him with a slower ball while Bevon Jacobs was spectacularly caught by Munyonga at backward point.\n\nMichael Bracewell made a 16-ball 26 and Trevor Gwandu (0-51) went for 21 runs off his final over.\n\nDifferent guys stepping up at different times is a good thing, although it can be a selection headache at times, Santner said. We know we have a massive game in a couple of days time.\n\nZimbabwe opener Dion Myers (22) smashed four boundaries in a brisk start before Sodhi struck three times inside the batting powerplay and the hosts were reduced to 37-4.\n\nSodhi clean bowled Myers and Madande after Brian Bennett was caught when he failed to clear Jacobs at extra cover as he tried to show early aggression against the leg-spinner.\n\nOff-spinner Bracewell made it 44-5 when he took a well judged caught-and-bowled off Burls miscued hit before Munyonga (40 in 30) and Tashinga Musekiwa (21) resisted with a 51-run partnership.\n\nSodhi returned in the 14th over and picked up his 150th T20 wicket when Munyonga holed out at long-off.\n\nNew Zealands pace then finished off the tail in quick succession with Matt Henry taking 2-34.\n\nWe keep digging ourselves a hole and when we try to climb out of it, we dont, Zimbabwe captain Sikandar Raza said.\n\nThe catches we dropped hurt us. As much as we wanted to be upbeat, it took us a bit of time to get into the game. One of the things I will speak (to players) is that it is never a dead rubber for Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24174619/New-Zealand-beat-Zimbabwe-by-60-runs-2025-07-bc44d44ba5b5c501fb174f5db6ea2d06-16x9-1.webp",
            "description": "<p>AP New Zealand stayed perfect at the T20 tri-series with a crushing 60-run win over host Zimbabwe on Thursday. Tim Seifert (75) smashed his second successive half century and Rachin Ravindra made an entertaining 63 runs off 39 balls as New Zealand posted the tournament’s highest total of 190-6 with its fourth straight win of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-zealand-crushes-zimbabwe-by-60-runs-to-keep-perfect-record-at-t20-tri-series/\">New Zealand crushes Zimbabwe by 60 runs to keep perfect record at T20 tri-series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "Hulk Hogan dies aged 71",
            "url": "https://www.newzimbabwe.com/hulk-hogan-dies-aged-71/",
            "content": "Sky News\n\nHulk Hogan, the legendary WWE wrestler and actor has died aged 71.\n\nPolice have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest before he died later in hospital.\n\nHogan, whose real name is Terry Bollea, is perhaps the most iconic star in WWEs five-decade history  known for his distinctive blonde moustache and colourful headbands.\n\nHis charisma and theatrics in the ring are credited with helping to transform professional wrestling into a family entertainment sport.\n\nHogan was the main draw for the first-ever WrestleMania in 1985 and was a fixture for years in its signature event, facing everyone from Andre The Giant and Randy Savage to The Rock and even company chairman Vince McMahon.\n\nHe won six WWE championships and was inducted into the WWE Hall of Fame in 2005 by Sylvester Stallone.\n\nWWE said a post this evening: WWE is saddened to learn WWE Hall of Famer Hulk Hogan has passed away. One of pop cultures most recognizable figures, Hogan helped WWE achieve global recognition in the 1980s. WWE extends its condolences to Hogans family, friends, and fans.\n\nHogan was also able to transcend his Hulkamania fan base to become a celebrity outside the wrestling world, appearing in numerous movies and television shows, including a reality show about his life on VH1, Hogan Knows Best.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24173634/hulk-hogan.jpg",
            "description": "<p>Sky News Hulk Hogan, the legendary WWE wrestler and actor has died aged 71. Police have said emergency services responders treated Hogan at his home in Clearwater, Florida, for cardiac arrest before he died later in hospital. Hogan, whose real name is Terry Bollea, is perhaps the most iconic star in WWE’s five-decade history –</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hulk-hogan-dies-aged-71/\">Hulk Hogan dies aged 71</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "Zimbabwe says informal sector dominates 76% of the economy",
            "url": "https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/",
            "content": "Bloomberg\n\nZimbabweestimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census.\n\nWhile the high level of informalization has increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance with the formal tax system, the Zimbabwe National Statistics Agency said in a report released in the capital, Harare, on Wednesday.\n\nGrowing informalization is a critical risk to the economy as less than one quarter of formal businesses carry the tax burden, according to the Confederation of Zimbabwe Industries, the nations largest industry body.\n\nFormal businesses are being squeezed, MacDonald Mutengo, CZIs lead research officer, said at the event. Companies are not making profits, they are highly regulated.\n\nThe informal sector has flourished as formal jobs evaporated due to decades of economic mismanagement that led to repeated currency collapses and bouts of hyperinflation.\n\nThe census surveyed 204,798 businesses across a range of sectors, including financial services and construction. The wholesale and retail trade sector accounted for most economic activity, contributing 73%, followed by manufacturing at 8%.\n\nBulawayo province had the highest concentration of formal businesses at 40%, compared with less than 30% in other regions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Bloomberg Zimbabwe estimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census. While the high level of informalization has “increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/\">Zimbabwe says informal sector dominates 76% of the economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "Zimbabwe hosts COP15 as leaders eye Victoria Falls wetlands pact",
            "url": "https://www.newzimbabwe.com/zimbabwe-hosts-cop15-as-leaders-eye-victoria-falls-wetlands-pact/",
            "content": "APA News\n\nThe 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands kicked off in Zimbabwes Victoria Falls resort town on Wednesday, drawing delegates from 172 countries.\n\nRunning from 2331 July, COP15 is themed Protecting Wetlands for Our Common Future and is expected to culminate in the adoption of the Victoria Falls Declaration  a landmark commitment to scale up wetland restoration and establish a Global Wetland Restoration Fund.\n\nSpeaking ahead of the meeting on Tuesday night, Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu underscored the urgency of action.\n\nWetland conservation is not just an environmental concern, it is a climate imperative, a hydrological necessity and a development obligation, Ndlovu said.\n\nShe said key initiatives to be launched at COP15 include the Global Wetland Watch platform for real-time monitoring and the African Wetland Observatory Network to support grassroots solutions, as well as the integration of wetlands into national climate and biodiversity frameworks, including Wetland City Accreditation.\n\nConvention on Wetlands Secretary General Musonda Mumba described the moment as historic, marking the second time that the meeting has been hosted on African soil.\n\nThis is not just a meeting of governments  its a platform for science, diplomacy, and community to come together around a common goal: protecting wetlands for our common future, she said.\n\nThe Ramsar Convention, signed in 1971 in Iran, is the worlds only international treaty focused exclusively on wetlands.\n\nIt promotes the wise use of wetlands and has designated over 2,500 Ramsar sites globally.\n\nZimbabwe ratified the convention in 2012 and currently hosts seven Ramsar sites, including Lake Chivero, Mana Pools and Monavale Vlei.\n\nAccording to the Convention Secretariat, the world has lost over 411 million hectares of natural wetlands since 1970, with a financing gap of up to $550 billion threatening restoration efforts.\n\nPresident Emmerson Mnangagwa is expected to formally open the summit later this week.\n\nDelegates will also tour the Kasibo Wetland in Hwange, showcasing Zimbabwes nature-based restoration efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>APA News The 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands kicked off in Zimbabwe’s Victoria Falls resort town on Wednesday, drawing delegates from 172 countries. Running from 23–31 July, COP15 is themed “Protecting Wetlands for Our Common Future” and is expected to culminate in the adoption</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hosts-cop15-as-leaders-eye-victoria-falls-wetlands-pact/\">Zimbabwe hosts COP15 as leaders eye Victoria Falls wetlands pact</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "Supreme court enforces UK divorce order in case involving former Anglican bishop",
            "url": "https://www.newzimbabwe.com/supreme-court-enforces-uk-divorce-order-in-case-involving-former-anglican-bishop/",
            "content": "Anglican Ink\n\nZimbabwes Supreme Court has upheld the enforcement of a United Kingdom divorce order involving the former Bishop of Manicaland, the Rt. Rev. Julius Makoniaffirming the authority of English court rulings over matrimonial property under Zimbabwean law.\n\nBishop Makoni, a former investment banker who became a leading figure in Zimbabwes Anglican hierarchy, resigned his post in 2015 to take a position with the International Monetary Fund. A decade later, he has found himself embroiled in a transnational legal dispute with his ex-wife, Pauline Mutsa Makoni, over matrimonial property in London and Harare.\n\nBishop Makoni, who served as the Diocesan bishop of Manicaland from 2009 to 2015, was one of the key figures in the restoration of the Anglican Diocese in the wake of the contentious Nolbert Kunonga schism. His years as bishop were marked by efforts to rebuild the spiritual and administrative health of a diocese ravaged by ecclesiastical division and state interference.\n\nBut his personal life made headlines after he and his wife divorced in the UK, where they had legal residency. The English High Court finalized their divorce in December 2014 and awarded Mrs. Makoni substantial financial compensation, including the couples marital home in Harare.\n\nWhen Mrs. Makoni sought to have the English orders recognized and enforced in Zimbabwe, Bishop Makoni objectedarguing that the UK ruling was inconsistent with Zimbabwes laws and public policy, particularly when it came to property distribution. He contended that Zimbabwean courts should not recognize foreign judgments that conferred domestic property to a foreign-domiciled spouse.\n\nBut in a landmark decision handed down last week, Zimbabwes Supreme Court dismissed Bishop Makonis objections. The bench held that foreign divorce judgmentsespecially those issued by superior courts in jurisdictions such as the UKare enforceable in Zimbabwe, provided due process was followed and the ruling does not offend local public policy.\n\nThe ruling clarified that even where Zimbabwean courts may have ruled differently in terms of asset division, they are bound by the principle of international comity and legal reciprocity to acknowledge the authority of foreign courtsparticularly where both parties were properly represented.\n\nThis decision sets a precedent in Zimbabwean jurisprudence, specifically regarding cross-border matrimonial disputes, at a time when an increasing number of Zimbabweans reside or hold assets abroad but maintain ties to their home country.\n\nThe case carries allegorical weight for the Zimbabwean church. Just as provinces throughout the Global South have historically resisted directives from England on matters of doctrine, the question posed before Zimbabwes courts was whether English authority could shape realities on Zimbabwean soil.\n\nIronically, the courts decision stands in contrast with the ecclesiastical trend: while Zimbabwean bishops and church bodies have increasingly asserted independence from Canterbury in matters of theology and liturgy, here the state court has chosen deference to English legal authority.\n\nThe case also raises difficult questions for Church leaders involved in civil litigationparticularly when it relates to personal conduct and stewardship of property. While clergy and bishops are often held to high standards within the Churchs pastoral framework, many also own assets or reside across multiple jurisdictions. More importantly, it sends a message to Church leaders, lay or ordained, that positions of ecclesiastical authority do not confer immunity in the courts of law.\n\nThe juxtaposition of Bishop Makonis spiritual authority and his civil defeat may be uncomfortable for some within the Anglican establishment. For others, it demonstrates the maturing of Zimbabwes judiciaryholding sacred and secular spheres in check while respecting the rule of law across borders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201402/Julius-Makoni-2015.jpeg",
            "description": "<p>Anglican Ink Zimbabwe’s Supreme Court has upheld the enforcement of a United Kingdom divorce order involving the former Bishop of Manicaland, the Rt. Rev. Julius Makoni—affirming the authority of English court rulings over matrimonial property under Zimbabwean law. Bishop Makoni, a former investment banker who became a leading figure in Zimbabwe’s Anglican hierarchy, resigned his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-enforces-uk-divorce-order-in-case-involving-former-anglican-bishop/\">Supreme court enforces UK divorce order in case involving former Anglican bishop</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "Tel One beats log leaders Simba Bhora, as FC Platinum close gap",
            "url": "https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/",
            "content": "By Sports Reporter\n\nSimba Bhoras ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium.\n\nThe Wifi Boys two goals came in the second half through Milton Chimedza and Washington Navaya.\n\nSo important was the win for Tel One that it reduced the gap between them and Simba Bhora to 6 points.\n\nTel One is now sitting in position 5 on the log with 37 points, the same as third and fourth place occupiers FC Platinum and Scottland, respectively.\n\nSimba Bhora, however, maintained top spot as second-place occupiers MWOS played a 1-1 at Nyamhunga against ZPC Kariba.\n\nMWOS is now two points behind Simba with 41 points, with 13 games to go.\n\nElsewhere at Mandava Stadium, FC Platinum maintained its unbeaten run with a 2-1 win over bottom-placed Kwekwe United.\n\nThe win was a big boost for FC Platinum, who leapfrogged two teams to go to number 3 with 37 points.\n\nPure Platinum Play remains the only team yet to be beaten this season; at the same time, they have a game in hand against Manica Diamonds.\n\nPSL Wednesday Results\n\nFull-time:\n\nNgezi Platinum 1-0 CAPS United\n\nTelOne 2-0 Simba Bhora\n\nZPC Kariba 1-1 MWOS\n\nFC Platinum 2-1 Kwekwe United\n\nYadah 1-1 Greenfuel\n\nHerentals 1-0 Chicken Inn\n\nThursday Fixture\n\nDynamos vs Manica Diamonds (Rufaro)\n\nBikita Minerals 7 (Gibbo Stadium)\n\nHighlanders vs. Triangle (Barbourfields)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23195657/telone-fc.jpg",
            "description": "<p>By Sports Reporter Simba Bhora’s ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium. The Wifi Boys’ two goals came in the second half through Milton Chimedza and Washington Navaya. So important was the win for Tel One that it reduced the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/\">Tel One beats log leaders Simba Bhora, as FC Platinum close gap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        },
        {
            "title": "Top UN court says countries can sue each other over climate change",
            "url": "https://www.newzimbabwe.com/top-un-court-says-countries-can-sue-each-other-over-climate-change/",
            "content": "BBC\n\nA landmark decision by a top UN court has cleared the way for countries to sue each other over climate change, including over historic emissions of planet-warming gases.\n\nBut the judge at the International Court of Justice in the Hague, Netherlands on Wednesday said that untangling who caused which part of climate change could be difficult.\n\nThe ruling is non-binding but legal experts say it could have wide-ranging consequences.\n\nIt will be seen as a victory for countries that are very vulnerable to climate change, who came to court after feeling frustrated about lack of global progress in tackling the problem.\n\nThe unprecedented case at the International Court of Justice (ICJ) was the brainchild of a group of young law students from low-lying Pacific islands on the frontlines of climate change, who came up with the idea in 2019.\n\nOne of those students, Siosiua Veikune from Tonga, was in the Hague to hear the decision.\n\nIm lost for words. This is so exciting. Theres a ton of emotions rushing through us. This is a win we take proudly back home to our communities, he told BBC News.\n\nTonight Ill sleep easier. The ICJ has recognised what we have lived through  our suffering, our resilience and our right to our future, said Flora Vano, from the Pacific Island Vanuatu, which is considered the country most vulnerable to extreme weather globally.\n\nThis is a victory not just for us but for every frontline community fighting to be heard.\n\nThe ICJ is considered the worlds highest court and it has global jurisdiction. Lawyers have told BBC News that the opinion could be used as early as next week, including in national courts outside of the ICJ.\n\nCampaigners and climate lawyers hope the landmark decision will now pave the way for compensation from countries that have historically burned the most fossil fuels and are therefore the most responsible for global warming.\n\nMany poorer countries had backed the case out of frustration, claiming that developed nations are failing to keep existing promises to tackle the growing problem.\n\nBut developed countries, including the UK, argued that existing climate agreements, including the landmark UN Paris deal of 2015, are sufficient and no further legal obligations should be imposed.\n\nOn Wednesday the court rejected that argument.\n\nJudge Iwasawa Yuji also said that if countries do not develop the most ambitious possible plans to tackle climate change this would constitute a breach of their promises in the Paris Agreement.\n\nHe added that broader international law applies, which means that countries which are not signed up to the Paris Agreement  or want to leave, like the US  are still required to protect the environment, including the climate system.\n\nThe courts opinion is advisory, but previous ICJ decisions have been implemented by governments, including when the UK agreed to hand back the Chagos Islands to Mauritius last year.\n\nThe ruling is a watershed legal moment, said Joie Chowdhury, Senior Attorney at the Centre for International Environmental Law (CIEL).\n\nWith todays authoritative historic ruling, the International Court of Justice has broken with business-as-usual and delivered a historic affirmation: those suffering the impacts of climate devastation have a right to remedy for climate harm, including through compensation, she added.\n\nA spokesperson for the UKs Foreign, Commonwealth and Development Office said it was taking time to look at the opinion before commenting in detail, but added:\n\nTackling climate change is and will remain an urgent UK and global priority. Our position remains that this is best achieved through international commitment to the UNs existing climate treaties and mechanisms.\n\nThe court ruled that developing nations have a right to seek damages for the impacts of climate change such as destroyed buildings and infrastructure.\n\nIt added that where it is not possible to restore part of a country then its government may want to seek compensation.\n\nThis could be for a specific extreme weather event if it can be proved that climate change caused it, but the Judge said this would need to be determined on a case by case basis.\n\nThis is a huge win for climate vulnerable states. Its a huge win for Vanuatu, which led this case and is going to change the face of climate advocacy, said barrister Stephanie Robinson at Doughty Street Chambers, who represented the Marshall Islands.\n\nIt is not clear how much an individual country could have to pay in damages if any claim was successful.\n\nBut previous analysis published in Nature, estimated that between 2000 and 2019 there were $2.8 trillion losses from climate change  or $16 million per hour.\n\nDuring the evidence sessions in December, the court heard from dozens of Pacific Islanders who have been displaced as a result of rising sea level, caused by climate change.\n\nThe Marshall Islands highlighted that the costs for their island to adapt to climate change are $9 billion.\n\nThat is $9 billion the Marshall Islands does not have. Climate change is a problem they have not caused, but they are forced to consider relocating their capital, said Ms Robinson.\n\nAs well as compensation, the court also ruled that governments were responsible for the climate impact of companies operating in their countries.\n\nIt said specifically that subsidising the fossil fuel industry or approving new oil and gas licenses could be in breach of a countrys obligations.\n\nDeveloping countries are already exploring bringing new cases seeking compensation for historic contributions to climate change against richer, high emitting nations citing the ICJ opinion, according to lawyers the BBC spoke to.\n\nIf a country wants to bring a case back to the ICJ to make a ruling on compensation then it can only do so against countries which have agreed to its jurisdiction, which includes the likes of the UK, but not US or China.\n\nBut a case can be brought in any court globally, whether that be domestic or international, citing the ICJ opinion, explained Joie Chowdhury from CIEL.\n\nSo instead a country may choose to take their case not to the ICJ but a court where those countries are bound e.g. federal courts in the US.\n\nBut the question remains whether the ICJ opinion will be respected.\n\n[The ICJ] is an institution that is subject to geopolitics  and it relies on states adhering to its judgements, it doesnt have a police force, said Harj Narulla, a climate barrister at Doughty Street Chambers, which also represented the Solomon Islands.\n\nWhen asked about the decision, a White House spokesperson told BBC News:\n\nAs always, President Trump and the entire Administration is committed to putting America first and prioritising the interests of everyday Americans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23204139/court-climate-change.webp",
            "description": "<p>BBC A landmark decision by a top UN court has cleared the way for countries to sue each other over climate change, including over historic emissions of planet-warming gases. But the judge at the International Court of Justice in the Hague, Netherlands on Wednesday said that untangling who caused which part of climate change could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-un-court-says-countries-can-sue-each-other-over-climate-change/\">Top UN court says countries can sue each other over climate change</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:31",
            "date": "24 Jul 2025"
        }
    ]
}