{
    "news": [
        {
            "title": "Lack of modern machines hindering specialised treatment in referral hospitals – government",
            "url": "https://www.newzimbabwe.com/lack-of-modern-machines-hindering-specialised-treatment-in-referral-hospitals-government/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT says it is in the process of acquiring modern machines to conduct open-heart surgeries at major hospitals in the country, a lack of which has hindered specialised treatment.\n\nThis follows a series of childrens open-heart surgeries conducted recently at Parirenyatwa Hospital by specialist doctors from Egypt, as part of the governments partnership programme.\n\nFor a country grappling with a poor health system, the programme was a shot in the arm for heart patients.\n\nSpeaking in Parliament recently, the Deputy Minister of Health, Sleiman Kwidini, said the government is procuring machines to decentralise open-heart surgery operations.\n\nWe want you to bear with us that it is not yet at full capacity because of the staff attrition and other modern equipment which we are now procuring to make sure that it will be in full function. It will be decentralised in all our central hospitals, as you are aware that all our central hospitals have specialists who can perform these surgeries.\n\nWhat is now hindering them is the modern equipment to use for that, but definitely with time, we are going to make sure that it is going to be done to our locals and to our people for free, said Kwidi.\n\nThe lack of medical equipment in major public hospitals has left many citizens to seek treatment outside the country.\n\nHowever, the poor who cannot afford specialised treatment in foreign countries and private medical facilities have to contend with the dire services in public hospitals.\n\nKwidini made a bold assertion that the government is addressing the countrys healthcare systems.\n\nWith that, as per our policy, we want to make sure that these trained specialist doctors locally are going to be capacitated, especially with the tools of trade.\n\nThat is why we have seen now that our President has moved to the mantra to say, let us renovate our health institutions into the modern systems to ensure that we are able to do the specialised treatment which people are seeking on these major operations, especially in India and other countries, said Kwidini.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21182800/Sleiman-Kwidini.webp",
            "description": "<p>By Darlington Gatsi GOVERNMENT says it is in the process of acquiring modern machines to conduct open-heart surgeries at major hospitals in the country, a lack of which has hindered specialised treatment. This follows a series of children’s open-heart surgeries conducted recently at Parirenyatwa Hospital by specialist doctors from Egypt, as part of the government’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lack-of-modern-machines-hindering-specialised-treatment-in-referral-hospitals-government/\">Lack of modern machines hindering specialised treatment in referral hospitals – government </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "Doctors’ shortage hits Zimbabwe as healthcare professionals leave in droves",
            "url": "https://www.newzimbabwe.com/doctors-shortage-hits-zimbabwe-as-healthcare-professionals-leave-in-droves/",
            "content": "By Darlington Gatsi\n\nZIMBABWEs healthcare system is burdened by a shortage of medical doctors, who are leaving in droves for greener pastures, affecting the delivery of health services, a government official has said.\n\nThe countrys fragile health system has been strained by the lack of healthcare professionals, who are leaving public hospitals due to a poor working environment marked by low salaries and a lack of medical supplies.\n\nThis has left marginalised communities, such as those in rural areas, without medical professionals to provide services.\n\nSpeaking in the National Assembly recently, the Deputy Minister of Health, Sleiman Kwidini, said the migration of doctors abroad has had a negative impact, particularly in rural areas.\n\nRight now, the challenge of us not getting doctors in these hospitals is that we are still training more doctors because doctors have left the country for greener pastures. Therefore, we are looking forward to having more doctors in 2029 to 2030 to service these rural hospitals, said Kwidini.\n\nThis has left citizens in rural areas in a quandary, forcing them to walk long distances to access medical services.\n\nKwidini said this is a result of a lack of accommodation facilities at some rural clinics.\n\nIt is true that we need doctors in rural hospitals so that elderly people do not have to travel long distances to see doctors. We have a challenge with the doctors houses in district hospitals. This is the challenge that we are facing, which then results in elderly people failing to find those doctors in rural hospitals.\n\nThere is no accommodation for these doctors, but as soon as we put in place accommodation, they will be found nearer to them. For us to put doctors in clinics, it is difficult because the patient ratio is not enough, he said.\n\nThe countrys health system is in dire straits, leaving the majority to rely on private facilities, with the poor left to contend with the public hospitals.\n\nPresident Emmerson Mnangagwa has pledged to address the situation at public hospitals, with a section of Parirenyatwa Hospital undergoing renovations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/29054941/Doctor.jpg",
            "description": "<p>By Darlington Gatsi ZIMBABWE’s healthcare system is burdened by a shortage of medical doctors, who are leaving in droves for greener pastures, affecting the delivery of health services, a government official has said. The country’s fragile health system has been strained by the lack of healthcare professionals, who are leaving public hospitals due to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctors-shortage-hits-zimbabwe-as-healthcare-professionals-leave-in-droves/\">Doctors’ shortage hits Zimbabwe as healthcare professionals leave in droves </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "Zimbabwean student dies eight days after attack in India",
            "url": "https://www.newzimbabwe.com/zimbabwean-student-dies-eight-days-after-attack-in-india/",
            "content": "Times of India\n\nBathinda: After battling for life for eight days at AIIMS Bathinda, Zimbabwean student Ziweya Leeroy passed away on Thursday.\n\nZiweya (22) was attacked on August 13, a day after he had an altercation with Guru Kashi University security guard Dilpreet Singh.\n\nHe was pursuing BSc Radiology and Imaging Technology (RIT) and joined Guru Kash University, Talwandi Sabo, in 2023.\n\nPolice have arrested seven accused and added section 103 BNS (murder) in the already registered case at Talwandi Sabo police station.\n\nTalwandi Sabo police station ASI Des Raj, in his complaint, stated that during initial investigations, it was found that Ziweya Leeroy had an altercation with security guard Dilpreet Singh on Aug 12. Owing to it, Dilpreet, along with Lovepreet, Mangu, and Manpreet Singh, attacked Leeroy when he went out of the university on Aug 13.\n\nLeeroy, with serious head injuries, was admitted to AIIMS Bathinda, and a case under Sections 109 (attempt to murder), 126 (2) wrongful restraint, 115 (2) voluntarily causing hurt, 190 (unlawful assembly), and 191 (3) BNS rioting committed with a deadly weapon was registered against security guard Dilpreet Singh, Lovepreet Singh, Mangu Singh, Manpreet Singh, and others.\n\nBathinda SSP Amneet Kondal said, Seven persons have been arrested, and efforts are being made to arrest two more persons, who are suspected to be associated with the attack. The section pertaining to murder has been added to the already registered case. Further investigations are being made.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21171314/leeroy-.jpg",
            "description": "<p>Times of India Bathinda: After battling for life for eight days at AIIMS Bathinda, Zimbabwean student Ziweya Leeroy passed away on Thursday. Ziweya (22) was attacked on August 13, a day after he had an altercation with Guru Kashi University security guard Dilpreet Singh. He was pursuing BSc Radiology and Imaging Technology (RIT) and joined</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-student-dies-eight-days-after-attack-in-india/\">Zimbabwean student dies eight days after attack in India</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "ZimParks successfully relocates 74 wildlife to revive Matusadona",
            "url": "https://www.newzimbabwe.com/zimparks-successfully-relocates-74-wildlife-to-revive-matusadona/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks), working with the Matusadona Conservation Trust, has successfully translocated 74 large herbivores to restore biodiversity in Matusadona National Park.\n\nThe month-long operation,completed in July 2025, according to ZimParks spokesperson Tinashe Farawosaw the relocation of 50 African buffalo and 10 common eland from Tsetse Island on Lake Kariba, along with 14 sable antelope from the Sibilobilo Safari Area on the Zambezi River.\n\nThis marks an important milestone in ongoing conservation efforts within Matusadona National Park, Farawo said.\n\nThese operations represent a significant step in the ongoing restoration of one of Zimbabwes most important conservation areas.\n\nFarawo said feasibility assessments were carried out beforehand to ensure the sustainability of the species and the long-term health of the parks ecosystem.\n\nHe said the translocations are expected to revive graze and browse dynamics, strengthen prey bases, and enhance ecosystem resilience across the Sebungwe region.\n\nThe translocations will help restore the ecological balance of the park, while supporting the broader restoration of the Sebungwe Region in the years to come, he said.\n\nThe initiative also received strong backing from the Nyaminyami community, whose newly ratified Land Use Plan, approved by the Minister of Local Government on July 29, was hailed as exceptional conservation leadership reinforcing long-term wildlife protection goals.\n\nDemonstrating world-class collaboration, the translocations were carried out with the expertise of African Wildlife Management and Conservation (AWMC), Wildlife Management Services International (WMSI), and Matusadonas Conservation and Veterinarian Unit.\n\nFunding was provided by both local and international donors, including the Global Wildlife Fund.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/14144612/MATUSADONHA.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority (ZimParks), working with the Matusadona Conservation Trust, has successfully translocated 74 large herbivores to restore biodiversity in Matusadona National Park. The month-long operation, completed in July 2025, according to ZimParks spokesperson Tinashe Farawosaw the relocation of 50 African buffalo and 10 common eland from Tsetse Island</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-successfully-relocates-74-wildlife-to-revive-matusadona/\">ZimParks successfully relocates 74 wildlife to revive Matusadona</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "Zimbabwe’s Rainbow Tourism Group invests R100 million in Cape Town hotel acquisition",
            "url": "https://www.newzimbabwe.com/zimbabwes-rainbow-tourism-group-invests-r100-million-in-cape-town-hotel-acquisition/",
            "content": "By Tawanda Karombo | IOL\n\nZimbabwe-listed hotelier, Rainbow Tourism Group (RTG), is expanding into South Africa with the $5.6 million (nealry R100 million) acquisition of a Cape Town commercial property that it intends to turn into a prime hotel.\n\nRTG, which runs city and resort hotels in Zimbabwe, said on Thursday that it wasin the process of finalising a strategicacquisition in Cape Townthrough its South African-registered subsidiary,Rainbow Tourism Group (SA).\n\nRTG SA hasentered into asale andpurchaseagreement withElleke Hospitality forthis acquisition. Under the agreement, RTG will acquire theseven-storey commercial property locatedalongBuitengracht StreetinCape Town.\n\nThe property which is currently a commercial asset,will undergo adaptive reuse and refurbishment to transform it into a branded hotel operated undera leading international hospitality group, said Tapiwa Mari, RTG company secretary.\n\nThe total consideration for the acquisition is roughly 9.3% of the companys market capitalisation on the Zimbabwe Stock Exchange (ZSE).\n\nRTG said the acquisition of the Cape Town property and its development into a branded hotel was in alignment with the boards overarching mandate to identify and pursue growthopportunities that support thecompanyslong-term vision of expansion.\n\nTo ensure world-class delivery, the Company is presently in advanced discussions with reputableinternational hotel brands to secure a management agreement for the acquired property, explained Mari.\n\nPartnering witha global operator is expected to drive international skills transfer, operational efficiency, and increasedvisibility of the RTG brand on the global stage.\n\nThe redevelopment of the property intoa modern, fully operationalhotelwill beconsistent with international hospitality standardsguided by thespecifications and brand standards of the selected global hotel partner.\n\nThis will ensure that the final productmeets world-class benchmarks in design, guest experience, and servicedelivery.\n\nRTG plans the Cape Town hotel tostand as a competitive and high-impact asset within Cape Towns hospitality landscape.\n\nTo finance the acquisition,RTGhas secured $6mloan facility from a Zimbabwean finance institution at terms it said were consistent with itsexisting borrowing arrangements.The loan facilitycarries a fixed interest rate of 12.5% per annum with a tenure of five years.\n\nOn drawdown, theloanfacility is expected toraise RTGsgearing ratio from 9% as at the endof 2024 to approximately 32% post the transaction.\n\nWith a premium location along a major arterial route leading into Cape Towns Central Business District (CBD)andofferinghigh visibility and pedestrian traffic,the acquisition property has closeproximity to key business and leisure landmarkssuch asincluding the V&A Waterfront, Cape Town International Convention Centre (CTICC), the DHL Cape TownStadium and the Bo-Kaap tourist district.\n\nThis premium location positions theproperty as an ideal candidate for conversion into a hotel development that caters to both corporateand leisure travellers, noted Mari.\n\nIts proximity to the CTICC enhances its suitability for the Meetings, IncentivesConferences, and Exhibitions (MICE) segment, while the surrounding cultural, culinary, and recreationalattractions boost its appeal to domestic and international tourists alike.\n\nThe Cape Town acquisition presents an opportunity to diversify both the Groups balance sheet and revenue streams byestablishing a presence in one of Africas most vibrant and competitive tourismmarkets.\n\nCape Townis aglobally acclaimed destination and a key hospitality hubofferingstrong market fundamentals, includinghigh occupancy rates, well-developed infrastructure, and year-round international visitor appeal.\n\nMari said establishing a footprint in this environment not only enhancesRTGsregional and global profilebut also provides direct access to global best practices in hospitality operations, customer experience,and service excellence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/09015520/Vic-Falls-Hotel.png",
            "description": "<p>By Tawanda Karombo | IOL Zimbabwe-listed hotelier, Rainbow Tourism Group (RTG), is expanding into South Africa with the $5.6 million (nealry R100 million) acquisition of a Cape Town commercial property that it intends to turn into a prime hotel. RTG, which runs city and resort hotels in Zimbabwe, said on Thursday that it was in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-rainbow-tourism-group-invests-r100-million-in-cape-town-hotel-acquisition/\">Zimbabwe’s Rainbow Tourism Group invests R100 million in Cape Town hotel acquisition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "Number of asylum seekers housed in hotels up 8% in a year, UK Home Office data shows",
            "url": "https://www.newzimbabwe.com/number-of-asylum-seekers-housed-in-hotels-up-8-in-a-year-uk-home-office-data-shows/",
            "content": "The Guardian\n\nThe number of asylum seekers being housed in hotels has risen by 8% to 32,059 in a year, according toHome Officedata.\n\nThe data also shows that the government is processing asylum applications much more quickly, with 71,000 cases awaiting approval, relating to 91,000 people, compared with 134,000 two years ago.\n\nThe figures come amidgrowing clamour from councilsto block hotels being used to house asylum seekers through legal action, after a court ruled that more than 100applicants staying in Essex should be removed.\n\nThe high court judgment has led to ministers bracing for further legal challenges from across the country and pressure on the government to find other places to house people.\n\nThe latest Home Office figures, published on Thursday as part of the usual quarterly immigration statistics, cover Labours first year in office.\n\nThere were 32,059 asylum seekers in UK hotels by the end of June, up from 29,585 at the same point a year earlier, when the Conservatives were still in power, but down slightly on the 32,345 figure at the end of March.\n\nThe latest number is still below the peak of 56,042 asylum seekers in hotels at the end of September 2023 under the Tories.\n\nFor the first time in four years, the asylum applications backlog has fallen below 100,000 people. It is now just over 70,000 cases, relating to almost 91,000 people  down by 18% from a year earlier and its lowest since September 2021.\n\nIn the year ending June 2025, the Home Office forcibly removed 9,100 people  up a quarter on the previous year. More than half were foreign national offenders who were being deported at the end of sentences.\n\nEnver Solomon, the chief executive of the Refugee Council, said: Bringing the asylum system back from the brink of collapse is a genuine achievement in the governments first year. The increase in asylum decisions means refugees can begin to rebuild their lives sooner, and the use of costly hotels can be ended faster.\n\nYvette Cooper, the home secretary, said: The action we have taken in the last 12 months  increasing returns of failed asylum seekers by over 30%, cutting asylum costs by 11%, reducing the backlog by 18% and our forthcoming plans to overhaul the failing asylum appeal system  are crucial steps to restoring order, and putting an end to the chaotic use of asylum hotels that we inherited from the previous government.\n\nOn Tuesday, the Conservative-run authority in Epping Forest won a temporary high court injunction to remove people from the Bell hotel.\n\nAbout 140 asylum seekers must leave the hotel by 12 September after the high court imposed a temporary injunction against them staying there.\n\nThe Labour-run Wirral and Tamworth councils are among more than 10 that are reportedly considering legal challenges to close hotels housing asylum seekers in their area.\n\nOn Tuesday, Chris Philp, the shadow home secretary, named three Conservative councils that were considering legal action in efforts to shut down asylum hotels in their areas.\n\nAsked how many Tory councils were considering legal action, he told BBC Breakfast: There are certainly a number who are actively considering it. Broxbourne, which is next door to Epping, is one of them. I think Reigate and Banstead is another, Hillingdon is yet a third.\n\nSo, I think there are many up and down the country who are looking at this following the Epping ruling.\n\nWhitehall sources said the government was expected to appeal against the Epping ruling.\n\nCharles Falconer, a Labour peer who served as justice secretary under Tony Blair and was previously Starmers shadow attorney general, urged ministers to appeal.\n\nHe told the BBC Radio 4 Today programme the judgment causes great problems because it gives rise to the expectation that some asylum hotels can be closed but without indicating which ones.\n\nI very strongly urge the government  I dont know what theyre going to do  to appeal and get some certainty, first of all on which should be closed  and which shouldnt, secondly to deal with the question of a reasonable timescale in relation to this, and thirdly to deal with this very troublesome issue: namely, do demonstrations outside these hostels lead it to it being more likely that they will be closed, he said.\n\nThe Democratic Unionist party (DUP) is also seeking to remove asylum seekers from hotels in Northern Ireland after the landmark ruling in England.\n\nAntrim & Newtownabbey borough council has launched an enforcement investigation into the use of the Chimney Corner in Mallusk to house asylum seekers after a complaint by the DUP Stormont assembly member Trevor Clarke.\n\nThe party  the second-biggest in Northern Ireland  would also lodge complaints about the other two hotels that house asylum seekers in two other council areas, Clarke said.\n\nWednesdayshigh court rulingthat the Bell hotel in Essex cannot be used to house asylum seekers because of a breach of planning rules paved the way for similar legal challenges, Clarke said.\n\nHousing asylum seekers in hotels without first securing a change of use through the proper planning process (from hotel to hostel or immigration centre accommodation) constitutes a breach of planning regulations. No one is above the law, not even government departments. If the Home Office or its contractors wish to place large numbers of illegal immigrants into our communities, they must follow the same planning rules as everyone else.\n\nThe other hotels that house asylum seekers in Northern Ireland were in the Causeway Coast and Glens and the Ards and North Down council areas, theIrish News reported.\n\nHome Office spending on asylum in the UK stood at 4.76bn in 2024-25, down 12% from a record 5.38bn in 2023-24, government figures show. The total covers all Home Office costs related to asylum, including direct cash support and accommodation, plus wider staffing and other migration and borders activity.\n\nAsylum seekers and their families can be housed in temporary accommodation, known as contingency accommodation, if they are awaiting assessment of their claim or have had a claim approved and there is not enough longer-term accommodation available.\n\nWhen there is not enough housing, the Home Office, which has a legal obligation to provide accommodation to asylum seekers who would otherwise be destitute, can move people to alternatives such as hotels and large sites, such as former military bases.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21195443/skynews-immigration-hotel_6996296.jpg",
            "description": "<p>The Guardian The number of asylum seekers being housed in hotels has risen by 8% to 32,059 in a year, according to Home Office data. The data also shows that the government is processing asylum applications much more quickly, with 71,000 cases awaiting approval, relating to 91,000 people, compared with 134,000 two years ago. The figures come</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/number-of-asylum-seekers-housed-in-hotels-up-8-in-a-year-uk-home-office-data-shows/\">Number of asylum seekers housed in hotels up 8% in a year, UK Home Office data shows</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "WFP donates vehicles to Public Service Ministry for social protection services",
            "url": "https://www.newzimbabwe.com/wfp-donates-vehicles-to-public-service-ministry-for-social-protection-services/",
            "content": "By Anna Chibamu\n\nTHE World Food Programme (WFP) has donated vehicles to the Public Service Ministry to enhance the delivery of essential social protection and assistance services in communities across Zimbabwe.\n\nThe vehicles include five Toyota Prados and four Land Cruisers valued at a total of US$229,905.\n\nSpeaking during the handover ceremony attended by the Public Service minister Edgar Moyo in Harare this Thursday, WFP country director Barbra Clemens said she hoped the vehicles will make a difference to those in need.\n\nIt is my great honour to be here today for this important handover ceremony.\n\nOn behalf of the World Food Programme, I am delighted to officially present nine vehicles (five Toyota Prados and four Land Cruisers) valued at USD229,905 to the Ministry of Public Service, Labour and Social Welfare.\n\nThis is more than just a set of keys; it is a symbol of our strong and enduring partnership with the government of Zimbabwe.\n\nThese vehicles will help strengthen the ministrys ability to reach communities across the country, to deliver essential social protection and assistance services, and to respond effectively to the needs of vulnerable households, Clemens said.\n\nClemens said the need for food assistance and social protection had grown in Zimbabwe.\n\nToday, that dual responsibility remains as pressing as ever. The demand for social protection, food assistance, and resilience-building continues to grow and central to delivering these services is reliable mobility, ensuring that officials and teams can reach every corner of the country quickly, safely, and effectively.\n\nThese nine vehicles are therefore an investment in delivery capacity. They will support the ministry in monitoring programmes, reaching vulnerable communities, and ensuring that national social protection and food assistance systems are stronger, faster, and more responsive. In this way, becoming tools of service and impact, added Clemens.\n\nIn addition to the vehicles, WFP also donated digital media equipment to aid the ministrys communications work as documenting progress, sharing stories, and enhancing visibility were equally vital in strengthening accountability and mobilising support.\n\nAs he received the keys to one of the vehicles for a test drive, Moyo said, It is with great pleasure that we gather here to receive yet another post from the World Food Programme in the form of vehicles.\n\nThe minister remains grateful for the support that the World Food Programme continues to render in this commitment to the people of Zimbabwe in ensuring food security goals are met.\n\nWe continue to make a difference in the delivery of social protection services in the ministry, Moyo said.\n\nHe commended WFP for the provision of support to the government and empowering its staff in the districts where it is present.\n\nIt has been noted that in all the districts that you have provided support, the staff are more empowered in claim distribution, supply chain management and logistical arrangements.\n\nThe ministry desires that you continue to spread this knowledge across the other districts we have not yet implemented. As we jointly implement the food deficit mitigation strategy, we insist on assistance.\n\nMoyo highlighted, We noted gaps, and I am glad that we are here today to pluck one of those gaps through motorisation of the department. You have helped me accept the main variables, which will go a long way to support our social protection programs and facilitate program implementation, enabling the ministry to meet its targets as we look forward to completing the implementation of NTS1 and getting NTS2 towards vision 2030.\n\nSaid Moyo: We rest assured that the ministry will ensure that these variables are put to good use and managed according to government policies and regulations. Priorities shall be given to the hard-to-reach areas, considering terrain in a bid to leave no one and no place behind. May I, on behalf of the Government of Zimbabwe, take this opportunity to thank the World Food Programme for its continued support.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21192323/wfp-edgar.jpeg",
            "description": "<p>By Anna Chibamu THE World Food Programme (WFP) has donated vehicles to the Public Service Ministry to enhance the delivery of essential social protection and assistance services in communities across Zimbabwe. The vehicles include five Toyota Prados and four Land Cruisers valued at a total of US$229,905. Speaking during the handover ceremony attended by the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wfp-donates-vehicles-to-public-service-ministry-for-social-protection-services/\">WFP donates vehicles to Public Service Ministry for social protection services</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "Four Zim referees selected for September World Cup Qualifiers",
            "url": "https://www.newzimbabwe.com/four-zim-referees-selected-for-september-world-cup-qualifiers/",
            "content": "By Sports Reporter\n\nFour Zimbabwean referees have been selected to officiate during the upcoming 2026 World Cup Qualifiers in September.\n\nThe four selected referees are Brighton Chimene, Luckson Mhara, Edgar Rumeck, and Lawrence Zimhondi.\n\nCenter referee Brighton Chimene and the trio will take charge of the match between the Democratic Republic of Congo and South Sudan on the 5th of September at the National Stadium in Juba.\n\nLuckson Mhara and Edgar Rumeck will serve as assistant referees, while Lawrence Zimhondi will be the fourth match official.\n\nThe quartets appointment is a testament to how well Zimbabwean match officials are performing on the international stage.\n\nChimene is currently officiating at the ongoing CHAN tournament, making him the only Zimbabwean referee at the games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Four Zimbabwean referees have been selected to officiate during the upcoming 2026 World Cup Qualifiers in September. The four selected referees are Brighton Chimene, Luckson Mhara, Edgar Rumeck, and Lawrence Zimhondi. Center referee Brighton Chimene and the trio will take charge of the match between the Democratic Republic of Congo and South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-zim-referees-selected-for-september-world-cup-qualifiers/\">Four Zim referees selected for September World Cup Qualifiers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        },
        {
            "title": "Former clinic accountant jailed nine years for fraud and money laundering",
            "url": "https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/",
            "content": "By Mary Taruvinga\n\nThe Harare Magistrates Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering.\n\nAfter a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial.\n\nIn sentencing, the magistrate imposed a nine-year jail term, of which six years were suspended.\n\nThree were scrapped on condition of good behaviour and another three on condition of restitution.\n\nShayimana will serve an effective three-year prison term for fraud.\n\nOn the money laundering charge, he was handed a five-year sentence wholly suspended.\n\nMagistrates heard that between August 2023 and March 2024, Shayimana created and used fake company email accounts to mislead medical aid societies, fraudulently instructing them to divert payments due to the clinic into his First Capital Bank account and Ecobank Nostro account.\n\nProsecutors revealed that he pocketed ZWL$15,362,415, ZIG$95,409 and US$123,739, which he later converted into personal assets.\n\nThe offender deliberately abused his position of trust and orchestrated a sophisticated scheme to deprive the clinic and medical societies of large sums of money, the court noted.\n\nWith the proceeds of crime, Shayimana purchased a residential stand in Budiriro for US$6,500, developed it into a seven-roomed house complete with a durawall, security cameras and solar system, and also bought a Nissan NV200 vehicle. Both the house and the vehicle have since been forfeited to the State.\n\nThe court said deterrent penalties in cases of insider fraud would serve justice.\n\nConvicted white-collar criminals will face stiff penalties and ill-got wealth will be forfeited, the National Prosecuting Authority said, commenting on the conviction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga The Harare Magistrates’ Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering. After a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial. In sentencing, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/\">Former clinic accountant jailed nine years for fraud and money laundering</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:44",
            "date": "22 Aug 2025"
        }
    ]
}