{
    "news": [
        {
            "title": "In-house vs External Training in Health and Social Care",
            "url": "https://www.newzimbabwe.com/in-house-vs-external-training-in-health-and-social-care/",
            "content": "By Dr Richard Dune\n\nWhy blended learning strategies are becoming a compliance essential for health, social care and education providers\n\nIn the UKs heavily regulated health and social care environment, training is not a nice-to-have, but a non-negotiable requirement. For organisations operating under the scrutiny of theCare Quality Commission(CQC), local authorities and service commissioners, training forms the foundation of workforce development, governance, and regulatory compliance.\n\nWhether its safeguarding, infection prevention, medication administration, or supervision and appraisal, training must be consistent, compliant, and aligned with both operational needs and legal frameworks. Yet many leaders still face a critical question:\n\nShould training be delivered in-house or outsourced to external providers?\n\nIn this article,Dr Richard Duneexamine the strengths and weaknesses of each approach, explores why blended learning models are becoming the preferred option, and highlights how digital compliance systems such asComplyPlusare helping health, social care, and education providers deliver training that is strategic, efficient, and inspection-ready.\n\nHealth and social care training is not merely a workforce development function. It is a pillar of compliance. Providers are required to deliver training that enables staff to perform safely, ethically, and effectively across diverse settings, be it a residential care home, healthcare clinic, a supported living facility or a domiciliary service.\n\nEffective training programmes must support:\n\nFailure to provide this can result in enforcement action, reputational damage, or poor inspection ratings.\n\nIn-house training strengthens internal capacity by enabling staff to deliver tailored learning. The following outlines what it is, its advantages, and the challenges organisations need to address:\n\nIn-house trainingrefers to learning and development delivered internally by a providers own staff. Typically, trainers hold credentials such asTrain the Traineror the Award in Education and Training (AET) and are responsible for cascading knowledge across the workforce.\n\nIn-house delivery is commonly used for:\n\nThis model enables organisations to create training experiences that reflect their internal processes, service users, and local context.\n\nWhen implemented well, in-house training offers multiple benefits:\n\nBy using internal trainers, organisations can ensure training is deeply embedded in practice and reflective of their governance and compliance structures.\n\nHowever, internal training has its limitations, including:\n\nTo be effective, in-house training requires robust planning, adequate resourcing, and integration with digital compliance systems like LMS and TMS platforms.\n\nExternal training brings accredited expertise and fresh perspectives into organisations. The following outlines what it is, its advantages, and the challenges providers should consider:\n\nExternal training refers to programmes delivered by third-party providers, including independent consultants or established training organisations. These may offer accredited qualifications, CPD courses, or modules for regulatory compliance.\n\nExternal training formats range from:\n\nExternal training is often used for high-risk, regulated, or highly specialised areas.\n\nWhen used strategically, external training offers several high-value benefits that can enhance both compliance and service quality:\n\nExternal training is ideal for topics that require independent verification, specialist accreditation, or knowledge outside the organisations internal capacity.\n\nDespite its benefits, external training also presents practical and strategic challenges that providers must carefully consider:\n\nExternal training is a powerful tool, but must be strategically selected, reviewed, and quality-assured to deliver value and compliance assurance.\n\nThe COVID-19 pandemic transformed how providers approach training. With restrictions on face-to-face interaction, organisations turned to e-learning platforms and digital compliance systems to maintain training obligations.\n\nThe result? A lasting shift in how training is delivered.\n\nAs digital learning becomes more embedded in training strategies, providers are seeing a range of measurable benefits across compliance, efficiency, and accessibility:\n\nDigital training has now become a core component of compliance infrastructure, bridging the gap between in-house and external delivery.\n\nRecognising the benefits and drawbacks of both models, many providers are adopting blended training strategies, combining in-house training, external expertise, and digital integration.\n\nThis model aligns closely with regulatory expectations, supporting cost control, consistency, and quality assurance.\n\nBlended training brings together the strengths of in-house delivery, the expertise of external providers, and the efficiency of digital integration to create a comprehensive, compliant, and sustainable training strategy.\n\nIn-house training is typically used for:\n\nExternal training is usually applied to:\n\nDigital integration enhances both models through:\n\nThis blended approach ensures training is flexible, high-quality, and aligned with governance and compliance requirements, regardless of how its delivered.\n\nA blended training strategy enables organisations to leverage the strengths of both internal and external delivery, supported by digital tools that enhance oversight and accountability. Key benefits include:\n\nTogether, these benefits make blended learning a strategic, scalable, and sustainable approach to workforce development and regulatory compliance.\n\nBefore deciding which training model to adopt, providers should ask:\n\nThese questions should be integrated into your broader governance and compliance strategy.\n\nAt The Mandatory Training Group, we developedComplyPlusto support providers in building compliant, blended training systems.\n\nOur all-in-one platform includes:\n\nWhether you run a care home, a multi-site nursery, a supported living service, or a complex group organisation, ComplyPlus helps you combine in-house capability with external assurance, all within one integrated platform.\n\nThe debate isnt in-house vs external training. Its about knowing when to use each and how to tie them together through smart governance, digital systems, and compliance strategy.\n\nThe most resilient organisations are those that treat training as a strategic compliance function, not just an HR process or a tick box exercise.\n\nDelivering the right training mix is more than a choice. Its a compliance requirement and a mark of great leadership.\n\nComplyPlus helps you:\n\nThis article was originally published onThe Mandatory Training Groupwebsite.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09114510/In-house-vs-External-Training-in-Health-and-Social-Care-ComplyPlus%E2%84%A2-Dr-Richard-Dune--scaled.jpg",
            "description": "<p>By Dr Richard Dune Why blended learning strategies are becoming a compliance essential for health, social care and education providers In the UK’s heavily regulated health and social care environment, training is not a nice-to-have, but a non-negotiable requirement. For organisations operating under the scrutiny of the Care Quality Commission (CQC), local authorities and service</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-house-vs-external-training-in-health-and-social-care/\">In-house vs External Training in Health and Social Care</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "09 Sep 2025"
        },
        {
            "title": "Cassper Nyovest embarks on weight loss journey after social media criticism",
            "url": "https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/",
            "content": "TshisaLive\n\nCassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29.\n\nAfter facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey.\n\nI was doing cardio all week. This time its a bit more fun because Im playing tennis. Next week Ill start weight training. The comments at the weekend were harsh. It hurt my feelings a bit but sometimes thats what you need, a little push, he said.\n\nIt is a projection, about how you feel about yourself. Body shaming and all of that. You dont know what Im going through. Im going to turn the lemons into lemonade.\n\nThis is not the first time Cassper has undergone a weight loss journey before his Fill Up concerts.\n\nIn 2022 Cassper did it before his Fill Up Mmabatho concert in Mahikeng.\n\nI cant explain how proud I am of myself. This was by far the hardest weight loss journey for me because I have done this three times and I now knew what it would take for me to get back in shape. To be honest, mentally I didnt feel like I was as strong as I once was and I was demoralised.\n\nIts supposed to get easier by the day but it got harder and harder. I just kept waking up and going. Lost touch with a lot of relationships and people because I zoned into this goal and I had no time for anyone but myself.\n\nLooking at these pictures now Im in awe of myself. I owe it to myself never to let myself go like that again. Big shout out to my training and nutrition team. Shout out to Fight Club for always having their doors open for me at any time I wanted to train. We four weeks out Boys! Lets put on a show! Im back!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09051311/nyovest.jpg",
            "description": "<p>TshisaLive Cassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29. After facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey. “I was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/\">Cassper Nyovest embarks on weight loss journey after social media criticism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "09 Sep 2025"
        },
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "09 Sep 2025"
        },
        {
            "title": "Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups",
            "url": "https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/",
            "content": "By Staff Reporter\n\nHIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwas son.\n\nHarare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto Road in Highlands. The potential buyer of the land, believed to be Collins Mnangagwa, is constructing a multi-storey building in the area and intends to close part of the public road.\n\nThe residents have been given a month to lodge objections and reasons with the City Council regarding the land.\n\nThe Highlands Residents Association has, via a petition, objected to the sale of the portion of the road by the City Council.\n\nWe, the undersigned residents and community members of Highlands and surrounding areas, hereby submit our formal objection to the proposed permanent road closure of a portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue hereinafter referred to as Otto Road as per the public notice), Highlands, Harare, as advertised in the Public Notice placed in The Herald on Tuesday 2 September 2025, read the petition.\n\nThe residents lashed out at the City Council for the lack of transparency in the process, arguing that the sale of the land deprives the public of the benefits it carries.\n\nOtto Road is public land. Its permanent closure and subsequent sale would deprive current and future residents of their right to access and benefit from public infrastructure.\n\nOtto Road provides a safe and established route for domestic workers, security guards, gardeners, pedestrians, cyclists, schoolchildren, walkers and joggers. Closing it will force vulnerable users onto busier, more dangerous routes.\n\nMany people who rely on Otto Road do not own cars. Closure would disproportionately harm women, children, and low-income workers who depend on safe non-motorised routes.\n\nThe proposed closure appears to serve private interests at the expense of the broader community. Council has a duty to uphold transparency and protect public assets for collective benefit, read the petition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Staff Reporter HIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwa’s son. Harare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/\">Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "09 Sep 2025"
        },
        {
            "title": "Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe",
            "url": "https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhalas home, describing it as a barbaric act of violence and urged authorities to thoroughly investigate and arrest perpetrators.\n\nThe incidentreportedlyoccurredon August 30while Sikhala was in South Africa launching his book,Footprints in the Chains: The Life Story of Job Sikhala.\n\nThe bomb attack came after Sikhalas book launch in Masvingo was violently disrupted by suspected Zanu PF activists who confiscated and tore some books, broke furniture and also physically assaulted some panelists at the launch.\n\nIn a statement Monday, ZHRC voiced grave concern over the safety of Sikhalas family, noting that children were reportedly inside the house when the incident occurred.\n\nThe ZHRC is concerned about this dangerous explosion, which, if it is an attack, it strongly condemns as a barbaric act of violence which threatens the enjoyment of a number of constitutionally guaranteed human rights, particularly the right to life.\n\nThe ZHRC is deeply concerned about the safety and well-being of Mr. Sikhalas family, especially the children who were reportedly present when the explosion took place.\n\nChildren must be shielded from all forms of violence, abuse, and neglect. Exposure of children to such traumatic events can have enduring psychological and emotional consequences, ZHRC said.\n\nThe human rights commission also urged law enforcement authorities to investigate the matter and bring the perpetrators to book.\n\nThe ZHRC acknowledges the swift response by thepoliceand otherstate agencies in attending to the scene and initiating investigations.\n\nIt commends these efforts and urges the authorities to pursue a timely,thoroughand impartial investigation toidentify andprosecute those responsible so that they are punished in a deterrent manner, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhala’s home, describing it as a “barbaric act of violence” and urged authorities to thoroughly investigate and arrest perpetrators. The incident reportedly occurred on August 30 while Sikhala was in South Africa launching his book, “Footprints in the Chains: The Life</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/\">Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "09 Sep 2025"
        },
        {
            "title": "Judge rejects father’s bid to reclaim house from son",
            "url": "https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a fathers attempt to revoke a property registered in his sons name, saying the case reflected evidence of a broken family.\n\nOnias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had purchased and donated to him.\n\nJustice Philda Muzofa, sitting in Chinhoyi, noted the unusual family feud: It is never easy for a father to drag his son to courts; this is just evidence of a broken family. Something must have gone seriously wrong.\n\nOnias argued the property was a donation that could be revoked because Pride had become disrespectful and violent towards him, and had even tried to sell it against his wishes.\n\nBut the court ruled there was never a valid donation. There was never an intention to gratuitously and without obligation give the 1st respondent the property, Justice Muzofa said. There were strings attached. The applicant intended to continue to derive a benefit from the property.\n\nThe judge stressed that while Onias funded the purchase, the house was always registered in Prides name. The evidence before the Court strongly shows that the applicant purchased the property for the 1st respondent and he had strings attached, the judge said.\n\nDismissing the claim with costs, the judge concluded: Revocation can only be made where there is a valid donation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a father’s attempt to revoke a property registered in his son’s name, saying the case reflected “evidence of a broken family.” Onias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/\">Judge rejects father’s bid to reclaim house from son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "09 Sep 2025"
        }
    ]
}