{
    "news": [
        {
            "title": "Man jailed 20 years for sexually abusing five-year-old",
            "url": "https://www.newzimbabwe.com/man-jailed-20-years-for-sexually-abusing-five-year-old/",
            "content": "By Staff Reporter\n\nA 19-year-old Guruve man has been slapped with a 20-year jail term following his conviction for sexually abusing a five-year-old neighbour on three occasions.\n\nProsecutors proved that the victim, a girl attending ECD B, was repeatedly targeted by the offender.\n\nOn the first occasion, it was proved that the victim went to play at the offenders homestead.\n\nWhile playing, the offender lifted her onto a stool and inserted his finger into her privates.\n\nThe childs cries for help caused him to stop, and he attempted to pacify her by lifting and carrying her, the court heard.\n\nOnce the victim had stopped crying, the offender again lowered her onto the stool and continued to caress her privates.\n\nHe only stopped when he heard the childs mother calling for her.\n\nThe minor did not disclose the abuse to her mother at that time.\n\nOn another occasion, the complainant was sent by her mother to collect tomatoes from the offenders home.\n\nShe found him alone, sitting on a stool.\n\nHe lifted her onto the stool, removed her underwear, and again caressed her privates before inserting his finger.\n\nHe only stopped when he saw the childs mother approaching, said the state.\n\nAgain, the child remained silent, fearing her mothers reaction.\n\nThe abuse came to light on the 12th of April, 2025, when the complainant, while attending a church conference, confided in her grandmother.\n\nThe grandmother then informed the childs mother.\n\nA police report was filed, leading to the offenders arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter A 19-year-old Guruve man has been slapped with a 20-year jail term following his conviction for sexually abusing a five-year-old neighbour on three occasions. Prosecutors proved that the victim, a girl attending ECD B, was repeatedly targeted by the offender. On the first occasion, it was proved that the victim went to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-20-years-for-sexually-abusing-five-year-old/\">Man jailed 20 years for sexually abusing five-year-old</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Govt increases surveillance at border posts to curb drug trafficking",
            "url": "https://www.newzimbabwe.com/govt-increases-surveillance-at-border-posts-to-curb-drug-trafficking/",
            "content": "By Mary Taruvinga\n\nZimbabwean government has upped surveillance by introducing drones at border posts to reduce drug trafficking.\n\nAs the fight against drug use continues, during the period from March to June 2 2025, a cumulative 206 raids were conducted nationwide, leading to the dismantling of 39 illicit drug bases and 1,445 suspects.\n\nSpeaking at a post-cabinet briefing Tuesday Information Minister Jenfan Muswere said, Regarding the update on the Supply Reduction Pillar, the Criminal Investigations Departmentreceived five drones from the Ministry of Local Government and Public Works for surveillance purposes at border posts.\n\nForty-one drug kingpins were named and shamed during the period and individuals were sentenced to custodial terms ranging from 12 months to 15 years in prison.\n\nHe said the liquor licensing board inspected 461 premises, 429 of which were licensed.\n\nA total of 32 unlicensed premises were fined US$40 each.\n\nMuswere said the government is committed to empowering youths which will in turn reduce drug and substance abuse in the country.\n\nA total of 70 survivors of drug and substance use are currently undergoing training.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/17045402/Caledon-River-Properties-Pty-Ltd-and-Profteam-CC-were-stripped-of-the-multi-million-rand-profits-they-made-after-erecting-a-weak-mesh-fence-at-Beit-Bridge-border-File-Image.webp",
            "description": "<p>By Mary Taruvinga Zimbabwean government has upped surveillance by introducing drones at border posts to reduce drug trafficking. As the fight against drug use continues, during the period from March to June 2 2025, a cumulative 206 raids were conducted nationwide, leading to the dismantling of 39 illicit drug bases and 1,445 suspects. Speaking at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-increases-surveillance-at-border-posts-to-curb-drug-trafficking/\">Govt increases surveillance at border posts to curb drug trafficking </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zimbabwe ‘amped’ to test themselves against world champion Proteas",
            "url": "https://www.newzimbabwe.com/zimbabwe-amped-to-test-themselves-against-world-champion-proteas/",
            "content": "SABC Sport\n\nZimbabwe head coach Justin Sammons says his team is looking forward to testing themselves against world champions South Africa in the two-match Test series thats gets underway in Bulawayo on Saturday.\n\nThe Proteas arrive in Zimbabwe having beaten Australia in the World Test Championship final at Lords earlier this month, breaking an ICC trophy drought that spanned for 27 years.\n\nZimbabwe have already been in camp preparing for the challenge of their African neighbours and Sammons says the players are eager to rise to the occasion.\n\nTheres a real buzz around the squad. I think theyre very excited. Im super excited for the challenge that lies ahead and the guys are amped for it, Sammons said.\n\nTheyre looking forward to testing themselves and showing what theyre capable of. I think they really want to make a statement over the next couple of weeks.\n\nThe home sides preparations has been to focus on building intensity and volume while ensuring all fundamentals are being addressed before shifting to specific tactical planning.\n\nDespite the demanding sessions, Sammons said the players had responded with enthusiasm and purpose.\n\nHe added: Right now, its more about making sure were covering all our bases . . . its more around the volume, and then we get a little bit more specific as we head closer to the Test.\n\nThe attitude is good. Its always good. We can never fault the attitude. Theyre always wanting to get the most out of each other and improve as much as they can, and again, theyve shown that over the last few days.\n\nThe second and final Test of series will also be played at the Queens Sports Club in Bulawayo from 6 July before the teams move to Harare for a T20I tri-series that will also feature New Zealand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24134258/justin-sammons16_1206x678.webp",
            "description": "<p>SABC Sport Zimbabwe head coach Justin Sammons says his team is looking forward to testing themselves against world champions South Africa in the two-match Test series thats gets underway in Bulawayo on Saturday. The Proteas arrive in Zimbabwe having beaten Australia in the World Test Championship final at Lord’s earlier this month, breaking an ICC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-amped-to-test-themselves-against-world-champion-proteas/\">Zimbabwe ‘amped’ to test themselves against world champion Proteas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Case against ‘abusive’ guardians stalls as victim is transported to Zimbabwe",
            "url": "https://www.newzimbabwe.com/case-against-abusive-guardians-stalls-as-victim-is-transported-to-zimbabwe/",
            "content": "The Citizen\n\nA child abuse case has stalled after the alleged perpetrators, the guardians of a Grade 5 learner from Skeen Primary School, reportedly took her to Zimbabwe, leaving police struggling to gather evidence.\n\nThe family violence, child protection, and sexual offenses commander confirmed that the child was taken out of South Africa before critical evidence could be obtained. The learners statement was not yet obtained and she had not been taken to a doctor. The learner must be taken to the doctor to prove the case.\n\nThe investigating officer said he suspects the accused guardians took the child to Zimbabwe to kill the case. This was corroborated by Skeen Primary School deputy principal Masilo Lebeya, who revealed that the guardians took the child away swiftly, in the wake of allegations of abuse, and ahead of her June examinations, without informing the school. We only learned of her whereabouts when a social worker contacted one of the suspects, who admitted taking her to Zimbabwe, Lebeya said, adding that the school subsequently opened a case of abuse at the Sandringham Police Station.\n\nWhen asked if there were early, telltale signs that the victim was being abused, Lebeya said they were only seen at a later stage, and that the process of counselling the victim was only initiated when they confirmed that she had a family problem. Remember, we are dealing with a lot of children here. You might find that, by the time a teacher notices that she needs to intervene, it is a bit late. It shows that the child has been suffering in silence, he noted, further emphasising that the school has a strong support system and they have always encouraged children to share their problems.\n\nMatheba said they are trying to get the accused guardians to co-operate. He stressed that, without it, the police will not be able to build a case. Matheba said if they do not co-operate, the police will have to work with home affairs immigration authorities to verify the victims legal status in South Africa. If she was here illegally, then we would have to involve authorities on that side, to get her a passport so that she can be transported back to South Africa, and that will be a long process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24133706/women-abuse-1.jpg",
            "description": "<p>The Citizen A Grade 5 learner from Skeen Primary School, allegedly abused by her guardians, has been secretly taken to Zimbabwe, and without critical evidence, such as her medical report or statement, the suspects remain free. A child abuse case has stalled after the alleged perpetrators, the guardians of a Grade 5 learner from Skeen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/case-against-abusive-guardians-stalls-as-victim-is-transported-to-zimbabwe/\">Case against ‘abusive’ guardians stalls as victim is transported to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "South Africans and Zimbabweans pray together after xenophobic attacks in Addo",
            "url": "https://www.newzimbabwe.com/south-africans-and-zimbabweans-pray-together-after-xenophobic-attacks-in-addo/",
            "content": "By Joseph Chirume,GroundUp\n\nLast month, the killing of a South African man in Valencia, Addo, spurred devastating xenophobic revenge attacks, killing at least four immigrants and injuring dozens. Hundreds of families were displaced from their homes.\n\nOn Sunday, to mark World Refugees Day, about 200 residents of Valencia, South Africans and immigrants, came together at the community hall. They prayed for peace and order in their community.\n\nCandles were lit and 10 white balloons were released as a sign of peace. Half the balloons were released by the family members of Juane September, the South African man whose murder sparked the attacks. The other half were released by Zimbabweans.\n\nGerald September, Juanes father, was at the event. I dont think I will ever recover from this tragic loss, he said.\n\nZimbabwean pastor and Valencia resident of ten years Ngonidzashe Chikanya said the prayer session was also meant to help displaced immigrants reintegrate into the community.\n\nHe said those affected were still dumbfounded by the incident as it happened within the blink of an eye.\n\nPeople are still in shock.\n\nIn the streets of Valencia, peace and calm seem to have returned. Many of the displaced families have returned. However, more than 100 Zimbabweans who were arrested by the Department Home Affairs while trying to seek shelter from the attacks, have opted to bevoluntarily deported.\n\nA Zimbabwean man who recently returned to Valencia said while he was away his home was robbed of all his belongings. No one wants to account for that, he said. This has put him back 10 years and he has had to borrow money to pay rent and purchase essentials, he said.\n\nMorne Serome, deputy chairman of a newly formed group of South African and Zimbabwean church leaders, said they will visit local schools soon to educate children about the importance of living peacefully with immigrants.\n\nIts time for the church to play a pivotal role in bringing people together, Serome said.\n\nGrade seven learner Lihle Kula, 16, said she was heartbroken to witness immigrants being killed and beaten by people who had lived with them for several years.\n\nI was powerless and at the same time fearing for my life. I could do nothing because the mob was angry and violent. It is very disturbing that a person leaves his country to look for opportunities in a foreign country, only to return home in a coffin after being murdered in cold blood.\n\nShelton Ciyangwa, Secretary General of the Zimbabwe Migrants Support Network, said two of the deceased Zimbabweans had been repatriated to Zimbabwe. Another deceased, from Malawi, has also been repatriated. The network is still raising funds to repatriate a third deceased, from Zimbabwe. And a fourth man is yet to be identified by family or next of kin.\n\nThere have still not been any arrests of perpetrators of the violence, police spokesperson Warrant Officer Majola Nkohli said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24133920/addo_memorial_extra_large.jpg",
            "description": "<p>By Joseph Chirume, GroundUp Hundreds of residents of Valencia, Addo came together to pray for peace and order after recent xenophobic attacks. There have still not been any arrests, almost a month after one South African and four immigrants were murdered. Many of the displaced immigrant families have returned to Valencia. Last month, the killing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africans-and-zimbabweans-pray-together-after-xenophobic-attacks-in-addo/\">South Africans and Zimbabweans pray together after xenophobic attacks in Addo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        },
        {
            "title": "Accor announces entry into Zimbabwe with signing of Novotel Victoria Falls",
            "url": "https://www.newzimbabwe.com/accor-announces-entry-into-zimbabwe-with-signing-of-novotel-victoria-falls/",
            "content": "Hotel Management Network\n\nAccor has signed Novotel Victoria Falls, marking the hospitality groups entry into Zimbabwe.\n\nThe project is set within the UNESCO World Heritage Site of Victoria Falls and is expected to open its doors in 2028.\n\nSigned during the Future Hospitality Summit (FHS) Africa, the agreement leverages a first-mover advantage in one of Africas most iconic destinations.\n\nThe 111-key new-build property will be developed under a management agreement with Eagle Real Estate Investment Trust, which focuses on high-quality assets across various sectors.\n\nThe hotel will be located in the Eagle Heights precinct, overlooking the Masuwe River. It will offer facilities such as an outdoor swimming pool, a kids club, an all-day dining restaurant, and a destination bar.\n\nVictoria Falls is a hub for adventure tourism, offering activities such as whitewater rafting, bungee jumping, and scenic helicopter flights.\n\nThe signing of Novotel Victoria Falls represents a strategic entry for Accor into a destination with growing regional and domestic tourism and a limited presence of global hotel brands.\n\nThe hotel will be the first internationally branded Novotel in Zimbabwe, catering to the demand for high-quality yet accessible accommodation in the area.\n\nAccor Premium, Midscale & Economy Division, Middle East, Africa & Trkiye chief development officer Maya Ziade said: This signing represents a bold step forward in our development strategy for Sub-Saharan Africa.\n\nVictoria Falls is one of the worlds most extraordinary destinations, and we are proud to bring the Novotel brand experience to Zimbabwe for the very first time. As a first mover, we see this project as a gateway to long-term sustainable growth in the country.\n\nIn related news, Accors Emblems Collection brand is set to make itsUK debutwith the introduction of Lucknam Park Hotel & Spa, which will join the collections Heritage category.\n\nSituated six miles (9.65km) from Bath, the country house hotel features a Michelin-starred restaurant, a wellness spa, an equestrian centre, and 500 acres of parkland.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21060705/vic-falls.jpeg",
            "description": "<p>Hotel Management Network Accor has signed Novotel Victoria Falls, marking the hospitality group’s entry into Zimbabwe. The project is set within the UNESCO World Heritage Site of Victoria Falls and is expected to open its doors in 2028. Signed during the Future Hospitality Summit (FHS) Africa, the agreement leverages a first-mover advantage in one of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/accor-announces-entry-into-zimbabwe-with-signing-of-novotel-victoria-falls/\">Accor announces entry into Zimbabwe with signing of Novotel Victoria Falls</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "25 Jun 2025"
        }
    ]
}