{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Socia Media Laws",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-socia-media-laws/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discussthe laws governing social media use in Zimbabwe.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss social medialaws. The Minister of Information,Publicity and Broadcasting Services Dr. Jenfan Muswere at the Minister meet the Media event stated that the government is drafting a new social media legislation to regulate social media. What lawsarecurrently regulating social media?\n\nVM: Thank you. Ifmy memory serves me right, one of the aims of that legislation is to address the issue of ghost accounts. As the legislation has not been introduced yet, I will focus on the current legal position.\n\nTo your question on how social media is currently regulated, we have to start at the constitution level. Our constitution in Zimbabwe guarantees everyones right to propagate and express their opinions and beliefs whether in private or in public, individually or collectively. This right extends to any individuals ability to freely express or disseminate ideas through media, in this particular case, social media.\n\nHaving said that, all rights have qualifications or limitations, otherwise they will end up infringing on the other rights enjoyed by people in a democratic community. The same constitution then limits this right to freely express opinions or ideas by the media if the exercise of such right to express ideas may incite violence or be injurious to another persons reputation or dignity. The requirement in our law for injury to reputation also considers whether there was malice. Going back to the limitations, the constitution also limits the right of expression where it breaches someone elses right to privacy or it amounts to hate speech\n\nReporter: Some people argue that these limitations are wide in interpretation and have been used to infringe on peoples rights by the State, calling it subversive content\n\nVM: The laws governing what you are referring to as subversive content is found mainly in our Criminal Law (Codification and Reform) Act and our Cyber and Data Protection Act. There have been allegations of abuse of this wide interpretation, it really depends on which side of the table you are sitting and whose argument you are listening to.\n\nSubversive content is, in general terms, material that threatens state authority or incites public disorder. This material can include publishing false statements prejudicial to the state, or transmitting messages that incite violence or damage to property.\n\nThere has been some high-profile cases involving such allegations and some legal critics argue that words like prejudicial are open to selective enforcement. I suppose these are some of the issues that will be clarified by the proposed new social media laws.\n\nReporter:What is the position when it comes to defaming people using social media?\n\nVM: Defamation in terms of our laws has criminal and civil implications.\n\nOur Criminal Law Code still retains an imprisonment option when one publishes false information that is harmful to anothers reputation. The court also considers the issue of malice when the information was published in weighing the appropriate punishment. That is whether or not the motivation for the statement was malicious.\n\nThe injured person being the person who has been defamed can also approach our civil courts with a claim for defamation which can include damages. The defamed person will need to prove that the statement was false, malicious and reckless and has reduced their standing in society.\n\nSeveral cases have been brought in our civil courts with a number being successful after having met the criteria set to qualify for defamation.\n\nReporter: We have seen a number of prosecutions that include the leaking of nudes or sex tapes by exlovers?\n\nVM: There have been a number of cases alleging revenge leaks of nude images or videos of a sexual nature involving exlovers. Our censorship laws prohibit the distribution of indecent material or material regarded as obscene. The qualification here is whether the material distributed offends public morality.\n\nFurther, our Cyber and Data Protection laws criminalize posting or sharing nudes or videos of a sexual nature involving another, which in this example is an ex-lover, without their consent. The penalties from such posts may even include imprisonment.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nThesediscussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/23191622/social-media-law.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss the laws governing social media use in Zimbabwe. Reporter: Welcome back Mr. Madzima, this week we want to discuss social media laws. The Minister of Information, Publicity and Broadcasting Services Dr. Jenfan Muswere at the ‘Minister meet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-socia-media-laws/\">Legal Discussions with Vengai Madzima: Socia Media Laws</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "SADC commemorates Southern Africa Liberation Day",
            "url": "https://www.newzimbabwe.com/sadc-commemorates-southern-africa-liberation-day/",
            "content": "By Staff Reporter\n\nTHE Southern African Development Community (SADC) Chairperson, Emmerson Mnangagwa has marked the Southern Africa Liberation Day by honouring the sacrifices of the regions freedom fighters.\n\nThe day celebrated on 23 March annually, serves as a tribute to Africans who fought for independence, democracy, and sovereignty.\n\nIn a statement, Mnangagwa called on citizens to remain vigilant against threats to their independence.\n\nI urge us all, as independent peoples of SADC, to remain vigilant and be alert to the emerging challenges that threaten our hard-won independence and the general stability of our region.\n\nWe must, continue to stand in solidarity against the imposition of illegal sanctions, use of coercive measures and or any other actions that undermine our sovereignty and territorial integrity, he said.\n\nThe 82-year-old Zimbabwean leader waved solidarity with the Saharawi Arab Democratic Republic, indicating that a free Africa will be attained after the Western Sahara gets its freedom.\n\nOn this historic day, we also remember our brothers and sisters in the Saharawi Arab Democratic Republic, who are still being denied the right to determine their own destiny. Africa will not be free, until the Western Sahara, is liberated, free and independent.\n\nFurther, Mnangagwa called for the total silencing of guns in the eastern Democratic Republic of Congo.\n\nSADC remains a relatively calm and peaceful region. For this, we are proud. However, I reiterate our call for lasting peace in the eastern part of the Democratic Republic of Congo. The situation in Eastern DRC undermines the aspirations bequeathed to us by our Founding Fathers and outlined in the SADC Constitutive Act and Vision 2050.\n\nThe time to silence the guns, de-escalate tensions and hostilities as well as to engage in dialogue to secure mediated outcomes for long-lasting peace in DRC is now, said Mnangagwa.\n\nMeanwhile, the SADC chairperson flagged the need to develop modernised equipment to detect droughts as Africa has been impacted by the unpredicted climate change.\n\nOver the years, our region, has been greatly affected by recurring climate change induced disasters, leading to far reaching consequences for our people, economies, and environment.\n\nThe extreme weather patterns have resulted in frequent and severe droughts, threatening food security and livelihoods across our region.\n\nIt is our collective responsibility to take decisive action to mitigate and manage the effects of these natural disasters. To this end, the need to enhance our early warning capabilities, build resilience and adaptation capacities, leveraging on the deployment of science, technology and innovation cannot be over-emphasised, said Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/13145831/mnangagwa.jpeg",
            "description": "<p>By Staff Reporter  THE Southern African Development Community (SADC) Chairperson, Emmerson Mnangagwa has marked the Southern Africa Liberation Day by honouring the sacrifices of the region’s freedom fighters. The day celebrated on 23 March annually, serves as a tribute to Africans who fought for independence, democracy, and sovereignty. In a statement, Mnangagwa called on citizens</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-commemorates-southern-africa-liberation-day/\">SADC commemorates Southern Africa Liberation Day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Zimbabwean female referee Precious Pazani makes history as she officiates debut Six Nations Rugby League match",
            "url": "https://www.newzimbabwe.com/zimbabwean-female-referee-precious-pazani-makes-history-as-she-officiates-debut-six-nations-rugby-league-match/",
            "content": "By Sports Reporter\n\nTOP female referee Precious Pazani set a record Sunday after she became the first match official from Zimbabwe to officiate at Europe Six Nations rugby tournament.\n\nPazani was the centre referee in a match pitting England and Italy, which was played in York Sunday afternoon.\n\nAged 34, the Zimbabwean rugby referee became the first official outside of South Africa to officiate at Europes prestigious tournament.\n\nPazani joined South Africas Aimee Barret-Theron to be the only two referees from Africa to officiate at the tourney, which comprises of Scotland, Wales, Italy, France, Ireland and England.\n\nThe new landmark is a feather added to Pazanis ever growing records, as she was the first referee from Zimbabwe to officiate at the World Cup and World Challenger series.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/25095621/Precious-Pazani.jpg",
            "description": "<p>By Sports Reporter  TOP female referee Precious Pazani set a record Sunday after she became the first match official from Zimbabwe to officiate at Europe Six Nations rugby tournament. Pazani was the centre referee in a match pitting England and Italy, which was played in York Sunday afternoon. Aged 34, the Zimbabwean rugby referee became</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-female-referee-precious-pazani-makes-history-as-she-officiates-debut-six-nations-rugby-league-match/\">Zimbabwean female referee Precious Pazani makes history as she officiates debut Six Nations Rugby League match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Hero’s welcome for new IOC president Kirsty Coventry",
            "url": "https://www.newzimbabwe.com/heros-welcome-for-new-ioc-president-kirsty-coventry/",
            "content": "By Sports Reporter\n\nNEWLY-elected International Olympics Committee (IOC) president Kirsty Coventry is back in the country after her landslide victory in Greece Thursday.\n\nCoventry received a heros welcome at Robert Mugabe lnternational Airport Sunday afternoon, as hundreds gathered to give her a befitting homecoming.\n\nAged 41, Coventry became the youngest IOC president in history, also becoming the first female and African to assume the post.\n\nAmongst those that welcomed Coventry were several government officials including Minister of Women Affairs, Community, Small and Medium Enterprises, Monica Mutsvangwa, Information Communications Technology (ICT) Minister Tatenda Mavetera, Deputy Minister of Sports Recreation Arts and Culture Emily Jesaya, Sports and Recreation Commission (SRC) Chairperson Gerald Mlotshwa, among others.\n\nCoventrys return to Zimbabwe is mainly to officially resign as the Minister of Sport and bid farewell to President Emmerson Mnangagwa before she shifts base to Lusanne, Greece where IOC headquarters are located.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24040818/IMG-20250324-WA0005.jpg",
            "description": "<p>By Sports Reporter NEWLY-elected International Olympics Committee (IOC) president Kirsty Coventry is back in the country after her landslide victory in Greece Thursday. Coventry received a hero’s welcome at Robert Mugabe lnternational Airport Sunday afternoon, as hundreds gathered to give her a befitting homecoming. Aged 41, Coventry became the youngest IOC president in history, also</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heros-welcome-for-new-ioc-president-kirsty-coventry/\">Hero’s welcome for new IOC president Kirsty Coventry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Warriors hunt Super Eagles of Nigeria in decisive World Cup Qualifier",
            "url": "https://www.newzimbabwe.com/warriors-hunt-super-eagles-of-nigeria-in-decisive-world-cup-qualifier/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens football national team, the Warriors have shifted base to Nigeria ahead of the 2026 World Cup Qualifiers.\n\nMichael Nees and his squad arrived in Lagos, Nigeria Friday before travelling to Uyo, where the match will be played.\n\nThe Warriors are set to play the Super Eagles Tuesday at Godswill Akpabio Stadium in Uyo.\n\nNigeria and Zimbabwe played a 1-1 draw during the first leg match played in 2023 when they faced off at Stade Huye Stadium in Rwanda.\n\nComing from a 2-2 draw from behind, Zimbabwe will be desperate to pick maximum points Tuesday to keep its hopes of qualifying for the 2026 World Cup alive.\n\nCurrently the Warriors are bottom in Group C with three points, seven behind South Africa, who are on top with 10 points.\n\nZimbabwe remains the only team yet to win in the group and a defeat Tuesday will shutter its hope of making it to next years World Cup tournament.\n\nNigeria walks into Tuesdays game brimming with confidence after picking their first win of the campaign Friday against Rwanda whom they beat 2-0.\n\nThe Super Eagles are now on six points, climbing up Group C standings to position four.\n\nSouth Africa  10 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  3 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s football national team, the Warriors have shifted base to Nigeria ahead of the 2026 World Cup Qualifiers. Michael Nees and his squad arrived in Lagos, Nigeria Friday before travelling to Uyo, where the match will be played. The Warriors are set to play the Super Eagles Tuesday at Godswill</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-hunt-super-eagles-of-nigeria-in-decisive-world-cup-qualifier/\">Warriors hunt Super Eagles of Nigeria in decisive World Cup Qualifier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Police arrest man who raped, killed his biological sister and her daughter (4)",
            "url": "https://www.newzimbabwe.com/police-arrest-man-who-raped-killed-his-biological-sister-and-her-daughter-4/",
            "content": "By Staff Reporter\n\nFOLLOWING weeks of evading arrest, a Masvingo man has been arrested for the alleged rape and murder of his biological sister and her minor daughter.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the arrest of Tongai Chirume aged 35 for the heinous crimes.\n\nZRP confirms the arrest of Tongai Chirume (35) in connection with cases of rape and murder which occurred at Makurumidze viillage, Gutu, Masvingo on March 1, 2025, said Nyathi.\n\nFollowing over two weeks of trying to locate suspect, Chirume was finally nabbed last week.\n\nOn March 18, 2025, police acted on received information and raided the suspects homestead at Drawmore farm, Masvingo, where they apprehended him, the police spokesman added.\n\nInvestigations by police established that the suspect visited his sister, Mercy Chirume (33) at their late parents residence in Makurumidze village, where he committed the offences.\n\nAccused person allegedly deceived his sister into believing that a prophet had instructed him to sleep with her inorder to cleanse their family of evil spirits. The suspect then raped the victim twice.\n\nAfter the offence, victim threatened to expose perpetrator by reporting the matter to police. This prompted him to take a knife and stabbed Mercy before attempting to rape the child, Isabel Fadzai Machote, whom he later strangled to death. He then tossed the infants body into a well and fled the scene.\n\nPolice confirmed discovery of the knife used to stab the first victim.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter  FOLLOWING weeks of evading arrest, a Masvingo man has been arrested for the alleged rape and murder of his biological sister and her minor daughter. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the arrest of Tongai Chirume aged 35 for the heinous crimes. “ZRP confirms the arrest of Tongai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-arrest-man-who-raped-killed-his-biological-sister-and-her-daughter-4/\">Police arrest man who raped, killed his biological sister and her daughter (4)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "‘I can make an impact’ — Brendan Taylor eyes international comeback after sanction ends",
            "url": "https://www.newzimbabwe.com/i-can-make-an-impact-brendan-taylor-eyes-international-comeback-after-sanction-ends/",
            "content": "By ESPN Cricinfo\n\nFORMER Zimbabwe captain Brendan Taylor, currently serving a three-and-half-year ban for breaching the ICCs anti-corruption code, is eyeing an international comeback when his sanction ends in July.\n\nTaylor, 39, had initially considered a move into coaching but has been convinced to resume his playing career by Zimbabwe Crickets MD Givemore Makoni, with a view to playing the 2027 ODI World Cup, which Zimbabwe will co-host. Taylor will be eligible to play again on July 25 this year.\n\nI still want to play, and I believe I could make an impact as a player, Taylor told ESPNcricinfo.\n\nI look at where Im at physically and mentally and if I didnt feel I could do it, I wouldnt bother. Givemore has really supported me on this. He sort of shut down the coaching role for now and said, Can you play and try to push yourself up until the 2027 World Cup? Granted Ill be 41 then but with sobriety, Im living my truest form.\n\nTaylor admitted to drug and alcohol addiction problem at the same time he revealed an approach by match-fixers to spot fix after they filmed him using cocaine. He was threatened with the video being made public if he did not cooperate with them. Instead of going through with the fix, Taylor abruptly retired from international cricket in September 2021 and did not reveal the reasons. He only reported the incident to the ICC four months later and made the story public in January 2022.\n\nAt that point, Taylor also checked himself into a rehabilitation centre in Zimbabwes Nyanga region on the Mozambique border. He spent 90 days there, with one other patient and a sponsor who showed me a new way to live. He has since been clean and has started a private coaching facility at his home as well as, more recently, a gradual return to training.\n\nThe conditions of his sanction mean Taylor cannot play any officially recognised cricket or train with domestic or international sides. Instead, he has been using facilities at an elite independent school, St Johns College in Harare, often twice a day.\n\nTheyve got some great grass nets, and I spend a lot of time in the indoor high-performance centre there. I get in there nice and early, and I come back in the afternoon and do it all again and push myself, Taylor said.\n\nTheres lots of work to do, but I feel like Im there. Im not far off. Ive been doing some batting, and I need to incorporate some fielding and some keeping work because Ive got four months to go.\n\nAlthough it would have been great to be able to, Taylor will not be cleared to play by the time of Zimbabwes Test in England in May  their first against that opposition in more than two decades. But he hopes to be in the plans for a home series against New Zealand in August.\n\nThat will be followed by Zimbabwes hosting of the Africa Regional Qualifiers for next years T20 World Cup in September, though Taylor feels he has some work to do on his T20 game, where he has a strike rate of 123.96.\n\nI see myself definitely playing Tests and ODIs. With T20s, thats probably something I would have to really try and sharpen myself up at. But I look forward to that.\n\nHaving a home World Cup is quite special and weve had some heartache over these last few World Cups so hopefully we can turn that around.\n\nShould his comeback be successful, Taylor will be the fourth player in the Zimbabwe side in his late 30s, after Test and ODI captain Craig Ervine (39), T20I captain Sikandar Raza (38), and long-serving allrounder Sean Williams (also 38). Its in watching their performances that Taylor has found the belief that he has something more to contribute.\n\nThats been inspiring to me. If you look statistically, theyre at the top of the game. Theyre still some of the biggest contributors in the national side, and thats really given me that hope and belief that I can do this, he said.\n\nAnd its also about me just adding real service to the group. Its not an egotistical individual coming back trying to steal any headlines or anything like that. Ive been humbled properly. I look forward to really just adding value, which I probably didnt do to the best of my ability when I was there before.\n\nUltimately, its the feeling of having unfinished business that is calling Taylor back to playing. I wish I had offered a bit more to Zimbabwe cricket. Ive apologised and moved forward from that and I want to work with them.\n\nTaylor is also motivated by the idea of the home World Cup, especially as Zimbabwe have missed out on the last two ODI showpieces and he considers the 2015 tournament, where he was the fourth-highest run-scorer, the peak of his career.\n\nHaving a home World Cup is quite special and weve had some heartache over these last few World Cups so hopefully we can turn that around, he said.\n\nThe balance in our group is, I think, the best it has ever been and theres a huge drive from Zimbabwe Cricket to get this right and get things in place. For Givemore, this World Cup means the whole world to him. He just wants to get this right and put on a good show and I want to be reciprocal in that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/18212926/Brendan-Taylor.jpg",
            "description": "<p>By ESPN Cricinfo FORMER Zimbabwe captain Brendan Taylor, currently serving a three-and-half-year ban for breaching the ICC’s anti-corruption code, is eyeing an international comeback when his sanction ends in July. Taylor, 39, had initially considered a move into coaching but has been convinced to resume his playing career by Zimbabwe Cricket’s MD Givemore Makoni, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-can-make-an-impact-brendan-taylor-eyes-international-comeback-after-sanction-ends/\">‘I can make an impact’ — Brendan Taylor eyes international comeback after sanction ends</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "University of Zimbabwe lecturers plan strike over poor salaries",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-lecturers-plan-strike-over-poor-salaries/",
            "content": "By Staff Reporter\n\nLECTURERS at the University of Zimbabwe (UZ), represented by the Association of University Teachers (AUT), have notified university stakeholders, including students, parents, and guardians, of their intention to embark on indefinite industrial action, commencing on Monday, March 24, 2025.\n\nThe lecturers are protesting what they describe as meagre salaries, insufficient to cover basic necessities such as accommodation and transport to and from work.\n\nIn a communication seen by Newzimbabwe.com Friday, the UZ lecturers stated they had run out of patience with the unwillingness of both the university administration and the government to review their salaries  a plea they have been making since 2018.\n\nThe tutors grievances stem from a decision in October 2018 by government slashing their salaries from US$2,250 to a mere US$300.\n\nThis affected all lecturers at State-affiliated higher and tertiary education institutions across the country. While the government subsequently added a local currency component to their earnings, this has proved inadequate.\n\nIt is unfortunate that we are expected to budget for accommodation, transport, food, and other basic necessities from this amount, AUT stated.\n\nIt is clear that our situation is untenable. In as much as we want to continue providing our services, it has now proven practically impossible to do so due to diminished capacity.\n\nAUT further expressed dismay at reports that the UZ management had been spoiling itself with luxurious top-of-the-range vehicles and generous allowance packages at a time when its employees were struggling to make ends meet.\n\nIt has been noted with concern that, even as we struggled to do the bare minimum, the university management shamelessly awarded themselves lavish packages, including expensive cars for senior staff and hefty payouts in the order of thousands of United States dollars, the union further stated.\n\nAdding to the lecturers concerns is the university administrations failure to provide them with the necessary resources for the implementation of the new Education 5.0 curriculum.\n\nThis, the lecturers claim, effectively requires them to purchase essential equipment, such as computers and data for communication and connectivity, from their own pockets.\n\nThe universitys effort to migrate to Education 5.0 has been, to a large extent, at our expense as lecturers, the statement read.\n\nFrom our salaries, we are having to pay for data to facilitate communication with students and coordination amongst ourselves in various university committees, allowing university business to move forward. We are not provided with the necessary tools.\n\nThis would mean the university expects the lecturers, from their very small pay, to buy the requisite electronic gadgets for use in lecture rooms and offices.\n\nThe University of Zimbabwe lecturers notification of industrial action over poor pay is not an isolated incident.\n\nHealthcare workers, including nurses, have recently embarked on protests demanding a review of their salaries.\n\nThe Amalgamated Rural Teachers Union (ARTUZ) is also calling for a nationwide strike from March 28, 2025, citing similar concerns over inadequate pay.\n\nThis impending unrest comes amidst calls for a national shutdown on March 31, 2025, by expelled Zanu PF Central Committee member and war veteran Blessed Geza, who is demanding President Emmerson Mnangagwas resignation, citing a failure to address corruption, nepotism, and tribalism, among other ills.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Staff Reporter LECTURERS at the University of Zimbabwe (UZ), represented by the Association of University Teachers (AUT), have notified university stakeholders, including students, parents, and guardians, of their intention to embark on indefinite industrial action, commencing on Monday, March 24, 2025. The lecturers are protesting what they describe as meagre salaries, insufficient to cover</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-lecturers-plan-strike-over-poor-salaries/\">University of Zimbabwe lecturers plan strike over poor salaries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Renowned journalist Geoff Nyarota dies aged 74",
            "url": "https://www.newzimbabwe.com/renowned-journalist-geoff-nyarota-dies-aged-74/",
            "content": "By Staff Reporter\n\nVETERAN Zimbabwean journalist Geoff Nyarota has died.\n\nHe was aged 74.\n\nThe celebrated scribe famous for exposing the Willowgate vehicle scandal involving ministers and top government officials, passed on in Mutare after a long illness.\n\nNyarota, the founding editor of Daily News, had taken to publishing, having authored a book titled The Honourable Minister, which is an anatomy of endemic corruption in the country. He also wrote other books, Against the Grain and The Graceless Fall of Mugabe.\n\n(MORE TO FOLLOW)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/23043329/Geoffrey-Nyarota.jpg",
            "description": "<p>By Staff Reporter  VETERAN Zimbabwean journalist Geoff Nyarota has died. He was aged 74. The celebrated scribe famous for exposing the Willowgate vehicle scandal involving ministers and top government officials, passed on in Mutare after a long illness. Nyarota, the founding editor of Daily News, had taken to publishing, having authored a book titled ‘The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/renowned-journalist-geoff-nyarota-dies-aged-74/\">Renowned journalist Geoff Nyarota dies aged 74</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        },
        {
            "title": "Harare’s greenways turn into ‘greed havens’ as Zanu PF-linked barons engage in land grabs",
            "url": "https://www.newzimbabwe.com/harares-greenways-turn-into-greed-havens-as-zanu-pf-linked-barons-engage-in-land-grabs/",
            "content": "By Darlington Gatsi\n\nGOVERNMENTS urban densification programme in Harare has opened avenues for the invasion of protected areas such as greenways and wetlands by politically connected land barons.\n\nThe land sharks are wreaking havoc in Harare, jostling for greenways and wetlands, and parcelling out stands to potential homeowners.\n\nGreenways and wetlands in Mabelreign are being sold to home seekers by land barons under the guise of the densification programme.\n\nThe programme was launched by the then Minister of Local Government and Public Works, Winston Chitando, under the Local Development Plan Number 20 in October 2023.\n\nThe move was meant to address the huge demand for land in the capital.\n\nHarare residents who spoke to NewZimbabwe.com raised concerns over the programme, which has opened a conduit for land corruption.\n\nJaweet Maponga, who has been a Mabelreign resident for more than 22 years, was shocked when he witnessed a greenway behind his household being cordoned off.\n\nWe were shocked when we woke up one day to find the other end closed. We were given an ultimatum to harvest what we had planted (maize and vegetables) as the place had become a residential area, said Maponga.\n\nMidnight Land Grab Operations\n\nAccording to the City of Harare (CoH) plan, the greenways were established to serve as playgrounds and other recreational facilities for nearby residents.\n\nUnder the Local Development Plan Number 20, the greenways have been converted into residential stands to ease the demand for land.\n\nHowever, the allocation of land is being done clandestinely, with land barons working with some CoH officials to parcel out land without following due process.\n\nRecently, a female police officer came here boasting that she had acquired the land, saying she had been allocated it by council. They all claim that the process has been regularised, hence their claims to have bought the land, Maponga told NewZimbabwe.com.\n\nSanitation Concerns\n\nThe allocation of residential stands is in serious violation of council laws on sanitation, posing a health threat to members of the Mabelreign community.\n\nThe Ministry of Local Governments proclamation of the densification programme is silent on the sanitation and hygiene systems of residential areas being built on greenways.\n\nNewZimbabwe.com established that some of the houses being constructed do not have proper sewer systems, with the majority resorting to septic tanks that are closer to water sources.\n\nAnother resident, Innocent Chidaguro, said the establishment of septic tanks near water sources is contaminating underground water.\n\nThere is no proper sewer system in these houses. Pit latrines and septic tanks are in the majority of the houses, which is a danger to us as they are close to our boreholes, said Chidaguro.\n\nPolitical Shadows\n\nThe shadow of the ruling party, Zanu PF, looms over the allocation of infills in Mabelreign.\n\nLand barons linked to Zanu PF have been identified as the leaders in the distribution of land, creating tension with Ward 16 Independent Councillor Denford Ngadziore.\n\nLocal members of Zanu PF have been seen brandishing party regalia as their trump card in the takeover of land.\n\nSome land barons took advantage of the Mabelreign local plan and went on to invade land, building illegal structures. In terms of those who have been building overnight, we have been chasing them away.\n\nOne thing I know for a fact is that most of these land barons are politically connected. They use their political muscle to intimidate residents, said Ngadziore.\n\nCity Councils Defensive Mode\n\nWhile Ngadziore exonerated himself from the scramble for stands, Harare council officials remain entangled in the saga.\n\nCoH Director of Housing, Edmore Nhekairo, is accused of rubber-stamping the invasions of greenways.\n\nNhekairo allegedly approves housing projects in greenways, disregarding the lack of water and sewage reticulation systems.\n\nHCC officials are at the center of corrupt land dealings, as recently revealed by a Commission of Inquiry probing the operations of Town House.\n\nHarare Mayor Jacob Mafume, while denying his councils involvement, said the solution to land barons is for the government to impose a moratorium on the demolition of houses constructed illegally.\n\nAnyone who links my name must stop forthwith. I am not linked to any land grab or any nefarious activities. I have not authorised anyone, nor will I authorise anyone, said Mafume.\n\nCoH is losing millions of dollars in land revenue to land barons who line their pockets from the illegal sale of stands.\n\nWhile Mafume and the central government are at odds on policy, greenways are slipping into the hands of land barons, who have taken advantage of the situation to distribute land, prejudicing the council and government.Just like the majority Ward 16, residents are caught between a rock and a hard place as land grabs continue unabated.\n\nWe have tried everything, but we are not getting the green light from the councillor. When we ask him, he tells us that the matter is done and dusted, so we do not know what to do, said Maponga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/06194511/wetlands-1.jpg",
            "description": "<p>By Darlington Gatsi GOVERNMENT’S urban densification programme in Harare has opened avenues for the invasion of protected areas such as greenways and wetlands by politically connected land barons. The land sharks are wreaking havoc in Harare, jostling for greenways and wetlands, and parcelling out stands to potential homeowners. Greenways and wetlands in Mabelreign are being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-greenways-turn-into-greed-havens-as-zanu-pf-linked-barons-engage-in-land-grabs/\">Harare’s greenways turn into ‘greed havens’ as Zanu PF-linked barons engage in land grabs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "24 Mar 2025"
        }
    ]
}