{
    "news": [
        {
            "title": "Focus on what we could do together, not the negatives – US tells Zimbabwe",
            "url": "https://www.newzimbabwe.com/focus-on-what-we-could-do-together-not-the-negatives-us-tells-zimbabwe/",
            "content": "By Staff Reporter\n\nAMERICAs Ambassador to Zimbabwe Pamela Tremont has urged the government to avoid emphasising the two countries points of conflict but instead take advantage of possible areas of collaboration that could benefit both nations.\n\nTremont, who presented her credentials and moved to Harare last year, said she had been concentrating on getting more American investors into the country since presenting papers to President Emmerson Mnangagwa.\n\nThe United States of America (USA) has not had the best relationship with Zimbabwe, which stands accused of gross human rights abuses among other ills, since the early 2000s.\n\nTheir relationship has been characterised by accusations and counter-accusations regards the roles played in getting Zimbabwes economy on its knees.\n\nRuling, Zanu PF officials have argued and accused America of illegally sanctioning its entities and powerful organisations while the US has continuously professed ignorance and maintained corruption is the main crisis.\n\nTremont said her comments were in full realisation that the USA had been Zimbabwes largest source of donor aid since independence in 1980.\n\nWhat I would really like to do is get the Zimbabwean government to refocus away from our areas of disagreement and focus on what we can do together to achieve our mutual goals, said Tremont.\n\nI have been focused on the investment climate and how we can improve the situation here on the ground that will attract more US investors to Zimbabwe, create jobs and hopefully improve the prosperity of Zimbabweans.\n\nWe have been the largest bilateral donor to Zimbabwe since its independence in 1980. Despite our many areas of disagreement and the tension that we sometimes have had, we have continued to support the Zimbabwean people.\n\nThat is not the kind of relationship we want to have. We would like Zimbabwe to be a self-sufficient, self-reliant country that can stand on its own two feet, and make its own decisions without the influence of anybody else.\n\nTremont was speaking on American platform Do Hard Stuff, hosted by J. W. Oliver of ZimWorX, an organisation promoting employment creation in Zimbabwe.\n\nWe are constantly trying to win people over to believing that the US is a force for good in the world and that we should be the partner of first resort in solving all of the worlds problems, said Tremont.\n\nOur interests in Zimbabwe are to build partnerships with Zimbabweans so that we can counter challenges such as climate change, hunger, and disease increase trade and combat diseases.\n\nWe believe that increased trade and prosperity is important for us and Zimbabweans. Those are the sort of things we talk about with the Zimbabwean government.\n\nOur goals in Zimbabwe havent really changed so much over the years.\n\nWelfare and equality in Zimbabwe are actually getting worse.\n\nThe rich are getting richer, the poor are getting poorer, the number of people living below the poverty line has doubled since 2011 despite significant Chinese investment here.\n\nWe believe that strong democratic institutions and respect for human rights are really key components of having a free market economy that works well without corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15215508/Tremont-Photo-scaled.jpg",
            "description": "<p>By Staff Reporter AMERICA’s Ambassador to Zimbabwe Pamela Tremont has urged the government to avoid emphasising the two countries’ points of conflict but instead take advantage of possible areas of collaboration that could benefit both nations. Tremont, who presented her credentials and moved to Harare last year, said she had been concentrating on getting more</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/focus-on-what-we-could-do-together-not-the-negatives-us-tells-zimbabwe/\">Focus on what we could do together, not the negatives – US tells Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "ZWG scarcity has eased exchange rate depreciation  – Industry",
            "url": "https://www.newzimbabwe.com/zwg-scarcity-has-eased-exchange-rate-depreciation-industry/",
            "content": "By Alois Vinga\n\nLIMITED ZWG availability has eased exchange rate depreciation on the parallel market with US$ demand pressures pushing up the premiums towards the end of 2024.\n\nThe ZWG was introduced last year as the countrys first-ever Structured Currency backed by multiple resources like minerals and foreign currency.\n\nAfter maintaining stability in the first few months, the local premium took a dip, forcing the Reserve Bank of Zimbabwe (RBZ) to institute measures to safeguard the currencys total collapse.\n\nThe Confederation of Zimbabwe Industries (CZI) inflation tracker noted that the tight liquidity stancehas managed to ease parallel market exchange rates.\n\nDue to the limited supply of ZWG in the market, the depreciation in the parallel market was not sustained, as ZWG started appreciating on the parallel market rate from the 30thof September 2024. This resulted in a decline in the exchange rate premium to a low level of 27% on the buying rate by mid-October.\n\nHowever, since mid-October, the upward pressure on the buying rate at the parallel market began to resurface, which pushed the premium to about 46% on the 31st of October 2024, the industry group said.\n\nThe CZI said sources of liquidity that drove the parallel exchange rate towards the end of October need to be addressed, as the trend in the parallel market had demonstrated that the parallel market rate can indeed appreciate under tight liquidity.\n\nThe industry lobby group said the 43% devaluation of the official exchange rate initiated by the RBZ did not result in convergence with the parallel market buying rate, as the parallel market rate also depreciated by 24% on the same day.\n\nThe recent ZiG inflation surge in the months of September and October 2024 confirms that inflation in Zimbabwe is exchange rate driven. The outlook for inflation generally hinges on the ability to stabilise the exchange rate, added CZI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga LIMITED ZWG availability has eased exchange rate depreciation on the parallel market with US$ demand pressures pushing up the premiums towards the end of 2024. The ZWG was introduced last year as the country’s first-ever Structured Currency backed by multiple resources like minerals and foreign currency. After maintaining stability in the first</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-scarcity-has-eased-exchange-rate-depreciation-industry/\">ZWG scarcity has eased exchange rate depreciation  – Industry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Chiefs playing a crucial role in community disputes",
            "url": "https://www.newzimbabwe.com/chiefs-playing-a-crucial-role-in-community-disputes/",
            "content": "By Mary Taruvinga\n\nThe Judiciary Services Commission (JSC) has applauded traditional chiefs for their critical role in resolving community disputes, lessening the burden on upper courts.\n\nThese remarks come at a time when the civil courts are overwhelmed with work having resolved 100,000 disputes in 2024 alone.\n\nDeputy Chief Justice, Elizabeth Gwaunza said there is a real need to support the chiefs because they are part of the judiciary.\n\nShe was speaking at an event on Monday to mark the commencement of the 2025 judicial year in Harare.\n\nChiefs resolve many community disputes through the customary courts, applying alternative dispute resolution (ADR) mechanisms.\n\nSections 162 and 163 of the Constitution affirm that Chiefs are part of the Judiciary and are bound by the same ethical and other standards as other courts.\n\nThe JSC will continue to support traditional courts to ensure fairness, efficiency, and adherence to constitutional principles, Gwaunza said.\n\nGwaunza also said no court, customary or otherwise can function effectively without adequate resources and respect for fundamental rights.\n\nIn line with this years theme, priority will be given to the performance of customary courts.\n\nThe Secretary of the Judicial Service Commission has been directed to engage with the Chiefs Council to enhance training and provide additional resource support.\n\nBeyond customary courts, ADR mechanisms are set to play a larger role in our justice system, she said.\n\nGwaunza said the judiciary is establishing a Court-anned ADR system for criminal and civil cases.\n\nUnder this model, experts will assist in mediation and conciliation.\n\nThe use of ADRs is now considered one of the best practices globally and has been adopted successfully in many jurisdictions.\n\nWe certainly cannot afford to be left behind.\n\nThe Honourable Chief Justice has set up a committee led by a Judge of the High Court to steer the establishment of the ADR system in our jurisdiction, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/25115338/chiefs-5.jpeg",
            "description": "<p>By Mary Taruvinga The Judiciary Services Commission (JSC) has applauded traditional chiefs for their critical role in resolving community disputes, lessening the burden on upper courts. These remarks come at a time when the civil courts are overwhelmed with work having resolved 100,000 disputes in 2024 alone. Deputy Chief Justice, Elizabeth Gwaunza said there is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiefs-playing-a-crucial-role-in-community-disputes/\">Chiefs playing a crucial role in community disputes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Marry Mubaiwa’s request for stay of prosecution to be heard Friday",
            "url": "https://www.newzimbabwe.com/marry-mubaiwas-request-for-stay-of-prosecution-to-be-heard-friday/",
            "content": "ByMary Taruvinga\n\nHigh Court judge Justice Pisirayi Kwenda is this Friday expected to get an update regarding investigations by the State in a case former Vice President Constantino Chiwengas ex-wife Marry Mubaiwa is seeking a permanent stay of her trial.\n\nMubaiwa last year asked for a permanent stay of her prosecution citing poor health.\n\nThe court was expected to sit on Wednesday but failed following the States failure to upload the documentation that all parties had agreed on concerning this directive.\n\nThe judge said the investigations would assist the court in deciding whether Mubaiwas prosecution should be stopped.\n\nThere was a case management todaythere areinvestigations which the judge said were necessary to be done before he can decide whether or not our application of permanent stay should succeed or not.\n\nSo when we were last in court, he said we should agree that investigation should proceed, and we exchanged correspondence and agreed on the issues and sent the issues to the prosecution department on 12 of December.\n\nUnfortunately, for some reason, they did not upload it or scan and send it to the judge although it was an agreed document.\n\nSo we are coming back on Friday 10 so that the judge can be updated on where we are with that process, Mtetwatold journalists at court.\n\nMubaiwa among other things complains that she is unable to stand trial or give instructions to her lawyer because of her poor health.\n\nMubaiwa has been sick for over five years and has since lost two of her limbs to a condition called lymphodema.\n\nThe former model is now unable to walk and is brought to court in a wheelchair.\n\nShe has three aides who help her to get in and out of her wheelchair.\n\nMtetwa last told Harare magistrate Feresi Chakanyukathat her client has been in and out of hospital and will sometimes be sedated with medication.\n\nThe lawyer argued that it would be in the best interests of justice if Mubaiwas trial is stayed.\n\nMtetwa said Mubaiwa cannot fully enjoy the right to a fair hearing adding that this includes the right to be physically and mentally capable to follow the full proceedings and the capacity to give instructions to her lawyer or give her version of events.\n\nI am able to say that the applicant is currently unable to fully exercise all of those rights due to all the issues I have raised above. In particular, I point out that with regard to the money laundering case, the State papers were provided to the defence when the applicant was already on heavy medication, had already lost a limb and was trying to avert the loss of her leg.\n\nConsequently, she has been unable to give instructions on the documents supplied by the State in November 2023 with the result that her legal team only has general instructions from the period of her arrest when no document had been provided save for the general allegations given on remand, Mtetwa told Chakanyuka who however dismissed the request.\n\nMubaiwa isaccused of attempting to kill Chiwenga when he was critically ill and hospitalised in South Africa.\n\nAdditionally, she is charged with money laundering but her legal matters have been prolonged due to her poor health.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/11102442/WhatsApp-Image-2024-11-11-at-11.52.41.jpeg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Pisirayi Kwenda is this Friday expected to get an update regarding investigations by the State in a case former Vice President Constantino Chiwenga’s ex-wife Marry Mubaiwa is seeking a permanent stay of her trial. Mubaiwa last year asked for a permanent stay of her prosecution citing poor health. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marry-mubaiwas-request-for-stay-of-prosecution-to-be-heard-friday/\">Marry Mubaiwa’s request for stay of prosecution to be heard Friday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Harare Town Clerk’s assistant rakes in US$12,000 salary while ‘cash-strappped’ council fails to procure workers’ uniforms",
            "url": "https://www.newzimbabwe.com/harare-town-clerks-assistant-rakes-in-us12000-salary-while-cash-strappped-council-fails-to-procure-workers-uniforms/",
            "content": "By Darlington Gatsi\n\nA top Harare council official, Mathew Marara is earning a hefty US$12,000 a month while the local authority is failing to procure uniforms for its workers and poor service delivery is the order of the day.\n\nThis was revealed during the ongoing Commission of Inquiry which is investigating the operations of the Harare City Council since 2017 where Marara appeared on Tuesday.\n\nMarara disclosed that his current salary is US$12,000 which is inclusive of benefits.\n\nMarara, Human Capital Director at HCC, reportedly awarded himself the post of Executive Assistant to the Town Clerk under mysterious circumstances.\n\nThis was reportedly done with the approval of suspended Town Clerk Hosiah Chisango, devoid of the Ministry of Local Governments nod.\n\nThis position came with lucrative benefits which Marara detailed to the Commission of Inquiry.\n\nMy salary is currently is US$12,000 paid at interbank rate. It is inclusive of salary, allowances, motor benefits because I use my own vehicle, said Marara.\n\nThe revelation came at a time when the City Council is struggling to procure uniforms for its workers as disclosed before the Commission.\n\nHCC has also been struggling to procure basic essentials such as fuel to service its vehicles but has been paying Mararas salary which amounts to US$144,000 per year.\n\nMarara has been embroiled in controversy at the Harare City Council after receiving US$320,000 as compensation for a period that he was suspended due to corruption allegations.\n\nThis figure, previously revealed before retired Justice Cheda led the committee, raised eyebrows given the City of Harare is struggling to fulfil its mandate.\n\nHowever, Mararara dismissed the amount as exaggerated, stating that he had not received the full amount.\n\nThat is not correct. The figure that was signed for by the negotiating committee was US$131,000. They are still paying. So far I have received US$116,000, he said.\n\nMarara will continue his testimony on January 21 where he will further clarify his salary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15223501/town-house-marara.png",
            "description": "<p> By Darlington Gatsi A top Harare council official, Mathew Marara is earning a hefty US$12,000 a month while the local authority is failing to procure uniforms for its workers and poor service delivery is the order of the day. This was revealed during the ongoing Commission of Inquiry which is investigating the operations of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-town-clerks-assistant-rakes-in-us12000-salary-while-cash-strappped-council-fails-to-procure-workers-uniforms/\">Harare Town Clerk’s assistant rakes in US$12,000 salary while ‘cash-strappped’ council fails to procure workers’ uniforms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Mozambique’s new president sworn in despite opposition boycott",
            "url": "https://www.newzimbabwe.com/mozambiques-new-president-sworn-in-despite-opposition-boycott/",
            "content": "BBC\n\nMozambiques new President Daniel Chapo has been sworn in at a low-key ceremony in the capital, Maputo, that was marred by an opposition boycott following heavily disputed elections.\n\nIn his first presidential address, Chapo, 47, pledged to devote all my energies to promoting unity and human rights in a nation scarred by post-election violence.\n\nA local civil society group says that more than 300 people have been killed in clashes with security forces since elections in October.\n\nEight people were killed by police on Wednesday as they protested against the inauguration, Dr Wilker Dias, head of election observer group Plataforma Decide told the BBC.\n\nMost of the victims were supporters of defeated presidential candidate Venncio Mondlane, who had called for a national strike in defiance of Chapo taking office.\n\nIn light of Mondlanes appeal, most businesses in Maputo were shut on Wednesday and the streets were largely deserted.\n\nChapo had won the election with 65% of the vote, extending the 49-year-rule of the Frelimo party.\n\nMondlane  who contested the election as an independent  came second with 24% of the vote. He rejected the result, saying it was rigged and called for a strike on inauguration day against the thieves of the people.\n\nAddressing about 2,500 guests at the heavily guarded ceremony, Chapo said that together, we will restore patriotism and pride in being Mozambican.\n\nMozambique cannot remain a hostage to corruption, nepotism, and incompetence, he added.\n\nPolice fired shots to disperse crowds outside Independence Square, where the ceremony was held, as Chapos motorcade left afterwards.\n\nThe crowds were mostly of Mondlanes supporters, but they included some who backed Chapo. Both groups had earlier tried to enter the venue but were barred from doing so.\n\nIs this a wedding with private invitations? We want to see the president being sworn in but we have been told we cant, Maputo resident Paulu Hamuze told the BBC.\n\nMondlanes electoral campaign was backed by a small opposition party, which heeded his call for a boycott of the inauguration.\n\nBoth of Mozambiques leading opposition parties  Renamo and MDM  also boycotted the swearing-in because they also do not recognise Chapo as the rightful winner.\n\nChapo succeeds Filipe Nyusi, who has stepped down at the end of his two terms.\n\nEven those in Mozambique who wish Chapo well openly question his legitimacy, or whether he will be able to tackle the problems he has identified.\n\nChapo is someone I admire greatly, civil society activist Mirna Chitsungo tells the BBC.\n\nI worked with him for four years  I am familiar with his willingness to act, his openness to dialogue, and his readiness to follow recommendations from civil society on the ground.\n\nHowever, he is assuming an illegitimate power. This stems from a fraudulent electoral process He is taking power in a context where the people do not accept him.\n\nIn addition to winning over a hostile public, Chapo will also have to deliver the economic turnaround and halt to corruption that he promised on the campaign trail.\n\nChapo will face many enemies because it looks like Mozambique is run by cartels, including cartels of books, cartel of medicines, cartel of sugar, cartel of drugs, cartel of kidnappings, mafia groups, says analyst and investigative journalist Luis Nhanchote.\n\nHe needs to have a strong team of experts, willing to join him in this crusade of dismantling the groups meticulously, he adds.\n\nBut first, he has to calm down Mozambicans and do all in his power to restore peace in the country.\n\nDaniel Francisco Chapo was born on 6 January 1977 in Inhaminga, a town in Sofala province, the sixth of 10 siblings. This was during Mozambiques civil war, and the armed conflict forced his family to move to another nearby district.\n\nHis secondary schooling in the coastal city of Beira was followed by a law degree from Eduardo Mondlane University then a masters degree in development management from the Catholic University of Mozambique.\n\nNow married to Gueta Sulemane Chapo, with whom he has three children, Chapo is also said to be a church-going Christian and fan of basketball and football.\n\nMany current and former colleagues describe Chapo as humble, hard-working and a patient leader.\n\nAhead of becoming the ruling Frelimo partys presidential candidate, he had been a radio and television host, a legal notary, university lecturer and provincial governor before rising to the post of Frelimo general secretary.\n\nSpeaking at his recent birthday celebrations, Chapo himself acknowledged the daunting challenge awaiting him as president.\n\nWe must recover our country economically its easy to destroy, but building is not an easy task.\n\nNational reconciliation, creating more jobs, reforming electoral law and decentralising power are top of his agenda, he said.\n\nBut how successful can he be without much of the country behind him?\n\nAt the very least he will mark a change from outgoing President Felipe Nyusi, whom Ms Chitsungo says many Mozambicans will be happy to see the back of.\n\nChapo is a figure of dialogue and consensus, not one to perpetuate Nyusis violent governance style. He has the potential to negotiate with Mondlane.\n\nWhile Chapo may not fully satisfy all of Mondlanes demands, I believe he could meet at least 50% of them, adds Ms Chitsungo.\n\nMondlane  a part-time pastor who insists he was the true winner of the polls  is reported to be sheltering in one of Maputos hotels after returning from self-imposed exile.\n\nIt is not known what security protection he has there, nor who is paying for it.\n\nHe alleges that last week, while touring a market in Maputo, a vendor in his vicinity was shot,echoing the murder of two of his close aides in October.\n\nAs the mastermind of nationwide protests against the disputed election result, he has come to be seen by many as a voice for the voiceless. Yet, at present, the president-elects camp is not engaging him publicly.\n\nNonetheless, listening to the publics grievances and demands, and sometimes ignoring the commands of his ruling Frelimo party, will be key to Chapos success, analysts have told the BBC.\n\nFinding some way of engaging constructively with Mondlane would undoubtedly provide a boost, they say.\n\nWinning the public over may also require Chapo to say no to fat salaries for the elite and fringe benefits, some of which are 10 times higher than Mozambiques minimum wage, argues Mr Nhachote.\n\nPlus, if Chapo is to have any chance of bringing an end to the broader political crisis, he will require support from others to make lasting, structural change, argues prominent clergymen Rev Anastacio Chembeze.\n\nPerhaps we should remain sceptical of one single person to solve the challenges of Mozambique  change must start within the system itself.\n\nWe should strive for a separation of powers within the state apparatus, the international monopolies have huge interests in the country, and we have serious ethical issues within the political elites to address it.\n\nOnce in office, Chapo should sack the countrys Police Chief Bernadino Rafael, analysts have told the BBC. He denies any wrongdoing but is regarded by some as the mastermind behind the brutal response to the post-election protests.\n\nThey say they want him replaced with a successor who respects human rights and follows legal and international standards. Another suggestion analysts have touted is for a new attorney-general to be brought in.\n\nChapo will be the first president of Mozambique who did not fight in the independence war.\n\nHe is part of the new generation. Part of his background is completely different from his predecessors  he was born in a country liberated by them, says Mr Nhachote.\n\nIf he wants to make a real mark on history, he has to challenge those past icons. If he cant [manage that], I am sure that he will only run for one term.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15225610/chapo.webp",
            "description": "<p>BBC Mozambique’s new President Daniel Chapo has been sworn in at a low-key ceremony in the capital, Maputo, that was marred by an opposition boycott following heavily disputed elections. In his first presidential address, Chapo, 47, pledged to “devote all my energies” to promoting unity and human rights in a nation scarred by post-election violence.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambiques-new-president-sworn-in-despite-opposition-boycott/\">Mozambique’s new president sworn in despite opposition boycott</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Chinese bus maker Zhongtong dismisses claims of suspension of operations in Zimbabwe",
            "url": "https://www.newzimbabwe.com/chinese-bus-maker-zhongtong-dismisses-claims-of-suspension-of-operations-in-zimbabwe/",
            "content": "By Staff Reporter\n\nCHINESE bus manufacturer, Zhengzhou Bus Zimbabwe has dismissed falsehoods that it has suspended its operations locally.\n\nThe company, which boasts of its popular Zhongtong and Yutong brands of coaches which dominate the countrys roads, said it was still operating as usual.\n\nThis week social media was awash with a purported notice saying the bus manufacturer was closing shop effective January 14, 2025.\n\nIn a statement, lawyers representing Zhengzhou Bus Zimbabwe, trading as Zhongtong Bus Zimbabwe, dismissed the rumours, warning peddlers of misinformation that the law will catch up with them as an investigation had been instituted.\n\nIt has come to our attention that there are false claims and statements circulating regards the operational status of Zhongtong Zimbabwe (Pvt) Limited, and in light of these statements, we wish to officially clarify that these reports are completely unfounded and false.\n\nZhongtong Zimbabwe (Pvt) Limited remains fully operational and committed to providing our clients with high-quality services as has always been the case.\n\nWe urge our clients, concerned stakeholders and parties to distance themselves from and not rely on these bogus claims. Our services continue as usual, and the management is here to support with any needs or inquiries that the public may have, reads the official statement.\n\nThe bus maker, based in Liaocheng, Shandong province, was founded in 1958 and is listed on the Shenzhen Stock Exchange and is one of Chinas major automobile companies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15214926/zhongtong.jpg",
            "description": "<p>By Staff Reporter CHINESE bus manufacturer, Zhengzhou Bus Zimbabwe has dismissed falsehoods that it has suspended its operations locally. The company, which boasts of its popular Zhongtong and Yutong brands of coaches which dominate the country’s roads, said it was still operating as usual. This week social media was awash with a purported notice saying</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-bus-maker-zhongtong-dismisses-claims-of-suspension-of-operations-in-zimbabwe/\">Chinese bus maker Zhongtong dismisses claims of suspension of operations in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "17 arrested for filming accident scene in Harare CBD",
            "url": "https://www.newzimbabwe.com/17-arrested-for-filming-accident-scene-in-harare-cbd/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15214450/accident.webp",
            "description": "<p>By Staff Reporter THE Zimbabwe Republic Police (ZRP) on Wednesday arrested 17 people for filming an accident scene in Harare CBD using their smartphones. The 17 were taking pictures and videos of a commuter omnibus which collided with a truck at the intersection of Robert Mugabe and Second Streets. Police confiscated their phones. According to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/17-arrested-for-filming-accident-scene-in-harare-cbd/\">17 arrested for filming accident scene in Harare CBD</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Zanu PF MP faces scrutiny over Housing Cooperative scandals",
            "url": "https://www.newzimbabwe.com/zanu-pf-mp-faces-scrutiny-over-housing-cooperative-scandals/",
            "content": "By Pauline Chateuka\n\nThe Harare South lawmaker, Trymore Kanopula, has been implicated in corrupt deals in his constituency.\n\nThe Zanu PF legislatorwho is popularly known as TKis being accused of participating in questionable dealings linked to the Simon Muzenda Housing Cooperative.\n\nReports of the alleged involvement of Kanopula in the disputes emerged after disgruntled residents approached our news crew following the publication of other controversial land deals in rural Seke involving the Manyame Rural District Council and another ruling Zanu PF lawmaker, Innocent Benza.\n\nFormed in 2012, Simon Muzenda Housing Cooperative aimed to develop 400 stands and provide essential infrastructure such as schools, clinics, and recreational spaces in the constituency.\n\nHowever, poor governance, lack of transparency, and persistent internal conflicts have significantly derailed progress.\n\nSubsequently, over 600 stands, including those reserved for public utilities, were sold by cooperative members under opaque circumstances, with revenue being diverted to individuals.\n\nStands belonging to an unnamed private land developer were also sold without consent, exacerbating ownership disputes.\n\nHousing cooperatives such as Simon Muzenda have over the last two decades attracted thousands of desperate home seekers, drawn by promises of affordable housing and stands.\n\nHome-seekers have reported stalled development, lack of transparency and financial irregularities, sparking widespread anger and distrust.\n\nSources in Harare South alleged that Kanopula exploited his political influence to collaborate with the cooperatives leadership in illegal land sales and transfers.\n\nThese reportedly include re-allocating land earmarked for essential amenities such as schools and clinics for residential purposes and selling small pieces of land on wetlands to prospective homeowners.\n\nWhile Kanopula, who was elected on a Zanu PF ticket in 2023, is expected to ensure his community gets secure shelter, residents who received the shady residential stands are still without title deeds and can be booted out any time.\n\nOne source, who preferred to remain anonymous, said: The leadership, including Kanopula, has thwarted mechanisms for transparency. General meetings are suspended, and no one is held accountable. We dont even know where our money is going.\n\nThere has been an outcry over the reported misuse of cooperative funds.\n\nSimon Muzenda Housing Cooperative members were asked to pay $30 each to regularise land use and verify state land allocations.\n\nThis amounted to over $6,000, which reportedly vanished without a trace, according to cooperative members.\n\nKanopula is alleged to have been involved in the misappropriation of these funds, though he denies any wrongdoing.\n\nI dont know anything about that. If anyone thinks they were duped, they should report it to the police and stop mentioning my name.\n\nAs the member of parliament, I do politics. l dont deal with small cooperatives and l will sue people and make money for playing with my name, Kanopula said in an interview.\n\nCooperative funds ate not being deposited into the agreed bank account, it was established.\n\nThe money was pocketed by those in charge. Kanopula and others are taking advantage of peoples trust, and the cooperative has become a cash cow for a few individuals, said another source who had requested an interview with this publication.\n\nBut the co-operative managers insist they are carrying out their work above board.\n\nGilbert Manatsa, a committee member at the Simon Muzenda Housing Cooperative, maintained that funds were used appropriately and that development projects were progressing.\n\nWe havent received any complaints from our members. These are baseless accusations from people who dont want to see us succeed, Manatsa said.\n\nDominic Mufanochiya, the cooperative chair,dismissed the allegations as baseless and accused their elected secretary, Alec Chingwaru, for spreading malicious reports after being suspended for alleged misconduct.\n\nEverything is in order. This is all Chingwarus doing because we suspended him, said Mufanechiya.\n\nAt the moment, no one can claim to be a member because the co-operative doesnt have an approved register. Those claiming misuse of funds are spreading lies to tarnish our reputation, added Mufanochiya.\n\nBut a 2023 audit supported by the Small and Medium Enterprises forced the production of a member register and fresh elections, contradicting Mufanochiyas claim.\n\nThe letter from the Ministry notifying members of the audit\n\nChingwaru dismissed the allegation against him.\n\nTheir assertion that the cooperative is operating without membership is both baseless and dishonest.\n\nFollowing an audit, a provisional register was established, and an inaugural meeting was held in June 2024, attended by members who had each paid $30 in contributions.\n\nThese funds were later misappropriated by Manatsa and Mufanochiya.\n\nTheir claim of a lack of membership not only contradicts the facts but is also an egregious attempt to deflect accountability for their actions, he said.\n\nChingwaru implicated the area legislator.\n\nTheir reliance on political interference is evident. In court filings, they openly acknowledged being directed by MP Hon. Trymore Kanopula to file for an interdict against me.\n\nThe matter is now before the High Court, and while I will not delve into its specifics as it is sub judice, I am confident that the judiciary will address these baseless allegations appropriately, he said.\n\nEvery action I took was within my mandate to ensure transparency and proper governance within the cooperative.\n\nThis is not the first time Kanopulas name has been linked to scandal.\n\nDuring the 2023 election campaign, he reportedly promised residents that cooperatives would help them secure title deeds under President Mnangagwas housing scheme.\n\nThese promises are yet to materialize, further fueling discontent.\n\nIn September 2023, Kanopula was embroiled in a dispute with Pungwe-Chimurenga Housing Cooperative (Eyrecourt) where the cooperative accused him of converting land meant for commercial, clinic, and school purposes into residential stands for personal gain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15105956/WhatsApp-Image-2025-01-15-at-12.49.59.jpeg",
            "description": "<p>By Pauline Chateuka The Harare South lawmaker, Trymore Kanopula, has been implicated in corrupt deals in his constituency. The Zanu PF legislator—who is popularly known as TK—is being accused of participating in questionable dealings linked to the Simon Muzenda Housing Cooperative. Reports of the alleged involvement of Kanopula in the disputes emerged after disgruntled residents</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-mp-faces-scrutiny-over-housing-cooperative-scandals/\">Zanu PF MP faces scrutiny over Housing Cooperative scandals  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        },
        {
            "title": "Lewis Machipisa: Pioneering Zimbabwean journalist remembered as a “good soul who touched many lives”",
            "url": "https://www.newzimbabwe.com/lewis-machipisa-pioneering-zimbabwean-journalist-remembered-as-a-good-soul-who-touched-many-lives/",
            "content": "Lewis Lew Machipisa, a veteran Zimbabwean journalist who spent nearly two decades at the BBC World Service and was known for his warm personality and dedication to African journalism, died in his sleep at his home in Catford, Southeast London, on January 7, 2025. He was 52.\n\nHis passing was announced by family and colleagues at the BBC, where he had worked as a producer for flagship programs Network Africa and Focus on Africa until 2020. He is survived by his three children, Dudu, Dumi, and Chikomborero.\n\nMachipisas journey in journalism began at Harare Polytechnics School of Journalism in 1991. He started his career as a correspondent for Inter Press Service in Harare in 1993, before joining the BBC World Services Zimbabwe bureau. In the early 2000s, amid political tensions in Zimbabwe, he relocated to London, joining many other journalists leaving the country at that time.\n\nLewis was then a keen correspondent, keeping the continent and indeed the rest of the world informed by reporting on and explaining a range of issues in late President Robert Mugabes Zimbabwe, said Josephine Hazeley, former BBC Africa Deputy Editor.\n\nHis reporting on the controversial seizure of white-owned farms in Zimbabwe ultimately forced him to leave his homeland, but it exemplified his commitment to telling important African stories. He later covered the historic birth of South Sudan as a nation, spending a year there and forming deep connections with both the countrys leadership and its citizens.\n\nLewis wasnt just a good friend; he was a brilliant journalist and creative. He had this knack for giving every story he touched that extra spark, said Rachael Akidi, former BBC Focus on Africa Editor. Whether it was reporting on the seizure of white-owned farms in Zimbabwe or covering the birth of a new nation in South Sudan, his work always stood out.\n\nColleagues remember Machipisa, affectionately known as Machipee or Chimurenga, for his infectious smile and ability to bring levity to the newsroom. Bola Mosuro, a former colleague, recalled: Working a night shift or having a long production day never felt tedious if you knew it was with Lewis. Instead, youd be in good spirits knowing he was editing or was part of the team that youd be spending long hours with.\n\nStanley Kwenda, a Zimbabwean journalist who worked with him at BBC Focus on Africa said he had lost a mentor.\n\nHe took me under his wing. Taught me how to be a BBC type. His influence wasnt just limited to our professional relationship. He was a social teacher and helped me settle in London when the citys lights were too bright for me, said Kwenda.\n\nHis impact extended beyond the newsroom. In Londons Zimbabwean diaspora community, he was instrumental in facilitating access for high-level Zimbabwean officials and musicians to the BBC and other global media platforms. He was known for his generosity of spirit and willingness to help others, often without seeking recognition.\n\nAudrey Brown, Focus on Africa Lead Presenter, remembered him for both his lightheartedness and professionalism: We loved him for his sense of mischief, his refusal to take himself too seriously. But we knew the one thing he did not joke about was his commitment to being a journalist worthy of the trust our listeners placed in us as a collective.\n\nDespite his professional success, Machipisa remained humble and approachable. As Akidi noted: He lived in the moment  even impulsive at times. He never took himself too seriously During one of our chats during the pandemic, he shared how humour was his way of dealing with lifes curveballs. It made sense because he carried a lot, but he carried it lightly.\n\nJosephine Hazeley remembers him as a very laid-back colleague who did his best. When caught on a good day at BBC Africa, Lewis was a delight to work with!\n\nHis connection with BBC African Service listeners was particularly special, built on his natural warmth and storytelling ability. He had an extraordinary talent for making instant connections with people from all walks of life, treating everyone he met with the same genuine interest and respect.\n\nIn the words of his colleagues, Machipisa will be remembered as, a good soul who touched many lives with his generous spirit. Lew leaves behind a legacy of professional excellence and personal kindness that touched countless lives across Africa and beyond.\n\nTo contribute to Lews chema, please visit https://gofund.me/71899b96.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15094046/WhatsApp-Image-2025-01-14-at-17.13.18.jpeg",
            "description": "<p>Lewis “Lew” Machipisa, a veteran Zimbabwean journalist who spent nearly two decades at the BBC World Service and was known for his warm personality and dedication to African journalism, died in his sleep at his home in Catford, Southeast London, on January 7, 2025. He was 52. His passing was announced by family and colleagues</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lewis-machipisa-pioneering-zimbabwean-journalist-remembered-as-a-good-soul-who-touched-many-lives/\">Lewis Machipisa: Pioneering Zimbabwean journalist remembered as a “good soul who touched many lives”  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "16 Jan 2025"
        }
    ]
}