{
    "news": [
        {
            "title": "“Third term referendums will gobble US$40 million”",
            "url": "https://www.newzimbabwe.com/third-term-referendums-will-gobble-us40-million/",
            "content": "By Alois Vinga\n\nMDC leader, Douglas Mwonzora, says if the country decides to press ahead with the third term extension agenda for President Emmerson Mnangagwa, an estimated US$40 million will be gobbled from the fiscus.\n\nSections of the ruling Zanu PF party are pushing for an extension of Mnangagwas tenure beyond the constitutionally stipulated two five-year terms. Mnangagwa, who is currently serving his final term, insists he is a constitutionalist and will step aside in 2028.\n\nAt the height of the calls, another faction resisting the proposal fronted by war vet Blessed Geza is backing Vice President Constantino Chiwenga, the favourite to take over from Mnangagwa. Geza has since called for demonstrations and an indefinite stay-away, which was recently ignored by citizens hard-hit by poverty and cannot afford to stay at home in a highly informal Zimbabwe\n\nSpeaking to NewZimbabwe.com on the sidelines of the Zimbabwe Congress of Trade Unions (ZCTU) organised Workers Day Commemorations Thursday, Mwonzora criticised forces angled towards extending Mnangagwas term of office.\n\nOpposition MDC leader Douglas Mwonzora\n\nWe are totally opposed to the issue of the third term. We must stick to the Constitution, which says the President must serve for a maximum of 10 years. President Mnangagwa must be even more grateful for the fact that he has been in the Cabinet since 1980.\n\nApart from that, on expiry of his current term, he would have served in office for a good 11 years, because he completed one year that was left by the former late president.\n\nIn the event that he faces no resistance to amending the constitution for a third term. It means we have to conduct two referendums, and a referendum is an election that will cost US$ 20 million each. There is no need for that, he said.\n\nAsked whether he was considering backing Gezas demonstrations to align with the anti-third term agenda, Mwonzora rubbished the war vets efforts, saying supporting such an initiative will only perpetuate Zanu-PFs hold on power.\n\nHe said MDCs agenda has nothing to do with changing the leader of ZANU-PF midway.\n\nAdded Mwonzora, That is not for us to say, because we are wiser(3:29)to know that if we are to change the president of ZANU-PF today, he will be replaced by a(3:36)president of ZANU-PF. So there will not be any change of government, which is what we(3:41)want as the opposition.\n\nWe want a change of government. So the internal views within ZANU-PFare not for us. But where we agree with him and other people is that there should not be a third term. But on the issue of whether they want to change their president, its up to them as ZANU-PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Alois Vinga MDC leader, Douglas Mwonzora, says if the country decides to press ahead with the third term extension agenda for President Emmerson Mnangagwa, an estimated US$40 million will be gobbled from the fiscus. Sections of the ruling Zanu PF party are pushing for an extension of Mnangagwa’s tenure beyond the constitutionally stipulated two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/third-term-referendums-will-gobble-us40-million/\">“Third term referendums will gobble US$40 million”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "ERC calls for paid voting leave for workers",
            "url": "https://www.newzimbabwe.com/erc-calls-for-paid-voting-leave-for-workers/",
            "content": "By Thandiwe Garusa\n\nTHE Election Resource Centre (ERC) has called for the introduction of legislation allowing employees to take a leave of absence on polling day to vote, saying this removes electoral participation barriers.\n\nIn a workers day message, ERC urged African authorities to ensure workers are actively included in democratic processes by addressing barriers to their participation in elections.\n\nSpecifically, the ERC recommends the introduction of provisions enabling employees to take a leave of absence for a specified period on polling day, specifically for casting a vote.\n\nThis aligns with the principle of removing practical barriers to voting. The ERC is concerned that limited time away from work on election days may inadvertently infringe upon workers voting rights.\n\nThe ERC emphasises the active inclusion of workers, a significant group, in this vision of participatory democracy.\n\nIn Zimbabwes 2023 general elections, some working-class citizens were unable to vote due to the limited time allocated for casting their ballots.\n\nVoting was delayed, particularly in Harare, where most polling stations failed to open on the first day.\n\nAs a result, many workers could not return to vote the following day because they did not have leave days available.\n\nERC emphasised that workers active inclusion is vital to participatory democracy.\n\nTherefore, the ERC calls on the relevant authorities across Africa, including Election Management Bodies (EMBs), Parliaments, and Ministries responsible for Justice and Elections, to proactively address this challenge.\n\nWe urge these bodies to review existing legislation and/or enact new regulations to effectively safeguard the rights of workers to vote on election days, ERC said.\n\nThe elections watchdog also called for a review of the definition of persons who may vote by post or through special voting mechanisms in the relevant Electoral Acts.\n\nIt also suggested the revision of electoral laws to expand early voting access for groups such as people with disabilities, senior citizens, and expectant mothers, while calling for consideration of early voting as an alternative to proxy voting and sought to include voters such as polling personnel and essential service workers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/24122940/vote-assisted.jpg",
            "description": "<p>By Thandiwe Garusa THE Election Resource Centre (ERC) has called for the introduction of legislation allowing employees to take a leave of absence on polling day to vote, saying this removes electoral participation barriers. In a workers’ day message, ERC  urged African authorities to ensure workers are actively included in democratic processes by addressing barriers</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/erc-calls-for-paid-voting-leave-for-workers/\">ERC calls for paid voting leave for workers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Recall the Broadcasting Services Amendment Bill before it is signed into law: MISA appeals to govt",
            "url": "https://www.newzimbabwe.com/recall-the-broadcasting-services-amendment-bill-before-it-is-signed-into-law-misa-appeals-to-govt/",
            "content": "By Costa Nkomo\n\nThe Media Institute of Southern Africa (MISA) Zimbabwe has urged the Zimbabwean government to shelve the new Broadcasting Services Bill and allow a national forum to reconsider its nature, warning that if it is signed into law in its current form, it will set Zimbabwe back.\n\nAddressing delegates at the pre-commemorations of World Press Freedom Day in Harare on Wednesday, MISA Zimbabwe director Thabani Moyo appealed to the Ministry of Information to consider withdrawing the Bill from the Presidents Office, citing a number of concerns.\n\nWhat we are proposing is that the Ministry rethinks the matter at ministerial level and actually recalls the Bill. At the Presidents Office level, to send it back to the ministry, at the stakeholder level, to organise the best minds to come together. At national level, to get that dialogue going through a step-by-step process of reimagining broadcasting services in Zimbabwe, he said.\n\nMoyo argued that the Bill failed to reflect the contributions made by Zimbabweans during public consultations across the country and that it did not appreciate the impact of emerging technologies, such as Artificial Intelligence, on the global broadcasting industry.\n\nHe also voiced concerns about the scrapping of the 40 percent foreign ownership cap on broadcasting institutions, which had been included in the draft bill with the aim of boosting foreign direct investment.\n\nThe Bill did not factor in the bulk of the contributions that were proffered in the consultative meetings held from 16 to 21 December 2025. According to the parliamentary report, 485 Zimbabweans contributed as provided for under section 141 of the Constitution.\n\nThe essence of taking parliament to the people is to put the people at the centre of law-making, and when the people make submissions, it is only fair that they are reflected in the Bill. Members of Parliament across the board made similar submissions in Parliament but were also equally ignored.\n\nThe Bill is actually regressing in terms of foreign direct investment. The draft proposed 40 percent, and now it is going backwards. Even 40 percent was a struggle to push for, and we are now going backwards. Broadcasting by its nature is capital intensive, he added.\n\nOne of the key bones of contention that emerged during public meetings on the new Broadcasting Services Amendment Bill was clause 15, which links ZINARA vehicle licensing to ZBC radio licensing. According to the parliamentary report from the public hearings, many participants described this particular linkage as discriminatory and unfair to motorists.\n\nThe main grievance was that motorists should not be forced to pay ZBC radio licenses when anyone can access the same services using other digital gadgets, like mobile phones, without necessarily having a vehicle.\n\nParliamentarians across the political spectrum also debated in vain against combining ZINARA vehicle licensing and ZBC radio licensing.\n\nAt one point, while debating the Bill in Parliament, the Zanu PF secretary for local government and Member of Parliament Supa Mandiwanzira warned that the linkage of vehicle licensing and ZBC Television and Radio licensing was equal to throwing the cat among the pigeons.\n\nIn response to MISA, Director for International Communication Services in the Ministry of Information, Richard Mahomva, urged MISA to put its proposal in black and white and engage the ministry for a response.\n\nMahomva was representing the Minister of Information, Jenfan Muswere, at the event.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/10124332/Radio-Station.jpg",
            "description": "<p>By Costa Nkomo The Media Institute of Southern Africa (MISA) Zimbabwe has urged the Zimbabwean government to shelve the new Broadcasting Services Bill and allow a national forum to reconsider its nature, warning that if it is signed into law in its current form, it will set Zimbabwe back. Addressing delegates at the pre-commemorations of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/recall-the-broadcasting-services-amendment-bill-before-it-is-signed-into-law-misa-appeals-to-govt/\">Recall the Broadcasting Services Amendment Bill before it is signed into law: MISA appeals to govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Chamisa decries lecturers’ paltry salaries, promises a pro-workers govt",
            "url": "https://www.newzimbabwe.com/chamisa-decries-lecturers-paltry-salaries-promises-a-pro-workers-govt/",
            "content": "By Alois Vinga\n\nOPPOSITION politician Nelson Chamisa has bemoaned the meagre salaries given to university lecturers, vowing to prioritise workers issues once he takes charge.\n\nUniversity of Zimbabwe (UZ) lecturers have downed tools demanding a decent salary. A junior lecturer is taking home as little as $230 a month, which is not enough to cater for basic needs.\n\nPoor remuneration is not only in the lecturers fraternity, as many of the countrys professionals are earning not more than US$300 per month.\n\nIn a statement to officially mark the 2025 Workers Day commemorations, Chamisa described Zimbabwe as a country without work for many and hailed the countrys citizens for their resilience.\n\nWorkers have been plunged into slavery. Many workers are earning extremely low wages, rendering them working poor, basically putting them in the poverty bracket. Our teachers and nurses are suffering. The civil servants are struggling. Workers in general are without a decent living wage. University lecturers, who are currently on strike, are earning a paltry salary, an embarrassing $228 per month.\n\nMany workers have lost their pensions and face a difficult retirement future. Zimbabwean workers literally live, work and retire in poverty, Chamisa said.\n\nHe added that due to high unemployment and lack of government protection, many workers are stripped of their rights and freedoms, pushingmany into survivalist informal employment without social security, income security or other labour rights.\n\nThe level of poverty in the working class, Chamisa said, has driven many professionals to seek better opportunities outside the country.\n\nThe Next Government, our new government, will focus on restoring the dignity of workers and the strengthening of genuine social dialogue as a means of addressing the multiple problems that workers are facing.\n\nWe will prioritise rebuilding the economy and public services in order to create employment opportunities for the many unemployed young Zimbabweans. We will end casualisation of jobs and stop job losses and retrenchments. Labour laws and practices shall be reformed in order to strengthen protection of freedom of association, expression and collective bargaining, added Chamisa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/14175939/N4-e1665894694127.png",
            "description": "<p>By Alois Vinga OPPOSITION politician Nelson Chamisa has bemoaned the meagre salaries given to university lecturers, vowing to prioritise workers’ issues once he takes charge. University of Zimbabwe (UZ) lecturers have downed tools demanding a decent salary. A junior lecturer is taking home as little as $230 a month, which is not enough to cater</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chamisa-decries-lecturers-paltry-salaries-promises-a-pro-workers-govt/\">Chamisa decries lecturers’ paltry salaries, promises a pro-workers govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Kenyan MP shot dead in ‘targeted’ attack in Nairobi",
            "url": "https://www.newzimbabwe.com/kenyan-mp-shot-dead-in-targeted-attack-in-nairobi/",
            "content": "BBC\n\nA Kenyan member of parliament has been shot dead in the streets of the capital Nairobi by gunmen on a motorcycle in a suspected assassination.\n\nPolice said the attackers had been trailing Charles Ongondo Weres vehicle before one of them got off the motorbike and shot him at close range.\n\nThe nature of this crime appears to be both targeted and predetermined, police spokesperson Muchiri Nyaga said in a statement.\n\nThe opposition MP had two months ago complained about threats to his life, local media reported.\n\nAfter the shooting on late Wednesday, his driver and bodyguard, both unhurt, managed to rush the injured MP to Nairobi Hospital, where he was pronounced dead on arrival.\n\nThe attack happened along Ngong Road near a busy roundabout often manned by traffic police and well secured with cameras.\n\nShortly after the shooting, senior police commanders and detectives visited the scene and investigations are under way, police said.\n\nPresident William Ruto has ordered police to conduct a thorough investigation into the attack, adding: Those responsible must be held to account.\n\nFellow legislators who visited the scene on Wednesday night expressed shock and outrage at the killing and called for swift investigations and justice.\n\nParliament Speaker Moses Wetangula described the MP as a fearless and distinguished legislator, calling his shooting devastating.\n\nThe motive for his killing is still not clear but the soft-spoken legislator had publicly claimed some hired goons were plotting to assassinate him, attributing the plot to local politics.\n\nIn February, he expressed concern over growing violence and unrest during public events in the Kasipul constituency in western Kenya which he represented.\n\nWhen you hear I have been killed, Kasipul will not be the same again. But I know they wont kill me because I have the Bible in my phone and another one under my pillow, Were said at the time.\n\nOn Thursday, homicide detectives visited the scene with Interior Minister Kipchumba Murkomen saying that investigations have advanced.\n\nWere was serving his second term in parliament as a member of the Orange Democratic Movement, led by veteran politician Raila Odinga.\n\nIn his statement, Odinga condemned the killing, saying the legislator was mercilessly and in cold blood, gunned down by an assassin.\n\nWe have lost a gallant son of the soil! Odinga added.\n\nOdinga lost to President Ruto in the 2022 election and rejected the results due to alleged irregularities.\n\nThe former prime minister has since struck a political deal with Ruto which saw some opposition members join cabinet in what is referred as the broad-based government  which Were supported.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/01205947/kenya-mp.webp",
            "description": "<p>BBC A Kenyan member of parliament has been shot dead in the streets of the capital Nairobi by gunmen on a motorcycle in a suspected assassination. Police said the attackers had been trailing Charles Ong’ondo Were’s vehicle before one of them got off the motorbike and shot him at close range. “The nature of this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kenyan-mp-shot-dead-in-targeted-attack-in-nairobi/\">Kenyan MP shot dead in ‘targeted’ attack in Nairobi</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "In Zimbabwe, community seed banks are helping build climate resilience",
            "url": "https://www.newzimbabwe.com/in-zimbabwe-community-seed-banks-are-helping-build-climate-resilience/",
            "content": "The Mudzi district of eastern Zimbabwe has always been dry. Locals have gotten used to its sandy soils and erratic rainfall patterns, and the majority of its population still makes a living through farming, despite the inhospitable climate. But last August, conditions were worse than usual. Farmers watched row after row of corn, their staple crop, shrivel up and die as the worst drought in living memorydevastatedthe area.\n\nSparked by the El Nio weather pattern and exacerbated by climate change, last years drought left more than 68 million people across southern Africa in need of food assistance, including nearly half of all Zimbabweans. But while many in Mudzisurvivedthanks to help from the national government and international donors, including China, others turned to the village of Chimukoko. Here, in a low-slung brick building indistinguishable on the outside from the houses around it, they were able to collect seeds of local drought-tolerant crop varieties, like sorghum, millet, and peanuts, at no cost.\n\nThe building, calledbhengi re mbeu(which means seed bank in Shona, the Bantu language primarily spoken in Zimbabwe), hosts the local community seed bank. It was established in 2017 as part of an international initiative to make agriculture in the area more resilient to drought and extreme weather. The United Nations Intergovernmental Panel on Climate Change estimates that human-caused global warming could reduce crop yields in southern Africa by as much as 60 percent in the coming decades.\n\nAround the world, some1,700 knownlarge seed or gene banks store the genetic material from millions of varieties of plants in climate-controlled settings. The most famous  the Svalbard Global Seed Vault in Norway, whichwonthe 2024 World Food Prize  holdsup to 2.5 billion seeds. But in places like Zimbabwe, seed banks are taking root at a much smaller, informal scale, including at village levels. The Chimukoko seed bank, for example, holds 20 varieties of seeds, helping Mudzi farmers mitigate the worst impacts of the drought through the use of traditional knowledge thats been all but abandoned in favor of more industrial agriculture.\n\nWe see community seed banks as centers of agricultural biodiversity, said Andrew Mushita, an agronomist and director of the Community Technology Development Trust (CTDT), a Zimbabwean nonprofit that promotes food security. Moreover, these materials are quite key in terms of empowering local communities to produce and own the means of production.\n\nLocal ownership of seeds, Mushita explained, allows access to crops that are suited to the local environment, making them more resilient in the face of climate change  including the drought that hit the country last year. The crops grown from these seeds are also more culturally appropriate, suiting local tastes and traditions, and easy for farmers to access when they are needed most, rather than being subject to market forces. In Mudzi, for example, farmers were able to withdraw seeds from the bank when their own crops failed to germinate due to a lack of rain, allowing them to plant again for the next season. Some farmers had to plant two or three times before the rains finally came.\n\nCommunity seed banks also encourage farmers to grow a larger number of crops, rather than relying on corn monocropping, which spread throughout the country thanks to government agricultural policies that stem from colonial times. Rising temperatures and unreliable precipitation make this staple of Zimbabwean agriculture more vulnerable to natural disasters, such as drought, said Ronnie Vernooy, an expert in rural development with the global research group Alliance of Biodiversity International and the International Center for Tropical Agriculture (CIAT).\n\nDespite these benefits, community seed banks faced early resistance from formal conservation bodies such as national gene banks, Vernooy said, based on the idea that this was really something that only highly educated biologists or conservationists could do in certain conditions, such as special facilities equipped with cold storage.\n\nBut I think thats now changed, because now community seed banks have really spread all over the world, Vernooy said. Even organizations that were opposed are now saying, this is something that we also want to support.\n\nSince Vernooy joined the Alliance of Biodiversity International-CIAT in 2011, it has made community seed banking a central part of its work, promoting the practice in 20 countries around the world. For his part, Vernooy focuses on developing ways to make seed banks more sustainable and studying how they can assist farmers living in areas affected by conflict, such as Somalia and Sudan.\n\nThe concept of seed banking goes back to ancient times with farmers saving and sharing seeds through family, community, religious, or ethnic networks. But the modern structure of community seed banks in Africa arose after the 1983-1985 famine in Ethiopia, which killed as many as 1.2 million people and led development specialists to promote seed-banking as a way to increase local autonomy and reduce reliance on national and international supply chains for food.\n\nSince then, community seed banks have been established in countries as diverse as Nepal, Uganda, the Philippines, and Chile. In India, an organization called Navdanya hashelped communities collectmore than 2,000 drought- and salt-tolerant varieties of rice, while in Peru, Indigenous seed guardians are working to preserve the genetic diversity of local potatoes.\n\nIn Zimbabwe, the process had a slow start. The first seed bank was established in the eastern Uzumba-Maramba-Pfungwe district in 1999, as the CTDT set out to help reduce farmers dependency on hybrid crops and external seed sources, as well as empower women farmers.\n\nThe seed bank met with mixed reactions from locals, Mushita said, with many struggling to understand how the facility could help the community. Building it required an initial input of unpaid labor that some in the community werent willing to provide, and those who doubted its usefulness kept their distance. But eventually, they were able to see the benefits of the seed bank and began to participate more enthusiastically, Mushita said.\n\nBy the time the Mudzi seed bank opened in 2017, demand for indigenous seeds had increased, as farmers also learned about the benefits of planting diverse crops. In the eight years that followed, CTDT built an additional 26 community seed banks across Zimbabwe, and is in the process of constructing four more, Mushita said. Although concerns still come up, greater awareness and training through programs like farmer field schools have spread knowledge of the benefits of seed banks, he added.\n\nTo establish a seed bank, CTDT works with local authorities and community members in a collaborative process, educating people about the benefits of building such a facility but leaving the final decision on whether to build it up to residents, who come to a consensus through discussions with local leaders.\n\nOver the last several decades, community seed banks have been established in countries as diverse as Nepal, Uganda, the Philippines, and Chile. Photo inside the Jogimara community seed bank in Nepal byRonnie Vernooy/Bioversity International.\n\nIn Zimbabwe, the process had a slow start. But by the time the Mudzi seed bank opened in 2017, demand for indigenous seeds had increased, as farmers also learned about the benefits of planting diverse crops. Photo of seed fair at Chimukoko Community Seed Bank byMichael Major/Crop Trust.\n\nThe organization approaches communities located in areas that might hold strong genetic repositories, particularly in drier areas of the country with lower agricultural potential. Agriculturally intensive regions, Mushita said, tend to have lower genetic diversity because crops that grow there dont need to evolve to survive adverse conditions like droughts.\n\nOnce the decision to build a seed bank is made, locals are responsible for acquiring the land and materials necessary to construct the building it will be housed in, while CTDT provides support for the more capital-intensive aspects, such as the interiors of the seed storage rooms. Each seed bank costs about $30,000 to construct, Mushita said.\n\nAn elected committee of local farmers makes decisions about how to run the seed bank, including determining which varieties to focus on and developing a schedule for how to distribute the seeds. Farmers typically take out the seeds they need as loans and then return them back with interest in the form of additional seeds after the harvest.\n\nThe seeds dont just stay in their local communities. CTDT has also trained farmers to engage in participatory plant breeding, selecting the varieties that they believe are the most resilient or highest-yielding and reproducing them to share with universities and the national gene bank. The goal is to diversify the national seed supply by selecting the best varieties from different regions of the country, Mushita explained  making community seed banks the backbone of Zimbabwes gene banking program.\n\nSo far, the government seems supportive of farmer-led seed banking initiatives like those championed by CTDT. Zimbabwes deputy minister for Lands, Agriculture, Fisheries, Water and Rural Development, Vangelis Haritatos, spoke in support of the approach at a workshop hosted in Harare last November. The workshop sought to bring the countrys national policy in line with the International Treaty on Plant Genetic Resources on Food and Agriculture.\n\nThe government of Zimbabwe recognizes the fundamental role smallholder farmers play in the conservation and sustainable use of plant genetic materials, particularly their role in managing seed, multiplying, breeding and selection, saving and retention, as well as utilization, Haritatossaid.\n\nHowever, in Zimbabwe, seed banks continue to face legal hurdles. Since they are a relatively new kind of organization, its difficult to register them formally, Vernooy said, making support from governments, NGOs, and research organizations essential.\n\nThe CTDT is now working with the Zimbabwean government to establish a national policy for community seed banks, Mushita said, which would set up a formal legal structure for the facilities and bring them to each of the countrys 64 districts. University agricultural extensions would also provide technical support and training to farmers under the policy, which is still in the early planning stages. We believe that if these facilities are established in each and every district, then self-reliance will also increase, Mushita said.\n\nDespite the challenges, the organization has already seen an increase in crop diversity as a result of its work. Mushita says he has seen farmers growing dozens of different varieties of common crops like peanuts, sorghum, and millet. And though little empirical data exists yet to demonstrate the impacts of seed banks on food security in Zimbabwe, he has seen through personal observations that communities hosting these facilities tend to be more resistant to natural disasters, such as extreme drought.\n\nResearch from other countries supports his assessment. A2023 case studyby Norwegian researchers found that community seed banks decisively boosted food security in Malawi by, among other things, helping farmers conserve and access seeds of a rich diversity of crop varieties, enhancing the performance of selected varieties, and supporting agricultural practices that helped them respond to the effects of climate change.\n\nThe community seed banks are also helping support the development of new and more drought-tolerant plant varieties on a national and even international level. One organization that collects the most promising seeds from local facilities is the International Crops Research Institute for the Semi-Arid Tropics (ICRISAT), which has a gene bank in Matopos, about 30 kilometers from the southern Zimbabwean city of Bulawayo.\n\nWhile community seed banks such as the one in Mudzi are typically simple facilities that lack cold storage, a larger budget gives the ICRISAT gene bank access to more advanced technology, keeping seeds preserved for longer at lower temperatures. The organization relies on local farmers contributions to breed more drought-tolerant varieties of crops, said Tanyaradzwa Tenesi, a researcher at the ICRISAT gene bank.\n\nThe farmers are the ones who assist with crop diversity, Tenesi said. Once they understand the need for it  they are then willing to actively participate in the conservation of this material.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/01210546/seeds.jpg",
            "description": "<p>EarthIsland The system, which empowers farmers to produce diverse crops and own the means of production, is gaining traction worldwide. The Mudzi district of eastern Zimbabwe has always been dry. Locals have gotten used to its sandy soils and erratic rainfall patterns, and the majority of its population still makes a living through farming, despite</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-zimbabwe-community-seed-banks-are-helping-build-climate-resilience/\">In Zimbabwe, community seed banks are helping build climate resilience</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Analogue Africa – ‘Roots Rocking Zimbabwe’ album review: Delving deep into the world of Zimbabwean rock",
            "url": "https://www.newzimbabwe.com/analogue-africa-roots-rocking-zimbabwe-album-review-delving-deep-into-the-world-of-zimbabwean-rock/",
            "content": "FarOutMagazine\n\nA vast and ever-diversifying continent,Africahas produced an unimaginable wealth of groundbreaking, inventive, and far too often overlooked music that has since spread throughout the world. Playing host to thousands of distinct sounds and subgenres, the niche and grassroots nature of many of these African music scenes often means that it is easy for them to be lost to obscurity, particularly for listeners hailing from outside the continent. However, this fact also means that the record stores of Africa are ripe for crate-digging discoveries, which is essentially the manifesto of the long-running Analogue Africa series of releases.\n\nOn their latest release,Roots Rocking Zimbabwe, Samy Ben Redjebs compilation project shines a light on the forgotten and overlooked anthems of Zimbabwes rock movement from the mid-to-late 1970s. Featuring compelling tracks by Oliver Mtukudzi, Thomas Mapfumo,and The Green Arrows, among various others, the compilation sees the traditional folk sounds of the South African nation blended with the vibrancy of Harare and the increasing prevalence of Western rock, funk, and soul from that period.\n\nSome of the 25 tracks included on the double-LP compilation clearly draw from the influences of American rock, soul, and R&B, with the likes of Otis Redding evoked on songs like New Tutenkhamens Juborg Bound, while the Hammond organ riffs of Gypsy Caravans Chisituiti evoke the sharp coolness of 1960s mod soul-jazz, existing somewhere between Blue Note, Stax, and the northern soul scene.\n\nMeanwhile, other efforts included in the release embrace the Caribbean rhythms of rocksteady and reggae, in something of a full-circle moment. What shines through every single inclusion on this album, however, is the proudcultural history of Zimbabwe.\n\nAt the time that these songs were originally recorded, between 1975 and 1980, the nation was undergoing an unparalleled level of social and political change. From 1923 until 1965, the region known in the modern day as Zimbabwe fell under the jurisdiction of Southern Rhodesia and was at the mercy of British colonial rule. Then, in 1965, the white-minority government of the colonial state declared independence as Rhodesia.\n\nRhodesia, or the Republic of Rhodesia, lasted from 1965 until 1979, and was plagued by instability, unrest, and civil war. Despite declaring unilateral independence from Britain, many Black citizens found that life in Rhodesia was not all that different from life under colonial rule, although the period did spark a growing interest in the cultural history and importance of Zimbabwe. As such, many of the tracks onRoots Rocking Zimbabwepay homage to the traditional folk styles and heritage of Zimbabwe, in defiance of this new state of Rhodesia.\n\nThat being said, the majority of the songs included on the compilation are not overtly political in their content. Instead, they offer a sense of unity and musical euphoria in defiance of the civil war and political unrest which existed as the backdrop to this period in Zimbabwes history. Further, these groundbreaking recordings offered a strong, modern cultural identity for art and music as the nation entered an era of true independence from colonialism in 1980, when the state of Zimbabwe was formally established and recognised.\n\nThe 25 tracks included on this release speak to the diverse cultural output of Zimbabwe during that turbulent, transitional period in the nations history, and they have all been beautifully chronicled and compiled by Analogue Africa.\n\nUltimately, you cannot summarise the entire rock scene of a nation in one album, no matter how expansive it is, but this double album is about as close as you can come to immersing yourself in the infectious sounds of 1970s-era Harare without spending the rest of your years digging through boxes of records in the record stores of Southern Africa. As such, it is a must-listen, both for fans of Zimrock and Afro-funk, but also for anybody who wishes to gain a deeper cultural understanding of Zimbabwes artistic identity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/01211006/Roots-Rocking-Zimbabwe-The-Modern-Sound-of-Harare-Townships-1975-1980-2025-Far-Out-Magazine.webp",
            "description": "<p>FarOutMagazine A vast and ever-diversifying continent, Africa has produced an unimaginable wealth of groundbreaking, inventive, and far too often overlooked music that has since spread throughout the world. Playing host to thousands of distinct sounds and subgenres, the niche and grassroots nature of many of these African music scenes often means that it is easy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/analogue-africa-roots-rocking-zimbabwe-album-review-delving-deep-into-the-world-of-zimbabwean-rock/\">Analogue Africa – ‘Roots Rocking Zimbabwe’ album review: Delving deep into the world of Zimbabwean rock</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Man douses mother-in-law with petrol, sets her ablaze in murder attempt",
            "url": "https://www.newzimbabwe.com/man-douses-mother-in-law-with-petrol-sets-her-ablaze-in-murder-attempt/",
            "content": "By Staff Reporter\n\nA JILTED man from Rusape, Manicaland province, has been arrested for drenching his estranged wifes mother with petrol before setting her alight.\n\nThe suspect, identified as 43-year-old Abraham Muchapondwa, now faces an attempted murder charge.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the incident, which left the victim hospitalised after sustaining serious injuries.\n\nPolice in Rusape arrested Loveridge Abraham Muchapondwa (43) in connection with a case of attempted murder which occurred at Chiduku Village, on April 30, 2025.\n\nThe suspect poured petrol on his mother-in-law before setting her ablaze, said Nyathi.\n\nThe suspect had separated with his wife, who was now staying with the victim, sparking a violent reaction. The victim sustained burns on the head and chest and is hospitalised, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/20132944/fire.webp",
            "description": "<p>By Staff Reporter A JILTED man from Rusape, Manicaland province, has been arrested for drenching his estranged wife’s mother with petrol before setting her alight. The suspect, identified as 43-year-old Abraham Muchapondwa, now faces an attempted murder charge. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the incident, which left the victim hospitalised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-douses-mother-in-law-with-petrol-sets-her-ablaze-in-murder-attempt/\">Man douses mother-in-law with petrol, sets her ablaze in murder attempt </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Going wild: TikTok user’s ‘caveman’ skincare routine sparks a beauty debate",
            "url": "https://www.newzimbabwe.com/going-wild-tiktok-users-caveman-skincare-routine-sparks-a-beauty-debate/",
            "content": "IOL\n\nTikTok is always filled with verycreative, fun and informative content, but its also notorious for having outrageous and questionable content, and this may just be one of them.\n\nIn the recent episode of questionable content onTikTok, a young womans decision to ditch her skincare routine and adopt a caveman approach has left TikTok users shocked and concerned.\n\nTikTok user Tia Zakher has gained attention for her unconventional skincare approach, which involves abstaining from all skincare products, including water, to let her skins natural barrier function without interference.\n\nZakher claims this method allows her skin to reset and heal itself naturally. However, her latest videos reveal a concerning development: a thick, flaky texture on her face, which TikTok users are speculating is a fungal infection.\n\nWatch on TikTok\n\nAccording to Zakher, the buildup is due to dead skin cells piling up because her skins shedding cycle was disrupted for a long time from years of over-picking and removing texture manually.\n\nShe explains that her skin used to rely on picking to exfoliate, but now its having to learn how to shed on its own. Zakher attributes the current state of her skin to retention hyperkeratosis, a condition where the skin holds onto dead cells instead of shedding them immediately.\n\nIts a normal part of resetting my barrier, she claims. It looks bad temporarily, but its fixable and part of healing with patience and if I dont force it off.\n\nDespite her assurances, many TikTok users are warning her that she might be putting her skin at risk of serious damage. Some have expressed concern that the infection could worsen if left untreated, while others are questioning the validity of her approach.\n\nTikTok user @marlacolec said: So heres the thing. Im an esthi student and I DO THINK this is retention hyperkeratosis, but you cant just let it be for it to go away, it needs to be treated by a professional.\n\nWhile @taylorisanopenbook commented: With retention of hyperkeratosis, you still need help to remove the clumped dead skin cells. Whether from exfoliating or a moisturiser.\n\nIs it real or fake?\n\nSome users are accusing Zakher of rage baiting and suspect that she might have applied an Aztec clay mask with a dash of foundation to create the convincing look.\n\nAnother user even posted a TikTok of herself applying the clay mask to demonstrate how Zakher might have achieved the effect.\n\nThe debate rages on\n\nAs the debate continues, many are left wondering if Zakhers approach is a bold experiment or a recipe for disaster. While some have defended her approach, others have expressed worry about the potential consequences of abandoning proper skincare practices.\n\nWill she pay attention to the warnings?\n\nAbsolutely not, Zakher is very much adamant and is continuing down her unconventional path. One thing is certain though, her decision to document her journey on TikTok has sparked a lively discussion about skincare and the importance of hygiene, as well as seeking professional advice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/01205538/Screenshot-2025-05-01-at-21.54.49.png",
            "description": "<p>IOL TikTok is always filled with very creative, fun and informative content, but it’s also notorious for having outrageous and questionable content, and this may just be one of them. In the recent episode of questionable content on TikTok, a young woman’s decision to ditch her skincare routine and adopt a “caveman” approach has left TikTok</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/going-wild-tiktok-users-caveman-skincare-routine-sparks-a-beauty-debate/\">Going wild: TikTok user’s ‘caveman’ skincare routine sparks a beauty debate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        },
        {
            "title": "Missing South African police officers found dead in river after six days",
            "url": "https://www.newzimbabwe.com/missing-south-african-police-officers-found-dead-in-river-after-six-days/",
            "content": "BBC\n\nPolice in South Africa are searching for answers after the bodies of three police officers  who had been missing for six days  were found in a river.\n\nBoipelo Senoge, 20, Cebekhulu Linda, 24, and Keamogetswe Buys, 30, were last seen leaving a petrol station near Johannesburg last Wednesday.\n\nTheir bodies were discovered by divers around 70km (43 miles) away in Hennops River earlier this week. The car they had been in was recovered from the same river on Thursday.\n\nThe police initially said they were investigating a possible hijacking, but speaking on Thursday, the police chief told journalists: At this stage it looks like an accident, though a forensic investigation needed to be concluded.\n\nThe three police officers  all constables  were travelling in a white VW Polo when they went missing, a police statement said.\n\nTheir vehicle tracking device and mobile phones have been off since then.\n\nA search team subsequently spent sleepless nights combing the length and breadth of the Gauteng, Free State and Limpopo provinces, eventually finding parts of a vehicle believed to be a VW Polo, said national police commissioner Fannie Masemola.\n\nA Renault Kangoo van was then found nearby on the banks of Hennops River, in the area of Centurion. Two other bodies were also found.\n\nThe VW Polo was pulled out of the river on Thursday.\n\nThe three officers were travelling from Free State to Limpopo, when they went missing.\n\nAlong with the three constables, the divers found the remains of a police employee, who has not been named. He had been driving the Renault van, said Gen Masemola.\n\nHe added that the fifth body was decomposed and had not yet been identified.\n\nIt is not clear if these discoveries are connected to the deaths of the police officers.\n\nThe search for the missing police officers was followed closely by the South African public and prayers for the three constables had been circulating across social media.\n\nAfter the bodies were found, devastated loved ones gathered along the banks of the Hennops River, holding candles.\n\nSpeaking near where the vehicle was recovered on Thursday, Gen Masemola said: We need to give the investigation a space. At the end of the day we cant rule out anything, but we cant conclusively say this is what happened At this stage it looks like an accident until we finalise the forensics.\n\nThis marks a significant change in tone from Sunday, when the commissioner said: We cannot have criminals undermine the authority of the state by kidnapping three police officers. This is just a stern warning to those behind this incident, either you hand yourselves over, or we will fetch you ourselves.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/01205759/missing-SA-police.png",
            "description": "<p>BBC Police in South Africa are searching for answers after the bodies of three police officers – who had been missing for six days – were found in a river. Boipelo Senoge, 20, Cebekhulu Linda, 24, and Keamogetswe Buys, 30, were last seen leaving a petrol station near Johannesburg last Wednesday. Their bodies were discovered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/missing-south-african-police-officers-found-dead-in-river-after-six-days/\">Missing South African police officers found dead in river after six days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:40",
            "date": "02 May 2025"
        }
    ]
}