{
    "news": [
        {
            "title": "Tshabangu withdraws Supreme Court appeal; Karenyi Kore, Mushoriwa reinstated to Parly posts",
            "url": "https://www.newzimbabwe.com/tshabangu-withdraws-supreme-court-appeal-karenyi-kore-mushoriwa-reinstated-to-parly-posts/",
            "content": "By Staff Reporter\n\nSelf-styled secretary general of the opposition CCC, Sengezo Tshabangu has withdrawn his Supreme Court appeal in which he was challenging his ban from recalling members of the party by the High Court.\n\nThe withdrawal was done just before the hearing of the appeal at the Supreme Court.\n\nReasons for the withdrawal were not immediately available.\n\nTake notice that the applicants hereby withdraw their appeal against the respondents on 9th January 2025 with a tender of wasted costs, read the brief notice by his lawyers.\n\nThe development reaffirms High Court judgement which has become fully operational.\n\nThis means that the reshuffle and deployment by Tshabangu of various elected members of parliament in different portfolio committees that they were duly deployed to by the party is null and void and of no force or effect.\n\nAccordingly, all the reshuffled chairpersons of committees remain in office.\n\nThe removal of Hon Lynette Karenyi and Hon Edwin Mushoriwa from their membership of the SROC in their ex-official capacities as leader of the opposition in the National Assembly being unlawful and ultra vires the Constitution of Zimbabwe is null and void Accordingly the two remain in their positions.\n\nThe appointment of Nonhlanhla Mlotshwa as overall chief whip is unlawful and a legal nullify and of no force or effect, said CCC in a statement.\n\nThe High Court has indefinitely reserved its judgement in a matter in which Citizens Coalition for Change (CCC) leaders, recently sacked by the self-proclaimed secretary general of the party, Sengezo Tshabangu are suing him for his decision.\n\nLast year CCC leaders including the interim party leader, Welshman Ncube and his deputy, Lynette Karenyi Kore, Sesel Zvidzai and Edwin Mushoriwa filed an application citing their party as the first applicant.\n\nTshabangu had dismissed the leaders from their parliamentary roles and appointed his selections in their place.\n\nTshabangu, the Speaker of the National Assembly, and Senator Nonhlahla Mlotshwa were cited as respondents in court papers.\n\nNcube and his colleagues sought a court declaration that Tshabangus decisions to oust them from the Standing Rules and Orders Committee (SROC) were unlawful and exceeded his constitutional authority,\n\nThey also challenged Mlotshwas appointment as the CCC chief whip, claiming that such a position is not recognised under Section 151 (2) of the Constitution.\n\nThey also said the reshuffling of various CCC members across different parliamentary committees to which they were originally assigned.\n\nThey sought an order to prevent the Speaker from announcing these changes in the National Assembly which was upheld by High Court Judge Justice Neville Wamambo last week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Staff Reporter Self-styled secretary general of the opposition CCC, Sengezo Tshabangu has withdrawn his Supreme Court appeal in which he was challenging his ban from recalling members of the party by the High Court. The withdrawal was done just before the hearing of the appeal at the Supreme Court. Reasons for the withdrawal were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tshabangu-withdraws-supreme-court-appeal-karenyi-kore-mushoriwa-reinstated-to-parly-posts/\">Tshabangu withdraws Supreme Court appeal; Karenyi Kore, Mushoriwa reinstated to Parly posts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Slimming drug Ozempic may cost you your eyesight",
            "url": "https://www.newzimbabwe.com/slimming-drug-ozempic-may-cost-you-your-eyesight/",
            "content": "City Press\n\nGlobally, people wanting tolose weightare turning toOzempic, the so-called miracle drug prescribed for diabetes management and weight loss.\n\nHowever, two major studies conducted at the University of Southern Denmark have shown that Ozempic more than doubles the risk for patients of developing a rare, but serious, condition of the optic nerve that can lead to blindness. This condition is caused by a sudden loss of blood to the optic nerve and can result in permanent blindness, writes Dr Paul Ian Cross in the MedicalNewsToday, a health information website.\n\nIn the first Danish study, 424 152 patients with diabetes were monitored over five years. The incidence of non-arteritic anterior ischemic optic neuropathy (Naion) increased from nine to 23 per 100 000 among patients using Ozempic.\n\nThe study, published in the latest issue of the International Journal of Retina and Vitreous, states:\n\nIn the second study among 62 000 Danes and Norwegians, the incidence of Naion rose to 21 per 100 000.\n\nCross emphasises that the researchers do not suggest diabetic patients stop their treatment with Ozempic, but rather that the incidence of Naion should be monitored. Patients with untreated diabetes can also develop eye complications, but these are usually less severe than Naion.\n\nThis drug works by mimicking a natural hormone that signals the brain that the person is full. It also slows down the digestion process, according to a report from the University of California. The drug was developed for long-term use, with weight loss being one of the side effects experienced by diabetics on the medication.\n\nDr Marius Wasserfall, an internist  a doctor who specialises in internal organs and systems at Mediclinic, also warned last year that serious, although rare, side effects of Ozempic use could include inflammation of the pancreas and gallbladder problems.\n\nAccording to Wasserfall, people could also regain most of the weight they had lost when they stopped using the medication.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/20102043/ozempic.webp",
            "description": "<p>City Press Globally, people wanting to lose weight are turning to Ozempic, the so-called miracle drug prescribed for diabetes management and weight loss. However, two major studies conducted at the University of Southern Denmark have shown that Ozempic more than doubles the risk for patients of developing a rare, but serious, condition of the optic nerve that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/slimming-drug-ozempic-may-cost-you-your-eyesight/\">Slimming drug Ozempic may cost you your eyesight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Trump promises harsh immigration limits on eve of inauguration",
            "url": "https://www.newzimbabwe.com/trump-promises-harsh-immigration-limits-on-eve-of-inauguration/",
            "content": "Reuters\n\nDonald Trump told thousands of roaring supporters he would impose severe limits on immigration on his first day in office, vowing to swiftly fulfil the central promise of his presidential campaign at a rally on Sunday inside a packed Washington arena a day before he returns to power.\n\nBy the time the sun sets tomorrow, the invasion of our country will have come to a halt, he said to cheers at a Make America great again victory rally at the Capital One Arena.\n\nTrump repeated his campaign pledge to launch the largest deportation effort in US history which would remove millions of immigrants. An operation of that scale, however, would likely take years and be hugely costly.\n\nThe rally resembled the freewheeling campaign speeches that have been a Trump staple since his first serious White House run in 2016, with the former and future president delivering a mix of boasts, false claims and sweeping promises to the delight of the crowd.\n\nThis is the greatest political movement in American history, and 75 days ago we achieved the most epic political victory our country has ever seen, he said.\n\nStarting tomorrow, I will act with historic speed of strength and fix every single crisis facing our country.\n\nThe event marked his first major address in Washington since his speech on January 6 2021 that preceded the storming of the US Capitol by an angry mob of his supporters. Trump has said he will pardon many of the more than 1,500 people convicted or charged in connection with the attack.\n\nTrumps rally, along with his inaugural address on Monday, could preview the tone he plans to adopt during his second White House term. In recent weeks, Trump has bewildered foreign allies by talking about taking over Greenland and the Panama Canal and turning Canada into a US state.\n\nHe vowed to repeal every radical and foolish executive order of the [President Joe] Biden administration within hours of assuming the presidency..\n\nA source familiar with the planning said Trump will take more than 200 executive actions on Monday.\n\nBorder security will figure prominently in Trumps first executive orders, another source said, including classifying drug cartels as foreign terrorist organisations, declaring an emergency at the US-Mexico border and moving towards reinstatement of the remain in Mexico policy that forces non-Mexican asylum seekers to wait in Mexico for their US court dates.\n\nTrumps deportation plans have unsettled immigrants subject to removal, including some who immigrant advocates said are law-abiding, long-term residents with US-citizen spouses and children.\n\nTrump said he would get radical woke ideologies the hell out of our military and order the military to construct a missile defence shield over the US, though he has yet to offer details on how to carry it out.\n\nHe also pledged to release classified documents relating to the assassinations of president John F Kennedy in 1963 and his brother senator Robert Kennedy and civil rights leader Martin Luther King Jnr, both in 1968.\n\nThe indoor hockey and basketball venue will also host some of Mondays inauguration festivities after forecasts of bitter cold prompted officials to move the planned outdoor events inside.\n\nEarlier on Sunday Trump had breakfast with Republican senators at Blair House, the guest quarters across from the White House. John Cornyn, Susan Collins, Ted Cruz, Rick Scott and Tim Scott were among the attendees seen leaving the event.\n\nHe later placed a wreath at the Tomb of the Unknown Soldier at Arlington National Cemetery outside Washington. Trump saluted the tomb while a military bugler played Taps.\n\nAhead of the event, Trumps fans, many dressed in the campaigns trademark red jackets and Maga hats, waited in cold, driving rain along several downtown Washington blocks, some chanting USA, USA.\n\nVal Tordjman, 58, travelled across the country from Denver with tickets to watch the inauguration. When he heard the ceremony was being moved inside, notably cutting the size of the in-person audience, he said: I felt like crying.\n\nTordjman said he planned to spend the night on the street next to the arena, despite temperatures forecast to plunge to around -7 C. He said he had yet to see Trump in person.\n\nThis is a once in a lifetime opportunity, he said.\n\nLarge swathes of the streets around the US Capitol and White House have been blocked off by steel fences since last week, and police were visible throughout the city.\n\nTikTok CEO Shou Zi Chew planned to attend the rally, hours after the company announced it was restoring its service thanks to Trumps promise to delay a US ban that took effect on Sunday. Chew is also expected to join other tech executives at Trumps inauguration on Monday, including the worlds richest man, Elon Musk, a close Trump confidant who made a brief appearance on stage with Trump.\n\nTrump took credit for bringing TikTok back online and said the US would do a joint venture to save the app alongside bidders to buy the company.\n\nBiden, meanwhile, made his last official trip as president on Sunday to Charleston, South Carolina, to mark Martin Luther King Jnr Day, which is also on Monday. He attended services and spoke about Kings legacy at Royal Missionary Baptist Church, while urging despondent fellow Democrats not to give up hope.\n\nTrump will take the presidential oath of office inside the rotunda of the Capitol building after cold weather prompted organisers to move the ceremony indoors. About 25,000 law enforcement personnel will provide security.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/20071218/trump-donald.jpg",
            "description": "<p>Reuters Donald Trump told thousands of roaring supporters he would impose severe limits on immigration on his first day in office, vowing to swiftly fulfil the central promise of his presidential campaign at a rally on Sunday inside a packed Washington arena a day before he returns to power. “By the time the sun sets</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-promises-harsh-immigration-limits-on-eve-of-inauguration/\">Trump promises harsh immigration limits on eve of inauguration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "‘Migration to South Africa is nothing new,’ says Zimbabwean ambassador, causes stir online",
            "url": "https://www.newzimbabwe.com/migration-to-south-africa-is-nothing-new-says-zimbabwean-ambassador-causes-stir-online/",
            "content": "The South African\n\nZimbabwes Ambassador to South Africa,David Hamadziripi, has described the migration ofZimbabweans to South Africaas part of a broader, global phenomenon.\n\nHe emphasised that migration is neither new nor unique to Zimbabwe, citing examples of people leaving even the most developed nations in search of better opportunities elsewhere.\n\nSince the early 2000s, millions of Zimbabweans have left their homeland, driven primarily by an economic crisis under the ZANU PF-led government. South Africa has become the destination for many, with a large number living and working there, some without legal documentation.\n\nSpeaking on theSABC programmeFace The Nation, Hamadziripi explained that the movement of Zimbabweans to South Africa has historical roots.\n\nMigration from Zimbabwe to South Africa is not a recent phenomenon. It is historical, and we can go back many years to see this pattern. Zimbabwe is not the only country with nationals who come to South Africa. Migration is an individual decision, driven by various factors. Even in countries considered the best to live in, people migrate for better prospects,Hamadziripi said.\n\nWhen asked about theZimbabwean governmentsresponsibility in addressing the economic challenges that force citizens to leave, Hamadziripi noted: The government of Zimbabwe is taking all measures it can to improve the economic situation in Zimbabwe.\n\nThe influx of Zimbabweans into South Africa has sparked controversy over the years, with concerns about the strain on the countrys resources. In August 2022, Limpopos then-Health MEC, Phophi Ramathuba, made headlines for her remarks about Zimbabwean migrants overburdening the provincial healthcare system.\n\nRamathuba told a Zimbabwean patient at a Bela Bela hospital that South Africas healthcare system was not a charity. She added that foreign nationals were not accounted for in the provincial budget.\n\nHer comments drew widespread backlash, with the Zimbabwean embassy expressing dismay and urging diplomatic dialogue to resolve the issue.\n\nHamadziripis comments didnt sit well with many on social media, as they criticised the ambassadors statement.\n\nBaisi Mosoane-Pambo said: But please, not the whole country coming to South Africa, bathong.\n\nTebogo M Ngobeni stated: Passing the buck. That ambassador is passing off their responsibility as a government of Zimbabwe to South Africa. As if South Africa is a babysitter or rich aunty left to take care of Zimbabweans.\n\nKng Kong said: Theyve failed their people; now they want them to feel like they are protecting them here, but they cant improve their economy. He must take his people and go back home. Yaz Zimbabweans act like they are better than anyone. Ncuthu Mazangwa said: He should have just kept quiet because he has said absolutely nothing.\n\nNduza Mpho added: Migration is not a problem; you are our brothers. The problem is those who illegally cross the borders and commit crime knowing very well they wont be caught or sit in prison for long.\n\nElize Van Der Merwe stated: Just remember, charity begins at home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/08044233/Zimbabweans-queue-at-Beit-bridge-border-post-in-this-file-photo-For-holders-of-the-original-Zim-exemption-permits-the-deadline-has-been-extended-to-November-29-2024.webp",
            "description": "<p>The South African Zimbabwe’s Ambassador to South Africa, David Hamadziripi, has described the migration of Zimbabweans to South Africa as part of a broader, global phenomenon. He emphasised that migration is neither new nor unique to Zimbabwe, citing examples of people leaving even the most developed nations in search of better opportunities elsewhere. Influx Migration To South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/migration-to-south-africa-is-nothing-new-says-zimbabwean-ambassador-causes-stir-online/\">‘Migration to South Africa is nothing new,’ says Zimbabwean ambassador, causes stir online</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Viral video of Zimbabwean patient and SA nurses’ clash sparks outrage",
            "url": "https://www.newzimbabwe.com/viral-video-of-zimbabwean-patient-and-sa-nurses-clash-sparks-outrage/",
            "content": "By The South African\n\nA ZIMBABWE patients encounter with South African nurses has sparked widespread debate and outrage after a video went viral on social media.\n\nThe footage, allegedly recorded at a medical facility in Midrand, shows the patient demanding a transfer letter to another doctor after reportedly not receiving adequate assistance.\n\nHeated exchange over patients transfer letter\n\nIn the first part of the video, a nurse is seen speaking on the phone with a colleague, ostensibly to inquire about the transfer letter.\n\nThe colleague reportedly responds that she never saw the patient.\n\nWhen the nurse relays this message, the patient adamantly counters, Yes, she never saw me, she never attended me. I saw her, I saw her. She can just do it now, rather than sitting there, she can just do it now. Can you ask her to do it now?\n\nBlood pressure check dispute\n\nThe tension escalates as the patients camera pans to a second nurse, who is accused of neglecting to check the patients blood pressure.\n\nIn the exchange, the nurse claims, I dont check BP, prompting the patient to ask, What do you do?\n\nThe nurses reply, I sleep, move around, and eat a lot, draws a sharp rebuke from the patient, who comments on the nurses weight: That is why you are fat.\n\nPatients frustration and nurses defiance\n\nThe patient, growing frustrated, states, They said she must write me a transfer. She is not No, I came here what time? I cant wait anymore. Write me a transfer, let me go to the doctor.\n\nThe nurse, however, refuses, responding defiantly, I wont write you a transfer. Shout as much as you want, let everyone hear you. I wont write you. Take a pic, here, sue me, post me, I will sue the f*** out of you.\n\nPublic outcry and calls for accountability\n\nThe video has since ignited a firestorm of reactions online, with many expressing outrage at the nurses unprofessional behaviour.\n\nCritics have called for accountability and urged health authorities to investigate the incident thoroughly.\n\nMeanwhile, others argued that the patient was very rude.\n\nBroader implications for healthcare\n\nSouth Africas healthcare system has long faced scrutiny over allegations of poor treatment and strained resources, particularly for foreign nationals seeking medical care.\n\nIn 2022, the then Limpopo Health MEC Phophi Ramathuba stirred significant controversy when a video surfaced of her telling a woman that migrants from Zimbabwe placed a huge strain on the provincial healthcare system.\n\nThis latest incident has intensified debates about the quality of service and the treatment of non-citizens in the countrys healthcare facilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19200045/Screenshot_20250119-215559_1.jpg",
            "description": "<p>By The South African  A ZIMBABWE patient’s encounter with South African nurses has sparked widespread debate and outrage after a video went viral on social media. The footage, allegedly recorded at a medical facility in Midrand, shows the patient demanding a transfer letter to another doctor after reportedly not receiving adequate assistance. Heated exchange over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/viral-video-of-zimbabwean-patient-and-sa-nurses-clash-sparks-outrage/\">Viral video of Zimbabwean patient and SA nurses’ clash sparks outrage </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zimbabwe’s ruling party to push for third term for President Mnangagwa",
            "url": "https://www.newzimbabwe.com/zimbabwes-ruling-party-to-push-for-third-term-for-president-mnangagwa/",
            "content": "By VOA\n\nHARARE, ZIMBABWE  Zimbabwes ruling party says it will initiate steps to amend the constitution so President Emmerson Mnangagwa can run for a third term in the 2028 elections. The opposition is strongly opposed to amending the 2013 constitution, which limited presidents to two five-year terms.\n\nIn an interview with VOA, Ziyambi Ziyambi, Zimbabwes minister of justice, legal and parliamentary affairs, said the government is ready to move forward once lawmakers introduce the bill to amend the constitution.\n\nIs there a prohibition in amending anything in the constitution? Ziyambi said. The only prohibition, the only clause that I know in the constitution, it says any electoral amendments have to be done six months before an election for that amendment to be used in the coming election. Anything else Im not aware.\n\nLovemore Madhuku, a law professor at the University of Zimbabwe and an opposition leader, said it will be difficult though not impossible for the ruling Zanu-PF party to change the constitution in time for its leader to run in the 2028 election.\n\nLegally, yes you can go through the steps, Madhuku said. The steps will require a publication of the first bill, give Zimbabweans a 90-day period to debate it. Thereafter, take it to parliament. It must get a two-thirds majority, and thereafter there must be a referendum. That alone tells you that it is very difficult. It cannot be assumed that since Zanu-PF has a two-thirds majority [in parliament], they will obtain the two-thirds majority.\n\nDouglas Mwonzora, leader of the Movement for Democratic Change party, said the MDC will campaign vehemently against the bid to have Mnangagwa stand for a third term.\n\nMwonzora, who is a lawyer, said one referendum will not suffice for Mnangagwa to stand in 2028.\n\nThey will need another referendum, Mwonzora said. This time specifically, stating whether or not President Mnangagwa must stand again and these two referendums must not be within six months of one another.\n\nWe will campaign for a no vote again not because we have anything personal against President Mnangagwa, we think that President Mnangagwa after his term should go and rest, we think its time for other leaders, so we will campaign no in that regard.\n\nBut Ziyambi said Zanu-PF will overcome all obstacles in the way of Mnangagwas third term.\n\nZanu-PF is a mass party. Our structures are to the grassroot from village level, so when we are doing resolutions, thats where they start, Ziyambi said. Its not the top leadership that say that they want anything.\n\nZiyambi said Mnangagwa said he has been clear that he wants to abide by the constitution, but the push for the resolution to allow him to run for a third term is coming from the grassroots level.\n\nPresident Robert Mugabe ruled Zimbabwe for 37 years before Mnangagwa, a former army general and Mugabes vice president took power in a 2017 coup.\n\nMnangagwa is 82 years old and is currently the fifth oldest head of state in Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By VOA HARARE, ZIMBABWE — Zimbabwe’s ruling party says it will initiate steps to amend the constitution so President Emmerson Mnangagwa can run for a third term in the 2028 elections. The opposition is strongly opposed to amending the 2013 constitution, which limited presidents to two five-year terms. In an interview with VOA, Ziyambi Ziyambi,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-ruling-party-to-push-for-third-term-for-president-mnangagwa/\">Zimbabwe’s ruling party to push for third term for President Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Late ex-VP Mphoko’s son files $500,000 lawsuit against accuser for malicious prosecution",
            "url": "https://www.newzimbabwe.com/late-ex-vp-mphokos-son-files-500000-lawsuit-against-accuser-for-malicious-prosecution/",
            "content": "By Staff Reporter\n\nSON of the late former Vice President Phelekezela Mphoko has filed a lawsuit demanding US$500,000 in damages for malicious prosecution.\n\nThe lawsuit stems from a series of allegations that Siqokoqela Mphoko had an unlawful carnal knowledge with the accusers daughter and saw Mphoko being arrested and sentenced to 20 years.\n\nIn a letter, Mphokos conviction was overturned on appeal, where the court found that the charges were baseless and motivated by malice.\n\nYou made a report to the police that our client had had unlawful carnal knowledge with your daughter, a minor. As a result of your complaint our client was arrested by the police, detained and arraigned for trial.\n\nYou gave evidence at the trial implicating our client and persisted with your allegations. Our client was, in part because of your evidence, convicted and sentenced to 20 years imprisonment.\n\nOn appeal our client was acquitted on the basis that the charges against him were fabricated and actuated by malice, reads the letter of demand.\n\nMphokos attorney claims the allegations against him went viral, causing damage to his life and the victim being a close relative to him.\n\nAs a result of the report you made and the charges which followed the matter was widely publicised in the national press and on social media platforms. Our client is a businessman of repute and a public figure.\n\nHis reputation and standing in society has been diminished in the eyes of right- thinking members of the society.\n\nThe damage are aggravated by the fact that the alleged victim is a very close relative. Our client was cast in the image of sexual predator.\n\nThe accuser will be summoned if payment arrangements are not made.\n\nIt is for the above reasons that our client makes the demand he does. Unless payment or other satisfactory arrangements are made our instructions are to issue summons against you without further notice to you, the lawyer further said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/31182752/siqokoqela-mphoko-3.jpg",
            "description": "<p>By Staff Reporter  SON of the late former Vice President Phelekezela Mphoko has filed a lawsuit demanding US$500,000 in damages for malicious prosecution. The lawsuit stems from a series of allegations that Siqokoqela Mphoko had an “unlawful carnal knowledge” with the accuser’s daughter and saw Mphoko being arrested and sentenced to 20 years. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/late-ex-vp-mphokos-son-files-500000-lawsuit-against-accuser-for-malicious-prosecution/\">Late ex-VP Mphoko’s son files $500,000 lawsuit against accuser for malicious prosecution</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "With cocktails and Snoop Dogg, crypto industry celebrates Trump inauguration",
            "url": "https://www.newzimbabwe.com/with-cocktails-and-snoop-dogg-crypto-industry-celebrates-trump-inauguration/",
            "content": "By Reuters\n\nWASHINGTON  Cryptocurrency executives swilled cocktails and danced to rap superstar Snoop Dogg on Friday night as they celebrated the approaching inauguration of President-elect Donald Trump, whose administration has promised major changes in crypto policy.\n\nAfter years of butting heads with Washington policymakers, executives from crypto companies including Crypto.com, Kraken, and Exodus partied at the first-ever crypto inauguration ball held at the 90-year-old Andrew W. Mellon Auditorium beneath towering 62-foot columns.\n\nClad in black tie and ball gowns, guests noshed on miniature lobster rolls and Trumps favored McDonalds burgers and fries, according to social media posts and two attendees who spoke to Reuters.\n\nIn addition to Snoop Dogg, the entertainment lineup featured rappers Rick Ross and Soulja Boy, the attendees said. One of many Washington celebrations ahead of Trumps Monday swearing-in, the crypto gala marks a stunning turnaround for an industry that has been in the Biden administrations crosshairs.\n\nTwo years ago, it looked to be on the brink of extinction amid the collapse of FTX. Trump, who did not attend the gala, courted crypto campaign cash with promises to be a crypto president, and is expected next week to issue executive orders aimed at reducing crypto regulatory roadblocks and promoting widespread adoption of digital assets.\n\nThere were a lot of dark years, said Les Borsai, co-founder of the crypto investment adviser Wave Digital Assets, who flew in from Los Angeles.\n\nIf this signifies what the future looks like  I think thats the optimism weve been waiting for.\n\nSwag included Make Bitcoin Great Again red baseball caps, and American flag pins with the symbol for Gemini, an event sponsor and crypto exchange founded by Cameron and Tyler Winklevoss, who backed Trumps campaign.\n\nSOLD OUT\n\nTickets sold out at $2,500 each for general admission, the balls website said, but for a cool $100,000, VIP packages provided face time with tech entrepreneur David Sacks, Trumps incoming crypto czar and the galas emcee, according to attendees and crypto media outlets.\n\nAbout 1,500 people attended. Several other officials from Trumps incoming administration were also present, the attendees said.\n\nOther sponsors included the digital asset division of Robinhood, MicroStrategy and Crypto.com, according to the event website.\n\nSponsors had cocktails named in their honor.\n\nLast night was truly a testament to how mainstream crypto has become, said JP Richardson, CEO of Exodus, which co-hosted the ball.\n\nWhile the industry was reveling, Trump on Friday night expanded his cryptocurrency interests, which already include World Liberty Financial, by launching a digital token branded with an image from his attempted assassination in July.\n\nThe price of that meme coin was around $27 by Saturday afternoon, giving it a market capitalization of about $5.5 billion, according to CoinMarketCap.\n\nWorried about fraud and money laundering, President Joe Bidens regulators cracked down on crypto companies, suing exchanges Coinbase, Binance, Kraken and dozens more in federal court.\n\nTrumps crypto policy team is taking shape, with his crypto-friendly Securities and Exchange Commission chair pick Paul Atkins expected to forge major crypto policy changes.\n\nThe crypto voter showed up in the election and this event signifies a turning point for crypto policy in the United States, Jonathan Jachym, global head of policy at Kraken, said in a statement.\n\nBitcoin, the worlds largest cryptocurrency, hit new records above $107,000 in December on excitement over Trumps policy changes.\n\nWe are proud to support the Crypto Ball  and look forward to supporting the new administration to advance innovation in digital assets, said a spokesperson for Crypto.com, adding the companys president of North America, Matt David, attended.\n\nRepresentatives for the Trump administration, Robinhood, MicroStrategy, Gemini and the events other two hosts, BTC Inc. and Stand With Crypto, did not immediately comment.\n\nSacks did not immediately return an emailed request for comment. Representatives for Snoop Dogg, Rick Ross and Soulja Boy could not immediately be reached on Saturday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/11042040/Snoop-Dogg.jpeg",
            "description": "<p>By Reuters  WASHINGTON – Cryptocurrency executives swilled cocktails and danced to rap superstar Snoop Dogg on Friday night as they celebrated the approaching inauguration of President-elect Donald Trump, whose administration has promised major changes in crypto policy. After years of butting heads with Washington policymakers, executives from crypto companies including Crypto.com, Kraken, and Exodus partied</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/with-cocktails-and-snoop-dogg-crypto-industry-celebrates-trump-inauguration/\">With cocktails and Snoop Dogg, crypto industry celebrates Trump inauguration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Zimbabwe lifts ban on cloven-hoofed animal imports from South Africa",
            "url": "https://www.newzimbabwe.com/zimbabwe-lifts-ban-on-cloven-hoofed-animal-imports-from-south-africa/",
            "content": "IOL\n\nRed Meat Producers Organisation (RPO) and Agricultural Business Chamber of South Africa (Agbiz) welcomed Zimbabwe last week lifting the ban on the importation of cloven-hoofed animals and their products from some provinces in South Africa. This follows a notice issued by the Veterinary Services Directorate of Zimbabwe.\n\nThe notice said on January 7, 2025, the Veterinary Services Directorate of Zimbabwe lifted the ban on the importation of cloven-hoofed animals and their products from South Africa, but with a significant caveat. This lifting applies exclusively to animals originating from the provinces of Gauteng, North West, Northern Cape, and Western Cape. Exports from other South African provinces remain prohibited until further assessments are conducted.\n\nThe notice added that these precautionary biosecurity measures are a crucial component of Zimbabwes strategy to monitor and manage the ongoing foot-and-mouth disease outbreak affecting parts of South Africa.\n\nWandile Sihlobo, the chief economist at Agbiz, said the government and industrys efforts to control animal disease spread must be lauded.\n\nThe past three years have been challenging for South Africas livestock and poultry industry because of the spread of animal diseases. Throughout this period, we have had various cases of foot-and-mouth disease (FMD) in cattle, African swine fever in pigs, and avian influenza in poultry. While animal disease outbreaks are not unique to South Africa and indeed common across the world, South Africas challenges have intensified in the recent past, he said.\n\nIn 2022, six of South Africas nine provinces reported foot-and-mouth disease outbreaks.\n\nThis was the first time in the countrys history that the disease had spread this wide. The challenging place the country found itself in prompted the government and industry stakeholders to increase their focus on strengthening farm biosecurity controls and surveillance, he explained.\n\nHowever, Sihlobo said on October 25, 2024, the Department of Agriculture released positive news that the FMD outbreak, occurring during 2021-2022, had been successfully resolved in the North West, Free State, Gauteng, and Mpumalanga Provinces. These provinces, initially impacted by the outbreak, had completed testing of animals on quarantined farms indicating it was no longer present. This was confirmed by the World Organisation for Animal Health.\n\nHowever, KwaZulu-Natal and Eastern Cape remain affected by FMD outbreaks.\n\nDr Frikkie Mar, the CEO of RPO, said since the outbreak of FMD in South Africa in 2018/19, South Africas borders have been closed for the export of animals, genetic material (semen/embryos), and meat to various countries.\n\nAlthough we managed to keep certain borders open for meat exports, and managed to open a number of additional borders in the meantime, it was basically impossible to export any live animal or genetic material to our neighbouring countries. The fact of the matter is that countries like Namibia, Botswana, and Zimbabwe, amongst others, had always relied heavily on South African genetics to improve their herds, he said.\n\nThe closure of the borders created two significant problems, he added.\n\nFirstly, the producers in some countries were no longer able to source any genetic material from South Africa, which caused the quality of their breeding programmes to decline.\n\nSecondly, South African stud breeders could not sell bulls, rams, semen, or embryos to breeders in other countries, which basically means that they lost a share of their market. The opening of the market thus benefits both Zimbabwean farmers, as they can obtain genetic material, as well as South African farmers who can now again sell genetic material to Zimbabwean farmers, Mar said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/20063404/Screenshot-2025-01-20-at-08.33.50.png",
            "description": "<p>IOL Red Meat Producers’ Organisation (RPO) and Agricultural Business Chamber of South Africa (Agbiz) welcomed Zimbabwe last week lifting the ban on the importation of cloven-hoofed animals and their products from some provinces in South Africa. This follows a notice issued by the Veterinary Services Directorate of Zimbabwe. The notice said on January 7, 2025,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-lifts-ban-on-cloven-hoofed-animal-imports-from-south-africa/\">Zimbabwe lifts ban on cloven-hoofed animal imports from South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        },
        {
            "title": "Stilfontein Crisis Committee considers murder charges against government over miners’ deaths",
            "url": "https://www.newzimbabwe.com/stilfontein-crisis-committee-considers-murder-charges-against-government-over-miners-deaths/",
            "content": "By lOL\n\nTHE Stilfontein Crisis Committee is mulling over charging government with murder after the bodies of more than 70 miners were brought to the surface this week.\n\nThese miners were part of a larger group that languished underground for more than two months after a stand-off with policing and mining authorities over illegal mining activities at disused mine shafts.\n\nSpeaking to Newzroom Afrika, the committees chairperson, Christopher Rutledge, accused government of making comments while the miners were underground, indicating its intention of killing them.\n\nWe are going to consider a number of routes, including charging individuals and the state with murder, he said.\n\nHe said the committee will also ask for an inquiry similar to the Life Esidimeni inquiry following the deaths of 141 mentally-challenged patients.\n\nRutledge said government had been provided with information about the miners and the conditions they were in, while underground.\n\nGovernment was provided with information that the miners in shaft 11 had no access to exit the mine.\n\nSpeaking to Newzroom Afrika, he said the only other exit was through shaft 10, and this where bodies of dead miners lay.\n\nRutledge explained that the exit through shaft 10 was dangerous as the structure itself was compromised.\n\nIt has rusty, rickety iron poles that people have to climb and if you lose your footing while climbing up almost two kilometres, you will fall down, and it is very unlikely that you will survive and be recovered. That was the one opportunity in our view that was unreasonable to expect people to exit the mine, he said.\n\nAccording to Rutledge, government was provided with clear information on the underground conditions and those trapped in shaft 11 were unable to exit without assistance.\n\nMoving forward, he said the commission will also look at seeking constitutional damages as this action was a violation of rights.\n\nAccording to police, 246 illegal miners have been rescued from the North West mine.\n\nThe operation was undertaken by different specialists health-care professionals led by acting Deputy Director General for Hospitals and Clinical Support, Agisanang Portia Tlou, Chief Director for Hospitals and Clinical Support Services Zenzo Ndabula, and Chief Director for Dr. Kenneth Kaunda district, Phil Maboe.\n\nNational police spokesperson, Colonel Athlenda Mathe, said nine illegal miners had been taken for medical check-ups while the rest were taken in police custody.\n\nThe illegal miners are from; Mozambique, Lesotho, Zimbabwe with at least five being South African.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>By lOL THE Stilfontein Crisis Committee is mulling over charging government with murder after the bodies of more than 70 miners were brought to the surface this week. These miners were part of a larger group that languished underground for more than two months after a stand-off with policing and mining authorities over illegal mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stilfontein-crisis-committee-considers-murder-charges-against-government-over-miners-deaths/\">Stilfontein Crisis Committee considers murder charges against government over miners’ deaths</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Jan 2025"
        }
    ]
}