{
    "news": [
        {
            "title": "Stilfontein Crisis Committee considers murder charges against government over miners’ deaths",
            "url": "https://www.newzimbabwe.com/stilfontein-crisis-committee-considers-murder-charges-against-government-over-miners-deaths/",
            "content": "By lOL\n\nTHE Stilfontein Crisis Committee is mulling over charging government with murder after the bodies of more than 70 miners were brought to the surface this week.\n\nThese miners were part of a larger group that languished underground for more than two months after a stand-off with policing and mining authorities over illegal mining activities at disused mine shafts.\n\nSpeaking to Newzroom Afrika, the committees chairperson, Christopher Rutledge, accused government of making comments while the miners were underground, indicating its intention of killing them.\n\nWe are going to consider a number of routes, including charging individuals and the state with murder, he said.\n\nHe said the committee will also ask for an inquiry similar to the Life Esidimeni inquiry following the deaths of 141 mentally-challenged patients.\n\nRutledge said government had been provided with information about the miners and the conditions they were in, while underground.\n\nGovernment was provided with information that the miners in shaft 11 had no access to exit the mine.\n\nSpeaking to Newzroom Afrika, he said the only other exit was through shaft 10, and this where bodies of dead miners lay.\n\nRutledge explained that the exit through shaft 10 was dangerous as the structure itself was compromised.\n\nIt has rusty, rickety iron poles that people have to climb and if you lose your footing while climbing up almost two kilometres, you will fall down, and it is very unlikely that you will survive and be recovered. That was the one opportunity in our view that was unreasonable to expect people to exit the mine, he said.\n\nAccording to Rutledge, government was provided with clear information on the underground conditions and those trapped in shaft 11 were unable to exit without assistance.\n\nMoving forward, he said the commission will also look at seeking constitutional damages as this action was a violation of rights.\n\nAccording to police, 246 illegal miners have been rescued from the North West mine.\n\nThe operation was undertaken by different specialists health-care professionals led by acting Deputy Director General for Hospitals and Clinical Support, Agisanang Portia Tlou, Chief Director for Hospitals and Clinical Support Services Zenzo Ndabula, and Chief Director for Dr. Kenneth Kaunda district, Phil Maboe.\n\nNational police spokesperson, Colonel Athlenda Mathe, said nine illegal miners had been taken for medical check-ups while the rest were taken in police custody.\n\nThe illegal miners are from; Mozambique, Lesotho, Zimbabwe with at least five being South African.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>By lOL THE Stilfontein Crisis Committee is mulling over charging government with murder after the bodies of more than 70 miners were brought to the surface this week. These miners were part of a larger group that languished underground for more than two months after a stand-off with policing and mining authorities over illegal mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stilfontein-crisis-committee-considers-murder-charges-against-government-over-miners-deaths/\">Stilfontein Crisis Committee considers murder charges against government over miners’ deaths</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "Midfield maestro Kundai Benyu makes surprise move to CAPS United",
            "url": "https://www.newzimbabwe.com/midfield-maestro-kundai-benyu-makes-surprise-move-to-caps-united/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens soccer team, Warriors midfielder, Kundai Benyu has made a surprising move to join Castle Lager Premier Soccer League (PSL) giants CAPS United.\n\nBenyu arrived in the country from the United Kingdom (UK) Saturday afternoon and was welcomed by CAPS United team being led by head coach Lloyd Chitembwe, accompanied by club legend Alois Bunjira.\n\nThe 27-year-old midfielder is seeking revival in his football career after spending the whole of last year unattached to a club in the UK, where he was plying his trade.\n\nThe UK-born midfielder signed a two-year contract, which will see him playing for the Green Machine until December 2026.\n\nMakepekepe becomes the first local topflight league side that Benyu will feature for.\n\nThe Warriors midfielder started his professional football career in the UK at Ipswich in England before moving to several clubs including Scottish giants Celtic.\n\nCAPS United is quietly going about its business during the ongoing transfer window, with the Harare-based side having also signed Ghananian goalkeeper Stephen Osai Kwaku, who comes in as a replacement to Tonderai Mateyaunga, who is now with Simba Bhora.\n\nOther than losing Mateyaunga, Makepekepe have also lost energetic defender Godknows Murwira and midfielder Kingsley Mureremba to league newcomers Scottland FC.\n\nThe team will also be without veteran players Bruce Kangwa, Ralph Kawondera and Lot Chiwunga for the 2025 league season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19045224/IMG-20250118-WA0122.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s soccer team, Warriors midfielder, Kundai Benyu has made a surprising move to join Castle Lager Premier Soccer League (PSL) giants CAPS United. Benyu arrived in the country from the United Kingdom (UK) Saturday afternoon and was welcomed by CAPS United team being led by head coach Lloyd Chitembwe, accompanied</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/midfield-maestro-kundai-benyu-makes-surprise-move-to-caps-united/\">Midfield maestro Kundai Benyu makes surprise move to CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "JSC enlists 15 new magistrates to oil justice delivery system",
            "url": "https://www.newzimbabwe.com/jsc-enlists-15-new-magistrates-to-oil-justice-delivery-system/",
            "content": "By Staff Reporter\n\nTHE Judicial Service Commission (JSC) has sworn in 15 magistrates at the Harare Magistrates Court in a bid to ease the workload on the current staff complement.\n\nThe move, chief magistrate Vongai Guwuriro said, is part of efforts to enhance the countrys justice delivery system.\n\nThe chief magistrate said that the JSC prides in having increased the number of magistrates and opened new court stations to enhance access to justice.\n\nOf the 15 new magistrates, 12 are women while three are men.\n\nThe newly inducted judicial officers include, Moreblessing Mahaso, Nyasha Mangezi, Nyengeterai Bushu, Rufaro Musiiwa, Samantha Ruponga, Samukelisiwe Mpande, Tariro Hove and Tendai Nyagura.\n\nOthers are, Bentone Matope, Blessing Makaripe, Blessing Shumba, Daphne Maruta, Gillian Padzakashamba, Lawrence Mubvumbi and Marvellous Joma.\n\nThe newly induced magistrates pose for a photo\n\nThe recruitment of additional magistrates is expected to improve access to justice, reduce case backlogs, and enhance the overall efficiency of the countrys judiciary system.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter  THE Judicial Service Commission (JSC) has sworn in 15 magistrates at the Harare Magistrates Court in a bid to ease the workload on the current staff complement. The move, chief magistrate Vongai Guwuriro said, is part of efforts to enhance the country’s justice delivery system. The chief magistrate said that the JSC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jsc-enlists-15-new-magistrates-to-oil-justice-delivery-system/\">JSC enlists 15 new magistrates to oil justice delivery system </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "FAITH: The language of God’s operation",
            "url": "https://www.newzimbabwe.com/faith-the-language-of-gods-operation/",
            "content": "SUNDAY MORNING TABLET\n\nGood morning, dear Christian friends!\n\nToday, lets dive into the transformative power of Gods word. In Luke 5:1-11, we see Jesus instructing Peter, a seasoned fisherman, to cast his nets into the deep waters during the day.\n\nDespite the seeming foolishness of this action, Peter obeyed, acknowledging Jesus authority. It was common knowledge that fishing couldnt be done in the afternoon because fish would see the nets and wouldnt enter. This act of faith led to a miraculous catch.\n\nThe power of Gods word lies in its ability to transcend human understanding. Its not about conventional or scientific logic or reason; its about trusting in the One who speaks.\n\nAs Romans 1:17 says, The just shall live by faith. Faith is the language of Gods operation, and its the only way to please Him (Hebrews 11:6).\n\nJesus emphasizes the importance of faith in Mark 11:22-24. He tells His disciples to have faith in God and assures them that whatever they ask for in prayer, believing theyll receive it, will be theirs. This is not just a suggestion; its a command. Jesus wants us to trust Him completely, without questioning His ways.\n\nBut how do we develop this kind of faith? The answer lies in Gods word. As Psalm 119:160 says, The entirety of Your word is truth.\n\nWe must immerse ourselves in Scripture, allowing its truth to transform our minds and hearts. We must learn to trust Gods word, even when it seems foolish or contradictory to our scientific knowledge or circumstances.\n\nSo, lets approach Gods word with faith, not questioning its logic or reasonableness. Lets talk to Him through His word and prayer, trusting that He will guide us and bless us. Lets cast our nets deeper into the waters of Gods blessings, trusting in His word and His faithfulness.\n\nAs we close, remember that faith is not a feeling; its a choice. Choose to trust Gods word today, and watch Him work miracles in your life.\n\nPRAYER:\n\nDear Heavenly Father, we thank You for the power of Your word. Help us to trust in You, even when Your ways seem foolish to us. Give us the faith to take You at Your word, and may we experience the miraculous blessings that come from obeying Your instructions.\n\nMay Your word be our guide, our comfort, and our strength. In Jesus name, we pray.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/07060039/IMG-20240616-WA0009-1.jpg",
            "description": "<p>SUNDAY MORNING TABLET Good morning, dear Christian friends! Today, let’s dive into the transformative power of God’s word. In Luke 5:1-11, we see Jesus instructing Peter, a seasoned fisherman, to cast his nets into the deep waters during the day. Despite the seeming foolishness of this action, Peter obeyed, acknowledging Jesus’ authority. It was common</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/faith-the-language-of-gods-operation/\">FAITH: The language of God’s operation </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "NAMA opens voting platform for People’s Choice award",
            "url": "https://www.newzimbabwe.com/nama-opens-voting-platform-for-peoples-choice-award/",
            "content": "By Staff Reporter\n\nTHE National Arts Merit Awards (NAMA) has announced the opening of various platforms through which members of the public and journalists can vote for the Peoples Choice Award winner.\n\nIn a statement Friday, NAMA director Tinashe Kitchen said the public, journalists and other stakeholders can utilise the voting mediums to elect the most deserving practitioners pursuing diverse arts genres.\n\nThis press release serves to notify members of the press, general public, and relevant stakeholders that the 23rd Edition of the National Arts Merit Awards has officially opened its call for nominations for the NAMA Peoples Choice Award, said Kitchen.\n\nThe Peoples Choice Award is one of NAMAs most special awards as it is the only one where the people of Zimbabwe get to choose who they believe is most deserving of the accolade.\n\nZimbabwean artists from all genres (song, dance, theatre, literature, spoken word, comedy, visual arts, television, and radio) can be nominated for the Peoples Choice Award.\n\nNominations will close February 5, 2025, after which the top five nominees will be announced.\n\nTo vote, members of the public are encouraged to log on to NAMA social media platforms and thegatewaystream.comwebsite.\n\nLast years winner of the coveted award was inimitable Zimdancehall musician Wallace Chirimuko, popularly known as Winky D.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/20004947/Winky-D1.jpg",
            "description": "<p>By Staff Reporter  THE National Arts Merit Awards (NAMA) has announced the opening of various platforms through which members of the public and journalists can vote for the People’s Choice Award winner. In a statement Friday, NAMA director Tinashe Kitchen said the public, journalists and other stakeholders can utilise the voting mediums to elect the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nama-opens-voting-platform-for-peoples-choice-award/\">NAMA opens voting platform for People’s Choice award </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "After slow growth in 2024, World Bank projects 6.2% recovery for Zimbabwe economy in 2025",
            "url": "https://www.newzimbabwe.com/after-slow-growth-in-2024-world-bank-projects-6-2-recovery-for-zimbabwe-economy-in-2025/",
            "content": "By newZWire\n\nZIMBABWE could register 6.2% economic growth in 2025, after the country saw only sluggish growth of 2% last year, the World Bank says in a new report.\n\nIn June, the World Bank had forecast growth of 3.3% for 2024 and 3.6% in 2025. Its latest estimates, in the newly released annual Global Economic Prospects report, are within range of governments own estimate of 2% in 2024 and forecast of 6% in 2025.\n\nZimbabwe had banked on better rainfall to lift agriculture by 12.5% in 2025, helping the economy recover from last years drought, the worst in over 40 years.\n\nBut late rains mean agricultures anticipated recovery may be slower than expected.\n\nFinance Minister Mthuli Ncube says he will wait to the end of the farming season to see whether Zimbabwe needs to revise its 2025 growth outlook.\n\nWe will be able to assess, four months from now, as to what the output looks like and then say whether we maintain the 6% or not, Ncube says.\n\nAccording to the World Bank, growth in Sub-Saharan Africa (SSA) is projected to 4.2% in 2025-26, driven by better commodity prices.\n\nBut the bank warns that commodity exporters, like Zimbabwe, may suffer from slow growth in China, a major importer of their goods.\n\nGrowth in China could weaken more than expected, with adverse effects on the demand for minerals and metals. Lower prices for these commodities, which are the main exports of several SSA countriesmany of them low-income countrieswould hit these countries especially hard, the World Bank says.\n\nFurthermore, slower growth in China could reduce Chinese investment in SSA.\n\nSouth Africa, the regions biggest economy, grew by 0.8% last year, according to World Banks estimates. It will grow by 1.8% this year.\n\nZambia grew by 1.2% last year and will grow 6.2% in 2025 while Tanzania expanded 5.4% last year and 2025 projected growth is 5.8%.\n\nMozambique will maintain 2024 growth of 4% through this year. Botswanas 2024 growth is estimated at 1%, with a strong recovery of 5.3% expected this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19043356/Tnash-Creative-Studios-0540-696x464-1.jpg",
            "description": "<p>By newZWire  ZIMBABWE could register 6.2% economic growth in 2025, after the country saw only sluggish growth of 2% last year, the World Bank says in a new report. In June, the World Bank had forecast growth of 3.3% for 2024 and 3.6% in 2025. Its latest estimates, in the newly released annual Global Economic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-slow-growth-in-2024-world-bank-projects-6-2-recovery-for-zimbabwe-economy-in-2025/\">After slow growth in 2024, World Bank projects 6.2% recovery for Zimbabwe economy in 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "Zimbabwe Embassy in South Africa begins verification of Stilfontein mine disaster victims",
            "url": "https://www.newzimbabwe.com/zimbabwe-embassy-in-south-africa-begins-verification-of-mine-disaster-victims/",
            "content": "By Staff Reporter\n\nTHE Zimbabwean Embassy in South Africa has reportedly dispatched a team of forensic experts and other professionals to collaborate with the host government to verify the nationality of victims of the Stilfontein mine disaster.\n\nThis follows the death of 87 artisanal miners at Buffelsfontein Mine in Stilfontein, North West Province, while some others were rescued alive.\n\nThe identities of the deceased are yet to be confirmed but there is a strong belief some could be Zimbabwean nationals after some survivors turned out to be Zimbabaweans.\n\nZimbabwes Ambassador to South Africa, David Hamadziripi, told State media that a contingent of verifiers has already started work.\n\nThe Embassy wishes to inform members of the public that it is working closely with the South African government to identify and verify the nationalities of the alleged Zimbabwe nationals retrieved from the Buffelsfontein Mine in Stilfontein, North West Province under the on-going rescue operations, said the Ambassador in a statement.\n\nFurther to screening the 465 alleged undocumented Zimbabwe nationals currently in South African Police Service (SAPS) custody, the Embassy is seeking to establish whether there are any Zimbabwe nationals among 87 deceased individuals retrieved at the shaft, whose identities and nationalities are yet to be established.\n\nThe embassy seeks to identify the deceased individuals through Deoxyribonucleic Acid (DNA) testing of relatives.\n\nHamadziripi called on Zimbabweans who have reason to believe that their relatives might be part of the rescued group of individuals in Stilfontein to urgently contact the Consulate in Johannesburg.\n\nThe Government of Zimbabwe is working on arrangements on how to assist with the repatriation of remains positively identified as Zimbabwe nationals, Hamadziripi was quoted saying.\n\nThe countrys consul-general in Johannesburg, Eria Phiri, said so far, 10 Zimbabweans who were rescued had appeared in court and were fined R15 000 (or six months in jail) wholly suspended sentence for illegal mining.\n\nThe group has since been deported to Zimbabwe.\n\nHe revealed that those rescued will undergo interviews to find out if there are any other Zimbabweans among those who may have died in the mineshaft.\n\nThe illegal miners were recently trapped underground and most of them chose to stay underground fearing arrest when they came out of the mineshaft.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/18092516/unnamed-5.jpg",
            "description": "<p>By Staff Reporter  THE Zimbabwean Embassy in South Africa has reportedly dispatched a team of forensic experts and other professionals to collaborate with the host government to verify the nationality of victims of the Stilfontein mine disaster. This follows the death of 87 artisanal miners at Buffelsfontein Mine in Stilfontein, North West Province, while some</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-embassy-in-south-africa-begins-verification-of-mine-disaster-victims/\">Zimbabwe Embassy in South Africa begins verification of Stilfontein mine disaster victims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "Chimombe, Mpofu in another bid for freedom, ruling set for January 23 in US$9 million streetlights tender fraud",
            "url": "https://www.newzimbabwe.com/chimombe-mpofu-in-another-bid-for-freedom-ruling-set-for-january-23-in-us7-million-streetlights-tender-fraud/",
            "content": "By Staff Reporter\n\nHIGH Court judge, Justice Benjamin Chikowero is on January 23 expected to hand down his ruling in a matter business partners, Moses Mpofu and Mike Chimombe, are seeking bail in a case they are accused of defrauding City of Harare (CoH) of US$9 million in a streetlights tender deal.\n\nThe judge heard the appeal Friday at which Whisper Mabhaudhi representing the State submitted that there were no changed circumstances warranting the release of the two now.\n\nMpofu and Chimombe also had their other appeal in a separate charge involving a US$7 million fraud linked to a botched presidential goat scheme turned down on Thursday. Justice Pisirayi Kwenda ruled that the pair was facing a serious offence, which can result in their imprisonment for 20 years if convicted.\n\nOn Friday, Mpofus lawyer Advocate Tapson Dzvetero submitted that the two deserved bail considering that their co-accuseds from the local authority were granted bail.\n\nChimombe and Mpofu argued that this development constituted changed circumstances, considering the courts revised perspective on their prior bail request.\n\nAshiel Mugiya representing Chimombe concurred.\n\nMabhaudhi argued this had no relevance to the bail circumstances for the accused.\n\nThe granting of bail to city council officials has no bearing on the bail of these accused persons, Mabhaudhi said.\n\nAccording to the State, in January, the CoH initiated a project to rehabilitate streetlights in preparation for the SADC summit hosted by Zimbabwe in August.\n\nThe council invited bids, receiving submissions from 11 companies, including Juluka Endo Joint Venture (Pvt) Ltd, co-owned by Moses Mpofu.\n\nThe tender invitation specified that all bidders must provide stamped audited financial statements from the last two years.\n\nAdditionally, proof of payment for special procurement oversight committee and administration fees were required.\n\nOn April 19, an evaluation committee awarded contracts to four companies across eight lots for the street light rehabilitation project.\n\nMpofus company did not meet the requirements as its audited statements lacked an audit opinion, a crucial criterion for eligibility.\n\nNonetheless, the council invited Mpofus company to submit a new bid, which it did, presenting a document that allegedly contained false information. Mpofu is accused of misrepresenting his companys compliance with the regulatory requirements.\n\nMpofu allegedly submitted a bid security obtained on March 26 that had previously been used for an unsuccessful tender.\n\nHe is also accused of submitting audit documents purportedly prepared by three consultancy firms, which the Zimbabwe Anti-Corruption Commission (ZACC) found to be unregistered.\n\nIt is alleged that Mpofus company was awarded the contract, with the State claiming that Chimombe signed as a witness, leading to the duo receiving a partial payment of US$260,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173755/chimombe-3.jpeg",
            "description": "<p>By Staff Reporter  HIGH Court judge, Justice Benjamin Chikowero is on January 23 expected to hand down his ruling in a matter business partners, Moses Mpofu and Mike Chimombe, are seeking bail in a case they are accused of defrauding City of Harare (CoH) of US$9 million in a streetlights tender deal. The judge heard</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chimombe-mpofu-in-another-bid-for-freedom-ruling-set-for-january-23-in-us7-million-streetlights-tender-fraud/\">Chimombe, Mpofu in another bid for freedom, ruling set for January 23 in US$9 million streetlights tender fraud </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "Supreme Court backs law banning TikTok if it’s not sold by its Chinese parent company",
            "url": "https://www.newzimbabwe.com/supreme-court-backs-law-banning-tiktok-if-its-not-sold-by-its-chinese-parent-company/",
            "content": "By Associated Press\n\nWASHINGTON  The Supreme Court on Friday unanimously upheld the federal law banning TikTok beginning Sunday unless its sold by its China-based parent company, holding that the risk to national security posed by its ties to China overcomes concerns about limiting speech by the app or its 170 million users in the United States.\n\nA sale does not appear imminent and, although experts have said the app will not disappear from existing users phones once the law takes effect, new users wont be able to download it and updates wont be available. That will eventually render the app unworkable, the Justice Department has said in court filings.\n\nThe decision came against the backdrop of unusual political agitation by President-elect Donald Trump, who vowed that he could negotiate a solution, and the administration of President Joe Biden, which has signaled it wont enforce the law  which was passed with overwhelming bipartisan support  beginning Sunday, his final full day in office.\n\nTikTok should remain available to Americans, but simply under American ownership or other ownership that addresses the national security concerns identified by Congress in developing this law, White House press secretary Karine Jean-Pierre said in a statement, noting that actions to implement the law will fall to the new administration.\n\nTrump, mindful of TikToks popularity, and his own 14.7 million followers on the app, finds himself on the opposite side of the argument from prominent Senate Republicans who fault TikToks Chinese owner for not finding a buyer before now. Trump said in a Truth Social post shortly before the decision was issued that TikTok was among the topics in his conversation Friday with Chinese leader Xi Jinping.\n\nTikTok CEO Shou Zi Chew, who is expected to attend Trumps inauguration, used the app to thank the incoming president for his commitment to work with us to keep TikTok available.\n\nIts unclear what options are open to Trump, a Republican, once he is sworn in as president on Monday. The law allowed for a 90-day pause in the restrictions on the app if there had been progress toward a sale before it took effect. Solicitor General Elizabeth Prelogar, who defended the law at the Supreme Court for the Democratic Biden administration, told the justices last week that its uncertain whether the prospect of a sale once the law is in effect could trigger a 90-day respite for TikTok.\n\nThe decision explores the intersection of the First Amendment and national security concerns in the fast-changing realm of social media, and the justices acknowledged in their opinion that the new terrain has been difficult to navigate given they know relatively little about it.\n\nCongress has determined that divestiture is necessary to address its well-supported national security concerns regarding TikToks data collection practices and relationship with a foreign adversary, the court said in an unsigned opinion, adding that the law does not violate petitioners First Amendment rights.\n\nJustices Sonia Sotomayor and Neil Gorsuch filed short separate opinions noting some reservations about the courts decision but going along with the outcome.\n\nWithout doubt, the remedy Congress and the President chose here is dramatic, Gorsuch wrote. Still, he said he was persuaded by the argument that China could get access to vast troves of personal information about tens of millions of Americans.\n\nSome digital rights groups slammed the courts ruling shortly after it was released.\n\nTodays unprecedented decision upholding the TikTok ban harms the free expression of hundreds of millions of TikTok users in this country and around the world, said Kate Ruane, a director at the Washington-based Center for Democracy & Technology, which has supported TikToks challenge to the federal law.\n\nContent creators who opposed the law also worried about the effect on their business if TikTok shuts down.\n\nIm very, very concerned about whats going to happen over the next couple weeks, said Desiree Hill, owner of Crowns Corner mechanic shop in Conyers, Georgia. And very scared about the decrease that Im going to have in reaching customers and worried Im going to potentially lose my business in the next six months.\n\nAt arguments, the justices were told by a lawyer for TikTok and ByteDance Ltd., the Chinese technology company that is its parent, how difficult it would be to consummate a deal, especially since Chinese law restricts the sale of the proprietary algorithm that has made the social media platform wildly successful.\n\nThe app allows users to watch hundreds of videos in about half an hour because some are only a few seconds long, according to a lawsuit filed last year by Kentucky complaining that TikTok is designed to be addictive and harms kids mental health. Similar suits were filed by more than a dozen states. TikTok has called the claims inaccurate.\n\nThe dispute over TikToks ties to China has come to embody the geopolitical competition between Washington and Beijing.\n\nByteDance and its Chinese Communist masters had nine months to sell TikTok before the Sunday deadline, Sen. Tom Cotton, R-Ark., wrote on X. The very fact that Communist China refuses to permit its sale reveals exactly what TikTok is: a communist spy app. The Supreme Court correctly rejected TikToks lies and propaganda masquerading as legal arguments.\n\nThe U.S. has said its concerned about TikTok collecting vast swaths of user data, including sensitive information on viewing habits, that could fall into the hands of the Chinese government through coercion. Officials have also warned the algorithm that fuels what users see on the app is vulnerable to manipulation by Chinese authorities, who can use it to shape content on the platform in a way thats difficult to detect.\n\nTikTok points out the U.S. has not presented evidence that China has attempted to manipulate content on its U.S. platform or gather American user data through TikTok.\n\nBiden signed the legislation it into law in April. The law was the culmination of a yearslong saga in Washington over TikTok, which the government sees as a national security threat.\n\nTikTok, which sued the government last year over the law, has long denied it could be used as a tool of Beijing. A three-judge panel made up of two Republican appointees and a Democratic appointee unanimously upheld the law in December, prompting TikToks quick appeal to the Supreme Court.\n\nWithout a sale to an approved buyer, the law bars app stores operated by Apple, Google and others from offering TikTok beginning on Sunday. Internet hosting services also will be prohibited from hosting TikTok.\n\nByteDance has said it wont sell. But some investors have been eyeing it, including Trumps former Treasury Secretary Steven Mnuchin and billionaire businessman Frank McCourt. McCourts Project Liberty initiative has said it and its unnamed partners have presented a proposal to ByteDance to acquire TikToks U.S. assets. The consortium, which includes Shark Tank host Kevin OLeary, did not disclose the financial terms of the offer.\n\nMcCourt, in a statement following the ruling, said his group was ready to work with the company and President Trump to complete a deal.Prelogar told the justices last week that having the law take effect might be just the jolt ByteDance needs to reconsider its position.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/09191002/25xp-tiktok-mkwl-mediumSquareAt3X.jpeg",
            "description": "<p>By Associated Press  WASHINGTON — The Supreme Court on Friday unanimously upheld the federal law banning TikTok beginning Sunday unless it’s sold by its China-based parent company, holding that the risk to national security posed by its ties to China overcomes concerns about limiting speech by the app or its 170 million users in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-backs-law-banning-tiktok-if-its-not-sold-by-its-chinese-parent-company/\">Supreme Court backs law banning TikTok if it’s not sold by its Chinese parent company</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        },
        {
            "title": "Heavy rains damage railway line; NRZ forced to suspend operations along South-East route",
            "url": "https://www.newzimbabwe.com/heavy-rains-damage-railway-line-nrz-forced-to-suspend-operations-along-south-east-route/",
            "content": "By Staff Reporter\n\nTHE National Railways of Zimbabwe (NRZ) has temporarily suspended operations on the South-East railway line due to the track damage caused by incessant rainfall.\n\nThe railway wash away by the rains was witnessed particularly along the Rutenga-Mbizi and Rutenga-Beitbridge sections.\n\nIn a statement, NRZ said its realigning the damaged area, which covers 480 metres combined and is now at 90% complete.\n\nWe are experiencing wash aways on some parts of our lines, particularly on the South-East line. The heavy rainfall has resulted in the water flow overloading existing drainage structures.\n\nAreas that have been adversely affected include the Rutenga-Mbizi section where 360 metres of tracks were washed away and also a section along the Rutenga-Beitbridge line where 120 metres of tracks were washed away, with gullies reaching two metres in some areas, NRZ said.\n\nIt noted that the area experienced wash aways but due to climate change, high rainfall has since made the unexpected severe damage to the rails.\n\nThe area is susceptible to such incidents because of its natural topographic formation. Although we have previously had similar experiences in the same corridor over the past few years, including on the Mozambican side, this has been worse than any wash away we have seen before.\n\nThe NRZ confirmed that there were dispatched wagons carrying ballast and quarry fines from the Nalatale Quarry Mine in Shangani en route to the affected areas.\n\nFortunately, there have been no injuries reported among staff or damage to rolling stock due to the washouts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/18054225/IMG-20250117-WA0050.jpg",
            "description": "<p>By Staff Reporter  THE National Railways of Zimbabwe (NRZ) has temporarily suspended operations on the South-East railway line due to the track damage caused by incessant rainfall. The railway wash away by the rains was witnessed particularly along the Rutenga-Mbizi and Rutenga-Beitbridge sections. In a statement, NRZ said its realigning the damaged area, which covers</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heavy-rains-damage-railway-line-nrz-forced-to-suspend-operations-along-south-east-route/\">Heavy rains damage railway line; NRZ forced to suspend operations along South-East route</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:04",
            "date": "19 Jan 2025"
        }
    ]
}