{
    "news": [
        {
            "title": "Floyd Shivambu plots new political party amid Zuma coup accusations",
            "url": "https://www.newzimbabwe.com/floyd-shivambu-plots-new-political-party-amid-zuma-coup-accusations/",
            "content": "IOL\n\nFormer MK party secretary-general, Floyd Shivambu, has declared the start of the process to create a new political party following accusations that he attempted to topple former president Jacob Zuma as the MKP leader.\n\nSpeaking at a press briefing at the Mhulu Luxury Boutique Hotel in Midrand on Thursday, Shivambu said they will be consulting with all traditional leaders, church leaders, and civilians over the next few months on the formation of the party.\n\nWe will be seeking the wisdom of ordinary South Africans, including all the churches of Zion Christian Church of Nazareth Baptist Church and IPCC Michael Nkuna, Dr Irvin Khoza, Patrice Motsepe, and Kaizer Motaung on the need to form a new political party.\n\nIf yes, what should be the values of that political party and what should differentiate it from other political parties? he said.\n\nHowever, Shivambu insisted he was not leaving MKP, brushing off the question about dual membership.\n\nI have not resigned from uMkhonto weSizwe. I will never resign from uMkhonto weSizwe, he said, sticking to his word that joining Zumas party was the best decision ever.\n\nShivambu stated that the consultations needed to be the answer to why and how the party should be funded.\n\nHe said the party on the pipelines is not going to be a personal project, a cult or a group of friends. He added that they will announce the leadership that is going to lead the consultations.\n\nShivambu dropped a political bombshell during a media briefing, claiming hed been accused of plotting to overthrow Zuma and take over.\n\nHe slammed what he called a bizarre and fabricated intelligence report, alleging it accused him of wielding supernatural powers capable of making people vanish  charges he dismissed as absurd and politically motivated.\n\nTheres nothing I do in private that I wont own publicly, Shivambu declared defiantly.\n\nHis explosive comments come amid a wave of infighting thats torn through the MK Party.\n\nShivambu, once a dominant policy voice in the EFF, was recently booted from his position as the MKPs sixth secretary-general.\n\nThe dismissal followed internal rebellion from both traditional leaders and a powerful Mpumalanga faction.\n\nThe final straw? His controversial Easter visit to the church of fugitive Malawian pastor Shepherd Bushiri  a move party insiders claim contradicted MKPs official line and sealed his political fate.\n\nRumours of Shivambus imminent departure had been swirling after he went rogue and called an unsanctioned press conference on Wednesday  a bold act that now appears to confirm his break from the partys inner circle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04022058/floyd-shivambu.png",
            "description": "<p>IOL Former MK party secretary-general, Floyd Shivambu, has declared the start of the process to create a new political party following accusations that he attempted to topple former president Jacob Zuma as the MKP leader. Speaking at a press briefing at the Mhulu Luxury Boutique Hotel in Midrand on Thursday, Shivambu said they will be</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/floyd-shivambu-plots-new-political-party-amid-zuma-coup-accusations/\">Floyd Shivambu plots new political party amid Zuma coup accusations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "19 Jun 2025"
        },
        {
            "title": "Chillmaster misses out as Nisha Ts joins Germany’s Moto Moto festival",
            "url": "https://www.newzimbabwe.com/chillmaster-misses-out-as-nisha-ts-joins-germanys-moto-moto-festival/",
            "content": "By Tapiwa Svondo\n\nRISING contemporary musician Chillmaster has pulled out of the upcoming MOTO MOTO Festival in Cologne, Germany, where he was scheduled to perform on July 19.\n\nChillmasters inclusion on the festivals lineup was part of the winning package as the NAMA Outstanding Breakthrough Musician.\n\nHe has been replaced by Zimdancehall artist Nisha Ts.\n\nNisha Ts\n\nUnfortunately, Chillmaster, the NAMA 23rd Edition Outstanding Breakthrough Musician category winner, will be unable to travel due to unforeseen circumstances. After full consultations with Chillmaster and his management, and in alignment with the spirit of the partnership, Nisha Ts, the 2nd place honoree, has been selected to take up the opportunity.\n\nNAMA is committed to supporting Nisha Ts travel and participation at the festival, ensuring that this vital platform continues to open doors for Zimbabwean musical talent on the global stage, reads a statement by the National Arts Council of Zimbabwe (NCAZ).\n\nThe horror hitmaker escaped jail time after he was sentenced to community service following his conviction for culpable homicide and was fined US$200 for driving without a license.\n\nFollowing a pubic outcry, the case is now under review at the High Court, with Judge President Zimba-Dube set to determine if real and substantial justice had been served.\n\nWhen NewZimbabwe.com asked Chillmasters manager, Admire Mushambi aka Mama Vee, if his decision to pull out of the festival was related to the case, he declined to comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220103/Chillmaster.webp",
            "description": "<p>By Tapiwa Svondo RISING contemporary musician Chillmaster has pulled out of the upcoming MOTO MOTO Festival in Cologne, Germany, where he was scheduled to perform on July 19. Chillmasters’ inclusion on the festival’s lineup was part of the winning package as the NAMA Outstanding Breakthrough Musician. He has been replaced by Zimdancehall artist Nisha Ts.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chillmaster-misses-out-as-nisha-ts-joins-germanys-moto-moto-festival/\">Chillmaster misses out as Nisha Ts joins Germany’s Moto Moto festival</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "19 Jun 2025"
        },
        {
            "title": "No wonder the president did not tour hospitals with you – opposition MP taunts Health Minister, chucked out of National Assembly",
            "url": "https://www.newzimbabwe.com/no-wonder-the-president-did-not-tour-hospitals-with-you-opposition-mp-taunts-health-minister-chucked-out-of-national-assembly/",
            "content": "By Staff Reporter\n\nCITIZENS Coalition for Change (CCC) MP Charlton Hwende was on Wednesday removed from the National Assembly for taunting Health Minister Douglas Mombeshora over his exclusion from President Emmerson Mnangagwas visits to Harares public referral hospitals.\n\nManicaland CCC legislator Prosper Mutseyami had brought a policy question on access to health services in public health institutions.\n\nWhat steps is the government taking to improve access to affordable health care and ensure the availability of essential medicines in public hospitals and clinics across the country? Mutseyami asked.\n\nIn his response, Mombeshora tried to give a background on the patient treatment processes in the country using the Shona language, despite the question being asked in English.\n\nThis did not satisfy Hwende, who said, On a point of order, the question was asked in English. The Standing Orders are clear that the Hon. Minister should respond in English.\n\nThe deputy speaker reminded Hwende that the law said otherwise.\n\nAfter Mombeshora gave a lengthy explanation, Hwende interjected and told Mombeshora that his response was not adequate, and this was one of the reasons why President Emmerson Mnangagwa left him and his deputy behind when he visited Parirenyatwa and Sally Mugabe Hospitals on Monday.\n\nNdosaka makatizwa na President pavakaenda ku Parirenyatwa (That is why the President left you when he visited Parirenyatwa hospital), shouted Hwende.\n\nHwende was immediately shown the exit by Gezi.\n\nHwende tried to resist the order, saying: Minister havasi kupindura mubvunzo, ngavapindure mubvunzo, ndobudirei?(The minister is not answering the question. Why should l leave this house?)\n\nGezi did not tolerate any of Hwendes appeals and the MP was escorted out of the Chamber by the Serjeant-At-Arms, leading to several Points of Order by other opposition members.\n\nOn a point of order Madam Speaker. The Standing Rules and Orders say that before someone is chased out of the House, he must be informed of what his offence is, MP Makumire stated.\n\nOn another point of order, CCC MP Gladys. Hlatswayo requested the minister to answer the question raised by Mutseyami.\n\nWe kindly request the minister to answer the question. If he seeks to elaborate further or if he wants us to know what is happening in the health sector, he can come up with a Ministerial Statement. There is a direct question, and he just needs to answer the question.\n\nAnother MP, Rungwave, stood up on a point of order and asked the minister to respond to the question instead of giving a historical background.\n\nA distraught Gezi said, So, have you decided to disrupt the operations of the House with points of order?\n\nGezi responded by ordering the MPs to take their seats for house business to continue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26033121/Chalton-Hwende.jpeg",
            "description": "<p>By Staff Reporter CITIZENS Coalition for Change (CCC) MP Charlton Hwende was on Wednesday removed from the National Assembly for taunting Health Minister Douglas Mombeshora over his exclusion from President Emmerson Mnangagwa’s visits to Harare’s public referral hospitals. Manicaland CCC legislator Prosper Mutseyami had brought a policy question on access to health services in public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-wonder-the-president-did-not-tour-hospitals-with-you-opposition-mp-taunts-health-minister-chucked-out-of-national-assembly/\">No wonder the president did not tour hospitals with you – opposition MP taunts Health Minister, chucked out of National Assembly</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "19 Jun 2025"
        },
        {
            "title": "Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak",
            "url": "https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/",
            "content": "By Staff Reporter\n\nThe government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan.\n\nThis Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna Resort in Harare, marking the start of a process to craft the countrys five-year economic blueprint 2026-2030.\n\nThe indaba drew participants from industry and commerce, farmers organisations, the clergy, civil society and academia.\n\nSpeaking on the sidelines of the event, Minister of Finance, Economic Development and Investment Promotion, Mthuli Ncube, said a draft of NDS 2 should be ready by October.\n\nThe NDS 2 will be a successor to NDS 1. We have appointed consultants to do an evaluation of NDS 1 and their observations will serve as the base for NDS 2, which will be crafted following wide consultations, at the provincial and district levels. We should have a draft ready by October, said Ncube.\n\nAlthough Ncube emphasised that as NDS 1 approaches its end in December 2025, Zimbabwe remains solidly on track to attain an upper-middle-income society status, poverty and unemployment remain widespread among the general populace. The nation is reeling from a liquidity crunch amid a faltering Zimbabwe Gold (ZiG) currency.\n\nNcube said NDS 2 will serve as the crucial five-year plan to leapfrog the country towards the ambitious Vision 2030, by which Zimbabwe will attain upper-middle-class society status.\n\nNcube said chairpersons of 10 national priorities that will underpin the strategy were hitting the ground running to contribute to the national document.\n\nThe final document is expected to be tabled by November 2025, ahead of the National Budget presentation. Thereafter, it will be officially launched by the President.\n\nFollowing NDS 2s launch, Ncube said there will be public awareness campaigns by amplifiers to extensively disseminate its contents so that there is buy-in for the important national blueprint.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Staff Reporter The government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan. This Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/\">Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "19 Jun 2025"
        },
        {
            "title": "US resumes student visas but orders enhanced social media vetting",
            "url": "https://www.newzimbabwe.com/us-resumes-student-visas-but-orders-enhanced-social-media-vetting/",
            "content": "The US State Department says it will resume scheduling appointments for international student visas, but will ask all applicants to make their social media accounts public for enhanced screening.\n\nOfficials have been instructed to expand social media vetting of applicants and search for any indications of hostility toward the citizens, culture, government, institutions, or founding principles of the United States.\n\nThe Trump administration had halted the scheduling of student visa appointments in late May as it prepared to step up measures to restrict applicants deemed hostile to the US.\n\nThe guidelines will impact all applicants who apply for F visas, which are primarily used by students.\n\nApplicants for the M visas, used for vocational students, and the J visas, used by exchange students, will also be impacted, a State Department spokesperson said.\n\nThose who keep their social media accounts private may be deemed as trying to hide their activity, the department added.\n\nIt is an expectation from American citizens that their government will make every effort to make our country safer, and that is exactly what the Trump Administration is doing every single day, a senior State Department official said.\n\nOfficers have also been instructed to screen for those who advocate for, aid, or support designated foreign terrorists and other threats to national security; or who perpetrate unlawful anti-Semitic harassment or violence.\n\nThe move is part of a broader crackdown by the Trump administration against Americas most elite universities.\n\nPresident Donald Trump has deemed these institutions too left-wing, and has accused them of failing to combat antisemitism when pro-Palestinian protests have unfolded on campuses.\n\nTrumps crackdown has also included the freezing of hundreds of millions of dollars in funding for universities, as well as moving to deport students or revoking visas for others. Many of those actions have been blocked by US courts.\n\nAmong the institutions scrutinised by the president is Harvard University, which had $2.65bn (1.96bn) in federal grants frozen.\n\nTrump has also tried to revoke Harvards ability to enrol international students, though that move has been temporarily blocked by a federal judge while the matter is being heard in court.\n\nMore than 1.1 million international students from over 210 countries were enrolled in US colleges in the 2023-24 school year, according to Open Doors, an organisation that collects data on foreign students.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19093315/students.webp",
            "description": "<p>BBC The US State Department says it will resume scheduling appointments for international student visas, but will ask all applicants to make their social media accounts public for enhanced screening. Officials have been instructed to expand social media vetting of applicants and search for “any indications of hostility toward the citizens, culture, government, institutions, or</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-resumes-student-visas-but-orders-enhanced-social-media-vetting/\">US resumes student visas but orders enhanced social media vetting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "19 Jun 2025"
        }
    ]
}