{
    "news": [
        {
            "title": "Sheasham FC pulls out of Central Region Division One, citing lack of fair play",
            "url": "https://www.newzimbabwe.com/sheasham-fc-pulls-out-of-central-region-division-one-citing-lack-of-fair-play/",
            "content": "By Sports Reporter\n\nFormer Premier Soccer League outfit Sheasham FC has pulled out of the ZIFA Central Region Division One League, accusing the competition of lacking fair play.\n\nThe Gweru-based side, which was second on the log with 69 points, just one behind leaders Hardrock FC, announced its withdrawal on Saturday evening after a 3-2 defeat to Midlands State University (MSU).\n\nIn a statement, the club confirmed both its mens and womens teams were withdrawing.\n\nIt is with a heavy heart that we announce the withdrawal of both Sheasham FC and Sheasham Gweru Queens from their respective leagues.\n\nThis decision has been made due to the ongoing issue of an uneven playing field, which compromises the integrity of the competition in the ZIFA Central Region Soccer League (ZCRSL), read part of the statement.\n\nThe club accused the ZCRSL of ignoring repeated concerns over poor officiating and biased treatment.\n\nDespite our repeated concerns regarding poor officiating and other related issues, we have seen these matters ignored by the ZCRSL. Consequently, we believe there is no justification for our continued participation in a competition that appears to be predetermined.\n\nSheasham thanked its fans and partners for their support during what it described as a painful decision.\n\nWe extend our heartfelt gratitude to our beloved supporters, partners, and sponsors for their unwavering support during this time. Your commitment has been invaluable to us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05065328/WhatsApp-Image-2025-10-05-at-07.49.03.jpeg",
            "description": "<p>By Sports Reporter Former Premier Soccer League outfit Sheasham FC has pulled out of the ZIFA Central Region Division One League, accusing the competition of lacking fair play. The Gweru-based side, which was second on the log with 69 points, just one behind leaders Hardrock FC, announced its withdrawal on Saturday evening after a 3-2</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sheasham-fc-pulls-out-of-central-region-division-one-citing-lack-of-fair-play/\">Sheasham FC pulls out of Central Region Division One, citing lack of fair play</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        },
        {
            "title": "Zimbabwean man jailed in Botswana for illegal entry",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-jailed-in-botswana-for-illegal-entry/",
            "content": "The Voice BW\n\nA 32-year-old Zimbabwean national, Brian Mpofu, spent his first night in a Botswana prison after illegally entering the country in 2022.\n\nMpofu was arrested the day before Independence Day at Dumela Industrial by police patrolling the area. When asked to produce travel documents, he was unable to comply.\n\nDuring the arrest, Mpofu attempted to flee but fell, sustaining visible facial injuries.\n\nHe was brought before the Francistown Magistrates Court on Friday on a single count of illegal entry into Botswana.\n\nAs he disembarked from the police van, his scarred face bore a striking resemblance to someone caught in a fire.\n\nAfter the charge was read, Mpofu pleaded guilty, saving the courts time.\n\nI ask for forgiveness. I have children to care for and pay their school fees. I plead with this court to temper justice with mercy when sentencing me, he said, his remorse evident through his scarred expression.\n\nMpofu was fined P3,000 (about US$200), which he must pay by October 24, 2025, or face a two-year prison term.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05053235/brian-mpofu-botswana.png",
            "description": "<p>The Voice BW A 32-year-old Zimbabwean national, Brian Mpofu, spent his first night in a Botswana prison after illegally entering the country in 2022. Mpofu was arrested the day before Independence Day at Dumela Industrial by police patrolling the area. When asked to produce travel documents, he was unable to comply. During the arrest, Mpofu</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-jailed-in-botswana-for-illegal-entry/\">Zimbabwean man jailed in Botswana for illegal entry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        },
        {
            "title": "Global firms vie with China in Zimbabwe energy, minister says",
            "url": "https://www.newzimbabwe.com/global-firms-vie-with-china-in-zimbabwe-energy-minister-says/",
            "content": "Bloomberg\n\nZimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank.\n\nThe US and other Western nations are considering investing in Zimbabwes energy industry, long-dominated by Chinese investors, Energy and Power Development Minister July Moyo said.\n\nThe American interest adds to Middle Eastern and Russian investors who are already present in the southern African nation, Moyo told Bloombergs Jennifer Zabasajja on the sidelines of the African Energy Week conference in Cape Town on Tuesday.\n\nSome of the Western countries, including America, are now talking about: Hey, you have coal, you have gas, he said. We have plenty in Zimbabwe.\n\nZimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank. That restricts access to cheaper financing, making it difficult for the country to attract investors and get projects off the ground.\n\nZimbabwe generates 56% of its electricity from coal at a plant located in the western town of Hwange. The facility has an installed capacity of 1,500 megawatts, after the addition of 600 megawatts by Chinas Sinohydro in 2023. The country also generates 750 megawatts from Kariba Hydro Power, which was built by Sinohydro, adding 300 megawatts in 2025.\n\nZimbabwean officials last week attended a meeting in Washington DC addressed by US Energy Secretary Chris Wright.\n\nWe didnt talk to him face to face, but we were very buoyant by the fact that the present administration accepts that coal and gas are necessary, while we look for renewable energy as a transition, he said. We have investors who want to look at coal bed methane gas, the minister said, without providing further details.\n\nThe authorities in June unveiled a plan to raise more than $9 billion to boost energy access in a country hit by regular power outages  often lasting most of the day- because of a lack of generation capacity. The plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of power output from hydro, wind, solar and biomass plants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05052211/july-moyo.jpg",
            "description": "<p>Bloomberg Zimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank. The US and other Western nations are considering investing in Zimbabwe’s energy industry, long-dominated by Chinese investors, Energy and Power Development Minister July Moyo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/global-firms-vie-with-china-in-zimbabwe-energy-minister-says/\">Global firms vie with China in Zimbabwe energy, minister says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        },
        {
            "title": "Zimbabwe abuse victims of John Smyth take legal action against Church of England",
            "url": "https://www.newzimbabwe.com/zimbabwe-abuse-victims-of-john-smyth-take-legal-action-against-church-of-england/",
            "content": "Channel 4\n\nJohn Smyth has been described as the most prolific abuserto be associated with theChurch of England.\n\nHis barbaric beatings of more than a hundred boys and young men in three countries werecovered up for decades.\n\nNow his victims in Zimbabwe are taking legal action against the Church of England to get answers and compensation.\n\nSixteen-year-old Guide Nyachuru attended one of Smyths Christian camps in Zimbabwe in 1992. He never came back alive.\n\nWe first spoke to Guides sister, Edith, in 2017 for an investigation exposing John Smyths abuse. Now shes joining with seven of Smyths Zimbabwean victims to demand compensation from the Church of England.\n\nAn official review by Keith Makin last year accused the Church of England of a cover-up, saying leading figures could have stopped Smyth continuing his reign of abuse in the UK in the early 1980s, before he left for Zimbabwe and South Africa.\n\nA secret report by an Anglican clergyman, Mark Ruston, in 1982 gave a detailed account of the beatings meted out by Smyth. But rather than face justice, Smyth was allowed to leave for Zimbabwe in 1984.\n\nEdith Nyachuru told us that she believed her brother would still be alive if Smyth had been stopped in the UK.\n\nWhen Channel 4 News spoke to Rocky Leanders nearly a decade ago, he had no idea about the scale of Smyths abuse.\n\nNow hes furious after learning how the Church covered it up.He told us: Im now angrier, angry at a much wider, bigger group of people that should have known better.\n\nBoth Rocky and his brother endured barbaric beatings from Smyth at one of his Christian camps. They were left bruised and in pain.\n\nSmyth also insisted on the boys being naked at the summer camps.\n\nWe werent encouraged to be naked, we were forced to be, he said.Its as simple as that.\n\nSmyth would watch the boys showering, and he too would be naked.\n\nIm now angrier, angry at a much wider, bigger group of people that should have known better. Rocky Leanders\n\nIn 1995, Smyth was charged with culpable homicide over Guides death, but the prosecution unravelled. Smyth died in 2018, depriving his victims of answers.\n\nMakin recommended an independent review into Smyths abuse in Zimbabwe. But, nearly a year later, that hasnt happened.\n\nMaybe theyre looking down on us as a third world country. Edith Nyachuru\n\nEdith told us she believes the Church was still covering up the truth now.\n\nI think the Zimbabwean victims have been treated unfairly, she said, adding: Maybe theyre looking down on us as a third world country.\n\nRocky told us bluntly that the Church  in failing to stop Smyth in the UK  was ultimately responsible for at least one death and many, many, many other countless trauma to young boys and young adults and its just despicable.\n\nHe added: Its disgusting.\n\nThe Archbishop of Canterbury, Justin Welby, quit after the Makin review accused him personally of failing to do enough to stop Smyth.\n\nLaw firm Leigh Day is making a legal claim against the Cambridge church, St Andrew the Great, formerly the round church, whose vicar compiled the 1982 report.\n\nThe Zimbabwean victims and their families still struggle with the legacy of Smyths barbaric abuse.\n\nRocky told us the emotional toll is now significant and that he had lost trust in religion  and humanity as a whole  because people who were in a position of trust have abused that trust.\n\nGuides family are still haunted by his death. Edith said she believed Smyth was rotting in hell.\n\nThe new Archbishop of Canterbury, Sarah Mullally, was announced yesterday. Nearly a year after Justin Welby quit  leaving the organisation he led in crisis  she will immediately face troubling questions about the way victims have been treated.\n\nWe werent encouraged to be naked, we were forced to be. Rocky Leanders\n\nA Church of England spokesperson said: We are truly sorry for the horrendous abuse carried out by John Smyth and the lifelong effects on survivors, both here and in Africa. The Church in South Africa has already carried out its own review. We have been in contact with the Church in Zimbabwe and offered to support and contribute financially to any review that it might choose to undertake, building on the review undertaken by David Coltart in 1993.\n\nThe Church of England is working through the recommendations in its own learning lessons review. The National Safeguarding Team has taken out complaints under the Clergy Discipline Measure against a number of clergy criticised in the review. That process is ongoing.\n\nA spokesperson for St Andrew the Great Church in Cambridge said: We are full of sorrow about the horrendous abuse carried out by John Smyth which has had lifelong effects on survivors, both here and in Africa, and that he was not stopped sooner.\n\nWhile we are unable to comment on the specifics of this claim, we take the safety and wellbeing of our congregation, staff and volunteers extremely seriously and follow Church of Englands Safeguarding Policy and Practice Guidance designed to protect vulnerable people.\n\nIf anyone has been affected by this issue and wants to talk to someone independently, please call the Safe Spaces helpline on 0300 303 1056 or visit safespacesenglandandwales.org.uk. Further support is also available via contacts on our safeguarding webpage.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14162502/guide-nyachuru.jpg",
            "description": "<p>Channel 4 John Smyth has been described as the most prolific abuser to be associated with the Church of England. His barbaric beatings of more than a hundred boys and young men in three countries were covered up for decades. Now his victims in Zimbabwe are taking legal action against the Church of England to get answers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-abuse-victims-of-john-smyth-take-legal-action-against-church-of-england/\">Zimbabwe abuse victims of John Smyth take legal action against Church of England</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        },
        {
            "title": "Dynamos escape relegation zone after dramatic draw against Ngezi Platinum",
            "url": "https://www.newzimbabwe.com/dynamos-escape-relegation-zone-after-dramatic-draw-against-ngezi-platinum/",
            "content": "By Sports Reporter\n\nDynamos climbed out of the relegation zone on Saturday after securing a 1-1 draw against Ngezi Platinum Stars in a drama-filled Premier Soccer League clash at Rufaro Stadium.\n\nThe match was marred by chaos as Ngezi Platinum had three players sent off, two red cards for players and one for head coach Takesure Chiragwi. Tensions flared further when Chiragwi, after being shown his marching orders, slapped one of his own players who had attempted to calm him down.\n\nDespite the setbacks, Ngezi managed to hold on for a draw, while the point earned lifted Dynamos to 14thplace on the log with 33 points, just above the relegation cut-off. The result continues Dynamos unbeaten run under coach Kelvin Kaindu, who took charge at the end of July.\n\nElsewhere, Simba Bhoras title hopes suffered a setback after a 1-0 defeat to CAPS United at Wadzanayi Stadium. The Shamva-based side now trails log leaders Scottland by four points.\n\nScottland FC maintained their advantage at the top with a 1-0 victory over Chicken Inn on Friday, moving to 59 points. Simba Bhora, with 55 points and a game in hand, remains in contention but faces increasing pressure in the title race.\n\nPSL matchday 30 results\n\nChicken Inn 0-1 Scottland\n\nDynamos 1-1 Ngezi Platinum Stars\n\nSimba Bhora 0-1 CAPS United\n\nManica Diamonds 0-0 Triangle\n\nTel One 3-1 Kwekwe United\n\nMWOS 1-0 Green Fuel\n\nZPC Kariba 2-0 Bikita Minerals\n\nFC Platinum 0-0 Yadah\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter Dynamos climbed out of the relegation zone on Saturday after securing a 1-1 draw against Ngezi Platinum Stars in a drama-filled Premier Soccer League clash at Rufaro Stadium. The match was marred by chaos as Ngezi Platinum had three players sent off, two red cards for players and one for head coach</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-escape-relegation-zone-after-dramatic-draw-against-ngezi-platinum/\">Dynamos escape relegation zone after dramatic draw against Ngezi Platinum</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        },
        {
            "title": "Cabinet ministers snub Senate, Question Time abandoned",
            "url": "https://www.newzimbabwe.com/cabinet-ministers-snub-senate-question-time-abandoned/",
            "content": "By Anna Chibamu\n\nSenate business was disrupted Thursday after cabinet ministers failed to turn up for the weekly Question and Answer session, with only one deputy minister present in the chamber.\n\nAccording to Senate Standing Orders, ministers are required to attend the session to respond to questions on government policy. However, Deputy President of the Senate, Retired General Michael Nyambuya, was left with no choice but to cancel the session.\n\nNyambuya ruled that the upper house would proceed with debating motions instead of abandoning the days business altogether.\n\nIt is sad and very unfortunate that this August House is being treated in such a contemptuous manner and yet it is august, it is elected by the people to do our job, but we cannot do our oversight role if we do not have Ministers to question them on policy issues.\n\nThat being the case, I agree that we abandon the Question Time but not go home. Let us debate some of our motions, one or two motions, in lieu of the Question Time.\n\nThe Clerk is going to bring this to the attention of the relevant authorities through a letter, which will be signed by the head of Parliament, again. So, we move away from Questions with Notice and Without Notice, Nyambuya said.\n\nEarlier, he had sought senators views on how to proceed: Hon. Senators, we have one deputy minister. Can I have your proposed way forward? I need not repeat that this is tantamount to treating the Senate with contempt. Any proposed way forward? Do you think we should do away with the question time?\n\nZanu PF Mashonaland East senator Conrad Jericho Gotora expressed frustration, suggesting the sitting be adjourned.\n\nWe have not seen the senior ministers in this august House. Hon. Eng. Makwiranzou and Hon. Phuti are junior Ministers but they do respect this House. They always come in this august House.\n\nMy suggestion is that may we adjourn this House and go home because according to the Order Paper there are questions that date back to many, many days and months. We do not understand why we are sitting here whilst those who are supposed to work with us do not respect us.\n\nYesterday, they were fully present in the National Assembly Chamber but today they are not here. We only have two Deputy Ministers who respect us and always come. May we go and rest like what they are doing? Gotora said.\n\nOpposition senator Nonhlanhla Mlotshwa supported him, while Zanu PFs Irene Zindi fumed: Cabinet ministers are undermining the Senate Chamber because they do not come to the House.\n\nWhen we have questions concerning the development of the country, do not come. We only see Ministers like Hon. Mhona and the deputy ministers.\n\nSo, it is a plea and we are not happy that we cannot go forward. We cannot go on without Ministers in this august House?\n\nChief Ndiweni also urged action to compel ministers to take Senate seriously.\n\nNyambuya later noted that several ministers and deputies had tendered apologies, including Vice Presidents Constantino Chiwenga and Kembo Mohadi, Finance Minister Mthuli Ncube, Defence Minister Oppah Muchinguri-Kashiri, and several others.\n\nThe repeated absence of cabinet ministers from both the National Assembly and Senate has become a growing concern for legislators. Speaker of Parliament Jacob Mudenda has since escalated the matter to the highest office in government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29152508/new-parliament-2.png",
            "description": "<p>By Anna Chibamu Senate business was disrupted Thursday after cabinet ministers failed to turn up for the weekly Question and Answer session, with only one deputy minister present in the chamber. According to Senate Standing Orders, ministers are required to attend the session to respond to questions on government policy. However, Deputy President of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cabinet-ministers-snub-senate-question-time-abandoned/\">Cabinet ministers snub Senate, Question Time abandoned</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        },
        {
            "title": "Sean ‘Diddy’ Combs sentenced to more than four years in prison",
            "url": "https://www.newzimbabwe.com/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison/",
            "content": "BBC\n\nHip-hop mogul Sean Diddy Combs was sentenced to just over four years in prison on Friday after being convicted on prostitution-related charges involving his two ex-girlfriends.\n\nCombs attorneys argued for a 14-month sentence, saying their client is reformed after serving 13 months in a New York jail, but prosecutors wanted 11 years, citing his domestic violence history.\n\nIn addition to prosecutors detailing Combs abuse, the court heard from several of Combs children, some openly sobbing; defence attorneys who called him inspiring; and finally, an apologetic Combs himself.\n\nIn the end, Judge Arun Subramanian said a significant sentence was required as a deterrent, and to send a message.\n\nBefore the judge delivered the 50-month sentence, Combs addressed the court  his first public words since the trial began.\n\nCombs apologised to his victims, specifically naming his two ex-girlfriends, Casandra Ventura, and Jane, who testified under a pseudonym.\n\nMy actions were disgusting, shameful, and sick, he said. I got lost in excess, I got lost in my ego.\n\nHe went on to apologise to his mother and his children.\n\nIm so sorry. They deserved better, he said, referring to his seven children, most of whom were in the courtroom.\n\nThen he begged the judge for a second chance, saying he would never jeopardise time with his family again. I ask your honour for mercy. I beg your honour for mercy, Combs said.\n\nI dont have nobody to blame but myself. I know that Ive learned my lesson.\n\nIn the nearly two-month federal trial in New York City, prosecutors accused Combs of using his celebrity status and sprawling business empire to run a criminal enterprise and sex traffic his former girlfriends.\n\nProsecutors argued Combs sex trafficked women through freak-offs, or encounters in which he would pay male escorts to have sex with his girlfriends while he watched and filmed.\n\nThe government argued Combs coerced the women into unwanted sexual encounters with drugs and physical violence.\n\nCombs, 55, was found not guilty in July of the most serious charges against him, racketeering conspiracy and sex trafficking of his two ex-girlfriends, Ms Ventura and Jane. He was convicted on two charges of transportation to engage in prostitution.\n\nFor most of Friday morning, Combs maintained a non-reactive demeanour, sitting back in his seat and listening quietly as prosecutors accused him of ruining his victims lives.\n\nProsecutor Christy Slavik argued that the harsher sentence was more appropriate for the severity of his actions. A lighter sentence would let the defendant get away with years of domestic violence and abuse, she said.\n\nToday is about accountability and justice, she said.\n\nCiting victim statements and testimony from Ms Ventura and Jane Doe that detailed domestic violence in their relationships with Combs, she reminded the judge of photos the court saw of the two womens injuries they say Combs inflicted.\n\nHe didnt need the money, his currency was control, the prosecutor says. This is a defendant who will pose a danger at any age.\n\nHowever, the defence argued that Combs is not a pimp and that the prostitution charges on which he was convicted did not apply. All pimps share one aggravating factor, said attorney Jason Driscoll. They make money.\n\nThe conviction was based on the Mann Act, passed in 1910, which criminalised transporting women and girls for the purpose of prostitution or debauchery, or for any other immoral purpose. The main difference, Mr Driscoll said, is money, pointing out that Combs did not benefit financially from the offences.\n\nThe defence painted Combs as reformed, describing his positive contributions at the jail in Brooklyn, New York, where hes being held and citing untreated trauma and a ferocious drug addiction as factors in his behaviour.\n\nMr Combs personally inspired me, defence attorney Nicole Westmoreland told the court, choking back tears. She talked about Combs starting his own record label and clothing line, which she said also inspired other black entrepreneurs and musicians.\n\nAfter spending 13 months in jail, Combs was remorseful, said Ms Westmoreland. Your honour, he gets it, simply put.\n\nCombs children  some sobbing  also vouched for his transformation in prison. In possibly the most emotional part of the day, one called him a changed man and another asked for a second chance for his father.\n\nCombs looked on, appearing to hold back tears and occasionally burying his face in his hands.\n\nIn front of you and in front of us is a changed man. He has evolved, something we havent seen in 15 years, said Combs son Quincy Brown.\n\nDelila Combs, 18, pleaded: We cant watch our baby sister grow up fatherless the same way we grew up motherless Please, please give our family the chance to heal.\n\nAfterwards Judge Subramanian thanked them, saying they would help him in his decision.\n\nCombs will get credit toward his 50-month term for the roughly 13 months he has served in jail before and during the trial. He also will be required to pay a $500,000 fine.\n\nAfter the hearing, Combs attorney Marc Agnifilo said the legal team is planning to appeal the decision.\n\nIn his sentence, the judge said Combs actions were more than being a consumer of prostitution, like the defence had claimed, and that he was not convinced Combs would not reoffend if released.\n\nThe defence played a 15-minute video highlighting Combs achievements, and Judge Subramanian acknowledged that he considered his involvement with charities and helping the black community, and his deep family ties.\n\nBut he rejected the defences portrayal of his relationships with Ms Ventura and Jane as intimate and consensual. You abused them, physically, emotionally and psychologically, he said.\n\nBoth women had trauma that will last a lifetime, the judge said. You had the money and the power to keep it going, he said. This was subjugation.\n\nThis is the reality of what happened.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>BBC Hip-hop mogul Sean “Diddy” Combs was sentenced to just over four years in prison on Friday after being convicted on prostitution-related charges involving his two ex-girlfriends. Combs’ attorneys argued for a 14-month sentence, saying their client is reformed after serving 13 months in a New York jail, but prosecutors wanted 11 years, citing his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-diddy-combs-sentenced-to-more-than-four-years-in-prison/\">Sean ‘Diddy’ Combs sentenced to more than four years in prison</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:39",
            "date": "05 Oct 2025"
        }
    ]
}