{
    "news": [
        {
            "title": "High Court dismisses ZAPU application challenging Gukurahundi public hearings",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-zapu-application-challenging-gukurahundi-public-hearings/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Munamato Mutevedzi has dismissed an application by the Zimbabwe African Peoples Union (ZAPU) which sought to stop the chiefs-led Gukurahundi community outreach hearings.\n\nZAPU had filed an urgent chamber application complaining that the hearings set to begin Tuesday were unlawful and unconstitutional.\n\nEarlier this year, ZAPU encouraged survivors to avoid exposing themselves to possible retribution by the state through certain utterances during the hearings.\n\nIn the present application, ZAPU said the National Council of Chiefs was unlikely to be impartial.\n\nZAPU sought an interim interdict to halt the hearings pending a final court ruling.\n\nZAPU also proposed an alternative process involving an independent commission.\n\nIt argued that the current initiative protects perpetrators and fails to deliver justice.\n\nIn dismissing the application, Justice Mutevedzi said, ZAPU did not act when they initially felt agrieved but waited for the day of the hearings to start and then bring their case to court.\n\nPresident Emmerson Mnangagwa, the Local Government and Public Works minister and the National Council of Chiefs were cited as respondents in the application.\n\nOver 20,000 civilians were killed by a crack military unit known as the Fifth Brigade, deployed by Mugabe between 1980 and 1987 under the guise of putting down an insurrection in the western parts of the country.\n\nHowever, some argue the campaign was aimed at hunting down the opposition Zapu leader Joshua Nkomos supporters.\n\nFour decades later, victims have not been compensated and perpetrators walk scot free.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10153513/Gukurahundi.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Munamato Mutevedzi has dismissed an application by the Zimbabwe African Peoples Union (ZAPU) which sought to stop the chiefs-led Gukurahundi community outreach hearings. ZAPU had filed an urgent chamber application complaining that the hearings set to begin Tuesday were unlawful and unconstitutional. Earlier this year, ZAPU encouraged survivors</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-zapu-application-challenging-gukurahundi-public-hearings/\">High Court dismisses ZAPU application challenging Gukurahundi public hearings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "02 Jul 2025"
        },
        {
            "title": "Mugabe’s son Chatunga in court over five assault charges",
            "url": "https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/",
            "content": "By Mary Taruvinga\n\nBellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals.\n\nChatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo.\n\nThe trio were released on US$200 bail each.\n\nThere are five complainants in the case.\n\nIn the first count, the complainant is Ntandoyokuza Nyathi (31).\n\nHe is employed as an external security guard at Ultimate Mine, Mazowe.\n\nAccording to the state, on June 25, at around 1600 hours, the complainant was on duty at Ultimate Mine, Mazowe, where he was guarding the premises with a security dog.\n\nHe was at the boundary of Ultimate Mine and Grace Mugabes Iron Mask farm when the accused persons approached him in pursuit of illegal miners allegedly evading arrest from Iron Mask security guards.\n\nOne of the accused persons fired a shot from an unidentified pistol and the illegal miners escaped. The accused persons charged towards the complainant whom they accused of harbouring illegal miners.\n\nThey altogether assaulted the complainant with open hands and fists before he fell, the court heard.\n\nIt is alleged that the trio stomped on the complainant several times whilst he was lying down.\n\nThey ordered the complainant to carry a sack of gold ore to their premises, where they also took turns to assault him using wooden logs and an iron bar.\n\nThe complainant sustained several injuries and went to report the matter at ZRP Mazowe where he was referred to the hospital for medical treatment and examination.\n\nIn the second count, the complainant in this case is Philip Chipara, employed as an internal security supervisor at Ultimate Mine, Mazowe.\n\nHe was also on duty at Ultimate Mine when he was assaulted.\n\nHe heard a gunshot sound at the boundary of the Ultimate Mine and Iron Mask farm and went to investigate.\n\nUpon arrival, he saw his colleague, Nyathi, who was patrolling with a dog being assaulted with fists, booted feet and a shambock all over the body by the accused persons.\n\nThe complainant enquired as to why they were assaulting their security guard.\n\nThe accused persons charged towards the complainant and started assaulting him with fists and booted feet all over the body, the court heard.\n\nIt is alleged that the three handcuffed Chipara, together with Elvis Bvumbe and later released them.\n\nBvumbe is the other complainant.\n\nChatunga and his bodyguards also assaulted Collen Muchemwa and Waddington Mutadza who were also on duty at the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/17191946/Chatunga.jpeg",
            "description": "<p>By Mary Taruvinga Bellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals. Chatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo. The trio were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/\">Mugabe’s son Chatunga in court over five assault charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "02 Jul 2025"
        },
        {
            "title": "Zimbabwe pays tribute to Dr Joshua Nkomo as opposition dismisses government’s commemoration as “insincere”",
            "url": "https://www.newzimbabwe.com/zimbabwe-pays-tribute-to-dr-joshua-nkomo-as-opposition-dismisses-governments-commemoration-as-insincere/",
            "content": "By Staff Reporter\n\n1 July remains etched in the hearts of millions of Zimbabweans, 26 years after the passing of Father Zimbabwe and former Vice President Dr Joshua Nkomo. His legacy transcends political divides as the nation unites to honour a man who fought for liberation, only to discover that even freedom did not free his people from the chains of colonialism.\n\nNkomos popularity soared both before and after independence. In the darkest days of the 1980s, he fled the country when then Prime Minister Robert Mugabe deployed North Korean-trained troops known as the Fifth Brigade into parts of Midlands and Matabeleland provinces, killing about 20 000 Ndebele-speaking people and ZAPU supporters.\n\nUnder the pretext of quelling renegades, these forces committed gross atrocities against those seen as aligned with Nkomo. Nkomos statue, erected in Bulawayo, a bronze likeness by North Koreas Mansudae Art Studio, stands at the intersection of Joshua Nkomo Street and 8th Avenue, a testament to his enduring influence.\n\nIn a statement on Tuesday, President Emmerson Mnangagwa, who oversaw those very operations as state security minister then, described Dr Nkomo as a liberator and champion of Pan-Africanism.\n\nMnangagwa praised Nkomo affectionately known as Chibwe Chitedza for enduring imprisonment in places like Gonakudzingwa and for never compromising his spirit.\n\nChibwe Chitedza as Dr Nkomo came to be popularly known, endured imprisonment in notorious camps such as Gonakudzingwa, but the colonial efforts failed to break his spirit. Today, twenty-six years later, Zimbabwe can look back with pride to the life of a liberator, an astute politician, a champion of Pan-Africanism, he said.\n\nMnangagwa lauded Nkomo as a beacon of peace and unity, invoking his commitment to reconciliation and national cohesion.\n\nUmdala wethu and his generation of impeccable revolutionaries always preached peace as the bedrock of nation building. We are using the peace dividend to implement pro-people oriented policies and high impact programmes and projects in our endeavour to deliver decent livelihoods to all citizens in a free democratic Zimbabweans.\n\nZanu-PF politburo member Tendai Chirau echoed this sentiment, acknowledging Nkomos role in the liberation struggle and describing him as a selfless statesman, whose vision remains a benchmark of leadership today.\n\nA visionary who began the fight against colonialism in his youth, Cde Nkomo was a true statesman whose leadership left indelible marks on history. Though he is no longer with us, his legacy endures as a timeless template of selfless leadership, Chirau wrote on his X account on Tuesday.\n\nYet, not all are convinced of Mnangagwas sincerity. Prince Dubekos Sibanda, former MP for Binga North, dismissed the commemoration as hollow.\n\nYour commemoration isnt sincere. You hated him to the bone, he wrote on X.\n\nOther critics described the tribute as crocodile tears, accusing Mnangagwa of hypocrisy in light of past violence against Nkomos supporters.\n\nOne X handle by Mr Matebele wrote: Emmerson and Robert Mugabe tormented this man, funny how today you are remembering him after killing his commanders and people of Matebelelandwhat a disgrace.\n\nOpposition voices, including Gift Ostalos Siziba, former MP for Tshabalala, lauded Nkomo as a revolutionary icon with extraordinary character and unwavering discipline and recalled his enduring words: Zimbabwe will not die, its young people will save it. These, he said, continue to inspire future leaders.\n\nDr Joshua Nkomo was born on 19 June 1917 in Matopo, a coalition builder who co-founded the National Democratic Party in 1960 and later ZAPU.\n\nAfter being jailed by the Rhodesian government in 1964, he returned to lead resistance efforts.\n\nNkomos life remains a symbol of unity and resilience. Zanu PF, in its last annual conference in Bulawayo last year, passed a resolution to pronounce July 1, each year, a public holiday, but it has not been sanctioned by Mnangagwa himself.\n\nDr Nkomo died on 1 July 1999 at Parirenyatwa Hospital in Harare and was interred at the National Heroes Acre in Harare. He was 82.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/29115441/Joshua-Nkomo.jpg",
            "description": "<p>By Staff Reporter 1 July remains etched in the hearts of millions of Zimbabweans, 26 years after the passing of “Father Zimbabwe” and former Vice President Dr Joshua Nkomo. His legacy transcends political divides as the nation unites to honour a man who fought for liberation, only to discover that even freedom did not free</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-pays-tribute-to-dr-joshua-nkomo-as-opposition-dismisses-governments-commemoration-as-insincere/\">Zimbabwe pays tribute to Dr Joshua Nkomo as opposition dismisses government’s commemoration as “insincere”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "02 Jul 2025"
        },
        {
            "title": "Electronic Know Your Customer (eKYC) Explained",
            "url": "https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/",
            "content": "As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently?\n\nThe answer lies in eKYCshort for electronic Know Your Customer. This digital approach to verifying customer identity is now a cornerstone of modern financial services, enabling fast, secure, and scalable customer onboarding.\n\neKYCis the digital counterpart of traditional KYC procedures. It allows companies to verify identities without requiring physical presence or paper-based documentation. By using biometric data, document scanning, and real-time analytics, eKYC systems authenticate users remotely, ensuring compliance and security while streamlining the user experience.\n\nWhile both eKYC and traditional KYC aim to prevent financial crime such as money laundering and terrorism financing, the key difference lies in how they operate. Traditional KYC relies on physical documents and in-person checks, whereaseKYC solutionsare fully automated, using facial recognition, liveness detection, and AI to validate identities.\n\nAdopted globally, eKYC technology has become especially prominent since 2022. Regulatory bodies, such as the Qatar Central Bank, have already established frameworks for eKYC verification, including allowing non-residents to onboard digitally with official approval.\n\nThe debate of eKYC vs KYC is really about automation and scale. Heres how they differ:\n\nAspect\n\nTraditional KYC\n\neKYC\n\nDocument Submission\n\nIn-person, physical documents\n\nOnline upload, real-time capture\n\nVerification Method\n\nManual inspection\n\nAutomated checks with AI and biometrics\n\nSpeed\n\nDays\n\nSeconds\n\nAccessibility\n\nLimited to branch hours\n\n24/7 global access\n\nCost\n\nHigh operational costs\n\nLower due to automation\n\nUltimately, eKYC solutions provide a faster, more efficient route to customer identity verificationespecially for remote and mobile-first environments.\n\nLets break down how a typical eKYC verification workflow works:\n\nIn a well-optimized flow, all these steps occur in secondsthanks to automated eKYC verification and seamless eKYC processes.\n\nAdopting eKYC technology offers organizations numerous advantages:\n\nThere are multiple eKYC types, depending on the channel and depth of verification:\n\nEach type offers a different balance of user convenience, speed, and regulatory compliance.\n\neKYC verification is being rapidly adopted across various sectors:\n\nExample: N26, a German neobank, uses automated eKYC solutions to autofill user data after scanning a document, expediting form completion.\n\nExample: Binance restricts unverified users to withdrawals only. Kraken mandates full eKYC verification to trade.\n\nAcross these industries, eKYC technology ensures security, compliance, and a frictionless customer experience.\n\nAs AI-generated photos and videos become more convincing, electronic Know Your Customer systems face rising fraud risks. A Regula study found over half of firms in Crypto and FinTech had encountered AI-driven spoofing.\n\nRegulations vary by region. For example, the Qatar Central Bank now mandates active liveness detectione.g., head movementson mobile apps and kiosks.\n\nRobust eKYC systems require high-performance servers, secure APIs, and advanced IDV tools. Companies must balance security with usability.\n\nFraudsters may exploit customer eKYC by mimicking reverification requests. Customers who recently completed verification are more likely to fall for scams.\n\nSolution: Launch fraud awareness hubs like Danske Banks support portal to educate users.\n\nThe shift toward digital banking and identity services makes eKYC more important than ever. With eKYC verification now a regulatory expectation in many countries, businesses that adopt this approach early will gain a competitive edge.\n\nWhether youre launching a neobank, enhancing a FinTech app, or optimizing compliance in crypto, investing in eKYC technology ensures secure and seamless customer onboarding. And as digital identity wallets and verifiable credentials evolve under initiatives like the EUs eIDAS update, eKYC solutions will only grow more robust and reusable.\n\nNow is the time to modernize your identity verification strategy. With partners like Regula, you can deploy advanced document verification, facial recognition, and liveness detection toolsready to support your transformation into the future of secure digital finance.\n\n",
            "image_url": null,
            "description": "<p>As the rise of neobanks and digital-first services reshapes the financial landscape, traditional institutions are under pressure to modernize. But while face-to-face identity checks are straightforward, doing the same online is far more complex. How can businesses verify identities remotely, securely, and efficiently? The answer lies in eKYC—short for electronic Know Your Customer. This digital</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/electronic-know-your-customer-ekyc-explained/\">Electronic Know Your Customer (eKYC) Explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "02 Jul 2025"
        },
        {
            "title": "Former Minister Mzembi challenges placement on remand",
            "url": "https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/",
            "content": "By Mary Taruvinga\n\nFormer Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand.\n\nMzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application.\n\nHis lawyer, Killian Mandiki, intends to file written submissions before the State responds.\n\nFollowing his arrest last month, Mzembi had his bail revoked by a Harare magistrate who trashed his application for cancellation of arrest warrants, ruling that he failed to report back on time when he got the opportunity.\n\nMandiki had told the court that the former minister was not in wilful default.\n\nMzembi said he was sick with a life-threatening condition and was hospitalised most of the time.\n\nHe also said he only decided to come back home after noticing that his health had improved.\n\nBut the magistrate said Mzembi was not sick to the extent that he could not attend court.\n\nIn revoking Mzembis bail, the magistrate also noted that Mzembi was the campaigning manager for fellow former minister Saviour Kasukuwere, who is currently exiled in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01102551/mzembi.png",
            "description": "<p>By Mary Taruvinga Former Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand. Mzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application. His lawyer, Killian Mandiki, intends to file written submissions before the State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/\">Former Minister Mzembi challenges placement on remand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "02 Jul 2025"
        },
        {
            "title": "Train runs over lifeless man, another killed while lying on rail tracks",
            "url": "https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/",
            "content": "By Staff Reporter\n\nA NATIONAL Railways of Zimbabwe (NRZ) trainon Mondayran over a man who is believed to have already been dead.\n\nThe incident happened atOdzi Siding near the eastern border city of Mutare.\n\nThe NRZ confirmed the incident in a statement.\n\nA man was run over by a train early this morning at Odzi Siding near Mutare. The man was lying lifeless on the tracks and did not respond to the approaching trains sounding horn.\n\nThe train crew suspect the man was already dead by the time he was run over. The man had no identity particulars on him and the scene was attended by ZRP, reads the statement.\n\nIn a separate but similar incident, a man identified as Peter Vengesayi was run over by a train near Zvishavane, Midlands province.\n\nIn yet another tragic incident today, a man died after being run over by a train near Zvishavane.\n\nPeter Vengesayi of Village 1, Zeederburg under Chief Mafala was lying on the tracks when the incident occured. The NRZ extends its condolences to his family, said NRZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/17224403/National-Railways-of-Zimbabwe.jpg",
            "description": "<p>By Staff Reporter A NATIONAL Railways of Zimbabwe (NRZ) train on Monday ran over a man who is believed to have already been dead. The incident happened at Odzi Siding near the eastern border city of Mutare. The NRZ confirmed the incident in a statement. “A man was run over by a train early this morning at Odzi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/train-runs-over-lifeless-man-another-killed-while-lying-on-rail-tracks/\">Train runs over lifeless man, another killed while lying on rail tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:19",
            "date": "02 Jul 2025"
        }
    ]
}