{
    "news": [
        {
            "title": "Armed robbers make off with US$1 million, gold",
            "url": "https://www.newzimbabwe.com/armed-robbers-make-off-with-us1-million-gold/",
            "content": "By Mary Taruvinga\n\nArmed robbers made off with over US$1 million in separate robberies which took place in Mt Darwin and Bulawayo in the last two days, according to the Zimbabwe Republic Police.\n\nThe first incident occurred at an unnamed bank in Mt. Darwin on June 26, 2025.\n\nThe incident occurred around 0200 hours.\n\nThree unknown suspects, armed with pistols, pounced on the bank, attacked the security guard who was on duty at the premises and then broke into the bank, where they blasted open a safe and stole approximately USD700,000 and 2.4 kilogrammes of gold, said police spokesperson Paul Nyathi in a statement.\n\nIn another case, police in Bulawayo are investigating a robbery that occurred at Old Nick Mine on June 25, 2025.\n\nNyathi said three unknown suspects, who were armed with pistols, pounced on the companys offices and attacked three complainants who were present.\n\nThe suspects stole US$520,000 and two cell phones.\n\nMore detailed information regarding the two cases will be released this Friday, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/07065619/Armed-robberry.jpg",
            "description": "<p>By Mary Taruvinga Armed robbers made off with over US$1 million in separate robberies which took place in Mt Darwin and Bulawayo in the last two days, according to the Zimbabwe Republic Police. The first incident occurred at an unnamed bank in Mt. Darwin on June 26, 2025. The incident occurred around 0200 hours. “Three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/armed-robbers-make-off-with-us1-million-gold/\">Armed robbers make off with US$1 million, gold</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "Face of corruption! Biti, Kasukuwere blast Tagwirei, call for audit of Sakunda Holdings contracts",
            "url": "https://www.newzimbabwe.com/face-of-corruption-biti-kasukuwere-blast-tagwirei-call-for-audit-of-sakunda-holdings-contracts/",
            "content": "By Darlington Gatsi\n\nFORMER cabinet ministers Saviour Kasukuwere and Tendai Biti have pushed back against controversial businessman Kudakwashe Tagwirei, describing him as the face of corruption whose rise to power will be dire for Zimbabwe.\n\nThis comes after Tagwirei launched attacks on former ZANU-PF political commissar Kasukuwere and Biti, accusing them of corruption.\n\nBiti has previously challenged Tagwireis Command Agriculture contracts when he was still a legislator.\n\nConsequently, in 2020, Tagwirei was sanctioned by the United States of America for allegedly aiding government corruption through state contracts secured by his company, Sakunda Holdings.\n\nPosting on X, Kasukuwere said Tagwireis ascent to power within ZANU-PF would betray the revolutionary partys ethos.\n\nA good fraudster is not necessarily a good politician. Trying to turn a thief into a leader is the ultimate betrayal of the revolutionary party by a reactionary leader. The game has begun, and that rimming mouth will not be opened again.\n\nWhen a frog wakes up in ZANU-PFs Central Committee, it thinks all other positions are acquired by leaping! A historic party has been reduced to a rent-seeking, positions-for-sale party. How does a whole NPC [National Political Commissar] Machacha subordinate himself to a crook? Hurombo Huroyi, wrote Kasukuwere.\n\nBusinessman Kudakwashe Tagwirei(Photo credit JEKESAI NJIKIZANA/AFP/Getty Images)\n\nTagwirei, a close ally of President Emmerson Mnangagwa, is reportedly eyeing the ZANU PF leadership when Mnangagwas constitutional term expires in 2028.\n\nThe businessman has been criss-crossing the country, hosting ZANU PF events, a move political observers describe as an attempt to galvanise support within the ruling party.\n\nHe has denied ambitions to succeed Mnangagwa, instead pushing for the presidents term to be extended beyond the constitutional two-term limit.\n\nBiti, who has been vocal against Tagwireis potential rise to power, said an audit should be conducted to trace funds the businessman allegedly gained through opaque government contracts.\n\nWe stand firm on principle & on deep-rooted values that have defined us for decades. We will never allow charlatans & crooks to take over the State, to emasculate the Constitution, or to buy their way into office. Criminals must know that one day soon, Zimbabwe will rise, and crooks will fall.\n\nA New Zimbabwe must audit all Treasury Bills issued by the Government in the last 20 years. Billions have been illicitly siphoned off in opaque transactions done outside parliamentary scrutiny. One crook has been awarded more TBs than any other entity in Zimbabwe. Its time for this audit! said Biti.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/06045739/Tendai-Biti1.jpg",
            "description": "<p>By Darlington Gatsi FORMER cabinet ministers Saviour Kasukuwere and Tendai Biti have pushed back against controversial businessman Kudakwashe Tagwirei, describing him as the “face of corruption” whose rise to power will be dire for Zimbabwe. This comes after Tagwirei launched attacks on former ZANU-PF political commissar Kasukuwere and Biti, accusing them of corruption. Biti has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/face-of-corruption-biti-kasukuwere-blast-tagwirei-call-for-audit-of-sakunda-holdings-contracts/\">Face of corruption! Biti, Kasukuwere blast Tagwirei, call for audit of Sakunda Holdings contracts </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "Stigma, discrimination remain the most damaging barriers to Zimbabwe’s HIV response – Health Minister",
            "url": "https://www.newzimbabwe.com/stigma-discrimination-remain-the-most-damaging-barriers-to-zimbabwes-hiv-response-health-minister/",
            "content": "By Anna Chibamu\n\nSTIGMA and discrimination remain the most damaging barriers to the countrys national HIV response, Health and Child Care Minister Douglas Mombeshora has said.\n\nAddressing journalists at a Zimbabwe National Network of People Living with HIV (ZNNP+) breakfast meeting in Harare this Thursday, Mombeshora said stigma discouraged vital actions meant to reduce the spread and treatment of HIV.\n\nThe stigma index 2.0 has risen to 69.7% from 65% between 2018 and 2023.\n\nStigma and discrimination remain among the most damaging barriers to Zimbabwes national HIV response.\n\nFor people living with HIV, the impact goes beyond emotional distress. It is structural and systemic. Stigma, isolated individuals, erode their self-worth and discourage vital actions like HIV testing, disclosure and adherence to treatment.\n\nDiscrimination in families, workplaces, health care settings and communities creates fear and silence that allow the virus to spread unchecked, Mombeshora said.\n\nOur collective commitment must be to build a pathway where every person living with HIV is treated with dignity, respect and compassion, free from judgment and fully supported to live a healthy, productive life.\n\nThe minister reported that the World Health Organisation emphasised that quality health care involved not only medicines, access, but also dignity, equity and inclusivity.\n\nDiscrimination in health care, such as segregated queues, bridges of confrontation or denial of care, atomised public trust, discourages service use and perpetuates inequities.\n\nResearch shows internalised stigma leads to shame, isolation, depression and loss of obesity, which reduce mental wellbeing and deter engagement with HIV services, the minister told the media.\n\nHe warned that fear of judgment causes delayed care, increasing risks of late diagnosis and treatment failure, undermining individual and public health.\n\nMombeshora commended the ZNNP+ for playing a pivotal role in shaping the countrys national HIV response.\n\nYou share public awareness, foster accountability and encourage dialogue that informs everything best decisions. You are not only merely conveyors of information, you are agenda setters, influencers of public sentiment and advocates for justice. Your voices are essential to advancing health equity, dispelling myths and amplifying the resilience of those affected by HIV.\n\nTo date, Zimbabwe has 1.3 million Zimbabweans living with HIV and over 96% are accessing life-saving antiretroviral therapy.\n\nWe have reached the UNAs 95-95-95 targets ahead of schedule, a milestone reflecting our strong infrastructure, committed healthcare workers and effective multi-sector collaboration.\n\nThe countrys gains on HIV remain fragile, according to Mombeshora.\n\nOur gains remain fragile. Between January and June this year, Zimbabwe recorded 5,932 AIDS-related deaths compared to 5,712 in the same period in 2024, an increase of 220 deaths. Reminding us, our work is still not done.\n\nThis rise is not due to partial withdrawal of partner support. By the time key partners like the US government withdrew some funding, our institutions had adequate ARR fees and supplies.\n\nThe minister highlighted that Zimbabwes systems had shown resilience and continued to monitor closely to ensure uninterrupted treatment.\n\nThe government has mobilised domestic resources through SIM taxes on alcohol, tobacco, sugar drinks at the AIDS level to protect ARR fees, stockpiles and maintain service continuity.\n\nThe Finance Ministry is reinforcing but in allocations, while we engage strategic partners to close funding gaps.\n\nWe must, however, be candid. The transition to full domestic financing introduces complex challenges, said the Minister.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Anna Chibamu STIGMA and discrimination remain the most damaging barriers to the country’s national HIV response, Health and Child Care Minister Douglas Mombeshora has said. Addressing journalists at a Zimbabwe National Network of People Living with HIV (ZNNP+) breakfast meeting in Harare this Thursday, Mombeshora said stigma discouraged vital actions meant to reduce the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stigma-discrimination-remain-the-most-damaging-barriers-to-zimbabwes-hiv-response-health-minister/\">Stigma, discrimination remain the most damaging barriers to Zimbabwe’s HIV response – Health Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "Chevrons to host Sri Lanka in white-ball series",
            "url": "https://www.newzimbabwe.com/chevrons-to-host-sri-lanka-in-white-ball-series/",
            "content": "By Sports Reporter\n\nZimbabwe Cricket (ZC) has announced Sri Lanka will be in the countrylater this year for a white-ball series to be played at Harare Sports Club.\n\nThe upcoming tour features two One-Day Internationals scheduled for 29 and 31 August, followed by three Twenty20 Internationals on 3, 6 and 7 September.\n\nWe are delighted to confirm Sri Lankas visit to Zimbabwe for what we expect to be a thrilling and competitive series, said Zimbabwe Cricket managing director Givemore Makoni.\n\nZimbabwe will use the T20I games as part of preparations for the ICC Mens T20 World Cup Africa Regional Finals which they will host from September 19 to October 4.\n\nMatches between our two nations have always produced entertaining cricket and this tour comes at a crucial time for our team as we prepare for the upcoming T20 World Cup qualifying campaign, added Makoni.\n\nThe top two teams from the ICC Mens T20 World Cup Africa Regional Finals will qualify for the 2026 World Cup which will be jointly hosted by India and Sri Lanka.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/15041235/sri-lanka-zim-cricket.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe Cricket (ZC) has announced Sri Lanka will be in the country later this year for a white-ball series to be played at Harare Sports Club. The upcoming tour features two One-Day Internationals scheduled for 29 and 31 August, followed by three Twenty20 Internationals on 3, 6 and 7 September. “We are delighted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-host-sri-lanka-in-white-ball-series/\">Chevrons to host Sri Lanka in white-ball series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "Kirsty Coventry: IOC President says female category has to be protected",
            "url": "https://www.newzimbabwe.com/kirsty-coventry-ioc-president-says-female-category-has-to-be-protected/",
            "content": "BBC Sport\n\nKirsty Coventry, the new president of the International Olympic Committee, says its members have shown overwhelming support to protecting the female category in sport.\n\nIn a significant shift in policy, she said the IOC must play a leading role in discussions on gender eligibility.\n\nAt her first news conference since taking over the role earlier this week, the Zimbabwean revealed a working group on the issue made up of experts and international federations would ensure that we find consensus.\n\nThe IOC has previously left gender regulations to the governing bodies of individual sports rather than applying a universal approach.\n\nBut having become the first woman to hold the IOC presidency, 41 year-old Coventry said its members now wanted to develop a policy to come up with cohesion.\n\nHowever, Coventry also hinted that no retrospective action would be taken over the controversial boxing tournament at last years Paris Olympics, when the IOCs handling of gender rules came under intense scrutiny.\n\nFollowing a first meeting of her executive board, Coventry added, We understand that therell be differences depending on the sport but it was very clear from the members that we have to protect the female category, first and foremost to ensure fairness.\n\nBut we need to do that with a scientific approach and the inclusion of the international federations who have already done a lot of work in this area.\n\nDuring her election campaign, former swimmer Coventry  a seven-time Olympic medalist  pledged to introduce a blanket ban on transgender women competing in female Olympic competition.\n\nIn recent years a growing number of sports federations have barred athletes who have undergone male puberty from competing in elite female competition amid concerns over fairness and safety.\n\nHowever, in other sports, transgender women are still able to compete in womens events at the Olympics.\n\nThe IOC was engulfed in controversy at the Paris Games last summer when Algerias Imane Khelif won the womens welterweight boxing gold medal  a year after being disqualified from the World Championships for reportedly failing a gender eligibility test.\n\nThe IOC cleared the 25-year-old to compete  along with Taiwans Lin Yu-ting  who was also banned by the suspended International Boxing Association (IBA). The IOC said competitors were eligible for the womens division if their passports said they were female.\n\nBoth fighters insist they are women, have always competed in the womens division, and there is no suggestion they are transgender.\n\nSome reports took the IBA stating that Khelif has XY chromosomes to speculate that the fighter might have differences of sexual development (DSD), like runner Caster Semenya. However, the BBC has not been able to confirm whether this is or is not the case.\n\nLast year, the World Boxing Organisation (WBO) said reports it had stripped Khelif of the Paris gold medal for failing gender eligibility tests were obviously false.\n\nWhen asked if her working group could apply any retrospective action, Coventry said, Were not going to be doing anything retrospectively. Were going to be looking forward. From the members [it] was what are we learning from the past, and how are we going to leverage that and move that forward to the future?'\n\nEarlier this month, World Boxing said mandatory sex testing would be introduced in July to ensure the safety of all participants and deliver a competitive level playing field for men and women. It followsWorld Athletics which has also approved the introduction of a swab testto determine if an athlete is biologically female.\n\nWhen asked if she endorsed such a policy, and if the IOC could also adopt it, Coventry said, Its too early to pre-empt the medical experts.\n\nIt was very clear from the membership the discussion around this has to be done with medical and scientific research at the core, so we are looking at the facts and the nuances and the inclusion of the international federations that have done so much of this workhaving a seat at table and sharing with us because every sport is different.\n\nBut it was pretty much unanimously felt that the IOC should take a leading role in bringing everyone together to try and find a broad consensus.\n\nIn February, the president of the International Paralympic Committee told BBC Sport thathe is opposed to blanket solutionsfor transgender participation policies.\n\nAndrew Parsons was speaking after United States president Donald Trump signed an executive order that prevents transgender women from competing in female categories of sports. He said he would deny visas to transgender athletes seeking to compete in female categories at the Los Angeles Olympic Games in 2028.\n\nCoventry said the IOC also planned to set up a second working group looking at when Olympic host cities should be named.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>BBC Sport Kirsty Coventry, the new president of the International Olympic Committee, says its members have shown “overwhelming support” to protecting the female category in sport. In a significant shift in policy, she said the IOC must “play a leading role” in discussions on gender eligibility. At her first news conference since taking over the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kirsty-coventry-ioc-president-says-female-category-has-to-be-protected/\">Kirsty Coventry: IOC President says female category has to be protected</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "Lack of funding dampens elephant conservation efforts – ZimParks",
            "url": "https://www.newzimbabwe.com/lack-of-funding-dampens-elephant-conservation-efforts-zimparks/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks) has said the lack of funding to manage elephants in its game reserves is negatively impacting elephant conservation efforts, leading to increased human-wildlife conflict.\n\nThe authority is working with a budget of US$500,000 at its biggest game reserve, Hwange National Park, against the required US$21 million to manage the ever-increasing elephant population.\n\nZimParks recently hosted a review and updating workshop on the Zimbabwe Elephant Management Plan (2021-2025) to assess implementation of the plan, emerging issues, evaluate management approaches, and exploring effective strategies from past experiences which was for the first time attended by chiefs from Hwange.\n\nIn a statement issued on Thursday, ZimParks spokesperson Tinashe Farawo said chiefs complained that their affected communities have not benefited from their proximity to the wildlife.\n\nThe chiefs expressed their concerns on the lack of tangible benefits for communities who bear the brunt of sharing borders with elephants and a relief fund for injured community people.\n\nThe traditional leaders expressed concerns over the ongoing poverty faced by these communities, worsened by crop raiding, resource competition, and incidents of injury and property damage caused by elephants, he said.\n\nThe increased elephant populations and localised overabundance have resulted in increased human-elephant conflicts.\n\nAccording to Farawo, while this is happening, ZimParks efforts to curb the crisis are dampened by a lack of resources.\n\nThe countrys elephant conservation efforts are severely under-financed, with the current budget for Hwange National Park falling below US$500,000 annually, compared to the estimated US$21 million required based on management costs in other well-managed protected areas in Southern Africa, he said.\n\nFarawo also said sustainable utilisation is hindered by various factors, including global trade restrictions.\n\nMeanwhile, while elephant poaching for ivory has declined, effective partnerships have played a vital role in enhancing conservation efforts.\n\nFarawo said elephant conservation requires collective efforts from all stakeholders.\n\nZimbabwe has the second-largest elephant population in the world, with an estimated 82,000 elephants.\n\nWhile Zimbabwe is lauded for its conservation efforts, the elephant population is growing faster than the environment can sustain, leading to human-wildlife conflict and habitat degradation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/25193036/Zimbabwe-Elephants.png",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority  (ZimParks) has said the lack of funding to manage elephants in its game reserves is negatively impacting elephant conservation efforts, leading to increased human-wildlife conflict. The authority is working with a budget of US$500,000 at its biggest game reserve, Hwange National Park, against the required</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lack-of-funding-dampens-elephant-conservation-efforts-zimparks/\">Lack of funding dampens elephant conservation efforts – ZimParks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "UN Women hails Zimbabwe’s progress on gender equality",
            "url": "https://www.newzimbabwe.com/un-women-hails-zimbabwes-progress-on-gender-equality/",
            "content": "APA News\n\nThe UN Women executive board has commended Zimbabwe for its strides in promoting gender equality and womens empowerment.\n\nSpeaking after a week-long visit led by board president Nicola Clase, the UN agency praised Zimbabwes legal frameworks supporting womens rights.\n\nI note the strong legal frameworks for gender equality and womens empowerment. We encourage the government and partners to focus on the effective implementation of these laws, said Clase who is Swedens permanent representative to the UN in New York.\n\nThe visit featured high-level discussions, including a meeting with President Emmerson Mnangagwa who reiterated his administrations commitment to gender parity.\n\nGender equality is not only a fundamental right, but also a necessity for national growth, Mnangagwa said.\n\nThe delegation also met with Women Affairs Minister Monica Mutsvangwa and Speaker of Parliament Jacob Mudenda, both of whom highlighted legislative and policy initiatives aimed at advancing womens social and economic inclusion.\n\nField visits to projects supported by UN Women  including the Umzingwane and Epworth Safe Markets and the Maker Space Innovation Hub  offered tangible evidence of community-level impact.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26210102/schoolgirls-1536x1024-1.webp",
            "description": "<p>APA News The UN Women executive board has commended Zimbabwe for its strides in promoting gender equality and women’s empowerment. Speaking after a week-long visit led by board president Nicola Clase, the UN agency praised Zimbabwe’s legal frameworks supporting women’s rights. “I note the strong legal frameworks for gender equality and women’s empowerment. We encourage</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-women-hails-zimbabwes-progress-on-gender-equality/\">UN Women hails Zimbabwe’s progress on gender equality</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        },
        {
            "title": "ZIMURA to appeal boss’s fraud conviction, says ruling “unfair”",
            "url": "https://www.newzimbabwe.com/zimura-to-appeal-bosss-fraud-conviction-says-ruling-unfair/",
            "content": "By Tapiwa Svondo\n\nThe Zimbabwe Music Rights Association (ZIMURA) has said it will appeal its Executive Director Polisile Ncube Chimhinis fraud conviction, describing the ruling as unjust.\n\nChimhini was on Wednesday convicted of fraud by Harare Magistrate Rufaro Panavanhu. She was facing forgery and fraud charges and was acquitted.\n\nShe was acquitted of forgery but found guilty of fraud and fined US$300.\n\nIn a statement, the ZIMURA Director of Information, Alexio Gwenzi, said a notice of appeal against both the conviction and sentence had been filed.\n\nZIMURA was taken to court over allegations of misrepresentation of facts related to the filing of the CR6 form, a legally recognized document submitted to and stamped by the Registrar of Companies. This document was lawfully processed, paid for, and later tendered as evidence in the High Court in a separate case involving Phillip Chipfumbus membership dispute.\n\nZIMURA maintains that no misrepresentation, forgery, or fraud occurred in this matter. The CR6 was a legitimate filing under the Companies Act, and we firmly believe the conviction is unjust. As such, we have filed a notice of appeal to challenge both the conviction and sentence, said Gwenzi.\n\nIn July 2023, a complainant Philip Chipfumbu, filed a case against ZIMURA at the High Court and sought an audit of the music rights association. Chipfumbu later discovered that a CR6 document filed for ZIMURA by Chimhini was forged and not registered with the Department of Deeds, Companies and Intellectual Property. The CR6 was only registered later in January 2024.\n\nZIMURA further dismissed reports that Chimhini was remanded in custody.\n\nPlease take note that the malicious statements circulating that there was misappropriation of funds and that Mrs Chimhini was remanded in custody are mere lies aimed at tarnishing her image and brand Zimura. The fraud case is in relation to the CR6 form that was filed in the High Court of Zimbabwe, said Gwenzi.\n\nEarlier today, in a series of Facebook posts, Chimhini wrote, Dont worry Im safe, one doesnt go with a phone in jail.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/18152113/zimura.jpeg",
            "description": "<p>By Tapiwa Svondo The Zimbabwe Music Rights Association (ZIMURA) has said it will appeal its Executive Director Polisile Ncube Chimhini’s fraud conviction, describing the ruling as “unjust”. Chimhini was on Wednesday convicted of fraud by Harare Magistrate Rufaro Panavanhu. She was facing forgery and fraud charges and was acquitted. She was acquitted of forgery but</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimura-to-appeal-bosss-fraud-conviction-says-ruling-unfair/\">ZIMURA to appeal boss’s fraud conviction, says ruling “unfair”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:18",
            "date": "27 Jun 2025"
        }
    ]
}