{
    "news": [
        {
            "title": "Kombi drivers must be 30 years old and experienced— says government, introduces stricter age, skills requirements",
            "url": "https://www.newzimbabwe.com/kombi-drivers-must-be-30-years-old-and-experienced-says-government-introduces-stricter-age-skills-requirements/",
            "content": "By Tapiwa Svondo\n\nTHE Government of Zimbabwe has enacted a new road traffic regulation that now disallows inexperienced individuals from driving public service vehicles, particularly omnibuses which carry passengers across the country.\n\nThis new law will help combat road carnage caused by excitable young and inexperienced drivers.\n\nIn a new Statutory Instrument (SI), Transport and Infrastructural Development Minister, Felix Mhona, said the drivers of passenger public service vehicles must now be at least 30 years old and have a minimum of five years of driving experience.\n\nThe Road Traffic (Licensing of Drivers) Regulations, 2023, published in Statutory Instrument 119 of 2023, is amended in section 4 by the repeal of subsection (6)(c) and substitution of-\n\n(c) a class of motor vehicle which is a passenger public service vehicle of an omnibus or commuter omnibus type unless he or she has driving experience of not less than five years and age of not less than 30 years, reads the gazette.\n\nMeanwhile, the regulations also exempt drivers aged 25-30, who had been already authorised to drive passenger public service vehicles to continue operating.\n\nProvided that, drivers who are still between 25 and 30 years who were already authorised to drive an omnibus or commuter omnibus before the publication of these regulations shall continue to drive motor vehicles in that class, reads the SI.\n\nThe new regulations come into effect immediately following their publication.\n\nThese regulations may be cited as the Road Traffic (Licensing of Drivers) (Amendment) Regulations, 2025 (No. 1).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/22215006/kombi-Harare.jpg",
            "description": "<p>By Tapiwa Svondo  THE Government of Zimbabwe has enacted a new road traffic regulation that now disallows inexperienced individuals from driving public service vehicles, particularly omnibuses which carry passengers across the country. This new law will help combat road carnage caused by excitable young and inexperienced drivers. In a new Statutory Instrument (SI), Transport and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kombi-drivers-must-be-30-years-old-and-experienced-says-government-introduces-stricter-age-skills-requirements/\">Kombi drivers must be 30 years old and experienced— says government, introduces stricter age, skills requirements</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "SADC Member States pledge support for DRC amid flaring conflict",
            "url": "https://www.newzimbabwe.com/sadc-member-states-pledge-support-for-drc-amid-flaring-conflict/",
            "content": "By Mary Taruvinga\n\nTHE Southern African Development Community (SADC) Member States have pledged support for the Democratic Republic of Congo (DRC) following the capture of its capital city, Goma by M23 rebels who have the backing of Rwanda.\n\nThis Friday, SADC leaders convened in Harare to map a way forward amid the ongoing crisis which has seen 16 peacekeepers from Malawi and South Africa losing their lives.\n\nOver 70 lives have also been lost so far as the war escalates.\n\nIn his closing remarks, SADC Chairperson, President Emmerson Mnangagwa called for peace among belligerent parties, also announcing that DRC will always have support from SADC Member States.\n\nThe realisation of the SADC Vision 2050 and the Africa we all want under the African Union Agenda 2063, are intricately dependent on an unshakeable foundation of political stability, peace and security.\n\nAs masters of our own destiny, we, therefore, remain relentless in our quest to create a SADC and an Africa that plays its part at the global stage, guided by the ideals of Pan-Africanism and the spirit of African Renaissance.\n\nIt is the individual and collective duty of all Member States, to do much more towards permanently silencing the guns if we are to succeed in achieving these aspirations.\n\nTogether we must march forward, no one and no place must be left behind.\n\nMnangagwa said bold and decisive measures must continue to be implemented to adequately resource and equip SADC Mission ln the DRC (SAMIDRC) so that it continues to execute its mandate.\n\nFundamentally, all parties to the conflict, are urged to pursue an encompassing dialogue and peaceful dispute resolution mechanisms, guided by the spirit and letter of both the Luanda Ceasefire Agreement and the Nairobi Peace Process.\n\nThe international community is also being called upon to scale up the provision of requisite humanitarian assistance to the affected population as well as in augmenting ongoing peace and security efforts, he said.\n\nReading out the communique after a long meeting which lasted over five hours, Magosi said the summit expressed concern that the recent attacks have continued to worse the security and humanitarian situation in DRC and called for immediate restoration of essential utilities such as water, electricity, means of communication and supply lines for food and other essentials.\n\nSummit called for the immediate dispatch of ministers of defence, chiefs of defence and troop contributing countries to DRC to ensure that the SAMIDRC troops are safe and facilitate immediate repatriation of the deceased troops and those who are injured.\n\nSummit reaffirmed its solidarity and unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty, and territorial integrity, as well as sustainable peace, security and development, said Mgosi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31174300/SADC-head-of-states-scaled.jpg",
            "description": "<p>By Mary Taruvinga  THE Southern African Development Community (SADC) Member States have pledged support for the Democratic Republic of Congo (DRC) following the capture of its capital city, Goma by M23 rebels who have the backing of Rwanda. This Friday, SADC leaders convened in Harare to map a way forward amid the ongoing crisis which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-member-states-pledge-support-for-drc-amid-flaring-conflict/\">SADC Member States pledge support for DRC amid flaring conflict</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "SADC Extraordinary Summit: Mnangagwa softens stance on M23 rebels, begs for a peaceful solution in DRC",
            "url": "https://www.newzimbabwe.com/sadc-extraordinary-summit-mnangagwa-softens-stance-on-m23-rebels-begs-for-a-peaceful-solution-in-drc/",
            "content": "By Thandiwe Garusa\n\nTHE Southern African Development Community (SADC) Chairman, President Emmerson Mnangagwa, who a few days ago vowed to take militant action against the Rwandan-backed Congolese March 23 Movement (M23) rebels, has softened his stance and made pleas for a peaceful resolution.\n\nAt least 16 soldiers serving with SADC and UN peacekeeping forces in DRC were killed by the M23 this week and Mnagagwa a few days ago vowed they will be held accountable. However, delivering his closing remarks after an Extraordinary Summit in Harare Friday, Mnangagwa urged all parties involved to stop fighting.\n\nIt is the individual and collective duty of all Member States to do much more toward permanently silencing the guns if we are to succeed in achieving these aspirations. Together, we must march forwardno one and no place should be left behind.\n\nTherefore, bold and decisive measures must continue to be implemented to adequately resource and equip our mission in the DRC so that it can effectively execute its mandate.\n\nFundamentally, all parties to the conflict are urged to pursue an inclusive dialogue and peaceful dispute resolution mechanisms, guided by the spirit and letter of both the Luanda Ceasefire Agreement and the Nairobi Peace Process.\n\nThe SADC chairman also extended a begging bowl to the international community to help the affected Congolese.\n\nThe international community is also called upon to scale up the provision of necessary humanitarian assistance to the affected population and to support ongoing peace and security efforts.\n\nThe regional bloc also called for an immediate joint summit of SADC and East African Community to deliberate on the way forward regarding the security situation in the DRC.\n\nMeanwhile, over 400,000 people in DRC have been displaced since the beginning of the year as a result of the clashes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/01055832/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Thandiwe Garusa THE Southern African Development Community (SADC) Chairman, President Emmerson Mnangagwa, who a few days ago vowed to take militant action against the Rwandan-backed Congolese March 23 Movement (M23) rebels, has softened his stance and made pleas for a peaceful resolution. At least 16 soldiers serving with SADC and UN peacekeeping forces in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-extraordinary-summit-mnangagwa-softens-stance-on-m23-rebels-begs-for-a-peaceful-solution-in-drc/\">SADC Extraordinary Summit: Mnangagwa softens stance on M23 rebels, begs for a peaceful solution in DRC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "Zimbabwe’s retail sector crisis worsens as shops continue closing; Finance minister laments ‘informalisation’ and proliferation of smuggled goods",
            "url": "https://www.newzimbabwe.com/zimbabwes-retail-sector-crisis-worsens-as-shops-continue-closing-finance-minister-laments-informalisation-and-proliferation-of-smuggled-goods/",
            "content": "By Staff Reporter\n\nTHE retail sector in Zimbabwe is faced with a crisis following the closure of several branches, including those of reputable retailers and wholesalers owing to myriad factors.\n\nThis Thursday, President Emmerson Mnangagwa interrupted his annual leave to chair an urgent meeting with senior government officials, amid an unabating collapse of Zimbabwes formal retail and wholesale sector.\n\nThe crisis indaba, attended by Vice Presidents Constantino Chiwenga and Kembo Mohadi as well as Economic Ministries.\n\nIn a statement after the crisis meeting, Finance Minister Mthuli Ncube lamented the growing informalisation of the economy and its effects on formal businesses.\n\nHis Excellency, the President, Dr. E.D. Mnangagwa, yesterday took time off his annual leave to chair a session on developments in the economy designed to map the way forward, Ncube said.\n\nThe session, which also included the two Vice Presidents and all Economic Ministries, deliberated on measures Government has taken on the economy, and developments in specific economic sectors, including the retail subsector. This culminated in additional measures being proposed.\n\nNcube said while Zimbabwe had seen economic growth averaging 5.5% annually since 2021, a slowdown of 2% in 2024largely due to an El Nio-induced droughthad impacted agriculture, electricity generation, and the broader economy.\n\nThe minister also admitted that the informalisation of the retail and wholesale sectors was a growing challenge.\n\nResearch and consultations indicate that some of the reasons formal businesses are experiencing distress include competition from the informal sector, poor management and poor corporate governance which have resulted in business failure in some instances.\n\nThe proliferation of smuggled importsmostly in reserved sectorssold exclusively in USD, and the high cost of doing business, among others, also contribute to the formal sector challenges, he said.\n\nTo combat these issues, Ncube outlined several measures, including the mandatory use of point-of-sale machines by informal traders, discouraging manufacturers from directly supplying the informal market, and the establishment of a Domestic Interagency Enforcement Team.\n\nGovernment will embark on an exercise to streamline regulatory processes, fees and charges, as well as duplication of work by Government Agencies, in order to reduce the cost of doing business, he added.\n\nFurther measures include enforcing compliance with the Indigenisation and Economic Empowerment Act, incentivizing industrialisation, and promoting local procurement.\n\nGovernment is committed to improving the business environment, in order to curb the informalisation of the economy, as we move towards Vision 2030, Ncube said.\n\nThe meeting came after Confederation of Zimbabwe Retailers (CZR) raised concern over the dire state of formal businesses, citing an unfavorable economic environment. CZR President Denford Mutashu highlighted challenges such as the dual currency system, regulatory burdens, and punitive taxes that have pushed consumers toward the informal sector.\n\nThe Financial Intelligence Unit (FIU) has penalized companies each time they deviated from the official exchange rate, despite suppliers insisting on cash payments at prevailing parallel market rates.\n\nThe crisis reflects broader economic challenges, though insiders suggest some recovery efforts are underway. As the government scrambles for solutions, the formal retail sector remains on the edge, posing a significant risk to Zimbabwes economic stability.\n\nMajor retailer such as Spar, OK Supermarkets, Choppies Zimbabwe, Surrey, among others, have either closed shop or downsized in the wake of adverse factors affecting viability of business.\n\nThe N. Richards Group has closed several outlets, while OK Zimbabwes shelves remain empty, unable to pay suppliers after the Reserve Bank of Zimbabwe mandated pricing at the official exchange rate. TM Pick n Pay, owing suppliers over US$40 million, is also under pressure.\n\nOK Zimbabwe is reportedly now restocking and poised for a comeback after the government allowed the company to adjust its pricing to mid-market rates, which will allow the retailer to settle supplier debts and replenish its stock.\n\nIn Chinhoyi, the Surrey branch closed this Friday resulting in the redundancy of at least 15 employees.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172602/OK-Mart.png",
            "description": "<p>By Staff Reporter  THE retail sector in Zimbabwe is faced with a crisis following the closure of several branches, including those of reputable retailers and wholesalers owing to myriad factors. This Thursday, President Emmerson Mnangagwa interrupted his annual leave to chair an urgent meeting with senior government officials, amid an unabating collapse of Zimbabwe’s formal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-retail-sector-crisis-worsens-as-shops-continue-closing-finance-minister-laments-informalisation-and-proliferation-of-smuggled-goods/\">Zimbabwe’s retail sector crisis worsens as shops continue closing; Finance minister laments ‘informalisation’ and proliferation of smuggled goods</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "Congolese have suffered for far too long — Mnangagwa pleads with SADC leaders to address DRC’s humanitarian crisis",
            "url": "https://www.newzimbabwe.com/congolese-have-suffered-for-far-too-long-mnangagwa-pleads-with-sadc-leaders-to-address-drcs-humanitarian-crisis/",
            "content": "By Thandiwe Garusa\n\nSOUTHERN African Development Community (SADC) Chairman, President Emmerson Mnangagwa has urged regional leaders to take immediate action to address the worsening humanitarian crisis in the Democratic Republic of Congo (DRC).\n\nMnangagwas call comes at a time when 16 soldiers serving as SADC and United Nations (UN) peacekeepers were killed by the Congolese March 23 Movement (M23) rebels this week.\n\nDelivering his opening remarks of the Extraordinary Summit in Harare, Friday Mnangagwa said the DRC situation must not be ignored.\n\nAs we deliberate on our firm and united response, let us not overlook the humanitarian crises stemming from the prevailing armed conflict in Eastern DRC.\n\nThe plight of the millions of internally displaced populations, cannot and should not, be ignored. SADC appreciates the support rendered by international cooperating partners, in response to the critical needs of the displaced populations.\n\nHowever, more must be done to alleviate the situation. The people of the eastern DRC have suffered for far too long, Mnangagwa said.\n\nThe SADC chair also denounced in strongest terms the attacks by the M23 rebels.\n\nFurther, SADC condemns in the strongest terms the attacks by aggressor forces. While we pause to mourn our loss, our resolve to ensure collective security cannot be shaken.\n\nThe importance of dialogue and peace building for the benefit of the people of the Eastern DRC must be boldly pursued.\n\nTo this end, our region stands ready to intensify efforts to protect the SADC citizens from all forms of instability, in line with the SADC Mutual Defence Pact, Mnangagwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31174300/SADC-head-of-states-scaled.jpg",
            "description": "<p>By Thandiwe Garusa  SOUTHERN African Development Community (SADC) Chairman, President Emmerson Mnangagwa has urged regional leaders to take immediate action to address the worsening humanitarian crisis in the Democratic Republic of Congo (DRC). Mnangagwa’s call comes at a time when 16 soldiers serving as SADC and United Nations (UN) peacekeepers were killed by the Congolese</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congolese-have-suffered-for-far-too-long-mnangagwa-pleads-with-sadc-leaders-to-address-drcs-humanitarian-crisis/\">Congolese have suffered for far too long — Mnangagwa pleads with SADC leaders to address DRC’s humanitarian crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "SADC Heads of States snub Extraordinary Summit on escalating DRC conflict",
            "url": "https://www.newzimbabwe.com/sadc-heads-of-states-snub-extraordinary-summit-on-escalating-drc-conflict/",
            "content": "By Staff Reporter\n\nONLY seven Heads of States and Government attended the Southern African Development Community (SADC) Extraordinary Summit aimed at tackling the worsening conflict in the Democratic Republic of Congo (DRC).\n\nOf the 15-member regional body, those who attended are Mozambiques President Daniel Chapo, Duma Boko of Botswana, Lesotho Prime Minister Samuel Matekani, Tanzanian President Sahamia Suluh, Madagascan President Andry Rajeolina, South Africa President Cyril Ramaphosa and host President Emmerson Mnangagwa.\n\nHakainde Hichilema of Zambia attended virtually while other countries including DRC sent representatives.\n\nGiving his opening remarks Elias Mgosi, the SADC executive secretary, applauded Mnangagwa for his swift action amid the ongoing tensions in Eastern DRC.\n\nWe extend our heartfelt gratitude to the Chairperson of SADC, His Excellency Dr E.D. Mnangagwa, the Government and the people of Zimbabwe for consistently stepping up to host our Heads of State and Government at such short notices.\n\nI also wish to thank all Heads of State and Government for sparing time from their very tight and demanding schedules to attend this crucial meeting.\n\nYour presence here today reflects your undeniable concern to the situation in DRC and the collective desire byyourselves for a swift and worthwhile intervention, at the highest level of our regional organisation.\n\nIn the last few weeks, we have witnessed intensified attacks by the M23 armed group on SAMIDRC and the Armed Forces of the DRC (FARDC) bases, leading to the loss of 16 members of our troops and multiple casualties, now more than 70.\n\nAll these attacks came against the backdrop of an agreed ceasefire, which was brokered through the Luanda Process led by His Excellency Joo Manuel Gonalves Loureno, President of the Republic of Angola and the African Union Champion for Peace and Reconciliation in Africa, he said.\n\nMagosi said with its consistent support for political and diplomatic interventions to resolve the conflict, SADC had hoped that the said ceasefire would yield a meaningful and visible cessation of hostilities in the Eastern DRC to preventmore losses and improve the dire humanitarian situation in the area.\n\nI wish to report, Your Excellencies, that I have been in constant communication with the leadership of the SAMIDRC including this morning, and we must appreciate that despite all devastating attacks on SAMIRDC operational bases, our troops have successfully defended their positions.\n\nWe commend the leadership of the SAMIDRC and the men and women who serve under the SAMIDRC for their resilience, commitment and devotion to the noble cause of restoring peace and security in the DRC, and the SADC region at large, he said.\n\nHe also passed condolences to all families who have since lost their loved ones in the current conflict.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/03081438/sadc-leaders.webp",
            "description": "<p>By Staff Reporter  ONLY seven Heads of States and Government attended the Southern African Development Community (SADC) Extraordinary Summit aimed at tackling the worsening conflict in the Democratic Republic of Congo (DRC). Of the 15-member regional body, those who attended are Mozambique’s President Daniel Chapo, Duma Boko of Botswana, Lesotho Prime Minister Samuel Matekani, Tanzanian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-heads-of-states-snub-extraordinary-summit-on-escalating-drc-conflict/\">SADC Heads of States snub Extraordinary Summit on escalating DRC conflict </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "Mnangagwa taken for a ride; Information Ministry and Perm Sec Mangwana pull down social media posts on Chikumbutso’s “fake invention”",
            "url": "https://www.newzimbabwe.com/mnangagwa-taken-for-a-ride-information-ministry-and-perm-sec-mangwana-pull-down-social-media-posts-on-chikumbutsos-fake-invention/",
            "content": "By Staff Reporter\n\nIn a rather embarrassing move, Nick Mangwana, the Permanent Secretary for Information, and the Ministry of Information, Publicity and Broadcasting Services have deleted all their posts on X celebrating Maxwell Chikumbutsos supposed groundbreaking technology at State House.\n\nIt seems they have realised that the inventor may have taken them for a mug, including President Emmerson Mnangagwa.Chikumbutsos inventions including the Saith FEV car, a hypersonic energy device, and motorbike designs powered by radio frequencies were paraded at State House on Wednesday. Mnangagwa had to cut short his national leave and rushed to the State House to see the inventions, showering praise on Chikumbutso.\n\nThis is the only vehicle (of its kind) that exists in the world, there is no other. This is the only vehicle in the world and it is in Zimbabwe. He (Mr Chikumbutso) is so gifted that you will not believe it. When he first came to talk to me, I thought he was not properly wired in his head, but I now know that he is well connected, Mnangagwa said.\n\nMnangagwa also claimed that the Americans had offered the Chikumbutso US$3 million to stay in the States and continue his work, but he refused.\n\nThey offered him US$3 million to stay there and told him to let them have their US$3 million, he added.\n\nThe Information Ministry also posted on its X account, lavishing praise on Chikumbutso.\n\nChikumbutso is an inventor, entrepreneur, and founder of Saith Technologies and Saith Motors. He made one of the worlds first cars that need no fuel, no recharging, no input. The Saith FEV is a full self-powering electric vehicle , which is powered entirely by radio waves.\n\nThis post has now been deleted.\n\nNick Mangwana, the Permanent Secretary for Information, who also posted praise for Chikumbutso, has also deleted his posts on X.\n\nIt appears that Chikumbutso has pulled a fast one on Mnangagwa and his government, similar to what Rotina Mavhunga did to Robert Mugabe and his Zanu-PF party, including cabinet ministers.\n\nMavhunga claimed that diesel was oozing from Maningwa Hills in Chinhoyi in 2007. Mavhunga, also known as Nomatter Tagarira, is a traditional healer and spirit medium. Mavhunga, who only had a grade 3 education, was found guilty of fraud and misleading government officials in 2010.\n\nZanu-PF government ministers, even removed their shoes during the visit to the rock in Chinhoyi, believing that ancestral spirits were making the rock produce refined diesel naturally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31090013/chikumbutso.webp",
            "description": "<p>By Staff Reporter In a rather embarrassing move, Nick Mangwana, the Permanent Secretary for Information, and the Ministry of Information, Publicity and Broadcasting Services have deleted all their posts on X celebrating Maxwell Chikumbutso’s supposed groundbreaking technology at State House. It seems they have realised that the inventor may have taken them for a mug,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-taken-for-a-ride-information-ministry-and-perm-sec-mangwana-pull-down-social-media-posts-on-chikumbutsos-fake-invention/\">Mnangagwa taken for a ride; Information Ministry and Perm Sec Mangwana pull down social media posts on Chikumbutso’s “fake invention”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "‘Big Brother Mzansi’ contestant Kay B disqualified for alleged sexual harassment",
            "url": "https://www.newzimbabwe.com/big-brother-mzansi-contestant-kay-b-disqualified-for-alleged-sexual-harassment/",
            "content": "TshisaLive\n\nIn a shocking turn of events,Big Brother Mzansiseason 5 contestant Florence Kay B Maphirime has been disqualified due to alleged sexual harassment of other housemates.\n\nMzansi Magic said a thorough investigation was conducted and it was deemed necessary to remove Kay B from the show to ensure the safety and wellbeing of the other contestants.\n\nIn light of a conversation in theBig Brother Mzansihouse concerning a housemate (Beekay) who said he was physically violated by fellow housemate (Kay B), Big Brother investigated the matter as the safety of all housemates is of utmost importance.\n\nAfter careful consideration, taking into account the serious nature of the claim, Big Brother has decided that the housemate (Kay B) will be disqualified from the Big Brother house. Her behaviour has caused serious offence to fellow housemates.\n\nThis decision follows an educational session held with all the housemates on Sunday to raise awareness about gender-based violence.\n\nWe do not condone any acts of gender-based violence and will take corrective action.\n\nAs a result, voting for this weeks eviction has also been closed as Kay B was one of the contestants up for eviction.\n\nThis is to ensure fairness and adhere to voting procedures for remaining housemates.\n\nThe disqualification comes as Kay B was already facing scrutiny for her behaviour in the house. Before her removal, Kay B apologised to her fellow housemates for her touchy behaviour, saying she is a naturally flirtatious person.\n\nThis is not the first time Kay B has been at the centre of controversy in theBig Brother Mzansihouse. Last week, two of her housemates, Ash-ley Ogle and Bonni B, came under fire for making insensitive remarks about Kay Bs past experience as a rape victim. The two housemates were given strikes and punishment for their behaviour and Bonni B was evicted from the show on Sunday.\n\nKay B, a 23-year-old model and student from Bloemfontein, had initially been eager to showcase her personality and talents on national TV, competing for the prize of R2m.\n\nI am talkative and loud  tapestry woven from diverse experiences, aspirations and influences emerging as an individual woman shaped by triumphs and tribulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31062725/kay-b.webp",
            "description": "<p>TshisaLive In a shocking turn of events, Big Brother Mzansi season 5 contestant Florence “Kay B” Maphirime has been disqualified due to alleged sexual harassment of other housemates. Mzansi Magic said a thorough investigation was conducted and it was deemed necessary to remove Kay B from the show to ensure the safety and wellbeing of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/big-brother-mzansi-contestant-kay-b-disqualified-for-alleged-sexual-harassment/\">‘Big Brother Mzansi’ contestant Kay B disqualified for alleged sexual harassment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "Migrant workers in Canada exposed to ‘shocking abuse and discrimination,’ Amnesty says",
            "url": "https://www.newzimbabwe.com/migrant-workers-in-canada-exposed-to-shocking-abuse-and-discrimination-amnesty-says/",
            "content": "CNN\n\nMigrant workers in Canada have been exposed to shocking abuse and discrimination while working under the countrys Temporary Foreign Worker Program (TFWP), according to a new report by Amnesty International.\n\nIn thereportpublished Thursday, Amnesty criticized the structure of Canadas TFWP, which allows employers to hire migrant workers for primarily low-paid jobs across sectors including agriculture, food processing, construction, and hospitality.\n\nThe human rights organization said laborers were vulnerable to abuse through harmful provisions in the program, including closed work permits that tie workers to a single employer who controls both their migration status and labor conditions.\n\nAmnesty interviewed 44 migrant workers from 14 countries for the report, predominantly from what it termed the Global South, with most workers reporting unpaid wages and excessive hours. Some workers told Amnesty their contracts stipulated zero rest days.\n\nOne woman from Cameroon, Bndicte, told Amnesty she had suffered racist psychological and sexual abuse at the hands of her employer while working on a two-year closed work permit on a farm.\n\nAfter leaving the farm in July 2018, her employer canceled her work permit, leaving Bndicte with an irregular migration status. I did not expect to be a slave here, she told Amnesty.\n\nAnother worker told Amnesty he faced severe forms of control by his employer.\n\nMiguel, a Guatemalan migrant worker with a two-year visa under the TFWP, told Amnesty he was threatened and surveilled. He said his boss confiscated his passport and placed cameras in the container where he lived and the garage where he worked.\n\nThe abuse experienced by migrant workers in Canada is deeply troubling, especially for a country that claims to be a leader when it comes to protecting human rights, Erika Guevara-Rosas, senior director for research, advocacy, policy and campaigns at Amnesty International, said.\n\nAmnesty also said many workers reported living in inadequate housing conditions, with a few saying they did not have drinking water in their accommodation.\n\nAn official at Amnesty International Canada, Ketty Nivyabandi, called on Canadas leaders to implement reforms to bring the program in line with Canadas human rights obligations  and, ultimately, to respect the rights of workers.\n\nThe Canadian government told CNN it was aware of the Amnesty report.\n\nThe government of Canada takes the safety and dignity of temporary foreign workers very seriously and has been taking strong action to protect workers, said Nancy Caron, the spokesperson for Immigration, Refugees, and Citizenship Canada (IRCC).\n\nWhile in Canada, temporary foreign workers have the same employment standards, rights, and protections under federal, provincial, and territorial law as do Canadian citizens and permanent residents.\n\nShe added the government was continuously taking steps to strengthen its temporary foreign worker programs, including programs to help workers obtain private health insurance, a tip line to report wrongdoing, and open work permits to allow temporary foreign workers to change employers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/31061912/gettyimages-1567046462.webp",
            "description": "<p>CNN Migrant workers in Canada have been exposed to “shocking abuse and discrimination” while working under the country’s Temporary Foreign Worker Program (TFWP), according to a new report by Amnesty International. In the report published Thursday, Amnesty criticized the structure of Canada’s TFWP, which allows employers to hire migrant workers for primarily low-paid jobs across sectors including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/migrant-workers-in-canada-exposed-to-shocking-abuse-and-discrimination-amnesty-says/\">Migrant workers in Canada exposed to ‘shocking abuse and discrimination,’ Amnesty says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        },
        {
            "title": "DRC conflict: Can Mnangagwa steer SADC through the storm?",
            "url": "https://www.newzimbabwe.com/drc-conflict-can-mnangagwa-steer-sadc-through-the-storm/",
            "content": "By Costa Nkomo\n\nAs Southern African leaders gather in Harare today to tackle the escalating conflict in the Democratic Republic of Congo, a critical question hangs in the air: is President Emmerson Mnangagwa the right captain to steer the regions response?\n\nMnangagwas leadership is coming under intense scrutiny as his own political party appears to be splitting.\n\nThe fault lines within Mnangagwas party, Zanu-PF, are deepening. Two factions, one staunchly backing him and the other rallying behind Vice President Constantino Chiwenga, are locked in a power struggle, a visible crack in the partys facade.\n\nThis internal strife spilled into the open this week during the burial of a national hero Justin Mupamhanga at the national shrine where factions clashed publicly. Despite Mnangagwas pledge to step down in 2028, his silence on those calling for him to extend his rule has only fueled doubt.\n\nThe DRC conflict itself is a tempest, and Mnangagwa finds himself in the thick of it, his hands seemingly tied by domestic turmoil. Whispers are turning into shouts: some of his own comrades are imploring him to leave office peacefully, failure to which he may go the Robert Mugabe way in November 2017.\n\nThe DRC conflict has already been worsened by public spats between South African President Cyril Ramaphosa and Rwandan President Paul Kagame.\n\nRamaphosas accusations of Rwandas support for M23 rebels met with Kagames vehement denial, have created a dangerous rift. South Africas loss of 13 soldiers in DRC has only heightened the tension. Kagame, in a display of fiery defiance, has even threatened to confront South Africa militarily if it chooses confrontation.\n\nRELATED:\n\nObert Masaraure, a human rights defender and president of the Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ), is blunt in his observation.\n\nWhat is happening right now in Zanu PF is a clear testimony of Emmerson Mnangagwas failure to calm storms in his own party. His party is in turmoil as factions are gunning for each others head.\n\nHow then can he manage to lead the regions response to the DRC conflict? He does not have the capacity. Why is he failing to sit down with his comrades whom he went to war with and make peace? queried Masaraure.\n\nMasaraure further painted Mnangagwa as a man who creates problems but cannot solve them.\n\nHe is a man who creates problems but cannot solve the same. He created problems in Mozambique and he has created economic hardships and political conflict in the country. The man has many problems to deal with. The DRC conflict is too much for him. President Ramaphosa is the one who is now acting as if is the SADC chair, he said.\n\nAdvocate Fadzayi Mahere took to X Thursday, demanding that Information Permanent Secretary Nick Mangwana clarify Zimbabwes official stance on the escalating DRC conflict. She pointedly highlighted the divergent positions taken by South Africa, Rwanda, and even Kenya.\n\nWhose side are we on? she questioned, Or are we neutral? Or, worse, are we indifferent?\n\nMangwana did not respond to Mahere.\n\nHowever, Zanu-PF communications director, Farai Marapira, defended Mnangagwa, dismissing his critics as having put wool over their eyes and conveniently forgetting Zimbabwes history of conflict resolution.\n\nThey clearly have chosen to put wool over their eyes because they have conveniently forgotten the role Zimbabwe played in the late 1990s. Under the leadership of President Mnangagwa, Zimbabwe and SADC is more than equal to the task, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26042227/mnangagwa-sadc.jpg",
            "description": "<p>By Costa Nkomo As Southern African leaders gather in Harare today to tackle the escalating conflict in the Democratic Republic of Congo, a critical question hangs in the air: is President Emmerson Mnangagwa the right captain to steer the region’s response? Mnangagwa’s leadership is coming under intense scrutiny as his own political party appears to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/drc-conflict-can-mnangagwa-steer-sadc-through-the-storm/\">DRC conflict: Can Mnangagwa steer SADC through the storm?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "01 Feb 2025"
        }
    ]
}