{
    "news": [
        {
            "title": "ZBC appoints Sugar Chagonda as CEO",
            "url": "https://www.newzimbabwe.com/zbc-appoints-sugar-chagonda-as-ceo/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Broadcasting Corporation (ZBC) has appointed veteran broadcaster Sugar Chagonda as its Chief Executive Officer (CEO).\n\nHis appointment comes after a series of interim leadership changes following the departure of Adelaide Chikunguru under controversial circumstances last year.\n\nChagondas return to the national broadcaster marks a full-circle moment, having worked at ZBC as a reporter and news anchor.\n\nZBC confirmed Chagondas appointment, saying his expertise will transform the public broadcaster.\n\nThe Zimbabwe Broadcasting Corporation (ZBC) Board of Directors is pleased to announce the appointment of Mr. Sugar Chagonda as the substantive Chief Executive Officer (CEO) of the national broadcaster, effective August 1, 2025.\n\nA distinguished media strategist and corporate affairs expert, Mr. Chagonda brings a wealth of experience, intellectual rigour and transformative leadership to ZBC.\n\nMr. Chagondas illustrious career spans over two decades, marked by strategic foresight and an unrelenting dedication to organisational growth, read the statement.\n\nChagonda faces an uphill task of transforming ZBC into a viable entity after it emerged that the public broadcaster is haunted by mismanagement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04122229/Sugar-Chagonda.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Broadcasting Corporation (ZBC) has appointed veteran broadcaster Sugar Chagonda as its Chief Executive Officer (CEO). His appointment comes after a series of interim leadership changes following the departure of Adelaide Chikunguru under controversial circumstances last year. Chagonda’s return to the national broadcaster marks a full-circle moment, having worked at ZBC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zbc-appoints-sugar-chagonda-as-ceo/\">ZBC appoints Sugar Chagonda as CEO </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "04 Aug 2025"
        },
        {
            "title": "ZANU PF admits Tagwirei into Central Committee amid deepening factionalism – Chinamasa says decision irreversible",
            "url": "https://www.newzimbabwe.com/zanu-pf-admits-tagwirei-into-central-committee-amid-deepening-factionalism-chinamasa-says-decision-irreversible/",
            "content": "By Staff Reporter\n\nZANU PF Legal Secretary Patrick Chinamasa has said controversial businessman Kudakwashe Tagwirei is now a member of the partys Central Committee and the matter is over and irreversible.\n\nTagwireis co-option into the Central Committee has dragged on, with a faction within the ruling party reportedly opposed to his endorsement into the influential organ.\n\nIn a statement posted on socialmedia, Chinamasa said, The Zanupf Department of Legal Affairs is relieved and takes note that the furore/controversy/confusion/wrangle/much ado about nothing/social media hype/misinformation/disinformation that surrounded Harare Provincial Coordinating Committee (PCC) co-option of Cde Kudakwashe Tagwirei into the Zanu PF Central Committee is now over and irreversibly settled.\n\nFrom the outset, it was difficult to understand the source of the problem. Our Harare PCC convened on Monday, 31 March 2025, and voted to recommend the cooption of Cde Tagwirei into the Central Committee.\n\nThe Province addressed the letter of recommendation to the Zanupf Secretary General, Cde Dr. Obert Moses Mpofu. The letter was copied to the Departments of the Commissariat and Legal Affairs, amongst others.\n\nThe confirmation by Chinamsa is in contradiction with the ZANU PF spokesperson Christopher Mutsvangwasremarks earlier this month that Tagwireis bribe would not work in the party.\n\nTagwireis admission into this elite structure is being widely interpreted as part of a long-term strategy to position him for a future presidential bid, setting him on a collision course with other factions, particularly those aligned with Vice President Constantino Chiwenga.\n\nThe ZANU PF benefactor has been viewed as exploiting his proximity to President Emmerson Mnangagwa to push his leadership agenda.\n\nChinamasa acknowledged that the co-option of Tagwirei has been divisive in the ruling party.\n\nSo the controversy surrounding Cde Tagwireis co-option into the Central Committee surprises me and took me completely off guard. Given Cde Tagwireis commitment to Zanupf and his track record in the service of the Party, the somewhat negative publicity and narrative surrounding his co-option into the Central Committee is undeserved.\n\nI have been a member of the Zanupf Central Committee continuously and without break since December 1987, and a member of the Zanupf Politburo since the year 2000 to date, and I can state unequivocally that throughout this long period of nearly 38 years as Central Committee or as Politburo, we have never had to debate, let alone discuss, PCC recommendations of cooptions into the Central Committee. We always treated such recommendations as fait accompli.\n\nThe cooption of Cde Tagwirei is the first ever to be the subject of discussion and social media commentaries. The only explanation why the Tagwirei cooption has attracted such controversy may be because there are people out there who, for reasons best known to themselves, have an axe to grind, said Chinamasa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter ZANU PF Legal Secretary Patrick Chinamasa has said controversial businessman Kudakwashe Tagwirei is now a member of the party’s Central Committee and the matter is “over and irreversible”. Tagwirei’s co-option into the Central Committee has dragged on, with a faction within the ruling party reportedly opposed to his endorsement into the influential</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-admits-tagwirei-into-central-committee-amid-deepening-factionalism-chinamasa-says-decision-irreversible/\">ZANU PF admits Tagwirei into Central Committee amid deepening factionalism – Chinamasa says decision irreversible  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "04 Aug 2025"
        },
        {
            "title": "Edgar Lungu repatriation matter back in the High Court in Pretoria",
            "url": "https://www.newzimbabwe.com/edgar-lungu-repatriation-matter-back-in-the-high-court-in-pretoria/",
            "content": "SABC News\n\nThe impasse over the final resting place offormer Zambian President Edgar Lunguheads back to the High Court in Pretoria today for a final determination on the matter.\n\nThe Zambian government is seeking declaratory relief, which would entitle it the right to repatriate the former Presidents body to Zambia for a state funeral and burial in Embassy Park, Lusaka.\n\nLungus burial, which was set to take place in June this year, was interdicted (by agreement between parties) pending the final determination of this issue.\n\nThe Zambian government charges in papers that while former President Lungus benefits were suspended when he became engaged in active politics, that impediment fell away upon his passing.\n\nAs a result, Lungu became entitled to a state funeral and the Zambian government acquired the right to accord him such.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>SABC News The impasse over the final resting place of former Zambian President Edgar Lungu heads back to the High Court in Pretoria today for a final determination on the matter. The Zambian government is seeking declaratory relief, which would entitle it the right to repatriate the former President’s body to Zambia for a state funeral and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/edgar-lungu-repatriation-matter-back-in-the-high-court-in-pretoria/\">Edgar Lungu repatriation matter back in the High Court in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "04 Aug 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Compulsory Land Acquisition and Compensation by the State in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-compulsory-land-acquisition-and-compensation-by-the-state-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, there was a recent landmark judgment in the Zimbabwe Courts on land acquisition and compensation by the government which may affect some acquired land, what was the case about?\n\nVM: Yes, there was indeed a landmark constitutional judgment delivered on 29thJuly, 2025 in Alistair Michael Fletcher v Minister of Lands, Agriculture, Fisheries, Water and Rural Development and others.\n\nWell, I will attempt to summarise the facts. The land in question is in Umguza on the peripheries of Bulawayo City. It was incorporated into the City of Bulawayo through a statutory instrument issued by the President in 1999. Sometime in 2000, the land was subsequently gazetted for acquisition by the State under the land reform program and caveats were placed on the title deeds to perfect the acquisition.\n\nThe main issue for contention was whether or not the land was capable of acquisition under the land reform program which targeted agricultural land, as the land had become urban land by means of the statutory instrument of 1999, I referred to and various correspondence from the Bulawayo City Council which referred to it and adjacent lands as urban territory.\n\nReporter: At face value, it appears simple enough, what where the main areas of contention?\n\nVM: It may appear so, however, there was a conflict in the understanding and application of various constitutional provisions. Main being the interpretation of S16B (2) of the old constitution which limited the rights of individual to challenge the acquisition of land for agricultural purposes after it has been gazetted and conversely, the rights of the courts to adjudicate on such cases where land was acquired under the land reform process. S16B (3) of the same constitution reserved judicial review powers with the courts where expropriation was not in terms of section 16 B(2) as was eventually decided in this case. The other constitutional questions which had to be decided included the right to hold, use and not be deprived of property and the right to equal protection and benefit of the law in situations where the application of s16B(2)a was challenged, which section is now s72 of the new constitution.,\n\nReporter: What was the decision of the court and its reasoning?\n\nVM: The Constitutional Court agreed with the decision of the High Court that the land in question was urban land by virtue of it being classified as such by law and the City of Bulawayo, that being so, the State cannot compulsorily acquire urban land without compensation by using the constitutional provisions reserved for land reform acquisitions.\n\nCompensation in land reform acquisitions is limited to improvements made on land.\n\nIn reaching its decision, the court considered the meaning of agricultural land in terms of the constitution and whether Mr. Fletchers land can be classified as agricultural land. It also considered its own jurisdiction to hear the matter on the basis of whether the land in question was agricultural or urban land.\n\nReporter: What are the key takeaways from this judgment?\n\nVM: Key takeaways are that the land reform constitutional provisions ousting the authority of the courts to hear and determine acquired land refer only to agricultural land.\n\nThe courts still retain the right to hear cases to confirm whether such acquisition was done in terms of the constitutional provisions and for cases referring to compensation of improvements.\n\nThe courts also upheld the constitutional provisions relating to right to property and equal access to the courts for all urban land.\n\nThe other takeaway is not mentioned in the judgment but is necessary as it reasserts the position that our court system still functions; this is a clear case separating the government and judiciary in their interpretation of the law.\n\nReporter: How will this judgment affect owners of tracts of land in periurban areas?\n\nVM: In my view, it brings certainty that once land is classified as urban land, it is not capable of compulsory acquisition under the land reform program or acquisition without compensation. It will assist developers and investors in their planning, knowing there is precedent from the highest court securing property rights\n\nReporter: Thank you, Mr. Madzima, we have to end here because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/03200530/Newzimbabwe.com-Artwork-750x500_20250803_202914_0000.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, there was a recent landmark judgment in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-compulsory-land-acquisition-and-compensation-by-the-state-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Compulsory Land Acquisition and Compensation by the State in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "04 Aug 2025"
        },
        {
            "title": "Nigerian man who identified as a Zimbabwean national denied spousal permit",
            "url": "https://www.newzimbabwe.com/nigerian-man-who-identified-as-a-zimbabwean-national-denied-spousal-permit/",
            "content": "By Sinenhlanhla Masilela l IOL News\n\nA NIGERIAN man who also identified as a Zimbabwean national had his application for spousal permit dismissed in an unopposed matter.\n\nIn an application at the North Gauteng High Court in Pretoria, Valentine Ezihe submitted an affidavit under the name Marshall Banda. In the affidavit, he identified himself as a Zimbabwean man living in Centurion, possessing a Zimbabwean passport with an unverified number.\n\nAccording to the supporting affidavit, Ezihes spousal application had been pending for two years without a response or decision from Home Affairs.\n\nIn June 2025, he served a notice of motion on home affairs and the director general of home affairs.\n\nEzihe asked the court to direct home affairs officials to issue a decision on the outcome of his application within 30 days.\n\nIn May 2025, Bandas affidavit, which claimed to be from Ezihe, was deposed and commissioned to support the notice of motion.\n\nLater, Ezihes supplementary affidavit, which supports Bandas affidavit, was deposed and commissioned in June 2025. This occurred without the prior leave of the court.\n\nEzihes legal representative argued that there were no legal provisions requiring the parties to obtain leave before supplementing their court submissions.\n\nHowever, Judge Keitumetse Johanna Mogale said the decision to permit the filing of an additional affidavit remains within the courts discretion.\n\nJudge Mogale said if affidavits are filed without leave from the court, the affidavits can be ignored.\n\nI conclude that supplementing court papers without prior leave from the court is not allowed. Disregarding rules governing the filing of affidavits can result in the affidavit being struck from the record or the court refusing to consider it, she said.\n\nFurthermore, the judge was not impressed with the application and said it was drafted as a cut-and-paste from a template.\n\nShe further criticised Ezihes legal representative for failing to comply with procedural standards.\n\nMs. Hadebe bears the duty to uphold professional integrity in her dealings with the client, the court, and in all professional interactions, said judge Mogale.\n\nTherefore, it is my view that the applicant (Ezihe) has failed to make out a proper case for an order compelling the respondents (home affairs officials) to issue the outcome of the applicants spousal permit application, she said.\n\nEzihes application was dismissed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/15225721/SA-Home-Affairs2.jpg",
            "description": "<p>By Sinenhlanhla Masilela l IOL News A NIGERIAN man who also identified as a Zimbabwean national had his application for spousal permit dismissed in an unopposed matter. In an application at the North Gauteng High Court in Pretoria, Valentine Ezihe submitted an affidavit under the name Marshall Banda. In the affidavit, he identified himself as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-man-who-identified-as-a-zimbabwean-national-denied-spousal-permit/\">Nigerian man who identified as a Zimbabwean national denied spousal permit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "04 Aug 2025"
        },
        {
            "title": "COP15 concludes with enhanced global resolve to wetland conservation",
            "url": "https://www.newzimbabwe.com/cop15-concludes-with-enhanced-global-resolve-to-wetland-conservation/",
            "content": "By Xinhua\n\nTHE 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) concluded Thursday in the resort city of Victoria Falls, Zimbabwe, with an increased global commitment to wetland conservation.\n\nThe COP15 ran under the theme of Protecting Wetlands for Our Common Future, drawing government representatives to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.Adopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.Related parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nThe COP15 ran under the theme of Protecting Wetlands for Our Common Future, drawing government representatives to highlight the vital role of wetlands in sustaining ecological health, biodiversity, and climate resilience.\n\nAdopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.Related parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nAdopted resolutions at COP15 include accelerating national and regional actions, enhancing monitoring and reporting, capacity building and mobilization of resources for wetlands conservation, and mainstreaming the wetlands into climate adaptation and disaster risk reduction, among others.\n\nRelated parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.A key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nRelated parties also agreed to strengthen flyway conservation efforts to protect migratory birds, endorsed the establishment of the Global Waterbird Estimates Partnership, and recognized the importance of conserving river dolphins and other inland wetland indicator species.\n\nA key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.In her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nA key outcome of COP15 was the Victoria Falls Declaration, which emphasised the need for increased resource mobilisation, political commitment, and investment in wetland protection and restoration.\n\nIn her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.Ndlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nIn her closing remarks, COP15 President and Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu urged all contracting parties to embed the commitments of COP15 into national policies and strategies.\n\nNdlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.We also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nNdlovu called for international cooperation and financial mechanisms to close the resource gap for wetland restoration and protection.\n\nWe also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.This will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nWe also call upon strengthening of synergies with other multilateral environmental agencies and agreements to enable us to address complex, interconnected environmental challenges like climate change, plastic and mercury pollution more effectively and efficiently, she said.\n\nThis will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\nThis will help us simplify our collective influence on global environmental protection and improve outcomes for ecosystems and human health, while fostering innovation and shared learning for all, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>By Xinhua THE 15th Meeting of the Conference of the Contracting Parties to the Ramsar Convention on Wetlands (COP15) concluded Thursday in the resort city of Victoria Falls, Zimbabwe, with an increased global commitment to wetland conservation. The COP15 ran under the theme of “Protecting Wetlands for Our Common Future,” drawing government representatives to highlight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cop15-concludes-with-enhanced-global-resolve-to-wetland-conservation/\">COP15 concludes with enhanced global resolve to wetland conservation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:12",
            "date": "04 Aug 2025"
        }
    ]
}