{
    "news": [
        {
            "title": "‘Kwinji 15’ makes history, becomes first female CAF-certified instructor in Zimbabwe",
            "url": "https://www.newzimbabwe.com/kwinji-15-makes-history-becomes-first-female-caf-certified-instructor-in-zimbabwe/",
            "content": "By Sports Reporter\n\nMIGHTY Warriors head coach Sithethelilwe Kwinji 15 Sibanda has become the first female Confederation of African Football (CAF) instructor from Zimbabwe in history after attaining her certificate.\n\nKwinji recently completed her CAF Women Instructor Development Programme early this month and will now train other coaches under CAF.\n\nAccording to CAF, Kwinji 15 can now deliver coaching courses up to CAF B.\n\nWe are delighted to confirm that Instructor Sithethelelwe Sibanda participated fully in both the online and in-person phases of the programme.\n\nBased on her performance and evaluations conducted by CAF-appointed technical experts, Instructor Sithethelelwe Sibanda has demonstrated the competence and readiness to deliver CAF coaching courses up to the CAF B License level and to assist in the delivery of the CAF A License course, read part of CAFs letter to ZIFA.\n\nSibanda is the only Zimbabwean female coach with a CAF A licence, and her latest elevation is a milestone in her ever growing coaching career.\n\nThe former Mighty Warriors midfielder led the history making Zimbabwe senior womens football team as an assistant coach at the 2016 Rio Olympics.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24011009/Sithethelelwe-%E2%80%98%E2%80%98Kwinji-15-Sibanda.jpg",
            "description": "<p>By Sports Reporter MIGHTY Warriors head coach Sithethelilwe “Kwinji 15” Sibanda has become the first female Confederation of African Football (CAF) instructor from Zimbabwe in history after attaining her certificate. Kwinji recently completed her CAF Women Instructor Development Programme early this month and will now train other coaches under CAF. According to CAF, Kwinji 15</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwinji-15-makes-history-becomes-first-female-caf-certified-instructor-in-zimbabwe/\">‘Kwinji 15’ makes history, becomes first female CAF-certified instructor in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Dynamos being run like a tuck-shop says fuming supporters",
            "url": "https://www.newzimbabwe.com/dynamos-being-run-like-a-tuck-shop-says-fuming-supporters/",
            "content": "By Darlington Gatsi\n\nDYNAMOS fans have declared war on club owner Bernard Marriot and his executive, vowing to protest against the maladministration that has seen the Harare giants slide into murky waters.\n\nThe fading Harare side find themselves in a quagmire days before they face old foes Highlanders on Sunday at Rufaro Stadium, with fan unrest threatening to overshadow the encounter.\n\nDynamos supporters are demanding sweeping reforms at the club, which they argue will address the troubles burdening the 22-time league champions.\n\nTeam loyalists are threatening to boycott the Highlanders match as they demand Marriot fire the board, led by Moses Maunganidze, whom they accuse of incompetence and unprofessionalism.\n\nAddressing the media in Harare Thursday, Dynamos Harare Chapter Organising Secretary Robetho Machovo said the deterioration at the club had reached alarming levels, prompting the boycott.\n\nWe are frustrated by the current state of affairs at our beloved club Dynamos. The mismanagement by the Dynamos executive led by Bernard Marriot, his relatives, and the so-called NEC has reached a boiling point, said Machovo.\n\nDynamos continue to sink deeper, currently occupying the relegation zone, separated by only two points from Kwekwe United, who sit at the basement of the table.\n\nDeMbare have managed just one win in 13 matches, scoring only two goalsa record that has sparked fury among supporters.\n\nThe struggles have been attributed to poor recruitment and the general welfare of players at the club.\n\nMachovo accused Dynamos leadership of running the club with an amateurish, and an outdated approach.\n\nWe can no longer remain silent. Our key concerns is the tuck shop mentality, outdated approach and sponsorship failure, said Machovo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Darlington Gatsi DYNAMOS fans have declared war on club owner Bernard Marriot and his executive, vowing to protest against the maladministration that has seen the Harare giants slide into murky waters. The fading Harare side find themselves in a quagmire days before they face old foes Highlanders on Sunday at Rufaro Stadium, with fan</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-being-run-like-a-tuck-shop-says-fuming-supporters/\">Dynamos being run like a tuck-shop says fuming supporters</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "SRC suspends Zimbabwe Netball Association president",
            "url": "https://www.newzimbabwe.com/src-suspends-zimbabwe-netball-association-president/",
            "content": "By Sports Reporter\n\nTHE Sports and Recreation Commission (SRC) has suspended the Zimbabwe Netball Association (ZINA) president Lecitica Chipandu.\n\nIn a letter SRC said Chipandus suspension comes after an investigation conducted following several allegations against her.\n\nThe Sports and Recreation Commission (SRC) wishes to advise the public and netball stakeholders that the president of the Zimbabwe Netball Association (ZINA) Mrs Leticia Chipandu has been suspended as an official responsible for the stewardship and strategic direction of the Zimbabwe Netball Association, and from all forms of netball administration in Zimbabwe with immediate effect.\n\nThe suspension is as result of the investigations conducted by the SRC on the challenges prevailing within the Zimbabwe Netball Association administration and structures, reads part of SRC press release.\n\nChipandu reigned as the Zimbabwe netball boss since 2007 and is the associations longest serving leader.\n\nDuring her tenure, Chipandu has faced several allegations, amongst them embezzlement of 2019 Liverpool World Cup funds for the players.\n\nSRC further stated that Chipandus suspension shall stand until ZINA holds its next elections.\n\nThis is in terms of Section 30(1)(c)(i) as read with Section 19(a), (b) and (c) and paragraph 23 of the second schedule of the Sports and Recreation Act (Chapter 25:15) and shall subsist until such a time when the next ZINA elections are held, further read SRC letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31061320/ZINA-president-Leticia-Chipandu.webp",
            "description": "<p>By Sports Reporter THE Sports and Recreation Commission (SRC) has suspended the Zimbabwe Netball Association (ZINA) president Lecitica Chipandu. In a letter SRC said Chipandu’s suspension comes after an investigation conducted following several allegations against her. “The Sports and Recreation Commission (SRC) wishes to advise the public and netball stakeholders that the president of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/src-suspends-zimbabwe-netball-association-president/\">SRC suspends Zimbabwe Netball Association president</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 May 2025"
        },
        {
            "title": "Airforce of Zimbabwe pilot killed as fighter jet crashes",
            "url": "https://www.newzimbabwe.com/airforce-of-zimbabwe-pilot-killed-as-fighter-jet-crashes/",
            "content": "By Staff Reporter\n\nA TRAGIC incident has struck the Zimbabwe Defence Forces (ZDF) family following the crash of an Airforce of Zimbabwe (AFZ) F-7 fighter aircraft in the Wazheri general area, along the Gweru-Mvuma Road.\n\nThe crash resulted in the death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube, a highly respected and experienced pilot.\n\nThe aircraft is said to have been engaged in a routine sortie procedure when the accident occurred.\n\nIn a statement following the accident, ZDF Commander, General Philip Valerio Sibanda, expressed deep sorrow over the loss.\n\nThe Zimbabwe Defence Force have learnt, with heavy hearts, of the passing of a proficient and highly experienced pilot, Squadron Leader Ncube after an aircraft accident. Right now, our thoughts and prayers are with the family of the deceased pilot, said Sibanda.\n\nIn the meantime, investigations are underway to establish the causes of the accident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31060834/Retired-Squadron-Leader-Ritswanetsi-Vuyo-Ncube.jpeg",
            "description": "<p>By Staff Reporter A TRAGIC incident has struck the Zimbabwe Defence Forces (ZDF) family following the crash of an Airforce of Zimbabwe (AFZ) F-7 fighter aircraft in the Wazheri general area, along the Gweru-Mvuma Road. The crash resulted in the death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube, a highly respected and experienced pilot. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/airforce-of-zimbabwe-pilot-killed-as-fighter-jet-crashes/\">Airforce of Zimbabwe pilot killed as fighter jet crashes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "31 May 2025"
        }
    ]
}