{
    "news": [
        {
            "title": "Former cop and socialite Chidawa in trouble over ‘illegal’ disciplinary camp",
            "url": "https://www.newzimbabwe.com/former-cop-and-socialite-chidawa-in-trouble-over-illegal-disciplinary-camp/",
            "content": "By Mary Taruvinga\n\nFORMER police officer, Tafadzwa Chidawa is once again in trouble with the law for allegedly operating a disciplinary camp without authority.\n\nHis camp Matrix Disciplinary Training Camp has been making waves on social media.\n\nTafadzwa Chidawa\n\nThe 36-year-old socialite and private investigator appeared before a Harare magistrate jointly charged with one Clara Manyepera (38).\n\nThe two are also being charged with impersonation of child protection officers.\n\nChidawa and Manyepera appeared at the Harare Magistrates Court for their initial remand, and investigations are ongoing. They were granted US$300 each and will be back in court on April 20 for routine remand.\n\nThe State alleges that the two established and operated the camp without the necessary registration and licensing required by the Private Voluntary Organisations Act.\n\nThe camp, located at Number 2165 Tokwane Close, reportedly aimed to rehabilitate children with delinquency issues, and authorities claim that the two admitted youths into the camp from December 6, 2023, onwards.\n\nFurthermore, the State alleges that, during the camps operation, the duo impersonated child protection officers.\n\nThis involved offering services legally reserved for qualified individuals, including measures for observing and correcting behaviours contributing to delinquency, and providing counselling, supervision, and control, said the National Prosecuting Authority.\n\nProsecutors say the two acted unlawfully, thereby breaking the Childrens Act.\n\nThe State is in possession of video footage of the pair conducting training sessions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga FORMER police officer, Tafadzwa Chidawa is once again in trouble with the law for allegedly operating a disciplinary camp without authority. His camp Matrix Disciplinary Training Camp has been making waves on social media. The 36-year-old socialite and “private investigator” appeared before a Harare magistrate jointly charged with one Clara Manyepera (38).</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-cop-and-socialite-chidawa-in-trouble-over-illegal-disciplinary-camp/\">Former cop and socialite Chidawa in trouble over ‘illegal’ disciplinary camp</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Frank Makarati returns to Rufaro for a clash against former paymasters Dynamos",
            "url": "https://www.newzimbabwe.com/frank-makarati-returns-to-rufaro-for-a-clash-against-former-paymasters-dynamos/",
            "content": "By Sports Reporter\n\nFOR Frank Makarati, Tel Ones match against Dynamos this Saturday afternoon at Rufaro Stadium will be more than just a match.\n\nThe 31-year-old defender will be up to face his former pay masters for the first time since parting ways with them in December 2024.\n\nHaving served Dembare for three years, Makarati knows it too well that all eyes will be on him this Saturday, hence he is prepared to for anything on the day.\n\nI know the Dynamos fans will create a hostile atmosphere, but its normal in football when playing such a big team.\n\nIndividually l am not under any pressure because l am used to that pressure when l was playing for them (Dembare), Makarati told NewZimbabwe.com.\n\nHaving been voted on to the 2023 Soccer Star of the Year calendar playing for Dynamos, Makarati admitted that walking on to the pitch representing an opponent side will be emotional.\n\nIts going to be emotional but thats football, l am now a Tel One player and l have to do my job for my new employer, he added.\n\nTel Ones trip to Harare comes a fortnight after they were handed a 2-1 defeat against Herentals at the same venue in their 2025 season league opener.\n\nFresh from a 4-1 win over league returnees Triangle, the former Dynamos captain is confident that his side will pick a positive result this weekend.\n\nLast week, we got a win and that gives us a lot of confidence.\n\nIf we check the way we played, it shows we are going in the right direction and l think everyone is ready to go and we eye another positive result, said Makarati.\n\nDynamos will be hoping to register its first win of the season against Tel One following two consecutive goalless draws against ZPC Kariba and Herentals.\n\nDembare is one the four teams yet to score a goal this season, however, they also boast of being one of the three teams yet to concede a goal.\n\nMATCHDAY 3 FIXTURES\n\nSATURDAY 15TH MARCH 2025\n\nSIMBA BHORA FC vs HERENTALSCOLLEGE FC (Wadzanai Stadium)\n\nDYNAMOS FC vs TELONE FC (Rufaro Stadium)\n\nCHICKEN INN FC vs FC PLATINUM (Luveve Stadium)\n\nMWOS vs YADAH FC (Baobab Stadium)\n\nKWEKWE UNITED FC vs BIKITA MINERALS FC (Bata Stadium)\n\nGREENFUEL FC vs HIGHLANDERS FC (Green Fuel Arena)\n\nSUNDAY 16TH MARCH 2025\n\nMANICA DIAMONDS FC vs ZPC KARIBA FC (Sakubva Stadium)\n\nTRIANGLE UNITED FC vs CAPS UNITED FC (Gibbo Stadium).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/14190133/Frank-Makarati.jpg",
            "description": "<p>By Sports Reporter  FOR Frank Makarati, Tel One’s match against Dynamos this Saturday afternoon at Rufaro Stadium will be more than just a match. The 31-year-old defender will be up to face his former pay masters for the first time since parting ways with them in December 2024. Having served Dembare for three years, Makarati</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/frank-makarati-returns-to-rufaro-for-a-clash-against-former-paymasters-dynamos/\">Frank Makarati returns to Rufaro for a clash against former paymasters Dynamos</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "High Court throws out Mabvirakure’s application seeking to block Matiza from environment project",
            "url": "https://www.newzimbabwe.com/high-court-throws-out-mabvirakures-application-seeking-to-block-matiza-from-environment-project/",
            "content": "By Staff Reporter\n\nTHE High Court has thrown out an application by Green Rebirth Trust run by Nadia Vongai Mabvirakure, who was seeking to elbow Joel Matiza from the project.\n\nSitting at the Harare High Court, Justice Happias Zhou in a brief judgement dismissed the application on March 12 with a full judgement yet to be released.\n\nWhereupon after reading documents filed of record and hearing counsel, the application be and is hereby dismissed,  read Zhous order.\n\nThe project focusing on tree planting is under implementation in Murehwa.\n\nMatiza, who is Zanu PF secretary for environment, was cited as a respondent together with one Tichabaiwa Gwadu and Familia Muvhimwa.\n\nIn court papers, Mabvirakare had alleged that between September and November 2024, she received donations from several benefactors, including Matiza towards the tree nursery project.\n\nShe further claimed that on February 27, 2025, the respondents acting in concert went to her farm and forcibly took control of the same effectively dispossessing her.\n\nApplicant has further learnt that the respondents are holding themselves out as the owners of the project and are attempting to sell off the projects nursery stock to a third party without the applicants consent or participation.\n\nRespondents have barred the applicant from accessing its farming location and from continuing its operations thereat, the applicant is fearful that the respondents will sell off its nursery stock and make off with proceeds to the applicants detriment, Mabvirakure claimed.\n\nApplicant seeks an order restoring its full and undisturbed possession of the farming location as well as an interdict barring the respondent from entering the mining location and from marketing, removing, or otherwise dealing with the nursery stock at said location pending the return date.\n\nShe said she will suffer irreparable harm if this court does not intervene urgently.\n\nMabvirakare said the respondents are poised to dispose of the nursery stock at applicants farm to applicants exclusion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12075441/Nadia-Mabvirakare-e1741762685138.jpeg",
            "description": "<p>By Staff Reporter  THE High Court has thrown out an application by Green Rebirth Trust run by Nadia Vongai Mabvirakure, who was seeking to elbow Joel Matiza from the project. Sitting at the Harare High Court, Justice Happias Zhou in a brief judgement dismissed the application on March 12 with a full judgement yet to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-throws-out-mabvirakures-application-seeking-to-block-matiza-from-environment-project/\">High Court throws out Mabvirakure’s application seeking to block Matiza from environment project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "CCC councillor set free following arrest for ‘insulting Mnangagwa’ as charges withdrawn",
            "url": "https://www.newzimbabwe.com/ccc-councillor-set-free-following-arrest-for-insulting-mnangagwa-as-charges-withdrawn/",
            "content": "By Staff Reporter\n\nTHE National Prosecuting Authority has withdrawn charges against Chivhu Ward 12 Citizens Coalition for Change (CCC) councillor Ishmael Maukazuva, who was arrested Wednesday for allegedly insulting President Emmerson Mnangagwa.\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR), who represented him, said Maukazuva was facing charges under the Data Protection Act for sharing a TikTok video in a residents WhatsApp group.\n\nThe footage allegedly features an unknown woman criticising Mnangagwas economic policies and making disparaging comments including accusing him of bringing misfortunes among Zimbabweans and urging him to relinquish power to a young person.\n\nOn Friday 14 March 2025, prosecutors from the NPA withdrew charges against Councillor Maukazuva on the basis that they had not first obtained a certificate to prosecute from the Prosecutor-General, authorising them to pursue legal action against the opposition political party councillor.\n\nAccording to prosecutors, Councillor Maukazuva allegedly undermined authority of or insulted President Mnangagwa, when he allegedly circulated a Tiktok video clip containing some derogatory and vulgar language reportedly uttered by an unidentified woman, ZLHR said in a statement.\n\nZLHR also said the prosecutors claimed that Maukazuvas conduct of allegedly forwarding the Tiktok video clip was unlawful.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/15180901/ED.jpg",
            "description": "<p>By Staff Reporter THE National Prosecuting Authority has withdrawn charges against Chivhu Ward 12 Citizens Coalition for Change (CCC) councillor Ishmael Maukazuva, who was arrested Wednesday for allegedly insulting President Emmerson Mnangagwa. The Zimbabwe Lawyers for Human Rights (ZLHR), who represented him, said Maukazuva was facing charges under the Data Protection Act for sharing a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-councillor-set-free-following-arrest-for-insulting-mnangagwa-as-charges-withdrawn/\">CCC councillor set free following arrest for ‘insulting Mnangagwa’ as charges withdrawn</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Government’s US$44m medicines budget for 2025, a drop in the ocean for Zimbabwe’s healthcare needs of about US$17m monthly— Health minister",
            "url": "https://www.newzimbabwe.com/governments-us44m-medicines-budget-for-2025-a-drop-in-the-ocean-for-zimbabwes-healthcare-needs-of-about-us17m-monthly-health-minister/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEs 2025 budget allocation of US$44 million for medicines is deplorably insufficient, as the country requires at least US$17 million per month.\n\nFor years, the government has been struggling to provide basic supplies at public hospitals, with health professionals receiving poor salaries.\n\nThe healthcare crisis is expected to worsen as international donors like the USAID and UKAID, may withdraw their funding.\n\nUSAID has already suspended funding for all activities pending review, while UKAID announced a significant budget cut to its international assistance.\n\nAddressing a press conference Friday on his ministrys achievements, Health and Child Care Minister Douglas Mombeshora revealed that the US$17 million required is still inadequate, as it only covers the most essential supplies.\n\nAccording to the minister the whole year budget only covers about three months if the required budget is to be met.\n\nMombeshora stated that the ministry is in negotiations with the Treasury to increase the budget amid declining external assistance.\n\nThe country requires approximately US$17 million worth of medicines monthly. The figure only covers the most essential medicines.\n\nThe availability of essential medicines increased from 22% in 2023 to around 50% in 2024. The increase in availability has largely been due to greater investment in medicines.\n\nFor instance, there are currently two main medicine supply contracts: Intrapharma (around US$24 million) and Clean Planet (around US$17 million).\n\nIn 2023, the government allocated about US$52 million for medicines. In 2025, the government committed approximately US$44 million toward medicines.\n\nThere are ongoing negotiations with the Treasury to increase the health budget in light of dwindling external support, Mombeshora said.\n\nZimbabwes health sector is generally underfunded and relies heavily on the benevolence of Western development partners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/15022128/Douglas-Mombeshora.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE’s 2025 budget allocation of US$44 million for medicines is deplorably insufficient, as the country requires at least US$17 million per month. For years, the government has been struggling to provide basic supplies at public hospitals, with health professionals receiving poor salaries. The healthcare crisis is expected to worsen as international donors</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/governments-us44m-medicines-budget-for-2025-a-drop-in-the-ocean-for-zimbabwes-healthcare-needs-of-about-us17m-monthly-health-minister/\">Government’s US$44m medicines budget for 2025, a drop in the ocean for Zimbabwe’s healthcare needs of about US$17m monthly— Health minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Tactical Ngezi Platinum Stars hands Scottland FC’s first defeat of the season to go on top",
            "url": "https://www.newzimbabwe.com/tactical-ngezi-platinum-stars-hands-scottland-fcs-first-defeat-of-the-season-to-go-on-top/",
            "content": "By Sport Reporter\n\nTAKESURE Chiragwis tactical prowess earned Ngezi Platinum its first win of the season after beating log leaders Scottland 1-0 at Rufaro Stadium Friday afternoon.\n\nChiragwis 72nd minute double substitution of bringing in Tinotenda Ditima and Tinashe Mavhudzi for Marvin Gaki and Talent Chamboko paid off as it unstabillised Scottland defence.\n\nEight minutes into the match Mavhudzi dribbled past three Scottland defenders in the box before he was fouled by Peter Mudhuwa, hence earning his side a penalty which was slotted in by team captain Kudzai Chigwida.\n\nAfter managing to handle Scottland its first defeat of the season, Chiragwi was elated with his sides tactical discipline.\n\nWe did our homework very well. We came wanting to diffuse their strength and we did that.\n\nWe have watched them playing and we diffused their strength, and we did capitalize on our strength which is to jeep position.\n\nAll we wanted was to find some vulnerable spaces within their defence, which we tried in the first half.\n\nGoing in to the second half we realised they were getting tired in their defence hence we introduced the two youngsters who brought energy and won us a penalty, Chiragwi said.\n\nThe victory saw Ngezi taking pole postion with seven points, on top of that they stretched their unbeaten run to three games after starting off with two consecutive draws against Kwekwe United and Green Fuel.\n\nWith six players called up for national duty, Scottland coach Tonderai Ndiraya felt that his side did not deliver the best as compared to last week when they beat CAPS United 2-0.\n\nNdirayas side created several chances in both halves but still they could not break the resolute Ngezi Platinum defence.\n\nWe didnt start too well; we didnt show the energy we showed last week.\n\nI think it all has to do with the mind, phsycologically l think we were very relaxed.\n\nWe didnt create any meaningful chances in the second half, and we started to notice some tired legs hence we had to make some changes but still it didnt materialise, said Ndiraya.\n\nScottland will now shift focus to its next match against Highlanders, although they have one-week FIFA international break to recover before the battle.\n\nSATURDAY 15TH MARCH 2025SIMBA BHORA FC vs HERENTALS COLLEGE FC (Wadzanai Stadium)DYNAMOS FC vs TELONE FC (Rufaro Stadium)CHICKEN INN FC vs FC PLATINUM (Luveve Stadium)MWOS vs YADAH FC (Baobab Stadium)KWEKWE UNITED FC vs BIKITA MINERALS FC (Bata Stadium)GREENFUEL FC vs HIGHLANDERS FC (Green Fuel Arena)SUNDAY 16TH MARCH 2025MANICA DIAMONDS FC vs ZPC KARIBA FC (Sakubva Stadium)TRIANGLE UNITED FC vs CAPS UNITED FC (Gibbo Stadium).\n\nSATURDAY 15TH MARCH 2025\n\nSIMBA BHORA FC vs HERENTALS COLLEGE FC (Wadzanai Stadium)\n\nDYNAMOS FC vs TELONE FC (Rufaro Stadium)\n\nCHICKEN INN FC vs FC PLATINUM (Luveve Stadium)\n\nMWOS vs YADAH FC (Baobab Stadium)\n\nKWEKWE UNITED FC vs BIKITA MINERALS FC (Bata Stadium)\n\nGREENFUEL FC vs HIGHLANDERS FC (Green Fuel Arena)\n\nSUNDAY 16TH MARCH 2025MANICA DIAMONDS FC vs ZPC KARIBA FC (Sakubva Stadium)TRIANGLE UNITED FC vs CAPS UNITED FC (Gibbo Stadium).\n\nSUNDAY 16TH MARCH 2025\n\nMANICA DIAMONDS FC vs ZPC KARIBA FC (Sakubva Stadium)\n\nTRIANGLE UNITED FC vs CAPS UNITED FC (Gibbo Stadium).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/28130959/Takesure-Chiragwi-e1669641025606.png",
            "description": "<p>By Sport Reporter TAKESURE Chiragwi’s tactical prowess earned Ngezi Platinum its first win of the season after beating log leaders Scottland 1-0 at Rufaro Stadium Friday afternoon. Chiragwi’s 72nd minute double substitution of bringing in Tinotenda Ditima and Tinashe Mavhudzi for Marvin Gaki and Talent Chamboko paid off as it unstabillised Scottland defence. Eight minutes</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tactical-ngezi-platinum-stars-hands-scottland-fcs-first-defeat-of-the-season-to-go-on-top/\">Tactical Ngezi Platinum Stars hands Scottland FC’s first defeat of the season to go on top</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "ZRU appoints Nsikelelo Sibanda as new Lady Sables coach",
            "url": "https://www.newzimbabwe.com/zru-appoints-nsikelelo-sibanda-as-new-lady-sables-coach/",
            "content": "By Sport Reporter\n\nZIMBABWE Rugby Union (ZRU) has appointed Nsikelelo Sibanda as the new senior womens national team rugby coach.\n\nSibanda comes in as a replacement of Lilly Masirevu, whose contract with the union expired in February.\n\nThe 52-year-old coach comes with vast of experience in womens rugby as he has previously led the ladies Under 20 national team before parting ways with the union in 2020.\n\nThe Zimbabwe Rugby Union is pleased to announce the appointment of Nsikelelo Sibanda as Head Coach of the Senior National Womens Rugby team, the Lady Sables.\n\nMr. Sibanda brings a wealth of experience and expertise to this role. A highly qualified rugby professional, he is a World Rugby Match Commissioner and holds World Rugby Level 3 coaching credentials, reads a statement by ZRU.\n\nBesides leading the womens Under 20 rugby team, Sibanda once led the Junior Sables as head coach back in 2013 a stint that did not last three years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/14135654/1741960219403.jpg",
            "description": "<p>By Sport Reporter ZIMBABWE Rugby Union (ZRU) has appointed Nsikelelo Sibanda as the new senior women’s national team rugby coach. Sibanda comes in as a replacement of Lilly Masirevu, whose contract with the union expired in February. The 52-year-old coach comes with vast of experience in women’s rugby as he has previously led the ladies’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zru-appoints-nsikelelo-sibanda-as-new-lady-sables-coach/\">ZRU appoints Nsikelelo Sibanda as new Lady Sables coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies",
            "url": "https://www.newzimbabwe.com/judge-orders-trump-administration-to-reinstate-thousands-of-fired-employees-at-va-defense-department-and-other-agencies/",
            "content": "A federal judge has ordered half a dozen federal agencies to immediately reinstate probationary employees fired last month as part of the Trump administrations effort to rapidly shrink the federal workforce, calling the effort a sham.\n\nThe preliminary injunction issued from the bench Thursday by US District Judge William Alsup requires the departments of Veterans Affairs, Agriculture, Defense, Energy, Interior and Treasury to rehire the employees. The judge said that he might extend the order to cover other federal agencies at a later time.\n\nAlsup, an appointee of former President Bill Clinton, said he was making the ruling because he believes the Office of Personnel Management unlawfully directed the agencies earlier this year to lay off the probationary employees, who generally have been on the job for less than a year.\n\nThe judge said the order is effective immediately: This is the order and it counts.\n\nThe Justice Department indicated Thursday that it will appeal the ruling to the 9th US Circuit Court of Appeals.\n\nThe ruling came in a case brought by labor unions and others challenging OPMs role in the firings, which affected thousands of employees and sent shockwaves through various federal agencies, some of which later rehired some of the workers.\n\nAlsup was highly critical of the administrations justification for firing the employees. OPM had provided agencies with a template termination letter that cited the employees performance as the reason they were being let go. But the judge said that rationale was the governments attempt to end-run federal law setting up specific rules for reducing the federal workforce.\n\nThe reason that OPM wanted to put this based on performance was at least in part in my judgment a gimmick to avoid the Reductions in Force Act, the judge said. Because the law always allows you to fire somebody for performance.\n\nIt is a sad day when our government would fire some good employee and say it was based on performance when they know good and well thats a lie, he added. That should not have been done in our country. It was a sham in order to try to avoid statutory requirements.\n\nFederal probationary employees have typically been in their positions for one year, but some jobs have two-year probationary periods. The employees may be new to the federal workforce, but they also could have been recently promoted or shifted to a different agency.\n\nAlsups ruling is one of the most significant yet in cases testing the administrations authority to quickly reduce the number of federal employees  a key priority that has been central to the Elon Musk-led Department of Government Efficiency.\n\nThe White House called the ruling absurd and unconstitutional.\n\nA single judge is attempting to unconstitutionally seize the power of hiring and firing from the Executive Branch. The President has the authority to exercise the power of the entire executive branch  singular district court judges cannot abuse the power of the entire judiciary to thwart the Presidents agenda, White House press secretary Karoline Leavitt said in a statementposted on X by another White House aide.\n\nIf a federal district court judge would like executive powers, they can try and run for President themselves, Leavitt said.\n\nA second federal judgeruled later Thursday, in a similar case brought in Maryland by Democratic state attorneys general, that probationary employees laid off en masse by the Trump administration must be temporarily reinstated. That judges temporary restraining order, which will last two weeks, applies to 18 agencies, including the Department of Health and Human Services, the Environmental Protection Agency and the US Agency for International Development.\n\nThe preliminary injunction came after Alsup unloaded on the Justice Department for not making the acting head of the Office of Personnel Management available to testify about the Trump administrations decision to fire scores of probationary employees.\n\nHe had ordered acting OPM Director Charles Ezell to testify during Thursdays hearing, where he would likely face tough questions from attorneys representing the labor unions that are challenging his agencys role in the firings.\n\nBut the Justice Department refused to make him available and instead withdrew a declaration Ezell submitted last month that had served as the governments only evidence in the case.\n\nYoure afraid to do so because you know cross-examination will reveal the truth, Alsup told DOJ attorney Kelsey Helland. I tend to doubt that youre telling me the truth.\n\nAlsup told the DOJ attorney Thursday: You cant just say, heres a declaration, you have to accept it without question when there is a question.\n\nYoure not helping me get at the truth. Youre giving me press releases  sham documents, the judge said, referring to documents submitted by the DOJ to the court that they say shows how the agencies were making the termination decisions themselves.\n\nThe declaration from Ezell said that OPM did not direct other agencies to terminate probationary employees  the central issue in the case brought by labor unions and others.\n\nHelland pushed back strongly on the judges assertion, and argued during the hearing that the agency heads had sought to cull their workforce on their own, not at the direction of OPM.\n\nI respectfully disagree that we have submitted false evidence, he said at one point, adding later: Decisions on these employment actions were made by these agencies and were fully endorsed by their political leadership.\n\nThe Trump administration has been targeting probationary workers because they have fewer job protections and can be dismissed more easily. While they generally cannot appeal their termination to the Merit Systems Protection Board, they can if the action stemmed from partisan political reasons or marriage status. Also, they are protected from prohibited personnel practices.\n\nPart of Thursdays hearing concerned whether the employees at issue in the case have the option of appealing their firing to the MSPB, something Alsup had initially understood was possible. But the judge said he wanted the parties to submit more written legal arguments on the issue before he decides how to factor it into his ruling.\n\nOne former probationary employee who wasfired last monthfrom the IRS, an agency within the Treasury Department, told CNN that he and his colleagues were thrilled with the ruling.\n\nEveryone on the group chat is celebrating, the former IRS employee said, referring to a text chat where his former colleagues have been consoling each other in recent weeks.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>CNN A federal judge has ordered half a dozen federal agencies to “immediately” reinstate probationary employees fired last month as part of the Trump administration’s effort to rapidly shrink the federal workforce, calling the effort a “sham.” The preliminary injunction issued from the bench Thursday by US District Judge William Alsup requires the departments of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-orders-trump-administration-to-reinstate-thousands-of-fired-employees-at-va-defense-department-and-other-agencies/\">Judge orders Trump administration to reinstate thousands of fired employees at VA, Defense Department and other agencies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "‘I feel unqualified most days’ – Justin Bieber opens up about his mental health struggles",
            "url": "https://www.newzimbabwe.com/i-feel-unqualified-most-days-justin-bieber-opens-up-about-his-mental-health-struggles/",
            "content": "IOL\n\nJustin Bieberhas admitted to feeling like a fraud in a candid social media post that has sparked fresh concern among fans over his wellbeing.\n\nThe 31-year-old singer shared his thoughts in an Instagram post on Thursday, March 13 after months of speculation about his physical and mental state  and the status of his marriage  revealing struggles with imposter syndrome.\n\nHe said: People told me my whole life, Wow, Justin, you deserve that. And I personally have always felt unworthy, like I was a fraud, like when people told me I deserve something.\n\nIt made me feel sneaky, like, damn, if they only knew my thoughts. How judgmental I am, how selfish I really am they wouldnt be saying this.\n\nI say all this to say, if you feel sneaky, welcome to the club. I definitely feel unequipped and unqualified most days.\n\nBieber first found fame aged 15 after being discovered on YouTube and signing to his friend and mentorUshersrecord label.\n\nHis debut single Baby was released in 2010, catapulting him to international stardom.\n\nSince then, he has become one of the worlds best-selling music artists, with an estimated 150 million records sold globally.\n\nSpeculation over his health has intensified in recent months following appearances where he looked unkempt, prompting his representative to deny claims he was using hard drugs.\n\nDespite the speculation, Bieber and his wife,Hailey Bieber, 28, who share a seven-month-old son, Jack Blues, have continued to present a united front.\n\nThe couple has been seen together in public and on social media, including a post on March 1, celebrating Justins 31st birthday.\n\nHowever, concerns were reignited days later when the singer shared images of himself smoking from what appeared to be a bong.\n\nThe photos, posted to Instagram, showed him sitting on an e-bike with Cypress Hills Hits from the Bong playing in the background.\n\nLast month, Justins representative addressed concerns over his appearance, saying in a statement: The recurring narrative that Justin is using hard drugs is absolutely not true.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/06213251/Justin-Bieber.png",
            "description": "<p>IOL Justin Bieber has admitted to feeling “like a fraud” in a candid social media post that has sparked fresh concern among fans over his wellbeing. The 31-year-old singer shared his thoughts in an Instagram post on Thursday, March 13 after months of speculation about his physical and mental state – and the status of his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-feel-unqualified-most-days-justin-bieber-opens-up-about-his-mental-health-struggles/\">‘I feel unqualified most days’ – Justin Bieber opens up about his mental health struggles</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        },
        {
            "title": "Sean ‘Diddy’ Combs faces new allegations of forced labor in superseding indictment",
            "url": "https://www.newzimbabwe.com/sean-diddy-combs-faces-new-allegations-of-forced-labor-in-superseding-indictment/",
            "content": "ABC News\n\nSean Diddy Combs allegedly forced employees to work long hours under threat of physical and reputational harm and forced at least one employee to engage in sex acts with him, according to a new indictment unsealed Thursday.\n\nThe second superseding indictment against Combs following his arrest last year on federal charges contains no new charges but includes additional allegations of forced labor under the racketeering conspiracy count.\n\nAccording to the new indictment, Combs allegedly forced employees to work long hours with little sleep by using physical force, psychological harm, withholding money and threatening to harm their reputations.\n\nCombs caused these employees to believe they would be harmed  including by losing their jobs  if they did not comply with his demands, the second superseding indictment alleged. With respect to one employee, Combs used physical force, psychological harm, financial harm and reputational harm, and /or threats of the same to cause the employee to engage in sex acts with Combs.\n\nCombs is scheduled to be arraigned on the new indictment next week.\n\nHe has previously pleaded not guilty to racketeering conspiracy, sex trafficking and transportation to engage in prostitution charges and is scheduled to go on trial this spring.\n\nFederal prosecutors said they do not expect the new indictment to affect the May 5 trial.\n\nThe music mogul was arrested in September 2024 and remains in custody in the federal Metropolitan Detention Center in Brooklyn.\n\nCombs is accused of transporting prostitutes across state lines to engage in prolonged sexual activities known as freak offs, according to court filings.\n\nHe has denied all allegations made against him.\n\nMr. Combs has said it before and will say it again: he vehemently denies the accusations made by the SDNY [Southern District of New York], his attorney, Marc Agnifilo, said in a statement on Thursday in response to the superseding indictment. He looks forward to his day in court when it will become clear that he has never forced anyone to engage in sexual acts against their will.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/26080331/240325-Sean-Diddy-Combs-ew-436p-35b014.webp",
            "description": "<p>ABC News Sean “Diddy” Combs allegedly forced employees to work long hours under threat of physical and reputational harm and forced at least one employee to engage in sex acts with him, according to a new indictment unsealed Thursday. The second superseding indictment against Combs following his arrest last year on federal charges contains no</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sean-diddy-combs-faces-new-allegations-of-forced-labor-in-superseding-indictment/\">Sean ‘Diddy’ Combs faces new allegations of forced labor in superseding indictment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "15 Mar 2025"
        }
    ]
}