{
    "news": [
        {
            "title": "Reckless commuter omnibus driver jailed, gets life ban from driving",
            "url": "https://www.newzimbabwe.com/reckless-commuter-omnibus-driver-jailed-gets-life-ban-from-driving/",
            "content": "By James Muonwa\n\nA commuter omnibus driver, who drove against oncoming traffic in Harare, has been sentenced to an effective two years imprisonment and a life ban from driving.\n\nThe accused person, Freedom Ruzvidzo, was facing a charge of recklessdriving when he appeared before the Harare Magistrates Court on Tuesday.\n\nThe court heard that recently, the offender was behind the steering wheel of a Toyota Hiace when he ignored road traffic rules at the intersection of Second Street and Upper East Road, entered a One Way lane and obstructed other motorists during rush hour.\n\nAlthough Ruzvidzos actions did not cause any accident resulting in injury or death, his stunt placed the public at great risk.\n\nThe presiding magistrate cancelled Ruzvidzos drivers licence and permanently banned him from driving vehicle classes 2, 4 and 5, which cover minibuses, light motor vehicles and all types of trucks.\n\nIn a statement following sentencing, the National Prosecuting Authority (NPA) said reckless driving will not be tolerated on the countrys roads.\n\nDriving against (oncoming) traffic endangers lives and can cause deadly accidents. Offenders will face harsh penalties, including imprisonment and lifetime driving bans.\n\nPublic safety comes first. Every reckless driver is a potential killer on our roads, the NPA noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By James Muonwa A commuter omnibus driver, who drove against oncoming traffic in Harare, has been sentenced to an effective two years’ imprisonment and a life ban from driving. The accused person, Freedom Ruzvidzo, was facing a charge of reckless driving when he appeared before the Harare Magistrates Court on Tuesday. The court heard that recently,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/reckless-commuter-omnibus-driver-jailed-gets-life-ban-from-driving/\">Reckless commuter omnibus driver jailed, gets life ban from driving </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "29 Aug 2025"
        },
        {
            "title": "Chinhoyi University of Technology records gender shift as more females than males graduate",
            "url": "https://www.newzimbabwe.com/chinhoyi-university-of-technology-records-gender-shift-as-more-females-than-males-graduate/",
            "content": "By James Muonwa\n\nCHINHOYI University of Technology (CUT) has achieved gender parity in the number of graduands churned out of the Class of 2025, amid a shift that witnessed more females than males graduating.\n\nDuring the universitys 21st graduation ceremony held on Thursday, a total of 3,130 graduands were capped by President Emmerson Mnangagwa, who is the Chancellor of all State universities.\n\nOf the graduating Class of 2025, there were 1,573 females and 1,557 males, marking a slight difference of 16.\n\nTraditionally, during previous graduation ceremonies, the number of male graduates surpassed that of females.\n\nSpeaking on the sidelines of the event held at CUT Grounds, womens rights lobbyist, Chioniso Gurupira, said the new trend was a positive sign of strides the country has made in empowering women and the girl-child.\n\nThe one thing that has probably struck some of us in the gender mainstreaming sector is the number of female graduands at this event. The women are slightly more than the men, which is a positive story of CUT having achieved gender parity, said Gurupira.\n\nGender parity refers to a situation where the number of females and males is roughly equal or balanced in a particular context, such as in education, the workforce, or leadership roles.\n\nIt implies equal representation, opportunities, and treatment of both genders.\n\nA female graduand, Jennifer Tinotenda Sanjobo, who graduated with a Bachelor of Science (BSc) in Crop Science, expressed joy at having successfully completed her degree in a previously male-dominated study area, which will enable her to contribute meaningfully to national development.\n\nI am excited to have graduated with a BSc in Crop Science. We were a few ladies in our cohort and l feel proud to be among the graduands, said Sanjobo.\n\nI am hoping to use my newly acquired education and expertise to help Zimbabwe fight climate change by coming up with seed varieties that can adapt and withstand the rigours of the phenomenon.\n\nIn a small way, I am optimistic my contribution to climate-proofing agriculture will bring about food security and national development, she added.\n\nWhile CUT has managed to bring an equilibrium between the number of graduates based on gender, sadly total number of graduands tumbled this year to 3,130 from the 2024 figure, which stood at 3,545. In 2023, a total of 3,480 graduated from the same university.\n\nAddressing guests, CUT Vice Chancellor, Professor David Simbi lamented the low uptake of science, technology, engineering and mathematics (STEM) courses, which are the varsitys anchor areas of study.\n\nOur understanding as a higher education institution of our role is using research, innovation, science and technology development to drive and develop the industrialisation and modernisation of Zimbabwe to achieve a middle economic status by 2030\n\nHowever, our human capital development remains side lobbed in that there are too few STEM students in our programmes, despite the importance we attach to the related programmes of study, said Simbi.\n\nThis is, however, not peculiar to Zimbabwe, and there are other routes that we can use to meet this deficit that other countries with similar problems have adopted.\n\nTo this end, Your Excellency and Chancellor, CUT will be seriously investigating the introduction of foundation programmes in science, technology and engineering as pre-university basic technology education.\n\nSimbi noted that the approach is a common trend in the United Kingdom, Singapore and Malaysia, among other countries.\n\nThe vice chancellor also lamented the high cost of laboratory equipment, which he, however, said could be dealt with by adopting reverse engineering.\n\nSimbi told graduands that the Heritage-Based Education 5.0 philosophy had prepared them for the future.\n\nHeritage-based education has prepared you for the future. To the private sector, these graduates are ready to take on any challenge for the good of the country. In broader contribution, heritage-based education has gained greater meaning in the nation and beyond, towards industrialisation and modernisation, Simbi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/29064728/IMG_7531-scaled.jpg",
            "description": "<p>By James Muonwa CHINHOYI University of Technology (CUT) has achieved gender parity in the number of graduands churned out of the Class of 2025, amid a shift that witnessed more females than males graduating. During the university’s 21st graduation ceremony held on Thursday, a total of 3,130 graduands were capped by President Emmerson Mnangagwa, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinhoyi-university-of-technology-records-gender-shift-as-more-females-than-males-graduate/\">Chinhoyi University of Technology records gender shift as more females than males graduate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "29 Aug 2025"
        },
        {
            "title": "Two Harare council employees die at Glen View sewer plant",
            "url": "https://www.newzimbabwe.com/two-harare-council-employees-die-at-glen-view-sewer-plant/",
            "content": "By Staff Reporter\n\nTWO City of Harare (CoH) employees died on duty at the Firle, Glen View sewer treatment plant on Thursday morning.\n\nThe cause of their death is yet to be established.\n\nIn a public notice, CoH stated that investigations are underway and more details will be provided in due course.\n\nIn an unfortunate and tragic incident, two City of Harare employees died at our sewer treatment plant in Glen View this morning while on duty.\n\nPolice, the National Social Security Authority (NSSA) and City of Harare officials are investigating the tragic issue.\n\nThe City of Harare extends its deepest condolences to the families of the two, and we promise to get to the bottom of the matter, the notice reads.\n\nAuthorities are yet to release their names pending formal procedures.\n\nEarlier this month, another municipal worker, Simon Maketo, died after sustaining injuries in a tragic workplace accident that occurred while he was on duty in Manyame Park.\n\nIn most areas across the country, municipal workers operate under poor conditions without proper and adequate personal protective equipment, thereby exposing them to risks associated with their line of work.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/08041101/town-house1.jpg",
            "description": "<p>By Staff Reporter TWO City of Harare (CoH) employees died on duty at the Firle, Glen View sewer treatment plant on Thursday morning. The cause of their death is yet to be established. In a public notice, CoH stated that investigations are underway and more details will be provided in due course. “In an unfortunate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-harare-council-employees-die-at-glen-view-sewer-plant/\">Two Harare council employees die at Glen View sewer plant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "29 Aug 2025"
        },
        {
            "title": "Top official embroiled in Equatorial Guinea sex tape scandal jailed",
            "url": "https://www.newzimbabwe.com/top-official-embroiled-in-equatorial-guinea-sex-tape-scandal-jailed/",
            "content": "BBC\n\nA nephew of Equatorial Guineas President Teodoro Obiang Nguema, who was at the centre of a sex tape scandal last year, has been sentenced to eight years in prison for embezzlement.\n\nBaltasar Ebang Engonga, the former head of the National Financial Investigation Agency, diverted money for personal use, a court ruled.\n\nNicknamed Bello because of his good looks, the married Engonga gained notoriety last year, when he appeared in leaked videos having sex with different women  many of them wives and relatives of people close to the centre of power.\n\nThe leak occurred while he was in detention, accused of depositing a huge sum of embezzled money into secret accounts in the Cayman Islands.\n\nHe was found guilty along with five other officials who allegedly claimed the money as an allowance for travel  the amounts ranged from $9,000 (6,600) to $220,000.\n\nEngongas arrest last October and public humiliation was seen as an attempt to destroy any hope he had of becoming the next president of the oil-rich central African state.\n\nHis uncle is the worlds longest-serving president having been in power since 1979, and has appointed his son, Teodoro Obiang Mangue, as his vice-president.\n\nEngonga used to investigate crimes such as money laundering, but found himself at the infamous Black Beach prison in the capital, Malabo, after being accused of corruption.\n\nHis phones and computers were seized and a few days later the intimate videos started appearing online in their dozens.\n\nThe authenticity of the videos was never verified, but as the computer equipment was in the hands of the security forces, suspicion fell on someone there leaking it, perhaps to trash Engongas reputation.\n\nAs well as imposing a jail sentence, the tribunal fined Engonga $220,000, supreme court press director Hilario Mitogo was quoted by the AFP news agency as saying in a WhatsApp message to journalists.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/28193033/baltasar.webp",
            "description": "<p>BBC A nephew of Equatorial Guinea’s President Teodoro Obiang Nguema, who was at the centre of a sex tape scandal last year, has been sentenced to eight years in prison for embezzlement. Baltasar Ebang Engonga, the former head of the National Financial Investigation Agency, diverted money for personal use, a court ruled. Nicknamed “Bello” because</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-official-embroiled-in-equatorial-guinea-sex-tape-scandal-jailed/\">Top official embroiled in Equatorial Guinea sex tape scandal jailed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:09",
            "date": "29 Aug 2025"
        }
    ]
}