{
    "news": [
        {
            "title": "Ngezi Platinum Stars suffer first defeat of the season",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-stars-suffer-first-defeat-of-the-season/",
            "content": "By Sports Reporter\n\nNGEZI Platinum Stars were Saturday afternoon handed a 2-1 defeat by TelOne F.C to record their first loss of the season.\n\nThe Mhondoro-based side, however, maintained their stay on top of the log with 13 points, two ahead of MWOS who is travelling to Wadzanayi for a date against Herentals F.C.\n\nMadamburo was enjoying its best start in the Premier Soccer League (PSL) football history after picking one draw and four wins in its first five games.\n\nSpeaking after Saturdays match, Ngezi Platinum Stars coach Takesure Chiragwi saluted his boys performance despite ending on the losing end.\n\nOn the road they are some games that are difficult for you, and we have lost but we have to pick ourselves going forward because its a marathon.\n\nI think we have to applaud ourselves despite the result. We played well and our performance can guarantee us a positive result in our next game, he said.\n\nSaturdays result saw TelOne bouncing back to winning ways after losing to Simba Bhora last week.TelOnes seond goal came from their inform striker Washington Navaya, who is now leading the top goalscorers chart with five goals.\n\nNavaya was last month voted the leagues Player of The Month, earning praises from team coach Herbert Maruwa.\n\nWe needed to respond after last weeks defeat and l am happy, we did that.\n\nOf course, our players did what we wanted, Washington Navaya scoring for us again is good, l am happy that he is doing his job.\n\nUsually, he is remaining behind to do some extras and its good to have such kind of players, said Maruwa.\n\nMeanwhile, Manica Diamonds were handed a heavy 4-1 defeat by Simba Bhora at Wadzanayi Stadium while Triangle went down 2-1 to Bikita Minerals at Gibbo Stadium.\n\nAt Rufaro Stadium, Yadah Stars managed to hold money bags Scottland F.C to a 1-1 draw as FC Platinum settled for a 0-0 draw against Green Fuel.\n\nCastle Lager Premier Soccer League Matchday 5 fixtures\n\nHighlanders vs CAPS United (Barboufields Stadium)\n\nHerentals vs MWOS FC (Wadzanayi Stadium).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/05212406/Ngezi-Platinum.jpg",
            "description": "<p>By Sports Reporter NGEZI Platinum Stars were Saturday afternoon handed a 2-1 defeat by TelOne F.C to record their first loss of the season. The Mhondoro-based side, however, maintained their stay on top of the log with 13 points, two ahead of MWOS who is travelling to Wadzanayi for a date against Herentals F.C. Madamburo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-stars-suffer-first-defeat-of-the-season/\">Ngezi Platinum Stars suffer first defeat of the season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe ready to host Under 20 Rugby Africa Barthes Trophy tournament",
            "url": "https://www.newzimbabwe.com/zimbabwe-ready-to-host-under-20-rugby-africa-barthes-trophy-tournament/",
            "content": "By Sports Reporter\n\nZIMBABWE Rugby Union (ZRU) president Losson Mtongwiza says his union is ready to host the mens Under 20 Rugby Africa Barthes Trophy tournament, which is scheduled to kick off April 19.\n\nThe event will feature four nations namely, Kenya, Namibia, Tunisia and host Zimbabwe.\n\nScheduled to run for nine days, the tournament will have all its games played at Old Hararians Sports Club, a shift from Harare Sports Club, where it was hosted last year.\n\nZimbabwe was retained as the host for the prestigious tournament after winning the bid ahead of Kenya, who hosted in 2022 and 2023.\n\nWe are very ready for it. We are looking forward to hosting Kenya, Namibia, Tunisia.\n\nThis is the top four in as far as the Under-20s are concerned, and we are looking forward to going back to winning ways, said Mtongwiza.\n\nDespite hosting the Barthes Trophy successfully last year, ZRU was, however, in the spotlight for poor players welfare during the tourney.\n\nThe Junior Sables did not receive allowances from the union, on top of that they were booked in sub-par accommodation.\n\nHowever, the new ZRU president Mtongwiza has given assurance of an improved players welfare this time around.\n\nThe players have been working hard and the technical team has been with them for the past six to eight months.\n\nObviously we are very satisfied with their preparations, we value our players, they are our triple VIPs.\n\nWe have been doing our best to try and support them, obviously to remunerate them and to encourage them to go out and win.\n\nSo, it will be exactly the same for these Under-20s, he added\n\nZimbabwe lost to Kenya in last years Barthes Trophy final hence failing to retain the trophy they had defended for two years after winning the tournament in 2022 and 2023.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27175857/rugby-africa.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE Rugby Union (ZRU) president Losson Mtongwiza says his union is ready to host the men’s Under 20 Rugby Africa Barthes Trophy tournament, which is scheduled to kick off April 19. The event will feature four nations namely, Kenya, Namibia, Tunisia and host Zimbabwe. Scheduled to run for nine days, the tournament</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ready-to-host-under-20-rugby-africa-barthes-trophy-tournament/\">Zimbabwe ready to host Under 20 Rugby Africa Barthes Trophy tournament </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe’s governance ‘off course’– says EU, withdraws funding over controversial PVO Act",
            "url": "https://www.newzimbabwe.com/zimbabwes-governance-off-course-says-eu-withdraws-funding-over-controversial-pvo-act/",
            "content": "By Costa Nkomo\n\nPRESIDENT Emmerson Mnangagwas decision to sign the Private Voluntary Organisations (PVO) Bill into law has elicited a sharp rebuke from the European Union (EU), effectively shutting the door on future good governance funding.\n\nThis latest development comes as Zimbabwe appears determined to chart its own course, regardless of international concerns about human rights and transparency.\n\nThe timing of Mnangagwas signature  just hours before the commissioning of Mbares revamped informal traders market  did not go unnoticed, drawing criticism for what some view as disregard for the concerns of civil society.\n\nJobst von Kirchmann, the EU Ambassador to Zimbabwe, delivered a blunt assessment, stating that Mnangagwas insincerity had forced the bloc to withdraw its support for the good governance framework.\n\nThe situation, according to the EU, has reached a tipping point.\n\nThe PVO Act is disappointing and ill-considered, sidelining the views of diplomats and civil society organisations, von Kirchmann stated.\n\nZimbabwe has over USD 21 billion in debt and arrears with bilateral and multilateral creditors. Several years ago, the Government of Zimbabwe initiated a commendable arrears clearance and debt resolution process to address this situation.\n\nIt is disappointing to see that Zimbabwe has not upheld its own commitments under this process, particularly regarding the expansion of civic space.\n\nThe enactment of the PVO Amendment Bill, without concluding consultations to address the concerns of civil society organisations, has further reinforced negative trends in governance.\n\nAs a consequence, the European Union has decided to discontinue its planned targeted 2025 funding in support of the governments good governance initiatives under the structured dialogue framework, he said.\n\nHe added: The EU remains engaged and ready to reconsider its position should the government demonstrate a genuine commitment to meeting the governance targets outlined in the process.\n\nThe new law grants authorities sweeping powers to monitor and control the operations of private voluntary organisations, casting a long shadow over Zimbabwes civic space and raising serious questions about the future of independent advocacy.\n\nMnangagwa signed the controversial PVO Amendment Bill into law, ushering in sweeping changes to Zimbabwes regulatory framework for civic groups and non-governmental organisations.\n\nThe law, gazetted last Friday as Act No. 1 of 2025, amends five major pieces of legislation, including the PVO Act [Chapter 17:05], the Money Laundering and Proceeds of Crime Act, and the Criminal Law (Codification and Reform) Act. It is now officially enforceable.\n\nAccording to the gazetted text, the new Act gives authorities extensive powers to monitor and control the operations of PVOs, including the ability to scrutinise their ownership structures, funding sources, and affiliations.\n\nIt introduces strict definitions of beneficial owner and controller, potentially holding individuals criminally liable  including with imprisonment terms of up to 35 years  for offences related to illicit financing or misrepresentation.\n\nThe law also empowers the government to deregister organisations, seize assets, or dissolve entities found to be in breach of the new provisions, a move described by critics as a chilling effect on freedom of association.\n\nThe Act establishes a PVOs Board, comprised of representatives from civil society and multiple ministries, to oversee regulation of the sector.\n\nThis board, while ostensibly designed to provide oversight, is viewed by some quarters as a tool for entrench government control.\n\nAgainst intense criticism, even from the United Nations, government officials have defended the amendments as necessary to prevent the financing of terrorism and money laundering.\n\nHuman rights groups, however, argue that the legislation opens the door to the systematic suppression of dissent, potentially stifling organisations that challenge State policies or expose official corruption.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/13053656/Photo-de-Jobst-von-Kirchmann-juin-2021-1.jpg",
            "description": "<p>By Costa Nkomo PRESIDENT Emmerson Mnangagwa’s decision to sign the Private Voluntary Organisations (PVO) Bill into law has elicited a sharp rebuke from the European Union (EU), effectively shutting the door on future good governance funding. This latest development comes as Zimbabwe appears determined to chart its own course, regardless of international concerns about human</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-governance-off-course-says-eu-withdraws-funding-over-controversial-pvo-act/\">Zimbabwe’s governance ‘off course’– says EU, withdraws funding over controversial PVO Act</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "‘Don’t exploit traders’— Mnangagwa says amid controversy surrounding user fees at new Mbare Musika Market Hub",
            "url": "https://www.newzimbabwe.com/dont-exploit-traders-mnangagwa-says-amid-controversy-surrounding-user-fees-at-new-mbare-musika-market-hub/",
            "content": "UNCERTAINTY hangs over traders at the new Mbare Musika Market Hub, as responsible government officials remain evasive on the fees users will be expected to pay for stalls at the newly constructed facility.\n\nThe lack of transparency has fuelled anxieties among stakeholders amid rumour that traders would be expected to pay extortionate rentals.\n\nAlso, concerns are mounting over the allocation of trading spaces, with allegations emerging that Zanu PF is favouring its own members, potentially sidelining the very traders, who suffered losses in the devastating fire that ravaged the old market last October.\n\nThe suggestion of preferential treatment has sparked outrage and accusations of political opportunism.\n\nSpeaking at the official opening of the new market in Mbare Friday, President Emmerson Mnangagwa called on the Local Government minister to exercise fairness when setting rental rates for the traders.\n\nHis plea for moderation hinted at underlying tensions and a need to address the growing unease among those most affected.\n\nMnangagwa formally opened the first phase of the Mbare Musika Traders Market project, a development that promises to accommodate up to 1,700 traders.\n\nWe have built this facility to provide you with a conducive environment in which to conduct your businesses. The Minister of Local Government must not exploit traders, Mnangagwa stated emphatically.\n\nHe added, It is incumbent upon you, the traders, to act responsibly as you conduct your businesses within this facility.\n\nDespite the Presidents directive, Garwe remained cagey, dismissing social media reports of exorbitant rental fees but offering no concrete details.\n\nDo not give credence to the lies propagated on social media. Rentals will be very affordable. This facility is for you, a statement met with cheers tinged with scepticism.\n\nGarwe also announced that Masimba Holdings, the company awarded the US$200,000 contract to construct the new trading site, would be granted further contracts for phases two and three of the project, bypassing standard competitive tendering processes under the guise of an ongoing emergency.\n\nThis decision has raised eyebrows, with critics questioning the probity of awarding further lucrative contracts without due process.\n\nAdding fuel to the fire, Women Affairs and Small and Medium Enterprise Minister Monica Mutsvangwa openly acknowledged the governments primary motive behind the market development: to increase revenue collection through rental income.\n\nThis will enable us to collect more taxes from people. The Minister of Finance, Professor Mthuli Ncube, is in agreement. We are appealing to local authorities to continue making land available for the construction of trading markets, so that we can bolster our economy, Mutsvangwa stated bluntly.\n\nWhen pressed for specifics regarding rental charges, Mutsvangwa echoed Garwes evasiveness.\n\nThe City of Harare, Masimba Holdings, and the Local Government Ministry will convene to determine the rates for traders. We do not want to burden our people with excessive fees. You heard what the President said, she offered, deflecting the responsibility onto a future, unspecified meeting.\n\nThe newly constructed Mbare Musika Market Hub\n\nIn contrast to the ministers ambiguous pronouncements, Harare Mayor Jacob Mafume revealed to Newzimbabwe.com that traders would be expected to shell out US$30 per week for access to the facility.\n\nEach trader will pay US$30 per week. This is the agreement reached with our partners: the government and Masimba Holdings. We believe that US$30 per week represents a fair price, he said, albeit providing the clarity conspicuously absent from the governments messaging.\n\nThe new traders market was constructed through a partnership involving the Government of Zimbabwe, the City of Harare, and Masimba Holdings, acting as a technical partner.\n\nThe project was initiated in response to the devastating fire that swept through the market on the night of 8 October 2024, destroying traders goods valued at an estimated US$20 million and affecting more than 4,000 individuals.\n\nIn what many perceived as a callous remark then, Garwe suggested that the disaster, which left countless traders destitute, was something of a silver lining, presenting the government with an opportunity to build a facility designed for efficient revenue collection.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/12055505/GoPs4jrW4AAyPcD.jpeg",
            "description": "<p>By Costa Nkomo UNCERTAINTY hangs over traders at the new Mbare Musika Market Hub, as responsible government officials remain evasive on the fees users will be expected to pay for stalls at the newly constructed facility. The lack of transparency has fuelled anxieties among stakeholders amid rumour that traders would be expected to pay extortionate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-exploit-traders-mnangagwa-says-amid-controversy-surrounding-user-fees-at-new-mbare-musika-market-hub/\">‘Don’t exploit traders’— Mnangagwa says amid controversy surrounding user fees at new Mbare Musika Market Hub</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zanu PF spends big on Glen View by-election but lndependent candidate Madzokere remains optimistic of victory",
            "url": "https://www.newzimbabwe.com/zanu-pf-spends-big-on-glen-view-by-election-but-lndependent-candidate-madzokere-optimistic-of-victory/",
            "content": "By Darlington Gatsi\n\nDESPITE the government dangling trinkets, independent candidate Tungamirai Madzokere is upbeat about maintaining the oppositions stranglehold in Glen View South ahead of todays by-election.\n\nGlen View South constituency will vote this Saturday to elect a legislator to replace the Citizens Coalition for Change (CCC) Member of Parliament (MP), Grandmore Hakata, who passed away in March.\n\nZanu PF has gone out of its way to construct roads and donate computers to schools in Glen View through the Ministry of Primary and Secondary Education to lure voters.\n\nTranquility Tsitsi Tawomhera is running on a Zanu PF ticket for the vacant seat.\n\nIn an interview with NewZimbabwe.com, Madzokere said he faced mudslinging from Zanu PF supporters in the constituency.\n\nWe have encountered so many challenges, but we managed to overcome them. Voters were expressing apathy, but we convinced them to vote in Saturdays by-election.\n\nSome of the underhand tactics used against us ended up working in our favour. Our posters were removed by Zanu PF supporters, but the electorate know who to vote for, said Madzokere.\n\nThe Glen View South parliamentary seat has been elusive for the ruling party since the constituency was established in 2008.\n\nZanu PF is aiming to take advantage of the disarray in the opposition to snatch the constituency from them.\n\nPresident Emmerson Mnangagwa deployed his advisor, Paul Tungwarara, to dole out donations to the electorate. Recently, a high-powered Zanu PF delegation comprising Tungwarara, Provincial Affairs Minister Charles Tavengwa, National Political Commissar Munyaradzi Machacha, among others, launched a US$200,000 Presidential Empowerment Fund supposedly to benefit ordinary citizens.\n\nMadzokere said the electorate would not be swayed by the ruling partys short-term vote-buying schemes.\n\nPeople are actually wishing elections were held more often so that the money being spent could be put to good use. Glen View South has only seen development from the Zanu PF candidate when it is election time.\n\nPeople have been given hampers. Glen View residents are accepting the gifts, but they know the difference between being given fish and being taught how to fish.\n\nPeople can buy groceries for themselves when the economy is strong, when they are empowered, and when there is no corruption. When it comes to the election, they will vote for the candidate of their choicesomeone they know and trust in the area, said Madzokere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/12052704/GoLn2YRWYAAFdUG.jpeg",
            "description": "<p>By Darlington Gatsi  DESPITE the government dangling trinkets, independent candidate Tungamirai Madzokere is upbeat about maintaining the opposition’s stranglehold in Glen View South ahead of today’s by-election. Glen View South constituency will vote this Saturday to elect a legislator to replace the Citizens’ Coalition for Change (CCC) Member of Parliament (MP), Grandmore Hakata, who passed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-spends-big-on-glen-view-by-election-but-lndependent-candidate-madzokere-optimistic-of-victory/\">Zanu PF spends big on Glen View by-election but lndependent candidate Madzokere remains optimistic of victory </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabweans in UK protest against Mnangagwa’s failure to fix economy, clampdown on dissent",
            "url": "https://www.newzimbabwe.com/zimbabweans-in-uk-protest-against-mnangagwas-failure-to-fix-economy-clampdown-on-dissent/",
            "content": "By Staff Reporter\n\nA GROUP of Zimbabweans based in the United Kingdom recently held a demonstration dubbed the Walk for Freedom in Blackburn, among other things calling for the release of journalist Blessed Mhlanga.\n\nThe demonstrators chanted slogans and waved placards denouncing President Emmerson Mnangagwas government accused of heavy-handedness.\n\nThe event has since sparked concern in Harare, where government officials say the walk coincided with a period of heightened national security following a recently foiled attempt by war veteran Blessed Bombshell Runesu Geza to force Mnangagwa to resign.\n\nZimbabwes security services have reportedly invoked the Criminal Law (Codification and Reform) Amendment Act of 2023, in response to what they view as deliberate attempts to undermine national sovereignty and incite public disorder through external influence.\n\nGovernment insiders claim the chants and messages shared during the protestnow circulating widely on platforms such as X (formerly Twitter), Facebook, and various online blogsconstitute potential violations of the Act.\n\nThe event, which was held last Saturday, drew the attention of international observers and Zimbabwean authorities, was organised by Melody Phylis Magejo, Josephine Jenje Mudimu, and Theophilas Mkuhlani.\n\nIdentified among the demonstrators were Genius Mamwadhu, Pamela Magwizi, Happiness Ncube, Xoliso Sithole, Shepherd Yuda, Nobukhosi Dube, Petty Ziramba, Patson Muzuwa, Victor Simon, and John Burke. Several photographers and other unidentified individuals were also seen documenting the event.\n\nOf particular concern to Zimbabwean authorities is the presence of Shepherd Yuda, a former prison officer, believed to be residing in the North East of England. Yuda has been previously linked to anti-government activities and was seen on live video streams from the walk, repeating claims that the President of Zimbabwe is suffering from dementiaremarks that the government has categorised as both defamatory and seditious.\n\nSources within Zimbabwes intelligence circles suggest that many individuals linked to the protest have already been flagged for surveillance.\n\nThe countrys law enforcement agencies have reportedly received additional funding to infiltrate diaspora networks and assess the extent of their influence in what has been described as a coordinated effort to destabilise the State.\n\nThe Zimbabwean government has reiterated its position that it welcomes political dissent expressed through legal and constructive channels but will not tolerate efforts that tarnish the image of the nation or seek to delegitimise its constitutional leadership.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/12051046/IMG-20250407-WA0020.jpg",
            "description": "<p>By Staff Reporter  A GROUP of Zimbabweans based in the United Kingdom recently held a demonstration dubbed the “Walk for Freedom” in Blackburn, among other things calling for the release of journalist Blessed Mhlanga. The demonstrators chanted slogans and waved placards denouncing President Emmerson Mnangagwa’s government accused of heavy-handedness. The event has since sparked concern</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-in-uk-protest-against-mnangagwas-failure-to-fix-economy-clampdown-on-dissent/\">Zimbabweans in UK protest against Mnangagwa’s failure to fix economy, clampdown on dissent </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "Mnangagwa appoints new Environment Minister",
            "url": "https://www.newzimbabwe.com/mnangagwa-appoints-new-environment-minister/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has appointed Evelyn Ndlovu as the new Minister of Environment, Climate Wildlife.\n\nShe replaces Sithembiso Nyoni, who was summarily relieved of her duties recently.\n\nBefore her latest appointment, Ndlovu was Minister of State for Matebeleland South Provincial Affairs and Devolution.\n\nChief Secretary to the President and Cabinet, Martin Rushwaya announced the appointment Friday.\n\nIn terms of Section 104, subsection 1 of the Constitution of Zimbabwe, His Excellency the President, Cde Dr. Emmerson Dambudzo Mnangagwa, has appointed Hon. Evelyn Ndlovu M.P. as Minister of Environment, Climate and Wildlife with immediate effect, he said.\n\nFormer Central Intelligence Organisation (CIO) top operative- turned-politician, Albert Nguluvhe has replaced Ndlovu as Provincial Affairs Minister for Matebeleland South.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/11190319/Sljvq9A5Pyel8lWaa1ZlAF0JvFEWEiL3bVVBz1Zf.gif",
            "description": "<p>By Staff Reporter  PRESIDENT Emmerson Mnangagwa has appointed Evelyn Ndlovu as the new Minister of Environment, Climate Wildlife. She replaces Sithembiso Nyoni, who was summarily relieved of her duties recently. Before her latest appointment, Ndlovu was Minister of State for Matebeleland South Provincial Affairs and Devolution. Chief Secretary to the President and Cabinet, Martin Rushwaya</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-appoints-new-environment-minister/\">Mnangagwa appoints new Environment Minister </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "CCC says opposition MPs influenced by Zanu PF handouts must bury their heads in shame",
            "url": "https://www.newzimbabwe.com/ccc-says-opposition-mps-influenced-by-zanu-pf-handouts-must-bury-their-heads-in-shame/",
            "content": "By Darlington Gatsi\n\nOPPOSITION Citizens Coalition for Change (CCC) has said any of its legislators who will have their conduct in Parliament influenced by the governments recent allocation of residential stands to MPs must be embarrassed by their conduct.\n\nTuesday, MPs queued at the Mabelreign District Office, where they were allocated residential standsa move that comes amid attempts to extend President Emmerson Mnangagwas rule beyond the constitutionally stipulated two terms.\n\nWhile acknowledging that the allocation of residential stands is part of a long-standing parliamentary policy, CCC spokesperson Willias Madzimure told NewZimbabwe.com that the process raises legitimacy concerns.\n\nThe policy of allocating residential stands to MPs in their respective provinces is not new. It is a long-standing policy of Parliament. However, what raises legitimacy concerns is the selective implementation of this policyparticularly if current members of Parliament are being given preference, while those who served in the Eighth and Ninth Parliaments are still waiting for their allocation, he said.\n\nMadzimure added that MPs should not submit to the whims of the Zanu PF led government.\n\nAny Member of Parliament who views this allocation as a personal favour misunderstands their entitlement and responsibilities. Such a person does not deserve to sit in the August House. MPs must understand that their service is to the people, not a transactional arrangement with the Executive, he said.\n\nThe land allocations have drawn criticism, with opposition legislators accused of being bribed to further the interests of the ruling party in Parliament.\n\nZanu PF is reportedly pushing for constitutional amendments to allow President Mnangagwa to extend his rule beyond the current two-term limit. Opposition MPs are said to have been co-opted into the plan.\n\nMadzimure criticised opposition MPs who are being influenced by ZANU-PF.\n\nMoreover, any Member of Parliament who accepts a handout or a gift  intended or perceived to influence their conduct in debates, actions, or votes  must bury their head in shame. Such conduct is a betrayal of public trust and a direct assault on democratic principles.\n\nWhen you are supposed to receive what you are entitled to as a condition of service, you must simply get it. When you are given something, it should not appear as though someone is doing you a favour.\n\nAs the CCC, we hold our MPs to the highest standards of integrity, transparency, and accountability. We do not, and will never, tolerate corruption in any form. We are clear: Parliament must serve the people, not partisan or personal interests, he said.\n\nIn 2023, opposition MPs also faced backlash for accepting US$50,000 in allowances ahead of the general elections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26021333/new-parliament-16-1024x637-1.png",
            "description": "<p>By Darlington Gatsi OPPOSITION Citizens Coalition for Change (CCC) has said any of its legislators who will have their conduct in Parliament influenced by the government’s recent allocation of residential stands to MPs must be embarrassed by their conduct. Tuesday, MPs queued at the Mabelreign District Office, where they were allocated residential stands—a move that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-says-opposition-mps-influenced-by-zanu-pf-handouts-must-bury-their-heads-in-shame/\">CCC says opposition MPs influenced by Zanu PF handouts must bury their heads in shame </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "Zimbabwe debt woes grow as state mining firm faces asset seizure",
            "url": "https://www.newzimbabwe.com/zimbabwe-debt-woes-grow-as-state-mining-firm-faces-asset-seizure/",
            "content": "Bloomberg\n\nA state-owned Zimbabwean mining firm is trying to protect assets that risk being seized because the country failed to honour a debt incurred when it lost an international arbitration case over cancelled nickel and platinum ventures.\n\nThe Zimbabwe Mining Development Corp has asked the Mines Ministry for a resolution to a longstanding dispute with a unit of Amaplat Mauritius that is laying claim to the assets, a letter written by the companys Chairman Paul Chimboza to Mines Minister Winston Chitando shows.\n\nChimboza confirmed the veracity of the letter, which has been seen by Bloomberg, but declined to comment further, referring queries to the ministry.\n\nThe $93 million owed by ZMDC is among a litany of creditor woes confronting state entities in Zimbabwe. The government is more than $21 billion in debt and locked out of international capital markets after defaulting on payments owed to institutions including the World Bank and European Investment Bank.\n\nThe corporation has on many occasions requested that the Amari debt be assumed by the state, Chimboza wrote in reference to ZMDCs standoff with the Amaplat unit. ZMDC, which the Treasury indicated should address the matter using internal resources, has few assets of its own as they have mostly been transferred to a new state company known as Defold Mine.\n\nZimbabwes case against Amaplat was heard by the International Chamber of Commerces arbitration court in a sitting in Zambia in 2014, and the tribunal ruled in the companys favour. Zambias High Court granted Amaplat leave to enforce the arbitration ruling in 2019.\n\nTwo years later, the company made a proposal to the countrys finance ministry for the settlement of the debt, which amounted to $65.9 million at the time. That was acceded to with the understanding that ZMDC would make the payments.\n\nZMDC suggested that Bravura, a company owned by Nigerian businessman Benedict Peters, pay Amaplat $15 million as part of the agreement. Bravura, which received platinum concessions, however only paid $3 million to the mines ministry, Chimboza said, and the remaining terms of the settlement, including the transfer of mining assets to Amaplat, havent been met.\n\nBravura officials werent available for comment, said a person who answered their phone at offices in Zimbabwes capital, Harare.\n\nIt is not for Amari and Amaplat to determine how the government of Zimbabwe sources funds for payment for its public debt, Amaplat said in a response to queries. As the ICC award is against a Zimbabwe government parastatal and the commissioner of a government ministry, the ZMDC and the Chief Mining Commissioner of the Ministry Mines, the public debt remains the responsibility of the government of Zimbabwe for the full amount.\n\nSecretary for Mines Pfungwa Kunaka said he was traveling and didnt respond to questions on how the dispute would be handled.\n\nMore legal trouble may lie ahead for Zimbabwe as Amaplats plans to register its award in Canada, after doing the same in the US at the end of last year. A hearing in Canada is set for June 30, Chimboza said in the letter.\n\nZimbabwean diamonds, due to be sold in Brussels, were temporarily seized in relation to the dispute in 2014.\n\nThe continuous engagement of external lawyers is costly with more than $500 000 spent by ZMDC and the ministry in engaging legal representation, Chimboza said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/10162423/zmdc.jpg",
            "description": "<p>Bloomberg A state-owned Zimbabwean mining firm is trying to protect assets that risk being seized because the country failed to honour a debt incurred when it lost an international arbitration case over cancelled nickel and platinum ventures. The Zimbabwe Mining Development Corp has asked the Mines Ministry for a resolution to a longstanding dispute with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-debt-woes-grow-as-state-mining-firm-faces-asset-seizure/\">Zimbabwe debt woes grow as state mining firm faces asset seizure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        },
        {
            "title": "It is their land – Local Government Ministry says after public uproar over MPs’ upmarket stands",
            "url": "https://www.newzimbabwe.com/it-is-their-land-local-government-ministry-says-after-public-uproar-over-mps-upmarket-stands/",
            "content": "By Staff Reporter\n\nTHE Local Government Ministry has come out in defence of legislators fingered in questionable land grabs that might see them get between 300sqm and 1,000sqm of prime residential stands within Harares leafy Borrowdale district.\n\nMembers of Parliament (MPs), including those from opposition Citizens Coalition for Change (CCC), are on a list of beneficiaries that has been circulated widely via social media.\n\nQuestions had been raised after noting that some of the benefiting MPs received between US$40,000 and US$500.000 as housing loans during the Ninth Parliament.\n\nA statement released by the ministry revealed that 263 stands had already been reserved for MPs across the country, with Harare accounting for 188 of them.\n\nThe Ministry of Local Government in 2013 partnered with the Parliament of Zimbabwe to avail residential stands in urban and peri-urban areas for allocation to Honourable members, reads the statement.\n\nSince inception, the facility is benefiting Honourable members from the 8th (2013-2018). 9th (2018-2023) and the current 10th Parliament.\n\nThis facility is a once-off entitlement given as a non-monetary benefit, which is part of their conditions of service. In implementing this programme, government is fulfilling its commitment of enhancing the welfare of Honourable members, as it is doing for war veterans, women, the youth and civil servants.\n\nDespite the clarification, some MPs such as Nortons Richard Tsvangirai and Marondera Centrals Caston Matewu have dismissed it.\n\nTsvangirai said he did not receive any land and Matewu said he had declined the offer.\n\nMatewu said he had been offered the stand but refused to take part in the questionable Parliamentary Housing Scheme, which is being seen as an attempt by President Emmerson Mnangagwa to bribe MPs in light of possible impeachment.\n\nI have not received any land, and these rumours are completely false, said Tsvangirai, who is in Parliament on a CCC ticket.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Staff Reporter THE Local Government Ministry has come out in defence of legislators fingered in questionable land grabs that might see them get between 300sqm and 1,000sqm of prime residential stands within Harare’s leafy Borrowdale district. Members of Parliament (MPs), including those from opposition Citizens Coalition for Change (CCC), are on a list of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-is-their-land-local-government-ministry-says-after-public-uproar-over-mps-upmarket-stands/\">It is their land – Local Government Ministry says after public uproar over MPs’ upmarket stands</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "07:01",
            "date": "13 Apr 2025"
        }
    ]
}