{
    "news": [
        {
            "title": "Media lobby groups demand release of detained Zimbabwe Independent editor, condemn attack on press freedom",
            "url": "https://www.newzimbabwe.com/media-lobby-groups-demand-release-of-detained-zimbabwe-independent-editor-condemn-attack-on-press-freedom/",
            "content": "By Thandiwe Garusa\n\nWOMEN journalists rights advocacy group Gender and Media Connect (GMC) has called on authorities to release jailed news editor Faith Zaba.\n\nZaba, who is an editor at the privately owned weekly newspaper Zimbabwe Independent, was arrested on Tuesday on charges of undermining the authority of the President.\n\nThe charges stem from a satirical article published by her newspaper last week, which questioned Zimbabwes leadership role within the Southern African Development Community (SADC).\n\nShe appeared at the Harare Magistrates court on Wednesday, where she was remanded in custody after her bail application was postponed to Thursday.\n\nGMC National Director Patience Zirima said Zabas arrest sends a chilling message to journalists, especially women and threatens press freedom and gender equality in media leadership.\n\nGMC calls for the immediate and unconditional release of Faith Zaba.\n\nHer arrest is particularly significant given her status as one of the few women editors in the country.\n\nWomen journalists already face unique challenges and risks in their professional work, and the targeting of a prominent female editor for exercising her professional duties represents a serious setback for womens rights and media freedom, Zirima said.\n\nThe GMC also called for all charges against Zaba to be dropped and urged the government of Zimbabwe and its agencies to commit to respecting constitutional rights to freedom of expression and freedom of the media.\n\nMeanwhile, Media Alliance of Zimbabwe National Coordinator Nigel Nyamutumbu also expressed disappointment at the ongoing disregard for media freedom, warning of a shrinking democratic space.\n\nThis represents a shrinking democratic space. It reflects how press freedom is increasingly being disrespected, which is deeply concerning.\n\nEven with the repeal of repressive legislation, journalists continue to be arrested and their safety compromised.\n\nInstead of making progress, we are taking steps backwards in respecting free expression and democracy in Zimbabwe.\n\nPress freedom is under attack, and we need as much solidarity as possible, Nyamutumbu said.\n\nZabas arrest comes soon after another journalist from Alpha Media Holdings, Blessed Mhlanga, was arrested and spent three months in pre-trial detention for interviewing a war veteran, Blessed Geza, who had called for President Emmerson Mnangagwas immediate ouster.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Thandiwe Garusa WOMEN journalists’ rights advocacy group Gender and Media Connect (GMC) has called on authorities to release jailed news editor Faith Zaba. Zaba, who is an editor at the privately owned weekly newspaper Zimbabwe Independent, was arrested on Tuesday on charges of undermining the authority of the President. The charges stem from a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/media-lobby-groups-demand-release-of-detained-zimbabwe-independent-editor-condemn-attack-on-press-freedom/\">Media lobby groups demand release of detained Zimbabwe Independent editor, condemn attack on press freedom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:47",
            "date": "03 Jul 2025"
        }
    ]
}