{
    "news": [
        {
            "title": "CCC says opposition MPs influenced by Zanu PF handouts must bury their heads in shame",
            "url": "https://www.newzimbabwe.com/ccc-says-opposition-mps-influenced-by-zanu-pf-handouts-must-bury-their-heads-in-shame/",
            "content": "By Darlington Gatsi\n\nOPPOSITION Citizens Coalition for Change (CCC) has said any of its legislators who will have their conduct in Parliament influenced by the governments recent allocation of residential stands to MPs must be embarrassed by their conduct.\n\nTuesday, MPs queued at the Mabelreign District Office, where they were allocated residential standsa move that comes amid attempts to extend President Emmerson Mnangagwas rule beyond the constitutionally stipulated two terms.\n\nWhile acknowledging that the allocation of residential stands is part of a long-standing parliamentary policy, CCC spokesperson Willias Madzimure told NewZimbabwe.com that the process raises legitimacy concerns.\n\nThe policy of allocating residential stands to MPs in their respective provinces is not new. It is a long-standing policy of Parliament. However, what raises legitimacy concerns is the selective implementation of this policyparticularly if current members of Parliament are being given preference, while those who served in the Eighth and Ninth Parliaments are still waiting for their allocation, he said.\n\nMadzimure added that MPs should not submit to the whims of the Zanu PF led government.\n\nAny Member of Parliament who views this allocation as a personal favour misunderstands their entitlement and responsibilities. Such a person does not deserve to sit in the August House. MPs must understand that their service is to the people, not a transactional arrangement with the Executive, he said.\n\nThe land allocations have drawn criticism, with opposition legislators accused of being bribed to further the interests of the ruling party in Parliament.\n\nZanu PF is reportedly pushing for constitutional amendments to allow President Mnangagwa to extend his rule beyond the current two-term limit. Opposition MPs are said to have been co-opted into the plan.\n\nMadzimure criticised opposition MPs who are being influenced by ZANU-PF.\n\nMoreover, any Member of Parliament who accepts a handout or a gift  intended or perceived to influence their conduct in debates, actions, or votes  must bury their head in shame. Such conduct is a betrayal of public trust and a direct assault on democratic principles.\n\nWhen you are supposed to receive what you are entitled to as a condition of service, you must simply get it. When you are given something, it should not appear as though someone is doing you a favour.\n\nAs the CCC, we hold our MPs to the highest standards of integrity, transparency, and accountability. We do not, and will never, tolerate corruption in any form. We are clear: Parliament must serve the people, not partisan or personal interests, he said.\n\nIn 2023, opposition MPs also faced backlash for accepting US$50,000 in allowances ahead of the general elections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26021333/new-parliament-16-1024x637-1.png",
            "description": "<p>By Darlington Gatsi OPPOSITION Citizens Coalition for Change (CCC) has said any of its legislators who will have their conduct in Parliament influenced by the government’s recent allocation of residential stands to MPs must be embarrassed by their conduct. Tuesday, MPs queued at the Mabelreign District Office, where they were allocated residential stands—a move that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-says-opposition-mps-influenced-by-zanu-pf-handouts-must-bury-their-heads-in-shame/\">CCC says opposition MPs influenced by Zanu PF handouts must bury their heads in shame </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "Zimbabwe debt woes grow as state mining firm faces asset seizure",
            "url": "https://www.newzimbabwe.com/zimbabwe-debt-woes-grow-as-state-mining-firm-faces-asset-seizure/",
            "content": "Bloomberg\n\nA state-owned Zimbabwean mining firm is trying to protect assets that risk being seized because the country failed to honour a debt incurred when it lost an international arbitration case over cancelled nickel and platinum ventures.\n\nThe Zimbabwe Mining Development Corp has asked the Mines Ministry for a resolution to a longstanding dispute with a unit of Amaplat Mauritius that is laying claim to the assets, a letter written by the companys Chairman Paul Chimboza to Mines Minister Winston Chitando shows.\n\nChimboza confirmed the veracity of the letter, which has been seen by Bloomberg, but declined to comment further, referring queries to the ministry.\n\nThe $93 million owed by ZMDC is among a litany of creditor woes confronting state entities in Zimbabwe. The government is more than $21 billion in debt and locked out of international capital markets after defaulting on payments owed to institutions including the World Bank and European Investment Bank.\n\nThe corporation has on many occasions requested that the Amari debt be assumed by the state, Chimboza wrote in reference to ZMDCs standoff with the Amaplat unit. ZMDC, which the Treasury indicated should address the matter using internal resources, has few assets of its own as they have mostly been transferred to a new state company known as Defold Mine.\n\nZimbabwes case against Amaplat was heard by the International Chamber of Commerces arbitration court in a sitting in Zambia in 2014, and the tribunal ruled in the companys favour. Zambias High Court granted Amaplat leave to enforce the arbitration ruling in 2019.\n\nTwo years later, the company made a proposal to the countrys finance ministry for the settlement of the debt, which amounted to $65.9 million at the time. That was acceded to with the understanding that ZMDC would make the payments.\n\nZMDC suggested that Bravura, a company owned by Nigerian businessman Benedict Peters, pay Amaplat $15 million as part of the agreement. Bravura, which received platinum concessions, however only paid $3 million to the mines ministry, Chimboza said, and the remaining terms of the settlement, including the transfer of mining assets to Amaplat, havent been met.\n\nBravura officials werent available for comment, said a person who answered their phone at offices in Zimbabwes capital, Harare.\n\nIt is not for Amari and Amaplat to determine how the government of Zimbabwe sources funds for payment for its public debt, Amaplat said in a response to queries. As the ICC award is against a Zimbabwe government parastatal and the commissioner of a government ministry, the ZMDC and the Chief Mining Commissioner of the Ministry Mines, the public debt remains the responsibility of the government of Zimbabwe for the full amount.\n\nSecretary for Mines Pfungwa Kunaka said he was traveling and didnt respond to questions on how the dispute would be handled.\n\nMore legal trouble may lie ahead for Zimbabwe as Amaplats plans to register its award in Canada, after doing the same in the US at the end of last year. A hearing in Canada is set for June 30, Chimboza said in the letter.\n\nZimbabwean diamonds, due to be sold in Brussels, were temporarily seized in relation to the dispute in 2014.\n\nThe continuous engagement of external lawyers is costly with more than $500 000 spent by ZMDC and the ministry in engaging legal representation, Chimboza said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/10162423/zmdc.jpg",
            "description": "<p>Bloomberg A state-owned Zimbabwean mining firm is trying to protect assets that risk being seized because the country failed to honour a debt incurred when it lost an international arbitration case over cancelled nickel and platinum ventures. The Zimbabwe Mining Development Corp has asked the Mines Ministry for a resolution to a longstanding dispute with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-debt-woes-grow-as-state-mining-firm-faces-asset-seizure/\">Zimbabwe debt woes grow as state mining firm faces asset seizure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "It is their land – Local Government Ministry says after public uproar over MPs’ upmarket stands",
            "url": "https://www.newzimbabwe.com/it-is-their-land-local-government-ministry-says-after-public-uproar-over-mps-upmarket-stands/",
            "content": "By Staff Reporter\n\nTHE Local Government Ministry has come out in defence of legislators fingered in questionable land grabs that might see them get between 300sqm and 1,000sqm of prime residential stands within Harares leafy Borrowdale district.\n\nMembers of Parliament (MPs), including those from opposition Citizens Coalition for Change (CCC), are on a list of beneficiaries that has been circulated widely via social media.\n\nQuestions had been raised after noting that some of the benefiting MPs received between US$40,000 and US$500.000 as housing loans during the Ninth Parliament.\n\nA statement released by the ministry revealed that 263 stands had already been reserved for MPs across the country, with Harare accounting for 188 of them.\n\nThe Ministry of Local Government in 2013 partnered with the Parliament of Zimbabwe to avail residential stands in urban and peri-urban areas for allocation to Honourable members, reads the statement.\n\nSince inception, the facility is benefiting Honourable members from the 8th (2013-2018). 9th (2018-2023) and the current 10th Parliament.\n\nThis facility is a once-off entitlement given as a non-monetary benefit, which is part of their conditions of service. In implementing this programme, government is fulfilling its commitment of enhancing the welfare of Honourable members, as it is doing for war veterans, women, the youth and civil servants.\n\nDespite the clarification, some MPs such as Nortons Richard Tsvangirai and Marondera Centrals Caston Matewu have dismissed it.\n\nTsvangirai said he did not receive any land and Matewu said he had declined the offer.\n\nMatewu said he had been offered the stand but refused to take part in the questionable Parliamentary Housing Scheme, which is being seen as an attempt by President Emmerson Mnangagwa to bribe MPs in light of possible impeachment.\n\nI have not received any land, and these rumours are completely false, said Tsvangirai, who is in Parliament on a CCC ticket.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Staff Reporter THE Local Government Ministry has come out in defence of legislators fingered in questionable land grabs that might see them get between 300sqm and 1,000sqm of prime residential stands within Harare’s leafy Borrowdale district. Members of Parliament (MPs), including those from opposition Citizens Coalition for Change (CCC), are on a list of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-is-their-land-local-government-ministry-says-after-public-uproar-over-mps-upmarket-stands/\">It is their land – Local Government Ministry says after public uproar over MPs’ upmarket stands</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "From grief to glory: how ‘The Life List’ inspires a beautiful restart",
            "url": "https://www.newzimbabwe.com/from-grief-to-glory-how-the-life-list-inspires-a-beautiful-restart/",
            "content": "IOL\n\nThe Life List brings Lori Nelson Spielmans bestselling novel to the screen with a heartfelt story about grief, growth, and second chances. It ambitiously turns pain into purpose and a childhoodbucket listinto a roadmap for rediscovery.\n\nWhile it may not hit every emotional note with perfect precision, the film offers a warm, sometimes overly polished, yet relatable reminder that death doesnt have to be the end of your storyit can also mark the beginning of a new one.\n\nThe heart of the story lies in Alex Rose (Sofia Carson), a woman in her early thirties navigating the loss of her mother, Elizabeth (Connie Britton), and the sudden disintegration of a life she thought she had figured out.\n\nDirected by Adam Shankman, best known for feel-good fare like Hairspray and Disenchanted,the film leans heavily into sentimentality, which works well for its hopeful message, though sometimes at the cost of emotional depth.\n\nHis clean-cut aesthetic and love for grand emotional moments are evident throughout, adding both charm and occasional cheesiness to the viewing experience.\n\nCarson delivers a grounded, emotionally vulnerable performance, stepping beyond her usual glossy roles. Britton, meanwhile, manages to be both nurturing and wise through audio recordings alone, a testament to her ability to convey depth with minimalscreen time.\n\nAfter losing her teaching job and reluctantly joining her mothers cosmetics company, Alex faces the ultimate twist of fate: instead of being handed her inheritance, she receives a box of CDs and an old, handwritten life list she scribbled down as a child.\n\nIf she completes each goal on the list, she earns another CD, a personal message from her late mother, until all the items are ticked off.\n\nWhat follows is a year-long rollercoaster of challenges, emotional breakdowns, and rediscovery. From jumping into a mosh pit to trying stand-upcomedy, the goals arent just quirky checkboxes.\n\nThey force Alex to examine her life choices, confront her grief, and embrace uncertainty.These goals also push her toward unexpected joy and healing.\n\nMore than just a legal advisor, Brad (Kyle Allen) becomes a grounding presence and potential love interest, helping Alex navigate the chaos.\n\nAlexs journey is marked by metaphorical milestones  finding love, taking risks, rediscovering joy  that are real enough to stir something in those who have faced similar losses. The film deserves credit for portraying her growth as non-linear.\n\nThe cinematography has a soft, nostalgic glow that gives the film an almost storybook quality. It feels comforting, familiar which is fitting for a story about revisiting the dreams of our youth.\n\nThough the film, streaming on Netflix, is adapted from Spielmans novel, it does make some notable changes. Some subplots from the book are trimmed, and side characters are less developed on screen.\n\nAt just over two hours, the film does feel stretched at times, especially as Alex ticks off each life goal.Still, the message is clear: Life doesnt stop when someone you love dies. It changes. It unravels. And slowly, piece by piece, it can begin again.\n\n*** solid and enjoyable, though not groundbreaking.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/10201050/life-list.webp",
            "description": "<p>IOL “The Life List” brings Lori Nelson Spielman’s bestselling novel to the screen with a heartfelt story about grief, growth, and second chances. It ambitiously turns pain into purpose and a childhood bucket list into a roadmap for rediscovery. While it may not hit every emotional note with perfect precision, the film offers a warm, sometimes overly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-grief-to-glory-how-the-life-list-inspires-a-beautiful-restart/\">From grief to glory: how ‘The Life List’ inspires a beautiful restart</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "Nampak Zimbabwe sells majority stake to TSL amid challenging economic conditions",
            "url": "https://www.newzimbabwe.com/nampak-zimbabwe-sells-majority-stake-to-tsl-amid-challenging-economic-conditions/",
            "content": "Business Report\n\nNampak has concluded agreements for the disposal of its Zimbabwean unit, with the transaction now subject to suspensive conditions.\n\nThrough Nampak Southern Africa, the South African packaging manufacturer is disposing of Nampak Zimbabwe to TSL, a Harare-based logistics and processing company.\n\nRegarding the proposed disposal of a 51.43% shareholding in the Company by Nampak Southern Africa Holdings Limited, shareholders and the investing public are advised that the seller and TSL Limited have concluded a sale and purchase agreement in respect of the sale, which agreement remains subject to various suspensive conditions, Nampak Zimbabwe said on Wednesday.\n\nIt is expected that Nampak Zimbabwe will make an announcement of the complete disposal in the next few weeks.\n\nTSL is acquiring Nampak Zimbabwe for a purchase consideration of $25 million.\n\nIn compliance with the Companies and Other Business Entities Act and the Zimbabwe Stock Exchange Listings Rules, TSL is required to make an offer to the remaining shareholders of Nampak Zimbabwe.\n\nIt recently confirmed that it has the capacity to undertake the Mandatory Offer within the regulated timeframes, through settlement by either cash or by way of a share swap using its own shares.\n\nThe mandatory offer will be implemented by the purchaser independently, following the implementation of the disposal and without any involvement of Nampak, Nampak Zimbabwe recently said.\n\nThe rationale for the disposal of the Zimbabwe unit has been described as being in accordance with Nampaks asset disposal plan.\n\nNampak Zimbabwe is currently focusing on cost-containment measures as the operating environment, worsened by policy changes and currency instability, occasions challenges.\n\nJohn van Gend, Nampak Zimbabwe managing director, has said that the operating environment in Zimbabwe is undeniably complex, impacted by policy changes and currency instability.\n\nZimbabwe has just made currency policy changes that are likely to impact timely reporting by companies. While Nampak said it had transitioned to US dollar financial reporting, the Reserve Bank of Zimbabwe has directed that all companies use the local currency for all company reporting.\n\nVan Gend expects that the government of Zimbabwe will take decisive steps to effectively address the increasing risks of company closures and retrenchments that have escalated in the past few weeks.\n\nTo survive the countrys economic downturn, Nampak Zimbabwe will be focusing on cost-containment measures to protect margins and drive profitability across its operations.\n\nDuring the quarter to the end of December, the company saw demand for packaging material face pressure due tointensified competitor activity. Moreover, it was affected by disruptions to supply chains due to the civil unrest in Mozambique.\n\nWe encountered supply chain disruptions with raw materialsarriving via Beira Port, stemming from the political unrest in Mozambiquefollowing the disputed election results. Although the raw materials wereultimately received, the delays impacted our delivery capabilities during thefestive season, said Van Gend.\n\nHowever, it is the yet-to-be-resolved Zimbabwean economic challenges that the company expects to further affect demand, as the wholesale and retail sectors navigate considerable branch closures that threaten the sustainability of businesses.\n\nDuring the quarter under review, Nampak Zimbabwe reported 23% lower revenues in US Dollar terms while trading profit for the period declined by 56%.\n\nThis decrease inrevenue reflects the reduced demand across all business units, said the company.\n\nThe quarter period under review was fraught with fluctuations in exchange rates following asignificant depreciation of the local currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17154841/nampak.webp",
            "description": "<p>Business Report Nampak has concluded agreements for the disposal of its Zimbabwean unit, with the transaction now subject to suspensive conditions. Through Nampak Southern Africa, the South African packaging manufacturer is disposing of Nampak Zimbabwe to TSL, a Harare-based logistics and processing company. “Regarding the proposed disposal of a 51.43% shareholding in the Company by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nampak-zimbabwe-sells-majority-stake-to-tsl-amid-challenging-economic-conditions/\">Nampak Zimbabwe sells majority stake to TSL amid challenging economic conditions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "Cancer hijacks your brain and steals your motivation − new research in mice reveals how, offering potential avenues for treatment",
            "url": "https://www.newzimbabwe.com/cancer-hijacks-your-brain-and-steals-your-motivation-%e2%88%92-new-research-in-mice-reveals-how-offering-potential-avenues-for-treatment/",
            "content": "The Conversation\n\nA cruel consequence of advanced cancer is the profound apathy many patients experience as they lose interest in once-cherished activities. This symptom is part of a syndrome called cachexia, which affects about80% of late-stage cancer patients, leading to severe muscle wasting and weight loss that leave patients bone thin despite adequate nutrition.\n\nThis loss of motivation doesnt just deepen patients suffering, it isolates them from family and friends. Because patientsstruggle to engage with demanding therapiesthat require effort and persistence, it also strains families and complicates treatment.\n\nDoctors typically assume that when late-stage cancer patients withdraw from life, it is an inevitablepsychological response to physical deterioration. But what if apathy isnt just a byproduct of physical decline but an integral part of the disease itself?\n\nIn our newly published research, my colleaguesand Ihave discovered something remarkable: Cancer doesnt simply waste the body  ithijacks a specific brain circuit that controls motivation. Our findings, published in the journal Science, challenge decades of assumptions and suggest it might be possible to restore what many cancer patients describe asmost devastating to lose their will to engage with life.\n\nTo unravel the puzzle of apathy in cancer cachexia, we needed to trace the exact path inflammation takes in the body and peer inside a living brain while the disease is progressing  something impossible in people. However, neuroscientists have advanced technologies that make this possible in mice.\n\nModern neuroscience equips us with a powerfularsenal of toolsto probe how disease changes brain activity in mice. Scientists canmap entire brainsat the cellular level,track neural activityduring behavior, and preciselyswitch neurons on or off. We used these neuroscience tools in a mouse model of cancer cachexia to study the effects of the disease on the brain and motivation.\n\nWe identified a small brain region called thearea postremathat acts as the brains inflammation detector. As a tumor grows, it releases cytokines  molecules that trigger inflammation  into the bloodstream. The area postrema lacks the typical blood-brain barrier that keeps out toxins, pathogens and other molecules from the body, allowing it to directly sample circulating inflammatory signals.\n\nWhen the area postrema detects a rise in inflammatory molecules, it triggers a neural cascade across multiple brain regions, ultimately suppressing dopamine release in the brains motivation center  thenucleus accumbens. While commonly misconstrued as a pleasure chemical, dopamine is actually associated with drive, or thewillingness to put in effort to gain rewards: It tips the internal cost-benefit scale toward action.\n\nWedirectly observed this shiftusing two quantitative tests designed with behavioral economics principles to measure effort. In the first, mice repeatedly poked their noses into a food port, with progressively more pokes required to earn each food pellet. In the second task, mice repeatedly crossed a bridge between two water ports, each gradually depleting with use and forcing the mice to switch sides to replenish the supply, similar to picking berries until a bush is empty.\n\nAs cancer progressed, mice still pursued easy rewards but quickly abandoned tasks requiring greater effort. Meanwhile, we watched dopamine levels fall in real time, precisely mirroring the mices decreasing willingness to work for rewards.\n\nOur findings suggest that cancer isnt just generally wearing out the brain  it sends targeted inflammatory signals that the brain detects. The brain then responds by rapidly reducing dopamine levels todial down motivation. This matches what patients describe: Everything feels too hard.\n\nPerhaps most exciting, we foundseveral ways to restore motivationin mice suffering from cancer cachexia  even when the cancer itself continued progressing.\n\nFirst, by genetically switching off the inflammation-sensing neurons in the area postrema, or by directly stimulating neurons to release dopamine, we were able to restore normal motivation in mice.\n\nSecond, we found that giving mice a drug that blocks a particular cytokine  working similarly to existing FDA-approved arthritis treatments  also proved effective. While the drug did not reverse physical wasting, it restored the mices willingness to work for rewards.\n\nWhile these results are based on mouse models, they suggest a treatment possibility for people: Targeting this specific inflammation-dopamine circuit could improve quality of life for cancer patients, even when the disease remains incurable.\n\nThe boundary between physical and psychological symptoms is anartificially drawn line. Cancer ignores this division, using inflammation to commandeer the very circuits that drive a patients will to act. But our findings suggest these messages can be intercepted and the circuits restored.\n\nOur discovery has implications far beyond cancer. The inflammatory molecule driving loss of motivation in cancer is alsoinvolved in numerous other conditions from autoimmune disorders such as rheumatoid arthritis to chronic infections and depression. This same brain circuit might explain thedebilitating apathythat millions of people suffering from various chronic diseases experience.\n\nApathy triggered by inflammation may have originallyevolved as a protective mechanism. When early humans faced acute infections, dialing down motivation made sense  it conserved energy and directed resources toward recovery. But what once helped people survive short-term illnesses turns harmful when inflammation persists chronically, as it does in cancer and other diseases. Rather thanaiding survival, prolonged apathy deepens suffering, worsening health outcomes and quality of life.\n\nWhile translating these findings into therapies for people requires more research, our discovery reveals a promising target for treatment. By intercepting inflammatory signals or modulating brain circuits, researchers may be able to restore a patients drive. For patients and families watching motivation slip away, that possibility offers something powerful: hope that even as disease progresses, the essence of who we are might be reclaimed.\n\nProfessor of Neuroscience and Psychiatry, Washington University in St. Louis\n\nThis article is republished fromThe Conversationunder a Creative Commons license.Read the original articlehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230401/Cancer-Treatment.jpg",
            "description": "<p>The Conversation A cruel consequence of advanced cancer is the profound apathy many patients experience as they lose interest in once-cherished activities. This symptom is part of a syndrome called cachexia, which affects about 80% of late-stage cancer patients, leading to severe muscle wasting and weight loss that leave patients bone thin despite adequate nutrition. This</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cancer-hijacks-your-brain-and-steals-your-motivation-%e2%88%92-new-research-in-mice-reveals-how-offering-potential-avenues-for-treatment/\">Cancer hijacks your brain and steals your motivation − new research in mice reveals how, offering potential avenues for treatment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "Tanzania’s opposition leader charged with treason",
            "url": "https://www.newzimbabwe.com/tanzanias-opposition-leader-charged-with-treason/",
            "content": "BBC\n\nTanzanias opposition leader Tundu Lissu has been charged with treason a day after he was arrested following a rally he held in the south of the country.\n\nThe charge is connected to his nationwide campaign pushing for electoral reform under the slogan No Reforms, No Election.\n\nThe country is due to go to the polls in October when Lissu is expected to challenge President Samia Suluhu Hassan.\n\nWhen Samia first came to power in 2021, after the death of her predecessor John Magufuli, she was praised for reversing some of his more authoritarian tendencies. But she has since been criticised after some opposition members have been targeted with arrests and abductions.\n\nIn a series of public appearances, Lissu has been saying that there is no chance of a free-and-fair election in six months unless there are reforms.\n\nThe leader of the Chadema party wants the make-up of the electoral commission to change. He has argued that it should not include people appointed directly by Samia.\n\nThe authorities have described the campaign as inciting the public against the holding of the general election.\n\nLissu has been arrested several times in the past.\n\nIn 2017, during Magufulis presidency, he survived an assassination attempt during which he was shot 16 times.\n\nHe then went into exile and returned briefly in 2020 to run against Magufuli in that years election. He left after the results were announced, complaining about irregularities.\n\nHe then returned in 2023 after changes that Samia introduced to allow more freedom for the opposition.\n\nEarlier on Thursday, the police used tear gas to disperse Chadema supporters while blocking the party leaders from holding a press conference regarding Lissus arrest.\n\nSome party supporters told the BBC that nothing would stop them from demanding electoral reforms ahead of the elections.\n\nWe are surprised that the police are harassing us when our rallies are peaceful, one supporter said.\n\nWe know the ruling party, CCM, is behind all this. We will fight for changes before elections.\n\nRights groups have condemned the use of force and accused the government of using state institutions to silence critics.\n\nA lawyers association said the arrest of Lissu and the crackdown on his supporters was an abuse of power and showed a lack of political tolerance.\n\nLissus treason case has been adjourned until 24 April.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/10201310/tundu-lissu.webp",
            "description": "<p>BBC Tanzania’s opposition leader Tundu Lissu has been charged with treason a day after he was arrested following a rally he held in the south of the country. The charge is connected to his nationwide campaign pushing for electoral reform under the slogan “No Reforms, No Election”. The country is due to go to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanzanias-opposition-leader-charged-with-treason/\">Tanzania’s opposition leader charged with treason</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "95 March 31st protestors denied bail; magistrate says they will “regroup and reoffend” if released",
            "url": "https://www.newzimbabwe.com/95-march-31st-protestors-denied-bail-magistrate-says-they-will-regroup-and-reoffend-if-released/",
            "content": "By Staff Reporter\n\nA total of 95 people who were arrested on allegations of staging a demonstration against President Emmerson Mnangagwas continued stay in office on March 31 have been denied bail.\n\nThe group appeared before Harare magistrate Isheanesu Matova, charged with participating in an unlawful gathering with the intent to incite violence.\n\nThey have been in custody over the past week awaiting their bail hearing.\n\nThe other three suspected protesters who were arrested on the same day are appearing separately.\n\nIn denying the 95 bail, Matova said the accused will regroup and reoffend if granted bail.\n\nHe also said they are a threat to security.\n\nAccording to the National Prosecuting Authority on 31 March 2025 at around 0920am, the accused gathered at Robert Mugabe Square, commonly known as the Freedom Square, Harare intending to march in the streets of Harare, thereafter proceed to the State House of Zimbabwe and forcibly remove the Constitutionally elected President Emmerson Mnangagwa.\n\nThe accused were making their vows of removing the President saying, enough is enough, Mnangagwa must go, ED must go nezvigananda zvake. Madzibaba veshanduko huyai mutitungamirire, comrade Geza huyai mutitungamirire and whistled.\n\nPolice officers who were deployed for maintenance of order observed about two hundred people gathered and approached the group.\n\nThe accused piled stones, bricks and tyres along Robert Mugabe Road.\n\nThey threw stones towards the police officers whilst singing Hatidi zvekupihwa order nemasasikamu.\n\nThey also took pictures and videos of themselves, which they posted on various social media platforms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133846/march-7.png",
            "description": "<p>By Staff Reporter A total of 95 people who were arrested on allegations of staging a demonstration against President Emmerson Mnangagwa’s continued stay in office on March 31 have been denied bail. The group appeared before Harare magistrate Isheanesu Matova, charged with participating in an unlawful gathering with the intent to incite violence. They have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/95-march-31st-protestors-denied-bail-magistrate-says-they-will-regroup-and-reoffend-if-released/\">95 March 31st protestors denied bail; magistrate says they will “regroup and reoffend” if released</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "ZIMASCO wins Supreme Court appeal as Manase attempts to access bank account",
            "url": "https://www.newzimbabwe.com/zimasco-wins-supreme-court-appeal-as-manase-attempts-to-access-bank-account/",
            "content": "By Staff Reporter\n\nSUPREME Court Judge Tendai Uchena has ruled in favour of ZIMASCOs urgent chamber application and restrained lawyer Wilson Manase from accessing company bank accounts under the guise of being the corporate rescue practitioner.\n\nManase, whose client Avim Investment had appealed a similar and recent High Court judgement, unsuccessfully sought to use the appeal to access bank accounts held by ZIMASCO.\n\nZIMASCOs application in response to his actions, sought that the appeal by Avim Investments be treated with urgency, and for an interim order restraining Manase from interfering with the company pending hearing of that appeal.\n\nAvim Investments, owned by Kwekwe based businessman Shepherd Tundiya stands accused of trying to illegally take over operations at the ferro-chrome producer.\n\nAfter Manases latest attempts at accessing ZIMASCOs finances the company alleged that Avim Investments appeal just sought to create a window of opportunity which the Supreme Court has shut.\n\nWilson Manase who did not oppose the interdict application at the High Court, soon after Avim Investments appeal was filed at the Supreme Court, approached ZIMASCOs bank demanding immediate access to ZIMASCOs bank accounts on the basis that the appeal had suspended the High Court interdict earlier granted to ZIMASCO.\n\nThis was resisted by the bank and brought to ZIMASCOs attention which then filed an Urgent Chamber Application to the Supreme Court, for Avim Investments appeal to be heard urgently and for an interim relief for Wilson Manase to refrain from his conduct pending the hearing of the appeal.\n\nThe urgent chamber application was heard yesterday (09 April 2025) by Justice Uchena who ordered that the appeal by Avim Investments be set down for hearing urgently and that pending the hearing of the appeal, Wilson Manase shall refrain from asserting or holding himself out as corporate rescue practitioner for ZIMASCO.\n\nIn ZIMASCOs view, the appeal was filed in an opportunistic attempt to get a window to fraudulently access the assets and bank accounts of ZIMASCO, said ZIMASCO in its statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/01040625/zimasco1.jpg",
            "description": "<p>By Staff Reporter SUPREME Court Judge Tendai Uchena has ruled in favour of ZIMASCO’s urgent chamber application and restrained lawyer Wilson Manase from accessing company bank accounts under the guise of being the corporate rescue practitioner. Manase, whose client Avim Investment had appealed a similar and recent High Court judgement, unsuccessfully sought to use the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimasco-wins-supreme-court-appeal-as-manase-attempts-to-access-bank-account/\">ZIMASCO wins Supreme Court appeal as Manase attempts to access bank account </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        },
        {
            "title": "ICC boss arrives in Zim ahead of Board and Committee meetings",
            "url": "https://www.newzimbabwe.com/icc-boss-arrives-in-zim-ahead-of-board-and-committee-meetings/",
            "content": "By Sports Reporter\n\nInternational Cricket Council (ICC) chairman Jay Shah on Wednesday evening arrived at Robert Mugabe International Airport in Zimbabwe ahead of the Councils Board and Committee Meetings to be held from April 10 to 13.\n\nShah occupies the highest position in the international cricket governing board.\n\nAimed to focus on critical governance, strategic and operational matters, the gathering will start in Harare on April 10 before wrapping up in Victoria Falls on April 14.\n\nOther than Shah, a number of ICC Board members are also in the country for the meeting, which will also include key stakeholders in international cricket.\n\nThis is the first time in history that Zimbabwe is hosting such a big administrative cricket gathering, and ZC chairman Tavengwa Mukuhlani said its significant how the nations cricket is growing at the international level.\n\nThis is a proud and historic moment for Zimbabwe Cricket and our country as a whole, he said.\n\nWe are fully prepared to host the esteemed cricket leaders and to showcase the beauty, warmth and hospitality of our nation.\n\nThis event underscores Zimbabwes growing role in the global cricketing landscape and presents us with a unique platform to engage with key stakeholders in shaping the future of the game, Mukuhlani added.\n\nZimbabwe is set to jointly host the 2026 Under 19 Mens World Cup together with Namibia before co-hosting the 2027 Mens World Cup with South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/10163812/IMG-20250409-WA0045.jpg",
            "description": "<p>By Sports Reporter International Cricket Council (ICC) chairman Jay Shah on Wednesday evening arrived at Robert Mugabe International Airport in Zimbabwe ahead of the Council’s Board and Committee Meetings to be held from April 10 to 13. Shah occupies the highest position in the international cricket governing board. Aimed to focus on critical governance, strategic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/icc-boss-arrives-in-zim-ahead-of-board-and-committee-meetings/\">ICC boss arrives in Zim ahead of Board and Committee meetings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:33",
            "date": "11 Apr 2025"
        }
    ]
}