{
    "news": [
        {
            "title": "Parkinson’s cases could top 25 million worldwide by 2050, study suggests",
            "url": "https://www.newzimbabwe.com/parkinsons-cases-could-top-25-million-worldwide-by-2050-study-suggests/",
            "content": "TheIndependent\n\nThe number of people living with Parkinsons disease worldwide could more than double by 2050, a study suggests.\n\nThe predicted rise is largely down to an ageing population, researchers said.\n\nA modelling study led by academics in Beijing used data from the Global Burden of Disease Study 2021 to estimate the prevalence of Parkinsons disease from 2022 to 2050 in 195 countries.\n\nThe findings, published in the BMJ, suggest the number of people living with the condition in 2050 will be 25.2 million, a 112% increase compared to 2021.\n\nBy 2050 Parkinsons disease will have become a greater public health challenge for patients, their families, care givers, communities, and society, researchers said.\n\nThe team suggests the upward trend is more pronounced in men, in East Asia and in countries with middle socio-demographic index, which is a scale that measures a countrys level of development based on the likes of average income, education and fertility rate.\n\nAccording to their estimations, cases in the UK could climb from 230,000 by 2030, to 272,000 by 2040 and 307,000 by 2050.\n\nResearchers said population ageing was estimated to be the leading contributor to rising cases, adding that their projections can be used to plan control measures and call for urgent actions in meeting the increasing healthcare demands of patients with the illness.\n\nParkinsons is a progressive condition that affects the brain.\n\nSymptoms include involuntary shaking known as tremors, slow movements and stiff muscles, as well as psychological problems like depression, loss of balance, trouble sleeping and memory issues.\n\nAcademics suggest public health interventions could be promising in slowing the universal rise in cases.\n\nThey added: Given the inevitable population ageing, population growth, and disability experienced by individuals with Parkinsons disease owing to its chronic nature, an urgent need exists for future research to focus on the development of novel drugs, gene engineering techniques, and cell replacement therapies that are aimed at modifying the course of the disease and improving patients quality of life.\n\nDavid Dexter,director of research at Parkinsons UK, said: This very welcome study reminds us that Parkinsons is growing quickly across the world.\n\nYet, in the UK today, our investment in research is failing to respond to this anticipated growth and people with Parkinsons are not getting the healthcare and services they need to live well.\n\nUntil we find a cure, its vital that people with Parkinsons, regardless of their location, socioeconomic group or race, have access to research opportunities, good quality care and support that enables them to live well with the condition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06053147/Parkinsons-.webp",
            "description": "<p>TheIndependent The number of people living with Parkinson’s disease worldwide could more than double by 2050, a study suggests. The predicted rise is largely down to an ageing population, researchers said. A modelling study led by academics in Beijing used data from the Global Burden of Disease Study 2021 to estimate the prevalence of Parkinson’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parkinsons-cases-could-top-25-million-worldwide-by-2050-study-suggests/\">Parkinson’s cases could top 25 million worldwide by 2050, study suggests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Lesotho shocked by Trump’s remarks that ‘nobody has heard of the country’",
            "url": "https://www.newzimbabwe.com/lesotho-shocked-by-trumps-remarks-that-nobody-has-heard-of-the-country/",
            "content": "BBC\n\nLesothos government says it is shocked by US President Donald Trump saying that nobody has ever heard of the southern African nation.\n\nTrump, addressing the US Congress in his first speech since his return to the Oval Office, made the reference as he listed cuts made to what he said was wasteful expenditure.\n\nEight million dollars to promote LGBTQI+ in the African nation of Lesotho, which nobody has ever heard of, Trump said, eliciting laughter from some US lawmakers.\n\nA spokesperson for Lesothos foreign affairs department told the BBC that Lesotho enjoyed warm and cordial relations with the US.\n\nLesotho is one of the biggest beneficiaries of the USs African Growth and Opportunity Act (Agoa), which gives favourable trade access to some countries to promote their economic growth.\n\nAccording to the US government, the two countries traded goods worth $240m (187m) in 2024, mostly exports from Lesotho to the US, in particular textiles and clothing.\n\nLesothos Foreign Affairs Minister Lejone Mpotjoane said it was shocking to hear a head of state refer to another sovereign state in that manner.\n\nTo my surprise, the country that nobody has heard of is the country where the US has a permanent mission, Mpotjoane told the BBC.\n\nLesotho is a member of the UN and of a number of other international bodies. And the US has an embassy here and [there are] a number of US organisations weve accommodated here in Maseru.\n\nHe later told the AFP news agency: We are not taking this matter lightly, adding that they would send an official protest letter to Washington.\n\nOfficials dismissed Trumps remarks as off the cuff and a political statement, adding that they were uncalled-for given the good relations between the two nations.\n\nWe maintain very warm and cordial relations with the US. Theyve got a mission in Maseru and we also have [one] in Washington, foreign affairs spokesperson Kutloano Pheko told the BBC.\n\nMr Pheko was unable to confirm Trumps comments on the funding that went to LGBTQ organisations, saying that as the money went directly to them, they would be best placed to comment.\n\nMpotjoane, on his part, confirmed that the country had been affected by Trumps sudden decision to pause aid funding to countries around the world.\n\nMany organisations, mostly non-governmental, were thrown into chaos after the Trump administration announced a permanent end to the US Presidents Emergency Plan for Aids Relief (Pepfar) funding as part of a wider cost-cutting drive to reduce US government spending.\n\nPepfar was launched in 2003 by then US President George W Bush and its finances are distributed via the US governments main overseas aid agency USAID, whose funding has also been cut.\n\nLesotho is among those countries that benefited from Pepfar, its health ministry told South African publication GroundUp in February, with TB and HIV programmes among those receiving the critical funds.\n\nBut Mpotjoane declined to criticise this decision, saying it was the USs prerogative to cut aid if they want to.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06052513/lesotho.jpg",
            "description": "<p>BBC Lesotho’s government says it is shocked by US President Donald Trump saying that “nobody has ever heard of” the southern African nation. Trump, addressing the US Congress in his first speech since his return to the Oval Office, made the reference as he listed cuts made to what he said was wasteful expenditure. “Eight</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lesotho-shocked-by-trumps-remarks-that-nobody-has-heard-of-the-country/\">Lesotho shocked by Trump’s remarks that ‘nobody has heard of the country’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Ariston Holdings feels pinch of RBZ US$ retention thresholds",
            "url": "https://www.newzimbabwe.com/ariston-holdings-feels-pinch-of-rbz-us-retention-thresholds/",
            "content": "By Alois Vinga\n\nLISTED diversified agricultural concern, Ariston Holdings, says the high retention thresholds put in place by the Reserve Bank of Zimbabwe (RBZ) are choking smooth flow of operations at a time when export prices are dwindling on the global markets.\n\nPresenting the groups trading update for the first quarter that ended December 31 2024, company secretary Anesu Museta bemoaned the high retentions.\n\nHigh cost of production for key inputs such as fertilisers, crop chemicals and payroll coupled with the effects of the 25% RBZ retention on exports at a time when export prices are still constrained has negatively affected the operations, Museta said.\n\nThe outcry comes at a time when the RBZ has since increased the retention thresholds further to a maximum of 30% in a bid to shore up the ZWG local currency.\n\nThe development has since triggered an outcry from the mining sector, prompting them to plead for a significant reduction.\n\nMeanwhile, during the current year, tea production volume at 496btonnes was 31% than the prior comparative year where 716 tonnes was realized attributable to the extremely hot and dry weather experienced in the first quarter of the year.\n\nMacadamia production volumes were 4% below the prior comparative period. None of the macadamia nuts sold in this period were from the current season. To preserve water for commercial crops, water-intensive crops such as potatoes werent grown, resulting in a decline in revenue from other products, Museta said.\n\nRevenue for the first half of the year was USD 2,427,642, which was 7% below the previous comparative period, primarily due to a decrease in export tea volumes. This decrease, coupled with a 27% increase in production costs, caused the Group to register a gross loss for the period\n\nThe Group anticipates an improved selling season for the current year, but also expects the operating environment to remain challenging. Therefore, the focus will continue to be on cost control measures and driving revenue.\n\nFurthermore, the group has opted not to declare a dividend due to the need to revitalise productive assets and maintain available cash resources, Museta added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>By Alois Vinga LISTED diversified agricultural concern, Ariston Holdings, says the high retention thresholds put in place by the Reserve Bank of Zimbabwe (RBZ) are choking smooth flow of operations at a time when export prices are dwindling on the global markets. Presenting the group’s trading update for the first quarter that ended December 31</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ariston-holdings-feels-pinch-of-rbz-us-retention-thresholds/\">Ariston Holdings feels pinch of RBZ US$ retention thresholds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Mwonzora appeals against High Court ruling nullifying MDC-T’s 2022 congress",
            "url": "https://www.newzimbabwe.com/mwonzora-appeals-against-high-court-ruling-nullifying-mdc-ts-2022-congress/",
            "content": "By Staff Reporter\n\nMOVEMENT for Democratic Change (MDC-T) president, Douglas Mwonzora has approached the Supreme Court seeking a reversal of a recent High Court judgement that annulled the partys 2022 congress which elected him into power.\n\nLast week, High Court judge, Justice Hapias Zhou, made the ruling following an appeal by former MDC-T members, Elias Mudzuri, Edward Kakora, Gift Konjana, Den Moyo, John Nyika and Morgen Komichi.\n\nMwonzoras challenge lodged at the superior court effectively suspends Justice Zhous, pending the outcome of the appeal.\n\nThe High Court ordered Mwonzora to resign and pave the way for a fresh congress within six months due to irregularities in the 2022 MDC-T ordinary congress that catapulted him to the helm of the alternative formation.\n\nThe purported National Congress held in December 2020 by the second respondent as the National Congress of the first respondent be and is hereby declared null and void for noncompliance with the first respondents Constitution, part of Justice Zhous ruling reads.\n\nFollowing the ruling, Mwonzora said Zanu PF was behind the controversial judgment in order to pacify his calls for Zimbabweans to resist President Emmerson Mnangagwas 2030 agenda to extend his incumbency beyond the constitutionally permissible two terms that expire in 2028.\n\nIn the aftermath of last weeks ruling, MDC-T must hold fresh polls to choose new leaders within the next six months.\n\nMwonzora said he was ready to defend his position through the ballot as leader of the main opposition political party.\n\nwhen the time comes, we will hold congress and l, as president of the MDC-T, am willing to face anyone in a congress. I am willing to face Mudzuri, anybody, in congress, and we all know what that outcome of the congress will be. We know they will be defeated, Zanu PF knows that they will be defeated, Mwonzora said.\n\nAt the 2020 extraordinary congress, Mwonzora annihilated Thokozani Khupe, Elias Mudzuri and Morgen Komichi, who were also vying for the MDC-T presidency. Before vote counting could start, Khupe and Komichi walked out, accusing Mwonzoras camp of using violence and a fraudulent voters roll. Mudzuri also left the congress shortly after.\n\nDespite the protests, voting continued into the night, and Mwonzora was declared the victor with 883 votes, while Khupe got 118 votes, Mudzuri scrapped 14, and Komichi a paltry 9 votes.\n\nOn December 18, 2022, the MDC-T held an ordinary congress where the party endorsed Mwonzora as its sole presidential candidate for the 2023 general elections. The congress also confirmed Chief Ndlovu as first vice president and Paurina Mpariwa as second vice president, both unopposed.\n\nMudzuri and other applicants later filed a case in the High Court, challenging the validity of the 2020 congress and seeking an order for a fresh congress.\n\nLast Friday, February 28, 2025, Justice Zhou handed a surprise ruling declaring that the 2022 congress was null and void, arguing that it fell short of meeting the requirements of the MDC-T Constitution.\n\nThe court ordered that a new national congress under an independent election commission as stipulated in the MDC-T Constitution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/07165505/mwonzora-e1661908991393.png",
            "description": "<p>By Staff Reporter  MOVEMENT for Democratic Change (MDC-T) president, Douglas Mwonzora has approached the Supreme Court seeking a reversal of a recent High Court judgement that annulled the party’s 2022 congress which elected him into power. Last week, High Court judge, Justice Hapias Zhou, made the ruling following an appeal by former MDC-T members, Elias</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwonzora-appeals-against-high-court-ruling-nullifying-mdc-ts-2022-congress/\">Mwonzora appeals against High Court ruling nullifying MDC-T’s 2022 congress</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Man living in UK since 1995 fighting to bring wife",
            "url": "https://www.newzimbabwe.com/man-living-in-uk-since-1995-fighting-to-bring-wife/",
            "content": "BBC\n\nA man from Kenya who has lived in the UK for 30 years is taking the next step in a long and expensive legal battle to bring his wife and family here.\n\nHenry Maina got married in 2020 and said he had spent 25,000 trying to bring his family together, including his daughter and his wifes two sons from a previous relationship.\n\nThe family is now taking the case to the Upper Tribunal court after their appeal was rejected.\n\nThe Home Office said they could not comment on individual cases while a legal process was ongoing.\n\nMr Maina, who is a software engineer living in Gloucester, said being apart from his family was devastating as they were virtually living two lives.\n\nHe and his wife Mary Njeri Kiarie met in Kenya in 2019, getting married in 2020 in the UK  but Mrs Njeri Kiarie had to return to Kenya when her visa expired.\n\nThe couple have since had a daughter but have not lived together for five years.\n\nIts been difficult, us virtually living two lives, them over there and me over here, Mr Maina said, adding it had been a stressful time for the whole family.\n\nJayna, my little one, sometimes she cries over the phone, she wants to come here and be with me.\n\nMr Maina has lived in the UK for 30 years but does not have a visa that gives him indefinite leave to remain.\n\nIt makes it more difficult for his wife, daughter and step sons to come over on his visa.\n\nBut he and his lawyers are making the case because of his exceptionally long stay in the UK.\n\nMr Maina said he had always paid tax and national insurance, never claiming benefits.\n\nMy wife, as soon as she comes, she wants to go into a social care job so its not like we will be living off state benefits.\n\nHe said 25,000 had been spent on the case so far with more costs expected to come when it went before the Upper Tribunal  Mr Mania says he is attempting to crowd fund some of the bills.\n\nThe BBC contacted the Home Office, which told us it could not comment on individual cases, especially when legal proceedings were ongoing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06050854/henry-maina.webp",
            "description": "<p>BBC A man from Kenya who has lived in the UK for 30 years is taking the next step in a long and expensive legal battle to bring his wife and family here. Henry Maina got married in 2020 and said he had spent £25,000 trying to bring his family together, including his daughter and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-living-in-uk-since-1995-fighting-to-bring-wife/\">Man living in UK since 1995 fighting to bring wife</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Huddersfield Town fans have a lot to say about Wolves loanee Tawanda Chirewa – one thing is clear",
            "url": "https://www.newzimbabwe.com/huddersfield-town-fans-have-a-lot-to-say-about-wolves-loanee-tawanda-chirewa-one-thing-is-clear/",
            "content": "Molineux.news\n\nWolves have sent several of their players out on loan this season, and some are flourishing in a new environment.\n\nFlop strikerFabio Silva is wanted by Sevillaafter finding his goal-scoring touch at Las Palmas with seven goals in 19 appearances this term.\n\nHugo Bueno is also starring in the Champions Leaguewith Feyenoord, having established a regular place in the starting lineup.\n\nSilva and Bueno were loaned out during the summer 2024 transfer window, whereas youngsterTawanda Chirewa joined Huddersfieldin January after a period of struggle at Derby County.\n\nChirewa suffered an injurywhich ended his spell at Pride Park prematurely. Luckily, the 21-year-old has found a new lease of life at the Terriers, who are battling for promotion out of League One.\n\nSince transferring to the Yorkshire side, theWolvesattacking midfielder has hit the ground running. Although there are no goals or assists to show for his performances,Chirewa was Man of the Match against Barnsleylast month.\n\nThe 2003-born star has since appeared five times in the league, including on Tuesday night when Michael Duffs men lost 1-0 against Wrexham.\n\nIt was a disappointing performance as a whole for Huddersfield, but the supporters praised the display ofChirewaand criticised Duffs decision to take him off in the 72nd minute, moments before Steven Fletcher scored the winner.\n\nTired of us continuously subbing off Tawanda Chirewa, when hes one of the few players who actually offer an attacking threat, one fan wrote.\n\nI love this new free to roam role that Chirewa was playing in, actually had some creativity today until he went off, another commented, referencing his change from a left winger to a number 10.\n\nChirewa a top player Id love us to sign permanently, a third admitted.\n\nI couldnt believe he took Chirewa off even worse when it was Wiles and not Taylor coming on, one fan said in disbelief.\n\nWas baffled by taking of Roosken & Chirewa. Comfortably our best attacking threats. Much improved but again, couldnt finish, a sixth replied while a seventh reaffirmed: Chirewa was best player on the pitch this half he got took off for Wiles and Taylor.\n\nAs pointed out by some of the above comments, Duff tried Chirewa in his natural position of attacking midfield for the second game running, and it worked a treat.\n\nIt offered the Wolves loanee extra creative freedom, seeing him influence the contest from a defensive and attacking perspective.\n\nAlthough he couldnt prevent his side from losing, the statistics suggest he did everything in his power to create a moment of quality before being substituted.\n\nTawanda Chirewa stats vs Wrexham\n\nReastically, Chirewa will struggle to break into the Wolves first team once he returns in the summer and playing for a top-end League One or lower down Championship side is perhaps his level.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06050701/chirewa.webp",
            "description": "<p>Molineux.news Wolves have sent several of their players out on loan this season, and some are flourishing in a new environment. Flop striker Fabio Silva is wanted by Sevilla after finding his goal-scoring touch at Las Palmas with seven goals in 19 appearances this term. Hugo Bueno is also starring in the Champions League with Feyenoord, having</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/huddersfield-town-fans-have-a-lot-to-say-about-wolves-loanee-tawanda-chirewa-one-thing-is-clear/\">Huddersfield Town fans have a lot to say about Wolves loanee Tawanda Chirewa – one thing is clear</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Africa’s energy revolution: the crucial balance between fossil fuels and green power",
            "url": "https://www.newzimbabwe.com/africas-energy-revolution-the-crucial-balance-between-fossil-fuels-and-green-power/",
            "content": "By NJ Ayuk | Business Report\n\nTheres a promising future for African renewables as the continent strives to balance its current reliance on fossil fuels. Thats the prediction of the African Energy Chambers2025 Outlook Report on the State of African Energy. As I have said before, Africa will eventually rely primarily on renewable energy, as much of the rest of the world strives to  but on its own timetable, not that of Western countries who have benefited for centuries from the exploitation of fossil fuels.\n\nTo achieve a carbon neutral future, African nations must have the underlying infrastructure and industry to make the dominance of renewables possible. As things currently stand, most African states lack said infrastructure and industry, and the most feasible and expedient way for them to achieve both is through leveraging the abundant oil and gas resources so many of them possess. As our report finds:\n\nNo Electricity at All\n\nThere are also significant challenges facing Africas energy sectors, as we cover in detail in our report. The most pressing of those challenges is the fact that many rural areas across Africa are underserved and lack the necessary power infrastructure to access any electricity at all.\n\nIn fact, of the 685 million people worldwide living without access to electricity, 590 million (86%) live in Africa. Conversely, even in well-served areas electricity is not cheap and reliable, as population and urbanization growth have outpaced the growth of power infrastructure, placing additional strain on the existing power systems.\n\nMany African households still rely on alternative, less efficient energy sources such as biomass, kerosene, etc., for heating and cooking. One practical solution to these challenges is Western investment. Western investment  providing both funds and technology  will help expand our existing infrastructure into underserved areas and harness our natural resources, and that will go a long way toward improving economic conditions across the continent. This will in turn improve energy affordability for many Africans as it becomes both more widely available and cheaper to access.\n\nBut where and in what should the West invest? That is up to them, but there are many development opportunities across the continent right now. I will cover just a few of the most promising, according to our outlook report.What we found is that most North African countries see 90% access rates for electricity and are looking to enhance their power sectors while reducing reliance on fossil fuels.\n\nThe bulk of renewable power share increases by the end of the decade will almost certainly be seated in this region. In contrast, sub-Saharan countries will continue to fight low electricity access for some time. They have been able to increase access to 55% currently, up from 38.3% in 2010. These countries will be ripe for investment, expanding the grid and production infrastructure to improve electrical access.\n\nWe also found that hydropower continues to dominate in East Africa, which has some of the largest dams in the world generating 19% of Africas overall power generation and providing up to 90% of the available power for countries such as Ethiopia and the Democratic Republic of Congo. Africas largest hydroelectric project, the Grand Ethiopian Renaissance Dam (GERD) is nearing completion and is expected to generate 15,760 GWh annually once fully operational. The project is of such importance to the region that it has sparked diplomatic cooperation between the Nile-bound countries of Ethiopia, Egypt, and Sudan in an effort to ensure equitable sharing of the rivers precious waters.\n\nOther currently ongoing projects such as Ethiopias Gibe III Dam (1870 MW), Zambia and Zimbabwes Kariba Dam (1830 MW) and Ghanas Akosombo Dam (1020 MW) also speak to promising future growth and development opportunities for those willing to get their feet wet in the central and eastern parts of the continent along the Congo and Nile rivers, where nearly 90% of the continents hydroelectric potential remains untapped. Geothermal power in Africa is currently dominated by Kenya, which to date is the seventh largest producer of geothermal power.\n\nKenyas estimated geothermal power potential is roughly 10 GW, but current operation capacity only allows 1 GW to be harnessed.International investment is what launched Kenyas geothermal power in the first place, with the United Nations development program providing the requisite research and funds in 1972 to establish the countrys first geothermal plant by the 1980s. Since then, Kenya has expanded independently, creating the state-owned Geothermal Development Company (GDC) in 2008 to both speed up geothermal advancements and lower the initial investment risk for foreign investment.\n\nSolar Power: A Light in the Dark\n\nSolar power offers a veritable gold mine of opportunity given Africas high irradiance levels: nearly 80% of the continent receives more than 2 MWh per square meter. This amounts to a solar PV potential of 1 million terawatt hours per year and a solar thermal potential of over 500 000 terawatt hours (for reference, a single terawatt hour is enough to light over 1 million homes for a year). Yet to date, Africa only generates over 35 TWh and 3.3 TWh from solar PV and solar thermal, respectively. Over 13 GW of utility-scale solar PV and wind projects are currently under construction, with hundreds more GW of capacity in the concept phase.\n\nI would like to reiterate: Africa willreach a point where we will rely primarily on low carbon and renewable energy. But we cannot get to that point without building the proper infrastructure, and we cannot fund the building of said infrastructure without leveraging our natural resources, oil and gas being chief among them. If the west wishes to speed along Africas progress on this front, the best way is to work with African as partners and investors working towards common goals.\n\nNJ Ayuk is the executive chairman of the African Energy Chamber (www.EnergyChamber.org).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/06045506/green-power.jpg",
            "description": "<p>By NJ Ayuk | Business Report There’s a promising future for African renewables as the continent strives to balance its current reliance on fossil fuels. That’s the prediction of the African Energy Chamber’s 2025 Outlook Report on the State of African Energy. As I have said before, Africa will eventually rely primarily on renewable energy,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africas-energy-revolution-the-crucial-balance-between-fossil-fuels-and-green-power/\">Africa’s energy revolution: the crucial balance between fossil fuels and green power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "MISA, MAZ urge Mnangagwa to reject Broadcasting Services Amendment Bill, accuse Muswere of dishonesty",
            "url": "https://www.newzimbabwe.com/misa-maz-urge-mnangagwa-to-reject-broadcasting-services-amendment-bill-accuse-muswere-of-dishonesty/",
            "content": "By Staff Reporter\n\nThe Media Institute of Southern Africa (MISA) Zimbabwe and the Media Alliance of Zimbabwe (MAZ) are urging the Senate and President Emmerson Mnangagwa to reject the controversial Broadcasting Services Amendment Bill, following its passage through the National Assembly this week. The organisations allege the Bill was approved without proper consideration of public concerns.\n\nIn a joint statement issued on Wednesday, the two media support bodies called upon Mnangagwa and the Senate to reject the Bill. They warned that if passed and enacted in its current form, it would damage the countrys reputation and mark a return to a more restrictive era for media freedom.\n\nMISA Zimbabwe and MAZ urge the Senate and President Emmerson Mnangagwa to reject the Bill and return it to the Ministry of Information, Publicity and Broadcasting Services so that it reflects the genuine aspirations of key media stakeholders and the public, as documented in the report of the Parliamentary Committee on Information, Media and Broadcasting Services.\n\nIt is our considered opinion that should the Senate and President approve this proposed law, Zimbabwe will be stuck in the Dark Ages with restrictive legislation that fails to reflect technological advancements. This casts doubt on the governments commitment to implementing comprehensive media reforms in line with regional, continental and international agreements, such as the African Charter on Broadcasting, reads part of the statement.\n\nThe two organisations further criticised Information Minister Jenfan Muswere, accusing him of dishonesty. They allege he disregarded concerns raised by the public during public hearings on the Broadcasting Services Amendment Bill, which were recorded in the report of the Parliamentary Portfolio Committee on Information, Media and Broadcasting Services.\n\nClause 15 of the Bill would require motorists to obtain a Zimbabwe Broadcasting Corporation (ZBC) radio licence before they can acquire a Zimbabwe National Road Authority (ZINARA) vehicle licence.\n\nDuring the public hearings, concerns were raised that the Bill unfairly singles out motorists. It was argued that they are the only group required to pay for ZBC radio services, while other citizens can access ZBC via mobile phones, radios, and televisions without charge.\n\nMISA Zimbabwe and MAZ are particularly disappointed by the Minister of Information, Publicity and Broadcasting Services, the Honourable Jenfan Muswere, who is sponsoring the Bill in Parliament, for seemingly disregarding the input of the public as recorded in the report of the Parliamentary Portfolio Committee on Information, Media and Broadcasting Services.\n\nHaving passed through the National Assembly on Tuesday, the Bill will now be considered by the Senate before being presented to the President for assent. The Senate is not expected to block the Bill.\n\nMISA Zimbabwe and MAZ, who actively participated in the public hearings last December, have expressed their regret that the Bill fails to incorporate the concerns of the public.\n\nIt is regrettable that the Minister did not consider the views of the hundreds who participated in this public process, nor did he take into account the views of the media stakeholders whose interests MISA Zimbabwe and MAZ represent.\n\nThe Minister ignored the debates of legislators from across the political spectrum, who, to their credit, echoed the views widely expressed by media stakeholders and the public.\n\nThe two leading media support bodies in the country have stated that the Bill, by failing to address critical questions regarding the independence of the broadcasting regulatory authority, enhance public participation in the licensing process, and strengthen parliamentary oversight, makes a mockery of the reform process.\n\nAnother key point of contention concerns Minister Musweres reversal of the 40 percent foreign shareholding allowance in the broadcasting sector. This allowance was originally intended to attract much-needed foreign direct investment into a capital-intensive sector, aligning with the governments open for business policy.\n\nThe Bill also disregards broader submissions concerning the need to refine the definition of political content for community broadcasters, the requirement for transitional clauses in preparation for convergence, and broadcast regulation in the age of Artificial Intelligence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16100957/Dr-Jenfan-Muswere.png",
            "description": "<p>By Staff Reporter The Media Institute of Southern Africa (MISA) Zimbabwe and the Media Alliance of Zimbabwe (MAZ) are urging the Senate and President Emmerson Mnangagwa to reject the controversial Broadcasting Services Amendment Bill, following its passage through the National Assembly this week. The organisations allege the Bill was approved without proper consideration of public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/misa-maz-urge-mnangagwa-to-reject-broadcasting-services-amendment-bill-accuse-muswere-of-dishonesty/\">MISA, MAZ urge Mnangagwa to reject Broadcasting Services Amendment Bill, accuse Muswere of dishonesty</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Zimbabwe’s Constitution now instrumental in enriching individuals at expense of the vast majority  – Churches say",
            "url": "https://www.newzimbabwe.com/zimbabwes-constitution-now-instrumental-in-enriching-individuals-at-expense-of-the-vast-majority-churches-say/",
            "content": "By Thandiwe Garusa\n\nCHURCHES have urged the government to respect the rule of law and Constitution amid calls forPresident Emmerson Mnangagwato extend his tenure.\n\nZanu PF is currently facing internal divisions, with one faction supporting Mnangagwas third term and another demanding adherence to constitutional limits.Mnangagwa is currently serving his second and final term.\n\nSeveral government ministers and parliamentarians have publicly supportedthe move to disregard the constitution and extend Mnangagwas rule until 2030.\n\nThe third term push has been largely criticised and condemned by opposition politicians, churchesand civil society organisations.\n\nIn a statement, the Zimbabwe Council of Churches (ZCC) calledfor adherence to the constitution, rule of law, and good governance. The churches urged leaders to prioritize transparency, accountability, inclusivity, and the rights of marginalized Zimbabweans.\n\nAs the church, we advocate for the upholding of the constitution, the rule of law, and good governance. This necessitates a commitment to transparency and accountability in governance.\n\nWe urge the government and all leaders to ensure that policies promote inclusivity and protect the rights of all Zimbabweans, particularly the marginalized, ZCC said.\n\nThe constitution and democracy have become tools for enriching a few elites, with those responsible for upholding them failing the nation, leading to a loss of trust in political leadership and state institutions.\n\nAs a country, we find ourselves in a situation where our constitution and constitutional democracy have become nothing more than instruments of protecting and enriching a few individuals, devoid of significance for the vast majority and the ethos of Zimbabwes war of liberation.\n\nThose entrusted with upholding our constitution are failing the nation. Our trust in political leadership across the political divide has eroded, along with our confidence in the state institutions of our democracy, parliament and the judiciary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Thandiwe Garusa CHURCHES have urged the government to respect the rule of law and Constitution amid calls for President Emmerson Mnangagwa to extend his tenure. Zanu PF is currently facing internal divisions, with one faction supporting Mnangagwa’s third term and another demanding adherence to constitutional limits. Mnangagwa is currently serving his second and final term. Several government</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-constitution-now-instrumental-in-enriching-individuals-at-expense-of-the-vast-majority-churches-say/\">Zimbabwe’s Constitution now instrumental in enriching individuals at expense of the vast majority  – Churches say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        },
        {
            "title": "Private Investigator Chidawa free at last; acquitted of US$20k fraud",
            "url": "https://www.newzimbabwe.com/private-investigator-chidawa-free-at-last-acquitted-of-us20k-fraud/",
            "content": "By Staff Reporter\n\nFormer cop and private investigator Tafadzwa Chidawa will finally leave jail following his acquittal in a case in which he was accused of stealing US$20,000 from one Melody Matanhire four years ago.\n\nHarare Magistrate Vongai Guwuriro Muchuchuti cleared Chidawa of wrongdoing after a full trial, ruling that there was insufficient evidence for him to be convicted.\n\nThe magistrate also said there were too many inconsistencies in the evidence of witnesses.\n\nChidawa was locked up last month after his bail was canceled for defaulting court.\n\nHe was jointly charged with Paradza Passmore Matubu, Perseverance Chisango, Malvern Mutanda, and Francis Takura, who were also acquitted.\n\nTakura is, however, serving 36 years for robberies.\n\nThe state was alleging that Matanhire was in a relationship with Mutanda.\n\nIt further alleged that on an unknown date in 2020, Matanhire told Mutanda that he had US$100,000 soiled money which needed some cleaning.\n\nMutanda allegedly told her that the process required US$20,000 in clean notes.\n\nOn August 27 2020, pursuant to the misrepresentation, advised Mutanda that she had managed to secure US$20,000, she then made arrangements with Mutanda to proceed to Blue Ridge Lodge where they were going to clean the money.\n\nUnbeknown to her, Mutanda hatched a plan with Chidawa, Takura, Paradzai Matubu and Perseverance Chisango to steal from Melody, the State had alleged.\n\nThe court heard that Matanharire handed over the money to Mutanda, who then put it in a cooler box for the cleaning process to commence.\n\nAll other accomplices allegedly entered the lodge masquerading as police officers and manhandled Mutanda and took away the cooler box, which had the money, and they went away.\n\nTakudzwa Jambawu was prosecuting.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17153155/chidawa-e1739806340985.jpg",
            "description": "<p>By Staff Reporter Former cop and private investigator Tafadzwa Chidawa will finally leave jail following his acquittal in a case in which he was accused of stealing US$20,000 from one Melody Matanhire four years ago. Harare Magistrate Vongai Guwuriro Muchuchuti cleared Chidawa of wrongdoing after a full trial, ruling that there was insufficient evidence for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/private-investigator-chidawa-free-at-last-acquitted-of-us20k-fraud/\">Private Investigator Chidawa free at last; acquitted of US$20k fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "06 Mar 2025"
        }
    ]
}