{
    "news": [
        {
            "title": "Pambili Natural Resources seeks to raise C$1-mln for Zim venture",
            "url": "https://www.newzimbabwe.com/pambili-natural-resources-seeks-to-raise-c1-mln-for-zim-venture/",
            "content": "By Alois Vinga\n\nPAMBILI Natural Resources Corporation seeks to raise C$1 million whose proceeds will be injected towards the Zimbabwe unit.\n\nThe firm said it intends to raise the funds through a non-brokered private offering of stake of up to 20 million units on the TSX Venture Exchange.\n\nAccordingly, each unit is offered atC$0.05and comprises one common share and one common share purchase warrant with an exercise price ofC$0.10, exercisable for a period of one year from closing of the Offering.\n\nPambili said it intends to pay a finders fee of 5% of the Proceeds in Units. Other than being non-transferable, each Finders Warrant shall otherwise be on the same terms as the Warrants. The Units will be offered pursuant to available prospectus exemptions set out under applicable securities laws and instruments, including National Instrument 45-106  Prospectus Exemptions.\n\nThe participation by Insiders in the Offering will constitute a related party transaction within the meaning of Multilateral Instrument 61 101 Protection of Minority Security Holders in Special Transactions (MI 61-101). The Company intends to rely on exemptions from the formal valuation and minority shareholder approval requirements provided under subsections 5.5(a) and 5.7(a) of MI 61-101 on the basis that participation in the Offering by Insiders will not exceed 25% of the fair market value of the Companys market capitalization.\n\nThe Proceeds will provide general working capital for business development and will be allocated to: Continued development of the CompanysGolden ValleyA1 mining claim (GVM) near Bulawayo,Zimbabwe\n\nCompletion of due diligence at theLondon Wall(LW) project near Gwanda,Zimbabwe. Pambili owns an option to purchase LW (the Option) as previously announced onNov. 19, 2024. The due diligence at LW is expected to lead to pilot production ahead of potential acquisition of LW.\n\nPambili CEO Jon Harris\n\nPambili CEO, Jon Harris expressed optimism over the potential within the LW project.\n\nGiven current gold prices and good historic project fundamentals, we are excited about the potential at the London Wall. This financing will allow us to rehabilitate the historic East Shaft and complete the survey of the old development drives. Our aim is to commence pilot production as soon as possible to enable us to assess the mines commercial viability, he said.\n\nPambili Natural Resources Corporationis a natural resources exploration and development company currently developing gold projects inZimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25050239/pambili.jpg",
            "description": "<p>By Alois Vinga PAMBILI Natural Resources Corporation seeks to raise C$1 million whose proceeds will be injected towards the Zimbabwe unit. The firm said it intends to raise the funds through a non-brokered private offering of stake of up to 20 million units on the TSX Venture Exchange. Accordingly, each unit is offered at C$0.05 and comprises</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pambili-natural-resources-seeks-to-raise-c1-mln-for-zim-venture/\">Pambili Natural Resources seeks to raise C$1-mln for Zim venture</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        },
        {
            "title": "Proteas arrive in Zimbabwe ahead of two Test matches against Chevrons",
            "url": "https://www.newzimbabwe.com/proteas-arrive-in-zimbabwe-ahead-of-two-test-matches-against-chevrons/",
            "content": "By Sports Reporter\n\nICC World Test Champions South Africa arrived in Bulawayo Tuesday ahead of their much-anticipated two-Test series against Zimbabwe at Queens Sports Club.\n\nThe Test games will see the first one running from Saturday the June 28 to July 2, with the second match scheduled for July 6-10.\n\nProteas walk into the Test coming from ICC World Test Series, where they were crowned champions early this month after beating Australia in the final.\n\nThey will however, be without team captain Themba Bavuma who has been sidelined due to an injury.\n\nAfter the two-match Test, Zimbabwe and South Africa will shift base to Harare, where they will face off in the tri-nations T20I series with New Zealand.\n\nThe three-match series will run from July 14-25, with all games slated for Harare Sports Club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25045551/WhatsApp-Image-2025-06-24-at-20.56.01.jpeg",
            "description": "<p>By Sports Reporter ICC World Test Champions South Africa arrived in Bulawayo Tuesday ahead of their much-anticipated two-Test series against Zimbabwe at Queens Sports Club. The Test games will see the first one running from Saturday the June 28 to July 2, with the second match scheduled for July 6-10. Proteas walk into the Test</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/proteas-arrive-in-zimbabwe-ahead-of-two-test-matches-against-chevrons/\">Proteas arrive in Zimbabwe ahead of two Test matches against Chevrons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        },
        {
            "title": "Govt increases surveillance at border posts to curb drug trafficking",
            "url": "https://www.newzimbabwe.com/govt-increases-surveillance-at-border-posts-to-curb-drug-trafficking/",
            "content": "By Mary Taruvinga\n\nZimbabwean government has upped surveillance by introducing drones at border posts to reduce drug trafficking.\n\nAs the fight against drug use continues, during the period from March to June 2 2025, a cumulative 206 raids were conducted nationwide, leading to the dismantling of 39 illicit drug bases and 1,445 suspects.\n\nSpeaking at a post-cabinet briefing Tuesday Information Minister Jenfan Muswere said, Regarding the update on the Supply Reduction Pillar, the Criminal Investigations Departmentreceived five drones from the Ministry of Local Government and Public Works for surveillance purposes at border posts.\n\nForty-one drug kingpins were named and shamed during the period and individuals were sentenced to custodial terms ranging from 12 months to 15 years in prison.\n\nHe said the liquor licensing board inspected 461 premises, 429 of which were licensed.\n\nA total of 32 unlicensed premises were fined US$40 each.\n\nMuswere said the government is committed to empowering youths which will in turn reduce drug and substance abuse in the country.\n\nA total of 70 survivors of drug and substance use are currently undergoing training.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/17045402/Caledon-River-Properties-Pty-Ltd-and-Profteam-CC-were-stripped-of-the-multi-million-rand-profits-they-made-after-erecting-a-weak-mesh-fence-at-Beit-Bridge-border-File-Image.webp",
            "description": "<p>By Mary Taruvinga Zimbabwean government has upped surveillance by introducing drones at border posts to reduce drug trafficking. As the fight against drug use continues, during the period from March to June 2 2025, a cumulative 206 raids were conducted nationwide, leading to the dismantling of 39 illicit drug bases and 1,445 suspects. Speaking at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-increases-surveillance-at-border-posts-to-curb-drug-trafficking/\">Govt increases surveillance at border posts to curb drug trafficking </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        },
        {
            "title": "Never side with oppressors whose hands drip blood –  MMA star shreds Mnangagwa, blames ‘scarf’ for 28 seconds defeat",
            "url": "https://www.newzimbabwe.com/never-side-with-oppressors-whose-hands-drip-blood-mma-star-shreds-mnangagwa-blames-scarf-for-28-seconds-defeat/",
            "content": "By Staff Reporter\n\nMIXED Martial Arts (MMA) fighter Themba The Answer Gorimbo has taken aim at President Emmerson Mnangagwa, accusing him of overseeing an oppressive government.\n\nIn a recent outburst, Gorimbo launched into a tirade against President Mnangagwa, whom he met in 2021 when he was the Extreme Fighting Championship (EFC) heavyweight champion.\n\nGorimbo accused those close to Mnangagwa of corruption, claiming they demanded a bribe for facilitating his meeting with the Zanu PF leader at the State House.\n\nI left Zimbabwe in 2009 for South Africa. I have never worked in Zimbabwe once. Ndakaita garden boy ku Cape Town (handina hangu kubira McMillan family) ndikashanda nesimba mu sport yangu.\n\nNdakashinga kusvika ndaita champion. Then zvikanzi huya uone mukuru wenyika after vaona pic ndina Rama. Ndaenda muface akainda neni aitodawo something (mutonyoro), said Gorimboin now-deleted social media posts.\n\nGorimbo blamed his meeting with President Mnangagwa for his subsequent misfortunes in the octagon.\n\nMunyama wandakaita next fight. Dislocated my shoulder 28 seconds into the fight. Apa ndakapiwa ma scarf kuti ndipfeke. From that day ndakaziva usafa wakainda same side nevanhu vane ropa mumaoko avo iwe une zodzo (kwete ra Dhuterere rekunyepa izvo iye achigamuchira zvokuba nekushaya, kuita zvekutengerwa marriage nemunhu akatorambawo mukadzi wake, he added.\n\nGorimbo is no stranger to criticising the government, having previously clashed with former Minister of Sports, Arts and Culture Kirsty Coventry after she ignored his pleas to include the national flag on his fighting kit.\n\nHe labelled Coventry the worst Sports Minister Zimbabwe has ever had.\n\nPresident Mnangagwa is the latest target of Gorimbos criticism, with the fighter also mocking him for commissioning minor development projects.\n\nLast month, Mnangagwa officially opened the US$88 million Trabablas Interchange.\n\nImagine kubata vanhu face muchiti roundabout what what, kutoiita official ceremony kuhvura road even flying helicopters and wasting state funds to go open roundabout.\n\nMu South Africa umo Rama angasimuka kuinda Pitori kundo opener road? said Gorimbo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25043728/gorimbo.jpg",
            "description": "<p>By Staff Reporter MIXED Martial Arts (MMA) fighter Themba “The Answer” Gorimbo has taken aim at President Emmerson Mnangagwa, accusing him of overseeing an oppressive government. In a recent outburst, Gorimbo launched into a tirade against President Mnangagwa, whom he met in 2021 when he was the Extreme Fighting Championship (EFC) heavyweight champion. Gorimbo accused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/never-side-with-oppressors-whose-hands-drip-blood-mma-star-shreds-mnangagwa-blames-scarf-for-28-seconds-defeat/\">Never side with oppressors whose hands drip blood –  MMA star shreds Mnangagwa, blames ‘scarf’ for 28 seconds defeat </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zimbabwe initiates process to join BRICS bloc",
            "url": "https://www.newzimbabwe.com/zimbabwe-initiates-process-to-join-brics-bloc/",
            "content": "TRT Global\n\nZimbabwe formally initiated the process to join the BRICS grouping of emerging economies Monday after a high-level diplomatic engagement with Brazil, the blocs current chair, in the capital Harare.\n\nThe engagement was between Zimbabwes Foreign Affairs and International Trade Minister Amon Murwira and Brazils Ambassador to Zimbabwe, Vilmar Rogeiro Coutinho Jr.\n\nSpeaking to reporters after the talks, Murwira said they discussed Zimbabwes formal application to be associated with BRICS, with Brazil guiding on the steps to be taken by the southern African nation.\n\nWe have had a lot of positive exchanges and good guidance from Brazil as chair of BRICS on steps that we must take, which we are already taking, he said.\n\nNew members\n\nBrazil currently holds the rotating chairmanship ofthe BRICS bloc, which comprises original members Brazil, Russia, India, China and South Africa and new members Egypt, Ethiopia, Iran, Saudi Arabia, the United Arab Emirates and Indonesia.\n\nZimbabwe has received valuable guidance from Brazil on the procedural steps for membership, Murwira added.\n\nSeparately, Coutinho said the two countries were working together towards a successful conclusion of Zimbabwe becoming a BRICS member.\n\nAs the minister highlighted, Zimbabwe has expressed a clear interest in joining BRICS, and we are working together towards a successful conclusion, he added.\n\nThe BRICS group was established in 2006 and South Africa joined the original four members in 2010 as a first African member state to the bloc.\n\nBRICS aims to promote and strengthen south-south cooperation and foster development through shared initiatives, among other goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24134447/brics.webp",
            "description": "<p>TRT Global Zimbabwe formally initiated the process to join the BRICS grouping of emerging economies Monday after a high-level diplomatic engagement with Brazil, the bloc’s current chair, in the capital Harare. The engagement was between Zimbabwe’s Foreign Affairs and International Trade Minister Amon Murwira and Brazil’s Ambassador to Zimbabwe, Vilmar Rogeiro Coutinho Jr. Speaking to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-initiates-process-to-join-brics-bloc/\">Zimbabwe initiates process to join BRICS bloc</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zimbabwe ‘amped’ to test themselves against world champion Proteas",
            "url": "https://www.newzimbabwe.com/zimbabwe-amped-to-test-themselves-against-world-champion-proteas/",
            "content": "SABC Sport\n\nZimbabwe head coach Justin Sammons says his team is looking forward to testing themselves against world champions South Africa in the two-match Test series thats gets underway in Bulawayo on Saturday.\n\nThe Proteas arrive in Zimbabwe having beaten Australia in the World Test Championship final at Lords earlier this month, breaking an ICC trophy drought that spanned for 27 years.\n\nZimbabwe have already been in camp preparing for the challenge of their African neighbours and Sammons says the players are eager to rise to the occasion.\n\nTheres a real buzz around the squad. I think theyre very excited. Im super excited for the challenge that lies ahead and the guys are amped for it, Sammons said.\n\nTheyre looking forward to testing themselves and showing what theyre capable of. I think they really want to make a statement over the next couple of weeks.\n\nThe home sides preparations has been to focus on building intensity and volume while ensuring all fundamentals are being addressed before shifting to specific tactical planning.\n\nDespite the demanding sessions, Sammons said the players had responded with enthusiasm and purpose.\n\nHe added: Right now, its more about making sure were covering all our bases . . . its more around the volume, and then we get a little bit more specific as we head closer to the Test.\n\nThe attitude is good. Its always good. We can never fault the attitude. Theyre always wanting to get the most out of each other and improve as much as they can, and again, theyve shown that over the last few days.\n\nThe second and final Test of series will also be played at the Queens Sports Club in Bulawayo from 6 July before the teams move to Harare for a T20I tri-series that will also feature New Zealand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24134258/justin-sammons16_1206x678.webp",
            "description": "<p>SABC Sport Zimbabwe head coach Justin Sammons says his team is looking forward to testing themselves against world champions South Africa in the two-match Test series thats gets underway in Bulawayo on Saturday. The Proteas arrive in Zimbabwe having beaten Australia in the World Test Championship final at Lord’s earlier this month, breaking an ICC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-amped-to-test-themselves-against-world-champion-proteas/\">Zimbabwe ‘amped’ to test themselves against world champion Proteas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        },
        {
            "title": "South Africans and Zimbabweans pray together after xenophobic attacks in Addo",
            "url": "https://www.newzimbabwe.com/south-africans-and-zimbabweans-pray-together-after-xenophobic-attacks-in-addo/",
            "content": "By Joseph Chirume,GroundUp\n\nLast month, the killing of a South African man in Valencia, Addo, spurred devastating xenophobic revenge attacks, killing at least four immigrants and injuring dozens. Hundreds of families were displaced from their homes.\n\nOn Sunday, to mark World Refugees Day, about 200 residents of Valencia, South Africans and immigrants, came together at the community hall. They prayed for peace and order in their community.\n\nCandles were lit and 10 white balloons were released as a sign of peace. Half the balloons were released by the family members of Juane September, the South African man whose murder sparked the attacks. The other half were released by Zimbabweans.\n\nGerald September, Juanes father, was at the event. I dont think I will ever recover from this tragic loss, he said.\n\nZimbabwean pastor and Valencia resident of ten years Ngonidzashe Chikanya said the prayer session was also meant to help displaced immigrants reintegrate into the community.\n\nHe said those affected were still dumbfounded by the incident as it happened within the blink of an eye.\n\nPeople are still in shock.\n\nIn the streets of Valencia, peace and calm seem to have returned. Many of the displaced families have returned. However, more than 100 Zimbabweans who were arrested by the Department Home Affairs while trying to seek shelter from the attacks, have opted to bevoluntarily deported.\n\nA Zimbabwean man who recently returned to Valencia said while he was away his home was robbed of all his belongings. No one wants to account for that, he said. This has put him back 10 years and he has had to borrow money to pay rent and purchase essentials, he said.\n\nMorne Serome, deputy chairman of a newly formed group of South African and Zimbabwean church leaders, said they will visit local schools soon to educate children about the importance of living peacefully with immigrants.\n\nIts time for the church to play a pivotal role in bringing people together, Serome said.\n\nGrade seven learner Lihle Kula, 16, said she was heartbroken to witness immigrants being killed and beaten by people who had lived with them for several years.\n\nI was powerless and at the same time fearing for my life. I could do nothing because the mob was angry and violent. It is very disturbing that a person leaves his country to look for opportunities in a foreign country, only to return home in a coffin after being murdered in cold blood.\n\nShelton Ciyangwa, Secretary General of the Zimbabwe Migrants Support Network, said two of the deceased Zimbabweans had been repatriated to Zimbabwe. Another deceased, from Malawi, has also been repatriated. The network is still raising funds to repatriate a third deceased, from Zimbabwe. And a fourth man is yet to be identified by family or next of kin.\n\nThere have still not been any arrests of perpetrators of the violence, police spokesperson Warrant Officer Majola Nkohli said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24133920/addo_memorial_extra_large.jpg",
            "description": "<p>By Joseph Chirume, GroundUp Hundreds of residents of Valencia, Addo came together to pray for peace and order after recent xenophobic attacks. There have still not been any arrests, almost a month after one South African and four immigrants were murdered. Many of the displaced immigrant families have returned to Valencia. Last month, the killing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africans-and-zimbabweans-pray-together-after-xenophobic-attacks-in-addo/\">South Africans and Zimbabweans pray together after xenophobic attacks in Addo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "25 Jun 2025"
        }
    ]
}