{
    "news": [
        {
            "title": "ADRA employee in court over US$1 million fraud",
            "url": "https://www.newzimbabwe.com/adra-employee-in-court-over-us1-million-fraud/",
            "content": "By Staff Reporter\n\nAn Adventist Development and Relief Agency (ADRA) employee was taken to court on fraud charges after he allegedly swindled his employer of over US$1 million.\n\nFortune Goredema appeared before Harare regional magistrate Marewanazvo Gofa, who granted him US$1,000.\n\nGoredema was also put under stringent bail conditions, which will see him reporting three times a week to the police.\n\nHe was also ordered to surrender his passport and title deeds to his house as part of his bail conditions.\n\nIt is the states case that in July last year, the organisation received a tip-off that Goredema was misusing their funds.\n\nActing on the information, the ADRA board initiated a forensic audit.\n\nThe audit was done by General Conference Auditing Services (GCAS), which picked up that from 2018 to 2024, Goredema defrauded the organisation using PAYE to the Zimbabwe Revenue Authority (Zimra).\n\nThe court heard he would allegedly post fictitious information in the ADRA accounting system, purporting that money was paid to Zimra when no money was paid.\n\nHe also allegedly misrepresented that he paid NSSA dues, knowing this was false.\n\nHe also misrepresented the nature of periodic financial statements in collaboration with the external auditors Baker Tilly who then confirmed during the audit session that the figures were understated, reads court papers.\n\nThe court heard Goredema had not met the requirements for statutory obligations of US$1,209,397 meant for Zimra PAYE and US$160,437 for NSSA dies.\n\nHe was overpaying himself and a total of US$118,578.69 was directed as his remuneration in the period from 2023 to 2024, said the National Prosecuting Authority.\n\nThe court heard that after the scam was unearthed, Goredema allegedly admitted to the allegations and sought redress and leniency.\n\nThe matter could not be resolved within the church because some of the money was donated; as such, accountability was a priority.\n\nThe complainant suffered an actual prejudice of US$1,488,403.\n\nNothing was recovered.\n\nLancelot Mutsokoti prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter An Adventist Development and Relief Agency (ADRA) employee was taken to court on fraud charges after he allegedly swindled his employer of over US$1 million. Fortune Goredema appeared before Harare regional magistrate Marewanazvo Gofa, who granted him US$1,000. Goredema was also put under stringent bail conditions, which will see him reporting three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/adra-employee-in-court-over-us1-million-fraud/\">ADRA employee in court over US$1 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Zimbabwe has $9billion plan to join African electricity drive",
            "url": "https://www.newzimbabwe.com/zimbabwe-has-9billion-plan-to-join-african-electricity-drive/",
            "content": "The plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of the countrys power production from hydro, wind, solar and biomass plants.\n\nZimbabwe laid out plans to raise more than $9 billion to boost energy access at a conference in London on Wednesday, an event organized by multilateral lenders to promote a flagship African electrification program to private investors.\n\nThe plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of the countrys power production from hydro, wind, solar and biomass plants, a copy of the presentation sent to Bloomberg showed. Zimbabwe has been hit by regular power outages in recent years, often lasting most of the day, due to a lack of generation capacity.\n\nMission 300, which the banks unveiled at a conference in Tanzania in January, aims to bring electricity to 300 million people in sub-Saharan Africa by 2030 at a cost of tens of billions of dollars sourced from development finance institutions and private investors. The region is home to about 83% of the 680 million people globally who dont have access to electricity.\n\nDespite having abundant renewable energy potential, Zimbabwe continues to face critical energy challenges, July Moyo, the countrys energy minister, wrote in the plan, titledZimbabwes National Energy Compact.As of 2024, 38% of the population lacks access to electricity.\n\nZimbabwes ambitions of benefiting from the program are complicated by the fact that it has been in default to multilateral lenders  including the World Bank  for a quarter of a century. That means it cant borrow money from them and the finance it needs will have to come largely from private investors.\n\nUnder the plan Zimbabwe plans to seek:\n\nGhana, Togo, Mozambique and Burundi are also scheduled to present their plans at the conference, which isnt open to the media, on Wednesday. Eleven countries, including the Democratic Republic of Congo and Nigeria, disclosed their blueprints to boost electrification at the Tanzania conference.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04192823/solar-in-harare.jpg",
            "description": "<p>Bloomberg The plan, which falls under the World Bank and African Development Bank’s Mission 300 program, envisages a more than doubling of the country’s power production from hydro, wind, solar and biomass plants. Zimbabwe laid out plans to raise more than $9 billion to boost energy access at a conference in London on Wednesday, an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-has-9billion-plan-to-join-african-electricity-drive/\">Zimbabwe has $9billion plan to join African electricity drive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "ZWG annual inflation will not affect consumer purchasing power – Central Bank",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics.\n\nThis comes afterinflation statistics by the Zimbabwe National Statistics Agency (Zimstat)revealedthat annual inflation surged to 92,1% in the month of September 2025.\n\nThe developments recently triggered an outcry from industry, which blamed the September 2024 43% local currency devaluation directive for pushing up the inflationary pressures. The business community also contends that the high ZWG annual inflation rates pose challenges for businesses, particularly due to the impact on interest rates.\n\nBut in a statement Wednesday, the RBZ governor, Dr John Mushayavanhu, said the transition from the ZW$ to ZWG-denominated prices inevitably created a statistical gap in the calculation of annual inflation figures. This resulted in Zimstat computing and publishing yearly inflation in April 2015 after obtaining a full year of ZWG prices.\n\nThe RBZ therefore, advised the public that the recorded rise in year-on-year ZWG inflation in April and May 2025 is primarily due to the base effect emanating from the once-off spike in monthly inflation from 5,8% in September 2024 to 37,2% in October 2024.\n\nThe current trend in annual inflation is expected to continue up to September 2025 and decline thereafter to align with the current low and stable monthly inflation. The current annual inflation will therefore not affect consumer purchasing power and value preservation, as the inflation impact has already been realised, said Mushayavanhu.\n\nThe central bank exchequer said going forward, the economy is projected to decline to 30% by 31 December 2025 and to further decline towards single-digit levels in the outlook period.\n\nConsidering the current pricing circumstances where annual ZiG inflation is not reflective of the current pricing dynamics, the RBZ encourages economic agents to focus on month-on-month inflation, which has a more direct link to current ZWG purchasing power expectations.\n\nThe monthly ZWG inflation will remain low and stable as Monetary Policy remains appropriately tight to balance price stability and economic growth, added Mushayavanhu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics. This comes after inflation statistics by the Zimbabwe National Statistics Agency (Zimstat) revealed that annual inflation surged to 92,1% in the month of September 2025. The developments recently triggered an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/\">ZWG annual inflation will not affect consumer purchasing power – Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "05 Jun 2025"
        },
        {
            "title": "Rights Commission slams authorities for unlawful detention of 66 irregular migrants",
            "url": "https://www.newzimbabwe.com/rights-commission-slams-authorities-for-unlawful-detention-of-66-irregular-migrants/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned the detention of 66 irregular migrants of various nationalities, stating that their continued imprisonment violates their rights as they are neither facing criminal charges nor awaiting trial.\n\nAccording to ZHRC, the 66 detained at Harare Remand Prison are from Burundi, Ethiopia, Malawi, South Africa, Libya, Mozambique, China, Pakistan, Taiwan, India, the United Kingdom, France and Cape Verde.\n\nIn a press statement Wednesday following its recenthuman rights monitoringvisitto Harare Remand Prison, ZHRC urged authorities to immediately endthe practice of detaining migrants indefinitely.\n\nThere were 66 irregular migrants of different nationalities whose detention was in violation of their rights as they were not facing any criminal charges and were not awaiting trial.\n\nIn light of these findings, ZHRC urged relevant authorities to take immediate action to desist from imprisonment of irregular migrants whose issues should be handled without resorting to indefinite detention, the statement reads.\n\nZimbabwe currently does not have detention facilities for irregular immigrants that are not prisons.\n\nSome illegal immigrants end up staying in prison for more than ten years awaiting deportation.\n\nAccording to Immigration Chief Director Respect Gono last year, as of September 23, there were 368 jailed illegal immigrants, 274 were awaiting deportation, 61 were serving prison sentences, and 33 were awaiting trial for various offences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned the detention of 66 irregular migrants of various nationalities, stating that their continued imprisonment violates their rights as they are neither facing criminal charges nor awaiting trial. According to ZHRC, the 66 detained at Harare Remand Prison are from Burundi, Ethiopia, Malawi, South Africa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-commission-slams-authorities-for-unlawful-detention-of-66-irregular-migrants/\">Rights Commission slams authorities for unlawful detention of 66 irregular migrants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "05 Jun 2025"
        }
    ]
}