{
    "news": [
        {
            "title": "Maswanhise signs new contract to extend stay at Motherwell FC",
            "url": "https://www.newzimbabwe.com/maswanhise-signs-new-contract-to-extend-stay-at-motherwell-fc/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanise has signed a new contract with Scottish side Motherwell FC.\n\nMaswanhises new commitment will see him staying at the club until 2027.\n\nThe 22-year-old Zimbabwean international joined the side in July last year from Leicester and made an instant impact during 2024-25 season.\n\nWith four goals to his name already this season, Motherwell FC could not wait longer to tie down the Zimbabwean, whom they have given a two-year contract with an option to extend.\n\nSpeaking after signing his contract, Maswanhise said, I have truly enjoyed my time here.\n\nUltimately, I wanted to stay, and signing this deal was a straightforward choice. The fans, players, and staff are all fantastic. Ive felt valued by everyone, which motivates me to keep contributing my best.\n\nI will keep working hard and giving my all for this football club. Its an exciting time.\n\nSince arriving at Motherwell, Maswanhise has made 40 appearances, in the process, he scored 10 goals and provided several assists.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/14164801/tawanda-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanise has signed a new contract with Scottish side Motherwell FC. Maswanhise’s new commitment will see him staying at the club until 2027. The 22-year-old Zimbabwean international joined the side in July last year from Leicester and made an instant impact during 2024-25 season. With four goals to his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-signs-new-contract-to-extend-stay-at-motherwell-fc/\">Maswanhise signs new contract to extend stay at Motherwell FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "14 Aug 2025"
        },
        {
            "title": "Constitutional Court trashes application by CUT lecturer challenging dismissal",
            "url": "https://www.newzimbabwe.com/constitutional-court-trashes-application-by-cut-lecturer-challenging-dismissal/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court of Zimbabwe has dismissed an application by former Chinhoyi University of Technology lecturer Godfrey Mugari, who sought a declaratory order stating that his dismissal was unconstitutional and that he had been denied his right to a fair hearing.\n\nDelivering the judgment, Justice Hlatshwayo, sitting with two other judges, found that Mugari had effectively waived his right to defend himself during the disciplinary proceedings that ultimately led to his dismissal.\n\nIn his application, Mugari claimed that he was denied the opportunity to contest charges of absenteeism and unauthorised release of confidential information while he was suspended and studying in China.\n\nHe argued that his circumstances had prevented him from attending the hearing, claiming, My departure to China did not waive my right to be heard or to challenge the proceedings before the disciplinary authority.\n\nHowever, the court ruled that Mugaris absence was a direct result of his own actions, as he had chosen to leave the country without the universitys authorisation.\n\nAn employee who has been suspended has the obligation to avail himself for work when called upon to do so It is of no consequence that no provision in that regard is contained in the contract of service.\n\nThe court acknowledged that Mugari had the right to legal representation but noted that his counsel had left the proceedings after indicating he had no further instructions from the client.\n\nThe legal practitioner voluntarily excused himself The consequences are the same, further asserting that this choice, effectively coupled with Mugaris departure, led to the waiver of his right to be heard.\n\nThe court referenced previous cases to support its decision, stating, The right to be heard is not an absolute immutable rule of law. It can be waived or forfeited where the beneficiary is at fault.\n\nIn dismissing the application, the judges acknowledged the importance of maintaining the integrity of the disciplinary process, warning against setting a precedent that would allow employees to sidestep disciplinary consequences.\n\nIf participants were allowed to pull out of these processes without consequence and subsequently seek a review the whole labour dispute resolution mechanism would face certain collapse, the judgment read.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/06070859/CUT-1-1.png",
            "description": "<p>By Mary Taruvinga The Constitutional Court of Zimbabwe has dismissed an application by former Chinhoyi University of Technology lecturer Godfrey Mugari, who sought a declaratory order stating that his dismissal was unconstitutional and that he had been denied his right to a fair hearing. Delivering the judgment, Justice Hlatshwayo, sitting with two other judges, found</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/constitutional-court-trashes-application-by-cut-lecturer-challenging-dismissal/\">Constitutional Court trashes application by CUT lecturer challenging dismissal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "14 Aug 2025"
        },
        {
            "title": "Two prison officers, five others arrested for robbery spree — court hears gang posed as searching for fugitive Geza",
            "url": "https://www.newzimbabwe.com/two-prison-officers-five-others-arrested-for-robbery-spree-court-hears-gang-posed-as-searching-for-fugitive-geza/",
            "content": "By Staff Reporter\n\nTWO rogue Zimbabwe Prisons and Correctional Services (ZPCS) wardens have been arrested alongside five accomplices following a spate of armed robberies in Chinhoyi.\n\nThe ZPCS pair of Tawanda Marumahoko (37) and Christopher Gomwe (43) was nabbed together with co-accuseds, namely, Shingirirai Chipuve (26), Elias Makasi (52), Abel Mangoma (24), Maxwell Karavhina (42) and Enoch Hwenjere (age not given).\n\nThe seven have since appeared at the Chinhoyi Magistrates Court, facing multiple counts of robbery and were remanded in custody.\n\nIn one of the gangs dramatic heists, on June 30, 2025, accused persons clad in police uniforms and armed with two rifles, proceeded to the complainant Sithabisiwe Sibandas house in Mzari Extension, Chinhoyi.\n\nUpon arrival, they introduced themselves as a joint team of police officers and Central Intelligence Organisation (CIO) operatives on a mission to locate fugitive former Zanu PF Central Committee member Blessed Bombshell Runesu Geza wanted for undermining the Office of the President and inciting violence.\n\nIt was heard in court that the gang interviewed the complainant and other occupants of the house, including Belinda Tira, accusing them of harbouring Geza. They threatened to shoot the complainants dead before tying their hands using cable ties and ransacking the house.\n\nThe gang proceeded to the main bedroom and stole US$28,000 before driving off in a blue pick-up motor vehicle.\n\nIn another count, accused persons manhandled complainant and struck him once with a bolt cutter and several times with a machete. They forcibly took his Huawei P40 cellphone before ransacking the house and stole US$132,000 cash.\n\nAccording to records, the gang also pounced on several premises around the Golf Course area in Mzari suburb, where they broke into houses before ransacking them, stealing valuables including cellphones, laptops and cash.\n\nOn July 22, 2025, during wee hours, the gang, armed with machetes and bolt cutter, pounced on properties belonging to complainants, Charles Mukarimani, Charles Jimu, Innocent Tarwira and Brighton Kajengo and stole cellphones and cash.\n\nFollowing the gangs arrest, a Honda Vezel, a Toyota Mark X, a Toyota Quantum and a residential stand in Mshumavale in Kadoma bought from the proceeds of the crimes were recovered.\n\nThe matter was remanded to August 25 for routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter TWO rogue Zimbabwe Prisons and Correctional Services (ZPCS) wardens have been arrested alongside five accomplices following a spate of armed robberies in Chinhoyi. The ZPCS pair of Tawanda Marumahoko (37) and Christopher Gomwe (43) was nabbed together with co-accuseds, namely, Shingirirai Chipuve (26), Elias Makasi (52), Abel Mangoma (24), Maxwell Karavhina (42)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-prison-officers-five-others-arrested-for-robbery-spree-court-hears-gang-posed-as-searching-for-fugitive-geza/\">Two prison officers, five others arrested for robbery spree — court hears gang posed as searching for fugitive Geza</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "14 Aug 2025"
        },
        {
            "title": "Harare City Council threatens to evict Mbare flats residents",
            "url": "https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/",
            "content": "By Staff Reporter\n\nDESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in.\n\nHarare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted.\n\nIn a notice dated June 18 2025, the director of housing, Addmore Nhekairo gave the residents an ultimatum to settle the arrears the City Council is owed by the residents.\n\nPlease be advised that since you have ignored various reminders and notices to clear the outstanding rental arrears, you are hereby served with a final notice to pay the outstanding amount or vacate the property to avoid continuous prejudice to council.\n\nYou are advised to settle your obligations within 14 days from date of receipt of this final notice. Failure to pay monthly rentals is a serious breach of the agreement of lease which mandates City of Harare to evoke the conditions of lease and recover holding costs from the same.\n\nNotwithstanding the availability or none of the lease agreement, council shall not be prejudiced in its rights to recover holding costs from the lessee for breach of mutual understanding, read the notice.\n\nThe notice comes on the back of Harare City, on the drive to recover money it is being owed by tenants leasing their properties.\n\nHowever, in Mbare, Harare City is under pressure to renovate the flats which are becoming uninhabitable.\n\nLast year, the High Court ordered Harare City Council to renovate the flats to match decent living standards. The City fathers have appealed the judgement.\n\nIn an interview with NewZimbabwe.com, Combined Harare Residents Association (CHRA) director, Ruben Akili, said the deplorable living conditions have dissuaded tenants from paying their rentals.\n\nThese are the same flats which we had a court order for renovations. As you are aware all the flats in Mbare were supposed to be renovated. The situation in Mbare is unacceptable sewer is gushing all over and many things are just happening and many things are happening.\n\nFrom CHRAs perspective is that some residents are paying and some are not paying. Local Authority should address the fundamental problems that speaks to the reasons why residents are not paying, said Akili.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Staff Reporter DESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in. Harare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/\">Harare City Council threatens to evict Mbare flats residents </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "14 Aug 2025"
        },
        {
            "title": "Govt seizes over 4,000 units of fake goods, prosecutes 419 businesses in nationwide smuggling crackdown",
            "url": "https://www.newzimbabwe.com/govt-seizes-over-4000-units-of-fake-goods-prosecutes-419-businesses-in-nationwide-smuggling-crackdown/",
            "content": "By Thandiwe Garusa\n\nA total of 3,779 businesses have been inspected nationwide, resulting in 419 prosecutions and the seizure of more than4,000 substandard products, as authorities intensify a crackdown on smuggling and consumer rights violations.\n\nThe Ministry of Industry and Commerce says it has been carrying out surprise inspections on businesses and prosecuting offenders for selling counterfeit goods, underweight products, using multi-tier pricing, and other unfair practices.\n\nRecently, the ministrys officials, together with the Standards Association of Zimbabwe (AZ) conducted a survey which revealed that nearly 50% of groceries being sold from tuck shops and vending stalls are fake and potentially hazardous to health.\n\nIn a statement on Wednesday, the Ministry of Commerce and Industry said over 3,000 businesses have been inspected nationwide and over 400 have been prosecuted in order to protect consumers and promote fair trade.\n\nA nationwide crackdown on smuggling is underway and it involves impromptu inspections on businesses to ensure compliance with regulations.\n\nOffenders who exploit consumers through unfair practices including; selling counterfeit products, delivering underweight goods, imposing multi-tier pricing schemes, and using inadequate labelling, among other deceptive dealings, are being prosecuted.\n\nThe Ministry is pleased to inform the public that to date, a cumulative total of 3779 businesses have been inspected with 419 prosecutions finalised. A total of 402 compliance notices have been issued and 4,816 units of various substandard products were seized, the statement reads.\n\nThe ministry also warned businesses against violating the Consumer Protection Act (2019), which is administered to protect consumers and ensure that businesses adhere to fair and ethical practices.\n\nMeanwhile, due to economic hardships, most citizens buy groceries from tuck shops where they are cheaper compared to supermarkets.\n\nSome of these products are smuggled from neighbouring countries, South Africa and Zambia, while some are being illegally produced locally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26164728/tuckshop.gif",
            "description": "<p>By Thandiwe Garusa A total of 3,779 businesses have been inspected nationwide, resulting in 419 prosecutions and the seizure of more than 4,000 substandard products, as authorities intensify a crackdown on smuggling and consumer rights violations. The Ministry of Industry and Commerce says it has been carrying out surprise inspections on businesses and prosecuting offenders for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-seizes-over-4000-units-of-fake-goods-prosecutes-419-businesses-in-nationwide-smuggling-crackdown/\">Govt seizes over 4,000 units of fake goods, prosecutes 419 businesses in nationwide smuggling crackdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "14 Aug 2025"
        },
        {
            "title": "Fatal road accidents surge over Heroes and Defence Forces holiday – police",
            "url": "https://www.newzimbabwe.com/fatal-road-accidents-surged-during-heroes-holiday-police/",
            "content": "By Mary Taruvinga\n\nRoad carnage worsened over the Heroes and Defence Forces holidays, with fatalities jumping from 16 last year to 24 this year, and fatal crashes rising from eight to 13, according to police statistics.\n\nThe total number of accidents recorded during the period climbed from 149 to 196, with 96 people injured.\n\nPolice spokesperson Commissioner Paul Nyathi said the accidents were mostly caused by reckless driving, speeding, mechanical faults and dangerous overtaking.\n\nAmong the worst incidents was the 11 August MutareMasvingo Road disaster in which six Zion Christian Church congregants were killed and 16 injured when a hired Quantum veered off the road and overturned near the 283km peg. The passengers were travelling from Gokwe to Chimanimani.\n\nA day later, four people died and 17 were injured on the BinduraShamva Road when a Toyota Hiace tyre burst, sending the overloaded vehicle off the road.\n\nOther fatal crashes included a Toyota Hilux overturning on the MasvingoMbalabala Road on 11 August, killing two, and a ChechecheRimai Road tragedy in which a 16-year-old girl died after falling from a moving sand-laden lorry and being run over.\n\nPedestrians were also victims. In Harare, a man was killed on Delport Road in Hatfield on 12 August after being hit by a Toyota Spade, while another was injured on High Glen Road the previous day.\n\nDespite commending public service operators for cooperation during the period, police urged motorists to service vehicles, avoid speeding, and adhere strictly to road rules.\n\nAbove all, drivers should adhere to all road rules and regulations in order to curb the continuous loss of lives through road traffic accidents, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/11080754/accident.jpg",
            "description": "<p>By Mary Taruvinga Road carnage worsened over the Heroes and Defence Forces holidays, with fatalities jumping from 16 last year to 24 this year, and fatal crashes rising from eight to 13, according to police statistics. The total number of accidents recorded during the period climbed from 149 to 196, with 96 people injured. Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fatal-road-accidents-surged-during-heroes-holiday-police/\">Fatal road accidents surge over Heroes and Defence Forces holiday – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "14 Aug 2025"
        }
    ]
}