{
    "news": [
        {
            "title": "Incest monster Josef Fritzl who sired 7 children with daughter demands a house ‘with a basement’ if freed",
            "url": "https://www.newzimbabwe.com/incest-monster-josef-fritzl-who-sired-7-children-with-daughter-demands-a-house-with-a-basement-if-freed/",
            "content": "By Agencies\n\nJOSEF Fritzl has demanded a house with a basement if he is released from prison, as he continues to pursue an early release from prison.\n\nFritzl, 89, is demanding a house with a basement if he wins his freedom, as his lawyers try to use his dementia as a reason to secure his early release from prison.\n\nThe convicted rapist infamously fathered seven children with his daughter Elisabeth over 24 years, while entrapping her as a sex slave for 24 years in the basement of their Austria family home.\n\nSince he was sentenced to life imprisonment in 2009 he has been held in high-security psychiatric detention at Stein prison.\n\nBut because of his dementia, doctors might declare Austrias most famous prisoners unfit for imprisonment next year.\n\nHis lawyer, Astrid Wagner, told German press that every day he dreams of having his own house or apartment.\n\nMs Wagner told the Heute talk show that Fritzl doesnt care where exactly his life will be outside, though last year the criminal said he wanted to move to the UK and roam the highlands of Scotland.\n\nMs Wagner added that the 89-year-old no longer feels confident driving after so many years without practice, so he wants to live near a train connection.\n\nBut the main thing the rapist demanded was that the apartment or house must have a basement.\n\nThe eerie demand, considering that he imprisoned his daughter in a basement for 24 years, is apparently so he can store his files and documents.\n\nYou know, I have so many files, documents and memories, Fritzl said.\n\nIn fact, his cell is currently piled high with many folders and boxes filled with papers.\n\nLast year, public officials in Krems, a town West of Austrian capital Vienna, confirmed Fritzl will be placed under guardianship due to his declining mental state.\n\nThis means the court will appoint someone to make decisions on Fritzls behalf after he has been deemed unable to make them on his own.\n\nBut Fritzls lawyer, Astrid Wagner, informed Austrian media that she would be fighting the process as she considers the appointment of an adult to manage his affairs as not tenable  on the basis that he has no business to attend to and does not own any property.\n\nWagner says there is no necessity nor justification for appointing an adult representative, despite the fact Fritzl has beginning dementia and delusional episodes.\n\nFritzl has been transferred from Steins correctional facility to a cell in the normal prison following a decision by a three-member panel in the Krems Regional Court.\n\nBut the sex-offender pensioner was denied a general conditional release from normal prison in mid-May, with authorities deeming it not possible for special preventive reasons.\n\nThey said that future freedom from crime cannot be guaranteed due to the unprecedented criminal energy in connection with the convicted crimes.\n\nFritzl reportedly plans to move to the UK if he is ever released from prison.\n\nWhen I get released, it is not Austria I want to stay [in], rather I want to emigrate to the UK. Above all I want to roam free on the wild Highlands of Scotland, he said according to the Sun.\n\nFor me the lush green fields of Wales are also very, very appealing, but the main thing is its to the United Kingdom I am headed.\n\nFritzls crimes involved rape, coercion and imprisonment, keeping his daughter and her children trapped in a basement for years as he raped her thousands of times.\n\nElisabeth was abused from the age of 11, and was locked in the cellar from the age of 18 until she was 42.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08183242/2009-provincial-courthouse-sankt-poelten-74930898.jpg",
            "description": "<p>By Agencies JOSEF Fritzl has demanded a house ‘with a basement’ if he is released from prison, as he continues to pursue an early release from prison. Fritzl, 89, is demanding a house with a basement if he wins his freedom, as his lawyers try to use his dementia as a reason to secure his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/incest-monster-josef-fritzl-who-sired-7-children-with-daughter-demands-a-house-with-a-basement-if-freed/\">Incest monster Josef Fritzl who sired 7 children with daughter demands a house ‘with a basement’ if freed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Shock as boy (9) commits suicide; Police express worry over growing trend of minors taking own lives",
            "url": "https://www.newzimbabwe.com/shock-as-boy-9-commits-suicide-police-express-worry-over-growing-trend/",
            "content": "By Staff Reporter\n\nIN a bizarre incident which has left members of the Mhondoro community shocked, a nine-year-old boy committed suicide by hanging from a tree.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector lan Kohwera confirmed the incident.\n\nThe now deceased was identified as Malvern Runyararo of Denhere village under Chief Chivero.\n\nPolice Mashonaland West province confirm a sudden death incident in which a juvenile aged 9 years committed suicide by hanging.\n\nMalvern Runyararo of Denhere village Chief Chivero was found hanging on a tree using a rope by one of the village members Rodrick Andrea (47) on 29 December 2024, said Kohwera.\n\nCircumstances are that on the night of December 28,2024, the boys family retired to bed and everyone went to their bedroom.\n\nThe following morning, informant discovered Malverns lifeless body dangling from a tree before alerting his family.\n\nA police report was made at ZRP Gonza Base who attended the scene and conveyed the body to Norton District Hospital mortuary for post-mortem.\n\nInvestigations are reportedly still in progress to ascertain the cause of the death.\n\nInspector Kohwera said authorities are concerned with suicidal deaths amongst minors, which have become prevalent throughout the province.\n\nIt is worrisome that the trend is increasing were minors take their lives after being corrected by their parents or guardians.\n\nWe appeal to the general public to counsel young people that taking their life after being corrected is not a solution rather they must appreciate it inorder to become future leaders, the police spokesman said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/09191405/hang-suicide.jpg",
            "description": "<p>By Staff Reporter  IN a bizarre incident which has left members of the Mhondoro community shocked, a nine-year-old boy committed suicide by hanging from a tree. Zimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector lan Kohwera confirmed the incident. The now deceased was identified as Malvern Runyararo of Denhere village under Chief Chivero. “Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shock-as-boy-9-commits-suicide-police-express-worry-over-growing-trend/\">Shock as boy (9) commits suicide; Police express worry over growing trend of minors taking own lives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Zanu PF activist claims fired CIO boss Isaac Moyo was working with French Intelligence to undermine Zimbabwe",
            "url": "https://www.newzimbabwe.com/zanu-pf-activist-claims-fired-cio-boss-isaac-moyo-was-working-with-french-intelligence-to-undermine-zimbabwe/",
            "content": "By Staff Reporter\n\nZANU PF activist Rutendo Matinyarare has made sensational claims that fired Central Intelligence Organisation (CIO) director-general Isaac Moyo was compromised and had been working with French Intelligence to undermine Zimbabwes security since his appointment in 2017.\n\nAccording to the controversial Matinyarare, Moyos relationship with the French dates back 15 years to his time as African Union (AU) executive secretary.\n\nSpeaking after Moyos dismissal by President Emmerson Mnangagwa less than a week ago, Matinyarare said the former spy boss was now touchable as past efforts to raise the issue did not stick.\n\nFor years, insiders within the AU and intelligence networks across Africa warned us of how Moyo was compromised, especially his alleged ties to French intelligence during his time as Executive Secretary at the African Union. But as a sitting head of intelligence, he was untouchableuntil now, said Matinyarare.\n\nThis removal is proof that President Mnangagwa is armed with enough intelligence to act decisively against those working against the nation of Zimbabwe.\n\nIt signals the beginning of a critical cleanup within our security apparatus.\n\nNo reasons were given for Moyos removal as head of the dreaded CIO in Chief Secretary to the President and Cabinet Martin Rushwayas statement, however.\n\nMatinyarare, who has numerous defamation cases before Zimbabwean and South African courts, proceeded to accuse Moyo of fighting the Zimbabwe Anti-Sanctions Movement (ZASM)s efforts to fight for the removal of restrictive measures imposed on local individuals and companies.\n\nMatinyarare leads the ZASM in his capacity as chairperson.\n\nThe greatest opposition to our anti-sanctions and anti-GMO campaigns came not from foreign enemies, but from the very institution that should have been our greatest allythe CIO, said Matinyarare.\n\nNonetheless, despite this betrayal, we found critical support from counter-forces within the system who defied the DGs orders and followed higher orders to help us fight for Zimbabwe.\n\nA few of those who initially stood with us in the fight against sanctions, were later turned against us in the anti-GMO fight, as they aligned themselves with smugglers of toxic GMOs, forex externalisers, and economic saboteurs on the instruction of Moyo and his inner circle.\n\nRumour has it that the DG and his close personal circle had been put on a hefty retainer by some of the GMO smugglers to destroy me, for daring to fight against their smuggling and forex externalisation operations.\n\nNow that Moyo is gone, we hope the President clears out the remaining elements of his corrupt regimethose on foreign payrolls, those on the payrolls of those sabotaging our economy, our currency, and the Presidents agenda to rebuild Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08185755/isaac-moyo.jpg",
            "description": "<p>By Staff Reporter ZANU PF activist Rutendo Matinyarare has made sensational claims that fired Central Intelligence Organisation (CIO) director-general Isaac Moyo was compromised and had been working with French Intelligence to undermine Zimbabwe’s security since his appointment in 2017. According to the controversial Matinyarare, Moyo’s relationship with the French dates back 15 years to his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-activist-claims-fired-cio-boss-isaac-moyo-was-working-with-french-intelligence-to-undermine-zimbabwe/\">Zanu PF activist claims fired CIO boss Isaac Moyo was working with French Intelligence to undermine Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "President Carter’s Legacy in Zimbabwe",
            "url": "https://www.newzimbabwe.com/president-carters-legacy-in-zimbabwe/",
            "content": "By Pamela Tremont, U.S. Ambassador to Zimbabwe\n\nU.S. President Jimmy Carters commitment to health, human rights, and peace worldwide will feature during his funeral proceedings in Washington, D.C. today. Eulogies from President Joe Biden and others will extoll Carters achievements both during his four years in the White House and his 44 years of philanthropy that followed. Carter, the longest-living of any U.S. president, was a ubiquitous, positive presence in our world for nearly half a century  building homes for the poor, monitoring elections around the globe, delivering humanitarian relief to those in need  often with his wife of 77 years, Rosalynn, by his side.\n\nThose are the familiar themes that will be beamed from the Washington National Cathedral around the globe today.\n\nHere in Zimbabwe, the story is more personal. As Carter would recall years later, What most people dont realize is, I spent more time on Zimbabwe than I did the Middle East. Historian Andrew DeRoche describes how Carter directed his future UN Ambassador, Andrew Young, on Inauguration Day to go to Africa and get some sense of what African leadership expected. Nearly four years later, President Carter would hear directly from Robert Mugabe himself when he visited the White House. The new Prime Minister of independent Zimbabwe appreciated the people of the United States who in our hour of need came to our support and thanked President Carter who stood firm on a matter of principle.\n\nPresident Carters principled leadership is the legacy he leaves for us. As President Carter said, during Prime Minister Mugabes visit to the White House, Today we stand with Zimbabwes efforts toward economic development and toward stability in your own country and the realization of the legitimate hopes and dreams of the people whom you lead. Those words are as true today as they were 45 years ago.\n\nOur commitment today to Zimbabwes economic development is rooted in President Carters principled leadership on human dignity. It is part of why last year we graduated more than 100 women from the Embassys Academy for Women Entrepreneurs, whose Zimbabwe alumnae now number more than 500 strong. These businesswomen, who own companies in security, agriculture, mining, and financial services  to name just a few  join a global network of entrepreneurs with increased knowledge and access to scale their successful ventures. Likewise, USAIDs Feed the Future programs trained nearly 3,200 young farmers last year to commercialize their farming businesses. On average, they tripled their annual incomes. The peanut farmer from Plains, Georgia turned president would be proud.\n\nThe legacy of President Carters principled leadership in public health contributes to Zimbabwes stability. His foundation  The Carter Center  championed the near elimination of the guinea worm disease, which afflicted 3.5 million people across 21 countries in 1986 but was reduced to just over a dozen cases in 2023. In that same spirit, we work every day with Zimbabwean partners on issues of clean water and sanitation. The United States continues to support Zimbabwe to strengthen water quality monitoring systems to prevent cholera outbreaks. In 2024, USAID helped improve water access for more than 97,000 people and nearly 37,000 livestock. Likewise, as The Carter Center battles malaria in Haiti and the Dominican Republic, U.S. initiatives through USAID and the U.S. Centers for Disease Control and Prevention helped reduce the incidence of malaria in Zimbabwe by 40 percent in the last 15 years. Support from the American people makes available 800,000 mosquito nets, 1.2 million malaria rapid test kits, and nearly 100,000 life-saving antimalarial medications as our teams on the ground train health care workers and educate communities about malaria prevention and early treatment.\n\nFinally, President Carter believed in the hopes and dreams of the people of Zimbabwe. His elevation of human rights as a foreign policy priority of the United States demonstrated his view that might did not make right. He believed, as we do, that countries that respect human rights are more stable, more secure, and more peaceful. In the economic sphere, President Carter signed into law the Foreign Corrupt Practices Act that, to this day, remains a cornerstone in the global fight against corruption. He campaigned on the need for legislation to prohibit corporate bribery, which is both ethically repugnant and competitively unnecessary, erodes public confidence, and harms our relations with other countries. His support for Historically Black Colleges and Universities in the United States helped those institutions strengthen their academics, infrastructure, and research. Our EducationUSA and consular officers celebrate that legacy as we facilitate study and exchange in the United States for thousands of young Zimbabweans today and develop partnerships between institutions of higher learning in our two countries.\n\nJimmy Carters principled leadership and legacy encourage us all to think about how we can contribute to our communities and embody the idea that one principled person can make a positive change. As the first U.S. president to visit Sub-Saharan Africa and the only to visit Zimbabwe in his many trips to the continent post presidency, Jimmy Carter and his principles will continue to inspire our partnership with the people of Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08183313/Carter-Photo.jpg",
            "description": "<p>By Pamela Tremont, U.S. Ambassador to Zimbabwe U.S. President Jimmy Carter’s commitment to health, human rights, and peace worldwide will feature during his funeral proceedings in Washington, D.C. today.  Eulogies from President Joe Biden and others will extoll Carter’s achievements both during his four years in the White House and his 44 years of philanthropy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/president-carters-legacy-in-zimbabwe/\">President Carter’s Legacy in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Chiwenga fires shots at Zimbabwean care workers in the UK, says they are taking care of mentally challenged former sex workers",
            "url": "https://www.newzimbabwe.com/chiwenga-fires-shots-at-zimbabwean-care-workers-in-the-uk-says-they-are-taking-care-of-mentally-challenged-former-sex-workers/",
            "content": "By Staff Reporter\n\nOUTSPOKEN evangelist, Apostle Talent Chiwenga has blasted Zimbabweans working as caregivers in the United Kingdom and other developed countries, saying they have been relegated to taking care of unwanted, mentally challenged former sex workers all because of money.\n\nChiwenga was speaking during a sermon at Jesus Revelation Ministries, a denomination he founded with controversial and strict doctrines such as the absence of wives consent within a marriage.\n\nHis comments on caregivers come at a time when Zimbabweans are leaving the country enmasse to eke out a living in greener pastures due to lack of employment opportunities locally, a faltering economy and maladministration.\n\nOver 4,500 Zimbabwean trained nurses and doctors are employed by the UKs National Health Service (NHS), thousands more went there as nurse aides while countries such as Australia, USA and New Zealand have taken in more.\n\nIt is an error for us the sons of God to be used to toiling day and night doing filthy work so that other sinners may enjoy their lives, said the charismatic preacher.\n\nYou are the one taking care of the mother suffering from dementia as they go on vacation. You will be busy taking pictures of yourself and sending them back home saying life is good.\n\nYou have never washed your mothers clothes, have never bathed her or your grandmother but you are doing it all because of money.\n\nSome of these women were commercial sex workers who were abandoned by their children and are now being taken care of by the State. Those are the people you are taking care of in England.\n\nZimbabwean caregivers in the UK form a considerable chunk of the countrys diaspora community that contributed 25% of its total foreign currency earnings last year.\n\nChiwenga, however, said that kind of work should not be tolerated as it also causes mental fatigue.\n\nHe added: When you come back from work after finishing your shift, when you have spent the day bearing their spits on your face, what kind of love would you give to your spouse.\n\nDo you know that taking care of a mental patient causes mental fatigue itself because you are spending the day with them? Their relatives looked for you to do it because they did not want to do it themselves.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/10154139/Apostle-Chiwenga-e1583855020857.jpg",
            "description": "<p>By Staff Reporter OUTSPOKEN evangelist, Apostle Talent Chiwenga has blasted Zimbabweans working as caregivers in the United Kingdom and other developed countries, saying they have been relegated to taking care of unwanted, mentally challenged former sex workers all because of money. Chiwenga was speaking during a sermon at Jesus Revelation Ministries, a denomination he founded</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiwenga-fires-shots-at-zimbabwean-care-workers-in-the-uk-says-they-are-taking-care-of-mentally-challenged-former-sex-workers/\">Chiwenga fires shots at Zimbabwean care workers in the UK, says they are taking care of mentally challenged former sex workers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Harare street vendor arrested for putting public health at risk selling fake, expired groceries",
            "url": "https://www.newzimbabwe.com/harare-street-vendor-arrested-for-putting-public-health-at-risk-selling-fake-expired-groceries/",
            "content": "By Staff Reporter\n\nA STREET vendor in Harares central business district (CBD) has been arrested by municipal police for selling fake and expired groceries.\n\nIn a statement, City of Harare (CoH) said Bornwell Dirwai was caught in possession of goods that were expired and repackaged in South African branded containers. He was trading at the intersection of Rezende and Robert Mugabe streets.\n\nMost of the groceries are expired. The repackaged products include milk packaged in South African branded containers, margarine in Buttercup margarine containers and ZimGold packages, reads the statement.\n\nCoH has warned consumers to exercise extreme caution while shopping and advised buying groceries from reputable outlets.\n\nResidents are urged to exercise extreme caution when purchasing goods.\n\nThey should only buy from reputable shops to avoid health complications caused by fake products that have flooded the market, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08131030/IMG-20250108-WA0008.jpg",
            "description": "<p>By Staff Reporter  A STREET vendor in Harare’s central business district (CBD) has been arrested by municipal police for selling fake and expired groceries. In a statement, City of Harare (CoH) said Bornwell Dirwai was caught in possession of goods that were expired and repackaged in South African branded containers. He was trading at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-street-vendor-arrested-for-putting-public-health-at-risk-selling-fake-expired-groceries/\">Harare street vendor arrested for putting public health at risk selling fake, expired groceries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Zim prospect signs new contract at Sheffield Wednesday, attracts loan interest from several clubs",
            "url": "https://www.newzimbabwe.com/zim-prospect-signs-new-contract-at-sheffield-wednesday-attracts-loan-interest-from-several-clubs/",
            "content": "By Soccer24\n\nZIMBABWEAN prospect, Sean Fusire has signed a new contract at Sheffield Wednesday in the United Kingdom.\n\nThe 19-year-old penned the deal earlier this week as he committed his future to the Owls following weeks of negotiations.\n\nWednesday have not disclosed for how long the extension ties Fusire to Hillsborough.\n\nSpeaking to Sheffield Wednesday media after signing the contract, Fusire said: Its a massive thing for me and my family, and a massive step in a long journey that Im hoping to be an even longer journey.\n\nAll the people around me know me as a Sheffield Wednesday player and its a privilege to be able to continue the journey.\n\nIve been here a long time and its all positive and good memories and loads of development.\n\nFusire joined the Wednesday academy at the age of nine and climbed the ranks to pen his maiden professional contract in December 2022.\n\nHe made his senior debut in the Emirates FA Cup against Fleetwood in February 2023 and has since posted four further appearances, all in the Carabao Cup.\n\nThe Zimbabwean is a regular on the training pitches with the first team and equally at home in central midfield or on the right of the engine room.\n\nMeanwhile, there have been reports suggesting that Fusire could leave Sheffield on loan in this window.\n\nThe youngster is said to be wanted by several League Two clubs including Carlisle United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08071440/Fusire.jpg",
            "description": "<p>By Soccer24 ZIMBABWEAN prospect, Sean Fusire has signed a new contract at Sheffield Wednesday in the United Kingdom. The 19-year-old penned the deal earlier this week as he committed his future to the Owls following weeks of negotiations. Wednesday have not disclosed for how long the extension ties Fusire to Hillsborough. Speaking to Sheffield Wednesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-prospect-signs-new-contract-at-sheffield-wednesday-attracts-loan-interest-from-several-clubs/\">Zim prospect signs new contract at Sheffield Wednesday, attracts loan interest from several clubs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Man (32) stoned to death for labelling hitchhiker wearing earrings as ‘gay’",
            "url": "https://www.newzimbabwe.com/man-32-stoned-to-death-for-labelling-hitchhiker-wearing-earrings-as-gay/",
            "content": "By Staff Reporter\n\nAN unpalatable remark referring to a fellow male hitchhiker as homosexual ended in tragedy for a Harare man, who was stoned to death by the former.\n\nThe incident occurred Monday at a bus stop near Boka tobacco auction floors in Harare after the now deceased mocked the suspect and labelled him as gay.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn January 6, 2025, police in Harare arrested Benedict Rueben in connection with a case of murder which occurred at Boka bus terminus along HarareMasvingo Road.\n\nThe suspect hit the victim, Maxwell Mahanzu (32) with a stone after the victim mocked him, claiming that he was gay since he was wearing earrings. The victim died on the spot.\n\nZimbabwean society still frowns upon homosexuality which is considered taboo.\n\nMeanwhile, police confirmed the arrest of lovebirds Kudzai Taendesa Chitima (24) and Fanuel Moyo (26) in connection with a case of murder which occurred on January 2, 2025, at a house at Badala Village 3, Inyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/13180829/Crime.jpg",
            "description": "<p>By Staff Reporter  AN unpalatable remark referring to a fellow male hitchhiker as ‘homosexual’ ended in tragedy for a Harare man, who was stoned to death by the former. The incident occurred Monday at a bus stop near Boka tobacco auction floors in Harare after the now deceased mocked the suspect and labelled him as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-32-stoned-to-death-for-labelling-hitchhiker-wearing-earrings-as-gay/\">Man (32) stoned to death for labelling hitchhiker wearing earrings as ‘gay’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Wildfire rages in Los Angeles, forcing 30,000 to evacuate",
            "url": "https://www.newzimbabwe.com/wildfire-rages-in-los-angeles-forcing-30000-to-evacuate/",
            "content": "By Reuters\n\nA RAPIDLY growing wildfire raged across an upscale section of Los Angeles on Tuesday, destroying homes and creating traffic jams as 30,000 people evacuated beneath huge plumes of smoke that covered much of the metropolitan area.\n\nAt least 2,921 acres (1,182 hectares) of the Pacific Palisades area between the coastal settlements of Santa Monica and Malibu had burned, officials said, after they had already warned of extreme fire danger from powerful winds that arrived following extended dry weather.\n\nThe fire spread as officials warned the worst wind conditions were expected to come overnight, leading to concerns that more neighborhoods could be forced to flee.\n\nThe city of Santa Monica later ordered evacuations in the northern fringe of town.\n\nWitnesses reported a number homes on fire with flames nearly scorching their cars when people fled the hills of Topanga Canyon, as the fire spread from there down to the Pacific Ocean.\n\nWe feel very blessed at this point that theres no injuries that are reported, Los Angeles Fire Chief Kristin Crowley told a press conference, adding that more than 25,000 people in 10,000 homes were threatened.\n\nFirefighters in aircraft scooped water from the sea to drop it on the nearby flames. Flames engulfed homes and bulldozers cleared abandoned vehicles from roads so emergency vehicles could pass, television images showed.\n\nAs the sun set over Los Angeles, towering orange flames illuminated the hills leading to Topanga Canyon.\n\nThe fire singed some trees on the grounds of the Getty Villa, a museum loaded with priceless works of art, but the collection remained safe largely because of preventive efforts to trim brush surrounding the buildings, the museum said.\n\nWith only one major road leading from the canyon to the coast, and only one coastal highway leading to safety, traffic crawled to a halt, leading people to flee on foot.\n\nCindy Festa, a Pacific Palisades resident, said that as she evacuated out of the canyon, fires were this close to the cars, demonstrating with her thumb and forefinger.\n\nPeople left their cars on Palisades Drive. Burning up the hillside. The palm trees  everything is going, Festa said from her car.\n\nBefore the fire started, the National Weather Service had issued its highest alert for extreme fire conditions for much of Los Angeles County from Tuesday through Thursday, predicting wind gusts of 50 to 80 mph (80 to 130 kph).\n\nWith low humidity and dry vegetation due to a lack of rain, the conditions were about as bad as it gets in terms of fire weather, the Los Angeles office of the National Weather Service said on X.\n\nGovernor Gavin Newsom, who declared a state of emergency, said the state positioned personnel, firetrucks and aircraft elsewhere in Southern California because of the fire danger to the wider region, he added.\n\nHopefully, were wrong, but were anticipating other fires happening concurrently, Newsom told the press conference.\n\nA second blaze dubbed the Eaton Fire later broke out some 30 miles (50 km) inland in the foothills above Pasadena, consuming 200 acres (80 hectares), Cal Fire said.\n\nThe powerful winds changed President Joe Bidens travel plans, grounding Air Force One in Los Angeles. He had planned to make a short flight inland to the Coachella Valley for a ceremony to create two new national monuments in California but the event was rescheduled for a later date at the White House.\n\nI have offered any federal assistance that is needed to help suppress the terrible Pacific Palisades fire, Biden said in statement. A federal grant had already been approved to help reimburse the state of California for its fire response, Biden said.\n\nPacific Palisades is home to several Hollywood stars. Actor James Woods said on X he was able to evacuate but added, I do not know at this moment if our home is still standing.\n\nActor Steve Guttenberg told KTLA television that friends of his were impeded from evacuating because others had abandoned their cars in the road.\n\nIts really important for everybody to band together and dont worry about your personal property. Just get out, Guttenberg said. Get your loved ones and get out.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08060901/download-1-1.jpeg",
            "description": "<p>By Reuters A RAPIDLY growing wildfire raged across an upscale section of Los Angeles on Tuesday, destroying homes and creating traffic jams as 30,000 people evacuated beneath huge plumes of smoke that covered much of the metropolitan area. At least 2,921 acres (1,182 hectares) of the Pacific Palisades area between the coastal settlements of Santa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wildfire-rages-in-los-angeles-forcing-30000-to-evacuate/\">Wildfire rages in Los Angeles, forcing 30,000 to evacuate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        },
        {
            "title": "Legendary South African singer Winnie Khumalo dies at 51 after short illness",
            "url": "https://www.newzimbabwe.com/legendary-south-african-singer-winnie-khumalo-dies-at-51-after-short-illness/",
            "content": "By IOL\n\nLEGENDARY South African actress and singer Winnie Khumolo, best known for her hit song Live My Life, has died at 51 after a short illness, a family representative confirmed.\n\nFamily spokesperson, Tshephi Rakeepile, confirmed that Khumalo died on Tuesday after a short illness.\n\nIn an interview with the SABC, Rakeepile expressed that the family is in deep sorrow, saying: We are deeply saddened as a family to announce the death of our dearly beloved sister, a mother, our friend, she passed away after a short illness and as a family at this stage we are deeply saddened.\n\nKhumalo was the mother of singer Rethabile Khumalo and the late boxing champion Digaan Thobelas son, Thabo Khumalo.\n\nRakeepile disclosed that Khumalo was alone when she fell in and her daughter was not present at that time.\n\nWell, yes, she was sick at that moment and her daughter was out, but it was her daughter (Rethabile) that actually came back home to come and collect her so that she could be taken to the hospital, she said.\n\nAccording to Rakeepile, Rethabile tried to help her mother when she arrived home.\n\nShe did try to help her at that time, at that moment she was really not well.\n\nRakeepile said Khumalo died on her way to the hospital to get medical attention.\n\nBut unfortunately, on their drive to the hospital, thats when she passed away, because when they arrived at the hospital, they pronounced the death on arrival.\n\nThe cause of her death is unknown at the moment, however, she said the family is at a loss and devastated by Khumalos death.\n\nKhumalo leaves behind three grandchildren and extended family who are mourning her death.\n\nWho is Winnie Khumalo?\n\nKhumalo was born in Mofolo, north Soweto, and began her music career at the age of 15. She released her debut album Hey Laitie, Tshina Tshina, which was produced by music legend Sello Chicco Twala.\n\nIn the early 1980s, she released a gospel album titled Dlamini, followed by a gospel album titled Izoni Zami in the 1990s, produced by Paster Langa Dube.\n\nKhumalo has worked with notable musicians such as the late Brenda Fassie as a backing vocalist and collaborated with the likes of Pure Magic Sipho Mbele, Brothers of Peace (B.O.P) Bongo Maffin, Zonke Dikana and Dj Cleo.\n\nKhumalo has graced small television screens on SABCs series Mponeng and Muvhango, portraying the role of a sangoma (traditional healer).\n\nShe also played in a stage play called The Journey, including Thwalas film Madluphuthu.\n\nAfter taking a break from the music industry to raise her children, Khumalo made a successful comeback in 2008, with a mature album titled I Just Wanna Live My Life, which was produced and distributed by Kalawa Jazzmee Records Oskido Oscar Mdlongwa.\n\nThe album was a hit, selling more than 25 000 copies and earned a gold record, with its smash single, I Just Wanna Live My Life, dominating the music charts, receiving nominations, including the Channel O Music Awards.\n\nKhumalo went on to take the music industry by storm by releasing another hit song titled Mina Ngiyohlala Nginje, composed by Twala, which saw her rocking the stage with former president Jacob Zuma during the 2009 African National Congress (ANC) election campaigns.\n\nFollowing the news of her death, social media has been flooded with tributes from fans, supporters and the public paying tribute and honouring the late singer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/08054237/Singer-Winnie-Khumalo-has-died-aged-51-after-a-short-illness-Picture-X-PhilMphela.webp",
            "description": "<p>By IOL LEGENDARY South African actress and singer Winnie Khumolo, best known for her hit song ‘Live My Life,’ has died at 51 after a short illness, a family representative confirmed. Family spokesperson, Tshephi Rakeepile, confirmed that Khumalo died on Tuesday after a short illness. In an interview with the SABC, Rakeepile expressed that the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legendary-south-african-singer-winnie-khumalo-dies-at-51-after-short-illness/\">Legendary South African singer Winnie Khumalo dies at 51 after short illness</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:28",
            "date": "09 Jan 2025"
        }
    ]
}