{
    "news": [
        {
            "title": "“If we are not careful, Zimbabwe will become a mono state” – Mwonzora calls for opposition unity following defeat in Epworth by-election",
            "url": "https://www.newzimbabwe.com/if-we-are-not-careful-zimbabwe-will-become-a-mono-state-mwonzora-calls-for-opposition-unity-following-defeat-in-epworth-by-election/",
            "content": "By Thandiwe Garusa\n\nMovement for Democratic Change (MDC) leader Douglas Mwonzora has stressed the importance of unity among opposition parties in Zimbabwe, urging them to work together to reverse the trend of poor electoral performance.\n\nHis remarks follow the recently held Epworth ward 6by-election,where the ruling party Zanu PFs candidate Civilised Bushe secured 3,022 votes, beating MDC-Ts Alice Nyahunzvi, who managed just 120 votes. Independent candidate Peter Nyapetwa received only 23 votes. The main opposition party, Citizens Coalition for Change (CCC), did not participate in the by-election.\n\nMwonzora, who boycotted the 2023 presidential elections, surprisingly fielded a candidate in Epworth who performed poorly, triggering widespread criticism from opposition supporters.\n\nSpeaking in an X space on Wednesday, Mwonzora said the by-election was a test to assess whether the Zimbabwe Electoral Commission (ZEC) had implemented electoral reforms.\n\nZEC produced a document called a strategy towards free and fair elections, so we decided to test ZECs attempted electoral reforms empirically. ZEC failed dismally in the test.\n\nThere was rampant vote buying, as Epworth residents were being given food hampers on election day. We have video evidence of that. People were receiving EcoCash and being told to vote for Zanu PF.\n\nThey also received threats from Zanu PF and were told that if they voted for the MDC, the 16,000 houses in Epworth would be destroyed.\n\nWe, the MDC party, were given a soft copy of the voters roll, but it would not open. We made a formal complaint to ZEC, which did nothing about it, Mwonzora said.\n\nMwonzora urged other opposition parties to unite against Zanu PF instead of mocking him for losing the by-election.\n\nThe poor performance is not confined to the MDC; it is a trend, and as the opposition, we must work to change it.\n\nThere is a need to bury the hatchet. As we have seen, there is no winner in a losing team. We need to work together. If we are not careful, Zimbabwe will become a mono-state.\n\nYes, we may want to score political points by mocking the MDC, which lost only one by-election, yet other opposition parties lost 45, Mwonzora said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Thandiwe Garusa Movement for Democratic Change (MDC) leader Douglas Mwonzora has stressed the importance of unity among opposition parties in Zimbabwe, urging them to work together to reverse the trend of poor electoral performance. His remarks follow the recently held Epworth ward 6by-election, where the ruling party Zanu PF’s candidate Civilised Bushe secured 3,022 votes,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/if-we-are-not-careful-zimbabwe-will-become-a-mono-state-mwonzora-calls-for-opposition-unity-following-defeat-in-epworth-by-election/\">“If we are not careful, Zimbabwe will become a mono state” – Mwonzora calls for opposition unity following defeat in Epworth by-election</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        },
        {
            "title": "Eating chips regularly raises risk of type 2 diabetes by 20%, study finds",
            "url": "https://www.newzimbabwe.com/eating-chips-regularly-raises-risk-of-type-2-diabetes-by-20-study-finds/",
            "content": "The Guardian\n\nLove potatoes? Well, theres good news and theres bad news.\n\nEating chips has been found to raise the risk of developing type 2 diabetes, but baking, boiling or mashing potatoes was much healthier.\n\nConsuming french fries three times a week increases the chances of someone getting the disease by 20%  and doing so five times a week by 27%  according to a study published in the British Medical Journal.\n\nGlobally, potatoes are thethird most commonly consumed food crop, after rice and wheat.\n\nNine out of 10 of the estimated 5.8 million people in the UK with diabetes have the type 2 version of the disease, which is closely associated with lifestyle, especially diet.\n\nThe findings confirm potatoes do not of themselves pose a danger to health, but frying them to turn them into chips, and eating them regularly, does make a diagnosis of type 2 diabetes more likely.\n\nAn international team of researchers, led by Seyed Mohammad Mousavi, a public health expert at Harvard University, investigated the relationship between potato intake and the risk of developing type 2 diabetes. They based their findings on food questionnaires filled out by 205,000 health professionals in the US every four years between 1984 and 2021.\n\nSomeone who eats chips three times a week was found to raise their risk of diabetes by 20%, but those who ate potatoes with the same regularity after baking, boiling or mashing them did so by only 5%.\n\nThe high starch content of potatoes, leading to a high glycemic index and load, combined with possible loss of nutrients and possible health risks resulting from various cooking methods, could contribute to adverse health outcomes, the study explains.\n\nReplacing potatoes with whole grains lowers the risk of diabetes by 8%, and if grains are eaten instead of chips specifically, that cuts the risk by 19%.\n\nDr Kawther Hashem, a lecturer in public health nutrition at Queen Mary University of London, said: Potatoes can be part of a healthy diet, but its how we prepare them that makes the difference. Boiled, baked or mashed potatoes are naturally low in fat and a source of fibre, vitamin C and potassium.\n\nBut when we deep fry them into chips or french fries, especially in large portions and with added salt, they become less healthy with their high-fat, salt and calorie content thats much more likely to contribute to weight gain and increase the risk of type 2 diabetes.\n\nHowever, replacing any form of potatoes with white rice is a bad idea as it leads to an increased risk of type 2 diabetes, the paper found.\n\nDr Hashem added: This research reinforces the simple message, which is to enjoy potatoes  just dont rely on chips as your go-to option. And, where possible, try swapping them out for whole grains like brown rice, bulgur wheat, wholemeal pasta or even sweet potato with skin on, which are healthier and protective for long-term health.\n\nThe researchers stressed their findings were observational and did not prove a cause and effect relationship between eating chips and type 2 diabetes risk.\n\nThe Food Standards Agency and Department of Health and Social Care both declined to comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07034125/chips.jpg",
            "description": "<p>The Guardian Love potatoes? Well, there’s good news and there’s bad news. Eating chips has been found to raise the risk of developing type 2 diabetes, but baking, boiling or mashing potatoes was much healthier. Consuming french fries three times a week increases the chances of someone getting the disease by 20% – and doing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eating-chips-regularly-raises-risk-of-type-2-diabetes-by-20-study-finds/\">Eating chips regularly raises risk of type 2 diabetes by 20%, study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        },
        {
            "title": "WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says",
            "url": "https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/",
            "content": "AP\n\nWhatsApp has taken down 6.8 million accounts that were linked to criminal scam centers targeting people online around the world, its parent companyMetasaid this week.\n\nThe account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts tocrack down on scams. In a Tuesday announcement, Meta said it was also rolling new tools on WhatsApp to help people spot scams  including a new safety overview that the platform will show when someone who is not in a users contacts adds them to a group, as well as ongoing test alerts to pause before responding.\n\nScams arebecoming all too commonand increasingly sophisticated in todays digital world  withtoo-good-to-be-trueoffers and unsolicited messages attempting to steal consumers information or money filling our phones, social media and other corners of the internet each day. Meta noted that some of the most prolific sources of scams are criminal scam centers, which oftenspan from forced laboroperated by organized crime  and warned that such efforts often target people on many platforms at once, in attempts to evade detection.\n\nThat means that a scam campaign may start with messages over text or a dating app, for example, and then move to social media and payment platforms, the California-based company said.\n\npointed to recent scam efforts that it said attempted to use its own apps  as well as TikTok, Telegram and AI-generated messages made using ChatGPT  to offer payments for fake likes, enlist people into a pyramid scheme and/or lure others into cryptocurrency investments. Meta linked these scams to a criminal scam center in Cambodia  and said it disrupted the campaign in partnership with ChatGPT makerOpenAI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07033548/Whatsapp-1.webp",
            "description": "<p>AP WhatsApp has taken down 6.8 million accounts that were “linked to criminal scam centers” targeting people online around the world, its parent company Meta said this week. The account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts to crack down on scams. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/\">WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        },
        {
            "title": "High Court orders appointment of arbitrator in Powertel–Dandemutande legal dispute after years of stalemate",
            "url": "https://www.newzimbabwe.com/high-court-orders-appointment-of-arbitrator-in-powertel-dandemutande-legal-dispute-after-years-of-stalemate/",
            "content": "By Mary Taruvinga\n\nThe High Court has ended a protracted deadlock between Powertel Communications (Pvt) Ltd and Dandemutande Investments (Pvt) Ltd by ordering the appointment of a sole arbitrator to preside over their long-running contractual dispute, after nearly seven years of failed arbitration efforts.\n\nIn a ruling delivered by Justice Maxwell Takuva, the court criticised Dandemutande for obstructing the arbitration process and held that Powertel had met the legal requirements to invoke the High Courts intervention under Article 11(4) of the Arbitration Act [Chapter 7:15].\n\nThe applicant still yearns for redress and their agreement provides that unless the parties agree to the jurisdiction of the courts, their dispute shall be resolved through the arbitration process. However, without agreeing on the appointment of the arbitrator, the dispute remains unresolved, noted the judge.\n\nThe dispute arose from a 2010 Internet Capacity Purchase Agreement between the two telecoms companies.\n\nClause 27 of the agreement required that all disputes be referred to arbitration, unless the parties consented to the jurisdiction of Zimbabwean courts.\n\nA rift emerged in 2017 after Dandemutande terminated the agreement and allegedly failed to pay a debt of over US$2.29 million claimed by Powertel.\n\nThe parties initially agreed to appoint retired Justice Vernanda Ziyambi as arbitrator in 2018, but the arbitration never materialised because Dandemutande, the claimant at the time, failed to file its claim.\n\nJustice Ziyambi later withdrew from the process due to unavailability.\n\nIn 2023, Powertel approached the Commercial Arbitration Centre seeking a new arbitrator, leading to the appointment of Dr. Whatman.\n\nHowever, Dandemutande objected, and the arbitrator ruled that the matter was improperly before him and terminated proceedings by consent.\n\nPowertel then turned to the High Court for relief.\n\nDandemutande opposed the application, raising two preliminary points  that the claim had prescribed and that the relief sought was incompetent.\n\nOn prescription, the court found that no actual claim had been filed before it, only an application for appointment of an arbitrator.\n\nThe preliminary point on prescription lacks merit, Takuva held.\n\nSuch a point could only be raised before the forum dealing with the applicants claim.\n\nThe court also dismissed the second objection, ruling that while Powertel had proposed the Chairman of the Commercial Arbitration Centre to recommend an arbitrator, that proposal did not usurp the courts discretion.\n\nThe relief sought is incompetent because it takes away the discretion of the Court in appointing an arbitrator, said the judge.\n\nHowever, this does not prejudice the respondent in any way The Court retains the discretion on who to appoint.\n\nThe court was further scathing of Dandemutandes silence in the face of multiple attempts by Powertel to restart arbitration.\n\nIn my view, by so doing the respondent was not being fair to the applicant, said Justice Takuva. Whatever its reasons, it should have at least communicated its reasons The respondents non-cooperation in appointing an arbitrator was deliberate and has forced the applicant to institute litigation.\n\nHe then ruled in favour of Powertel and authorised the Chairman of the Commercial Arbitration Centre to appoint a sole arbitrator on behalf of the court.\n\nHowever, it declined Powertels request for punitive costs, finding that although Dandemutande had delayed the process, Powertel had also contributed to the delay by waiting five years to revive arbitration after the first attempt failed.\n\nAn order for costs on the ordinary scale will suffice, Justice Takuva concluded.\n\nTakuva ruled that the application for appointment of an arbitrator is granted.\n\nHe said the Chairman of the Commercial Arbitration Centre in Harare is authorised to appoint a suitable arbitrator on behalf of the court.\n\nDandemutande shall pay Powertels costs on the ordinary scale.\n\nThe ruling is expected to restart formal proceedings between the two parties and finally bring closure to one of the telecommunications industrys longest-running contractual disputes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07031432/dandemutande.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ended a protracted deadlock between Powertel Communications (Pvt) Ltd and Dandemutande Investments (Pvt) Ltd by ordering the appointment of a sole arbitrator to preside over their long-running contractual dispute, after nearly seven years of failed arbitration efforts. In a ruling delivered by Justice Maxwell Takuva, the court criticised</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-orders-appointment-of-arbitrator-in-powertel-dandemutande-legal-dispute-after-years-of-stalemate/\">High Court orders appointment of arbitrator in Powertel–Dandemutande legal dispute after years of stalemate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        },
        {
            "title": "Heavy police deployment ahead of Heroes, Defence Forces holidays",
            "url": "https://www.newzimbabwe.com/heavy-police-deployment-ahead-of-heroes-defence-forces-holidays/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Republic Police (ZRP) says it has intensified security and road safety operations across the country ahead of the Heroes and Defence Forces holidays, deploying additional manpower.\n\nIn a statement Wednesday, ZRP spokesperson Commissioner Paul Nyathi warned that unroadworthy vehicles, pirate taxis, unregistered and plateless cars will be impounded, while drunk drivers and touts harassing passengers will face arrest.\n\nThe ZRP has deployed adequate manpower on the roads to ensure the public travels safely as the country commemorates the 45th anniversaryof Heroes and Defence Forces holidays.\n\nDecisive action will be taken against motorists who flout road rules and regulations.\n\nIn this regard, unroadworthy vehicles, pirate taxis or mushika shika vehicles, buses without permits, unregistered and plateless vehicles will be impounded. Drivers found to be driving under the influence of alcohol will be arrested for the law to take its course, Nyathi said.\n\nNyathi also said crack teams targeting armed robberies, drug peddling, and other crimes have also been activated, with intensified patrols in residential, industrial, and CBD areas.\n\nThe Commissioner-General of Police has directed Police Commanders to deploy police officers to patrol in residential, industrial and Central Business Districts and effect arrests on criminal elements, including those peddling drugs and illicit substances.\n\nThe crack teams set up by the Commissioner-General of Police to tackle robbery cases will be on high alert and will respond appropriately to reports of armed robbery in the country.\n\nThe ZRP will take stern action on all unlicensed liquor outlets and appeal to the public to report licensed operators who are not observing stipulated operational times for their outlets, Nyathi added.\n\nNyathi also advised the public to avoid keeping large sums of money at home or work and to limit sharing financial information to prevent criminal activity.\n\nMeanwhile,parents and school authorities are being encouraged to closely monitor children and avoid night travel during the holidays to prevent cases of rape, drug, and substance abuse as schools close.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Republic Police (ZRP) says it has intensified security and road safety operations across the country ahead of the Heroes and Defence Forces holidays, deploying additional manpower. In a statement Wednesday, ZRP spokesperson Commissioner Paul Nyathi warned that unroadworthy vehicles, pirate taxis, unregistered and plateless cars will be impounded, while drunk</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heavy-police-deployment-ahead-of-heroes-defence-forces-holidays/\">Heavy police deployment ahead of Heroes, Defence Forces holidays</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        },
        {
            "title": "Lobels top official reinstated with full benefits, backpay following unfair dismissal over bread loss",
            "url": "https://www.newzimbabwe.com/lobels-top-official-reinstated-with-full-benefits-backpay-following-unfair-dismissal-over-bread-loss/",
            "content": "By Mary Taruvinga\n\nA former Lobels Bread (Private Limited) top official will be reinstated following a successful four-year legal fight with his employer, who fired him over the loss of 35,000 loaves of bread in 2021.\n\nThe development follows a Labour Court ruling by Justice Bridget Chivizhe, who found that Christopher Rufaro Mashaire was unfairly dismissed.\n\nThe judge set aside his dismissal, effectively reinstating him with full benefits and back pay.\n\nThe court heard Mashaire was employed by Lobels as an Electrical Foreman for more than 17 years.\n\nHe started working as an Artisan for three years and was later promoted to the position of an Electrical Foreman.\n\nOn 9th September, 2021 he was suspended without pay and benefits to enable investigations into allegations of misconduct.\n\nTwo charges were levelled against him, the first being breach of section 4(f) of the Labour (National Employment Code of Conduct) Regulations, 2006. i.e. gross incompetency and inefficiency in the performance of his or her work and section 4(g) of the same statutory instrument thy is habitual and substantial neglect of his duty.\n\nThe allegations levelled were that on Thursday, the 7th of September 2021, he replaced a burnt oven circulation fan motor on Plant 9 without conducting a proper root cause analysis.\n\nIt was his employers contention that as a result of his actions, the spare motor got burnt in a short space of time after installation, resulting in plant stoppages which led to a loss of over 35,100 loaves.\n\nWith regards the second charge, it was alleged that the appellant neglected his duty on the same date when the business was running on a generator and his subordinate, Fungi Dhindi advised him that the generator was running at a high temperature of 85 degrees Celsius.\n\nThe respondents allegation was that Mashaire had not given the matter sufficient urgency, resulting in the generator developing a fault and stopping in the midst of production.\n\nUpon investigation by the Plant Manager, it was established that the coolant levels were low; this could have been avoided had Mashaire responded quickly upon receipt of the report from his subordinate.\n\nThe respondent had consequently suffered a loss of 10,570 loaves of bread.\n\nThe respondent further alleged that the appellant had neglected his duty by failing to ensure the availability of a standby burner for plant 9 until the burner had a failure on the 7th of September,2021, resulting in the prolonged plant stoppages which could have been avoided, the court heard.\n\nA disciplinary hearing was convened on 24th September, 2021.\n\nFollowing a full hearing, the Disciplinary Authority found that Mashaire had been grossly inefficient in the execution of his duties and that he neglected to perform preventative maintenance on the Plant 9 circulation fan as expected of him under his job description.\n\nThe Disciplinary Authority also found that despite the issue of the aged machinery, this had nothing to do with the premature failure of the replacement motor.\n\nThe committee said Mashaire had not conducted a proper root cause analysis as expected after a breakdown.\n\nIt was also their finding that he had substantially neglected his duties when he failed to act upon being advised by his subordinate of the overheating resulting in the eventual shutdown of the plant.\n\nHis actions was said to have resulted in Lobels suffering financial prejudice in the amount of ZWD$5,127,374.00.\n\nThe Disciplinary Authority dismissed Mashaires claims of victimisation and shortage of staff in his department.\n\nAfter considering his mitigating circumstances as against the aggravating circumstances, the Disciplinary Authority found him guilty of breach of section 4(f).\n\nHe was, however, found not guilty of breach of section 4(g).\n\nA penalty of dismissal from employment was consequently imposed.\n\nAggrieved by the decision of the Disciplinary Authority, the Appellant noted an internal appeal which was dismissed.\n\nIn his appeal, he had contended that he had performed preventative maintenance on the Plant 9 circulation fan as expected of him.\n\nHe also submitted that whilst he had performed his duties on the day with other employees, those employees had not also been charged, suggesting an element of bias.\n\nMashaire also contended that the penalty of dismissal from employment was excessive in the circumstances.\n\nHe then approached the Labour Court, which ruled in his favour, concluding that his dismissal was unfair.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07032746/Lobels-700g.jpg",
            "description": "<p>By Mary Taruvinga A former Lobels Bread (Private Limited) top official will be reinstated following a successful four-year legal fight with his employer, who fired him over the loss of 35,000 loaves of bread in 2021. The development follows a Labour Court ruling by Justice Bridget Chivizhe, who found that Christopher Rufaro Mashaire was unfairly</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lobels-top-official-reinstated-with-full-benefits-backpay-following-unfair-dismissal-over-bread-loss/\">Lobels top official reinstated with full benefits, backpay following unfair dismissal over bread loss</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        },
        {
            "title": "Auditor General’s Report: Over half a billion US dollars paid by Treasury unaccounted for",
            "url": "https://www.newzimbabwe.com/auditor-generals-report-over-half-a-billion-us-dollars-paid-by-treasury-unaccounted-for/",
            "content": "By Costa Nkomo\n\nThe latest Auditor Generals Report has once again raised flagrant breaches of Public Finance Management regulations, revealing that, as of June 2025, a staggering sum exceeding half a billion United States dollars paid by the Treasury to service providers on behalf of Ministries, Departments and Agencies (MDAs) in 2024 remains unaccounted for.\n\nThis substantial shortfall undermines fiscal transparency and accountability, principles crucial for sound governance.\n\nA key finding highlights a failure by MDAs to properly upload payment information onto the Public Finance Management System (PFMS). This omission creates a loophole that could facilitate embezzlement and corruption.\n\nThe report reads: Direct payments amounting to US$1,986,391,797 were made to service providers on behalf of the MDAs by Treasury during the 2024 financial year. However, MDAs accounted for US$1,388,673,713, leaving a balance of US$597,718,082 as at June 18, 2025. In some instances, the payments were not uploaded onto the PFMS. MDAs expenditure was understated by the direct payments.\n\nThis discrepancy represents a significant material misstatement of public accounts.\n\nThe failure to reconcile these payments points to a serious breakdown in internal controls, increasing the risk of fraudulent activity and illicit enrichment.\n\nThe report further details a five-month period of opacity during the currency transition from ZWL to ZWG between April and August 2024. MDAs reportedly operated outside the PFMS during this period, resulting in a vacuum of financial oversight.\n\nThere was a downtime of the Public Financial Management Systems (PFMS) during the country changeover of currency from ZWL$ to Zimbabwe Gold (ZWG) for almost five (5) months (April to August 2024). During that time most MDAs operated outside the PFMS.\n\nThe financial information that would have been processed outside the system was not uploaded onto the system in some cases. Such information would misstate expenditure figures.\n\nThis prolonged systems downtime created a black box scenario, leaving the door open for potentially unlawful financial transactions and making it incredibly difficult to trace the flow of public funds.\n\nMoreover, the Auditor Generals Report casts a spotlight on the widespread abuse of fuel allocations, noting a concerning increase in such incidents compared to 2023.\n\nPoor record-keeping practices and inadequate internal controls were identified as primary contributing factors.\n\nCases of loss of fuel were on the increase. These were attributed to control weaknesses in fuel management, ranging from non-maintenance of fuel registers, inconsistent fuel recordings, non-performance of fuel reconciliations, absence of segregation of duties and weak supervisory checks. In this report, seven (7) MDAs had issues with fuel management. Measures around fuel management should be enhanced, the report added.\n\nThe lack of robust fuel management procedures indicates a serious disregard for public assets, exposing them to potential misappropriation and wastage.\n\nSuch inefficiencies have a detrimental impact on service delivery and overall economic performance.\n\nSection 298 of the Constitution of Zimbabwe enshrines the principles of transparency and accountability within public finance management.\n\nThese findings from the Auditor Generals Report underscore the urgent need for enhanced oversight, stronger internal controls, and the rigorous enforcement of financial regulations to safeguard public funds and promote responsible fiscal governance.\n\nThe scale of the irregularities demands immediate and decisive action to hold those responsible to account and to prevent future occurrences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/17144600/rheah-kujinga.jpg",
            "description": "<p>By Costa Nkomo The latest Auditor General’s Report has once again raised flagrant breaches of Public Finance Management regulations, revealing that, as of June 2025, a staggering sum exceeding half a billion United States dollars paid by the Treasury to service providers on behalf of Ministries, Departments and Agencies (MDAs) in 2024 remains unaccounted for.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/auditor-generals-report-over-half-a-billion-us-dollars-paid-by-treasury-unaccounted-for/\">Auditor General’s Report: Over half a billion US dollars paid by Treasury unaccounted for</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:52",
            "date": "07 Aug 2025"
        }
    ]
}