{
    "news": [
        {
            "title": "UK backs efforts to resolve Morocco, Western Sahara dispute",
            "url": "https://www.newzimbabwe.com/uk-backs-efforts-to-resolve-morocco-western-sahara-dispute/",
            "content": "By Staff Reporter\n\nThe United Kingdom, a permanent member of the UN Security Council, believes that resolving the long-standing Morocco-Western Sahara dispute is important and in the best interests of all parties.\n\nThis position was expressed in a Joint Communiqu signed in Rabat on Sunday by David Lammy, Secretary of State for Foreign, Commonwealth, and Development Affairs of the United Kingdom of Great Britain and Northern Ireland, and Nasser Bourita, Minister of Foreign Affairs, African Cooperation, and Moroccan Expatriates.\n\nThe United Kingdom says it considers Moroccos autonomy proposal, submitted in 2007 as the most credible, viable and pragmatic basis for a lasting resolution of the dispute over the Moroccan Sahara, and will continue to act bilaterally, including economically, regionally and internationally in line with this position to support resolution of the conflict.\n\nJoint Communiqu underlines that the United Kingdom follows closely the current positive dynamic on this issue under the leadership of His Majesty King Mohammed VI.\n\nIt adds that London recognises the importance of the question of Western Sahara for the Kingdom of Morocco, noting that this settling this regional dispute would strengthen the stability of North Africa and the relaunch of the bilateral dynamic and regional integration.\n\nAdditionally, the United Kingdom affirms, in the Joint Communiqu signed at the Foreign Ministry headquarters, that it can consider supporting projects in the Sahara, notably as part of the United Kingdom Export Finances 5bn commitment to support new business across the country.\n\nThe United Kingdom went on to say it also recognises Morocco as a key gateway to Africas socio-economic development and reaffirms its commitment to deepening engagement with Morocco as a partner for growth across the continent\n\nIn this document, both countries support, and consider vital, the central role of the UN-led process, reaffirming their full support for the efforts of the UN Secretary-Generals personal envoy, Staffan de Mistura.\n\nTo this end, the United Kingdom underlines that it is ready, willing and committed to lend its active support and engagement to the Personal Envoy and the parties.\n\nMorocco says this new position of the United Kingdom, aligns with the stances expressed by many major powers, notably the United States, France, and Spain.\n\nFurthermore, Morocco says this new position of the United Kingdom, reinforces the growing international momentum driven by His Majesty King Mohammed VI in support of the Autonomy Plan under Moroccan sovereignty.\n\nAlso, the North African country says this also confirms the credibility of this initiative and the broad consensus backing it to reach a final resolution to the regional dispute over the Moroccan-Sahara.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/03170921/WhatsApp-Image-2025-06-03-at-17.47.15-scaled.jpeg",
            "description": "<p>By Staff Reporter The United Kingdom, a permanent member of the UN Security Council, believes that resolving the long-standing Morocco-Western Sahara dispute is important and in the best interests of all parties. This position was expressed in a Joint Communiqué signed in Rabat on Sunday by David Lammy, Secretary of State for Foreign, Commonwealth, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-backs-efforts-to-resolve-morocco-western-sahara-dispute/\">UK backs efforts to resolve Morocco, Western Sahara dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        },
        {
            "title": "Killer pitbull owner appears in court, to remain locked up until Friday",
            "url": "https://www.newzimbabwe.com/killer-pitbull-owner-appears-in-court-to-remain-locked-up-until-friday/",
            "content": "By Mary Taruvinga\n\nA Harare man, Mike Mupinga, who was arrested after his pitbull fatally attacked a passerby, will remain locked up after his bail ruling was moved to Friday.\n\nMupinga (40) of Blufhill appeared before Harare magistrate Marewanazvo Gofa, charged with culpable homicide.\n\nHe was not asked to plead.\n\nThe National Prosecuting Authority, represented by Rufaro Chonzi is opposing bail.\n\nChonzi told the court that she will file written submissions by the end of day tomorrow.\n\nMupingas lawyer, Steven Chikotora intends to respond on Thursday before the ruling is handed down on Friday.\n\nAccording to the State, on the night of May 31, the accused person, being the owner of four vicious dogs comprising three pit bulls and a Rottweiler, negligently left the dogs unmuzzled in the yard of his rented house.\n\nThe accused person then went into his bedroom, leaving the dogs roaming around his yard, which is secured by a short perimeter wall built of bricks and mortar.\n\nThe accused persons vicious dogs then scaled over the short perimeter wall and met the now deceased Samuel Machara, who was walking along a nearby street, said Chonzi.\n\nThe dogs then bit the now deceased all over the body.\n\nMachara sustained some deep wounds on the neck and laceration wounds on hands, legs and the stomach before he succumbed to the injuries.\n\nThe state said the dogs were positively identified to be the accuseds by both the witnesses and the accused.\n\nMupingas white pit bull dog had blood stains all over its body.\n\nThe dogs were recovered from the accused persons home by the police and members of the Society for the Prevention of Cruelty to Animals [SPCA] and were euthanised.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Mary Taruvinga A Harare man, Mike Mupinga, who was arrested after his pitbull fatally attacked a passerby, will remain locked up after his bail ruling was moved to Friday. Mupinga (40) of Blufhill appeared before Harare magistrate Marewanazvo Gofa, charged with culpable homicide. He was not asked to plead. The National Prosecuting Authority, represented</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/killer-pitbull-owner-appears-in-court-to-remain-locked-up-until-friday/\">Killer pitbull owner appears in court, to remain locked up until Friday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        },
        {
            "title": "Zimbabwe’s monthly trade deficit widens to US$228 million",
            "url": "https://www.newzimbabwe.com/zimbabwes-monthly-trade-deficit-widens-to-us228-million/",
            "content": "By Alois Vinga\n\nZIMBABWEs trade deficit widened to US$228 million in just a month, signifying the pressing need to boost local manufacturing capacity.\n\nA trade deficit occurs when a countrys imports exceed exports and is also referred to as a negative balance of trade (BOT).A wider balance of trade, whether surplus or deficit, sends economic signals about a countrys competitiveness, global market access, and the impact of economic policies.\n\nIn the case of Zimbabwe, low productivity has not matched local demand for decades.\n\nLatest data from the Reserve Bank of Zimbabwe (RBZ) confirm that in March 2025, more imports than exports were recorded.\n\nThe countrys trade deficit widened to US$228.0 million in March 2025, compared to US$217.9 million recorded in the previous month. On a year-on-year basis, the deficit increased from US$185.9 million in March 2024 to US$228.0 million in the reporting month, the RBZ said.\n\nDuring the period, merchandise imports amounted to US$809.9 million in March 2025, reflecting a 10.9% increase from US$730.4 million recorded in the previous month. On a year-on-year basis, imports rose by 12.4%.\n\nDuring the month under review, most of the countrys imports originated from South Africa (38.2%), China (15.2%), the Bahamas (11.5%), and Mozambique (4.9%), with the rest sourced from a range of other markets.\n\nThe countrys export basket was predominantly composed of primary commodities, with gold leading at 42.4%, followed by PGMs, (16.0%), tobacco (17.1%), and other mineral exports (6.7%).\n\nIn March 2025, the countrys exports were mainly destined for the United Arab Emirates (40.7%), South Africa (24.4%), and China at 20.8%. The remaining exports were spread across various other international markets, said the RBZ.\n\nMarket watchers are of the view that Zimbabweurgently needs to adopt a radical policy shift to spur local industrial productivity to plug the huge foreign currency outflows.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27170948/rbz_zimbabwe-min.jpg",
            "description": "<p>By Alois Vinga ZIMBABWE’s trade deficit widened to US$228 million in just a month, signifying the pressing need to boost local manufacturing capacity. A trade deficit occurs when a country’s imports exceed exports and is also referred to as a negative balance of trade (BOT). A wider balance of trade, whether surplus or deficit, sends economic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-monthly-trade-deficit-widens-to-us228-million/\">Zimbabwe’s monthly trade deficit widens to US$228 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        },
        {
            "title": "New twist to Mpofu, Chimombe fraud case as former Agric Perm Sec gives evidence",
            "url": "https://www.newzimbabwe.com/new-twist-to-mpofu-chimombe-fraud-case-as-former-agric-perm-sec-gives-evidence/",
            "content": "By Staff Reporter\n\nThe case in which businessmen Moses Mpofu and Mike Chimombe are accused of defrauding the government of US$7 million in a botched presidential goats scheme Monday took a new twist after former Permanent Secretary in the Ministry of Agriculture John Basera acknowledged that they only partly failed to meet the contractual agreement.\n\nBasera was being cross-examined by Mpofus lawyer, Advocate Tapson Dzvetero, when he confirmed that the duos company, Blackdeck, had managed to meet their first-year target of a five five-year deal.\n\nBasera told High Court judge Justice Pisirayi Kwenda that Blackdeck supplied 3,595 goats against 3,113, which was written in their agreement.\n\nThe former permanent secretary also confirmed that the company had unforeseen challenges in mobilising the goats locally.\n\nWe had green, red and buffer zones because of Foot and Mouth Disease. If I remember well, we had made a recommendation of not transporting goats from one province to another province, but to do intra-province distributions because of Foot and Mouth Disease, he said.\n\nBasera confirmed that when the Agriculture Ministry asked Blackdeck to supply 500 goats for a launch project in Chipinge, the company delivered.\n\nDzvetero also asked him to confirm that there were also other incidents where the company wrote to the company to supply the goats for other launches, and he said this was correct.\n\nThe court heard that the ministry was supposed to call the guarantor or go for arbitration in cases of conflicts as outlined in the agreement but the ministry did not do so.\n\nBasera said wthat when he left the ministry, plans were being made to call the guarantor.\n\nThe court also heard that the ministry instead went on to request the supply of more goats under the presidential goat pass on scheme despite the conflict which arose.\n\nThe state alleges Blackdeck submitted fraudulent documents to win the US$87 million deal.\n\nIt is alleged that the two were given an advance payment of US$7 million, which they failed to account for, and they both deny the charges.\n\nTrial continues Tuesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03215456/WhatsApp-Image-2024-10-03-at-12.49.46.jpeg",
            "description": "<p>By Staff Reporter The case in which businessmen Moses Mpofu and Mike Chimombe are accused of defrauding the government of US$7 million in a botched presidential goats scheme Monday took a new twist after former Permanent Secretary in the Ministry of Agriculture John Basera acknowledged that they only partly failed to meet the contractual agreement.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-twist-to-mpofu-chimombe-fraud-case-as-former-agric-perm-sec-gives-evidence/\">New twist to Mpofu, Chimombe fraud case as former Agric Perm Sec gives evidence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        },
        {
            "title": "Healing or Hustle? Smuggled Meds Are Big Draw in Zimbabwe’s Hidden Markets",
            "url": "https://www.newzimbabwe.com/healing-or-hustle-smuggled-meds-are-big-draw-in-zimbabwes-hidden-markets/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Its possible to buy pretty much anything at the market in Hopley, an informal settlement south of this capital city: rat poison, mops  even medicine.\n\nThat medicine is sold without prescriptions, to buyers who dont have a diagnosis from a doctor in hand. Some vendors even offer diagnoses to their customers, even though they dont have any medical training. And in many cases, the medicine is fake. At any moment, police could swoop in for a raid. Vendors keep the medicine out of view, and buyers know who to ask.\n\nGladys Chihozhwa buys contraceptive pills from one of them, and even turns to the vendors for diagnoses when shes sick. She knows the drugs might be expired, or even fake. That doesnt deter her. I buy them because they are cheap, she says.\n\nZimbabwe is overwhelmed with counterfeit medicine, driven by the expansion of informal markets and consumer demand for cheaper products. Police routinely impound pharmaceuticals. In just one example, the Medicines Control Authority of Zimbabwe in January discovered counterfeit rabies vaccines in circulation. Their packaging mimicked that of legitimate imports from India, a big supplier of Zimbabwes medicine.\n\nThe vaccines pathway into the market remains unclear, but some products pour into Zimbabwes informal markets through its leaky borders with Zambia, where counterfeit medicines from India are easily available, and cheap.\n\nThe consequences of this trade can be fatal. According to a2022 report by the United Nations Office on Drugs and Crime, in sub-Saharan Africa alone, counterfeit medicines kill just over a quarter of a million people each year.\n\nEven when not immediately fatal, they can cause long-term harm, includingincreasing antibiotic resistance, says Dr. Grant Marewanhema, a public health expert.\n\nIn a written response, public relations officer Davison Kaiyo says the Medicines Control Authority of Zimbabwe has tried to address this problem by conducting raids with the police and intercepting counterfeit medicines at borders. They also conduct regular inspections at pharmacies. Those caught are prosecuted, and the medicines confiscated, he says.\n\nBut demand is high, so new shipments keep pouring in.\n\nDistribution of fake and substandard medicines is a global, highly profitable criminal enterprise. One 2020study by the Pacific Research Instituteestimated that the counterfeit medicine market is worth somewhere between US$200 billion and US$431 billion annually.\n\nMany of the counterfeit drugs are produced in India, where a mix of highly reputable drug manufacturers and unregulated producers creates serious challenges for oversight and quality control.\n\nAfrica is particularly affected. According to the World Health Organization, 42% of globally detected cases of counterfeit and substandard medical products between 2013 and 2017 were in Africa.\n\nIn Zimbabwe, porous borders facilitate the movement, but a combination of other factors fuels the trade. The countrys decades-long economic problems have left thehealth care system hanging by a thread. Many public hospitals simply dont have medicine supply, says Portifa Mwendera, a pharmacist of 25 years. Most times, patients are given prescriptions and told to source the medication elsewhere, he says.\n\nBut Zimbabwe produces only 30% of its essential medicines. The rest is imported and costly in pharmacies. Many people in the country are too strapped for cash, and these vendors offer options that are easier on the pocket, Mwendera says.\n\nSanudi, a cross-border truck driver, has for two decades smuggled medicine into the country through the Chirundu border post, a key trade and travel point between Zambia and Zimbabwe. He knows many other truckers who do the same. Sanudi asked Global Press Journal to use his middle name for fear of arrest.\n\nIts easy, he says. At the border, if the bag is small, he leaves it with a security guard as the truck undergoes scanning. He pays the guard US$50 to US$60, then charges the traders about US$200 to transport two small bags. If the consignment is too big to stash with the guards, he simply bribes the officials scanning the trucks.\n\nIts a risky operation, but I do it for the extra money I get, he says.\n\nGlobal Press Journal reached out to officials at the Zimbabwe Revenue Authority, but they did not respond to interview requests.\n\nGozo, a vendor who also asked Global Press Journal to use only one name for fear of arrest, sells pharmaceuticals without a license, and offers diagnoses. Once the customer describes their symptoms, Gozo says she knows what to sell them. Two years in this trade have sufficiently equipped her, she says, especially in prescribing antibiotics.\n\nThe people I sell the drugs to get better, she says.\n\nAntibiotics such as ciprofloxacin are popular at her stall, and many of them come from a supplier who gets them from Zambia. Ten antibiotics pills go for US$1 at her stall. In licensed pharmacies, the cost can be twice as much.\n\nIf arrested, she could face high fines or even imprisonment. Police conduct raids at the market from time to time, but sellers like her depend on this trade for a living.\n\nI always take the risk, she says.\n\nGamuchirai Masiyiwais a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02132438/01_GPJNews_Zim_GM_UnregisteredMedicine_-26_L_web.jpg",
            "description": "<p>By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — It’s possible to buy pretty much anything at the market in Hopley, an informal settlement south of this capital city: rat poison, mops — even medicine. That medicine is sold without prescriptions, to buyers who don’t have a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/healing-or-hustle-smuggled-meds-are-big-draw-in-zimbabwes-hidden-markets/\">Healing or Hustle? Smuggled Meds Are Big Draw in Zimbabwe’s Hidden Markets</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        },
        {
            "title": "LATEST: UK shock over sudden death of popular DJ and events promoter",
            "url": "https://www.newzimbabwe.com/latest-uk-shock-over-sudden-death-of-popular-dj-and-events-promoter/",
            "content": "By UK Correspondent\n\nTHE Zimbabwean community in the United Kingdom was left in shock Monday following the sudden death of popular entertainer and events promoter, DJ Kay Cie.\n\nThe DJ, real name Kudzaishe Chipadza, was reportedly found dead at a Birmigham hotel on Monday morning.\n\nChipadza had been one of the leading names in the UK-Zimbabwe showbiz industry since 2008.\n\nHe was recently the MC at the annual SAMA Festival which was held in Leicester.\n\nShowbiz colleagues expressed their sadness with DJ Mel saying, Sad day in the music industry. RIP bro#kaycee\n\nAnother colleague King Alfred said, Just woke up to hear this sad news.We have lost one of us in this music industry Rest in bro till meet again.\n\nMC Sebhelebhe was eqally shocked noting that, We spoke on Sunday mwana wamai vangu and you said mukoma Sebhelebhe get well soon ko now whats this bro. Wabirira game bro. Rest in peaceKay Cie. Number 1 Mc.\n\nMore to follow .\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02134531/DJ-Kay-Cie.png",
            "description": "<p>By UK Correspondent THE Zimbabwean community in the United Kingdom was left in shock Monday following the sudden death of popular entertainer and events promoter, DJ Kay Cie. The DJ, real name Kudzaishe Chipadza, was reportedly found dead at a Birmigham hotel on Monday morning. Chipadza had been one of the leading names in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/latest-uk-shock-over-sudden-death-of-popular-dj-and-events-promoter/\">LATEST: UK shock over sudden death of popular DJ and events promoter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        },
        {
            "title": "SPCA says pitbull’s owner neglected his dogs",
            "url": "https://www.newzimbabwe.com/spca-says-pitbulls-owner-neglected-his-dogs/",
            "content": "By Staff Reporter\n\nThe Zimbabwe National Society for the Prevention of Cruelty to Animals (SPCA), has in its initial assessment of the fatal pitbull attack on Samuel Machara, stated that the owner of the dogs showed negligence and poor management of the dangerous breeds he kept at his property, which was enclosed by a half-length perimeter wall.\n\nThe owner of the dogs, Mike Mupinga, was arrested Sunday and charged with culpable homicide.\n\nIn a statement issued after the incident, the SPCA said that Mupingas failure to properly care for and handle his dogs led them to develop aggressive behaviours, making them dangerous.\n\nThe organisation has since removed all the dogs from the property and confirmed that they were euthanised.\n\nInitial assessment indicates clear evidence of neglect, confinement, and poor socialization of the animals involved. Such conditions are known to severely affect canine behaviour and are especially dangerous when present in certain breeds, particularly those already classified as high risk or dangerous, the SPCA said.\n\nThe SPCA further warned the public against crossbreeding dangerous dog breeds, explaining that such animals require specialised handling skills that many owners may lack, potentially leading to tragic outcomes.\n\nWe strongly caution the public against the ownership, breeding, and cross-breeding of dangerous dog breeds. These animals require specialised handling, socialization and containment responsibilities that, if neglected, can result in tragic consequences such as these, the SPCA added.\n\nThe organisation urgedthe public to approach its offices for assistance with appropriate animal care, advice, or if they wish to surrender their animals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe National Society for the Prevention of Cruelty to Animals (SPCA), has in its initial assessment of the fatal pitbull attack on Samuel Machara, stated that the owner of the dogs showed negligence and poor management of the dangerous breeds he kept at his property, which was enclosed by a half-length</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spca-says-pitbulls-owner-neglected-his-dogs/\">SPCA says pitbull’s owner neglected his dogs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:11",
            "date": "03 Jun 2025"
        }
    ]
}