{
    "news": [
        {
            "title": "Scottland FC winger Nathan smuggled into Warriors COSAFA Cup squad",
            "url": "https://www.newzimbabwe.com/scottland-fc-winger-nathan-smuggled-into-warriors-cosafa-cup-squad/",
            "content": "By Sport Reporter\n\nNathan Mutasa on Monday grabbed the attention of Zimbabwes football fraternity after his surprise inclusion in the 2025 Warriors COSAFA Cup squad.\n\nThe Scottland FC winger is son to socialite Pokello Nare.\n\nMutasas pictures at Robert Mugabe International Airport departures, donning the Warriors travelling kit, were widely shared on social media, with many questioning his inclusion.\n\nHe was not part of the official COSAFA squad announced by Warriors coach Michael Nees lastTuesday.\n\nAccording to sources at ZIFA, the former Grenada player replaced Dynamos midfielder Vusa Ngwenya in the squad. Reasons for Ngwenyas exclusion were not highlighted.\n\nMutasa has been facing criticism from Scottland fans over his poor performance on the pitch.\n\nOn Saturday, Scottland FC coach Tonderai Ndiraya could not give a meaningful answer at Ngoni stadium after he was questioned why Mutasa made it into the starting line-up ahead of better players who play the same position, like Panashe Mutimbanyoka and Michael Tapera.\n\nThe COSAFA Cup tournament is his first senior national team call-up, since he last featured for the Young Warriors at under-17 level.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/03060440/WhatsApp-Image-2025-06-02-at-22.53.54.jpeg",
            "description": "<p>By Sport Reporter Nathan Mutasa on Monday grabbed the attention of Zimbabwe’s football fraternity after his surprise inclusion in the 2025 Warriors COSAFA Cup squad. The Scottland FC winger is son to socialite Pokello Nare. Mutasa’s pictures at Robert Mugabe International Airport departures, donning the Warriors travelling kit, were widely shared on social media, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fc-winger-nathan-smuggled-into-warriors-cosafa-cup-squad/\">Scottland FC winger Nathan smuggled into Warriors COSAFA Cup squad</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jun 2025"
        },
        {
            "title": "Thuli Phongolo denies dating gold dealer Scott Sakupwanya",
            "url": "https://www.newzimbabwe.com/thuli-phongolo-denies-dating-gold-dealer-scott-sakupwanya/",
            "content": "TimesLive\n\nActress and DJ Thuli Phongolo has come out to refute claims she is dating Zimbabwean businessman Scott Sakupwanya.\n\nThis after controversial celebrity bloggerMusa Khawulaalleged the two were an item.\n\nTaking to her Instagram stories recently, Thuli poured water on the rumours, saying:Let me indulge you for a sec. You guys need to stop trying to link me to people I wouldnt even consider dating. Im not dating Scott Kupa. The end.\n\nThuli Ps Instagram story post. Image:Instagram/ Thuli P\n\nThuli was then rumoured to be dating DJ and producer Master KG when she was often spotted in the comment section of his social media posts.She was later linked to DJ Maphorisa after videos of them holding hands and spending time together circulated on the timeline.\n\nWhile Thuli first shut down the rumours, the truth came to light that they were an item when she opened a case of assault against him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02124608/thuli.jpg",
            "description": "<p>TimesLive Actress and DJ Thuli Phongolo has come out to refute claims she is dating Zimbabwean businessman Scott Sakupwanya. This after controversial celebrity blogger Musa Khawula alleged the two were an item. Taking to her Instagram stories recently, Thuli poured water on the rumours, saying: “Let me indulge you for a sec. You guys need to stop</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thuli-phongolo-denies-dating-gold-dealer-scott-sakupwanya/\">Thuli Phongolo denies dating gold dealer Scott Sakupwanya</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jun 2025"
        },
        {
            "title": "More than 700 believed dead in devastating Nigeria floods",
            "url": "https://www.newzimbabwe.com/more-than-700-believed-dead-in-devastating-nigeria-floods/",
            "content": "BBC\n\nThe official death toll after deadly floods hit the Nigerian town of Mokwa on Thursday has risen to more than 200, officials say.\n\nAnother 500 people are still missing in the town in the central Niger State however, local official Musa Kimboku told the BBC that rescue efforts had ceased because authorities no longer believe anyone could still be found alive.\n\nThe floods, said to be worst in the area for 60 years, swept through the Mokwa districts of Tiffin Maza and Anguwan Hausawa after torrential rains.\n\nIn an effort to prevent disease in the area, authorities will soon start to dig out corpses buried underground, Mokwas district head Muhammadu Aliyu said.\n\nRecounting scenes of catastrophe, local residents told the BBC that they saw their homes and family members get washed away.\n\nOne man, Adamu Yusuf, lost his wife and newborn baby.\n\nI watched helplessly as water washed away my family. I survived because I could swim, he told the BBC.\n\nAnother resident, Saliu Sulaiman, said the floods had left him homeless and destroyed some of his cash business profits.\n\nI lost at least $1,500 to the floods. It was the proceeds from the sale of my farm produce the previous day. I contemplated going back into the room to get it, but the pressure of the water scared me.\n\nSome local residents have said that the flooding was so devastating because a nearby dam had burst, however the authorities have not confirmed this.\n\nOn Sunday, the National Emergency Management Agency (Nema) announced it had started the process of providing relief packages to people affected.\n\nThe agencyadded in a post on Facebookthat roads and bridges were also affected by the flood, which has had a knock-on effect on the local economy and traffic.\n\nThe Nigerian Red Cross alsoreleased a statement on Fridaysaying the floods had caused significant loss of life and widespread distress.\n\nFloods are not uncommon during the Nigerian rainy season, which lasts from April until October.\n\nIn 2024, Nigeria experienced flooding from heavy rain which caused deaths and drove people from their homes.\n\nThere was also severe flooding in 2022, when more than 600 people died and 1.3 million were displaced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02123931/nigeria-floods.webp",
            "description": "<p>BBC The official death toll after deadly floods hit the Nigerian town of Mokwa on Thursday has risen to more than 200, officials say. Another 500 people are still missing in the town in the central Niger State however, local official Musa Kimboku told the BBC that rescue efforts had ceased because authorities no longer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-than-700-believed-dead-in-devastating-nigeria-floods/\">More than 700 believed dead in devastating Nigeria floods</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jun 2025"
        },
        {
            "title": "Olorato Mongale’s mother: ‘I could see that my daughter fought, she even lost her nails’",
            "url": "https://www.newzimbabwe.com/olorato-mongales-mother-i-could-see-that-my-daughter-fought-she-even-lost-her-nails/",
            "content": "BLOEMFONTEIN  The mother of slain journalist Olorato Mongale shared the heartbreaking moment she realised something was wrong.\n\nBasetsana Mongale took to the podium at the Bloemfontein City Hall on Sunday, where hundreds gathered to bid farewell to the 30-year-old, who was killed in Johannesburg last Sunday.\n\nThe young journalist had left home to meet a man shed recently been dating, but never returned.\n\nHer mother said she drove through the night, from Bloemfontein to Johannesburg, after getting a call from her daughters friend.\n\nIt was a Sunday, I was at home relaxing after golf. I got a call from her friend asking when last I spoke to her, I said in the morning. She said Olorato is missing. I showered, poured petrol and sped to Johannesburg. In my heart, something was saying shes no more.\n\nOloratos body was discovered in Lombardy East hours later.\n\nThe prime suspect Philangenkosi Makhanya, wasfatally shot during a confrontation with policein KwaZulu-Natal (KLZN) on Friday.\n\nAnothersuspect was clearedon Saturday, while a third remains at large.\n\nBasetsana described her daughter as a fighter, someone who never backed down, even in her final moments.\n\nHer mother spoke of her daughters courage.\n\nI know shes a fighter. When I saw her at the government mortuary, I could see that my daughter fought. There is no time where she begged for mercy. She fought to the end, she even lost her nails, she fought.]\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02123709/olorato-mongales-mom.webp",
            "description": "<p>EWN BLOEMFONTEIN – The mother of slain journalist Olorato Mongale shared the heartbreaking moment she realised something was wrong. Basetsana Mongale took to the podium at the Bloemfontein City Hall on Sunday, where hundreds gathered to bid farewell to the 30-year-old, who was killed in Johannesburg last Sunday. The young journalist had left home to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/olorato-mongales-mother-i-could-see-that-my-daughter-fought-she-even-lost-her-nails/\">Olorato Mongale’s mother: ‘I could see that my daughter fought, she even lost her nails’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "03 Jun 2025"
        }
    ]
}