{
    "news": [
        {
            "title": "South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans",
            "url": "https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/",
            "content": "By Thandiwe Garusa\n\nPublic Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals.\n\nThere have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring countrys already stretched public resources.\n\nAmong these groups is Operation Dudula in Gauteng, which has been actively preventing undocumented immigrants from accessing healthcare.\n\nIn an interview on Monday, ZHRC Chairperson Jessie Majome told South African broadcaster Newzroom Afrika that she recently had discussions with PPSA to resolve the issue of healthcare denial for Zimbabweans.\n\nMajomesinterview triggered a public uproar from South Africans condemning the PPSA for allowing Zimbabweans to fight for rights in a foreign country instead of fighting for the same healthcare access in their country.\n\nHowever, in a statement Tuesday, PPSAspokesperson Ndili Msokidenied Majomes claims, saying there was never any discussion around healthcare issues specifically affecting Zimbabwean nationals.\n\nThe PPSA said that when it hosted a ZHRC delegation last year, the discussions focused on institutional strengthening, corruption, and service delivery challenges in both countries but did not address migrant access to healthcare.\n\nFollowing numerous media inquiries, the PPSA wishes to clarify that it has no record of a complaint lodged by the ZHRC in relation to the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nAt no point did the discussions then, nor recently, focus on the denial of Zimbabwean nationals access to healthcare services in South Africa.\n\nRather, the discussions were about, among other things, the state of the healthcare systems in both countries.\n\nAccordingly, the PPSA also referred to its own investigation into the state of the healthcare system in South Africa as a guide for the ZHRC to conduct similar investigations in its own country,Msoki said.\n\nThe PPSA also emphasised that it has not received any complaint of that nature.\n\nSouth African authorities have for long expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed economy back home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09194917/march-movement.webp",
            "description": "<p>By Thandiwe Garusa Public Protector South Africa (PPSA) has denied ever holding discussions with the Zimbabwe Human Rights Commission (ZHRC) regarding the denial of healthcare access to Zimbabwean nationals. There have been reports of anti-migrant groups in South Africa blocking foreign nationals from accessing public health facilities, citing that they strain the neighbouring country’s already</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-public-protector-dismisses-claims-of-talks-with-zhrc-on-healthcare-access-for-zimbabweans/\">South Africa’s Public Protector dismisses claims of talks with ZHRC on healthcare access for Zimbabweans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        },
        {
            "title": "Maid convicted for ill-treating employer’s daughter",
            "url": "https://www.newzimbabwe.com/maid-convicted-for-ill-treating-employers-daughter/",
            "content": "By Staff Reporter\n\nA 21-year-old house helper from Chipinge has been jailed 12 months following her conviction for ill-treating a minor girl she was taking care of.\n\nTafadzwa Mtisi, however, escaped a custodial sentence after four months of her sentence was suspended on condition of good behaviour.\n\nFurther eight months were suspended on condition that she perform 350 hrs of community service.\n\nMtisi was residing at Muchakagara Village, Chief Musikavanhu, Chipinge, where she was working as a maid.\n\nThe victim is a grade five student at China Primary School and is aged 10.\n\nMtisi was charged with illtreatment of a minor when she appeared before Magistrate Mangoni.\n\nThe court heard that on July 31 2025 and at around 19:00 hours, Mtisi confronted the complainant, accusing her of spreading rumours that she was not feeding them at home.\n\nComplainant remained quiet, and the accused person then took a wooden log and hit the complainant several times on her buttocks.\n\nComplainant sustained bruises on her buttocks and swollen body, the court heard.\n\nThe matter came to light when the complainants class teacher realised that she had sitting difficulties.\n\nShe was questioned and she revealed the abuse.\n\nThe case was then reported at ZRP Chipinge Rural and the complaint was sent to Chipinge District Hospital for medical examination.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/28190845/domestic-worker.jpg",
            "description": "<p>By Staff Reporter A 21-year-old house helper from Chipinge has been jailed 12 months following her conviction for ill-treating a minor girl she was taking care of. Tafadzwa Mtisi, however, escaped a custodial sentence after four months of her sentence was suspended on condition of good behaviour. Further eight months were suspended on condition that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maid-convicted-for-ill-treating-employers-daughter/\">Maid convicted for ill-treating employer’s daughter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        },
        {
            "title": "Zimfest significance: A Gen Z  second generation diaspora perspective",
            "url": "https://www.newzimbabwe.com/zimfest-significance-a-gen-z-second-generation-diaspora-perspective/",
            "content": "By Tariro Mugadza\n\nIts been just over a week since I attended Zimfest, having had my first experience of the festival in 2007 when I was in a pushchair under a year old, and Im already ready to grab tickets for the next one. Alongside the overwhelming joy and warmth this years event left me with, Ive also been carrying a deep sense that I experienced something truly meaningful, something far beyond just having fun. It stirred something within me, strengthening my connection to my roots and heritage. After all, its not every day that I get to be among my people, especially beyond the familiar walls of my home.\n\nThis was my second time inviting non-Zimbabwean friends to Zimfest, and it gifted me with an even deeper appreciation for my culture and heritage. Witnessing their genuine curiosity, enthusiasm, and respect for Zimbabwean culture was profoundly moving. Seeing them light up with joy and admiration for the very things I grew up loving is something I will never forget.\n\nWhether they were drooling over the culinary delights, like chakalaka and boerewors (shoutout to Just James MCR for that delicious lunch!), or captivated by the visual brilliance of Zimbabweans showing up and showing out in style, the day was filled with heart-warming moments and an overwhelming sense of pride.\n\nReflecting on their experience at this years Zimfest, my friends shared some powerful sentiments. Anton, who is UK-born and half-British, half-German, said, Im not even from Zimbabwe, and it made me feel more connected to its culture.Fikunmi, who is Black, Yoruba, and migrated from Nigeria to the UK at the age of three, said, Going to Zimfest allowed me to connect to a culture that wasnt my own, yet I still felt welcomed, like an honorary Zimbabwean.\n\nMy lunch bought from the Just James MCR Stall at Zimfest\n\nFinding a Sense of Identity and Belonging\n\nLiving in the Diaspora, I know firsthand that it is simply not possible to constantly return home or physically engage with your people. This is where festivals like Zimfest step in by providingthe much-needed opportunity to be amongst your people, to fully embrace and express your native identity and to rejoice in a common sense of cultural pride.\n\nHere in the diaspora, the culture I was raised withfrom the daily home-cooked meals to the dcor adorning our walls, from the music blasting during ourgochi gochiand braais in the back garden to the spirited family games of Crazy Eightsdoes not reflect the culture I encounter the moment I step outside my front door.\n\nBack home, stepping out and being surrounded by your own people is part of everyday life. But here, in the diaspora, those moments are rareand therefore deeply precious. This is especially true for those of us who grew up or lived in predominantly white areas, in places weve never truly identified with and perhaps never will. In spaces where, for years and sometimes even now, simply seeing another Black person in town becomes a moment of excitement.\n\nTinaye, a second-generation Zimbabwean migrant who was raised in South Africa and moved to the UK for boarding school at the age of 12, attended Zimfest for the first time this year. She commented: Zimfest is a reminder of how much community you can find in the UK being a Zimbabwean andI find that important as someone who has gone to predominantly white schools.\n\nFor, as a second-generation migrant, I am one with those whom I simply do not have immediate access to. Yet, at Zimfest, there is that precious opportunity to truly feel that strong, unwavering power of unity and Ubuntu as I join with my community.\n\nRuvarashe, a second-generation Zimbabwean migrant born and raised in the UK, commented on Zimfest as a powerful way to connect with my roots. Exploring the distinction between first-generation and second-generation migrants, she stated: While first-generation migrants carry lived memories of home, I often navigate identity through culture, music and community. Zimfest helps bridge that gap by providing a space dedicated to belonging, pride and a deeper understanding of my heritage. Alongside the inherent sense of belonging that comes along with attending Zimfest, there is the more personal, individual aspects of being able to walk around comfortably knowing that I will not stand out or receive looks of fear or judgement simply on the basis of skin colour alone.\n\nTinaye further stated: Its quite easy to feel isolated and feel like youre out of place and losing your culture.But, when youre surrounded by people and hearing your language even though you are not in your country, you realise that you are not alone. Zimfest is empowering in that, I know that guaranteed for at least one day of the year, I will be able to evade the everyday sense of minority to exist within the majority on the Zimfest grounds  just like kumusha.\n\nCommenting on her experience as an African migrant living in the Diaspora, my friend Fikunmi further stated: It was hard fitting into British culture and often I felt alone, but being at Zimfest helped me know that I am not alone, and even with people outside of my own culture I have a family.\n\nLooking Back and Looking Forward\n\nThe establishment and organisation of such a significant and meaningful celebration of culture and identity is far from a lacklustre trick which can be pulled together overnight but rather a process of resilience, dedication, determination and reflection.\n\nStuck in a mesmerising haze of Zimfest nostalgia, I became curious to find out more about how and why Zimfest has become such a noteworthy event on both a personal level, for me as a second-generation Zimbabwean migrant living in the Diaspora, and on a community level for the thousands of people I join with each year. This led me to ask a representative from the Zimfest organising team to reflect on the main motivations for Zimfest, the vision for Zimfest itself and the vision for the generations to come:\n\nAlthough gone are the days of seeing Mtukudzi (MHSRIEP)  the first high-profile musician to play at Zimfest  and Mukanya onstage, there are so many magnificent ways Zimfest has continued to improve over the years since its humble beginnings as a come together without the focus on music that we appreciate nowadays. This includes the innovation of the festival to include the younger generation by adding features such as the Fun Fair and the Amapiano tent. Tinaye further commented: Its great to see so many young Zimbabweans, South Africans and Africans embracing their culture and keeping up with the mainstream artistry of Zimbabwe even though we do not live there.\n\nPersonally, I loved how the layout of Zimfest improved this year, with the Fun Fair area becoming more central. Despite being too old for the trampolines, it was a delight to discover that I still qualified to ride the Ferris wheel. What a superb way to soak in the views at Zimfest! I personally cannot wait to try out the swing ride that made its first appearance this year, next year!\n\nA view of the Zimfest crowds from the ferris wheel\n\nThe Zimfest organisers representative commenting on Zimfests plans to become even bigger and fresher said: To enhance Zimfest, the plan includes featuring diverse, internationally acclaimed artists and introducing new activities like dance sessions and cultural exhibitions for various age groups. A hybrid experience with virtual attendance will attract a global audience. By gathering continuous attendee feedback, Zimfest aims to innovate and remain relevant, ultimately creating an inclusive celebration that fosters unity and pride in cultural heritage.\n\nI have always felt included at Zimfest and appreciated it as a family festival. However, this year, there were some community concerns raised about Zimfest remaining as family friendly and inclusive as previous years. With respect to these concerns, the Zimfest organising team representative expressed: Zimfest aims to create a family-friendly atmosphere by enhancing its appeal for all ages. Key initiatives include:\n\nCommunity Business Ethics\n\nIt is thanks to Black Zimbabwean-owned businesses such as Nyama Butchery (now closed) in Birmingham and Mwanaka Fresh Farm Foods in Walsall and local businesses such as Palmers in Milton Keynes and Joseph Morris Butchers that I have grown up with the gap between life in the Diaspora and lifekumushamore bridged. Growing up, stepping through the PVC strip curtains of the Nyama butchery  donned the maputi shop by either me or my sister and eventually the whole household  felt like arriving at Narnia itself. It is here that I developed my lifelong love for lemon creams and Mazoes cream soda. In August 2023, I was blessed to be invited to celebrate the renowned Mwanaka Fresh Farm Foods 20+ years of farming in Cambridge. The day was deeply emotional and inspiring to see such great success and be told such poignant stories within my very own community.\n\nFrom the small stores selling wonders beaming with Zimbabwean pride, such as gorgeous jewellery (shoutout to Rungano from Paper Pieces for the beautiful, sustainable jewellery I bought last year), stylish Zimbabwean apparel and mouth-watering snacks, to the major sponsors, such as World Remit and Diaspora Insurance, the message is clear: it is fundamental that we as Black Africans, support Black owned and African owned businesses. The money spent here has so much more significance and promotes far more ethical business practices than a quick order from the likes of Shein and Temu. For example, in the UK, it is a reality that the Black British community has a spending power of 300 billion, yet only 2% of this is spent within Black-owned businesses. By supporting Black owned and African-owned businesses, you contribute to alleviating existing economic disparities and breaking down systemic barriers that bog down Black enterprises.\n\nJewellery at Paper Pieces 2024 Zimfest Stall\n\nCommenting on the economic significance of Zimfest and wider community impacts, Jeff Madzingo, the CEO and Founder ofDiaspora Insurance, stated that Zimfest is a very significant event in more than one way. Beyond the socio-cultural importance, it glues a thriving community celebrating identity and togetherness. He further stated We, Diaspora Insurance, always plug in as a sponsor to make it worthwhile and economically viable to the organisers because Zimfest as a whole is not just an opportunity to empower each other, but a little economy where our black spending power is leveraged to prop up small community businesses that serve us as a people. By supporting the businesses of our people, we also invest in the economies of our home countries. When devouring delicious plates of food at Zimfest that leave you wanting to lick your fingers, it is not only the body that is being gloriously fed, but our businesses, our economies and our people.\n\nWhile Zimfest is very much about being together and interacting as a people, we must not forget the tangible, physical grounds and natural environment of Zimfest that allow us to partake in our festivities side by side. As well as maintaining respect for each other as attendees, we must also respect the venue and the natural grounds upon which we have been united and brought together as a community. After Zimfest, there were eyesores of waste littering the once green Herts Country Showground and a dismal afterparty of litter picking and waste removal had begun.\n\nA View of the Rubbish leftover at The Herts County Showground after Zimfest\n\nIn response to my queries on what Zimfest could implement and introduce to reduce waste and become more sustainable, the representative from the Zimfest organising team commented: Partnering with environmental organisations boosts recycling through more bins and community education on waste disposal. Collaborating with vendors to reduce single-use plastics and use biodegradable materials supports sustainability. Hosting workshops provides practical tips, fostering lasting environmental awareness. This strategy minimises waste and enhances community engagement for a greener future. As for the hideous congregations of waste dumped and abandoned by attendees at the venue after the event, the Zimfest representative stated: Efficient post-event waste management is essential for sustainability. Key strategies include:\n\nCollaborating with local waste management services for effective processing.\n\nHeres to a more green, clean and sustainable Zimfest!\n\nThe music, artistry and dancing\n\nZimfest is a place where people of all ages can dance as one.\n\nWithin a behind-the-scenes video displayed to the audience at a school fundraiser before my performance, I explained, Dancing in general [it was a tap performance] has always been such a passion of mine and a large part of that is credited to my heritage as a Shona person. Zimfest wholeheartedly made me feel the power of this acknowledgement. Through dancing and music, I immediately feel connected to my heritage, culture and history. This is why, as a second-generation Zimbabwean migrant living in the Diaspora, I am grateful to be able to attend festivals like Zimfest where you can fully embrace and enjoy the collective melodies, basslines, sways and shuffles that pulse through your body and tenderly deliver you home. Whether in the queue for food, walking across the grass to the main action or in the middle of the Amapiano tent, we were jiving and vibing. We were truly here. After leaving early morning and driving hours on the motorway to get to Zimfest, the sight of the Amapiano tent in the distance as we increasingly approached the Herts County Showground not only raised the energy in the car but also reenergised my sleepy self in the left backseat. Unaware of how the days events would unfold, I began to feel prepared and excited  a true testimony to the power of Zimfest.\n\nThe Amapiano tent at Zimfest 25\n\nOne special, cherished thing about the celebration and rejoice that occurs at Zimfest is that we rejoice in our mother languages. Living in the Diaspora, my mother tongue, Shona, is a language that often goes unheard as you pass by strangers on the street, get taught in the classrooms or converse with peers. Yet, at Zimfest, Shona is far from scarce. Reflecting on her experience in the Amapiano tent and in front of the main stage, Tinaye stated, People being able to pronounce the lyrics stood out to me the most. Hearing the crowd singing what sounds correct was quite shocking. The opportunity to hear your language being spoken, sung and chanted en masse is an undeniably soul-soothing experience that I never take for granted.\n\nDespite not understanding the lyrics of the songs, I have watched my non-Zimbabwean friends turn into absolute fanatics of Zimbabwean music and Amapiano. From some never even hearing of Amapiano before, humorously mistaking it for me saying Im a piano to jumping in a manner almost as spirited as Jah Signal in the Amapiano tent, it was pure bliss to see them fully embrace the Zimbabwean rhythms and festivities. Seeing their excitement to see Winky D grace the Zimfest stage as headliner once again was a wonderful way to end our time at Zimfest. Winky Ds stage presence is undoubtedly barrier-breaking not just beyond language but for the physical distance fromkumusha. Despite the headliner no longer onstage and the Zimfest crowds already dispersing, it wasnt yet our time to go. At least, not before taking some group pictures at this years newly added Zimfest sign adorned with the colours of the Zimbabwean flag. What a way to close off such a monumental day of unity, pride, radiance and transcendence!\n\nThe newly added Zimfest Sign on the Herts Country Showground\n\nWhile this years Zimfest lineup certainly did not cease to enthral and entertain, there are still ways to improve, especially with regard to inclusivity and diversity. In response to my inquiry about the diversification of Zimfest to, for example, include more languages and a more diverse lineup with more women, the representative from the Zimfest organising team replied: Incorporating other African languages into Zimfest would enhance inclusivity, celebrate diverse cultures, attract a wider audience, and foster cultural exchange. Zimfest focuses on enhancing diversity by including more languages and a varied lineup, actively seeking female artists from diverse African backgrounds. Future plans involve partnering with cultural ambassadors and community leaders to highlight unique contributions from different African communities.\n\nConclusion\n\nThese are the reasons why I, as a second-generation migrant living in the Diaspora, have always felt Zimfest is the day of summer, if not the year, that I always look forward to. From the small joys of finding out I wasnt too old for the ferris wheel to the big joys of watching my non-Zimbabwean friends indulge in Sadza for the first time and later repeatedly scream at the top of their lungs in unison with the Zimfest crowds Noooooo in response to Winky D asking Can I go home?, Zimfest is a true refresher for the soul and spirit. We must come to festivals such as Zimfest to celebrate, support and rejoice as a people with Ubuntu ablaze.\n\nI simply cannot stop scrolling through the new memories captured in my camera roll. The return home after Zimfest has not just been physical  equipped with new, beautiful jewellery to adorn at my next outing and a cheeky packet of lemon creams my mum surprised me with this week  but emotional, spiritual and transcendental. The warmth of Zimfest takes me back to my few but meaningful moments kumusha such as sitting across the blazing fire and bonding with my loved ones to watchingvana sekuru nanambuyajive while Zim classics such as Mukanyas Chimurenga music ring out. The event began with rain leading us to take cover in the Amapiano tent  with our dance moves making it all less miserable  and, as the festivities progressed and picked up, it was not just the daylight that got brighter and clearer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30080944/ZimFest-Winky-D.png",
            "description": "<p>By Tariro Mugadza It’s been just over a week since I attended Zimfest, having had my first experience of the festival in 2007 when I was in a pushchair under a year old, and I’m already ready to grab tickets for the next one. Alongside the overwhelming joy and warmth this year’s event left me</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimfest-significance-a-gen-z-second-generation-diaspora-perspective/\">Zimfest significance: A Gen Z  second generation diaspora perspective</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        },
        {
            "title": "High Court dismisses application by Mugabe’s secret son seeking inclusion in late former President’s estate",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-application-by-mugabes-secret-son-seeking-inclusion-in-late-former-presidents-estate/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by the late former president Robert Mugabes secret son, who was seeking to be included as a beneficiary in the longtime rulers estate.\n\nThe alleged son, Tonderayi Gabriel Mugabe, was seeking condonation for the late filing of his review against the estate of the late Robert Gabriel Mugabe.\n\nIn his application, he cited Bona Nyemudzai Ouma Mutsahuni, acting in her capacity as the estates executrix and the Master of the High Court.\n\nBut High Court judge Fatima Maxwell dismissed his application, noting among other things that there was no documentation confirming that he is Mugabes son.\n\nThe inclusion of the fathers details on a birth certificate is proof of acknowledgement of paternity.\n\nThe exclusion, therefore, when the birth certificate was obtained during the lifetime of the alleged father is a clear indication that paternity was not acknowledged, said the judge.\n\nThe judge said re-registration of birth is governed by section 19 of the Births and Deaths Registration Act [Chapter 5:02].\n\nHe saidit can only be conducted where the status of a child is to be changed from being born out of wedlock to born in wedlock.\n\nSection 19 does not allow the re-registration of a birth of a child born out of wedlock whose parents never married and whose father is late.\n\nApplicant did not state that his mother ever married the late former President Robert Gabriel Mugabe.\n\nThat may be the reason why, even though the Births and Deaths Registration office might have bowed to the pressure of the name, they did not go as far as to reflect the details of the alleged father on the birth certificate.\n\nApplicant seems not to have understood the request by the Masters Office in Annexure D to obtain a birth certificate confirming his position.\n\nIt is not simply a matter of having a surname, but of having a birth certificate confirming that the alleged father is indeed the father as claimed.\n\nSuch confirmation would have been if the tendered birth certificate had the details of the father of the child.\n\nNone of the documents confirms who the father of the child is.\n\nWhilst it confirms that the applicant is a sibling of the other person tested, it does not show paternity. What it shows is that he might have been sired by one of the males related to the person who was tested.\n\nFor the above reasons, I find that the applicant has not discharged the onus of proving that he was entitled to benefit from the estate of the Late Robert Gabriel Mugabe.\n\nThere is no reason to allow the reopening of Estate Late Robert Gabriel Mugabe DR 2703/19. No basis has been laid to justify reviewing the Masters decision to confirm the account and close the estate, ruled the judge.\n\nMugabe asserted that he was the son of the former President Robert Gabriel Mugabe, having been born in Mozambique in 1977.\n\nHe presented a narrative of secretive family ties and a quest for identity within the Mugabe lineage.\n\nMugabe said he was born on 20 April 1977 in Chimoio, Mozambique to one Hilda Maeka, having been fathered by the late former president.\n\nHe said his parents met in Zimbabwe after independence, and for reasons unknown to him, his father did not want it to be disclosed to the public that he was his son until a later stage.\n\nHis mother died before the disclosure.\n\nMugabe also alleged that he would meet his father occasionally, but that was kept a secret from the first family.\n\nHe was, however, in contact with his fathers siblings, such as Bridget Mugabe, read court papers.\n\nMugabe further alleged that his father passed away before he was formally introduced to the Mugabe family.\n\nThe estate was advertised, and he notified the executor, Bona Mugabe, about his claim and the fact that he was the deceaseds son.\n\nAccording to court documents, Bonas lawyers requested a DNA Test.\n\nThe DNA tests confirmed that he was born of the Mugabe parental lineage.\n\nThrough a Notarial Deed of Change of Name, he changed his name from Tonderayi Maeka to Tonderayi Gabriel Mugabe.\n\nHe then approached Bona and her lawyers, but was not entertained.\n\nOn the 2nd of June 2023, he then learnt that the estate was closed on 18th of December 2020 by confirmation of the account.\n\nMugabe said he attempted to obtain a declaratory order for the reopening of the Estate of Late Gabriel Mugabe under case number HCH 3729/23 but was not successful.\n\nDespite these claims, the High Court also found the application for condonation lacking in merit, primarily due to his failure to provide a satisfactory explanation for the substantial delay of over four years in pursuing his claims.\n\nThe degree of non-compliance is inordinate, and the explanations given are rife with gaps, ruled the judge, emphasising the need for clear and convincing evidence in matters of inheritance.\n\nThe court deliberated on various factors, including the significance of the alleged heirs delay, which was described as inexplicable by the judge.\n\nWhile the applicant claims a right to the estate, he has not established a reasonable basis for the delay in filing his application, Justice Maxwell articulated, reinforcing the gravity of procedural timelines in legal proceedings.\n\nIn dismissing the application, the court cautioned against potential prejudice to the rightful beneficiaries of the Mugabe estate.\n\nThe balance of convenience favours the dismissal of this application as the deserving beneficiaries of the Estate Late Robert Gabriel Mugabe would be greatly prejudiced by the reversal of a process that was completed more than four years ago, said the judge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/29193343/Mugabe-Today.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by the late former president Robert Mugabe’s ‘secret son’, who was seeking to be included as a beneficiary in the longtime ruler’s estate. The alleged son, Tonderayi Gabriel Mugabe, was seeking condonation for the late filing of his review against the estate of the late</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-application-by-mugabes-secret-son-seeking-inclusion-in-late-former-presidents-estate/\">High Court dismisses application by Mugabe’s secret son seeking inclusion in late former President’s estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        },
        {
            "title": "Limpopo pig farm murders: South African farm worker says he was forced to feed women to pigs",
            "url": "https://www.newzimbabwe.com/limpopo-pig-farm-murders-south-african-farm-worker-says-he-was-forced-to-feed-women-to-pigs/",
            "content": "BBC\n\nA white South African farm worker accused of killing two black women says he was forced to feed their bodies to pigs, according to lawyers.\n\nAdrian de Wet is one of three men facing murder charges after Maria Makgato, 45, and Lucia Ndlovu, 34, were killed while allegedly looking for food on a farm near Polokwane in South Africas northern Limpopo province last year.\n\nTheir bodies were then alleged to have been given to pigs in an apparent attempt to dispose of the evidence.\n\nMr De Wet, 20, turned state witness when the trial started on Monday and says farm owner Zachariah Johannes Olivier shot and killed the two women.\n\nMs Makgato and Ms Ndlovu were searching for soon-to-expire dairy products which had been left for pigs when they were killed.\n\nMr De Wet, a supervisor on the farm, will testify that he was under duress when he was forced to throw their bodies into the pig enclosure, according to both the prosecution and his lawyer.\n\nIf the court accepts his testimony, all charges against him will be dropped.\n\nThe case has sparked outrage across South Africa, exacerbating racial tensions in the country.\n\nSuch tension is especially rife in rural areas, despite the end of the racist system of apartheid more than 30 years ago. Most private farmland remains in the hands of the white minority, while most farm workers are black and poorly paid, fuelling resentment among the black population, while many white farmers complain of high crime rates.\n\nWilliam Musora, 50, another farm worker, is the third accused. He and Mr Olivier, 60, are yet to enter a plea and remain behind bars.\n\nThe three men also face charges of attempted murder for shooting at Ms Ndlovus husband, who was with the women at the farm  as well as possession of an unlicensed firearm and obstructing justice for allegedly dumping the bodies in the pig enclosure in an attempt to conceal evidence.\n\nMr Musora, a Zimbabwean national, faces an additional charge under South Africas Immigration Act over his status as an illegal immigrant.\n\nThe Limpopo High Court was packed with supporters and relatives of the victims ahead of proceedings. Also present was Mr Oliviers wife, who was seated in the front row of the public gallery and could be seen wiping away tears.\n\nMembers of opposition party Economic Freedom Fighters, which has previously called for the farm to be shut down, were also present in the courtroom.\n\nThe trial was postponed to next week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04194321/limpopo-pig-farm-murder.webp",
            "description": "<p>BBC A white South African farm worker accused of killing two black women says he was forced to feed their bodies to pigs, according to lawyers. Adrian de Wet is one of three men facing murder charges after Maria Makgato, 45, and Lucia Ndlovu, 34, were killed while allegedly looking for food on a farm</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/limpopo-pig-farm-murders-south-african-farm-worker-says-he-was-forced-to-feed-women-to-pigs/\">Limpopo pig farm murders: South African farm worker says he was forced to feed women to pigs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        },
        {
            "title": "British drug mules jailed for 9 years each",
            "url": "https://www.newzimbabwe.com/british-drug-mules-jailed-for-9-years-each/",
            "content": "By Mary Taruvinga\n\nTwo British nationals have been slapped with a nine-year jail term each after they were convicted of smuggling 66 kgs of dagga into the country.\n\nThe two are Tihaise Darlin Elisha (19) and Taylor Tamara Simone (21).\n\nThe two were charged with unlawful dealing in dangerous drugs.\n\nProsecutors proved they were caught with 65,415kg of dagga at Robert Mugabe International Airport on May 1 this year.\n\nThe couple arriving aboard Ethiopian Airways Flight ET 873 were flagged by detectives from the CID Drugs and Narcotics after suspicious behaviour and intelligence led to a successful search of their four suitcases.\n\nThe search uncovered a total of 53 packets of cannabis hidden in red and brown luggage, tagged names of the offenders, said the National Prosecuting Authority.\n\nThe two will serve six years each after part of their sentence was suspended on condition of behaviour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Mary Taruvinga Two British nationals have been slapped with a nine-year jail term each after they were convicted of smuggling 66 kgs of dagga into the country. The two are Tihaise Darlin Elisha (19) and Taylor Tamara Simone (21). The two were charged with unlawful dealing in dangerous drugs. Prosecutors proved they were caught</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/british-drug-mules-jailed-for-9-years-each/\">British drug mules jailed for 9 years each</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        },
        {
            "title": "Ramaphosa admits SA is reeling from US tariffs, but insists it is not alone",
            "url": "https://www.newzimbabwe.com/ramaphosa-admits-sa-is-reeling-from-us-tariffs-but-insists-it-is-not-alone/",
            "content": "IOL\n\nPresident Cyril Ramaphosa has conceded that South Africa is grappling with the United States decision to impose a30% tariff on local imports, but insists the country is not alone in facing mounting global trade challenges.\n\nIn his weekly newsletter, Ramaphosa described the new US tariffs as a stark reminder of the urgent need to adapt to increasingly turbulent headwinds in international trade.\n\nThe US is South Africas second-largest trading partner by country, and these measures will have a considerable impact on industries that rely heavily on exports to that country and on the workers they employ, as well as on our fiscus, he said.\n\nSectors such as agriculture, automotive and textiles have historically benefited from duty-free access to the US market under the African Growth and Opportunity Act (AGOA), which now faces disruption.\n\nRamaphosa said that South Africas trade relationship with the US has historically been complementary, saying local exports do not compete with US producers and do not pose a threat to US industry.\n\nLargely, our exports are inputs into US industries and therefore support the United States industrial base, he said.\n\nSouth Africa is also the biggest investor from the African continent into the US, with 22 of our companies investing in a number of sectors including mining, chemicals, pharmaceuticals and the food chain.\n\nThe 30% tariff was recently announced by the Trump administration and will take effect on 7 August.\n\nSouth Africa is the only country in sub-Saharan Africa singled out for the steep tariff, reflecting deteriorating relations between Pretoria and Washington.\n\nOther African countries, such as Lesotho and Zimbabwe, will face a 15% tariff from the same date.\n\nThe announcement is a significant blow to South Africas economy, particularly as the government had been working to strengthen trade ties with the US.\n\nThis included deals on liquefied natural gas imports, easing poultry import regulations and investments in US industries.\n\nRamaphosa defended South African imports, arguing they ultimately benefit US consumers through greater variety and lower costs.\n\nFor example, citrus production is counter-seasonal and does not pose a threat to US production, he said.\n\nFurthermore, production by US companies has been on the decline due to low yields, citrus greening disease and other factors unrelated to competition from imports.\n\nSouth Africa, the worlds second-largest citrus exporter, has helped to stabilise supply and prices in the US market.\n\nWe have been engaging the United States to enhance mutually beneficial trade and investment relations. All channels of communication remain open, said Ramaphosa.\n\nOur foremost priority is protecting our export industries.\n\nHe said the government would continue to engage with US officials while also accelerating efforts to diversify export markets, particularly within Africa.\n\nWith a view to helping our producers and exporters aggressively explore alternative markets, we have established an Export Support Desk to assist affected producers, he said.\n\nRamaphosa added that details of a support package for companies, producers and workers impacted by the tariffs would be announced soon.\n\nHe said the intervention would also assist industries seeking to expand into regions such as the rest of Africa, Asia, the Middle East and other existing trade agreement markets.\n\nStrengthening regional value chains will be key to building resilience for our export markets in the longer term, he said.\n\nMuch as strengthening and establishing alternative value chains will take time, this moment presents us with an opportunity to push forward with the implementation and expansion of the African Continental Free Trade Area (AfCFTA).\n\nRamaphosa stressed the need to reduce South Africas dependence on specific export markets, calling it a strategic imperative to build economic resilience.\n\nIn the coming months, we will be scaling up our trade missions into new markets in Africa and beyond, as well as the National Exporter Development Programme, whose aim is to grow the pool of export-ready companies, he said.\n\nTrump has opposed several South African policies, including land expropriation, which he controversially claimed allowed land to be taken from white farmers.\n\nThe Presidency has firmly denied such claims,including that one of genocide on white farmers.\n\nRamaphosa met with Trump in May in a bid to mend relations, but no progress was made as things had gone worse.\n\nDespite growing tensions, Ramaphosa insisted that South Africa is not alone in facinghigh tariffs.\n\nA number of export-reliant developed and developing economies, including several on the continent, are also grappling with these measures, he said.\n\nThe international trading system is changing. Complacency will not serve us, and building resilience is imperative.\n\nMeanwhile, the Minister of Departments of Trade, Industry and Competition Parks Tau and Minister of International Relations and Cooperation Ronald Lamola will be having a joint press briefing on Monday morning to address the issue of high tariffs.\n\nThe briefing will take place at 10 a.m. at the Germiston Civic Centre, in Ekurhuleni.\n\nMeanwhile on Saturday,ANC NEC member Dr Kgosientsho Ramokgopatold journalists there had been a spirited and robust discussion on the US tariffs.\n\nHe said negotiations between the US and South Africa were ongoing, and expressed confidence that the two nations would be able to find each other.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/02032135/Cyril-Ramaphosa.png",
            "description": "<p>IOL President Cyril Ramaphosa has conceded that South Africa is grappling with the United States’ decision to impose a 30% tariff on local imports, but insists the country is not alone in facing mounting global trade challenges. In his weekly newsletter, Ramaphosa described the new US tariffs as a stark reminder of the urgent need to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-admits-sa-is-reeling-from-us-tariffs-but-insists-it-is-not-alone/\">Ramaphosa admits SA is reeling from US tariffs, but insists it is not alone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:37",
            "date": "05 Aug 2025"
        }
    ]
}