{
    "news": [
        {
            "title": "Dairibord milk intake surpasses 20 million litres",
            "url": "https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/",
            "content": "By Alois Vinga\n\nListed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges.\n\nPresenting the companys half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3 million litres, which accounts for 38% of national production.\n\nThe milk supply development unit continues to recruit new producers, including small and medium-scale farmers, to meet growing demand. The group achieved an 18% growth in overall sales volume, with food sales up 18%, driven by strong yoghurt and tomato sauce sales, Chiromo said.\n\nNational raw milk production also increased by 3.9% year-on-year, from 55.1 million litres to 57.3 million litres.\n\nDZLs beverages segment surged by 28%, buoyed by exceptional performances from Pfuko and Cascade, alongside a recovery in tea due to improved availability. Liquid milk volumes posted modest growth of 1%.\n\nAs of 30 June 2025, DZL reported total assets of US$53.84 million, compared to US$53.49 million in December 2024, while total liabilities stood at US$27.67 million, down from US$28.54 million in the previous period.\n\nEquity attributable to ordinary shareholders rose to US$26.16 million, up from US$24.95 million.\n\nRevenue for the period reached US$64.32 million, an 18% increase compared to the same period in 2024. Profit before tax jumped 51% year-on-year to US$2.08 million, boosted by lower finance costs. Basic and diluted earnings per share stood at US$0.34 cents.\n\nRetained earnings climbed to US$16.28 million, from US$15.07 million as of December 2024, largely driven by profit growth. No dividend was declared for the period.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/22172046/Dairibord.jpg",
            "description": "<p>By Alois Vinga Listed food and dairy products manufacturer Dairibord Zimbabwe Limited (DZL) has surpassed the 20-million-litre mark in milk intake, driven by aggressive management strategies that continue to defy industry challenges. Presenting the company’s half-year performance, DZL board chairman Norbert Chiromo said milk intake grew by 3.7%, rising from 19.6 million litres to 20.3</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dairibord-milk-intake-surpasses-20-million-litres/\">Dairibord milk intake surpasses 20 million litres</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "24 Sep 2025"
        },
        {
            "title": "Developer Felix Munyaradzi loses legal battle in Sandton property dispute",
            "url": "https://www.newzimbabwe.com/developer-felix-munyaradzi-loses-legal-battle-in-sandton-property-dispute/",
            "content": "By Mary Taruvinga\n\nThe High Court has ruled in favour of Harare resident Cephas Tapiwa Muneri, declaring him the rightful holder of rights and interests in a contested Haydon Park stand, after a protracted legal battle with Delatfin Civil Engineering and controversial land developer Felix Munyaradzi.\n\nIn a judgment delivered on September 8, Justice Siyabona Musithu declared that Muneri is the lawful owner of Stand 1650, Haydon Park, Sandton, measuring 1,097 square metres, and blocked attempts by Munyaradzis firm to repossess the property.\n\nThe applicant is hereby declared the lawful holder of rights and interests in Stand Number 1650 Haydon Park, Sandton, ruled Justice Musithu. The attempt by the first and second respondents to repossess the stand from the applicant is hereby declared unlawful.\n\nMuneri bought the property in 2017 through Rawson Properties, later formalising the deal directly with Delatfin Civil Engineering, represented by Munyaradzi. He paid all fees, including a US$650 regularisation charge to Zvimba Rural District Council, and had been living at the property since 2017.\n\nBut in December 2024, Muneri was shocked to see a public notice threatening repossession unless he paid for the land again, this time at US$55 per square metre.\n\nDelatfin argued it had never received the original purchase price, claiming the money was misappropriated by rogue employees, including convicted fraudster Saymore Mutakura.\n\nMuneri insisted he had done his due diligence and dealt directly with Munyaradzi, who personally signed off on the agreements. He accused the company of trying to extort him, telling the court: The alleged fraud was an internal matter to be resolved between the first respondent and its employee. I cannot be made to pay for the property twice.\n\nJustice Musithu rejected Delatfins defence, noting that Munyaradzi had signed the agreements himself and never moved to invalidate them.\n\nMerely denying their legality in an opposing affidavit did not have the desired effect of nullifying them, the judge said. The first respondents arguments were ill-conceived for as long as no attempt was made to have the agreements declared null and void.\n\nThe court found Muneri had demonstrated a direct and substantial interest in the property, and that his rights were under threat from what it described as unlawful attempts to repossess.\n\nThe High Court ordered Zvimba Rural District Council to officially register Muneri as the lawful rights holder, and directed Delatfin to pay his legal costs.\n\nThe ruling is the latest twist in Zimbabwes long-running land disputes involving private developers and residents who often face double allocations, fraudulent sales, or threats of repossession years after purchase.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has ruled in favour of Harare resident Cephas Tapiwa Muneri, declaring him the rightful holder of rights and interests in a contested Haydon Park stand, after a protracted legal battle with Delatfin Civil Engineering and controversial land developer Felix Munyaradzi. In a judgment delivered on September 8, Justice Siyabona</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/developer-felix-munyaradzi-loses-legal-battle-in-sandton-property-dispute/\">Developer Felix Munyaradzi loses legal battle in Sandton property dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "24 Sep 2025"
        },
        {
            "title": "Zimbabwe to roll out breakthrough HIV prevention drug",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-roll-out-breakthrough-hiv-prevention-drug/",
            "content": "CAJ News\n\nZIMBABWE has been selected as one of only ten countries globally to roll out lenacapavir, a groundbreaking HIV prevention drug that could transform the fight against the epidemic.\n\nThe announcement was made by the United States Embassy in Harare, which hailed the development as a major step toward ending new HIV infections in the country.\n\nZimbabwes selection for the introduction of lenacapavir marks a historic milestone in our collective fight against HIV, the Embassy said.\n\nThis is American leadership at its best: driving innovation and building a world where children, mothers, and communities can thrive.\n\nDeveloped by U.S.-based Gilead Sciences in partnership with the Global Fund, lenacapavir is the first twice-yearly injectable medicine designed to prevent HIV infection.\n\nLarge-scale clinical trials have shown that more than 99 percent of people on the drug remained HIV-negative.\n\nHealth experts note that the medicine could significantly reduce new infections, particularly among vulnerable groups.\n\nThe U.S. Embassy highlighted its focus on pregnant and breastfeeding women, ensuring protection for both mothers and the next generation.\n\nThis is more than medicine, the Embassy added. It represents a pathway to a safer, stronger, and healthier future for Zimbabwe.\n\nThe rollout is also expected to strengthen the countrys health systems, making prevention more affordable and accessible.\n\nWith nearly 1.3 million people living with HIV in Zimbabwe, according to UNAIDS, the introduction of lenacapavir could accelerate progress toward achieving the global target of ending AIDS as a public health threat by 2030.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24054913/lenacapavir.jpeg",
            "description": "<p>CAJ News ZIMBABWE has been selected as one of only ten countries globally to roll out lenacapavir, a groundbreaking HIV prevention drug that could transform the fight against the epidemic. The announcement was made by the United States Embassy in Harare, which hailed the development as a major step toward ending new HIV infections in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-roll-out-breakthrough-hiv-prevention-drug/\">Zimbabwe to roll out breakthrough HIV prevention drug</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "24 Sep 2025"
        },
        {
            "title": "Bank staffer, security guard steal US$58,000 from National Building Society",
            "url": "https://www.newzimbabwe.com/bank-staffer-security-guard-steal-us58000-from-national-building-society/",
            "content": "By Staff Reporter\n\nA BANK teller and a security guard have appeared at the Harare Magistrates Court facing charges of stealing US$58,417 from the National Building Society (NBS).\n\nThe duo of Smith Mativenga Chigwagwa (45), who is employed by the bank as a cash deposit teller, allegedly connived to commit theft with Stalin Rundora (30), who is employed by Atharvan Investments (Pvt) Limited as a security guard responsible for collecting cash.\n\nCourt heard that between September 5 and 10, 2025, the two, in pursuance of their plan, withdrew cash amounting to US$58,417 from Atharvan Investments NBS account and converted part of it to their personal use.\n\nIt was further heard that an alert security manager at the bank, identified as Michael Smoko, observed anomalies in the transaction and checked with the company, which confirmed it had not received any cash.\n\nThe matter was then reported to police and on September 21, 2025, detectives from the Criminal Investigations Department (CID) Commercial Crimes Division in Harare conducted a probe, which prompted Chigwagwa to surrender US$51,420 to the bank.\n\nThe accused persons were subsequently arrested and of the stolen cash, US$6,997 was not recovered.\n\nAccused persons were remanded in custody until October 23, 2025 for trial.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/24050559/nbs_bank.jpg",
            "description": "<p>By Staff Reporter A BANK teller and a security guard have appeared at the Harare Magistrates Court facing charges of stealing US$58,417 from the National Building Society (NBS). The duo of Smith Mativenga Chigwagwa (45), who is employed by the bank as a cash deposit teller, allegedly connived to commit theft with Stalin Rundora (30),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bank-staffer-security-guard-steal-us58000-from-national-building-society/\">Bank staffer, security guard steal US$58,000 from National Building Society </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:36",
            "date": "24 Sep 2025"
        }
    ]
}