{
    "news": [
        {
            "title": "Former Finance deputy minister Chapfika dies in car accident",
            "url": "https://www.newzimbabwe.com/former-finance-deputy-minister-chapfika-dies-in-car-accident/",
            "content": "By Staff Reporter\n\nFormer deputy finance minister and long-serving Zanu PF member David Chapfika has died aged 68.\n\nChapfika diedafter his vehicle veered off a bridge and landed on its roof in a shallow river.\n\nHe served as Deputy Minister of Finance under the late President Robert Mugabes administration.\n\nHe also served as a legislator for Mutoko South and chairperson of the Parliamentary Portfolio Committee on Finance and Economic Development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19133559/chapfika.jpeg",
            "description": "<p>By Staff Reporter Former deputy finance minister and long-serving Zanu PF member David Chapfika has died aged 68. Chapfika died after his vehicle veered off a bridge and landed on its roof in a shallow river. He served as Deputy Minister of Finance under the late President Robert Mugabe’s administration. He also served as a legislator</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-finance-deputy-minister-chapfika-dies-in-car-accident/\">Former Finance deputy minister Chapfika dies in car accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "19 Jun 2025"
        },
        {
            "title": "IMF says Zimbabwe’s economy has made ‘significant progress’",
            "url": "https://www.newzimbabwe.com/imf-says-zimbabwes-economy-has-made-significant-progress/",
            "content": "Bloomberg\n\nThe International Monetary Fund said Zimbabwes economic progress represents a regime change, but declined to say if or when the Washington-based lender would grant it a staff-monitored program.\n\nWojciech Maliszewski, who is visiting the southern African nation to conduct a regular IMF economic health update, said the conduct of the Reserve Bank of Zimbabwe, which has vowed to halt printing money to finance the government, was particularly impressive.\n\nThe RBZ, holding liquidity positions tight, not providing monetary financing to the government. I think this is a regime shift, he told Bloomberg on Wednesday in the capital, Harare.\n\nStill, he declined to be drawn on whether the IMF would accede to Zimbabwes request for a SMP. The informal process could lift confidence in the country and provide a stepping stone to restructuring a $21 billion debt pile thats kept it locked out of global financial markets since it defaulted in 1999.\n\nWhat is most important for us at this stage is to make sure that when authorities enter the program, they will exit a successfully completed program, he said. This requires a lot of effort, a lot time from both us and the authorities on the other side.\n\nZimbabwe, which has asked neighbouring South Africa for help in getting its debt reworked under the Group of 20 Common Framework, is trying to revive an economy wracked by years of mismanagement thats stoked hyperinflation and currency collapse.\n\nIt unveiled the gold-backed ZiG last year  its sixth attempt at creating a functioning local unit  and Maliszewski, the IMF Mission Chief for Zimbabwe since 2023, said establishing it as a fully-fledged currency would be welcome.\n\nLooking at the current macroeconomic situation comparing it to what the country was when I started my assignment and before, its massive progress, significant progress, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/01073531/harare.png",
            "description": "<p>Bloomberg The International Monetary Fund said Zimbabwe’s economic progress represents a “regime change,” but declined to say if or when the Washington-based lender would grant it a staff-monitored program. Wojciech Maliszewski, who is visiting the southern African nation to conduct a regular IMF economic health update, said the conduct of the Reserve Bank of Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-says-zimbabwes-economy-has-made-significant-progress/\">IMF says Zimbabwe’s economy has made ‘significant progress’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "19 Jun 2025"
        },
        {
            "title": "Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak",
            "url": "https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/",
            "content": "By Staff Reporter\n\nThe government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan.\n\nThis Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna Resort in Harare, marking the start of a process to craft the countrys five-year economic blueprint 2026-2030.\n\nThe indaba drew participants from industry and commerce, farmers organisations, the clergy, civil society and academia.\n\nSpeaking on the sidelines of the event, Minister of Finance, Economic Development and Investment Promotion, Mthuli Ncube, said a draft of NDS 2 should be ready by October.\n\nThe NDS 2 will be a successor to NDS 1. We have appointed consultants to do an evaluation of NDS 1 and their observations will serve as the base for NDS 2, which will be crafted following wide consultations, at the provincial and district levels. We should have a draft ready by October, said Ncube.\n\nAlthough Ncube emphasised that as NDS 1 approaches its end in December 2025, Zimbabwe remains solidly on track to attain an upper-middle-income society status, poverty and unemployment remain widespread among the general populace. The nation is reeling from a liquidity crunch amid a faltering Zimbabwe Gold (ZiG) currency.\n\nNcube said NDS 2 will serve as the crucial five-year plan to leapfrog the country towards the ambitious Vision 2030, by which Zimbabwe will attain upper-middle-class society status.\n\nNcube said chairpersons of 10 national priorities that will underpin the strategy were hitting the ground running to contribute to the national document.\n\nThe final document is expected to be tabled by November 2025, ahead of the National Budget presentation. Thereafter, it will be officially launched by the President.\n\nFollowing NDS 2s launch, Ncube said there will be public awareness campaigns by amplifiers to extensively disseminate its contents so that there is buy-in for the important national blueprint.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Staff Reporter The government has laid the foundation for the second phase of its economic recovery and growth roadmap under the banner of the National Development Strategy (NDS 2), a successor of the first phase of the ambitious plan. This Wednesday, the government presented the NDS 2 Roadmap and National Priorities at the Manna</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-crafts-national-development-strategy-2-as-economic-outlook-remains-bleak/\">Zimbabwe crafts National Development Strategy 2 as economic outlook remains bleak</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "19 Jun 2025"
        },
        {
            "title": "US resumes student visas but orders enhanced social media vetting",
            "url": "https://www.newzimbabwe.com/us-resumes-student-visas-but-orders-enhanced-social-media-vetting/",
            "content": "The US State Department says it will resume scheduling appointments for international student visas, but will ask all applicants to make their social media accounts public for enhanced screening.\n\nOfficials have been instructed to expand social media vetting of applicants and search for any indications of hostility toward the citizens, culture, government, institutions, or founding principles of the United States.\n\nThe Trump administration had halted the scheduling of student visa appointments in late May as it prepared to step up measures to restrict applicants deemed hostile to the US.\n\nThe guidelines will impact all applicants who apply for F visas, which are primarily used by students.\n\nApplicants for the M visas, used for vocational students, and the J visas, used by exchange students, will also be impacted, a State Department spokesperson said.\n\nThose who keep their social media accounts private may be deemed as trying to hide their activity, the department added.\n\nIt is an expectation from American citizens that their government will make every effort to make our country safer, and that is exactly what the Trump Administration is doing every single day, a senior State Department official said.\n\nOfficers have also been instructed to screen for those who advocate for, aid, or support designated foreign terrorists and other threats to national security; or who perpetrate unlawful anti-Semitic harassment or violence.\n\nThe move is part of a broader crackdown by the Trump administration against Americas most elite universities.\n\nPresident Donald Trump has deemed these institutions too left-wing, and has accused them of failing to combat antisemitism when pro-Palestinian protests have unfolded on campuses.\n\nTrumps crackdown has also included the freezing of hundreds of millions of dollars in funding for universities, as well as moving to deport students or revoking visas for others. Many of those actions have been blocked by US courts.\n\nAmong the institutions scrutinised by the president is Harvard University, which had $2.65bn (1.96bn) in federal grants frozen.\n\nTrump has also tried to revoke Harvards ability to enrol international students, though that move has been temporarily blocked by a federal judge while the matter is being heard in court.\n\nMore than 1.1 million international students from over 210 countries were enrolled in US colleges in the 2023-24 school year, according to Open Doors, an organisation that collects data on foreign students.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19093315/students.webp",
            "description": "<p>BBC The US State Department says it will resume scheduling appointments for international student visas, but will ask all applicants to make their social media accounts public for enhanced screening. Officials have been instructed to expand social media vetting of applicants and search for “any indications of hostility toward the citizens, culture, government, institutions, or</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-resumes-student-visas-but-orders-enhanced-social-media-vetting/\">US resumes student visas but orders enhanced social media vetting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "19 Jun 2025"
        },
        {
            "title": "Cheetahs leave for 2025 Rugby Africa Men’s Sevens Cup",
            "url": "https://www.newzimbabwe.com/cheetahs-leave-for-2025-rugby-africa-mens-sevens-cup/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Senior Mens Sevens Rugby Team, the Cheetahs, left the country on Wednesday morning for Mauritius, where they will compete at the 2025 Rugby Africa Mens Sevens Cup.\n\nScheduled to run from the 21st to the 23rd of June, the 2025 Rugby Africa Mens Sevens Cup will see 12 nations battling for honours.\n\nDrawn in Pool C, Zimbabwe will face hosts Mauritius, Tunisia, and Madagascar in what is expected to be a tightly contested group.\n\nThe other two pools are Pool A which includes Uganda, Kenya, Ivory Coast, and Ghana; Pool B consists of Nigeria, Burkina Faso, Zambia, and South Africa.\n\nCheetahs coach Ricky Paul Chirengende, expressed optimism about the squads potential.\n\nIt has been a long time since we assembled a squad as good as this one.\n\n I told the boys in our last training session that what we may have lost in preparation time, weve more than made up for in the quality of selection.\n\nIm really looking forward to seeing what this group can produce. Like any coach, were flying out to get the big prize. Its going to be toughthis is a heavy pool with quality teams, he said.\n\nThe last time Zimbabwe won the Africa Sevens title was in 2012, and all eyes are on coach Chirengende and the team to restore the lost pride.\n\nA top finish in Mauritius will pave the way to the World Rugby Sevens Challenger Series, with further implications for Olympic qualification.\n\nZimbabwe Cheetahs  2025 Travelling Squad\n\nTechnical Team:\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19093125/cheetahs.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Senior Men’s Sevens Rugby Team, the Cheetahs, left the country on Wednesday morning for Mauritius, where they will compete at the 2025 Rugby Africa Men’s Sevens Cup. Scheduled to run from the 21st to the 23rd of June, the 2025 Rugby Africa Men’s Sevens Cup will see 12 nations battling</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cheetahs-leave-for-2025-rugby-africa-mens-sevens-cup/\">Cheetahs leave for 2025 Rugby Africa Men’s Sevens Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:29",
            "date": "19 Jun 2025"
        }
    ]
}