{
    "news": [
        {
            "title": "Zimbabwe hosts COP15 as leaders eye Victoria Falls wetlands pact",
            "url": "https://www.newzimbabwe.com/zimbabwe-hosts-cop15-as-leaders-eye-victoria-falls-wetlands-pact/",
            "content": "APA News\n\nThe 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands kicked off in Zimbabwes Victoria Falls resort town on Wednesday, drawing delegates from 172 countries.\n\nRunning from 2331 July, COP15 is themed Protecting Wetlands for Our Common Future and is expected to culminate in the adoption of the Victoria Falls Declaration  a landmark commitment to scale up wetland restoration and establish a Global Wetland Restoration Fund.\n\nSpeaking ahead of the meeting on Tuesday night, Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu underscored the urgency of action.\n\nWetland conservation is not just an environmental concern, it is a climate imperative, a hydrological necessity and a development obligation, Ndlovu said.\n\nShe said key initiatives to be launched at COP15 include the Global Wetland Watch platform for real-time monitoring and the African Wetland Observatory Network to support grassroots solutions, as well as the integration of wetlands into national climate and biodiversity frameworks, including Wetland City Accreditation.\n\nConvention on Wetlands Secretary General Musonda Mumba described the moment as historic, marking the second time that the meeting has been hosted on African soil.\n\nThis is not just a meeting of governments  its a platform for science, diplomacy, and community to come together around a common goal: protecting wetlands for our common future, she said.\n\nThe Ramsar Convention, signed in 1971 in Iran, is the worlds only international treaty focused exclusively on wetlands.\n\nIt promotes the wise use of wetlands and has designated over 2,500 Ramsar sites globally.\n\nZimbabwe ratified the convention in 2012 and currently hosts seven Ramsar sites, including Lake Chivero, Mana Pools and Monavale Vlei.\n\nAccording to the Convention Secretariat, the world has lost over 411 million hectares of natural wetlands since 1970, with a financing gap of up to $550 billion threatening restoration efforts.\n\nPresident Emmerson Mnangagwa is expected to formally open the summit later this week.\n\nDelegates will also tour the Kasibo Wetland in Hwange, showcasing Zimbabwes nature-based restoration efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>APA News The 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands kicked off in Zimbabwe’s Victoria Falls resort town on Wednesday, drawing delegates from 172 countries. Running from 23–31 July, COP15 is themed “Protecting Wetlands for Our Common Future” and is expected to culminate in the adoption</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hosts-cop15-as-leaders-eye-victoria-falls-wetlands-pact/\">Zimbabwe hosts COP15 as leaders eye Victoria Falls wetlands pact</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "24 Jul 2025"
        },
        {
            "title": "Tel One beats log leaders Simba Bhora, as FC Platinum close gap",
            "url": "https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/",
            "content": "By Sports Reporter\n\nSimba Bhoras ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium.\n\nThe Wifi Boys two goals came in the second half through Milton Chimedza and Washington Navaya.\n\nSo important was the win for Tel One that it reduced the gap between them and Simba Bhora to 6 points.\n\nTel One is now sitting in position 5 on the log with 37 points, the same as third and fourth place occupiers FC Platinum and Scottland, respectively.\n\nSimba Bhora, however, maintained top spot as second-place occupiers MWOS played a 1-1 at Nyamhunga against ZPC Kariba.\n\nMWOS is now two points behind Simba with 41 points, with 13 games to go.\n\nElsewhere at Mandava Stadium, FC Platinum maintained its unbeaten run with a 2-1 win over bottom-placed Kwekwe United.\n\nThe win was a big boost for FC Platinum, who leapfrogged two teams to go to number 3 with 37 points.\n\nPure Platinum Play remains the only team yet to be beaten this season; at the same time, they have a game in hand against Manica Diamonds.\n\nPSL Wednesday Results\n\nFull-time:\n\nNgezi Platinum 1-0 CAPS United\n\nTelOne 2-0 Simba Bhora\n\nZPC Kariba 1-1 MWOS\n\nFC Platinum 2-1 Kwekwe United\n\nYadah 1-1 Greenfuel\n\nHerentals 1-0 Chicken Inn\n\nThursday Fixture\n\nDynamos vs Manica Diamonds (Rufaro)\n\nBikita Minerals 7 (Gibbo Stadium)\n\nHighlanders vs. Triangle (Barbourfields)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23195657/telone-fc.jpg",
            "description": "<p>By Sports Reporter Simba Bhora’s ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium. The Wifi Boys’ two goals came in the second half through Milton Chimedza and Washington Navaya. So important was the win for Tel One that it reduced the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/\">Tel One beats log leaders Simba Bhora, as FC Platinum close gap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "24 Jul 2025"
        },
        {
            "title": "This celebrity lifestyle kills you – Andy Muridzo announces retirement from music",
            "url": "https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/",
            "content": "By Tapiwa Svondo\n\nCONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album Chakanyuka, citing that the pressures of being a celebrity were taking a toll on him.\n\nChakanyuka will mark the end of Muridzos music career, which has spanned just over a decade and seen him become a household name with hits like Dherira and Chidhafudhunda.\n\nMuridzo took to Facebook, revealing that he felt music was not his true purpose.\n\nIm writing to inform you the family of Muridzo that CHAKANYUKA will be my last album. I never wanted to take music as my career, but one person I believe in most gave me the courage to move forward with my God given talent.\n\nI will forever love my fans and family, but after this forthcoming album, I will no longer take music as my career again: rather as using my talent and fame to journey into my true purpose, which is healing people spiritually.\n\nIm tired of this celebrity lifestyle; It kills you within. I tried being brave while being insulted by everyone, including people you call your own, he wrote.\n\nBaba Keketso who is not new to controversy, has once in a while, found himself receiving backlash for his love scandals.\n\nI sing from the bottom of my heart just to make you happy and well entertained, but when I try Im insulted and given names which dont suit me.\n\nI know a lot of my fans will not be happy to hear this, but I am tired of trying to prove myself to a nation that never appreciates.\n\nI love music with my life, but here I have become small. I will sing for my kids at home after this album. I think this is not what I was born to do. God help me locate my true purpose, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23185732/andy.jpg",
            "description": "<p>By Tapiwa Svondo CONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album ‘Chakanyuka’, citing that the pressures of being a “celebrity” were taking a toll on him. ‘Chakanyuka’ will mark the end of Muridzo’s music career, which has spanned just over a decade</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/\">This celebrity lifestyle kills you – Andy Muridzo announces retirement from music </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "24 Jul 2025"
        }
    ]
}