{
    "news": [
        {
            "title": "Maswanhise signs new contract to extend stay at Motherwell FC",
            "url": "https://www.newzimbabwe.com/maswanhise-signs-new-contract-to-extend-stay-at-motherwell-fc/",
            "content": "By Sports Reporter\n\nWarriors midfielder Tawanda Maswanise has signed a new contract with Scottish side Motherwell FC.\n\nMaswanhises new commitment will see him staying at the club until 2027.\n\nThe 22-year-old Zimbabwean international joined the side in July last year from Leicester and made an instant impact during 2024-25 season.\n\nWith four goals to his name already this season, Motherwell FC could not wait longer to tie down the Zimbabwean, whom they have given a two-year contract with an option to extend.\n\nSpeaking after signing his contract, Maswanhise said, I have truly enjoyed my time here.\n\nUltimately, I wanted to stay, and signing this deal was a straightforward choice. The fans, players, and staff are all fantastic. Ive felt valued by everyone, which motivates me to keep contributing my best.\n\nI will keep working hard and giving my all for this football club. Its an exciting time.\n\nSince arriving at Motherwell, Maswanhise has made 40 appearances, in the process, he scored 10 goals and provided several assists.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/14164801/tawanda-maswanhise.jpeg",
            "description": "<p>By Sports Reporter Warriors midfielder Tawanda Maswanise has signed a new contract with Scottish side Motherwell FC. Maswanhise’s new commitment will see him staying at the club until 2027. The 22-year-old Zimbabwean international joined the side in July last year from Leicester and made an instant impact during 2024-25 season. With four goals to his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhise-signs-new-contract-to-extend-stay-at-motherwell-fc/\">Maswanhise signs new contract to extend stay at Motherwell FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Malloti in court for insulting Passion Java – granted US$100 bail",
            "url": "https://www.newzimbabwe.com/malloti-in-court-for-insulting-passion-java-granted-us100-bail/",
            "content": "By Mary Taruvinga\n\nA Harare socialite, Malloti, well-known for uttering vulgar words, was Thursday hauled before the court for insulting controversial cleric Passion Java on social media.\n\nMillicent Chimonyo (26), popularly known as Malloti, appeared before Harare Magistrate Tapiwa Kuhudzayi, facing cyberbullying charges.\n\nThe State represented by Nomsa Kangara did not oppose bail.\n\nMalloti was granted $100 bail.\n\nThe State alleged that on May 14 Malloti recorded a video of herself uttering unprintable words regarding Javas involvement in Zim Dancehall music.\n\nIn the video, she accused Java of taking Zim dancehall for granted and as pornography.\n\nThe said utterances by the accused person were in violation of the law, reads the State outline.\n\nAs part of her bail conditions, Malloti was ordered to report to the police once a fortnight until her case is finalised.\n\nShe was also ordered to continue residing at her given address and not to interfere with state witnesses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26150458/malloti.jpg",
            "description": "<p>By Mary Taruvinga A Harare socialite, Malloti, well-known for uttering vulgar words, was Thursday hauled before the court for insulting controversial cleric Passion Java on social media. Millicent Chimonyo (26), popularly known as Malloti, appeared before Harare Magistrate Tapiwa Kuhudzayi, facing cyberbullying charges. The State represented by Nomsa Kangara did not oppose bail. Malloti was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malloti-in-court-for-insulting-passion-java-granted-us100-bail/\">Malloti in court for insulting Passion Java – granted US$100 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Constitutional Court trashes application by CUT lecturer challenging dismissal",
            "url": "https://www.newzimbabwe.com/constitutional-court-trashes-application-by-cut-lecturer-challenging-dismissal/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court of Zimbabwe has dismissed an application by former Chinhoyi University of Technology lecturer Godfrey Mugari, who sought a declaratory order stating that his dismissal was unconstitutional and that he had been denied his right to a fair hearing.\n\nDelivering the judgment, Justice Hlatshwayo, sitting with two other judges, found that Mugari had effectively waived his right to defend himself during the disciplinary proceedings that ultimately led to his dismissal.\n\nIn his application, Mugari claimed that he was denied the opportunity to contest charges of absenteeism and unauthorised release of confidential information while he was suspended and studying in China.\n\nHe argued that his circumstances had prevented him from attending the hearing, claiming, My departure to China did not waive my right to be heard or to challenge the proceedings before the disciplinary authority.\n\nHowever, the court ruled that Mugaris absence was a direct result of his own actions, as he had chosen to leave the country without the universitys authorisation.\n\nAn employee who has been suspended has the obligation to avail himself for work when called upon to do so It is of no consequence that no provision in that regard is contained in the contract of service.\n\nThe court acknowledged that Mugari had the right to legal representation but noted that his counsel had left the proceedings after indicating he had no further instructions from the client.\n\nThe legal practitioner voluntarily excused himself The consequences are the same, further asserting that this choice, effectively coupled with Mugaris departure, led to the waiver of his right to be heard.\n\nThe court referenced previous cases to support its decision, stating, The right to be heard is not an absolute immutable rule of law. It can be waived or forfeited where the beneficiary is at fault.\n\nIn dismissing the application, the judges acknowledged the importance of maintaining the integrity of the disciplinary process, warning against setting a precedent that would allow employees to sidestep disciplinary consequences.\n\nIf participants were allowed to pull out of these processes without consequence and subsequently seek a review the whole labour dispute resolution mechanism would face certain collapse, the judgment read.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/06070859/CUT-1-1.png",
            "description": "<p>By Mary Taruvinga The Constitutional Court of Zimbabwe has dismissed an application by former Chinhoyi University of Technology lecturer Godfrey Mugari, who sought a declaratory order stating that his dismissal was unconstitutional and that he had been denied his right to a fair hearing. Delivering the judgment, Justice Hlatshwayo, sitting with two other judges, found</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/constitutional-court-trashes-application-by-cut-lecturer-challenging-dismissal/\">Constitutional Court trashes application by CUT lecturer challenging dismissal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Two prison officers, five others arrested for robbery spree — court hears gang posed as searching for fugitive Geza",
            "url": "https://www.newzimbabwe.com/two-prison-officers-five-others-arrested-for-robbery-spree-court-hears-gang-posed-as-searching-for-fugitive-geza/",
            "content": "By Staff Reporter\n\nTWO rogue Zimbabwe Prisons and Correctional Services (ZPCS) wardens have been arrested alongside five accomplices following a spate of armed robberies in Chinhoyi.\n\nThe ZPCS pair of Tawanda Marumahoko (37) and Christopher Gomwe (43) was nabbed together with co-accuseds, namely, Shingirirai Chipuve (26), Elias Makasi (52), Abel Mangoma (24), Maxwell Karavhina (42) and Enoch Hwenjere (age not given).\n\nThe seven have since appeared at the Chinhoyi Magistrates Court, facing multiple counts of robbery and were remanded in custody.\n\nIn one of the gangs dramatic heists, on June 30, 2025, accused persons clad in police uniforms and armed with two rifles, proceeded to the complainant Sithabisiwe Sibandas house in Mzari Extension, Chinhoyi.\n\nUpon arrival, they introduced themselves as a joint team of police officers and Central Intelligence Organisation (CIO) operatives on a mission to locate fugitive former Zanu PF Central Committee member Blessed Bombshell Runesu Geza wanted for undermining the Office of the President and inciting violence.\n\nIt was heard in court that the gang interviewed the complainant and other occupants of the house, including Belinda Tira, accusing them of harbouring Geza. They threatened to shoot the complainants dead before tying their hands using cable ties and ransacking the house.\n\nThe gang proceeded to the main bedroom and stole US$28,000 before driving off in a blue pick-up motor vehicle.\n\nIn another count, accused persons manhandled complainant and struck him once with a bolt cutter and several times with a machete. They forcibly took his Huawei P40 cellphone before ransacking the house and stole US$132,000 cash.\n\nAccording to records, the gang also pounced on several premises around the Golf Course area in Mzari suburb, where they broke into houses before ransacking them, stealing valuables including cellphones, laptops and cash.\n\nOn July 22, 2025, during wee hours, the gang, armed with machetes and bolt cutter, pounced on properties belonging to complainants, Charles Mukarimani, Charles Jimu, Innocent Tarwira and Brighton Kajengo and stole cellphones and cash.\n\nFollowing the gangs arrest, a Honda Vezel, a Toyota Mark X, a Toyota Quantum and a residential stand in Mshumavale in Kadoma bought from the proceeds of the crimes were recovered.\n\nThe matter was remanded to August 25 for routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter TWO rogue Zimbabwe Prisons and Correctional Services (ZPCS) wardens have been arrested alongside five accomplices following a spate of armed robberies in Chinhoyi. The ZPCS pair of Tawanda Marumahoko (37) and Christopher Gomwe (43) was nabbed together with co-accuseds, namely, Shingirirai Chipuve (26), Elias Makasi (52), Abel Mangoma (24), Maxwell Karavhina (42)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-prison-officers-five-others-arrested-for-robbery-spree-court-hears-gang-posed-as-searching-for-fugitive-geza/\">Two prison officers, five others arrested for robbery spree — court hears gang posed as searching for fugitive Geza</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Why Zimbabweans rue plan to ditch US dollar?",
            "url": "https://www.newzimbabwe.com/why-zimbabweans-rue-plan-to-ditch-us-dollar/",
            "content": "The East African\n\nZimbabwes plans to drop the US dollar in five years is already causing jitters in an economy that has suffered nearly two decades of currency volatility and bouts of record hyperinflation.\n\nHarare has set 2030 as the target to stop using the US dollar, which has been the dominant foreign currency for the past 16 years, after it was forced to abandon its own.\n\nZimbabwe first announced on August 6, 2024 that its Cabinet had approved a roadmap to adopt the Zimbabwe Gold (ZiG) as the sole currency. The gold-backed ZiG was launched last year, the countrys sixth attempt at mooting a stable currency in 25 years.\n\nThe central bank concedes that businesses are nervous about the plan to return to a mono-currency regime, so much that banks are now avoiding long-term lending beyond that date.\n\nJohn Mushayavanhu, Reserve Bank of Zimbabwe (RBZ) governor, said he would announce a comprehensive de-dollarisation roadmap in November, in what is seen as a desperate attempt to calm nerves.\n\nDr Mushayavanhu said the roadmap would focus on the need to preserve foreign currency accounts and the existing US dollar-denominated contracts, with considerations made to ensure business continuity and certainty.\n\nThe central bank says it is working on modernising the ZiG banknotes with re-designing and producing improved banknotes to increase the acceptance of the new currency.The roadmap will undoubtedly encapsulate the need to maintain the current stability, preserve the foreign currency accounts and existing USD-dominated contracts, Dr Mushayavanhu said as he presented the 2025 mid-term monetary policy statement.\n\nConsideration will always be made to ensure that there is business continuity and certainty.The Confederation of Zimbabwe Industries (CZI), the countrys largest business grouping with membership from the manufacturing, trade, transport, information technology, education and professional services, said the success of the de-dollarisation strategy would hinge on controlling inflation.Low levels of inflation will help build trust in the currency, which might also encourage greater usage of ZiG in transactions, CZI said. This could also boost the likelihood of a gradual de-dollarisation process leading to a ZiG mono-currency regime by 2030. The high annual inflation level creates pricing uncertainty, making it difficult for businesses to set prices, forecast costs or even negotiate contracts.\n\nThe team advised the authorities to urgently introduce measures to increase demand for the ZiG and institute other reforms if the de-dollarisation plan is to succeed.The mission emphasised the need to continue strengthening the monetary and foreign currency market framework in line with IMF staff recommendations, said Wojciech Maliszewski, head of the IMF team.\n\nThis should be complemented by measures to enhance the demand for ZiG in the domestic economy- most notably, increasing the share of Treasurys operations (revenues and expenditures) in ZiG. To reduce any uncertainty weighing on financial intermediation, the authorities should provide more clarity on the implications of the transition plan, including clarifying that the use of a mono-currency will be limited to domestic transactions, allowing for bank deposits to remain dominated in both currencies.\n\nOver a year since the introduction of the ZiG, the country is still heavily reliant on the US dollar, with the central bank indicating that only 40 percent of transactions are in local currency.\n\nEconomic analysts say the new currency is being undermined by the same factors that thwarted previous efforts to re-establish a sole currency. These include a lack of confidence in the banking sector and the local economy, as well as the large scale of the unregulated informal economy, which according to the World Bank is the largest in the world.\n\nJohn Lagat, Imara Asset Management CEO, said the ZiG was destined for extinction just like the other currencies before it because it was being rendered irrelevant by the market.There is so little ZiG around  thanks to the very tight monetary policy  that it is easier simply to use US dollar cash or bank cards. We continue to believe that way too much time and energy is spent on dealing with and discussing the ZiG, despite its limited use, that it would be better simply to scrap it and move on, he said.\n\nHe added that the ZiG was largely used in Harare while in the southern parts of the country people favoured the South African rand.On our recent travels around, it would appear that the South African rand is the favoured currency in the southern parts of Zimbabwe, whilst the US dollar is king further north. Indeed, it is only in the capital Harare that the ZiG is used to any extent. The civil servants continue to receive part of their remuneration in ZiG, which they attempt to spend in the formal shops since the formal economy has no use for it.\n\nAccording to the IMF, only four out of 85 countries that were surveyed during the 1980 to 2001 period succeeded in de-dollarisation, which makes Zimbabwes attempt to return to a mono-currency regime an uphill task.\n\nZimbabwe started facing acute currency problems in 1997 when the local dollar crashed dramatically that year after Robert Mugabes regime paid unbudgeted pensions to former fighters of the countrys liberation struggle.\n\nThe crisis deepened when Zimbabwe sent troops to the Democratic Republic of Congo to protect Laurent Kabilas under siege regime.\n\nA chaotic land reform programme that began in the year 2000 proved to be the final nail on the coffin for the local currency as it led to the countrys international isolation and economic collapse.\n\nBy the time Mugabes government abandoned the Zimbabwe dollar in 2009 when the inflation rate peaked at 79.6 billion percent in mid-November. Hyperinflation only ended after the adoption of the US dollar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>The East African Zimbabwe’s plans to drop the US dollar in five years is already causing jitters in an economy that has suffered nearly two decades of currency volatility and bouts of record hyperinflation. Harare has set 2030 as the target to stop using the US dollar, which has been the dominant foreign currency for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-zimbabweans-rue-plan-to-ditch-us-dollar/\">Why Zimbabweans rue plan to ditch US dollar?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Harare City Council threatens to evict Mbare flats residents",
            "url": "https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/",
            "content": "By Staff Reporter\n\nDESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in.\n\nHarare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted.\n\nIn a notice dated June 18 2025, the director of housing, Addmore Nhekairo gave the residents an ultimatum to settle the arrears the City Council is owed by the residents.\n\nPlease be advised that since you have ignored various reminders and notices to clear the outstanding rental arrears, you are hereby served with a final notice to pay the outstanding amount or vacate the property to avoid continuous prejudice to council.\n\nYou are advised to settle your obligations within 14 days from date of receipt of this final notice. Failure to pay monthly rentals is a serious breach of the agreement of lease which mandates City of Harare to evoke the conditions of lease and recover holding costs from the same.\n\nNotwithstanding the availability or none of the lease agreement, council shall not be prejudiced in its rights to recover holding costs from the lessee for breach of mutual understanding, read the notice.\n\nThe notice comes on the back of Harare City, on the drive to recover money it is being owed by tenants leasing their properties.\n\nHowever, in Mbare, Harare City is under pressure to renovate the flats which are becoming uninhabitable.\n\nLast year, the High Court ordered Harare City Council to renovate the flats to match decent living standards. The City fathers have appealed the judgement.\n\nIn an interview with NewZimbabwe.com, Combined Harare Residents Association (CHRA) director, Ruben Akili, said the deplorable living conditions have dissuaded tenants from paying their rentals.\n\nThese are the same flats which we had a court order for renovations. As you are aware all the flats in Mbare were supposed to be renovated. The situation in Mbare is unacceptable sewer is gushing all over and many things are just happening and many things are happening.\n\nFrom CHRAs perspective is that some residents are paying and some are not paying. Local Authority should address the fundamental problems that speaks to the reasons why residents are not paying, said Akili.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Staff Reporter DESPITE being subjected to living in deplorable conditions, Mbare residents have been put on notice by the Harare City Council over non-payment of rentals of flats they are residing in. Harare City Council has given the Mbare flats residents a 14-day notice to settle rental arrears or risk being evicted. In a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-threatens-to-evict-mbare-flats-residents/\">Harare City Council threatens to evict Mbare flats residents </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Govt seizes over 4,000 units of fake goods, prosecutes 419 businesses in nationwide smuggling crackdown",
            "url": "https://www.newzimbabwe.com/govt-seizes-over-4000-units-of-fake-goods-prosecutes-419-businesses-in-nationwide-smuggling-crackdown/",
            "content": "By Thandiwe Garusa\n\nA total of 3,779 businesses have been inspected nationwide, resulting in 419 prosecutions and the seizure of more than4,000 substandard products, as authorities intensify a crackdown on smuggling and consumer rights violations.\n\nThe Ministry of Industry and Commerce says it has been carrying out surprise inspections on businesses and prosecuting offenders for selling counterfeit goods, underweight products, using multi-tier pricing, and other unfair practices.\n\nRecently, the ministrys officials, together with the Standards Association of Zimbabwe (AZ) conducted a survey which revealed that nearly 50% of groceries being sold from tuck shops and vending stalls are fake and potentially hazardous to health.\n\nIn a statement on Wednesday, the Ministry of Commerce and Industry said over 3,000 businesses have been inspected nationwide and over 400 have been prosecuted in order to protect consumers and promote fair trade.\n\nA nationwide crackdown on smuggling is underway and it involves impromptu inspections on businesses to ensure compliance with regulations.\n\nOffenders who exploit consumers through unfair practices including; selling counterfeit products, delivering underweight goods, imposing multi-tier pricing schemes, and using inadequate labelling, among other deceptive dealings, are being prosecuted.\n\nThe Ministry is pleased to inform the public that to date, a cumulative total of 3779 businesses have been inspected with 419 prosecutions finalised. A total of 402 compliance notices have been issued and 4,816 units of various substandard products were seized, the statement reads.\n\nThe ministry also warned businesses against violating the Consumer Protection Act (2019), which is administered to protect consumers and ensure that businesses adhere to fair and ethical practices.\n\nMeanwhile, due to economic hardships, most citizens buy groceries from tuck shops where they are cheaper compared to supermarkets.\n\nSome of these products are smuggled from neighbouring countries, South Africa and Zambia, while some are being illegally produced locally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26164728/tuckshop.gif",
            "description": "<p>By Thandiwe Garusa A total of 3,779 businesses have been inspected nationwide, resulting in 419 prosecutions and the seizure of more than 4,000 substandard products, as authorities intensify a crackdown on smuggling and consumer rights violations. The Ministry of Industry and Commerce says it has been carrying out surprise inspections on businesses and prosecuting offenders for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-seizes-over-4000-units-of-fake-goods-prosecutes-419-businesses-in-nationwide-smuggling-crackdown/\">Govt seizes over 4,000 units of fake goods, prosecutes 419 businesses in nationwide smuggling crackdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Online and unafraid: LGBTQIA+ Africans push back against colonial-era hate",
            "url": "https://www.newzimbabwe.com/online-and-unafraid-lgbtqia-africans-push-back-against-colonial-era-hate/",
            "content": "The Star\n\nGolden Moyo* is a lay preacher in rural Zimbabwe. In 2018, after decades of hiding his sexual orientation, Moyo came out to his family and friends and his parish as gay.\n\nAttitudes to sexual and gender minorities in Zimbabwe are highly conservative. Those found guilty of consensual same-sex sexual activity could face up to one years imprisonment and a fine. The southern African countrys anti-homosexuality law was first introduced by the British during its colonisation of Zimbabwe.\n\nAccording toHuman Dignity Trust, the country has noted consistent reports of discrimination and violence being committed against LGBTQIA+ people in recent years, including assault, sexual violence, harassment, blackmail, and the denial of basic rights and services.\n\nMoyos decision has not been without consequence. News of his sexuality soon went viral (with)people deliberating upon it, he says. There was alsoaprotest at the churchs headquarters.\n\nSays Moyo: They were saying things like this is against our culture. This is against our religion. This is against our lawsThey say it is strange. It is not part of us and did not originate from our own people. (That) its a Western thing. When the noise started, (with) people protesting, you really need people who stand up to say, No, this thing isnotWestern. Its our own thing. It hasalwaysbeen in our midst.\n\nFor Moyo, as with an increasing number of LGBTQIA+ persons across the country, social media is an essential tool in a continued push for a break from the narrative that homosexuality  and queerness, more broadly  is a Western import.\n\nMoyos social media accounts on Facebook, Instagram, TikTok and X (formerly, Twitter) has a combined following of just under 10 000 people. He also uses Clubhouse for the (weekly) LGBTQIA+ fellowship.\n\nMoyo says he first realised the power of social media during the Covid-19 pandemic. We could not gather as Christians, so we used to worship via social media. I realised that this is a thing that can quickly spread the message to othersI thought of it as a way that my voice can also be heard.\n\nTanatswa Gumbo, communications officer for the countrys largest queer rights organisation, Gays and Lesbians of Zimbabwe, says LGBTQIA+ people definitely have become more visible on social media. Image: Supplied\n\nTanatswa Gumbo, communications officer for the countrys largest queer rights organisation,Gays and Lesbians of Zimbabwe (GALZ), says LGBTQIA+ people definitely have become more visible on social media.\n\nLGBTQIA+ persons, particularly activists, have really been visible and have really become more outspoken in terms of challenging conservative attitudes towards LGBTQIA+ people. Especially the claims of homosexuality being un-African; not being Christian, says Gumbo.\n\nResearch conducted by Princess Sibanda and Gibson Ncubefoundthat, for queer Zimbabweans, online spaces represent a powerful act of resistance, a way for queer Zimbabweans to claim their right to exist and express themselves.Its like theyre sending love letters to the world, saying that queer love is just as important and beautiful as any other kind of love.\n\nZimbabwe is, of course, only one of numerous African states to have inherited homophobic laws and attitudes as a result of colonisation. The end of colonial rule has, however, seen some countries (such as Uganda, Nigeria, Kenya and Namibia) place added restrictions on the rights of LGBTQIA+ persons.\n\nGhana is one such country. The West African state inherited its first anti-homosexuality law during British rule.Section 104 of the countrys Criminal Code of 1960  seen largely as an after-effect of the colonial era  carries with it a sentence of up to three years imprisonment for men found guilty of consensual same-sex relations.\n\nGhanas latest anti-LGBT law, thePromotion of Proper Human Sexual Rights and Ghanaian Family Values Bill (commonly known as the Anti-LGBT Bill), is particularly draconian and has been described asbrutal, harsh, and unjust.\n\nIn 2021,Angel Maxine, Ghanas only openly transgender musician and queer rights activist, penned a song, titledKill the Bill, in protest against the Anti-LGBT Bill. In addition to using her music as a tool for awareness-raising, Maxine also relies heavily on social media to try and effect change.\n\nIf social media was availableduring the colonial days, Im sure a lot of people would have been educated by now, and we would (not be in) this era that we are in, Maxine says, in reference to the increasing queerphobic rhetoric sweeping across the continent. Because even though some of us are on social media, we are still living in our colonial days; still carrying the colonial thinking. But there are also people who are using social media who have broken free from this colonialism. In Africa, we have made use of social media positively to educate people.\n\nMaxine is nowliving in Berlin, having fled Ghana as a result of persecution based on her gender identity and her queer rights activism. The distance from her home country makes her rely on social media even more.\n\nSometimes when the grounds become very hard and difficult for us to meet in person, social media is where we can meet. I am currently in Germany, but Im communicating with people in Ghana through social media.\n\nAlex Kofi Donkor, the executive director of LGBT Rights Ghana, says LGBTQIA+ Ghanaians are creating social media content that challenges the narrative that queerness is a Western import. Image:Supplied\n\nAlexKofi Donkoris the founder and executive director of LGBT Rights Ghana. I would say most of the mobilisation and most of the engagement at the initial stages (of establishing LGBT Rights Ghana)] was through social media. Even as of now, most of the mobilisation is done via various social media platforms, says Donkor.\n\nAside from activists utilising social media for policy and attitude reforms, there are also individual members of Ghanas LGBTQIA+ communities who, Donkor says, are putting content out there that challenges the status quo and challenges so many thoughts that Ghanaians have around LGBTQIA+ issuesthat its a Western import.\n\nAs could be expected, given the repressive contexts in which this content is created, there are downsides to proudly sharing pro-LGBTQIA+ content.\n\nA recent example of this was when a queer South African undertook the social media campaign, #ShowGhanaLove. Ostensibly meant as a show of solidarity with queer Ghanaians, the campaign had the opposite effect, as anti-queer politicians used the resultant public outrage to add pressure on the Ghanaian government to expedite the passing of theAnti-LGBT Bill.\n\nSays Donkor: People tend to react quickly when (LGBTQIA+ content) is openly or obviously put out there. People tend to react in a very negative way.\n\nGhanaian human rights activist, Angel Maxine, sees social media as an integral tool in raising awareness. Image: Eemmax Experience\n\nAngel Maxine is nonplussed by negative comments. Social media is a safe space for me, even though the comments and all those things arent 100% safe, it is a safe space for me, she says.\n\nSocial media, she adds, resulted in what she sees as her biggest success as an activist: the collaboration with fellow musicians,Wanlov the Kubolor and Sister Deborah, which led to her song,Wo Fie.\n\nWo Fiemeans your home, Maxine explains. We all come from homes, whether (we are) LGBTQIA or not. A queer person could be your brother, could be your sister. So we just have to love, respect and accept queer people for who they are. Religion is not our culture. The Bible is not our culture. The only culture that has been imported to Africa is hate.\n\nAs to whether she says a point at which she might rely less on social media as a tool for her activism, Maxine says firmly: No, no. I dont think I see that happening.\n\nBack in his home in rural Zimbabwe, Moyo echoes the same sentiment.\n\nYou know, he sighs, to get the church to accept us, we have attended the meetings, the synods, the meetings in the archdiocese, the councils, but it was of no useSo, theres no other way, since we have been blocked on top. So, we are saying this is the time to make our voices heardMaybe changes may comeOur people still believe its a Western influence. A taboo in our culture. Yet, we are saying its our own thing. So, we will keep on fighting, no matter how hard it gets.\n\n* Not his real name\n\n* Carl Collison is a journalist, photographer, filmmaker, and researcher. He founded and runsBeyond the Margins, a platform dedicated to producingLGBTQIA+-related content from across Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13155042/Screenshot-2025-08-13-at-16.50.14.png",
            "description": "<p>The Star Golden Moyo* is a lay preacher in rural Zimbabwe. In 2018, after decades of hiding his sexual orientation, Moyo came out to his family and friends and his parish as gay. Attitudes to sexual and gender minorities in Zimbabwe are highly conservative. Those found guilty of consensual same-sex sexual activity could face up</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/online-and-unafraid-lgbtqia-africans-push-back-against-colonial-era-hate/\">Online and unafraid: LGBTQIA+ Africans push back against colonial-era hate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Bishop’s ‘brutal’ marathon challenge raises £35,000 for Zimbabwean education",
            "url": "https://www.newzimbabwe.com/bishops-brutal-marathon-challenge-raises-35000-for-zimbabwean-education/",
            "content": "Church Times\n\nTHEBishop of Kingston, Dr Martin Gainsborough, has completed his mission to run the full 268 miles of the Pennine Way in ten days, accompanied by his border collie, Jem. He has raised more than 35,000 forcharityas a result.\n\nThe bishop and his dog completed the challenge on Sunday, having averaged a marathon a day across some of Englands wildest terrain  from Edale in the Peak District to Kirk Yetholm just over the Scottish border  with an incline of nearly 40,000 feet.\n\nDr Gainsborough said on Tuesday: Running the equivalent of a marathon a day for ten days was pretty brutal as it is wild and mountainous terrain, and it is quite easy to lose the path.\n\nTo say that he enjoyed the experience would be overstating it, he said, but to have made it through without injury was deeply exhilarating. He said: Jem, who was magnificent throughout, is now enjoying a more sedentary pace in Southfields.\n\nThe Bishop set out on 1 August with an initial target of raising 30,000 to improve education in the diocese of Matabeleland, inZimbabwe, with whichSouthwark dioceseis linked.\n\nHe had been inspired by the children and teachers he met on a visit to the region last year, where many children currently walk up to 10km to get to their nearest school  a dangerous journey which means that many, particularly girls, are unable to attend.\n\nMartinGainsborough/Diocese of SouthwarkCamping out on the Pennine Way\n\nThe money raised will help to build new schools like St Cecilias School in Lupane, which is still under construction, but already offers an education to local children.\n\nSupport along the way included a video, on the fifth day, of the Bishop of Matabeleland, the Rt Revd Cleophas Lunga, outside the cathedral with members of the Mothers Union and senior clergy of his diocese, singing heartily of journeying with Jesus.\n\nBishop Lunga said: We are delighted that you are doing a very good, good thing, not only for your spirit and body, but also for us in Matabeleland. The gifts donated would go a long way to improving the lives of the young people in the villages, he said.\n\nOnline donations have since reached 27,000, with a further 8000 donated offline. The total raised currently stands at 35,389, and further donations are welcome.\n\nDr Gainsborough concluded: I have been amazed how my run has captured peoples imagination  reflected in a huge amount of support and prayers, and incredible generosity in fundraising.\n\nTo be able to make a difference to the lives of children in our link diocese of Matabeleland so they no longer have to walk long distances to school means more than I can say and makes all the pain and heartache worth it. Thanks be to God!\n\njustgiving.com/crowdfunding/bishop-martin-kingston\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13154007/bishop.jpeg",
            "description": "<p>Church Times THE Bishop of Kingston, Dr Martin Gainsborough, has completed his mission to run the full 268 miles of the Pennine Way in ten days, accompanied by his border collie, Jem. He has raised more than £35,000 for charity as a result. The bishop and his dog completed the challenge on Sunday, having averaged a marathon a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bishops-brutal-marathon-challenge-raises-35000-for-zimbabwean-education/\">Bishop’s ‘brutal’ marathon challenge raises £35,000 for Zimbabwean education</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        },
        {
            "title": "Fatal road accidents surge over Heroes and Defence Forces holiday – police",
            "url": "https://www.newzimbabwe.com/fatal-road-accidents-surged-during-heroes-holiday-police/",
            "content": "By Mary Taruvinga\n\nRoad carnage worsened over the Heroes and Defence Forces holidays, with fatalities jumping from 16 last year to 24 this year, and fatal crashes rising from eight to 13, according to police statistics.\n\nThe total number of accidents recorded during the period climbed from 149 to 196, with 96 people injured.\n\nPolice spokesperson Commissioner Paul Nyathi said the accidents were mostly caused by reckless driving, speeding, mechanical faults and dangerous overtaking.\n\nAmong the worst incidents was the 11 August MutareMasvingo Road disaster in which six Zion Christian Church congregants were killed and 16 injured when a hired Quantum veered off the road and overturned near the 283km peg. The passengers were travelling from Gokwe to Chimanimani.\n\nA day later, four people died and 17 were injured on the BinduraShamva Road when a Toyota Hiace tyre burst, sending the overloaded vehicle off the road.\n\nOther fatal crashes included a Toyota Hilux overturning on the MasvingoMbalabala Road on 11 August, killing two, and a ChechecheRimai Road tragedy in which a 16-year-old girl died after falling from a moving sand-laden lorry and being run over.\n\nPedestrians were also victims. In Harare, a man was killed on Delport Road in Hatfield on 12 August after being hit by a Toyota Spade, while another was injured on High Glen Road the previous day.\n\nDespite commending public service operators for cooperation during the period, police urged motorists to service vehicles, avoid speeding, and adhere strictly to road rules.\n\nAbove all, drivers should adhere to all road rules and regulations in order to curb the continuous loss of lives through road traffic accidents, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/11080754/accident.jpg",
            "description": "<p>By Mary Taruvinga Road carnage worsened over the Heroes and Defence Forces holidays, with fatalities jumping from 16 last year to 24 this year, and fatal crashes rising from eight to 13, according to police statistics. The total number of accidents recorded during the period climbed from 149 to 196, with 96 people injured. Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fatal-road-accidents-surged-during-heroes-holiday-police/\">Fatal road accidents surge over Heroes and Defence Forces holiday – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:09",
            "date": "14 Aug 2025"
        }
    ]
}