{
    "news": [
        {
            "title": "Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda.\n\nMatatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO), Asher Walter Tapfumaneyi.\n\nTapfumaneyi had been named ZNA Chief of Staff in May.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2 of the Constitution of Zimbabwe as read with sections 7(1) and 8(2 of the Defence Act [Chapter 11:02], promoted Lieutenant Genera Emmanuel Matatu to the rank of General and appointed him Commander of the Zimbabwe Defence Forces with effect from 21 November 2025.\n\nThe appointment follows the retirement of outgoing Commander of the Zimbabwe Defence Forces, General Philip Valerio Sibanda, Rushwaya said\n\nSibanda is expected to take up a role in the ruling Zanu PF politburo.\n\nIn 2023, Mnangagwa briefly appointed him to the partys politburo before reversing the decision following a backlash from civil society. His appointment was scheduled for review at the end of his army tenure.\n\nWith tensions reportedly deepening over Mnangagwas succession, analysts view the elevation of his close allies to key military positions as a move to consolidate and secure his political interests.\n\nThe military played a pivotal role in the 2017 coup that propelled Mnangagwa to power, making control of the security sector crucial in maintaining his hold on the state.\n\nTapfumaneyi was placed under US sanctions in 2024 for his alleged role in disrupting the 2023 general elections through the Forever Association of Zimbabwe (FAZ), which was accused of intimidating voters at polling stations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27184152/matatu.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda. Matatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/\">Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        },
        {
            "title": "Zimbabwe’s dollar stock market closes in on 131-year-old main bourse",
            "url": "https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourses mantle as the southern African nations main trading platform.\n\nThe 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for the 49 stocks trading in the local ZiG currency on theZimbabwe Stock Exchange.\n\nThe gap between the two exchanges is substantial but could narrow quickly in the event of a currency event that impacts on company valuations or if a large firm migrates to the new bourse, according to Lloyd Mlotshwa, head of research at IH Securities.\n\nIf we are looking at purely organic growth, the total value of shares on the VFEX could exceed those on the ZSE within the next 24 months, he said.\n\nTrade in blue-chips, including Delta Corp and Econet Wireless Zimbabwe, is still anchored on the local-currency exchange.\n\nThe two firms, which make up 54% of the ZSEs total market value, may face pressure to migrate to VFEX to better protect shareholder returns, Imara Asset Management Chief Executive Officer Shelton Sibanda said.\n\nThe economy is dollarised with pension funds doing more trading on the VFEX, he said in an interview.\n\nThe VFEX has posted broad gains this year, mirroring rallies across emerging markets on the back of firm commodity prices, a steadier local currency, and renewed confidence, IH Securities said. That contrasts with the ZSE  long a haven for investors during bouts of high inflation  which is slightly lower.\n\nThe VFEX has been the standout performer, with market capitalisation rising over 40% year to date, the Harare-based brokerage said in its latest equity report, attributing the strong performance to gold-linked and consumer-facing stocks.\n\nLiquidity on the VFEX has also improved significantly, the brokerage added. With average daily turnover up 197% from the prior year, reflecting deepening participation by both institutional and retail investors.\n\nThe main exchange in Harare has borne the brunt of a yearlong liquidity squeeze thats been in place since the 43% devaluation of the ZiG, short for Zimbabwe Gold, last September.\n\nTrading on the ZSE has slumped, and IH Securities expects the slowdown will continue to suppress stock market activity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/23081422/zse.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourse’s mantle as the southern African nation’s main trading platform. The 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/\">Zimbabwe’s dollar stock market closes in on 131-year-old main bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        },
        {
            "title": "Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/",
            "content": "FAO\n\nZimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025from 1920 November, a flagship event held duringWorld Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the worlds most pressing public health and development challenges\n\nAMR threatens the effective treatment of infections in humans, animals and plants, impacting health systems, food security, trade and the environment. Zimbabwe has made substantial progress, supported by the Fleming Fund and the AMR Multi-Partner Trust Fund, in improving laboratory capacity, AMR and AMU surveillance, infection prevention and control (IPC), biosecurity in the agrifood sector and behaviour change initiatives across communities\n\nThe conference aims to provide a national platform where evidence can be shared widely, partnerships strengthened, and innovations showcased to improve policy influence and sustainability of ongoing AMR interventions.\n\nOver the two days, participants will engage inscientific presentations, panel discussions, exhibitions and poster sessions, covering themes such as surveillance across One Health sectors, stewardship and governance, digital innovation, community-level solutions and policy pathways. The programme features multisectoral speakers including experts from the Ministry of Health and Child Care, Ministry of Lands and Agriculture, FAO, WHO, BRTI, academia, development partners, civil society and the private sector.\n\nA dedicatedInnovation and Exhibition Pavilionwill showcase laboratory tools, digital platforms, biosafety technologies and solutions developed by research institutes, private companies and implementing partners. Youth engagement will be led by the Generational Stewards for Antimicrobials (GSA), underscoring the critical role of young scientists and advocates in sustaining momentum on AMR response.\n\nThe conference will also profile Zimbabwes progress in implementing thesecond National Action Plan for AMR (20242028)and highlight emerging regional opportunities for collaboration.\n\nEvent organizers, including the Government of Zimbabwe through the One Health Secretariat, FAO, WHO and BRTI, affirm that strengthening multisectoral partnerships is key to safeguarding the effectiveness of antimicrobials and securing the countrys health and food systems for future generations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19043945/AMR.jpg",
            "description": "<p>FAO Zimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025 from 19–20 November, a flagship event held during World Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the world’s most pressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/\">Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        },
        {
            "title": "Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute",
            "url": "https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/",
            "content": "By Staff Reporter\n\nFormer legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility.\n\nMliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused his office by allegedly pressuring the City Council to remove residents who acquired land legally along Airport Road.\n\nHarare City Council were intimidated by the office of the Vice President. He forced them to write letters. Vice President can not be using the church to amass wealth for himself and George Charamba, said Mliswa.\n\nThe outspoken politician further called on the Zimbabwe Anti-Corruption Commission (ZACC) to investigate the City Council over the controversial eviction notices.\n\nHere comes the institutions that fight corruption, ZRP, ZACC, you need to investigate Harare City Council. Why they then wrote letters to displace those people when they are the owners of the land? They gave them the land. Everything was paid for. Over US$2 million was paid for that land, then suddenly you think people must just leave because somebody in a higher office, who is a Vice President says something, said Mliswa.\n\nHarare City Council acting Town Clerk Phakamile Mabena Moyo recently issued a three-month notice for the occupants to vacate the land, citing violation of Section 24 of the Regional, Town and Country Planning Act (Chapter 29:12).\n\nMliswas latest remarks come shortly after he accused Chiwengas wife, Minoyothabo Baloyi, of allegedly running a parallel structure in the Zimbabwe National Army.\n\nCity Council, I am going to report you to ZACC for overturning such decisions. That is fraud. If you have overturn decisions of such nature because of certain powers, you will go to jail like a joke, added Mliswa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/30052903/Chiwenga-680x380-1.webp",
            "description": "<p>By Staff Reporter Former legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility. Mliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/\">Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        },
        {
            "title": "Mutapa Fund mining cluster injects 2.4 tons of gold in nine months",
            "url": "https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/",
            "content": "By Alois Vinga\n\nThe Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions.\n\nAs the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests in opportunities aligned with national development priorities across agriculture, renewable energy, technology, and mining. The Fund derives income primarily through dividends and investment returns, and may selectively pursue third-party funding while maintaining conservative leverage under strict risk and governance frameworks.\n\nAddressing delegates at the Zimbabwe Gold Investment Conference 2025, MIF Deputy Chief Investment Officer Ernest Denhere said the strong performance was driven by investee companies within the mining cluster.\n\nThe Fund has strong presence in the gold space through Kuvimba Mining House (KMH) and Defold Mine, delivering 29% of Large Scale Miners gold to Fidelity between January and September, at 2.4 tons. The Fund recognises that gold currently presents a unique opportunity for value creation and growth in export receipts, he said.\n\nMIF officials noted that precious metals, especially gold, have surged in 2025 as investors seek safe-haven assets amid geopolitical and economic uncertainty. Gold has gained 56% year-to-date, while Zimbabwes gold exports have grown by 71% for the nine months to September 2025.\n\nDenhere said the value of gold exported by September stood at US$3.2 billion, with artisanal and small-scale miners contributing 74% of total gold output.\n\nWith a funding pipeline of at least US$500 million across several gold projects, the Fund is open to exploring different strategies to support the sector and bolster the gold value chain. MIF is a long-term, non-speculative investor focused on providing patient capital to its investors.\n\nThe Funds strategy also includes establishing an exploration fund. With gold as a safe-haven asset with long-term upside, there is strong upside for new discoveries, added Denhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>By Alois Vinga The Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions. As the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/\">Mutapa Fund mining cluster injects 2.4 tons of gold in nine months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        },
        {
            "title": "WestProp’s Hills Luxury Golf Estate transforms Harare West",
            "url": "https://www.newzimbabwe.com/westprops-hills-luxury-golf-estate-transforms-harare-west/",
            "content": "By Staff Reporter\n\nIn the heart of Harare West, once dismissed by skeptics as an unlikely canvas for luxury  a bold vision has taken root. The Hills Luxury Golf Estate is rewriting the rules of real estate, sport, and lifestyle in Zimbabwe.\n\nWhat was once called a project of impossibilities is now the countrys most iconic urban development. The lead developer Ken Sharpe, CEO of Westprop Holdings is upbeat with progress so far.\n\nHe feels the project has all the ingredients of luxury, modernity and the future. Last week he hosted an elite gathering of customers to serenade them with progress so far. The customers felt the vibe and committed to the project.\n\nCritics had scoffed at the idea of a baobab forest thriving in Harare West. They doubted that global attention could be drawn to this corner of the capital. Today, those doubts have been silenced by a living, breathing masterpiece  where ancient trees meet modern luxury, and every detail is curated for excellence.\n\nAt the heart of this transformation is a golf course designed by none other than Peter Matkovich, the current world number one golf architect. His signature blends natural beauty with championship precision, creating a course that is both a sanctuary and a stage for greatness.\n\nThe Hills is not just a place to live  itnis a place to belong. Exclusive features include:\n\nBranded Residences: Architecturally stunning homes with direct access to the golf course.\n\nSpeaking at a recent customer familiarization tour of the project Simukai Whande WestProp Digital Marketing Manager had this to say: This is a rare moment in time. Early investors will benefit from pre-launch pricing, securing premium assets at unmatched value. Once the ceremonial first tee is struck, prices will rise by an average of 40%, reflecting the true worth of this landmark estate.\n\nThe Hills is proof that vision, courage, and excellence can defy geography and expectation. Its a celebration of Zimbabwean pride, global standards, and the power of belief. What was once deemed impossible is now inevitable, and those who act early will own a piece of history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18182919/the-hills.webp",
            "description": "<p>By Staff Reporter In the heart of Harare West, once dismissed by skeptics as an unlikely canvas for luxury – a bold vision has taken root. The Hills Luxury Golf Estate is rewriting the rules of real estate, sport, and lifestyle in Zimbabwe. What was once called “a project of impossibilities” is now the country’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/westprops-hills-luxury-golf-estate-transforms-harare-west/\">WestProp’s Hills Luxury Golf Estate transforms Harare West</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        },
        {
            "title": "PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season",
            "url": "https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/",
            "content": "By Sports Reporter\n\nPremier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign.\n\nThe decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare.\n\nZIFA had initially proposed increasing the number of participating teams from 18 to 20, but PSL clubs went further, opting for a 22-team league next year.\n\nAs a result, all eight teams that were facing relegation this season will survive, while the four regional division champions will be promoted to the topflight, bringing the league to 22 clubs.\n\nIn a statement PSL revealed that the league will be trimmed back to 20 teams in 2027.\n\nThe PSL resolved to suspend relegation for the 2025 season.\n\nThe League will accommodate the newly promoted teams, resulting in an expanded league of twenty-two teams for a transitional period during the 2026 season.\n\nAfter the conclusion of the 2026 season, the League will revert to the proposed twenty team format beginning in the 2027 season, read part of PSL statement.\n\nThe move is meant to help ZIFA adopt a National First Division League which will feed the topflight league.\n\nIn addition, the PSL proposed a phased approach to the implementation of the National First Division League with the possibilities of it being fully operational within the next three years, PSL added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18152309/psl-zim-1-e1763479504235.jpg",
            "description": "<p>By Sports Reporter Premier Soccer League (PSL) clubs have voted against relegating any team this season and resolved to expand the league from 18 to 22 teams for the 2026 campaign. The decision was made on Tuesday during an Emergency General Meeting (EGM) held in Harare. ZIFA had initially proposed increasing the number of participating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-teams-vote-to-scrap-relegation-22-clubs-to-participate-in-2026-season/\">PSL teams vote to scrap relegation, 22 clubs to participate in 2026 season</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "19 Nov 2025"
        }
    ]
}