{
    "news": [
        {
            "title": "Henry Olonga: Zimbabwe legend who made cricket’s bravest stand now sings on cruise ships",
            "url": "https://www.newzimbabwe.com/henry-olonga-zimbabwe-legend-who-made-crickets-bravest-stand-now-sings-on-cruise-ships/",
            "content": "The Telegraph\n\nFormer fast bowler has no regrets despite being exiled from his country after protesting against Robert Mugabe\n\nHenry Olonga recites the lyrics of a song he recorded when he was a Zimbabwean cricketer at the height of his career in the early 2000s and before he was exiled from his country.\n\nOur Zimbabweis a patriotic, idealistic ballad, a love song to his country. It was released at a time of political violence in 2001 as thethuggish Robert Mugabe regimepromoted land grabs and farm invasions.\n\nOne of the lines goes: Though I may go to distant borders, My soul will yearn for this my home, For time and space may separate us, And yet she holds my heart alone. And then another is: As we all stand to build our nation, This our land, our Zimbabwe.\n\nOlonga pauses. Literally some of the words in that song they speak of where my life is now but when I listen to the song again its somewhat triggering.\n\nTwo years after releasing the song he and Andy Flower wore black armbands during the 2003 World Cup to protest at the death of democracy in their country.\n\nOlonga received death threats, was thrown off the team bus and forced to flee Zimbabwe. He has never been back. He has not seen his father, who is now in his mid-80s and still lives in Bulawayo, for more than 20 years.\n\nOur Zimbabwewas a call for Zimbabweans to work together. I try to be a peacemaker, a lot of people think Im the opposite. I dont know why, but if you look at my lyrics, if you look at things Ive done in my life, I think generally, Im trying to inspire people for better outcomes.\n\nIm not just wagging a finger at people and thats what the black armband protest was about; we can be better as a country we can be better as politicians, we can be better as citizens. And I got slaughtered for it.\n\nThis week Olonga will be at Trent Bridge working as a summariser forTest Match Specialduring their coverage of Zimbabwes first Test match in England since 2003, not long after Olongas act of defiance. His voice is deep and sonorous, perfectly audible on a shaky WhatsApp phone line and he will make listeners sit up and take notice this week.\n\nHe is on a European holiday with his family at the moment, taking in the Test match before returning to Australia where he is now settled in Adelaide making ends meet with coaching, commentary and odd jobs as he tries to forge a career as a singer that looked to be taking off when he appeared on the Australian version ofThe Voicein 2019, singingThis is the Momentto pass the blind audition, only to be shut down a year later by the Covid pandemic.\n\nIt was a struggle mate, he recounts. I had this amazing platform, this springboard to then hopefully, you know, go on to record, and it all just came to nothing.\n\nHe now releases music on his YouTube channel and picks up gigs where he can. Recently he was singing on cruise ships. Its not necessarily the peak of music performance being on a cruise ship. In fact, some people think that singers go to die on cruise ships. Its like where you go when you havent made it anywhere else.\n\nBut I dont mind that. I dont have an ego about my music. I sing in little retirement villages, Ive sung to school kids, Ive sung in little bars in front of three people. I just love singing. I love performing.\n\nIve done all sorts of jobs. Ive cleaned peoples boats. Ive done public speaking, as in motivational talks, after-dinner talks. I wont say Im having the time of my life, because I just live a sort of drab, very predictable, boring life in some peoples eyes, but at least its honest, and Im staying out of trouble.\n\nOlonga was the first black Zimbabwean Test cricketer, and also the youngest, when he made his debut aged 18. He played 30 Tests, 50 ODIs as a quick but erratic fast bowler, peaking with five for 70 as Zimbabwe beat India in a Test in Harare (imagine that now).\n\nHe was just 27 when he wore the black armband, a protest that started at Zimbabwes first group game in Bulawayo and continued throughout the tournament. The backlash was vicious. A Zanu PF official called him an uncle Tom and a man with a black skin and white mask.\n\nWhile Flower resettled in England, played county cricket and then coached all over the world, leading England to Ashes victory in Australia in 2010-11, Olongas career was over apart from games for the Lashings World XI and Bishops Lydeard in the West of England Premier League. This was a time before the franchise T20 safety net for players; Olonga had no fallback.\n\nHe says cricket was triggering, even just to commentate. Working as a BBC pundit after a heavy Zimbabwe defeat at Lords in 2003 he was sent nasty messages from Zimbabweans for being too negative.\n\nWhile playing for Lashings in Luton a spectator spent all day shouting the C-word at him until the police were called and when he met the Zimbabwe high commissioner at an event in Australia in 2017  nearly 15 years after his black armband protest  he was cold-shouldered.\n\nIve been accused of being scared. Ive been accused of being a chicken; that I should have stayed in Zimbabwe. The high commissioner pulled me aside. The first thing he said was: Why are you denigrating the government of Zimbabwe? I thought: My gosh, thats a lovely way to say hello.\n\nI tried to be respectful. I excused myself but he was that old-school mentality and thought Id betrayed the country like no one else had ever done. And so the whole cricket, Zimbabwes politics scene was very triggering for me because the perception was that I was a troublemaker. Does that make sense? Imagine a bad divorce and separation. And every time you think about that person, I have a conversation about them, its mostly unpleasant.\n\nHe admits he was perhaps naive to the consequences, the repercussions that would change his life. Im always dealing with the fallout. I daily deal with the idea that some people view me as a guy who couldnt just play the game, he had to bring politics into sport, and that has connotations positive and negative.\n\nIve had some unpleasant conversations, even in recent times, with Zimbabweans online or in person. They just have this beef with me. I try to deal with it gracefully, but there was a real cost attached to it. But that cost doesnt translate to regret. I still stand by what I did. Did it make a tangible difference on the ground to anybody? Probably not.\n\nI was young, I had very strong feelings about what was happening in Zimbabwe with the farm invasions and the political instability, and I had a very small opportunity in a sliver of time to try to make a difference.\n\nI took a stance, and I know that I tried to make a difference. I could have had more time as a cricket player but its hard to quantify taking a moral, conscientious stance against a dictator versus runs and wickets.\n\nOlonga was close to returning when Mugabe, who died in 2019, was overthrown in 2017 but there was no homecoming; he remained in Australia. Its in the too-hard basket. Ive started a new life. I think like a Westerner now. I live in Adelaide where things just work.\n\nOur government invests billions of dollars into infrastructure. Were getting new roads put in, the hospital system is excellent, in spite of the whinging that happens. As an African my jaw is always hitting the floor at how efficient things are.\n\nBut I feel as strongly as I did back then against the forces of corruption in Zimbabwe. If theres any kind of vindication for us it is that Zimbabwe has gone backwards. So many people have left the country looking for opportunities abroad.\n\nIve bumped into so many Zimbabweans overseas all looking for greener pastures, but doing it unwillingly. They all love Zimbabwe. They all loved living there. They would, in a heartbeat, go back if it was stable, or anything resembling the new lives they have, but they cant do it because theres an understanding of the instability of the country.\n\nHe wonders if life would have turned out differently had he accepted a scholarship at the London Academy of Music and Dramatic Arts when he was teenager instead of pursuing a cricket career.\n\nI think I would always have been a better stage performer than I was a cricketer. I would have enjoyed it more and there would have been less failure and disaster. Ive always felt that it would have been a more fulfilling career for me.\n\nOlonga readily admits it is hard to make ends meet from music. His YouTube channel has around 2,000 subscribers and when he tried to crowdfund an album last year he was hit hard by reality.\n\nIm a chronically broke ex-cricketer. I thought the only way I can afford to do this, because it costs, like 200,000 Aussie dollars to record an album, is with crowdfunding.\n\nNo word of a lie, I got nine people investing. I actually thought it was 10. And then I discovered that someone had donated twice. Nine people backed me. That was it. And then I thought: Yikes. OK, Im definitely a has-been now. That dream just fell flat.\n\nIt was a punch to the gut, but it was a wake-up call to make me realise how I was not even registering on anyones minds as worthy of backing. So I just thought: Well, Ill just do it myself. Ill just do it through the YouTube channels with maybe 100 views per video, but as long as I get enough videos up there, maybe thatll lead to more work elsewhere. Ill still get my music out there somehow.\n\nHis voice, speaking not singing (although you cant rule out a duet with Jonathan Agnew on his euphonium), will be heard this week on the airwaves from Trent Bridge and he says he is at peace now with cricket, that life has moved on.\n\nIm 49, Im washed up. Im over the hill. Having said that, I think I now know my instrument. I know which songs work for me. Im an old dude trying to rewind the clock and go back to that fork in the road where I had a choice between music and cricket. Im revisiting that music path and lets see where it ends up.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21192640/olonga.webp",
            "description": "<p>The Telegraph Former fast bowler has no regrets despite being exiled from his country after protesting against Robert Mugabe Henry Olonga recites the lyrics of a song he recorded when he was a Zimbabwean cricketer at the height of his career in the early 2000s and before he was exiled from his country. Our Zimbabwe is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/henry-olonga-zimbabwe-legend-who-made-crickets-bravest-stand-now-sings-on-cruise-ships/\">Henry Olonga: Zimbabwe legend who made cricket’s bravest stand now sings on cruise ships</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "MPs grill Kambamura over delays in tabling Mines and Minerals Amendment Bill, EPOs as foreigners take over sector",
            "url": "https://www.newzimbabwe.com/mps-grill-kambamura-over-delays-in-tabling-mines-and-minerals-amendment-bill-epos-as-foreigners-take-over-sector/",
            "content": "By Anna Chibamu\n\nZANU PF legislators, Wednesday grilled Mines and Mining DevelopmentDeputy Minister Polite Kambamura over delays in the tabling of the Mines and Minerals Amendment Bill in the National Assembly.\n\nThe MP alleged that Zimbabweans rights to mining were being undermined as the bill has been kept out of Parliament for too long.\n\nAs of March 26, 2025, the Bill status reads: Bill proofs transmitted to Attorney Generals Office.\n\nGokwe-Kabuyuni MP Spencer Tshuma said the delays in amending the bill had a negative bearing on how mining rights were awarded to citizens, as foreign nationals have an upper hand, leaving out hungry locals.\n\nDuring the question and answer (Q and A) session,Tshuma alleged thatlocals were also being charged the same fees asforeigners.\n\nLooking at the delays in the Mines and Minerals Amendment Bill to this August House so that it is reviewed, what is government doing to ensure that those who are in mining will be accorded different rights from foreign miners?\n\nWe are noting that at the moment they are treated the same from the monies that they pay during the pegging of mines and even in paying their taxes, and that our local people are given rights as citizens of this nation compared to foreigners.\n\nWe have been anticipating this new law for quite some time, and it has been a long time since the 9th Parliament. What is happening, Madam Speaker, is that mining is going on and our minerals are being exploited whilst we are waiting for the law? Tshuma said.\n\nLegislators have in the past also accused the government of mortgaging minerals to foreigners at the expense of citizens who are languishing in poverty.\n\nFurther, Tshuma demanded an explanation on the delays from the deputy minister.\n\nSo, may the Hon. Minister explain how long it is going to take and the challenges that are preventing the new law from coming to this august House so that it is tabled in Parliament and discussed, instead of foreign companies coming to take all the money? Tshuma said.\n\nMedia reports have shown that Chinese-owned companies are flooding the mining sector, violating Environmental and Mining laws, causing devastating land degradation.\n\nGoromonzi West constituency MP Biata Beatrice Karimatsenga-Nyamupinga on EPOs said: When local people apply so that they get the applications processed, they do not succeed, but foreign miners are found mining in schools and in other protected places or in other gazetted places.\n\nOur locals should be able to go to such places and their applications must also be treated with priority over the foreign applications.\n\nZanu PF Rushinga MP Tendai Nyabani urged the Mines Ministry to follow up on miners as most cheat on the value and type of mineral being mined, thereby paying less royalties to the State.\n\nWill the government make a follow-up to check exactly what the miner is mining for, because sometimes they might peg mining minerals of lesser value, yet they are mining some precious minerals?\n\nKambamura saidthat all raised issues would be looked at in the new bill.\n\nWe are reviewing and are going to be looking at these issues. When someone comes from outside the country to bring investment, they should have a substantial investment.\n\nWe cannot just allow people who come into the mining sector without a significant amount of investment.\n\nWe are going to enact a law that stipulates that foreign investors should give locals opportunities to be employed. We have noticed that most investors bring their workers from their countries, who sometimes do not share the technical expertise with locals, the deputy minister responded.\n\nKambamura assured the legislatorsthat locals are going to be prioritised in the next few months.\n\nWe are going to ensure that small-scale miners or the sector will only be for black local Zimbabweans.\n\nRegarding delays in gazetting of the bill, he explained: In the past few days, we gazetted the Act and some sections were noted that needed editing.\n\nSo, the Attorney Generals Office is reviewing such errors, such mistakes which are going to be corrected then it will be regazetted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/19231053/Deputy-Mines-Minister-Polite-Kambamura.png",
            "description": "<p>By Anna Chibamu ZANU PF legislators, Wednesday grilled Mines and Mining Development Deputy Minister Polite Kambamura over delays in the tabling of the Mines and Minerals Amendment Bill in the National Assembly. The MP alleged that Zimbabweans’ rights to mining were being undermined as the bill has been kept out of Parliament for too long. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mps-grill-kambamura-over-delays-in-tabling-mines-and-minerals-amendment-bill-epos-as-foreigners-take-over-sector/\">MPs grill Kambamura over delays in tabling Mines and Minerals Amendment Bill, EPOs as foreigners take over sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "Govt to allocate 50,000 residential stands to war veterans",
            "url": "https://www.newzimbabwe.com/govt-to-allocate-50000-residential-stands-to-war-veterans/",
            "content": "By Tapiwa Svondo\n\nWar veterans are set to benefit from an initiative which will see the allocation and development of 50,000 residential stands from the government.\n\nThe Ministry of Local Government and Public Works, the Ministry of the Veterans of the Liberation Struggle Affairs, and the CEO of Prevail Private Limited International, Paul Tungwarara, who is set to develop the land, signed a tripartite agreement on Tuesday.\n\nLocal government minister Daniel Garwe said this program will cover all ten provinces in Zimbabwe.\n\nAs we may be aware that section 23 of the Constitution of Zimbabwe has provisions for looking after war veterans in terms of quarter system that 20 percent of the developments taking place in the country in various economic spheres must be set aside for war veterans.\n\nAs the Ministry of local government, we are here to honor that provision in the constitution by today signing a Memorandum of Agreement, between the ministry of local government and public works, the ministry of war veterans affairs and our developer for the construction to completion of developments for stands for war veterans throughout our 10 provinces, said Garwe.\n\nThe Minister of War Veterans, Monica Mavhunga said 50,000 war veterans are set to benefit during the first phase.\n\nThe first phase is to benefit about 50,000 war veterans which is a substantial number and as a ministry responsible for the identification and the final allocation of these stands we are going to do this transparently and we promise everyone in this country that we are not going to be found on the side of those who are corrupt, it mean we are going to do our work transparently, she said.\n\nGarwe said his ministry will ensure that suitable land is identified and no issues will arise in the future, which will result in demolitions.\n\nAdded Garwe, What we are going to do as the Ministry of local government and public works is to identify suitable land where we will then invite the developer to come and provide the road network, water and sewer reticulation and other services that fall under the first line of services.\n\nWe are the Ministry responsible of ensuring that we follow the law in terms of providing developed pieces of land for housing purposes. We will not witness a situation where the developer will be allocated a wetland as a piece of land for this program, it is not happening and we are the Ministry responsible for ensuring that the urban councils act is being respected by anyone including ourselves.\n\nSo there is no way you will find people coming to demolish these houses that the war veterans were building on properly planned survey and governed settlements it will not happen, dont worry about that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21201825/219058-scaled.jpg",
            "description": "<p>By Tapiwa Svondo War veterans are set to benefit from an initiative which will see the allocation and development of 50,000 residential stands from the government. The Ministry of Local Government and Public Works, the Ministry of the Veterans of the Liberation Struggle Affairs, and the CEO of Prevail Private Limited International, Paul Tungwarara, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-to-allocate-50000-residential-stands-to-war-veterans/\">Govt to allocate 50,000 residential stands to war veterans </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "Masvingo woman ordered to pay US$25k in adultery damages",
            "url": "https://www.newzimbabwe.com/masvingo-woman-ordered-to-pay-us25k-in-adultery-damages/",
            "content": "By Mary Taruvinga\n\nHigh Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25,000 adultery damages to the wife of a man she snatched six years ago.\n\nA default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings.\n\nMachingura had sued Machaya for US$50,000 after she invaded her 41-year-old marriage.\n\nBroken down, US$30,000 was for contumelia and US$20,000 was for loss of consortium, arising from a protracted adulterous relationship between Machaya and her husband.\n\nThe court heard the relationship started in 2019 and Machaya now has two children with Dhudhlas husband.\n\nThe plaintiff, a retired university lecturer and church elder, testified through affidavit to public humiliation in her congregation and community, severe emotional trauma requiring medical treatment for diabetes, hypertension and depression, and the stripping away of her role in the family estate (bank accounts, farm operations and vehicles), the court heard.\n\nSince 2019 the plaintiffs husband has cohabited with the defendant; intimacy, companionship and joint family life have ceased entirely. The marriage now subsists only in name, court papers further show.\n\nMachaya, despite the service, elected to remain absent and therefore offered no apology or mitigation.\n\nThematter was set down on the unopposed roll afterherplea was struck out for non-attendance at the pre-trial conference and her subsequent application for rescission was deemed abandoned.\n\nLiabilitywas therefore not in issueand the courtwas onlyseized with the assessment of quantum under r 25(1) of the High Court Rules, 2021.\n\nWhile handing down his judgement, Justice Mambara said that when fixing adultery damages, the court considers the nature and duration of the marriage, knowledge of the marriage by the adulterer, character and social-economic standing of the parties and the extent of contumelia and loss of consortium proved.\n\nThe judge also looked into contrition (or lack thereof) by the adulterer, the need for deterrence, and the level of awards in comparable cases.\n\nMambara said there is no reported High Court decision afterthat ofTaoneyivs Madzima (HH 18-25)has exceeded the composite figure of US$20,000.\n\nInflation-adjusted though that award is, it remains the highest recent comparable award placed before the court, he said.\n\nThe judge said the plaintiff had along, otherwise stable marriage.\n\nHe said there was a total lack of contrition by Machaya, adding that such offenders deserve deterrent penalties.\n\nThe court is satisfied that an award modestly above the most recent ceiling of US $20,000 is justified to reflect both changing economic realities and the egregious facts of this case.\n\nAccordingly, it is ordered that the defendant shall pay to the plaintiff the sum of US $25,000 made up as follows:(a) Contumelia: US$16,000 (b) Loss of consortium: US$9,000.\n\nHe ruled that interest shall run on the above amount at the prescribed rate of 5 % per annum from the date of this judgment to the date of full and final payment.\n\nMachaya will also pay Dhudhlas costs of suit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga High Court judge, Justice Joel Mambara has ordered a Masvingo woman, Eugenia Machaya to pay US$25,000 adultery damages to the wife of a man she snatched six years ago. A default order was granted in favour of the complainant, Viola Dhudhla Machingura after Machaya failed to attend pretrial meetings. Machingura had sued</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masvingo-woman-ordered-to-pay-us25k-in-adultery-damages/\">Masvingo woman ordered to pay US$25k in adultery damages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "Trump ambushes South African president by playing video alleging ‘genocide’ in South Africa",
            "url": "https://www.newzimbabwe.com/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa/",
            "content": "Sky News\n\nDonald Trump has ambushed South Africas president during a White House meeting by playing a video purportedly showing evidence of a genocide of white people in the African country.\n\nThe US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of thousands of white farmers.\n\nAfter an initial friendly chat where Trump complimented South African golfers in the room, a montage of clips was played as Mr Ramaphosa sat quietly and mostly expressionless. He later said: Id like to know where that is because this [the videos] Ive never seen.\n\nThe lights were dimmed in the Oval Office as the videos were shown, including of South African officials allegedly calling for violence against white farmers.\n\nThe scene in the heart of the White House administration was reminiscent of Mr Trumps ambush of Ukraines Volodymyr Zelenskyy last February.\n\nSouth Africa has rejected the allegation that white people are disproportionately targeted by crime.\n\nThe clips include one of a communist politician playing a controversial anti-apartheid song that includes lyrics about killing a farmer.\n\nTrump accused South Africa of failing to address the killing of white farmers. People are fleeing South Africa for their own safety, the US president said. Their land is being confiscated and in many cases theyre being killed.\n\nAlluding to people in the videos, Trump said: These are people that are officials and theyre saying kill the white farmer and take their land.\n\nThe US president then displayed printed copies of news articles that he said showed white South Africans who had been killed, saying death, death as he flipped through them.\n\nHe added of one article: Heres burial sites all over the place, these are all white farmers that are being buried.\n\nSouth African leader rejects allegations\n\nRamaphosa pushed back against Trumps accusations, by responding: What you saw, the speeches that were being made, that is not government policy. We have a multi-party democracy in South Africa that allows people to express themselves, political parties to adhere to various policies.\n\nAnd in many cases or in some cases, those policies do not go along with government policy.\n\nOur government policy is completely, completely against what he [a person in the video montage] was saying. Even in the parliament. And they are a small minority party which is allowed to exist in terms of our constitution.\n\nRamaphosa also said of the behaviour alleged by Mr Trump: We are completely opposed to that.\n\nRamaphosa said there was crime in South Africa, and the majority of victims were black. Mr Trump cut him off and said: The farmers are not black. The South African president responded: These are concerns we are willing to talk to you about.\n\nExperts in South Africa have said there is no evidence of white people being targeted, although farmers of all races are victims of violent home invasions in a country that suffers from a very high crime rate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21194112/skynews-donald-trump-cyril-ramaphosa_6923546.jpg",
            "description": "<p>Sky News Donald Trump has ambushed South Africa’s president during a White House meeting by playing a video purportedly showing evidence of a “genocide” of white people in the African country. The US president, who was hosting leader Cyril Ramaphosa in the Oval Office, said the footage showed the graves of thousands of white farmers.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-ambushes-south-african-president-by-playing-video-alleging-genocide-in-south-africa/\">Trump ambushes South African president by playing video alleging ‘genocide’ in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "CCC MP Chidziva acquitted of rape",
            "url": "https://www.newzimbabwe.com/ccc-mp-chidziva-acquitted-of-rape/",
            "content": "By Staff Reporter\n\nOpposition lawmaker for Glenview South, Happymore Chidziva who was accused of raping his wifes 16 year old relative has been acquitted.\n\nChidziva, also known as Bvondo, was accused of sexually abusing the minor on three occasions, twice at a local hotel and at a lodge in Waterfalls.\n\nProsecutors alleged that the legislator sweet-talked the girl into believing that he would secure employment for her before raping her.\n\nAt one time, heallegedly told the girl that he would secure employment for her abroad and change her life.\n\nHowever, Harare Magistrate Letwin Rwodzi cleared Chidziva of wrongdoing after a full trial, ruling that the prosecution failed to prove its case.\n\nThe magistrate also said the state failed to prove that Chidziva ever tried to secure employment for the minor.\n\nThe NPA was alleging that sometime in April 2024, Chidziva called the complainant and asked her to meet at Zanu PF Headquarters traffic lights, where he picked her up.\n\nIt was alleged that the MP told the girl that his car had broken down and drove her to a hotel in Harare CBD, where he asked her for sex.\n\nThe girl allegedly refused and told Chidziva that she was not ready.\n\nThe state alleged that Chidziva however took the girl to a room where he raped her without protection before giving her US$25.\n\nThe prosecution said after the alleged rape, the MP hired a taxi before he disembarked at a service station along Willowvale Road while the complainant proceeded to Glen View.\n\nThe following morning the accused person sent a message instructing her to buy some morning-after pills with the money he gave her, and her cousin was holding her phone and she saw the message, the MPs trial was told.\n\nThe complainant then told her cousin that she slept with the accused person and he was telling her to buy morning-after pills.\n\nIt was alleged that sometime in July 2024, the complainant told her aunt that Chidziva had found a job for her in Marimba as a domestic worker.\n\nOn that same day, it was alleged that Chidziva took the girl to a guesthouse in Waterfalls where he raped heragain.\n\nAfter the abuse, the teen did not return home but went to stay in Ushewokunze with her friend and her parents.\n\nIt was further alleged that on August 9, 2024, around 5PM, the MP called the teenager whilst she was in town and asked her to meet him at Cresta Lodge in Masasa.\n\nThe complainant then hired a taxi to Cresta Lodge, where she met the accused person. They then went into a room and the accused person then went out and returned at around midnight.\n\nThe accused person asked her to have sexual intercourse with him, and she refused and told him that she was tired.\n\nProsecutors alleged Chidziva then pleaded with the teen, promising her a job outside Zimbabwe and she complied.\n\nThe 16-year-old then returned to Ushewokunze, where she was chased away by her friends mother because she had not slept at home the previous night.\n\nThe court heard that she then went and stayed with her cousin in Budiriro 1, but her aunt had already filed a missing persons report at Budiriro Police Station.\n\nShe later presented herself to the police, where she narrated her ordeal leading to Chidzivas arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/31061449/Happymore-Bvondo-Chidziva.webp",
            "description": "<p>By Staff Reporter Opposition lawmaker for Glenview South, Happymore Chidziva who was accused of raping his wife’s 16 year old relative has been acquitted. Chidziva, also known as Bvondo, was accused of sexually abusing the minor on three occasions, twice at a local hotel and at a lodge in Waterfalls. Prosecutors alleged that the legislator</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-mp-chidziva-acquitted-of-rape/\">CCC MP Chidziva acquitted of rape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "‘Skeem Saam’ stars Tiisetso Thoka and Mogau Keebine discuss the impact of their affair storyline",
            "url": "https://www.newzimbabwe.com/skeem-saam-stars-tiisetso-thoka-and-mogau-keebine-discuss-the-impact-of-their-affair-storyline/",
            "content": "IOL\n\nSkeem Saam knows how to grip viewers with a storyline and the latest revolving around the adulterous affair of DJ Thomas and Mapitsi Maputla has been no different.\n\nThe pair, both radio presenters at Berry FM, have been entangled in an illicit relationship. The twist? Mapitsi is a married woman and her husband, Tbose, has no idea whats been going on behind the scenes.\n\nThat is, until the affair was accidentally exposed, live on air, thanks to Kamos meddling.\n\nIn an interview with IOL Entertainment, the actors behind the characters Tiisetso Thoka andMogau Keebine, shared that when they first read the script of how their characters secret would be exposed, had quite a reaction.\n\nI immediately had goosebumps thinking of the aftermath, said Thoka.\n\nIt meant the whole of Turf would know about the affair and the chances of Thomas losing his radio gig were high.\n\nKeebine was just as shocked and worried about how the characters would recover from such a huge blow, being exposed on the whole community radio station.\n\nIt was a very exciting time to be reading the script I was shocked and I was also very proud of how the writers just didnt go the conventional route of, you know, them being caught in the act, they exposed themselves, said Keebine.\n\nThe storyline was a challenge for both actors and they both prepared for it by reading up on scenarios on how people felt or reacted when they were caught cheating or when they caught their partner cheating.\n\nFor Keebine, who is married in real life, the storyline brought personal challenges. She had to prepare her family ahead of the episodes, reassuring them that it was all just a role. She also admitted she disagreed with her characters actions.\n\nI had to put my feelings about what Mapitsi and Thomas were doing aside and play the role of a broken-hearted, lonely, married woman with two kids who was finding affection from someone else.\n\nThe radio station setting added an element of pressure on the characters they had to act professionally when on air, even on days they were not getting along off-air. Eventually it put so much pressure on the affair because of our fights, said Thoka.\n\nMapitsi is already dealing with the pressures of her personal life. When herhusband Tbosecame back from overseas, it wasnt all smooth sailing, he didnt find her attractive, her wardrobe choices.\n\nHe was kind of almost borderline agreeing with the listenership of the radio station, and you put that together with having just been pregnant and having had a baby, explains Keebine.\n\nTheres insecurities about weight and physical appearance, and theres obviously like a disconnect between Mapitsi and Tbose an emotional disconnect between them at the time.\n\nI guess, you know, Thomas came in at a time when Mapitsi was very emotionally vulnerable and feeling lonely in her relationship.\n\nThe radio stations audiences emphasise on appearance after having a baby was an added pressure.\n\nI think the main pressure came from what was happening in her personal life because I think if Mapitsi had felt more reassured and more connected to Tbose as her husband, things probably wouldnt have gotten to where they did, said Keebine.\n\nAudiences have been loving the storyline, many have been waiting for the day DJ Thomas and Mapitsi get caught.\n\nOn Facebook, posts about the storyline have been flooded with comments, and on the week of the big expose May 12  16, the median rating pull was around 3.7 million viewers and Fridays fiery episode pulled around 4.3 million.\n\nThoka reveals that the real-life audience reactions have been crazy. Its funny how most people take this seriously and think its real life. More than 50 people have approached him and told him how disgusted they are by what he is doing with Mapitsi.\n\nIm used to handling such situations because its not the first time it has happened. Mostly, I avoid going out in the public, he said.\n\nThrough social media, Keebine got mixed reactions to Mapitsi cheating, from women understanding where the character was coming from and disappointment from men, who were hurt by their respectable Makotis change of ways.\n\nThere was a huge group of other women who were like, we cannot wait to see Mapitsis downfall when all of this is revealed, because I am not representing women well.\n\nI liked that as much as, you know, its not nice to hear about the character that youre playing, but I like that women are standing up for their character as women and saying that, no, we are not like this. This is a bad representation of most of us, even though it is what happens.\n\nThe adulterous storyline is not without lessons, Keebine says it reminds us that it will always end in tears.\n\nBe careful, tread lightly, and also be aware of your emotional state, so that you dont fall into the trap of unintentionally catching feelings for someone who youre not supposed to be looking at in that kind of way, from Mapitsis perspective, said Keebine.\n\nYou cant expect a person to be the way you envision them to be according to your expectations. Human beings have feelings and make mistakes too, adds Thoka. But it also tells us about the results of those mistakes. How your decisions can alter your life so drastically.\n\nAs the scandal continues to unfold, viewers remain glued to their screens, wondering: Will Mapitsi andTbosereconcile? Will DJ Thomas still go through with paying Lobola for his girlfriend? And will the listeners of Berry FM and the people of Turfloop, ever forget what happened live on air?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21053234/Screenshot-2025-05-21-at-06.31.56.png",
            "description": "<p>IOL “Skeem Saam” knows how to grip viewers with a storyline and the latest revolving around the adulterous affair of DJ Thomas and Mapitsi Maputla has been no different. The pair, both radio presenters at Berry FM, have been entangled in an illicit relationship. The twist? Mapitsi is a married woman and her husband, T’bose,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/skeem-saam-stars-tiisetso-thoka-and-mogau-keebine-discuss-the-impact-of-their-affair-storyline/\">‘Skeem Saam’ stars Tiisetso Thoka and Mogau Keebine discuss the impact of their affair storyline</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe",
            "url": "https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/",
            "content": "IOL\n\nA 31-year-old man has appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was apparently being driven towards the Beitbridge port of entry.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody, and the court postponed the matter to Monday next week.\n\nMashaba said the matter was postponed for profiling of the arrested man. Police have since established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen earlier this month, around Pretoria Central.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\nThe police immediately commenced an intensive search for the stolen vehicle until it was positively spotted driving outside Polokwane.\n\nPolice officers attempted to stop the speeding vehicle, but the driver refused to yield.\n\nA car chase ensued until the vehicle was intercepted at Nirvana robots. It was searched and police suddenly discovered a damaged tracking device removed from the vehicle, said Mashaba.\n\nThe 31-year-old man driving the stolen vehicle could not produce authentic documentation proving ownership, and he was immediately placed under arrest.\n\nThe arrested driver was charged for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has saluted the law enforcement team which intercepted and recovered the vehicle.\n\nShe urged the team to continue in their concerted efforts to combat cross border crimes.\n\nEarlier on Tuesday,IOL reported that police in Limpopo announced a significant breakthrough with the recovery of two vehicles, a Toyota Corolla Cross and a Toyota Hilux GD-6valued at approximately R1.4 million, which were destined to be smuggled out of South Africa.\n\nMashaba said the two vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on Sunday.\n\nIn a co-ordinated anti-smuggling operation involving SAPS Anti-Smuggling Team, Tshimollo Security and Investigation, and Reflex Anti-Hijacking Security, the officers intercepted a Toyota Hilux GD-6 double cab on the R101 near Polokwane weighbridge. During the stop, one male suspect fled into nearby bushes, while two female suspects attempted to escape but were apprehended after a foot chase, said Mashaba.\n\nThe women aged 19 and 20 were arrested, and are facing charges of possession of a suspected stolen motor vehicle.\n\nA man escaped on foot, evading arrest while two women aged 19 and 20 were arrested for possession of a Toyota Hilux GD-6 double cab bakkie. Image: SAPS\n\nPreliminary investigations confirmed that the vehicle was stolen on 16 May 2025 in the Garsfontein policing area in Pretoria East, Gauteng.\n\nIn a separate but related intelligence-driven operation, Mashaba said officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101 road, which was also en route to the Beitbridge port of entry.\n\nInvestigations revealed that this vehicle had been reported stolen at the Wierdabrug (City of Tshwane) policing area on Friday. The driver, a 34-year-old undocumented foreign national, was arrested, said Mashaba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21052738/Screenshot-2025-05-21-at-06.26.54.png",
            "description": "<p>IOL A 31-year-old man has appeared before the Polokwane Magistrate’s Court in Limpopo after he was arrested when police intercepted another stolen Toyota Corolla Cross sport utility vehicle which was apparently being driven towards the Beitbridge port of entry. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/\">More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        },
        {
            "title": "Zimbabwe in another deal with China to revamp dilapidated Parirenyatwa hospital",
            "url": "https://www.newzimbabwe.com/zimbabwe-in-another-deal-with-china-to-revamp-dilapidated-parirenyatwa-hospital/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has signed a Memorandum of Understanding (MoU) with China aimed at strengthening cooperation in health, specifically in respiratory and critical care medicine.\n\nThe MoU establishes a partnership between Zimbabwes ailing Parirenyatwa Group of Hospitals and Chinas Hunan Provincial Peoples Hospital.\n\nThis comes barely a week after Zimbabwe signed another MoU with Belarus to refurbish Parirenyatwa, which has been failing to cater for its patients owing to a shortage of basic medical supplies.\n\nIn return, Belarus gets an opportunity to extract vast mineral reserves in Zimbabwe.\n\nAddressing the media during a post-cabinet briefing, Information Minister Jenfan Muswere said the agreement seeks to boost Zimbabwes capacity in the prevention, diagnosis, and treatment of COVID-19 and enhance critical care services.\n\nUnder the Legislative Programme, cabinet considered and approved the Memorandum of Understanding between the Republic of Zimbabwe and the Peoples Republic of China on the Paired Hospital Cooperation Mechanism.\n\nThe Memorandum of Understanding seeks to promote cooperation in the fields of health.\n\nMore specifically, the MoU will establish a cooperativerelationship between the Parirenyatwa Group of Hospitals and the HumanProvincial Peoples Hospital of the Peoples Republic of China in the field ofrespiratory and critical care medicine.\n\nThe objective is to strengthenconstruction of respiratory and critical care medicine facilities in Zimbabweand improve local capacity on prevention, control, diagnosis and treatmentof COVID-19 as well as airway management and respiratory support forcritical patients, Muswere said.\n\nMost general hospitals in Zimbabwe are failing to meet the needs of patients, as they lack basic medical supplies, forcing patients to purchase their own.\n\nIn addition to this, the hospitals suffer from dilapidated infrastructure, while their workers receive poor remuneration, which has led to a massive brain drain and low staff morale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/30041701/Parirenyatwa-Hospital.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has signed a Memorandum of Understanding (MoU) with China aimed at strengthening cooperation in health, specifically in respiratory and critical care medicine. The MoU establishes a partnership between Zimbabwe’s ailing Parirenyatwa Group of Hospitals and China’s Hunan Provincial People’s Hospital. This comes barely a week after Zimbabwe signed another MoU with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-in-another-deal-with-china-to-revamp-dilapidated-parirenyatwa-hospital/\">Zimbabwe in another deal with China to revamp dilapidated Parirenyatwa hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:13",
            "date": "22 May 2025"
        }
    ]
}