{
    "news": [
        {
            "title": "Dynamos suspends Marriot’s son for disrupting players’ training",
            "url": "https://www.newzimbabwe.com/dynamos-suspends-marriots-son-for-disrupting-players-training/",
            "content": "By Sports Reporter\n\nDynamos FC has suspended technical staff member Harry Lusengo for disturbing the team players at the training ground.\n\nLusengo, who is the son of Dynamos board chair Bernad Marriot, blocked the team bus from leaving the training ground on Thursday afternoon, forcing players to use public transport.\n\nFollowing the unfortunate disturbances caused by a member of the technical support staff, Harry Lusengo at the teams training ground today, the club management would like to assure all its valued stakeholders that the situation has now been brought under control.\n\nThe incident, which was uncalled for and inappropriate, has seen the club taking the necessary measures to rein in the individual who has, with immediate effect, been suspended from conducting any business related to the team, reads part of Dynamos statement.\n\nDembare went on to encourage team players to remain focused ahead of Sundays match against Greenfuel.\n\nFurther, the Dynamos management would like to assure the stakeholders and general public that concrete measures havebeen put in place to avoid a repeat of such an incident.\n\nThe club would also like to reassure everyone concerned with Dynamos that the players and coaches remain focused and all is set for our crucial Castle Lager Premier Soccer Lager home tie against GreenFuel at Rufaro Stadium (kick-off 3 pm) on Sunday, further read the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21170339/Harry-Lusengo.jpg",
            "description": "<p>By Sports Reporter Dynamos FC has suspended technical staff member Harry Lusengo for disturbing the team players at the training ground. Lusengo, who is the son of Dynamos board chair Bernad Marriot, blocked the team bus from leaving the training ground on Thursday afternoon, forcing players to use public transport. “Following the unfortunate disturbances caused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-suspends-marriots-son-for-disrupting-players-training/\">Dynamos suspends Marriot’s son for disrupting players’ training</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Zimbabwe Agricultural Show sees significant growth ahead of 115th edition",
            "url": "https://www.newzimbabwe.com/zimbabwe-agricultural-show-sees-significant-growth-ahead-of-115th-edition/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Agricultural Show (ZAS) is set to make a big splash with a surge in both exhibitors and exciting new events, as it gears up for its 115th edition.\n\nIn a press briefing, ZAS CEO Rufaro Gunundu shared that 85% of exhibitors have already set up their stands, with 505 confirmed participantsup from 480 during the same period last year.\n\nThis growth is further reflected in the space occupied: a total of 79,500 square meters have been secured, surpassing last years 72,363 square meters, thanks to increased investments in Zimbabwes agricultural sector.\n\nIn a significant addition this year, ZAS will host its inaugural Golf Tournament this Friday at the Royal Harare Golf Club.\n\nThe event aims to raise funds for agricultural development programs. Gunundu emphasised that the tournament is not just a game, but a platform to support the next generation of agribusiness leaders.\n\nProceeds will benefit two key initiatives: the ZAS Master Farmer Training Programme, designed to equip farmers with critical skills and boost their confidence, and the ZAS Scholarship Programme, which offers financial assistance to students pursuing diplomas in agriculture, horticulture, and animal science, he said.\n\nIn addition to the tournament, attendees will be treated to a thrilling performance by the international Backsplit Performance Bikers, known for their high-energy, precision biking displays.\n\nGunundu described the event as a unique mix of sport and agricultural advocacy, promising an unforgettable experience while highlighting the bright future of Zimbabwes agricultural community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/02161844/ZAS-6.png",
            "description": "<p>By Alois Vinga The Zimbabwe Agricultural Show (ZAS) is set to make a big splash with a surge in both exhibitors and exciting new events, as it gears up for its 115th edition. In a press briefing, ZAS CEO Rufaro Gunundu shared that 85% of exhibitors have already set up their stands, with 505 confirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agricultural-show-sees-significant-growth-ahead-of-115th-edition/\">Zimbabwe Agricultural Show sees significant growth ahead of 115th edition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Human rights defenders acquitted after year-long trial",
            "url": "https://www.newzimbabwe.com/human-rights-defenders-acquitted-after-year-long-trial/",
            "content": "By Mary Taruvinga\n\nHuman rights activists Robson Chere, Namatai Kwekweza and Samuel Gwenzi, who were arrested after being dragged off a plane last year, are finally free following their acquittal by a Harare magistrate.\n\nThe three walked out of court free after being on trial for over a year, facing disorderly conduct charges.\n\nThey were jointly tried together with others who were arrested on the same charge, who included Vusumuzi Moyo, Phillies Pikitayi, Dephine Gutsa, Simbarashe Blackson, Emmanuel Sitima and Last Chinody, who were also acquitted.\n\nKwekweza (26), Chere (41) and Gwenzi (40) were minutes from taking off on a Fastjet flight to Victoria Falls when they were ordered off a plane at the Robert Gabriel Mugabe International Airport.\n\nPolice accused them of having taken part in an illegal protest outside the Harare Magistrates Court a month earlier, on June 27, in solidarity with over 70 Citizens Coalition for Change activists who were appearing in court.\n\nKwekwezas lawyers successfully argued that she was not in the country on June 27 and accused authorities of arresting the activists as part of an operation driven by paranoia to thwart potential protests during the SADC summit, which Zimbabwe hosted on August 17.\n\nSince 25 July 2024, we have been in and out of courts answering to trumped-up charges which were simply meant to break and discourage us from demanding a just and democratic Zimbabwe. We are finally free after a whole year of persecution. It only strengthened our resolve, Sitima said after the acquittal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/21055042/chere-namatai-gwenzi.jpeg",
            "description": "<p>By Mary Taruvinga Human rights activists Robson Chere, Namatai Kwekweza and Samuel Gwenzi, who were arrested after being dragged off a plane last year, are finally free following their acquittal by a Harare magistrate. The three walked out of court free after being on trial for over a year, facing disorderly conduct charges. They were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/human-rights-defenders-acquitted-after-year-long-trial/\">Human rights defenders acquitted after year-long trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "High Court upholds detention of DRC refugee pending identity verification",
            "url": "https://www.newzimbabwe.com/high-court-upholds-detention-of-drc-refugee-pending-identity-verification/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an urgent bid by a Congolese national seeking immediate release from Harare Remand Prison, ruling that his detention is lawful under the countrys immigration laws.\n\nBenoit Ombeni Mupenzi, who claims to be a refugee in Zimbabwe, had argued that his incarceration was unlawful as he had not been informed of the reasons for his arrest nor shown a valid warrant.\n\nHe told the court that his liberty was being arbitrarily restrained, causing irreparable harm and insisted he was unaware of any offence committed.\n\nSitting at the Harare High Court, Justice Fatima Maxwell held that authorities were acting within the law.\n\nCiting section 8(1) of the Immigration Act [Chapter 4:02], the judge said, The detention of the applicant is in terms of a law which remains in our statute books. Until and unless section 8 of the Immigration Act is declared unconstitutional and such declaration is confirmed by the Constitutional Court, the courts hands are tied.\n\nThe provision gives immigration authorities up to 14 days to verify an individuals identity, nationality and antecedents.\n\nThe Chief Immigration Officer opposed Mupenzis release, stating that his nationality was still under investigation and that none of the documents he presented substantiated his claim to refugee status.\n\nApplicants identity and nationality status have been questioned by the countrys security apparatus, the court was told.\n\nThe judge acknowledged Mupenzis complaint over not being given reasons for his detention, but made it clear that release was not the remedy. Whilst applicant might have a genuine grievance that he was not furnished with reasons for the arrest and detention forthwith, I am not persuaded that the remedy for that is his immediate release, she said.\n\nThere was no order regarding costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an urgent bid by a Congolese national seeking immediate release from Harare Remand Prison, ruling that his detention is lawful under the country’s immigration laws. Benoit Ombeni Mupenzi, who claims to be a refugee in Zimbabwe, had argued that his incarceration was unlawful as he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-upholds-detention-of-drc-refugee-pending-identity-verification/\">High Court upholds detention of DRC refugee pending identity verification</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Delayed govt payments force Bitumen World to cut jobs",
            "url": "https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/",
            "content": "By Alois Vinga\n\nDELAYED payments to government contractors have left one of the countrys top construction companies, Bitumen World (BW), with no choice but to cut down jobs.\n\nProblems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the governments agenda to revamp the countrys infrastructure.\n\nMarket watchers believe the government is withholding the payments, especially in the local ZWG currency, in a bid to curtail parallel market activities, which trigger depreciation. Just recently, mineral exporting companies revealed that the central bank has not been paying their 30% export surrender in local currency.\n\nThe latest decision by Bitumen Worlddemonstrates the authorities appetite to uphold currency stability even at the cost of other critical economic imperatives.\n\nThe Zimbabwean government, one of the companys largest debtors, is experiencing significant challenges in making timely payments to its contractors. The government is facing delays in settling arrears, affecting various projects, including road rehabilitation and dam construction.\n\nWhile efforts are underway to establish payment plans and small payments have been received, these financial constraints have contributed to the companys decision to realign its operations to remain resilient in a challenging fiscal environment, said the company.\n\nThe company said this necessary transition reflects a committed effort to adapt to the current economic challenges, including operating under cash flow pressures caused by delayed payments from clients.\n\nBW said it recognises and deeply values the dedication and professionalism of all its employees and is committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\nBW CEO, Andre Zietsman, said the decision has been very tough but had to be made due to limited options at hand.\n\nOver recent months, we have engaged in extensive discussions and evaluations to guide Bitumen World through this difficult period. While the decision to restructure was not made lightly, it is essential for ensuring our long-term viability and ability to continue contributing meaningfully to infrastructure development in Zimbabwe and beyond, he said.\n\nHe said the employees who have worked tirelessly to restore the countrys infrastructure glory will, unfortunately, suffer heavy blows when they see their jobs going down the drain.\n\nThe tragedy of these layoffs is that they impact the very people who built this prestigious brand  a brand that was wholly created by Zimbabweans, said Zietsman.\n\nThe company committed to handling the process with respect, transparency, and dignity, offering support to those affected through severance packages and transition assistance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20210647/bitumen-world-.jpeg",
            "description": "<p>By Alois Vinga DELAYED payments to government contractors have left one of the country’s top construction companies, Bitumen World (BW), with no choice but to cut down jobs. Problems bedevilling the construction sector are not new, following endless pleading for authorities to consider timely payments for work done in fulfilment of the government’s agenda to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/delayed-govt-payments-force-bitumen-world-to-cut-jobs/\">Delayed govt payments force Bitumen World to cut jobs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "US strikes deportation deals with Honduras and Uganda",
            "url": "https://www.newzimbabwe.com/us-strikes-deportation-deals-with-honduras-and-uganda/",
            "content": "BBC\n\nThe US has reached bilateral deportation agreements with Honduras and Uganda as part of its crackdown on illegal immigration, according documents obtained by the BBCs US partner CBS.\n\nUganda has agreed to take an unclear number of African and Asian migrants who had claimed asylum on the US-Mexico border, while Honduras will receive several hundred deported people from Spanish-speaking countries, CBS reports.\n\nThe move is part of an attempt by Donald Trumps administration to get more countries to accept deported migrants who are not their own citizens.\n\nHuman rights campaigners have condemned the policy, saying migrants face the risk of being sent to countries where they could be harmed.\n\nUnder the agreement, Uganda has agreed to accept deported migrants as long as they do not have criminal histories, but its unclear how many the country would ultimately take, according to CBS.\n\nHonduras agreed to receive migrants over two years, including families travelling with children, but documents suggest it could decide to accept more.\n\nBoth deals are part of the Trump administrations broader push for deportation arrangements with countries on several continents  including those with controversial human rights records.\n\nSo far, at least a dozen nations have agreed to accept deported migrants from other countries.\n\nLast week, the US State Department announced it had signed a safe third country agreement with Paraguay to share the burden of managing illegal immigration.\n\nThe White House has also been actively courting several African nations, with Rwanda saying earlier this month it will take up to 250 migrants from the US.\n\nA condition of the deal specifies that Rwanda would have the ability to approve each individual proposed for resettlement, a government spokesperson told the BBC.\n\nRwanda has previously been criticised for its human rights record, including the risk that those sent to the East African nation could be deported again to countries where they may face danger.\n\nEarlier this year, Panama and Costa Rica agreed to take in several hundred African and Asian migrants from the US.\n\nGovernment documents show the Trump administration has also approached countries like Ecuador and Spain to receive deported migrants, CBS reported.\n\nSince the start of his second term, Trump has embarked on sweeping efforts to remove undocumented migrants  a key election promise that drew mass support during this campaign.\n\nIn June, the US Supreme Court cleared the way for Trump to resume deportations of migrants to countries other than their homeland without giving them the chance to raise the risks they might face.\n\nAt the time, Justices Sonia Sotomayor, Elena Kagan and Ketanji Brown Jackson dissented from the majority ruling, calling the decision a gross abuse.\n\nUN rights experts and human rights groups have also argued that these removals to a nation that is not the migrants place of origin couldviolate international law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>BBC The US has reached bilateral deportation agreements with Honduras and Uganda as part of its crackdown on illegal immigration, according documents obtained by the BBC’s US partner CBS. Uganda has agreed to take an unclear number of African and Asian migrants who had claimed asylum on the US-Mexico border, while Honduras will receive several</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-strikes-deportation-deals-with-honduras-and-uganda/\">US strikes deportation deals with Honduras and Uganda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        },
        {
            "title": "Gems to host Kenya in friendly match",
            "url": "https://www.newzimbabwe.com/gems-to-host-kenya-in-friendly-match/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior netball team is set to host its Kenyan counterparts for a series of friendly matches next week.\n\nThe Gems friendlies against Kenya are scheduled to run from August 26 to the 30th in Harare.\n\nCurrently, Zimbabwe is in camp at Harare Girls High School as part of preparations for the upcoming friendly games against Kenya.\n\nThe friendly matches are part of the Gems preparations for the Celtic Cup in Scotland, which they will compete in this October.\n\nZimbabwe will be marking its second appearance at the invitational tournament, where they scooped bronze last year.\n\nIn addition to preparing for the Celtic Cup, the Gems are also using the upcoming friendly matches as a build-up to the African Netball Championships, which will be hosted by Malawi in December.\n\nTechnical Team\n\nHead Coach (Gems): Ropafadzo Mutsauki  Harare City Queens\n\nAssistant Coach (Gems): Perpetua Siyachitema  Glow Petroleum\n\nTeam Manager (Gems): Agnes Chiroodza\n\nTeam\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/21044800/netball-zim.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe senior netball team is set to host its Kenyan counterparts for a series of friendly matches next week. The Gems’ friendlies against Kenya are scheduled to run from August 26 to the 30th in Harare. Currently, Zimbabwe is in camp at Harare Girls High School as part of preparations for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gems-to-host-kenya-in-friendly-match/\">Gems to host Kenya in friendly match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "21 Aug 2025"
        }
    ]
}