{
    "news": [
        {
            "title": "UK: Police appeal to find family of Zimbabwean man who died on train tracks",
            "url": "https://www.newzimbabwe.com/uk-police-appeal-to-find-family-of-zimbabwean-man-who-died-on-train-tracks/",
            "content": "By UK Media\n\nBIRMINGHAM: An appeal has been launched to trace the family of a man whose body was found on train tracks.\n\nOfficers were called to a section of railway in Ladywood at around 9.15am on June 23.\n\nThe death was not been treated as suspicious.\n\nBritish Transport Police later identified him as Brian Bande.\n\nThe 39-year-old was born in Zimbabwe and had links toBirmingham, Wiltshire, Dorset and Bournemouth.\n\nBut police have been unable to trace his family and asked anyone who could help to make contact.\n\nThe force said: On Monday, June 23, at around 9.15am, officers were called to an area of the line in Ladywood to reports of a casualty on the tracks.\n\nParamedics also attended, however sadly a man was pronounced dead at the scene. The incident is not being treated as suspicious.\n\nThe man has been identified as 39-year-old Brian Bande.\n\nMr Bande was born in Zimbabwe, but had links to Birmingham, Wiltshire, Dorset and Bournemouth.\n\nDespite extensive enquiries, officers have been unable to trace Mr Bandes next-of-kin or any other family members to inform them of this sad news. They are appealing for any relatives or anyone who may have information about Mr Bandes family to come forward and assist their investigation.\n\nAnyone with information is asked to contact BTP by texting 61016 or calling 0800 40 50 40 quoting reference 123 of June 23.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/05145126/UK-TRAINS-e1751723520920.jpg",
            "description": "<p>By UK Media BIRMINGHAM: An appeal has been launched to trace the family of a man whose body was found on train tracks. Officers were called to a section of railway in Ladywood at around 9.15am on June 23. The death was not been treated as suspicious. British Transport Police later identified him as Brian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-police-appeal-to-find-family-of-zimbabwean-man-who-died-on-train-tracks/\">UK: Police appeal to find family of Zimbabwean man who died on train tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "05 Jul 2025"
        },
        {
            "title": "Chivayo gifts Jah Prayzah’s wife a new Land Rover Defender on his birthday",
            "url": "https://www.newzimbabwe.com/chivayo-gifts-jah-prayzahs-wife-a-new-land-rover-defender-on-his-birthday/",
            "content": "By Tapiwa Svondo\n\nMUSICIAN Mukudzeyi Mukombe popularly known as Jah Prayzah, who turned 38 years old on 4 July, saw his wife, Rufaro Makombe, receive a brand new 2025 Land Rover Defender 3.0 D as a gift from controversial businessman Wicknell Chivayo.\n\nThe tycoon is widely known as a tenderpreneur benefiting from alleged opaque government contracts.Jah Prayzah, a known Zanu PF supporter, has frequently been the recipient of Chivayos extravagant patronage, with this latest lavish gift adding to the estimated over $1 million in benefits his family and 3G Band have received from Chivayo, whose wealth stirs public debate, with critics questioning the source of his fortune.In a social media statement celebrating Jah Prayzah, Chivayo abruptly shifted focus to acknowledge the quiet power behind the man we know as Jah Prayzah his wife, Rufaro.On this special day, I wish to celebrate you differently, acknowledging the quiet power behind the man we know as Jah Prayzah. As men, we often overlook the women who stand firmly behind us, giving us all the support and encouragement.The special people who turn our houses into a home and raise our children while we work hard day and night. As they say, behind every great man is a good woman, and as I celebrate the birthday of my favourite musician of all time, I take this opportunity to say thank you to Mai Mukombe, for taking good care of our national music legend and icon, said Chivayo.The burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.As a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nThe tycoon is widely known as a tenderpreneur benefiting from alleged opaque government contracts.\n\nJah Prayzah, a known Zanu PF supporter, has frequently been the recipient of Chivayos extravagant patronage, with this latest lavish gift adding to the estimated over $1 million in benefits his family and 3G Band have received from Chivayo, whose wealth stirs public debate, with critics questioning the source of his fortune.In a social media statement celebrating Jah Prayzah, Chivayo abruptly shifted focus to acknowledge the quiet power behind the man we know as Jah Prayzah his wife, Rufaro.On this special day, I wish to celebrate you differently, acknowledging the quiet power behind the man we know as Jah Prayzah. As men, we often overlook the women who stand firmly behind us, giving us all the support and encouragement.The special people who turn our houses into a home and raise our children while we work hard day and night. As they say, behind every great man is a good woman, and as I celebrate the birthday of my favourite musician of all time, I take this opportunity to say thank you to Mai Mukombe, for taking good care of our national music legend and icon, said Chivayo.The burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.As a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nJah Prayzah, a known Zanu PF supporter, has frequently been the recipient of Chivayos extravagant patronage, with this latest lavish gift adding to the estimated over $1 million in benefits his family and 3G Band have received from Chivayo, whose wealth stirs public debate, with critics questioning the source of his fortune.\n\nIn a social media statement celebrating Jah Prayzah, Chivayo abruptly shifted focus to acknowledge the quiet power behind the man we know as Jah Prayzah his wife, Rufaro.On this special day, I wish to celebrate you differently, acknowledging the quiet power behind the man we know as Jah Prayzah. As men, we often overlook the women who stand firmly behind us, giving us all the support and encouragement.The special people who turn our houses into a home and raise our children while we work hard day and night. As they say, behind every great man is a good woman, and as I celebrate the birthday of my favourite musician of all time, I take this opportunity to say thank you to Mai Mukombe, for taking good care of our national music legend and icon, said Chivayo.The burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.As a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nIn a social media statement celebrating Jah Prayzah, Chivayo abruptly shifted focus to acknowledge the quiet power behind the man we know as Jah Prayzah his wife, Rufaro.\n\nOn this special day, I wish to celebrate you differently, acknowledging the quiet power behind the man we know as Jah Prayzah. As men, we often overlook the women who stand firmly behind us, giving us all the support and encouragement.The special people who turn our houses into a home and raise our children while we work hard day and night. As they say, behind every great man is a good woman, and as I celebrate the birthday of my favourite musician of all time, I take this opportunity to say thank you to Mai Mukombe, for taking good care of our national music legend and icon, said Chivayo.The burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.As a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nOn this special day, I wish to celebrate you differently, acknowledging the quiet power behind the man we know as Jah Prayzah. As men, we often overlook the women who stand firmly behind us, giving us all the support and encouragement.\n\nThe special people who turn our houses into a home and raise our children while we work hard day and night. As they say, behind every great man is a good woman, and as I celebrate the birthday of my favourite musician of all time, I take this opportunity to say thank you to Mai Mukombe, for taking good care of our national music legend and icon, said Chivayo.The burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.As a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nThe special people who turn our houses into a home and raise our children while we work hard day and night. As they say, behind every great man is a good woman, and as I celebrate the birthday of my favourite musician of all time, I take this opportunity to say thank you to Mai Mukombe, for taking good care of our national music legend and icon, said Chivayo.\n\nThe burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.As a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nThe burly mogul instructed Jah Prayzah, to accompany his wife to Exquisite Car Dealership to collect her pricey toy valued at a staggering US$120,000.\n\nAs a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\nAs a small, but heartfelt token of my appreciation to you Mai Mukombe, please ask Jah to go with you and see Victor at Exquisite car dealership. Your brand spanking new 2025 Land Rover Defender 3.0 D full spec is ready for collection and fully paid for, posted Chivayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/05092501/GvAkfVaXsAA4SW8.jpeg",
            "description": "<p>By Tapiwa Svondo  MUSICIAN Mukudzeyi Mukombe popularly known as Jah Prayzah, who turned 38 years old on 4 July, saw his wife, Rufaro Makombe, receive a brand new 2025 Land Rover Defender 3.0 D as a gift from controversial businessman Wicknell Chivayo. The tycoon is widely known as a “tenderpreneur” benefiting from alleged opaque government</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivayo-gifts-jah-prayzahs-wife-a-new-land-rover-defender-on-his-birthday/\">Chivayo gifts Jah Prayzah’s wife a new Land Rover Defender on his birthday </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "05 Jul 2025"
        },
        {
            "title": "Business tycoon Kuda Tagwirei lacks Zanu PF grassroots support, credibility to run for presidency: Analyst",
            "url": "https://www.newzimbabwe.com/business-tycoon-kuda-tagwirei-lacks-zanu-pf-grassroots-support-credibility-to-run-for-presidency-analyst/",
            "content": "By Darlington Gatsi\n\nPOLITICAL analyst Rejoice Ngwenya has poured cold water on wealthy businessman Kuda Tagwireis chances of succeeding President Emmerson Mnangagwa, saying the tycoon-turned-politician lacks a political power base to challenge for the highest office.\n\nNgwenyas remarks follow widespread speculation President Emmerson Mnangagwas faction was preparing the businessman for takeover as president following resistance within the ruling party for the incumbent to run for a third successive term, which violates the countrys Constitution.\n\nThis is a simplistic, if not naive, narrative. Zanu PF has no succession strategy. They rely on populist gravitas, and I can tell you Tagwirei has no grassroots credibility.\n\nIt would be catastrophic for ED [Emmerson Mnangagwa] to present him as a 2028 candidate. And besides, who really likes ED in the Central Committee? Which provinces would vote for Tagwirei in that party? said Ngwenya.\n\nTagwirei has unsettled a faction pushing for President Mnangagwas deputy, Constantino Chiwenga, to takeover when the 82-year-old Zanu PF leader retires in 2028 upon expiry of his second and final presidential term as per constitutional limits.\n\nThere are three factions in Zanu PF: the ED faction, the Chiwenga faction, and the neutral, non-committal, unsure faction. Definitely, the Chiwenga faction will say nobut we know how powerful it is. If it can shift attitudes in the military, then it has the capacity to hold sway, said Ngwenya.\n\nTagwirei has, in recent times, emerged from nowhere, criss-crossing the country presiding over Zanu PF-organised events thereby fuelling speculation of his ambitions to succeed President Mnangagwa.\n\nTo demonstrate the tensions within Zanu PF, Tagwirei was reportedly ejected, at Chiwengas behest, from this weeks Zanu PF Central Committee meeting in Harare ostensibly for not having followed proper procedures to ratify his membership to the all-powerful Zanu PF organ. He was forced out alongside other new coopted members from other provinces, sources said.\n\nTagwirei arrived at the Central Committee gathering at Zanu PF Headquarters on Thursday with opulence and a spring in his step, only to fail to see the meeting through.\n\nThe businessman, who was endorsed by the Harare Province led by Goodwills Masimirembwa, attended the indaba unaware of the partys procedures and statutes.\n\nDespite his name having been seconded by the provincial structure, it required ratification by the Central Committee to confirm his co-option into the most powerful organ of Zanu PF.\n\nAccording to political observers, his attendance at the Central Committee meeting exposed his ignorance regarding the ruling partys procedures.\n\nTagwireis supersonic ascension in Zanu PF has been met with mixed feelings among the general membership.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/31015232/kuda-tagwirei.png",
            "description": "<p>By Darlington Gatsi  POLITICAL analyst Rejoice Ngwenya has poured cold water on wealthy businessman Kuda Tagwirei’s chances of succeeding President Emmerson Mnangagwa, saying the tycoon-turned-politician lacks a political power base to challenge for the highest office. Ngwenya’s remarks follow widespread speculation President Emmerson Mnangagwa’s faction was preparing the businessman for takeover as president following resistance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/business-tycoon-kuda-tagwirei-lacks-zanu-pf-grassroots-support-credibility-to-run-for-presidency-analyst/\">Business tycoon Kuda Tagwirei lacks Zanu PF grassroots support, credibility to run for presidency: Analyst</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "05 Jul 2025"
        },
        {
            "title": "Former RBZ governor Gono accused of extortion, fabrication as company grab trial continues",
            "url": "https://www.newzimbabwe.com/former-rbz-governor-gono-accused-of-extortion-fabrication-as-company-grab-trial-continues/",
            "content": "By Staff Reporter\n\nLAWYERS representing a Harare couple accused of grabbing a company from former Reserve Bank of Zimbabwe (RBZ) governor Gideon Gono have accused him of trying to extort the two of US$50,000 by abusing his closeness to corridors of power and threatening them with arrest.\n\nGono was in court as a key witness against Clark Clever Makoni and his wife Beverly Aisha Ndonda Makoni on Friday, accusing the two of fraudulently changing his company documents to elbow him out.\n\nThe State alleges that in July 2017, Gono engaged the services of the accused persons to manage Valley Lodge, among other properties.\n\nThe State also alleges that the couple forged a CR14 form for Valley Lodge [Pvt] ]Ltd] in which Clark Makoni appointed himself a director and company secretary and Beverly Makoni as a director in Valley Lodge.\n\nThis Friday Gono told the court that after the matter came out, Clark initiated a meeting and apologised before agreeing to pay the US$50,000 as compensation.\n\nHowever, he said, the deed of settlement did not materialise because Beverly was not present and she refused to sign the papers, adding that Clark never returned to him for the agreement to be consummated.\n\nGono conceded that the deed of Settlement had to be signed by three parties for it to be legally valid.\n\nThis is after the couple denied entering into an agreement with him.\n\nAdmire Rubaya representing the couple took the banker to task for signing documents which described Clark as the Managing Director and Beverly as the Finance Director yet the State alleges they gave themselves the positions after altering the company documents.\n\nThis came after Gono was shown the alleged agreement which he signed showing the two as the managing and finance director including the said minutes of the meeting.\n\nThe deed of settlement stated that Gono was to instruct his people to withdraw the cases when the agreement is signed and that he would not have been in court.\n\nThe couple, through their lawyers, questioned why Gono was prepared to withdraw the charges if indeed they had stolen from him which the couple believes was an extortion attempt.\n\nIt emerged that Clark Makoni was arrested and detained twice by the ZRP and ZACC over the same allegations and the couples lawyer averred that was stark evidence that Gono abused his power to mistreat them as that was his culture to illtreat those close to him after using them.\n\nThe couple said Gono had used the same approach on one Ralph Muzembe who was his best man at his wedding.\n\nMuzembe, who previously was the one managing the Valley Lodge business, was reportedly Gonos right hand man who was unceremoniously discarded through the Makonis on Gonos instructions.\n\nGono also said he had no expert evidence to state that the couple signed documents which were presented to Mutare ZB Bank.\n\nIt has also emerged that Gono is neither a shareholder of Valley Lodge [Pvt] nor a director of same since he has not yet paid the full purchase price for the lodge and no formalities for change of ownership had taken place from the Omar brothers.\n\nGono told the court that the allege meetings which culminated into the deed of settlement had allegedly been recorded on audio and video. However, Gono did not have such evidence in place to corroborate his story that Clark had signed the alleged documents.\n\nThe matter continues on July 11.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/28222851/Gono.jpg",
            "description": "<p>By Staff Reporter  LAWYERS representing a Harare couple accused of grabbing a company from former Reserve Bank of Zimbabwe (RBZ) governor Gideon Gono have accused him of trying to extort the two of US$50,000 by “abusing his closeness to corridors of  power” and threatening them with arrest. Gono was in court as a key witness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-rbz-governor-gono-accused-of-extortion-fabrication-as-company-grab-trial-continues/\">Former RBZ governor Gono accused of extortion, fabrication as company grab trial continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "05 Jul 2025"
        },
        {
            "title": "It’s a simple game— Dynamos coach speaks ahead of Herentals FC clash",
            "url": "https://www.newzimbabwe.com/its-a-simple-game-dynamos-coach-speaks-ahead-of-herentals-fc-clash/",
            "content": "By Sports Reporter\n\nDESPITE mounting relegation fever, Dynamos coach Saul Chaminuka is calm ahead of his teams clash against Herentals FC on Saturday at Rufaro Stadium.\n\nChaminuka, who has managed one win since his appointment in May, will be hoping for a better outcome to steer the team out of relegation zone.Affectionately known as Dembare, the Harare giants are 17th on the log with 15 points, seven ahead of bottom-placed Kwekwe United, who are on position 18.Herentals FC on the other end are enjoying a good outing in the ongoing campaign. Known as The Students, the outfit is eigth on the log with 25 points.We have prepared well, now this is a local derby and I dont think I need to do anything.The players themselves know what it means. I know they are talking as they are meeting and doing whatever they are doing in the city.So, that game is one game that I think is very simple for me, said Chaminuka.During the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nChaminuka, who has managed one win since his appointment in May, will be hoping for a better outcome to steer the team out of relegation zone.\n\nAffectionately known as Dembare, the Harare giants are 17th on the log with 15 points, seven ahead of bottom-placed Kwekwe United, who are on position 18.Herentals FC on the other end are enjoying a good outing in the ongoing campaign. Known as The Students, the outfit is eigth on the log with 25 points.We have prepared well, now this is a local derby and I dont think I need to do anything.The players themselves know what it means. I know they are talking as they are meeting and doing whatever they are doing in the city.So, that game is one game that I think is very simple for me, said Chaminuka.During the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nAffectionately known as Dembare, the Harare giants are 17th on the log with 15 points, seven ahead of bottom-placed Kwekwe United, who are on position 18.\n\nHerentals FC on the other end are enjoying a good outing in the ongoing campaign. Known as The Students, the outfit is eigth on the log with 25 points.We have prepared well, now this is a local derby and I dont think I need to do anything.The players themselves know what it means. I know they are talking as they are meeting and doing whatever they are doing in the city.So, that game is one game that I think is very simple for me, said Chaminuka.During the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nHerentals FC on the other end are enjoying a good outing in the ongoing campaign. Known as The Students, the outfit is eigth on the log with 25 points.\n\nWe have prepared well, now this is a local derby and I dont think I need to do anything.The players themselves know what it means. I know they are talking as they are meeting and doing whatever they are doing in the city.So, that game is one game that I think is very simple for me, said Chaminuka.During the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nWe have prepared well, now this is a local derby and I dont think I need to do anything.\n\nThe players themselves know what it means. I know they are talking as they are meeting and doing whatever they are doing in the city.So, that game is one game that I think is very simple for me, said Chaminuka.During the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nThe players themselves know what it means. I know they are talking as they are meeting and doing whatever they are doing in the city.\n\nSo, that game is one game that I think is very simple for me, said Chaminuka.During the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nSo, that game is one game that I think is very simple for me, said Chaminuka.\n\nDuring the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.The last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nDuring the first round, the two sides played a 0-0 draw at the same venue, Rufaro Stadium.\n\nThe last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.Meanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nThe last time Dynamos lost to HerentalsFC was in 2023 when they fell 1-0 at the National Sports Stadium.\n\nMeanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.We want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nMeanwhile, Chaminuka added that he is eyeing to add five new players at Dynamos during the ongoing mid season transfer window, which opened July 1.\n\nWe want quality depth and I think five is a good number to strengthen the team, added Chaminuka.Dembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nWe want quality depth and I think five is a good number to strengthen the team, added Chaminuka.\n\nDembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\nDembare have already lost defender Nomore Chinyerere, who has joined lowveld side Triangle United FC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Sports Reporter DESPITE mounting relegation fever, Dynamos coach Saul Chaminuka is calm ahead of his team’s clash against Herentals FC on Saturday at Rufaro Stadium. Chaminuka, who has managed one win since his appointment in May, will be hoping for a better outcome to steer the team out of relegation zone. Affectionately known as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-a-simple-game-dynamos-coach-speaks-ahead-of-herentals-fc-clash/\">It’s a simple game— Dynamos coach speaks ahead of Herentals FC clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:08",
            "date": "05 Jul 2025"
        }
    ]
}