{
    "news": [
        {
            "title": "AfDB says Zimbabwe seeks $2.6bn in bridge finance to overhaul debt",
            "url": "https://www.newzimbabwe.com/afdb-says-zimbabwe-seeks-2-6bn-in-bridge-finance-to-overhaul-debt/",
            "content": "Bloomberg\n\nThe African Development Bank said Zimbabwe has proposed seeking $2.6 billion in bridge finance to help it clear arrears owed to international financial institutions as it attempts to break a debt impasse dating back to 1999.\n\nThe southern African nation owes about 60% of its $21 billion debt pile to external creditors including the World Bank, Paris Club, European Investment Bank and the AfDB. The debt has kept Zimbabwe locked out of global capital markets since it first defaulted on payments a quarter of a century ago.\n\nAs part of efforts to renegotiate the debt it has, since 2022, been having discussions with creditors. A meeting on Zimbabwes arrears clearance and debt resolution process was held on the sidelines of the International Monetary Fund and World Bank spring meetings in Washington this week, the AfDB said said in a statement on Wednesday.\n\nAkinwumi Adesina, the AfDB president and co-negotiator of the debt talks, said in the statement that the next steps will include the need for the IMF to approve a staff-monitored program for Zimbabwe during the spring meetings, support from potential donors for bridge loan financing, exploration of additional resources from the African Development Fund, and prioritization of Zimbabwes arrears clearance within the G20 Common Framework.\n\nEarlier this week, Zimbabwes Treasury said its nearing a deal with the IMF on a programme.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg The African Development Bank said Zimbabwe has proposed seeking $2.6 billion in bridge finance to help it clear arrears owed to international financial institutions as it attempts to break a debt impasse dating back to 1999. The southern African nation owes about 60% of its $21 billion debt pile to external creditors including the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afdb-says-zimbabwe-seeks-2-6bn-in-bridge-finance-to-overhaul-debt/\">AfDB says Zimbabwe seeks $2.6bn in bridge finance to overhaul debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Mthuli Ncube unveils industrial development facilities",
            "url": "https://www.newzimbabwe.com/mthuli-ncube-unveils-industrial-development-facilities/",
            "content": "By Alois Vinga\n\nFINANCE Minister, Mthuli Ncube, unveiled a number of facilities available to spur micro, small and medium-sized enterprises (MSMEs) growth to full-scale industrialisation, effectively contributing towards the countrys formalisation agenda.\n\nZimbabwe currently has3,4 millionMSMEs employing 4,8 million people full-time. The 2022 Finscope Survey reported that MSMEs contributed US$ 8.6 billion to the countrys GDP.\n\nExperts, however, believe that there is a need to urgently nurture the informal sector and lend it the requisite support if the country is to plug revenue leakages.\n\nSpeaking to delegates at the ZITF International Business Conference on Wednesday, Ncube said the government is recapitalising the National Venture Capital Company of Zimbabwe, which is supporting start-ups and MSMEs.\n\nThe NVCCZ is providing equity finance(Patient Capital), innovative financing solutions, tailored support for startups, early-stage, and growing businesses,among others. A total ZiG108 million was set aside through the 2025 National Budget for the NVCCZ to support upcoming start-ups and MSMEs, he said.\n\nNcube said in the 2025 Budget, government set aside resources to capitalise the New Industrial Development Fund (IDF) with as much as ZiG100 million being provided for in the fiscal period. The IDF will support Value Chains in Pharmaceuticals, Agro-processing, Cotton, Leather, among others.\n\nIn addition, the manufacturing sector is also benefiting from support from the African Development Bank. In 2025, the AfDB, targeted the following projects, Sustainable Enterprises Development for Women and Youth, as well as Skills for Youth and Women Employability and Productivity Projects towards completion of the Hauna banana processing plant, he said.\n\nHe said the facility is also supporting capacity building for youth and women in the fruit and vegetable value chain and curricula review workshops towards upgrading/setting up physical infrastructure for the aquaculture production units at Kukwanisa and Binga Vocational Training Centres, as well as the Training Centre for Rural Women.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga FINANCE Minister, Mthuli Ncube, unveiled a number of facilities available to spur micro, small and medium-sized enterprises (MSMEs) growth to full-scale industrialisation, effectively contributing towards the country’s formalisation agenda. Zimbabwe currently has 3,4 million MSMEs employing 4,8 million people full-time. The 2022 Finscope Survey reported that MSMEs contributed US$ 8.6 billion to the country’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mthuli-ncube-unveils-industrial-development-facilities/\">Mthuli Ncube unveils industrial development facilities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Junior Sables redeem themselves in Barthes Trophy campaign",
            "url": "https://www.newzimbabwe.com/junior-sables-redeem-themselves-in-barthes-trophy-campaign/",
            "content": "By Sports Reporter\n\nZimbabwe mens under-20 rugby team managed to redeem themselves in the ongoing Barthes Trophy campaign with a 78-20 win against Tunisia on Wednesday at the Old Hararians Sports Club.\n\nJunior Sables win came at the back of a disappointing 41-22 defeat in their first game against Namibia on Saturday.\n\nWednesdays win was a big boost for the hosts, who kept their chances of winning the trophy afloat ahead on Sundays last fixture against defending champions Kenya.\n\nFor Tunisia, Wednesdays defeat crushed all the hope of winning the trophy as it was their second defeat in the campaign following Sundays 29-21 defeat against Kenya.\n\nJunior Sables will be hoping to record a positive result against Kenya, who beat them last year in the same competition.\n\nNamibia are favourites to win the title as they are now on six points after managing their second successive win (22-32) against Kenya.\n\nBarthes Trophy Standings\n\n1)Namibia = 6 points\n\n2)Zimbabwe =3 points\n\n3)Kenya = 3 points\n\n4)Tunisia = 0 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24104157/WhatsApp-Image-2025-04-24-at-11.23.06.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe men’s under-20 rugby team managed to redeem themselves in the ongoing Barthes Trophy campaign with a 78-20 win against Tunisia on Wednesday at the Old Hararians Sports Club. Junior Sables’ win came at the back of a disappointing 41-22 defeat in their first game against Namibia on Saturday. Wednesday’s win was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/junior-sables-redeem-themselves-in-barthes-trophy-campaign/\">Junior Sables redeem themselves in Barthes Trophy campaign</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "In Pictures: UZ lecturers protest over poor wages",
            "url": "https://www.newzimbabwe.com/in-pictures-uz-lecturers-protest-over-poor-wages/",
            "content": "University of Zimbabwe lecturers, Thursday protested over poor remuneration, which they are demanding be reviewed upwards.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24103947/UZ-strike-8-scaled.png",
            "description": "<p>University of Zimbabwe lecturers, Thursday protested over poor remuneration, which they are demanding be reviewed upwards.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-uz-lecturers-protest-over-poor-wages/\">In Pictures: UZ lecturers protest over poor wages</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Botswana President says seeking presidency beyond ten years is only done by failures",
            "url": "https://www.newzimbabwe.com/botswana-president-says-seeking-presidency-beyond-ten-years-is-only-done-by-failures/",
            "content": "By Staff Reporter\n\nBOTSWANA President Duma Boko has labelled leaders who seek extension of their term limits beyond constitutionally mandated 10 years as definite failures.\n\nBoko, who was elected President last year, was speaking at a housing project launch in Gaborone recently.\n\nHis comments, shared viasocial media platforms, ignited debate amongst Zimbabweans who are waiting with bated breath regards President Emmerson Mnangagwas attempts to amend the constitution and ensure an illegal extension.\n\nAny President of any country who wants to be President for more than ten years; anybody who has that ambition is instantly a failure, said Boko.\n\nYou cant want to do this job for more than ten years if you are serious about it.\n\nAnybody who sticks with presidency for more than ten years is a sure-fire indication that he has failed, he doesnt understand the job.\n\nMnangagwa, who is in his second and final term, is reportedly eyeing a three-year extension of his term..\n\nAlthough various explanations have been given as to why this is ideal, a faction in favour of him stepping down views this as a ploy to deny his deputy Constantino Chiwenga an opportunity to lead as was agreed when the two toppled late President Robert Mugabe in a 2017 coup.\n\nZanu PF is understood to have already prepared a constitutional amendment bill for the extension, with opposition Citizens Coalition for Change (CCC) legislators in the know.\n\nA move to award residential stands to parliamentarians was interpreted as a move to ensure Mnangagwas three-year extension and also that he is not impeached, as is being called for by a rebel faction led by war veteran Blessed Geza within the party.\n\nGeza is demanding Mnangagwas immediate resignation, blaming him for worsening corruption and poor administration.\n\nA 31 March stay-away shook the government and saw police officers and soldiers getting unexplained allowances to ease tension within their ranks and entice them into not taking part in any possible coup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/03054357/Duma-Boko-announced-Botswana-6th-president-1536x1024-1.jpeg",
            "description": "<p>By Staff Reporter BOTSWANA President Duma Boko has labelled leaders who seek extension of their term limits beyond constitutionally mandated 10 years as definite failures. Boko, who was elected President last year, was speaking at a housing project launch in Gaborone recently. His comments, shared via social media platforms, ignited debate amongst Zimbabweans who are waiting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/botswana-president-says-seeking-presidency-beyond-ten-years-is-only-done-by-failures/\">Botswana President says seeking presidency beyond ten years is only done by failures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "“The regime has resorted to intimidation and harassment of dissent” – opposition leaders Ngarivhume, Chibaya dismiss police claims of inciting violence",
            "url": "https://www.newzimbabwe.com/the-regime-has-resorted-to-intimidation-and-harassment-of-dissent-opposition-leaders-ngarivhume-chibaya-dismiss-police-claims-of-inciting-violence/",
            "content": "By Staff Reporter\n\nOpposition figure and former MP for Mkoba North, Amos Chibaya, and Transform Zimbabwe (TZ) leader Jacob Ngarivhume have dismissed the Zimbabwe Republic Police (ZRP) statement accusing them of being ringleaders of anticipated protests against President Emmerson Mnangagwa.\n\nThe duo argues that police intelligence has crossed its wires, asserting that they are not involved in any plan to organise or mobilise citizens to demonstrate against the government.\n\nIn a statement released on Wednesday, national police spokesperson Commissioner Paul Nyathi identified Chibaya and Ngarivhume as key figures behind planned protests against Mnangagwa. However, the two men have reacted with shock and disbelief, branding the statement as wholly untrue.\n\nIm shocked, Chibaya stated in an interview with NewZimbabwe.com on Wednesday evening.\n\nI report to Harare Central Police Station twice a month. Would I be so foolish as to organise and mobilise people to protest? I think certain individuals within the police ranks have a personal vendetta against me. I implore them to reach out to me. I know nothing about any planned violent demonstrations, Chibaya said.\n\nHe added: This is a Zanu PF problem. The people calling for protests are Zanu PF people. They want to protest against each other. Blessed Geza is a Zanu PF Central Committee member. He is the one calling for protests, not me. The police need to get their facts straight and guard against being misled.\n\nChibaya further urged Commissioner Nyathi to retract his statement, saying its casting a shadow over his reputation.\n\nMay I kindly request the ZRP to retract this statement, bearing in mind the impact of such a harmful statement on my reputation as a person, on my family, and on Zimbabwean society at large, Chibaya said in a statement late Wednesday.\n\nNgarivhume echoed Chibayas sentiments, dismissing the police statement as fabrication. He challenged law enforcement to provide evidence to support their claims and implored the police to refrain from tarnishing his name without cause.\n\nJacob Ngarivhume\n\nIm a peaceful, law-abiding citizen, and the police know that. I havent committed any crime in Zimbabwe. The police should simply go after those who are actually calling for violence, like Geza himself. Im not part of Geza. Im not Zanu PF. The police must hunt for the real trouble makers in our society, not me, Ngarivhume said.\n\nHe added: Its a sign that the regime is deep-seated in panic mode and has resorted to their usual intimidation and harassment of perceived voices of dissent. They just want to paint me with the same brush.\n\nEarlier, Commissioner Nyathis statement had named Chibaya and Ngarivhume as the individuals allegedly masterminding Mnangagwas downfall through violent protests, an accusation both men have vehemently denied.\n\nThe Zimbabwe Republic Police (ZRP) warns individuals and groups who have been identified as instigators, inciters, and ringleaders of criminal elements who intend to unleash violence, which includes malicious damage to property by burning tyres and destroying buildings, that the full force of the law will be brought to bear without fear or favour, Nyathi said.\n\nHe then proceeded to single out Chibaya and Ngarivhume.\n\nSome of the suspects have been identified as Jacob Ngarivhume and Amos Chibaya.\n\nThe Zimbabwe Republic Police and other security agencies are fully alert and will decisively deal with unruly elements who intend to disturb the existing peaceful environment.\n\nThe public is encouraged to report any criminal activities or anyone inciting violence, issuing threats, or intimidating them to engage in unlawful acts on the National Complaints Desk.\n\nZimbabwe is currently at a crossroads after former Zanu PF Central Committee member, Blessed Geza, called for mass protests, including stay-aways, to force Mnangagwa to leave office before the end of his term in 2028.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/02033015/chibaya-amos.jpg",
            "description": "<p>By Staff Reporter Opposition figure and former MP for Mkoba North, Amos Chibaya, and Transform Zimbabwe (TZ) leader Jacob Ngarivhume have dismissed the Zimbabwe Republic Police (ZRP) statement accusing them of being ringleaders of anticipated protests against President Emmerson Mnangagwa. The duo argues that police intelligence has crossed its wires, asserting that they are not</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-regime-has-resorted-to-intimidation-and-harassment-of-dissent-opposition-leaders-ngarivhume-chibaya-dismiss-police-claims-of-inciting-violence/\">“The regime has resorted to intimidation and harassment of dissent” – opposition leaders Ngarivhume, Chibaya dismiss police claims of inciting violence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "White and black farmers still bear the scars of Zimbabwe’s land grabs",
            "url": "https://www.newzimbabwe.com/white-and-black-farmers-still-bear-the-scars-of-zimbabwes-land-grabs/",
            "content": "By Farai Matiashe, Al Jazeera\n\nHarare, Zimbabwe Guy Watson-Smith felt hurt and betrayed when his 5,000-hectare (12,355-acre) farm in Beatrice, in Zimbabwes Mashonaland East province, was violently invaded by three armed men in the early 2000s.\n\nThe then-51-year-old white commercial farmer was not just losing his land; he was leaving behind hundreds of workers and their families, many of whom he had known since childhood.\n\nWe cried, the 75-year-old told Al Jazeera.\n\nOn the morning of September 18, 2001, Watson-Smith, his two farm managers, and his unwelcome visitors sat at a table on the patio.\n\nWatson-Smiths wife, Vicky, offered them a cup of tea.\n\nBut the message was simple: leave or die.\n\nHis family was given two hours to pack.\n\nThey fled to the capital, Harare, 54km (33.5 miles) away, seeking refuge at his father-in-laws home in the Avenues, an inner-city suburb.\n\nWatson-Smiths ordeal was not an isolated incident.\n\nAcross the country, war veterans armed with pistols led similar land grabs, together with their children and with assistance from the polices elite units.\n\nThe invasions were part of the chaotic Fast Track Land Reform Program (FTLRP), launched under President Robert Mugabe in 2000 to reclaim land from about 4,000 white farmers and redistribute it to landless Black Zimbabweans.\n\nBut instead of redressing past injustices, Zimbabweans say it fuelled economic and land insecurity as mainly governing party loyalists benefitted from the reclamations.\n\nMore than two decades on, a struggling agricultural sector haunts Zimbabwe, leaving the question of land ownership unresolved, even as the government has begun to paycompensationto white farmers.\n\nWhen land was seized from white farmers in the early 2000s, it was forcibly and sometimes violently taken, with at least seven people killed in the process.\n\nHowever, Zimbabwes land struggles did not begin with Mugabes FTLRP or even the countrys independence in 1980. The tensions stretch back over a century to the arrival of white British settlers in 1890.\n\nWhen the British arrived, they invaded Mashonaland areas and took mining rights from the locals under agreements that the local leadership did not understand.\n\nThey then expanded control, violently displacing Black people from their fertile ancestral lands.\n\nForced into barren areas with poor soil, low rainfall and tsetse flies, Black Zimbabweans struggled to farm or raise cattle.\n\nBy the 1950s, land was formally divided along racial lines, with white settlers holding the most fertile areas.\n\nThis deep injustice fuelled the liberation struggle.\n\nRevolutionary groups like ZANU and ZAPU took up arms, and from 1964 to 1979, land was at the heart of the Rhodesian Bush War  also known as the Second Chimurenga, during which Black Zimbabweans fought for independence from the white minority government.\n\nThe 1969 Land Tenure Act, which escalated Black land evictions, was a breaking point.\n\nFor many fighters, reclaiming the land became not just about survival, but about identity and economic freedom.\n\nThe war ended with the Lancaster House Agreement drawn up and signed in London in December 1979, setting the stage for Zimbabwes first democratic elections.\n\nOn April 18, 1980, after Mugabes victory, Zimbabwe gained independence from Britain. The Lancaster agreement barred Mugabes government from forcibly seizing land, allowing only voluntary transfers under a willing buyer, willing seller system from 1980 to 1990.\n\nMany war veterans felt betrayed.\n\nThey had fought for liberation, expecting immediate land redistribution, but years of slow negotiations left them frustrated. From 1990 to 2000, land reclamations took place by the government compulsorily buying land from white commercial farmers using funds from donors, including Britain.\n\nHowever, the process became politicised as some senior politicians and elites redistributed land among themselves instead of to the poor. Some of the funds were allegedly loaned to ruling ZANU-PF party loyalists and not used for the intended purposes of land redistribution. This raised accusations of corruption, causing some donors to cut funding.\n\nBritain, which had initially committed 20 million pounds ($26.6m at the current rate) to fund the land reform programme, withdrew support in 1997.\n\nThe United Kingdom said it could no longer accept responsibility for colonial injustices and would not fund a programme plagued by corruption and elite capture.\n\nDonor funding helped the Zimbabwean government buy land from white commercial farmers, enabling about 50,000 Black farmers to receive land. But the programme was ultimately underfunded and fell far short of the targeted 8 million hectares (19.8 million acres).\n\nIn February 2000, under mounting pressure from furious war veterans, Mugabe attempted to amend the constitution to allow land seizures without compensation.\n\nWhen the referendum failed, the war veterans and their families took matters into their own hands by invading farms. Soon, Mugabe officially followed suit by launching the FTLRP.\n\nAt that time, the minority white population, which made up about 4 percent of the country, owned more than half the land in Zimbabwe.\n\nFor months, Watson-Smiths land, where he grew tobacco, maize, paprika, groundnuts and Rhodes seed for export, remained untouched until the day a powerful war hero with the ZANU-PF set his sights on it.\n\nWatson-Smith was in Harare, where he worked as the Mashonaland East provincial chairman of the Commercial Farmers Union, a body representing white commercial farmers, when he learned that his farm had been invaded by retired General Solomon Mujuru, a former commander of the Zimbabwe Defence Forces and top ZANU-PF figure in the province.\n\nEfforts to move their assets like tractors and vehicles went in vain, Watson-Smith said, as the invaders allowed only his wife to take their personal belongings, like photographs and furniture, from the house before leaving.\n\nEven the courts offered little protection.\n\nThough Watson-Smith won a High Court ruling to reclaim his assets, Mujurus thugs chased away the sheriff sent to enforce the order.\n\nWatson-Smith and his family were lucky to escape their farm unharmed. But they were still afraid. On December 21, 2001, they fled through the Beitbridge border post to South Africa, later moving to France to start a new life.\n\nBefore the farm invasions, Zimbabwe produced enough to feed itself and for exports to Southern Africa and Europe. Agriculture was the backbone of the economy, employing much of the countrys workforce. Some Black Zimbabweans had also risen to the top, managing farms.\n\nInitially, Mugabes land expropriation programme was meant to redistribute land to disadvantaged Black Zimbabweans to boost equity and agricultural development.\n\nBut under the cover of correcting colonial injustices, powerful officials seized productive farms from both white and Black farmers.\n\nKondozi Estates in eastern Zimbabwe was one of the farms seized by senior ZANU-PF figures in 2004.\n\nThe land in Manicaland province was co-owned by Black Zimbabwean Edwin Moyo and the white de Klerk family.\n\nAt the time, it was a vital exporter of fresh produce, particularly high-quality beans, gooseberries, corn, mangetout and sugar snaps to European retailers like Tesco and Sainsburys.\n\nIt employed hundreds in Mutare, and its destruction was a death blow to the local economy.\n\nThe same pattern repeated itself on other farms, locals say, with Black owners without strong ties to the ZANU-PF continuing to face evictions.\n\nIn 2021, human rights defender and lawyer Siphosami Malunga lost his farm to ZANU-PF secretary-general Obert Mpofu.\n\nThough Zimbabwes lower courts later ruled in his favour and he is back on his farm awaiting a High Court decision, the battle over its ownership rages on.\n\nLand reform was necessary, 53-year-old Malunga told Al Jazeera.\n\nThe colonial project dispossessed Blacks, pushing them on to barren land while whites took the best farms. But the way reform was handled enriched the elite while leaving ordinary Zimbabweans with nothing.\n\nMugabe once campaigned for a one man, one farm policy. Yet his allies ignored it. Even his wife, Grace Mugabe, amassed at least 15 farms.\n\nMost of the beneficiaries of the FTLRP were ZANU-PF loyalists, experts note.\n\nRejoice Ngwenya, a political analyst based in Harare, said Mugabes land reform was not about Black empowerment.\n\nIt had motives: firstly, to pacify war veterans that were agitating for more recognition; secondly, to punish white commercial farmers who were supporting the opposition. The man was insecure, he told Al Jazeera.\n\nIf you promise to not expropriate Black-owned farms, you should not touch Moyo or Malungas farms. But ZANU-PF does not care, he remarked.\n\nVivid Gwede, another Harare-based political analyst, said land ownership has been used as a tool to punish disloyalty or reward loyalty to the governing party.\n\nOn account of politics, some Black farmers have had their land invaded, he said.\n\nUnlike white commercial farmers who spent decades learning the land, most of the ZANU-PF-aligned farmers who took over had no farming experience.\n\nThe new owners were people who had spent most of their lives in the bush fighting against white colonialists, experts note, while many Black farm workers who had experience managing white-owned farms did not benefit from land reclamations.\n\nAs a result of the chaotic and violent invasions, knowledge of agricultural practices was also not passed on.\n\nSoon, the Southern African nation with a once-thriving agricultural economy began to face a food crisis, later compounded by climate change.\n\nFor years, many Zimbabweans have depended on food aid from donors like the United Nations World Food Programme. In April 2024, the government declared a national disaster as a severe El Nino-induced drought left more than half of Zimbabwes 15.1 million people facing hunger.\n\nThe crisis exposed the countrys collapsed agricultural sector. Before land seizures, white commercial farmers and Black farmers like Moyo had irrigation schemes to mitigate droughts. ZANU-PF dismantled these systems, leaving the country vulnerable.\n\nZimbabwes collapse in agricultural productivity stems not just from poor planning, but from a deeper culture of impunity, experts say.\n\nAcross the country, though court orders were issued to stop farm invasions and evictions of white commercial farmers, these were ignored. Since 2000, former farmers have filed hundreds of legal cases, trying to reclaim their assets, with little success.\n\nThe 2013 constitution promised compensation, but only for farm improvements, not the land itself.\n\nWhen Emmerson Mnangagwa took power in a 2017 military coup, he inherited a shattered economy, abandoned and poorly managed farms, food shortages, and soaring unemployment.\n\nDesperate for solutions, he reached a $3.5bn compensation deal with white farmers in 2020, hoping to mend relations with the West and lift US economic sanctions imposed in 2001. But the plan stalled.\n\nIn October 2024, the government set aside $20m to compensate a handful of foreign white farmers from Denmark, Switzerland, the Netherlands and Germany whose investments were affected by the land reform programme.\n\nThis month, Finance Minister Mthuli Ncube announced that the government had paid $3.1m to white former farmers who lost land during Zimbabwes land reform.\n\nHowever, the Compensation Steering Committee (CSC), a domestic body representing white farmers, criticised the compensation as a token gesture andrejectedthe deal, saying it wants negotiations instead.\n\nWere willing to talk, but they [the government] are not talking to us, Ian McKersie, chairman of the CSC told Al Jazeera.\n\nIn response, Nick Mangwana, permanent secretary in Zimbabwes Ministry of Information, told Al Jazeera there are factions among the white farmers. If they speak, they are speaking for themselves, they do not represent the mainstream, he said. It is preposterous [to reject the deal]. It does not make sense.\n\nMangwana also denied that there are ongoing land seizures, such as the case of Malunga, whose farm was taken in 2021. These are just disputes  It is not a land invasion. There is no land invasion in Zimbabwe, he said.\n\nNow in France, Watson-Smith runs a real estate business.\n\nBut back in Zimbabwe, his once-productive Alamein Farm has fallen into disuse; its land is now less vibrant than it used to be.\n\nAfter General Mujuru, who was one of Zimbabwes most feared men, seized Watson-Smiths farm, he turned it into a hunting ground. Following Mujurus death in 2011, his wife, former Vice President Joice Mujuru, kept the land but struggled to maintain it.\n\nMeanwhile, Kondozi Estates, the major part-Black owned farm taken by ZANU-PF elites, also fell into decay. A visit this year revealed abandoned equipment and overgrown fields.\n\nAcross the country, seized farms remain untended.\n\nDuring the land reform, farmers were given long-term leases. But banks refused to recognise these leases as collateral, making it impossible for farmers to secure loans.\n\nIn late 2024, President Mnangagwa ordered the Ministry of Lands to stop issuing permits and leases in favour of title deeds. But experts warn this is problematic as it does not address the land dispute between resettled farmers and dispossessed white commercial farmers.\n\nIf the government issues title deeds on land already under existing historic title deeds, its unlawful, Willie Spies, a lawyer assisting dispossessed Zimbabweans, told Al Jazeera.\n\nA legitimate process requires compensating former farmers fairly before transferring ownership.\n\nNew farmers have already benefitted from state subsidies, including a 2007 mechanisation programme that distributed tractors and harvesters without repayment.\n\nZimbabwes debt now stands at $21bn, according to the World Bank  $13bn owed to international creditors and $8bn in domestic debt. Some of the domestic debt is a result of the agricultural subsidies, which ended up benefitting political elites and not the poor rural farmers.\n\nCorruption runs deep, said Malunga, who is still awaiting a final court decision about ownership of his farm.\n\nAgricultural subsidy programmes were hijacked by the elite, enabling grand corruption and theft of billions, he said.\n\nWhile title deeds could offer land security to the new farm owners, he warned: This risks creating a privileged Black landowning class.\n\nWatson-Smith notes that although title deeds helped farmers like him by open[ing] the doors to credit for irrigation, dams and every farm improvement, giving title deeds to new farm owners without addressing past injustices is meaningless.\n\nIt might impress Zimbabwean banks, but international lenders wont recognise stolen property, he said.\n\nOnce the backbone of Zimbabwes economy, agriculture is now crippled by corruption, mismanagement and political greed, farmers say.\n\nMeanwhile, the scars of the land grabs remain, both for displaced former farmers and a nation still grappling with the fallout.\n\nAs many white farmers live in self-exile abroad, many common Black farmers are in limbo, facing off against senior politicians in the battle for land ownership.\n\nFor now, Malunga is back on his farm, growing tomatoes and other crops. But he remains unsettled.\n\nPending the decision of the High Court, we are in occupation, he said, knowing his future is uncertain until the judge decides.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23205535/Guy-Watson-Smith-in-is-faram-in-Zimbabwe.-Courtesy-of-Guy-Watson-Smith.-1745393189.webp",
            "description": "<p>By Farai Matiashe, Al Jazeera Harare, Zimbabwe – Guy Watson-Smith felt hurt and betrayed when his 5,000-hectare (12,355-acre) farm in Beatrice, in Zimbabwe’s Mashonaland East province, was violently invaded by three armed men in the early 2000s. The then-51-year-old white commercial farmer was not just losing his land; he was leaving behind hundreds of workers and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/white-and-black-farmers-still-bear-the-scars-of-zimbabwes-land-grabs/\">White and black farmers still bear the scars of Zimbabwe’s land grabs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Local governments erase traditional — and legally protected — land grants in Zimbabwe",
            "url": "https://www.newzimbabwe.com/local-governments-erase-traditional-and-legally-protected-land-grants-in-zimbabwe/",
            "content": "By Linda Mujuru, GPJ Zimbabwe and Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nGOROMONZI DISTRICT, ZIMBABWE  Darlington Mutakura struggled with the Goromonzi districts housing system for almost 20 years. With a dream of owning a house someday in this semi-urban area near Harare, he faithfully paid his US$13 annual fee on the Rural District Councils waiting list for a decade after moving to the area in 2007.\n\nFinally, hope came, not from the council but his sister. She had long ago acquired some land from traditional leaders in her village in the area, about a half-hours drive east of Harare. From that, she carved out a portion for him.\n\nIn 2017, Mutakura built a small two-room cottage on the land and at last thought that he wouldnt have to pay rent anymore.\n\nBut five years later, council officials slapped him with an official letter: Notice to reorganise the illegal settlement and payment of penalty fees.\n\nMutakura wasnt the only resident to receive this letter. The council letter threatened to demolish structures and relocate households for what it called proper planning of the area. The council considered Mutakura and others who obtained land through the traditional system to be illegal settlers.\n\nThe traditional method of land acquisition, like Mutakuras, is deeply woven into Zimbabwes rural traditions, and protected by law. Still, he and others were each charged a penalty of US$1,500. Some village heads, including Christopher Tafirenyika, warned their villagers not to pay the penalties because the council had not engaged village leaders and it was unclear what the money was for.\n\nThat warning rang true for Mutakura, who ended up paying the fine but still doesnt know whether hell be able to stay on the land that he says he acquired legally.\n\nIt doesnt make sense to pay a 1,500-dollar fine and still own nothing, he says.\n\nAs the region transitions from rural to urban, traditional land distribution systems face increasing pressure, creating conflicts over land ownership. Steep penalties like those imposed in the Goromonzi region come to communities already struggling with increasing economic instability.\n\nA US$1,500 fine is beyond the reach of many who live in this area. According to thelatest available data,the average monthly household income in rural Zimbabwe in 2024 was US$88, a drop from US$116 in 2023.\n\nEven if a settlement is deemed illegal, a national law sets the penalty at US$300 or up to a year in jail. Nowhere does it authorize a US$1,500 charge.\n\nA delicate balance\n\nAcross rural Africa,land traditionallypasses through inheritance, customary allocations, or local purchase, and these processes have been led by traditional village leaders.\n\nLand is not individually owned, but held collectively according to traditional practices and lineage, with access regulated by the communitys customary rule, says Dzikamai Bere, national director of Zimbabwe Human Rights Association.\n\nAccording to the 1998 Traditional Leaders Act, chiefs and headmen oversee settlement rights and are also responsible for admitting new settlers in the areas they manage. Additionally, all land allocation and subdivision should be done with the approval of the village head.\n\nTraditional leaders have always had the main authority to distribute land, following customary rules while working with the local government council. The council officially grants land use rights but  under the Communal Lands Act that codifies these unwritten rules  the government body must work with traditional leaders and respect local customs.\n\nThis delicate balance between tradition and government once ruled rural land rights in Zimbabwe.\n\n[In the 1980s], the village court would meet and find a place for someone who needed land. Wed take the matter to the chief, discuss it with other men in the village, make sure we respected land boundaries, and then register with the rural district council under the chiefs instruction, says Tafirenyika.\n\nBut around theearly 2000s,Tafirenyika says he watched this system begin to crumble. Land management in Zimbabwe underwent significant changes due to the governments fast-track land reform program, which aimed to redistribute land from white commercial farmers to black Zimbabweans, particularly those living in communal areas managed by traditional leaders.\n\nTafirenyika says the Rural District Council now allocates land in Goromonzi, and traditional leaders are powerless  even though the laws that allow people to obtain land through the traditional route have not changed.\n\nMirriam Kwenda, 70, inherited her land from family. After her husband died, the soil fed her three children. Now its vanishing before her eyes. She says that part of what was her farmland is now subdivided into housing that the council is selling.\n\nNow the council pegged all the land, and I dont know which one is mine, she says.\n\nAnd Mutakura worries about whether hell have anything to leave for his children.\n\nWe are living a borrowed life, a life of fear, he says.\n\nLinda Mujuruis a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGamuchirai Masiyiwais a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23201751/02_GPJNews_Zim_GM_HousingLand_-182.jpg_Web.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe and Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal. GOROMONZI DISTRICT, ZIMBABWE — Darlington Mutakura struggled with the Goromonzi district’s housing system for almost 20 years. With a dream of owning a house someday in this semi-urban area near Harare, he faithfully paid his US$13</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/local-governments-erase-traditional-and-legally-protected-land-grants-in-zimbabwe/\">Local governments erase traditional — and legally protected — land grants in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Disgraced police officers caught receiving bribe to spend more time in custody",
            "url": "https://www.newzimbabwe.com/disgraced-police-officers-caught-receiving-bribe-to-spend-more-time-in-custody/",
            "content": "By Staff Reporter\n\nTWO Zimbabwe Republic Police (ZRP) officers who were caught on camera receiving a bribe last week have been remanded in custody awaiting a bail hearing.\n\nRudo Chirengendure and Nyasha Mupandira, were allegedly captured on video collectinga bribe in the Harare Central Business District\n\nTheduo appeared before Harare magistrate Marewanazvo Gofa, charged with criminal abuse of duty as public officers.\n\nIt is theStates case that the two ZRP officers were deployed at Parkade Rank, situated at the intersection of Nelson Mandela Street and Rezende Street, to patrol and arrest illegal money changers, touts, and illegal vendors.\n\nWhile in the line of duty, the two were caught on camera receiving money from a member of the public.\n\nThe state submittedthat the accused violated their duties as public officials.\n\nWhilst in the exercise of their duties, Accused One and Accused Two were captured on camera receiving money as consideration to release a suspect who had been arrested and was in handcuffs.\n\nThe two accused persons then removed handcuffs from a female suspect and released her, which is contrary to their duties as public officers, the court heard.\n\nChirengendure and Mupandira will be back in court on April 28. Lancelot Mutsokoti is representing the State.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter TWO Zimbabwe Republic Police (ZRP) officers who were caught on camera receiving a bribe last week have been remanded in custody awaiting a bail hearing. Rudo Chirengendure and Nyasha Mupandira, were allegedly captured on video collecting a bribe in the Harare Central Business District The duo appeared before Harare magistrate Marewanazvo Gofa, charged with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/disgraced-police-officers-caught-receiving-bribe-to-spend-more-time-in-custody/\">Disgraced police officers caught receiving bribe to spend more time in custody </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        },
        {
            "title": "Nigerian national faces four counts of forging spousal documents",
            "url": "https://www.newzimbabwe.com/nigerian-national-faces-four-counts-of-forging-spousal-documents/",
            "content": "By Staff Reporter\n\nA NIGERIAN national, Kelechi Godwin (52), is facing four counts of fraud for allegedly forging spousal support letters to secure Zimbabwean spousal residence permits between 2009 and 2014.\n\nAccording to the State, Godwin submitted fraudulent documents purporting to be from his wife, Patience Godwin, who had been outside the country since 2008.\n\nIn one of the counts, he allegedly presented another woman as his wife during an immigration interview to deceive authorities. The false submissions led to the issuance of multiple residence permits, prejudicing the Immigration Departments integrity and administration.\n\nAccused person was last week granted US$400 bail on condition that he resides at his stated address, refrains from interfering with witnesses, and reports twice a week to Bulawayo Central Police Station.\n\nThe matter was remanded April 30, 2025 for routine hearing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23203620/document-forgery.jpg",
            "description": "<p>By Staff Reporter A NIGERIAN national, Kelechi Godwin (52), is facing four counts of fraud for allegedly forging spousal support letters to secure Zimbabwean spousal residence permits between 2009 and 2014. According to the State, Godwin submitted fraudulent documents purporting to be from his wife, Patience Godwin, who had been outside the country since 2008.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-national-faces-four-counts-of-forging-spousal-documents/\">Nigerian national faces four counts of forging spousal documents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "24 Apr 2025"
        }
    ]
}