{
    "news": [
        {
            "title": "ZIFA elections: Barred presidential aspirants challenge disqualification",
            "url": "https://www.newzimbabwe.com/zifa-elections-barred-presidential-aspirants-challenge-disqualification/",
            "content": "By Darlington Gatsi\n\nBARRED Zimbabwe Football Association (ZIFA) presidential aspirants are contesting the decision of the associations ethics committee to disqualify them from participating in the upcoming elections.\n\nFour candidates were disqualified by ZIFA after failing to meet the eligibilitycriteria to contest in the upcoming January 25 elections.\n\nCleric Walter Magaya, former Zimbabwe captain Benjani Mwaruwari, CAPS United owner Farai Jere and Temba Mliswa are notable figures who failed to pass the eligibility test.\n\nHowever, ZIFA has not yet disclosed specific reasons for thedisqualification of the quartet.\n\nThis has become a bone of contention with Mwaruwari through his lawyer Dumisani Mthombeni challenging ZIFA as to why he could not pass the credibility hurdle.\n\nOur client has noted with grave concern that his name does not appear on the list referred to above notwithstanding the fact that he strongly feels that he is suitably qualified and meets the criteria to stand for election in the forthcoming elections as ZIFA president.\n\nOur client is perturbed by the fact that he was not formally served with any letter stating the full reasons why your committee has by interpretation of the omission of his name on your published list, declared him to be not suitable to contest to hold office as ZIFA president, read the letter by Mthombeni.\n\nMthombeni further said the decision by ZIFA was prejudicial to Mwaruwari.\n\nThis is a gross procedural error as it prejudices our client who stands to suffer immense and irreparable prejudice. With due respect, our client as it stands, does not know the reasons why your committee concluded that he has failed to meet the eligibility criteria stipulated in the ZIFA statutes, 2024 before making your announcement and publishing the final list of candidates, read the letter.\n\nThe barring of the four candidates has left Nqobile Magwizi, Twine Phiri, Marshal Gore, Philemon Machana, Martin Kweza and Makwinje Phiri contesting for the presidency.\n\nAccording to the ZIFA statutes, the barred candidates have the option to seek remedy from the Court of Arbitrationfor Sports (CAS) in Switzerland.\n\nOutgoing Castle Lager Premier Soccer League (PSL) chairperson Farai Jere has also demanded answers from ZIFA.\n\nI hold high and esteemed offices and do not want my name to be sullied by misconceptions that I do not have 5 0 levels. I therefore kindly ask for a detailed explanation of the considerations that led to this outcome. I would appreciate receiving this information at your earliest convenience, preferably before Christmas, said Jere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/03194605/benjani.jpeg",
            "description": "<p>By Darlington Gatsi BARRED Zimbabwe Football Association (ZIFA) presidential aspirants are contesting the decision of the association’s ethics committee to disqualify them from participating in the upcoming elections. Four candidates were disqualified by ZIFA after failing to meet the eligibility criteria to contest in the upcoming January 25 elections. Cleric Walter Magaya, former Zimbabwe captain Benjani</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-elections-barred-presidential-aspirants-challenge-disqualification/\">ZIFA elections: Barred presidential aspirants challenge disqualification </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "I acted out of character – Madam Boss apologises after calling Mai Titi a pathetic liar",
            "url": "https://www.newzimbabwe.com/i-acted-out-of-character-madam-boss-apologises-after-calling-mai-titi-a-pathetic-liar/",
            "content": "By Staff Reporter\n\nPOPULAR socialite and comedienne Madam Boss has apologised to fellow comedienne Mai Titi after she lashed out, calling her a pathetic liar.\n\nMadam Bosss outburst followed Mai Titis liveFacebookvideoin which sheclaimed that the house Madam Boss had shared on social media was merely an HD photo of a plan and not an actual house.\n\nAn HD image of the house shared by Madam Boss\n\nResponding to some comments on social media that claimed shewas just jealous and hurt,Mai Titi said her rival should focus on building the house first instead of boasting about an HD image of the design.\n\nA word exchange ensued with Madam Boss calling her a pathetic liar who believes her own lies.\n\nIn a statement released, on Tuesday, Madam Boss expressed regret for her comments, admitting that she had acted out of character.\n\nAfter careful reflection on my reactions yesterday, I have come to realize that I acted out of character through my comments. I am a strong advocate for womens empowerment and upliftment, and I would never want to be part of anything that diminishes the value of another woman in society.\n\nAs a mother of two beautiful girls, I aspire to raise them in a culture that supports and nurtures their potential as young women. Therefore, I profusely apologize to Mai Titi if I may have offended her in the process.\n\nI deeply celebrate her and the position she holds in our great society. She is an inspiration and a source of strength to many, the statement reads.\n\nThe cyber feud between the two comedians has been ongoing intermittently for several years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/06035612/Boss-Madam.png",
            "description": "<p>By Staff Reporter POPULAR socialite and comedienne Madam Boss has apologised to fellow comedienne Mai Titi after she lashed out, calling her a “pathetic liar”. Madam Boss’s outburst followed Mai Titi’s live Facebook video in which she claimed that the house Madam Boss had shared on social media was merely an HD photo of a plan and not an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-acted-out-of-character-madam-boss-apologises-after-calling-mai-titi-a-pathetic-liar/\">I acted out of character – Madam Boss apologises after calling Mai Titi a pathetic liar</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "Women urged to fight for their rights, take up leadership roles",
            "url": "https://www.newzimbabwe.com/women-urged-to-fight-for-their-rights-take-up-leadership-roles/",
            "content": "By Staff Reporter\n\nA volunteer with the Institute of Young Women Development (IYWD), Onai Nyahunzvi has called on women to amplify their voices regarding issues that infringe upon their rights and to take on leadership roles within their communities to ensure equal representation on matters affecting them.\n\nNyahunzvi was speaking to this publication on the sidelines of IYWDs Local Government Learning and Exchanging Lab, which was recently held in Harare.\n\nThis event served as a follow-up to a training program for local leaders from Mashonaland Central, East, and Midlands provinces, designed to enhance their knowledge and skills to positively impact the delivery of gender-sensitive and youth-friendly social services through Transformative Leadership Training.\n\nNyahunzvi said that many women, particularly in rural communities, often encounter obstacles in traditional settings, relegating them to the roles of spectators even in issues that directly concern them.\n\nWomen should learn to speak up and when they do so, they should be heard.\n\nWhat we are pushing for as IYWD, in communities, is to mobilise and teach women that they should participate and aim for inclusion in decision-making platforms working together with the Local government.\n\nThey should be involved in budget consultation and anything for development; we urge them to take positions so that when womens issues arise, they will be fully represented.\n\nThis is because women bear the brunt of socio-economic challenges more compared to their male counterparts, she asserted.\n\nNyahunzvi highlighted that it remains a challenge in many rural settings where women are regarded as inferior. When they voice their concerns, they often face derogatory labels that suppress their voices.\n\nOur word of encouragement is that they should not be deterred. They should defend their rights as difficult as it might.\n\nWe are happy that we now have women who now hold titles previously reserved for men, she noted.\n\nIYWD is a young feminist organisation dedicated to amplifying the voices and experiences of young women in marginalized communities.\n\nThe organisation is committed to mobilising and empowering young women by enhancing their capacity to participate and contribute to holistic and gender-responsive community development.\n\nSince its inception in 2009, IYWD has successfully engaged with marginalised young women and girls, who have grown aware of their roles in community development and local governance, advocating for gender-responsive social service delivery in alignment with constitutional mandates for citizen engagement in local governance.\n\nWe do this work through engaging authentically with the Government of Zimbabwe, independent commissions, corporations, traditional chiefs, religious leaders, family, and with each other.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/24055154/WhatsApp-Image-2024-12-24-at-07.50.11-e1735019536592.jpeg",
            "description": "<p>By Staff Reporter A volunteer with the Institute of Young Women Development (IYWD), Onai Nyahunzvi has called on women to amplify their voices regarding issues that infringe upon their rights and to take on leadership roles within their communities to ensure equal representation on matters affecting them. Nyahunzvi was speaking to this publication on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/women-urged-to-fight-for-their-rights-take-up-leadership-roles/\">Women urged to fight for their rights, take up leadership roles  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "High Court Judges advocate for expansion of magistrates’ sentencing jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-judges-advocate-for-expansion-of-magistrates-sentencing-jurisdiction/",
            "content": "By Mary Taruvinga\n\nHigh Court judges Justices Esther Muremba and Deputy Judge President Garainesu Mawadze have urged the legislature to broaden the sentencing jurisdiction of regional magistrates so they can impose sentences that more accurately reflect the severity of the offences they adjudicate.\n\nCurrently, magistrates sentencing powers are limited to just 12 years, despite their handling of serious and complex criminal cases.\n\nUnder the new sentencing guidelines, robbery offences committed under aggravating circumstances carry a presumptive penalty of 20 years imprisonment.\n\nThis is significantly higher than the 12-year cap imposed on regional magistrates for such offences, as outlined in section 51(2)(b)(ii) of the Magistrates Court Act [Chapter 7:10].\n\nWhen the presumptive penalty surpasses the limits of magistrate jurisdiction, cases must be referred to higher courts that can impose appropriate sentences.\n\nThis call to action from the judges was prompted by the case of armed robbers Israel Mufure (22) and Charles Murinda (55), who terrorised a school in Norton by robbing five teachers in a dramatic style using a pellet gun to intimidate their victims.\n\nBoth individuals faced charges and were convicted of five counts of robbery and one count of unlawful entry into premises. They each received a 10-year prison sentence for the first five robbery counts, which were consolidated for sentencing purposes, and another 10 years for the sixth count.\n\nJustice Muremba expressed concern that the sentence was excessively lenient, given the nature of the offence.\n\nI have reservations regarding the sentence for the first to fifth counts, which I find to be unduly lenient considering the aggravating circumstances under which the robberies were committed, said Muremba.\n\nShe went on to explain how she had queried the regional magistrate about the 10-year sentence for multiple counts of robbery committed under aggravating circumstances.\n\nWhen I queried the learned regional magistrate about the 10-year sentence for five counts of robbery committed under aggravating circumstances, given the presumptive penalty of 20 years imprisonment for one count, she replied that her jurisdiction in robbery cases is limited to 12 years under section 51(3) of the Magistrates Court Act [Chapter 7:10], Muremba noted.\n\nMuremba indicated that the magistrate did not elaborate on her reasoning or clarify why she considered 12 years to be the normal range for a sentence in light of the higher presumptive penalty detailed in the guidelines.\n\nThe regional magistrate handling this matter should have been aware of this when sentencing the accused.\n\nShe should have acknowledged in her sentencing judgment that the presumptive penalty exceeded her jurisdictional limits and explained her approach to sentencing the accused in light of this discrepancy.\n\nMurembasaidthe belief that the maximum sentencing jurisdiction reflects the normal sentencing range raises significant concerns.\n\nWhile adhering to jurisdictional limits is necessary, this view may indicate a disconnect from the sentencing guidelines, which suggest a presumptive penalty of 20 years. It appears the learned regional magistrate has not fully embraced or given due weight to the new sentencing framework, the judgesaid.\n\nShe pointed out that regional magistrates predominantly handle robbery cases with aggravating circumstances.\n\nTherefore, it is crucial that their sentencing jurisdiction be expanded to ensure that they can adequately and efficiently impose sentences that reflect the severity of these offences.\n\nMuremba highlighted that current alternatives to extending magistrates sentencing jurisdiction are often cumbersome, unclear, and may lack rationality depending on the circumstances.\n\nBy increasing the sentencing powers of magistrates, we can streamline the judicial process, reduce delays, and ensure that justice is served in a timely and fair manner, she stated.\n\nBoth Muremba and Mawadze asserted that this modification would foster consistency and uniformity in sentencing, ultimately bolstering public trust in the judicial system.\n\nI urge the legislature to consider this judgment and prioritise the necessary amendments to the Magistrates Court Act.\n\nAligning magistrates sentencing jurisdictions with the presumptive penalties will not only facilitate more effective sentencing but will also uphold the principles of justice and equity in our legal system.\n\nMuremba concluded that Referring such cases for sentencing to the High Court is a cumbersome process that delays the finalisation of these matters.\n\nThe court learned that Mufure and Murinda targeted five teachers at a primary school in the Norton farming area.\n\nThe two men had knocked on doors, forced the teachers to comply using a pellet gun, and stripped them of their belongings.\n\nSome victims were confined in their rooms during the ordeal.\n\nFollowing the robbery, they broke into the headmasters office and stole property valued at US$1,800.00, of which US$1,000.00 was recovered upon their arrest.\n\nAfter committing the crimes in Norton, the defendants hired a vehicle and travelled to Gokwe with the stolen items, where the recovered property was eventually located.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga High Court judges Justices Esther Muremba and Deputy Judge President Garainesu Mawadze have urged the legislature to broaden the sentencing jurisdiction of regional magistrates so they can impose sentences that more accurately reflect the severity of the offences they adjudicate. Currently, magistrates’ sentencing powers are limited to just 12 years, despite their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-judges-advocate-for-expansion-of-magistrates-sentencing-jurisdiction/\">High Court Judges advocate for expansion of magistrates’ sentencing jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "ZIFA Ethics Committee is corrupt, ‘money has been thrown around’- says Mliswa, vows to challenge disqualification from presidential race",
            "url": "https://www.newzimbabwe.com/zifa-ethics-committee-is-corrupt-money-has-been-thrown-around-says-mliswa-vows-to-challenge-disqualification-from-presidential-race/",
            "content": "By Staff Reporter\n\nTemba Mliswa who was disqualified from the ZIFA presidency race after failing an integrity test has claimed the Ethics Committee is compromised and vowed to challenge the decision.\n\nZIFA on Monday announced the list of candidates who will run in the January 25 elections following a two-week evaluation of their suitability.\n\nMliswa, former Warriors captain Benjani Mwaruwari, and football administrators Farai Jere and Walter Magaya were ruled out by the Integrity Commission.\n\nZIFAs regulations demand candidates to be free from pending civil, criminal, or disciplinary proceedings or investigations.\n\nNqobile Magwizi, Marshall Gore, Philemon Machana, Twine Phiri, Makwinje Phiri and Martin Kweza arethe remaining contenders for the ZIFA presidency.\n\nReacting to his disqualification, Mliswa said the ZIFAs constitution was flawed.\n\nIf it is true that this is what the Ethics Committee came up with, we have a right to challenge it and we shall challenge it.\n\nWe will ensure that the right things are done and I have no doubt that the laws of this country will protect the citizens and the right thing will come out of it. That constitution is flawed and it can be challenged left, right and centre.\n\nThe whole process of the constitution to get to that point can be challenged too. There are many things and so the ace card is yet to be played, he said.\n\nHe further accused the Ethics Committee of being corrupt adding that the Sports Recreation Commission (SRC) had made it clear that Magwizi will be ZIFA president.\n\nThere is a lot of money which has been spent, money which has been thrown around.\n\nAn Ethics Committee which is supposed to be ethical has become corrupt. I would not want to say much, but the Sports Recreation Commission (SRC) was very clear that it wanted Magwizi. I have inside information pertaining to that.\n\nHe was their blue-eyed boy, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/31000914/Temba-Mliswa.jpg",
            "description": "<p>By Staff Reporter Temba Mliswa who was disqualified from the ZIFA presidency race after failing an integrity test has claimed the Ethics Committee is compromised and vowed to challenge the decision. ZIFA on Monday announced the list of candidates who will run in the January 25 elections following a two-week evaluation of their suitability. Mliswa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-ethics-committee-is-corrupt-money-has-been-thrown-around-says-mliswa-vows-to-challenge-disqualification-from-presidential-race/\">ZIFA Ethics Committee is corrupt, ‘money has been thrown around’- says Mliswa, vows to challenge disqualification from presidential race</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "Zimbabwe’s power crisis a result of poor planning – says opposition shadow minister",
            "url": "https://www.newzimbabwe.com/zimbabwes-power-crisis-a-result-of-poor-planning-says-opposition-shadow-minister/",
            "content": "By Alois Vinga\n\nThe Citizens Coalition for Change (CCC) shadow Minister of Energy and Power DevelopmentLeslie Mhangwahas criticizedthe government for the current power outages,saying they areman-made, a result of poor planning.\n\nHis comments fly in the face of authorities who claim the outages were triggered by the El Nino-induced drought which has seen water levels at the hydroelectric-powered Kariba Dam depleting, forcing the nation to resort to load shedding.\n\nBut speaking to Open Parly recently, the Chinhoyi MP slammed authorities for the incessant power cuts arguing the country is not producing enough energy.\n\nI quizzed the Energy Minister for an explanation over the gap of what is being produced and demanded in our peak region which is about 300 to 400 MW and that should not translate to the prolonged load shedding that we are having.\n\nOrdinarily we have the peak in the mornings and evenings so if your production is constant it means that when the demand gets lower, the gap is narrowed, he said.\n\nLeslie Mhangwa\n\nIn response, the minister referred to the fact that loads that are exempted from load shedding are those that have dedicated feeds in the form of hospitals, critical loads which take a chunk out of what is being produced.\n\nAdded Mhangwa, Our electricity situation, sadly so is much dire, unfortunately from the other side of the government, they described it as subdued.\n\nWhat is needed by the industry and what is needed by the consumers at home we are getting far less than we need. This is not something you can attribute to a Natural Disaster or whats the impression they want to give is that predominantly its because of Kariba.\n\nThis is man-made. This is because of lagging in our planning and implementation of our energy projects.\n\nHowever, some sections of the society have dismissed the Shadow Ministers observations, describing them as cheap politicking contradicting the realities on the ground.\n\nFor instance, Zambia which shares the Kariba Dam has been experiencing acute power outages with consumers enjoying electricity for just three hours a day in a development which begs the question as to whether Zambians have also been bad energy planners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/21021127/Power-Cuts-1.png",
            "description": "<p>By Alois Vinga The Citizens Coalition for Change (CCC) shadow Minister of Energy and Power Development Leslie Mhangwa has criticized the government for the current power outages, saying they are man-made, a result of poor planning. His comments fly in the face of authorities who claim the outages were triggered by the El Nino-induced drought which has seen water levels</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-power-crisis-a-result-of-poor-planning-says-opposition-shadow-minister/\">Zimbabwe’s power crisis a result of poor planning – says opposition shadow minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "Zanu PF using food aid to violate human rights – report",
            "url": "https://www.newzimbabwe.com/zanu-pf-using-food-aid-to-violate-human-rights-report/",
            "content": "By Darlington Gatsi\n\nThe ruling party, Zanu PF, is using food aid to violate the rights of hungry citizens, a recent report from a local watchdog has revealed.\n\nVulnerable citizens are at the mercy of Zanu PF officials who are using food aid as leverage to garner support for the ruling party, particularly in rural areas.\n\nThis was revealed in the Zimbabwe Peace Project (ZPP)s November report which highlighted that Zanu PF officials are politicising the food aid that the government and various partners sponsor.\n\nFood aid and input distribution for the cropping season are being carried out along political lines, discriminating against opposition and non-affiliated citizens despite the governments assurances that the process will not be riddledwith corruption and interference from ZanuPF.\n\nZPP revealed that women have borne the brunt of the food aid discrimination by ZanuPF officials.\n\nThe distribution of aid in Zimbabwe has been marred by rampant discrimination, with the majority of cases being politically motivated. The ruling Zanu PF partys overbearing influence in districts and wards has largely resulted in the unfair allocation of aid, with those perceived to be opposition supporters being denied assistance, read the report.\n\nZimbabwe is currently reeling from drought, induced by the ElNino phenomenon. This year, the phenomenon destroyed crops that many households rely on forsurvival.\n\nIn April, President Emmerson Mnangagwa declared the drought a national disaster paving the way for food assistance.\n\nZPP said ZANU PF officials have been frogmarching community members to attend its party activities or risk losing food assistance.\n\nThe disregard of such constitutional fundamental freedoms is evident in various ways, including forced attendance at party meetings and mandatory allegiance to access food aid.\n\nIn some instances, members are forced to attend and chant party slogans and if they fail to comply they are denied the much-needed food aid and other government-sponsored support for their survival hence many comply grudgingly, read.\n\nRecently a ZANU PF member of parliament Wiriranai Muchemwa and Councillor Knowledge were arrested after stealing 40 tonnes of food aid worth US$12 000.\n\nZPP said the politicisationof food aid is a violation of the constitution.\n\nThe persistence of political discrimination in aid distribution not only undermines the principles of fairness and equality but also perpetuates the marginalization of already vulnerable populations.\n\nIt is essential that the government, through relevant departments such as the Social Welfare and Ministry of Agriculture, take immediate action to address these injustices and ensure that aid is distributed based on need, rather than political affiliation, read the report further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/02055211/WFP-4-scaled.jpg",
            "description": "<p>By Darlington Gatsi The ruling party, Zanu PF, is using food aid to violate the rights of hungry citizens, a recent report from a local watchdog has revealed. Vulnerable citizens are at the mercy of Zanu PF officials who are using food aid as leverage to garner support for the ruling party, particularly in rural</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-using-food-aid-to-violate-human-rights-report/\">Zanu PF using food aid to violate human rights – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "Panic as earth tremors rattle Kariba and Karoi, residents claim river god Nyaminyami manifesting",
            "url": "https://www.newzimbabwe.com/panic-as-earth-tremors-rattle-kariba-and-karoi-residents-claim-river-god-nyaminyami-manifesting/",
            "content": "By Staff Reporter\n\nRESIDENTS of the resort town of Kariba as well as Karoi, situated some 200km away, were plunged into panic mode after they woke up to the rumbling sound of earth tremors this Monday.\n\nSources, who spoke to NewZimbabwe.com, confirmed experiencing unusual ground movement at around 5.39 am this Monday.\n\nI was shocked to be awoken by the sounds of my bedroom window shaking. At first, l thought it was a haulage truck passing by, but l realised it was the ground shaking, said Felisha Mashoko of Nyamhunga township in Kariba.\n\nSome Kariba inhabitants were quick to point to folklore suggesting that the angry spirit of the river god Nyaminyami was manifesting.\n\nSeveral Karoi residents also confirmed the earth tremors.\n\nYes, l heard and felt the earth tremors. The experience was frightening, it was my first time going through such a rare occurrence, said David Hove of Buffalo Downs, Karoi.\n\nAccording to a report by Volcano Discovery, which cites data from the United States Geological Survey (USGS), a moderate magnitude 4.9 earthquake struck approximately 17 km South-Southeast of Kariba, in Mashonaland West Province, early on Monday morning. The quake occurred at a depth of 10km at 05:39 AM (Harare Time) on December 23.\n\nThe earthquake occurred just three days after a magnitude 4.6 quake struck 26 km southeast of the resort town of Kariba.\n\nEarthquakes are common in Kariba, primarily due to a phenomenon known as reservoir-induced seismicity.\n\nThis occurs because the immense weight of the water in the Kariba Dam exerts pressure on the local geological structures.\n\nWhen the dam was filled in the 1960s, it began to induce seismic activity in the region. The water load causes stress on the Earths crust, leading to frequent tremors.\n\nThese tremors are generally of low to moderate magnitude and have not been known to affect the dams structural integrity. However, they can still cause alarm among local residents.\n\nAlso, Earthquaketrack.com reported picking the seismic activity, which was also witnessed in Karoi, situated about 200 kilometres from Harare.\n\nEarthquakes and tremors are both seismic events, but they differ in intensity and impact.\n\nTremors are smaller, less intense seismic events that can be felt, but usually dont cause significant damage. Tremors can be caused by various factors, including minor tectonic activity, human activities like mining or construction, or even volcanic activity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/14164155/kariba-dam-wall.jpg",
            "description": "<p>By Staff Reporter RESIDENTS of the resort town of Kariba as well as Karoi, situated some 200km away, were plunged into panic mode after they woke up to the rumbling sound of earth tremors this Monday. Sources, who spoke to NewZimbabwe.com, confirmed experiencing unusual ground movement at around 5.39 am this Monday. “I was shocked</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/panic-as-earth-tremors-rattle-kariba-and-karoi-residents-claim-river-god-nyaminyami-manifesting/\">Panic as earth tremors rattle Kariba and Karoi, residents claim river god Nyaminyami manifesting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "Mozambique’s Constitutional court confirms ruling Frelimo’s victory in presidential poll",
            "url": "https://www.newzimbabwe.com/mozambiques-constitutional-court-confirms-ruling-frelimos-victory-in-presidential-poll/",
            "content": "Anadolu Agency\n\nMozambiques Constitutional Council on Monday confirmed that Daniel Chapo of the ruling Mozambique Liberation Front (Frelimo) had won the October 9 presidential election.\n\nHowever, the seven-judge bench of the Constitutional Council in its verdict reduced Chapos earlier victory of 71% of the vote to 65%.\n\nMozambique has seen violent protests since late October, when the electoral authority declared 47-year-old Chapo the winner of the Oct. 9 election, with 71% of the cast votes, defeating opposition candidate Venancio Mondlane of the Optimist Party for the Development of Mozambique (Podemos), who received 20%.\n\nMondlane rejected the results, claiming widespread vote rigging and urging his supporters to protest.\n\nThe Constitutional Council was then tasked with acting in the case.\n\nMore than 110 people have been killed since protests erupted on Oct. 21, according to Plataforma Eleitoral Decide, a group that monitors elections in the Southern African country.\n\nRights groups have accused Mozambican security forces of using excessive violence in quelling the protests. Frelimo has ruled Mozambique since it gained independence from Portugal in 1975.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/25052703/frelimo.webp",
            "description": "<p>Anadolu Agency Mozambique’s Constitutional Council on Monday confirmed that Daniel Chapo of the ruling Mozambique Liberation Front (Frelimo) had won the October 9 presidential election. However, the seven-judge bench of the Constitutional Council in its verdict reduced Chapo’s earlier victory of 71% of the vote to 65%. Mozambique has seen violent protests since late October,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambiques-constitutional-court-confirms-ruling-frelimos-victory-in-presidential-poll/\">Mozambique’s Constitutional court confirms ruling Frelimo’s victory in presidential poll</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        },
        {
            "title": "Simphiwe ‘Simz’ Ngema and Tino Chinyani announce baby Kabo’s arrival",
            "url": "https://www.newzimbabwe.com/simphiwe-simz-ngema-and-tino-chinyani-announce-baby-kabos-arrival/",
            "content": "IOL\n\nRenowned local actress, musician and businesswoman Simphiwe Simz Ngemahas welcomed her second child.\n\nThe former Muvhango star and her Zimbabwean model partner Tino Chinyani, took to Instagram in a joint post to announce that the newest member of their family had arrived. 22.11.24, read the caption, indicating that the bundle of joy had arrived on November 22.\n\nThe carousel of pictures shows that the whole family gathered for the birth, including the couples four-year-old son, Tiyani Kemorena Michael Chiyani.\n\nThe joint post, also tagged the newest member of the family, Kabo Chiyani, Ngema had announced her family was expanding in September and shared the bundles name in an Instagram caption,Kaboentle Tinotenda Chinyani.\n\nMany of her friends, and fans took to the comment section to congratulate the family on their newest blessing.\n\nInnosadiki said: Oh man  this is so beautiful. Congratulations  fam. Thank you Lord for a safe delivery. We love you mommy.\n\nSivemabuya said: A beautiful family youve got there. Congratulations once again Simz\n\nMona.monyane said: Congratulations Gorgeous, may God lay his protective hand over all of you\n\nKatlegodankeofficial said: So happy for your family! Congratulations hon blessings!!! And welcome to the new addition to the family. \n\nNgemaand her partner Zimbabwe-born model Chinyani, made headlines in 2020 when they surprised fans with their pregnancy announcement. The couple had kept their romance a secret and Ngema kept her pregnancy under wraps.\n\nIn 2021, they got tongues wagging again when Ngema, in an Instagram post shared how their love story had come to an end.\n\nAn end to a beautiful love story, said Ngema in a caption that was accompanied by a picture of her and Chiyani holding each other on a yacht in Cape Town.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/30123537/simz-tino.png",
            "description": "<p>IOL Renowned local actress, musician and businesswoman Simphiwe ‘Simz’ Ngema has welcomed her second child. The former “Muvhango” star and her Zimbabwean model partner Tino Chinyani, took to Instagram in a joint post to announce that the newest member of their family had arrived. “22.11.24,” read the caption, indicating that the bundle of joy had arrived</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simphiwe-simz-ngema-and-tino-chinyani-announce-baby-kabos-arrival/\">Simphiwe ‘Simz’ Ngema and Tino Chinyani announce baby Kabo’s arrival</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:39",
            "date": "24 Dec 2024"
        }
    ]
}