{
    "news": [
        {
            "title": "Ambitious refugee Tawanda Muyeye is now a star of The Hundred",
            "url": "https://www.newzimbabwe.com/ambitious-refugee-tawanda-muyeye-is-now-a-star-of-the-hundred/",
            "content": "The Voice\n\nAMBITIOUS refugee Tawanda Muyeye is now a star of The Hundred. In early 2021, months before signing his professional contract with Kent Cricket, Tawanda had his right to remain in the United Kingdom approved by the Home Office.\n\nBorn and bred in Zimbabwe, Tawanda moved to England at the age of 17 and attended Eastbourne College on a cricket scholarship, while spending some time with the Sussex Academy.\n\nNow a batter for Kent Cricket and the Oval Invincibles, Tawanda is set to compete at The Hundred, where he will be one of the few Black players at the tournament.\n\nFor me to be a Black player, playing cricket in England, it just shows that there are no boundaries, Tawanda toldThe Voice.\n\nIf you have dreams, you can achieve them. The colour of your skin doesnt matter. Of course, therell be hurdles along the way, but I think being a player of colour and being a representative is quite a big thing because it just shows that anything is possible.\n\nWhile his professional career began in England, Tawandas love for cricket was born in Zimbabwe when he was just a child.\n\nFor me to be a Black player, playing cricket in England, it just shows that there are no boundaries\n\nMy brother was the person who got me into cricket. On the weekends, when hed come back home from boarding school, I would play cricket with him. Thats how it all started.\n\nIn the High School that I attended, theyd just built a high performance cricket centre, which is unheard of in Zimbabwe, unless youre playing for the national team.\n\nThere werent many high performance centres, especially not in schools, so that was a massive thing, and I spent a lot of my time in there.\n\nWhen I moved to England, I think the biggest change was the weather! Goodness, I found that change difficult, even in April, May, it was still quite chilly for a Zimbabwean kid.\n\nTawanda made a big impression during his time at Eastbourne College. His runs led him to be namedWisdensSchools Cricketer of the Year for 2020, and Kent took notice.\n\nKent are a big reason Im where I am today. They had to jump through some hurdles to get me to this point because Im a refugee, and my family are refugees.\n\nThere was a man named Paul Downton, he was the Director of Cricket at Kent, and he went out of his way to help me. Kent gave me the opportunity to grow and develop as a player, and theyve given me the platform to showcase what I can do.\n\nLooking back four years later, Im just very grateful for Kent and everything theyve done for me.\n\nIve just signed a new contract with them, and I want to give them a shoutout because it wasnt easy for them initially, but they made my life easier and treated me like a normal person and welcomed me with open arms.\n\nTawanda has achieved so much already, and it is the 24-year-olds mindset which keeps him moving forward.\n\nFor me, its about striving to be the best that I can be, not comparing myself to others, because I believe comparison is the thief of all joy.\n\nWhen you get into the professional game, it becomes a bit more complex, and the transition isnt easy. However, I think because I have that desire to be the best that I can be, it keeps me going and keeps me motivated to achieve my goals.\n\nMy main aspiration is to play cricket for England, to play as many Test matches as I can for England. However, I dont just want to play for England once, I want to play for a long time and be good enough to achieve that goal.\n\nKent had to jump through some hurdles to get me to this point because Im a refugee, and my family are refugees.\n\nWhile his focus is on cricket, Tawanda hopes he is remembered for so much more than just the sport. When I do finish playing cricket, I hope people remember me as a person first and foremost, because Im a human being. I go through everything that every other human being goes through.\n\nI dont want people to put me on a pedestal, because no one is bigger than anyone or bigger than the sport. If people are to think about me when I finish playing, I just want them to think that I was entertaining, and a fun person to watch.\n\nI just want to be myself, go out there, be free and play with a smile on my face and inspire people to have fun with what theyre doing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/19164854/muyeye.jpg",
            "description": "<p>The Voice AMBITIOUS refugee Tawanda Muyeye is now a star of The Hundred. In early 2021, months before signing his professional contract with Kent Cricket, Tawanda had his right to remain in the United Kingdom approved by the Home Office. Born and bred in Zimbabwe, Tawanda moved to England at the age of 17 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ambitious-refugee-tawanda-muyeye-is-now-a-star-of-the-hundred/\">Ambitious refugee Tawanda Muyeye is now a star of The Hundred</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Aug 2025"
        },
        {
            "title": "Zimbabwe bank payments disrupted by outage that hit Central Bank",
            "url": "https://www.newzimbabwe.com/zimbabwe-bank-payments-disrupted-by-outage-that-hit-central-bank/",
            "content": "Bloomberg\n\nZimbabwean banks reported widespread disruption to a widely-used payment channel, after the central bank experienced a network problem that it is trying to fix.\n\nLenders including theCentral African Building Society Ltd., the nations largest mortgage lender and a unit of South African insurerOld Mutual Ltd., advised clients Tuesday that the real-time gross settlement platform was down.\n\nTheReserve Bank of Zimbabwe, which said on Monday it was experiencing a technical challenge that could delay some banking services, is working to resolve the issue. Its website was offline all Tuesday, with the official dollar exchange-rate for the local currency, the gold-backed ZiG, unavailable.\n\nLarge retailers and local councils are among those which often rely on the central banks website for a guide on official exchange rates to price their goods and services. The Zimbabwe Stock Exchange is also affected as its unable to settle payments.\n\nLawrence Nyazema, president of the Bankers Association of Zimbabwe, said the main system was down which in turn affected payments across the market, while noting the RBZ had been able to restore some services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/07022039/Reserve-Bank.jpg",
            "description": "<p>Bloomberg Zimbabwean banks reported widespread disruption to a widely-used payment channel, after the central bank experienced a network problem that it is trying to fix. Lender’s including the Central African Building Society Ltd., the nation’s largest mortgage lender and a unit of South African insurer Old Mutual Ltd., advised clients Tuesday that the real-time gross settlement platform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-bank-payments-disrupted-by-outage-that-hit-central-bank/\">Zimbabwe bank payments disrupted by outage that hit Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Aug 2025"
        },
        {
            "title": "Winky D’s ‘Tete-a-tete’ Concert ignites early excitement",
            "url": "https://www.newzimbabwe.com/winky-ds-tete-a-tete-concert-ignites-early-excitement/",
            "content": "By Darlington Gatsi\n\nEXCITEMENT is building ahead of dancehall kingpin Winky Ds much-anticipated concert, scheduled for Alex Sports Club on August 30.\n\nDubbed Tete-a-Tete: The Ghetto Dialogue, the concert will be an intimate conversation between Winky D and his multitude of fans.\n\nAs is always the norm with Winky Ds projects, the concert has attracted significant interest, with some outlets already running out of early-bird tickets.\n\nConcert promoter Patson Chipaz Chimbodza said ticket prices might increase on the day of the show as demand intensifies.\n\nWhat we have done is we have disbursed tickets for phase one to all outlets, and we have disbursed tickets for phase two to all outlets. Those who reported to have run out are probably the phase one, which are US$15 and phase two are US$15. We had a limited number of phase one tickets.\n\nI would advise fans to buy tickets early because on the day of the show, the value will be different from the phase two one, Chimbodza told NewZimbabwe.com.\n\nWinky D, who has become a voice for the socially marginalised, is expected to engage intimately with his fans, tackling social ills, a theme that has endeared him to his supporters in the past.\n\nHowever, the dancehall star has kept fans in suspense over whether he will release a new album.\n\nHis last album, Eureka Eureka, released in 2023, was laden with social commentary, which ruffled the social and political elites.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/16133707/winky-5-scaled.jpg",
            "description": "<p>By Darlington Gatsi EXCITEMENT is building ahead of dancehall kingpin Winky D’s much-anticipated concert, scheduled for Alex Sports Club on August 30. Dubbed “Tete-a-Tete: The Ghetto Dialogue”, the concert will be an intimate conversation between Winky D and his multitude of fans. As is always the norm with Winky D’s projects, the concert has attracted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/winky-ds-tete-a-tete-concert-ignites-early-excitement/\">Winky D’s ‘Tete-a-tete’ Concert ignites early excitement </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Aug 2025"
        },
        {
            "title": "Rogue cop Mandizvidza languishes in jail as bail hearing is delayed",
            "url": "https://www.newzimbabwe.com/rogue-cop-mandizvidza-languishes-in-jail-as-bail-hearing-is-delayed/",
            "content": "By Mary Taruvinga\n\nA Zimbabwe Republic Police (ZRP) officer who made headlines last week after claiming that he was taking over from the current Commissioner General will continue to languish behind bars after his bail hearing was further delayed.\n\nSimbarashe Mandizvidza was remanded to this Wednesday after the lawyer he hired asked for time to prepare for the hearing.\n\nMandizvidza initially appeared in court last Friday and his case was moved to August 18 after he requested legal representation.\n\nThe cop is charged with causing disaffection among the police, procuring the use of a motor vehicle by fraud, and transmitting false data messages intending to cause harm.\n\nHe was arrested after he allegedly declared himself the new police chief in a YouTube video, ordering all Chinese nationals to leave the country within 48 hours, and fraudulently acquiring a police vehicle.\n\nThe officer is stationed at Police General Headquarters Salaries Services Bureau Liaison Office.\n\nThe State alleges that on 13 August 2025, Mandizvidza used his Canon 250D camera at his official residence in Hatfield Police Camp to record a video, later uploaded to his YouTube channel Gondo Harishaye, in which he claimed to have taken over command of the Zimbabwe Republic Police and announced that all Chinese nationals residing and doing business in Zimbabwe must leave within 48 hours.\n\nHe also declared that the ZRP Traffic Section was temporarily disbanded. Authorities say the pronouncements were false, unlawful, and intended to cause psychological harm to foreign nationals and economic damage to Zimbabwe.\n\nLater the same day, Mandizvidza allegedly misled Chief Inspector Fidios Chiteure into believing he had been authorised by a senior commissioner to use a Ford Ranger, registration number ZRP 1033R.\n\nThe vehicle was driven to Waerera village in Bindura, where it was later recovered.\n\nOn 14 August 2025, the accused allegedly uploaded another video repeating his claim to be the ZRP commander, this time naming Commissioner General Stephen Mutamba  the actual police chief  in what the State says was a deliberate bid to sow disaffection among serving officers.\n\nThe state is opposing bail.\n\nIn his affidavit, the Investigation Officer Edmore Nyazamba opposed bail, warning that Mandizvidzas release would undermine and jeopardise the objectives and proper functioning of the criminal justice system.\n\nHe said the magnitude of the sentence likely to be passed upon conviction will induce him to abscond.\n\nThe sense of peace and security of foreign investors in Zimbabwe will be undermined and prejudiced by the release of the accused.\n\nNyazamba warned the court that if granted bail, Mandizvidza was highly likely to delete the YouTube account he used, thereby destroying crucial evidence.\n\nVakayi Chikwekwe is presiding over the case while Anesu Chirenje is prosecuting.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/15060709/mandizvidza.jpeg",
            "description": "<p>By Mary Taruvinga A Zimbabwe Republic Police (ZRP) officer who made headlines last week after claiming that he was taking over from the current Commissioner General will continue to languish behind bars after his bail hearing was further delayed. Simbarashe Mandizvidza was remanded to this Wednesday after the lawyer he hired asked for time to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rogue-cop-mandizvidza-languishes-in-jail-as-bail-hearing-is-delayed/\">Rogue cop Mandizvidza languishes in jail as bail hearing is delayed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Aug 2025"
        },
        {
            "title": "US releases incriminating human rights rap sheet on Zimbabwe – says government not doing anything to bring perpetrators to task",
            "url": "https://www.newzimbabwe.com/us-releases-incriminating-human-rights-rap-sheet-on-zimbabwe-says-government-not-doing-anything-to-bring-perpetrators-to-task/",
            "content": "By Leopold Munhende\n\nTHE United States Department of State has released a damning report on Zimbabwes human rights situation, noting how perpetrators have gone unpunished and the increased abuse of journalists by the state.\n\nZimbabwe has, for close to three decades, failed to respect basic human rights, an issue that has put it at loggerheads with world leaders such as America, the United Kingdom (UK) and the rest of Europe.\n\nCases of state-sponsored abductions, violence and targeting of dissenting voices, mainly opposition politicians, human rights defenders and journalists, have dominated its record.\n\nThe report in question focuses on the year 2024.\n\nThere were no significant changes in the human rights situation in Zimbabwe during the year, reads the report.\n\nSignificant human rights issues included credible reports of: torture or cruel, inhuman, or degrading treatment or punishment; arbitrary arrest and detention; serious restrictions on freedom of expression and media freedom, including violence or threats of violence against journalists and censorship; trafficking in persons, including forced labor; significant restrictions on workers freedom of association; and significant presence of the worst forms of child labor.\n\nThe government did not take credible steps to identify and punish officials who committed human rights abuses.\n\nAlthough the absence of extrajudicial killings was noted, this can be best explained by the fact that 2024 was not an elective year, as was witnessed in 2023 when the country headed for local authority, parliamentary and presidential elections.\n\nFreedom of speech was, however, heavily inhibited according to the report, which was released just months after journalist Blessed Mhlanga was released from pretrial detention.\n\nAdds the report: Authorities were sensitive to criticism of the government, security officials, the president, and the ruling Zanu PF party.\n\nIn July 2023, the government amended the criminal code to introduce heavy penalties for citizens at home and abroad and permanent residents convicted of willfully injuring the sovereignty and national interest of Zimbabwe.\n\nCivil society organisations and human rights defenders reported the law continued to have a chilling effect on freedom of expression.\n\nZimbabwes poor record has been a major stumbling block for President Emmerson Mnangagwa in his attempts to re-engage with the West.\n\nHe is widely considered tainted, having not just been late President Robert Mugabes right-hand man for decades until his deposition, but having also played a central role in the Gukurahundi genocide that killed more than 20,000 mainly Ndebele-speaking people.\n\nThe government regularly used arbitrary arrest and detention as tools of intimidation and harassment, especially against opposition party members, political activists, civil society members, journalists, attorneys, and ordinary citizens asserting their rights, it reads.\n\nThe government launched a crackdown on government critics in the lead-up to the Southern Africa Development Community (SADC) Summit on August 17 in Harare. In June, police arrested 80 opposition activists after violently breaking up their meeting at a private residence.\n\nCivil servants poor working conditions were also noted, with failed attempts at dialogue illustrated by arrests of not just Zimbabwe National Students Union (ZINASU) leaders but also Amalgamated Rural Teachers Union (ARTUZ) officials.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/04155842/mnangagwa1.jpg",
            "description": "<p>By Leopold Munhende THE United States Department of State has released a damning report on Zimbabwe’s human rights situation, noting how perpetrators have gone unpunished and the increased abuse of journalists by the state. Zimbabwe has, for close to three decades, failed to respect basic human rights, an issue that has put it at loggerheads</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-releases-incriminating-human-rights-rap-sheet-on-zimbabwe-says-government-not-doing-anything-to-bring-perpetrators-to-task/\">US releases incriminating human rights rap sheet on Zimbabwe – says government not doing anything to bring perpetrators to task</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Aug 2025"
        },
        {
            "title": "Elite school locks horns with Chinese firm over cement plant near campus, blasts EMA for dubious approval despite health risks",
            "url": "https://www.newzimbabwe.com/elite-school-locks-horns-with-chinese-firm-over-cement-plant-near-campus-blasts-ema-for-dubious-approval-despite-health-risks/",
            "content": "By Mary Taruvinga\n\nA bitter showdown has erupted between Bryden Country School in Chegutu and Chinese-owned Shuntai Cement, after the company pushed ahead with building a lime and cement factory just 497 metres from the schools boundary despite a High Court order to stop operations.\n\nThe elite school accuses Shuntai of endangering pupils health with toxic dust, noxious fumes and noise pollution, while cornering the Environmental Management Agency (EMA) for issuing an Environmental and Social Impact Assessment (ESIA) certificate that allegedly ignored glaring health and zoning violations.\n\nIn a letter addressed to parents dated August 16 2025 gleaned by NewZimbabwe.com, it has emerged that on March 25, the High Court ordered Shuntai to suspend any activities at its Eastbourne, Chegutu site.\n\nTheChinesecompany pressed on with construction, including blasting and heavy machinery works, which parents say have already exposed children to hazardous dust and fumes.\n\nFrustrated, Bryden took Shuntai back to court, accusing the company of contempt of court.\n\nAlso, on 25 July, a High Court judge visited the site to determine for himself if Shuntai was in contempt of the first stop order.\n\nHis ruling in the current High Court order confirms this.\n\nThe school has also dragged EMA to court, accusing the regulator of rubber-stamping Shuntais ESIA report despite clear evidence that the project sits in an education zone with multiple institutions nearby, including Springs of Grace, Seventh Day Adventist Secondary School and a university.\n\nIn the letter to parents, Brydens chairperson of governors, A. Noor, said EMA only released the ESIA after a court order, but it was the same flawed report initially rejected.\n\nShuntai managed to wangle an ESIA certificate from EMA, suggesting they had addressed stakeholder concerns, of which they had not, Noor said.\n\nThe school has now appealed to parents to stand firm as the legal battle escalates.\n\nWe are not yet out of the woods as Shuntai is determined to proceed even against the ruling of the High Court of Zimbabwe, Noor warned. Forty-three years ago, parents came together to build this school, and today we are appealing for parents to stand united to defend it.\n\nThe dispute now awaits a decisive hearing before the Administrative Court and the Minister of Environment, but with construction still underway, Bryden says children remain at risk.\n\nIn the meantime, massive building has continued on site, and the school has been experiencing increased dust influx as well as fumes from burning of noxious material, as well as noise of heavy machinery and some blasting mainly experienced on the pool side of the school.\n\nThus, the school was compelled to go back to court to reinforce the first stop order, Noor said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18175033/bryden-scaled.png",
            "description": "<p>By Mary Taruvinga A bitter showdown has erupted between Bryden Country School in Chegutu and Chinese-owned Shuntai Cement, after the company pushed ahead with building a lime and cement factory just 497 metres from the school’s boundary despite a High Court order to stop operations. The elite school accuses Shuntai of endangering pupils’ health with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elite-school-locks-horns-with-chinese-firm-over-cement-plant-near-campus-blasts-ema-for-dubious-approval-despite-health-risks/\">Elite school locks horns with Chinese firm over cement plant near campus, blasts EMA for dubious approval despite health risks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "20 Aug 2025"
        }
    ]
}