{
    "news": [
        {
            "title": "Never side with oppressors whose hands drip blood –  MMA star shreds Mnangagwa, blames ‘scarf’ for 28 seconds defeat",
            "url": "https://www.newzimbabwe.com/never-side-with-oppressors-whose-hands-drip-blood-mma-star-shreds-mnangagwa-blames-scarf-for-28-seconds-defeat/",
            "content": "By Staff Reporter\n\nMIXED Martial Arts (MMA) fighter Themba The Answer Gorimbo has taken aim at President Emmerson Mnangagwa, accusing him of overseeing an oppressive government.\n\nIn a recent outburst, Gorimbo launched into a tirade against President Mnangagwa, whom he met in 2021 when he was the Extreme Fighting Championship (EFC) heavyweight champion.\n\nGorimbo accused those close to Mnangagwa of corruption, claiming they demanded a bribe for facilitating his meeting with the Zanu PF leader at the State House.\n\nI left Zimbabwe in 2009 for South Africa. I have never worked in Zimbabwe once. Ndakaita garden boy ku Cape Town (handina hangu kubira McMillan family) ndikashanda nesimba mu sport yangu.\n\nNdakashinga kusvika ndaita champion. Then zvikanzi huya uone mukuru wenyika after vaona pic ndina Rama. Ndaenda muface akainda neni aitodawo something (mutonyoro), said Gorimboin now-deleted social media posts.\n\nGorimbo blamed his meeting with President Mnangagwa for his subsequent misfortunes in the octagon.\n\nMunyama wandakaita next fight. Dislocated my shoulder 28 seconds into the fight. Apa ndakapiwa ma scarf kuti ndipfeke. From that day ndakaziva usafa wakainda same side nevanhu vane ropa mumaoko avo iwe une zodzo (kwete ra Dhuterere rekunyepa izvo iye achigamuchira zvokuba nekushaya, kuita zvekutengerwa marriage nemunhu akatorambawo mukadzi wake, he added.\n\nGorimbo is no stranger to criticising the government, having previously clashed with former Minister of Sports, Arts and Culture Kirsty Coventry after she ignored his pleas to include the national flag on his fighting kit.\n\nHe labelled Coventry the worst Sports Minister Zimbabwe has ever had.\n\nPresident Mnangagwa is the latest target of Gorimbos criticism, with the fighter also mocking him for commissioning minor development projects.\n\nLast month, Mnangagwa officially opened the US$88 million Trabablas Interchange.\n\nImagine kubata vanhu face muchiti roundabout what what, kutoiita official ceremony kuhvura road even flying helicopters and wasting state funds to go open roundabout.\n\nMu South Africa umo Rama angasimuka kuinda Pitori kundo opener road? said Gorimbo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25043728/gorimbo.jpg",
            "description": "<p>By Staff Reporter MIXED Martial Arts (MMA) fighter Themba “The Answer” Gorimbo has taken aim at President Emmerson Mnangagwa, accusing him of overseeing an oppressive government. In a recent outburst, Gorimbo launched into a tirade against President Mnangagwa, whom he met in 2021 when he was the Extreme Fighting Championship (EFC) heavyweight champion. Gorimbo accused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/never-side-with-oppressors-whose-hands-drip-blood-mma-star-shreds-mnangagwa-blames-scarf-for-28-seconds-defeat/\">Never side with oppressors whose hands drip blood –  MMA star shreds Mnangagwa, blames ‘scarf’ for 28 seconds defeat </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "25 Jun 2025"
        },
        {
            "title": "Zimbabwe ‘amped’ to test themselves against world champion Proteas",
            "url": "https://www.newzimbabwe.com/zimbabwe-amped-to-test-themselves-against-world-champion-proteas/",
            "content": "SABC Sport\n\nZimbabwe head coach Justin Sammons says his team is looking forward to testing themselves against world champions South Africa in the two-match Test series thats gets underway in Bulawayo on Saturday.\n\nThe Proteas arrive in Zimbabwe having beaten Australia in the World Test Championship final at Lords earlier this month, breaking an ICC trophy drought that spanned for 27 years.\n\nZimbabwe have already been in camp preparing for the challenge of their African neighbours and Sammons says the players are eager to rise to the occasion.\n\nTheres a real buzz around the squad. I think theyre very excited. Im super excited for the challenge that lies ahead and the guys are amped for it, Sammons said.\n\nTheyre looking forward to testing themselves and showing what theyre capable of. I think they really want to make a statement over the next couple of weeks.\n\nThe home sides preparations has been to focus on building intensity and volume while ensuring all fundamentals are being addressed before shifting to specific tactical planning.\n\nDespite the demanding sessions, Sammons said the players had responded with enthusiasm and purpose.\n\nHe added: Right now, its more about making sure were covering all our bases . . . its more around the volume, and then we get a little bit more specific as we head closer to the Test.\n\nThe attitude is good. Its always good. We can never fault the attitude. Theyre always wanting to get the most out of each other and improve as much as they can, and again, theyve shown that over the last few days.\n\nThe second and final Test of series will also be played at the Queens Sports Club in Bulawayo from 6 July before the teams move to Harare for a T20I tri-series that will also feature New Zealand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24134258/justin-sammons16_1206x678.webp",
            "description": "<p>SABC Sport Zimbabwe head coach Justin Sammons says his team is looking forward to testing themselves against world champions South Africa in the two-match Test series thats gets underway in Bulawayo on Saturday. The Proteas arrive in Zimbabwe having beaten Australia in the World Test Championship final at Lord’s earlier this month, breaking an ICC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-amped-to-test-themselves-against-world-champion-proteas/\">Zimbabwe ‘amped’ to test themselves against world champion Proteas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "25 Jun 2025"
        },
        {
            "title": "Case against ‘abusive’ guardians stalls as victim is transported to Zimbabwe",
            "url": "https://www.newzimbabwe.com/case-against-abusive-guardians-stalls-as-victim-is-transported-to-zimbabwe/",
            "content": "The Citizen\n\nA child abuse case has stalled after the alleged perpetrators, the guardians of a Grade 5 learner from Skeen Primary School, reportedly took her to Zimbabwe, leaving police struggling to gather evidence.\n\nThe family violence, child protection, and sexual offenses commander confirmed that the child was taken out of South Africa before critical evidence could be obtained. The learners statement was not yet obtained and she had not been taken to a doctor. The learner must be taken to the doctor to prove the case.\n\nThe investigating officer said he suspects the accused guardians took the child to Zimbabwe to kill the case. This was corroborated by Skeen Primary School deputy principal Masilo Lebeya, who revealed that the guardians took the child away swiftly, in the wake of allegations of abuse, and ahead of her June examinations, without informing the school. We only learned of her whereabouts when a social worker contacted one of the suspects, who admitted taking her to Zimbabwe, Lebeya said, adding that the school subsequently opened a case of abuse at the Sandringham Police Station.\n\nWhen asked if there were early, telltale signs that the victim was being abused, Lebeya said they were only seen at a later stage, and that the process of counselling the victim was only initiated when they confirmed that she had a family problem. Remember, we are dealing with a lot of children here. You might find that, by the time a teacher notices that she needs to intervene, it is a bit late. It shows that the child has been suffering in silence, he noted, further emphasising that the school has a strong support system and they have always encouraged children to share their problems.\n\nMatheba said they are trying to get the accused guardians to co-operate. He stressed that, without it, the police will not be able to build a case. Matheba said if they do not co-operate, the police will have to work with home affairs immigration authorities to verify the victims legal status in South Africa. If she was here illegally, then we would have to involve authorities on that side, to get her a passport so that she can be transported back to South Africa, and that will be a long process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/24133706/women-abuse-1.jpg",
            "description": "<p>The Citizen A Grade 5 learner from Skeen Primary School, allegedly abused by her guardians, has been secretly taken to Zimbabwe, and without critical evidence, such as her medical report or statement, the suspects remain free. A child abuse case has stalled after the alleged perpetrators, the guardians of a Grade 5 learner from Skeen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/case-against-abusive-guardians-stalls-as-victim-is-transported-to-zimbabwe/\">Case against ‘abusive’ guardians stalls as victim is transported to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "25 Jun 2025"
        },
        {
            "title": "Mutasa lands Uni Africa Regional presidency",
            "url": "https://www.newzimbabwe.com/mutasa-lands-uni-africa-regional-presidency/",
            "content": "By Alois Vinga\n\nTHE Uni Africa Region has appointed trade unionist Peter Mutasa as president of the continents Finance and Insurance Trade Unions.\n\nMutasawas unanimously nominated at the global labour organs 6th Uni Global Union Africa Conference in Maputo, Mozambique.\n\nThe event is running under the theme Consolidate Working Class Power.\n\nUnder his new role, Mutasa will lead the team in proffering the best labour practices for the continents finance-related trade Unions. Africa Finance is a structure of the Uni Global Union which boasts an estimated 20 million members. Each continent is known as a Region with different industrial sectors like Finance and Engineering forming structures under the international labour organ.\n\nIn his acceptance speech, Mutasa vowed to leave no stone unturned in securing the best labour standards for the Continents Finance sector.\n\nAfrican Finance workers are facing many challenges that require strong unions to address. These include massive retrenchments due to digitalisation and AI, as well as poor working conditions. We have come up with a clear plan of action that will guide our agenda for the next four years, he said.\n\nThe incoming Uni Africa Region Finance President has a long history, which kicked off when he was a labour activist and Workers Committee member at Standard Chartered Bank, Zimbabwe.\n\nHe rose through the ranks of one of the countrys highly organised labour unions, the Zimbabwe Banks and Allied Workers Union (ZIBAWU), to his current position of General Secretary.\n\nMutasa served as President of the Zimbabwe Congress of Trade Unions (ZCTU) between 2016 and 2021 andis the current chairperson of the Crisis In Zimbabwe Coalition ( CiZC).\n\nMutasa holds a Masters in Public Policy and is currently pursuing a PhD.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/07040019/ZCTU-Peter-Mutasa-addressing-delegates-1.jpg",
            "description": "<p>By Alois Vinga THE Uni Africa Region has appointed trade unionist Peter Mutasa as president of the continent’s Finance and Insurance Trade Unions. Mutasa was unanimously nominated at the global labour organ’s 6th Uni Global Union Africa Conference in Maputo, Mozambique. The event is running under the theme “Consolidate Working Class Power.” Under his new role,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutasa-lands-uni-africa-regional-presidency/\">Mutasa lands Uni Africa Regional presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "25 Jun 2025"
        }
    ]
}