{
    "news": [
        {
            "title": "UNIFREIGHT Africa reports 231% revenue growth in first half of 2025",
            "url": "https://www.newzimbabwe.com/unifreight-africa-reports-231-revenue-growth-in-first-half-of-2025/",
            "content": "By Alois Vinga\n\nUNIFREIGHT Africa has posted strong revenue and profit growth for the six months to 30 June 2025, buoyed by expanding cross-border operations and increased trade flows along the Beira corridor.\n\nGroup revenue surged 231.6% year-on-year to ZWG545.5 million, up from ZWG164.5 million in the same period last year. EBITDA rose 139.9% to ZWG100.9 million, while profit before tax increased 154% to ZWG51.6 million. Net profit after tax more than doubled to ZWG202.4 million from ZWG90.4 million, aided by a ZWG150.7 million income tax credit.\n\nDespite the topline growth, margins came under pressure. The EBITDA margin slipped to 18.5% from 25.6%, while the net profit margin declined to 37.1% from 54.9%, largely due to higher operating costs and the one-off tax credit. Operating expenses rose 237% year-on-year.\n\nOn the balance sheet, total assets fell 10.3% to ZWG1.35 billion, mainly reflecting a reduction in vehicles and equipment. Retained earnings grew 66.3% to ZWG507.7 million, while borrowings eased 3% to ZWG144.8 million. However, finance costs spiked nearly 395% in the wake of elevated interest rates.\n\nLiquidity also weakened during the period. Cash holdings dropped 65.5% to ZWG14.5 million, with operating activities posting a net outflow of ZWG5.8 million compared to an inflow of ZWG57.5 million last year. Financing outflows of ZWG32.6 million were recorded, linked to debt repayments, leases, and fleet investment.\n\nBasic earnings per share rose 153.6% to 194.53 cents, while headline EPS more than doubled to 194.43 cents.\n\nManagement said the performance reflects the benefits of its regional growth strategy but cautioned that cost pressures and working capital constraints remain significant challenges as the company prepares for fleet expansion ahead of the 2026 tobacco season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03015012/Unifreight-Africa-which-operates-well-known-logistics-brands-including-Swift-Skynet-and-Bulwark-has-not-been-immune-to-these-challenges-Picture-Supplied.webp",
            "description": "<p>By Alois Vinga UNIFREIGHT Africa has posted strong revenue and profit growth for the six months to 30 June 2025, buoyed by expanding cross-border operations and increased trade flows along the Beira corridor. Group revenue surged 231.6% year-on-year to ZWG545.5 million, up from ZWG164.5 million in the same period last year. EBITDA rose 139.9% to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unifreight-africa-reports-231-revenue-growth-in-first-half-of-2025/\">UNIFREIGHT Africa reports 231% revenue growth in first half of 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "02 Oct 2025"
        },
        {
            "title": "Violent clashes and arrests as ‘Gen Z protests’ hit Morocco",
            "url": "https://www.newzimbabwe.com/violent-clashes-and-arrests-as-gen-z-protests-hit-morocco/",
            "content": "BBC\n\nViolent clashes have erupted between protesters and security forces in Morocco, as youth-led demonstrations continued for a fourth day.\n\nHundreds marched through the streets across Morocco on Tuesday night, demanding better social services and less corruption.\n\nProtesters hurled stones at security forces, according to local media reports, while footage shows cars and banks being set alight.\n\nThe Moroccan Association for Human Rights (AMDH) has accused security forces of physically assaulting protesters and carrying out arbitrary arrests.\n\nIn the city of Oujda, a protester suffered injuries after he was hit by a police car, reports state news agency MAP.\n\nThe demonstrations were organised on social media by a loosely formed youth group that calls itself GenZ 212.\n\nThe group expressed regret over acts of rioting or vandalism that affected public or private property, in a statement posted on its Facebook page late on Tuesday.\n\nIt also urged participants to remain peaceful and avoid any behaviour that could undermine the legitimacy of our just demands.\n\nThe protesters have been chanting slogans calling for improved health and education services, along with better employment opportunities.\n\nSeveral have also criticised the money spent on building stadiums for the 2030 Fifa World Cup. One sign carried during a demonstration in the capital, Rabat, read: At least the Fifa stadium will have a first aid kit! Our hospitals dont.\n\nThe uprising follows similar youth-led, large scale demonstrations this summer in Nepal, Indonesia, the Philippines and Madagascar.\n\nThe uprising in Nepal led to the prime minister resigning, whileMadagascars president dissolved his government on Mondayin an attempt to placate the protesters there.\n\nDozens of protesters have been arrested in Morocco, according to the AMDH, but most have since been released. It said that 37 youngsters were on bail, pending investigations.\n\nThe government coalition issued a statement on Tuesday expressing willingness to engage in dialogue with the youth within institutions and public spaces to find realistic solutions.\n\nIt also praised what it called the balanced reaction of security authorities in line with relevant legal procedures.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02055249/morocco.webp",
            "description": "<p>BBC Violent clashes have erupted between protesters and security forces in Morocco, as youth-led demonstrations continued for a fourth day. Hundreds marched through the streets across Morocco on Tuesday night, demanding better social services and less corruption. Protesters hurled stones at security forces, according to local media reports, while footage shows cars and banks being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/violent-clashes-and-arrests-as-gen-z-protests-hit-morocco/\">Violent clashes and arrests as ‘Gen Z protests’ hit Morocco</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "02 Oct 2025"
        },
        {
            "title": "Thando Ngwenya on target as Amazulu hold Kaizer Chiefs",
            "url": "https://www.newzimbabwe.com/thando-ngwenya-on-target-as-amazulu-hold-kaizer-chiefs/",
            "content": "By Sports Reporter\n\nWarriors striker Thandolwenkosi Ngwenya was on target for Amazulu in their 1-1 draw against Kaizer Chiefs in the Betway Premiership on Wednesday evening.\n\nNgwenya opened the scoring in the 21st minute to give Usuthu the lead, but their advantage lasted only 11 minutes before Mduduzi Shabalala equalised for Chiefs in the 32nd minute.\n\nThe strike marked Ngwenyas fourth goal of the season, as the 22-year-old continues to impress in his debut campaign in South Africa after joining Amazulu in July.\n\nHe previously netted eight goals for FC Platinum in the current Zimbabwe Premier Soccer League season before making the switch to the Durban-based outfit.\n\nWith the FIFA international break approaching, Ngwenya is expected to play a key role for the Warriors when they face South Africa in a crucial World Cup Qualifier. He is among the 23-man squad recently named by coach Michael Nees.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02054441/thando-ngwenya.jpg",
            "description": "<p>By Sports Reporter Warriors striker Thandolwenkosi Ngwenya was on target for Amazulu in their 1-1 draw against Kaizer Chiefs in the Betway Premiership on Wednesday evening. Ngwenya opened the scoring in the 21st minute to give Usuthu the lead, but their advantage lasted only 11 minutes before Mduduzi Shabalala equalised for Chiefs in the 32nd</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/thando-ngwenya-on-target-as-amazulu-hold-kaizer-chiefs/\">Thando Ngwenya on target as Amazulu hold Kaizer Chiefs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "02 Oct 2025"
        },
        {
            "title": "International Day of Non-Violence: Day irrelevant under Zimbabwe’s repressive climate",
            "url": "https://www.newzimbabwe.com/international-day-of-non-violence-day-irrelevant-under-zimbabwes-repressive-climate/",
            "content": "By Staff Reporter\n\nA human rights defender has dismissed the International Day of Non-Violence as meaningless in Zimbabwe, arguing that violence remains a tool to silence dissenting voices.\n\nOctober 2 marks the International Day of Non-Violence, observed annually on the birthday of Mahatma Gandhi, the late leader of Indias independence movement and champion of the philosophy.\n\nBut Tawanda Matangambiri told NewZimbabwe.com the global commemoration holds little weight in Zimbabwe, where state and political actors routinely deploy violence to stifle alternative views.\n\nHuman Rights Defender Tawanda Matangambiri\n\nViolence, Matangambiri says, is threatening the enjoyment of a democratic and peaceful society.\n\nActivists are jailed for expressing themselves. Our democracy is in intensive care. In this situation, many people feel they cannot breathe and yearn for ways to raise their voices without resorting to violence, said Matangambiri.\n\nHe quoted the words of United Nations (UN) Secretary-General Antnio Guterres, In these dangerous and divided times, let us find the strength to follow his lead, end the suffering, advance diplomacy, heal divisions, and create a just, sustainable and peaceful world for all.\n\nZimbabweans, Matangambiri added, must observe the ideals of this commemoration.\n\nThis day is dedicated to promoting the message of non-violence, with an emphasis on education and raising public awareness. Mahatma Gandhi and Martin Luther King Jr are two good examples of non-violent practitioners, who led non-violent protests such as Gandhis Salt March and Kings Birmingham Bus Boycott, respectively, against colonial Britain and the segregation era America.\n\nLocally, in Zimbabwe, we have found a number of cases where opposition members and political activists have been incarcerated, physically harassed, abducted, tortured and even killed for expressing themselves.\n\nThe pre-election environment has been one of the most violent times in Zimbabwe, having posed many obstacles for the political opposition. Zanu PF supporters have engaged in widespread harassment, threats, acts of violence, preventing opposition parties from staging rallies, mobilising, campaigning, and associating with supporters across the country, said Matangambiri.\n\nRegrettably, instead of preserving peace, the Zimbabwe Republic Police (ZRP) has allegedly been complicit in fanning divisions and violence, he further noted.\n\nThe police in Zimbabwe have selectively used the Maintenance of Peace and Order Act of 2019 to deny the opposition permission to hold meetings and campaign rallies, while allowing Zanu PF to meet without hindrance.\n\nMatangambiri argued that President Emmerson Mnangagwas regime had captured the government, the police, the army, courts and other public institutions, which are being weaponised to silence critics.\n\nHe feels there is a need for maturity across the political divide.\n\nZimbabwe does not need another liberation struggle to realise the sanctity of human dignity and the respect for fundamental human rights. It needs all of us to mature in the advancement of the values of peace, human rights, and democracy.\n\nWithout government commitment to respecting democratic values, and citizen commitment to democratic participation, the ideals of non-violence lose their value as the society slides into authoritarianism.\n\nOur last hope as Zimbabweans is to unite and stage a non-violent revolution against tyranny. Let us be instruments of peace and non-violence. In the words of Mahatma Gandhi There are many causes that I am prepared to die for but no causes that I am prepared to kill for, Matangambiri told NewZimbabwe.com.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02053440/international-day-of-non-violence.png",
            "description": "<p>By Staff Reporter A human rights defender has dismissed the International Day of Non-Violence as meaningless in Zimbabwe, arguing that violence remains a tool to silence dissenting voices. October 2 marks the International Day of Non-Violence, observed annually on the birthday of Mahatma Gandhi, the late leader of India’s independence movement and champion of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/international-day-of-non-violence-day-irrelevant-under-zimbabwes-repressive-climate/\">International Day of Non-Violence: Day irrelevant under Zimbabwe’s repressive climate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "02 Oct 2025"
        }
    ]
}