{
    "news": [
        {
            "title": "War veterans win legal battle for Spring Farm against Billy Rautenbach",
            "url": "https://www.newzimbabwe.com/war-veterans-win-legal-battle-for-spring-farm-against-billy-rautenbach/",
            "content": "By Mary Taruvinga\n\nIn a dramatic turn of events, war veterans from Spring Farm in Goromonzi have emerged victorious in a court case concerning the contentious loss of their land to businessman Billy Rautenbach. This followed the governments cancellation of their offer letters.\n\nSeeking justice, the veterans turned to the High Court after Rautenbach, a business associate of President Emmerson Mnangagwa, assumed control of the land. The courtroom erupted in joy when Judge Regis Dembure of the Harare High Court handed down the ruling on Thursday.\n\nThe judge was critical of Lands Minister Anxious Masuka, chastising him for his irrational and inconsiderate decision to cancel the veterans offer letters. Although the ministry had initially challenged the veterans application, Masuka failed to submit an opposing affidavit, a significant misstep that ultimately led to the cases outcome.\n\nThe court heard that the minister had delegated authority to the permanent secretary, a move that Dembure rejected outright. Striking off the permanent secretarys affidavit, the judge declared that the veterans legal arguments stood unopposed, leading to their victory.\n\nI wish to point out that the law in relation to authority to act is already settled that where authority has been challenged, it will be necessary to produce evidence, said Judge Dembure.\n\nHe emphasised the importance of substantiating claims regarding authority in court.\n\nThe judge added, What is clear is that where the authority of a defendant is put on issue, there will be a need to put evidence of that authority in court. He dismissed the permanent secretarys mere assertion of authority, saying, There is no evidence before me to show that he has authority.\n\nDembure further explained, The act of withdrawal of the offer letter is by the minister and cannot be delegated. The decision is his and he must justify his action.\n\nThe judge also said that the minister is expected by law to make decisions independently, stating, No delegated authority can speak on his behalf.\n\nIn his ruling, the judge noted that the minister only has the power to delegate administrative, not statutory, authority.\n\nIf a decision-maker has failed to depose an affidavit, its inadmissible.\n\nThe judge highlighted that the ministers actions had severely disrupted the veterans livelihood.\n\nHe criticised Masuka for not thoughtfully considering the implications of withdrawing the offer letters.\n\nHe is the one who should have told the court if it was a good intention to withdraw the offer letters and what was his state of mind when he formulated these decisions, Dembure said.\n\nIn the absence of his affidavit, the opposition is clearly a nullity. There is no proper opposition before the court.\n\nConsequently, the opposition was struck out, allowing the case to proceed without challenge.\n\nCritics of the allocation of Spring Farm to Rautenbachs Marimba Residential Properties Limited had raised concerns about potential manipulation and corruption surrounding the land seizure in Mashonaland East Province.\n\nWar veterans expressed alarm when it became known that Rautenbach was granted the deed of transfer for the land on June 5, 2025, prior to the court hearing, while indigenous farmers, including the veterans, had their applications still pending in court.\n\nAs if to heighten tensions, armed guards were deployed around the farm last week, further complicating matters ahead of the judicial proceedings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Mary Taruvinga In a dramatic turn of events, war veterans from Spring Farm in Goromonzi have emerged victorious in a court case concerning the contentious loss of their land to businessman Billy Rautenbach. This followed the government’s cancellation of their offer letters. Seeking justice, the veterans turned to the High Court after Rautenbach, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-veterans-win-legal-battle-for-spring-farm-against-billy-rautenbach/\">War veterans win legal battle for Spring Farm against Billy Rautenbach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:47",
            "date": "18 Jul 2025"
        },
        {
            "title": "Smile follows sweat — Zimbabwe achieves record tobacco output",
            "url": "https://www.newzimbabwe.com/smile-follows-sweat-zimbabwe-achieves-record-tobacco-output/",
            "content": "Xinhua\n\nAccording to the Tobacco Industry and Marketing Board (TIMB), the sector is witnessing record-breaking sales this year, with farmers already delivering more than 340 million kg of the golden leaf to the market, a significant hike from about 240 million kg last year.\n\nA warm, earthy scent filled the grading shed as workers carefully sorted tobacco leaves at a farm in Beatrice, a rural area in Zimbabwes Mashonaland East Province.\n\nWith practiced hands, they ensured each golden leaf met the high standards demanded by buyers.\n\nOutside, a truck loaded with tightly packed bales rumbled toward the market, trailing dust along the winding country roads.\n\nIn general, this growing season has been a very good one for most tobacco growers, especially the small-scale farmers. They have done exceptionally well, and overall, everyone has had a better yield per hectare than ever before, said Steve Riley, a tobacco farmer who has invested heavily in the crop, one of Zimbabwes most lucrative exports.\n\nUtilizing both rainfall and irrigation facilities at his farm, Riley successfully cultivated quality tobacco on 34 hectares of land last season. The harvest is now being delivered to the market.\n\nIn Zimbabwe, the tobacco marketing season, running from March to August, is a critical period in the agricultural calendar, given the crops role as one of the countrys top economic drivers and export earners.\n\nFor farmers like Riley, the marketing season is the most anticipated time of year, offering the long-awaited opportunity to reap the rewards of months of hard work and commitment in the fields.\n\nThanks to these sustained efforts, Zimbabwes tobacco output is on the rise, further reinforcing the countrys position as Africas leading tobacco producer.\n\nAccording to the Tobacco Industry and Marketing Board (TIMB), the sector is witnessing record-breaking sales this year, with farmers already delivering more than 340 million kg of the golden leaf to the market, a significant hike from about 240 million kg last year.\n\nThis surge in production is attributed to several factors, including favorable rainfall, increased cultivated land, and a rising number of farmers, especially small-scale producers.\n\nTobacco hectarage expanded from 113,000 hectares in the 2023-2024 season to 125,000 hectares in the 2024-2025 season, according to TIMB. The number of registered growers also rose by 11 percent during the same period, reaching 127,311.\n\nFollowing a successful farming and selling season, Riley is already preparing seedlings for the next planting cycle.\n\nWe dont know what the weather is going to bring us next season. It could be a terrible drought, but we plan as if its going to be a decent season, he said.\n\nChina, one of Zimbabwes key trading partners, remains the largest importer of Zimbabwean tobacco, drawn by its high quality.\n\nOurs, in a nutshell, is a bit like the sugar in a cup of tea. It adds the flavor. And they (the Chinese) need the flavor, and Zimbabwean tobacco seems to be the quality theyre really looking for, said Riley.\n\nAccording to statistics from the Chinese Embassy in Zimbabwe, tobacco exports to China increased by 17.3 percent in 2024.\n\nThe growing demand for Zimbabwean tobacco in international markets has spurred employment and economic activity in rural communities where the crop is cultivated. The government and industry stakeholders are now working to boost production, increase local value addition, and grow exports in the coming seasons.\n\nTacla Munemo, a farm head forewoman, said this season has been productive, and preparations for the next season are already in progress.\n\nWe are expecting another yield like this next season. We have to work hard to achieve another bumper harvest and maintain the quality of the tobacco, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17163510/tobacco-.jpeg",
            "description": "<p>Xinhua According to the Tobacco Industry and Marketing Board (TIMB), the sector is witnessing record-breaking sales this year, with farmers already delivering more than 340 million kg of the golden leaf to the market, a significant hike from about 240 million kg last year. A warm, earthy scent filled the grading shed as workers carefully</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smile-follows-sweat-zimbabwe-achieves-record-tobacco-output/\">Smile follows sweat — Zimbabwe achieves record tobacco output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:47",
            "date": "18 Jul 2025"
        },
        {
            "title": "Low disposable incomes force 15.6% decline of Edgars volumes",
            "url": "https://www.newzimbabwe.com/low-disposable-incomes-force-15-6-decline-of-edgars-volumes/",
            "content": "By Alois Vinga\n\nLOW disposable incomes have forced Edgars Limited volumes to decline by 15.6% confirming the changing priorities by hard-pressed citizens.\n\nPresenting an annual report for the just-ended year, the group bemoaned the pinch exerted by low disposable incomes in the market.\n\nSignificant pressures on disposable incomes resulted in reduced retail volumes. Consumer spending in a tight economic environment, as described, prioritises food security over clothing and footwear.\n\nAs a result, total Group units sold declined by 15,6% from 2.36 million to 1.99 million compared to the same period last year. Revenue decline was contained at 9,1% over the prior year, at USD30.7 million against USD33.7 million in 2023, the group said.\n\nThe company said the operating environment for the year ended 5 January 2025 was characterised by exchange rate volatility and incessant inflationary pressures on the back of liquidity challenges in both the local and foreign currencies, which persisted throughout the year.\n\nThe impact of the El Nio-induced drought in the 2023/2024 agricultural season, the worst in the last 43 years, resulted in below-average agricultural output. That, combined with retrenchments reported across various sectors, especially in retail branches, negatively impacted disposable incomes, resulting in subdued sales volumes during the period, compared to the prior year, the group said.\n\nGoing forward, management intends to right-align business overheads to attain volumes in the context of depressed demand and float flexible credit offerings, which will be maintained to stimulate increased expenditure.\n\nThe Group will continue to expand its geographic footprint through the opening of new stores in strategic locations. A further four Express Stores are targeted for expansion before the close of the FY2025 financial year, added Edgars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/29035436/Edgars-Stores.jpg",
            "description": "<p>By Alois Vinga LOW disposable incomes have forced Edgars Limited volumes to decline by 15.6% confirming the changing priorities by hard-pressed citizens. Presenting an annual report for the just-ended year, the group bemoaned the pinch exerted by low disposable incomes in the market. “Significant pressures on disposable incomes resulted in reduced retail volumes. Consumer spending</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/low-disposable-incomes-force-15-6-decline-of-edgars-volumes/\">Low disposable incomes force 15.6% decline of Edgars volumes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:47",
            "date": "18 Jul 2025"
        },
        {
            "title": "Burkina Faso military ruler abolishes electoral commission",
            "url": "https://www.newzimbabwe.com/burkina-faso-military-ruler-abolishes-electoral-commission/",
            "content": "BBC\n\nBurkina Fasos military rulers have disbanded the countrys electoral commission calling it a waste of money.\n\nThe interior ministry will handle elections in the future, state-run RTB TV reported.\n\nSince seizing power in September 2022, the coup leaders have initiated sweeping reforms, including the postponement of elections which would lead to a return to civilian rule.\n\nA nationwide vote was due last year, but the junta extended the period of transition to democracy until July 2029, allowing leader Capt Ibrahim Traor to remain in power and free to contest the next presidential election.\n\nThe AFP news agency quotes Territorial Administration Minister Emile Zerbo as saying that the electoral commission was subsidised with around $870,000 (650,000) a year.\n\nAbolishing the commission would reinforce our sovereign control on the electoral process and at the same time limit foreign influences, he added.\n\nAfter coming to power three years ago amid criticism that the civilian authorities were failing to deal with a growing Islamist insurgency, the military leaders have rejected the assistance of former colonial power France in favour of Russia.\n\nRights groups have since accused the army of targeting civilians in its attempt to quash the militants, as well as suppressing political activity and the freedom of expression.\n\nThere are also question marks over the effectiveness of the military operation. In the first half of 2025, jihadist group JNIM said it had carried out over 280 attacks in Burkina Faso  double the number for the same period in 2024, according to data verified by the BBC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/17174007/traore.webp",
            "description": "<p>BBC Burkina Faso’s military rulers have disbanded the country’s electoral commission calling it a waste of money. The interior ministry will handle elections in the future, state-run RTB TV reported. Since seizing power in September 2022, the coup leaders have initiated sweeping reforms, including the postponement of elections which would lead to a return to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/burkina-faso-military-ruler-abolishes-electoral-commission/\">Burkina Faso military ruler abolishes electoral commission</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:47",
            "date": "18 Jul 2025"
        },
        {
            "title": "I quit CCC to “teach ED a lesson” – Chamisa",
            "url": "https://www.newzimbabwe.com/i-quit-ccc-to-teach-ed-a-lesson-chamisa/",
            "content": "By Staff Reporter\n\nFormer leader of the Citizens Coalition for Change (CCC), Nelson Chamisa, has revealed that his departure from both the CCC and the Movement for Democratic Change (MDC), was a calculated move aimed at frustrating President Emmerson Mnangagwa, whom he accuses of orchestrating a takeover of the opposition parties.\n\nChamisa resigned as leader of the CCC in January last year, citing the hijacking of his party by Mnangagwa as punishment for his refusal to accept the results of the chaotic August 2023 general elections.\n\nThe fallout from the elections saw Sengezo Tshabangu emerge, seemingly from nowhere, claiming to be the interim Secretary General of the CCC.\n\nTshabangus stated aim was to restore order within the opposition by addressing alleged irregularities in the candidate selection process leading up to the 2023 elections.\n\nTshabangu subsequently initiated a widespread recall of elected representatives, claiming that certain candidates had been improperly selected.\n\nThis led to the unprecedented recall of over 40 MPs and councillors, effectively handing Zanu-PF back the two-thirds parliamentary majority it had failed to secure during the harmonised elections.\n\nChamisas attempts to prevent these recalls, including written appeals to the then Local Government Minister July Moyo and Speaker of the National Assembly Jacob Mudenda, proved futile. The courts upheld the recalls, leaving Chamisa with no option but to step aside.\n\nIn a Facebook post on Thursday, Chamisa confirmed that his decision to leave the CCC was motivated by a desire to spite Mnangagwa.\n\nThe best decision I ever made in my leadership journey was to walk away from MDC & CCC. You will thank me later. I had to break the cycle of going in circles. And that was my best way to teach ED a lesson!, Chamisa declared.\n\nThis was not Chamisas first departure from a major political entity. He had previously walked away from the Movement for Democratic Change (MDC) after a Supreme Court ruling questioned the legitimacy of his assumption of the party leadership following the death of Morgan Tsvangirai.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/15180623/Mnangagwa-Chamisa.jpg",
            "description": "<p>By Staff Reporter Former leader of the Citizens Coalition for Change (CCC), Nelson Chamisa, has revealed that his departure from both the CCC and the Movement for Democratic Change (MDC), was a calculated move aimed at frustrating President Emmerson Mnangagwa, whom he accuses of orchestrating a takeover of the opposition parties. Chamisa resigned as leader</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-quit-ccc-to-teach-ed-a-lesson-chamisa/\">I quit CCC to “teach ED a lesson” – Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:47",
            "date": "18 Jul 2025"
        }
    ]
}