{
    "news": [
        {
            "title": "Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says",
            "url": "https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/",
            "content": "By Alois Vinga\n\nA total 49,2% of Zimbabwes youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed.\n\nThe stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET category. Females are the worst affected with 57, 4% compared to 40,4% men under the bracket.\n\nThe worst affected province during the period was Mashonaland Central with a rate of 58, 1% followed by Matabeleland North at 53, 8% and Matabeleland South at 52,4%. Bulawayo Province had the lowest rate at 38,5%.\n\nThe data shows that across the provinces, female youths are the worst affected after scoring much higher percentages than their male counterparts. Proportions of youth not in education, employment or training (NEET) for the age group 15-24 years, was 38.5 percent in Bulawayo province and 46.0 percent in Masvingo province.\n\nThe United NationsPopulationFund has since reported that Zimbabwe is likely to miss its opportunity to derive thedemographicdividend(DD) from its youthfulpopulation.\n\nDD  refers to the temporary economic benefits that can arise from a significant increase in that can arise from a significant increase in the ratio of working age adults as a result of rapid fertility decline. The firstdemographic dividendopened before 1990 and reached a peak in 2013 and is now in the diminishing returns phase.\n\nAccording to the report, the expanded Unemployment Rate for the country stood at 37,1% , with youth in the 15 to 24 age band being hardest hit at 58,2% and those between 15 to 35 standing at 46,1%.\n\nThe unemployment rate for Midlands province was 21.8 percent. Female unemployment rate for the province was 20.8 percent while the male unemployment rate was 23.3 percent.\n\nThe unemployment rate for persons with at least one form of functional disability was 23.8 percent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/16221726/Youth-Unemployment.png",
            "description": "<p>By Alois Vinga A total 49,2% of Zimbabwe’s youth population is Not in Education, Employment or Training (NEET), the Zimbabwe National Statistics Agency (Zimstat) data has revealed. The stats agency data contained in the Second Quarter Labour Force Survey (QLFS) says 49, 2% of youths aged between 15 to 35 years fall under the NEET</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/almost-half-of-zimbabwes-youth-population-is-idle-statistics-agency-says/\">Almost half of Zimbabwe’s youth population is idle –  Statistics Agency says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "30 Jul 2025"
        },
        {
            "title": "Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project",
            "url": "https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project.\n\nTwo months back, the treasury had not disbursed enough funds withconstruction of the dam set to be completed this year.\n\nAccording to Lands Deputy Minister, Vangelis Haritatos, the Treasury was releasing funds in drips and drops which cannot make any significant changes.\n\nThe Gwayi-Shangani project, which is supposed to be a permanent fix to Bulawayos water shortages, has faced delays and failed to meet several deadlines since work started in 2004.\n\nThe most recent deadline, which was set by the government, was for the dam to be completed by the 2023/2024 summer cropping season, which it also missed.\n\nIn a statement posted on the social media platform X under his pseudonym Jamwanda, the Deputy Chief Secretary forPresidential Communications, George Charamba said US$10 million has already been disbursed.\n\nPresident ED Mnangagwa has ordered the finance ministry to ensure a monthly disbursement of US$5 million towards completion of the stalled Gwayi-Shangani dam.\n\nSo far US$10m has been released, ensuring some four meters of the all concrete wall are done, he wrote.\n\nIn 2018, Mnangagwa toured the Gwayi-Shangani dam and pledged to do everything in his power to ensure the project is completed by the end of 2019 and to date, it has not been completed.\n\nLast year, the government allocated ZiG1,2 billion in the national 2025 budget to complete Lake Gwayi-Shangani and Kunzvi Dam which is now at 72% completion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29182454/gwayi.webp",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project. Two months back, the treasury had not disbursed enough funds with construction of the dam set to be completed this year. According to  Lands Deputy Minister, Vangelis Haritatos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/\">Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "30 Jul 2025"
        },
        {
            "title": "Zimbabwe, UAE sign health cooperation deal",
            "url": "https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries.\n\nThe cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and health outcomes.\n\nTwo months back, the government also signed separate MoUs with China and Belarus to refurbish the biggest referral hospital, Parirenyatwa.\n\nSpeaking during a post-cabinet media briefing on Tuesday, Information Minister Jenfan Muswere said the MoU aims to strengthen healthcare systems and improve health outcomes in both countries through mutual cooperation based on respect, equality, and shared benefit.\n\nCabinet considered and approved the MoU between the Republic of Zimbabwe and the Government of United Arab Emirates on Cooperation in the field of health.\n\nThe MOU aims to establish a collaborative framework between the two countries to foster mutual growth, development, and enhancement of healthcare systems within their respective territories.\n\nThe scope of cooperation encompasses various healthcare domains, including Primary Care, which comprises collaborative efforts in reproductive, maternal, neonatal, child, and adolescent health, as well as immunisation programs.\n\nSecondary Care, which comprises specialist care and patient referral services, laboratory services, forensic pathology, and blood services, Muswere said.\n\nHe added: Health system resilience, whose key aspect is preparing for and responding to public health emergencies.\n\nHealth financing, which enables both countries to explore innovative funding models, share financial expertise, and optimise resource allocation to achieve better health outcomes.\n\nHuman resources, which focuses on developing and managing healthcare professionals; and health technology, which aims to leverage health technology to improve healthcare delivery, enhance patient care, and streamline healthcare services.\n\nPublic hospitals in Zimbabwe are struggling to efficiently serve patients due to shortages of basic medical supplies, rundown infrastructure, and poorly paid staff, which has led to massive brain drain and low morale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has signed a Memorandum of Understanding (MoU) with the United Arab Emirates (UAE) aimed at strengthening healthcare systems in both countries. The cooperation covers a wide range of healthcare areas, including primary and specialist care, emergency preparedness, health financing, workforce development, and the use of technology to improve service delivery and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-uae-sign-health-cooperation-deal/\">Zimbabwe, UAE sign health cooperation deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "30 Jul 2025"
        },
        {
            "title": "Businessman granted direct access to Constitutional Court in legal fight with former Zupco chairperson",
            "url": "https://www.newzimbabwe.com/businessman-granted-direct-access-to-constitutional-court-in-legal-fight-with-former-zupco-chairperson/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court of Zimbabwe has granted direct access to businessman Jayesh Shah, the applicant, allowing him to challenge a prior decision made by the Supreme Court in a case he was ordered to pay US$130,000 to former Zupco chairperson Charles Nherera for malicious prosecution.\n\nIn the case, Shah aims to contest the Supreme Courts handling of his appeal against the above order relating to issues of malicious prosecution, arrest, and detention stemming from an ongoing legal battle with Nherera.\n\nThe complex legal saga traces back over two decades, originating from business dealings between Shahs company, Gift Investments (Private) Limited, and ZUPCO.\n\nThe conflict escalated following allegations of corruption, a bribery scandal that led to criminal charges against both parties, and ultimately a conviction for Nherera that was later overturned, resulting in a civil suit against Shah for wrongful prosecution, which claims damages totalling $400,000.\n\nNherera had claimed US$400,000 but the High Court ruled that the amount was too high.\n\nJustice Nicholas Mathonsi ordered Shah to compensate Nherera of US$130,000, which could be paid in local currency at the official exchange rate.\n\nUnhappy with the decision, Shah then approached the Supreme Court.\n\nThe Supreme Court previously upheld a decision awarding Nherera damages for malicious prosecution and arrest and Shah argues without sufficient evidence of how these damages were computed, raising eyebrows about the integrity of the legal process.\n\nShah, arguing that the Supreme Court decisions violated his rights to a fair hearing and equal protection under the law, sought direct access to the Constitutional Court.\n\nJustice Rita Makarau upheld his application, emphasising the importance of reviewing the Supreme Courts findings that were deemed binding on the trial courta decision that raised concerns of jurisdiction and independence when adjudicating the case.\n\nMakarau observed that the trial court appeared to surrender its authority, attributing overwhelming weight to the Supreme Courts acknowledgement of a prima facie case against Shah.\n\nIn summary, it appears to me that the trial court was conducted in a grossly irregular fashion, thereby robbing it of the fairness that is a prerequisite of a trial under the law.\n\nThe trial court wrongly and wrongfully surrendered its jurisdiction in the matter to the appeal court, again robbing the trial of the prerequisite that it must be before an independent and impartial judicial officer.\n\nThese irregularities could, and in my view, should have been reviewed by the court a quo. I venture to say that the irregularities would have been corrected had the correct law been applied, she said.\n\nThe Courts decision pointed out serious irregularities in the trial process, suggesting that the trial courts conduct signified a deprivation of Shahs constitutional rights.\n\nMakarau JCC noted, The effect and purpose of the decision a quo stand out clearly as validating the myriad of irregularities, highlighting a pronounced disconnect between the legal procedures and the guarantees afforded by the Constitution.\n\nFollowing the Courts decision, Shah is required to file a substantive application within ten days, where further examination of the contested findings will occur.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29191723/concourt.jpg",
            "description": "<p>By Mary Taruvinga The Constitutional Court of Zimbabwe has granted direct access to businessman Jayesh Shah, the applicant, allowing him to challenge a prior decision made by the Supreme Court in a case he was ordered to pay US$130,000 to former Zupco chairperson Charles Nherera for malicious prosecution. In the case, Shah aims to contest</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-granted-direct-access-to-constitutional-court-in-legal-fight-with-former-zupco-chairperson/\">Businessman granted direct access to Constitutional Court in legal fight with former Zupco chairperson</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "30 Jul 2025"
        },
        {
            "title": "Ivory Coast President Ouattara, 83, in pole position for fourth term",
            "url": "https://www.newzimbabwe.com/ivory-coast-president-ouattara-83-in-pole-position-for-fourth-term/",
            "content": "Ivory Coast President Alassane Ouattaras decision toseek re-election in Octobermeans the worlds top cocoa-producing nation will again have to wait on his promise to pass the baton to a new generation of political leaders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29194357/alassane.jpg",
            "description": "<p>Reuters Ivory Coast President Alassane Ouattara’s decision to seek re-election in October means the world’s top cocoa-producing nation will again have to wait on his promise to pass the baton to a new generation of political leaders. But the 83-year-old former international banker is hoping a strong economy and a weak field of challengers will propel</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ivory-coast-president-ouattara-83-in-pole-position-for-fourth-term/\">Ivory Coast President Ouattara, 83, in pole position for fourth term</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:37",
            "date": "30 Jul 2025"
        }
    ]
}