{
    "news": [
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups",
            "url": "https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/",
            "content": "By Staff Reporter\n\nHIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwas son.\n\nHarare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto Road in Highlands. The potential buyer of the land, believed to be Collins Mnangagwa, is constructing a multi-storey building in the area and intends to close part of the public road.\n\nThe residents have been given a month to lodge objections and reasons with the City Council regarding the land.\n\nThe Highlands Residents Association has, via a petition, objected to the sale of the portion of the road by the City Council.\n\nWe, the undersigned residents and community members of Highlands and surrounding areas, hereby submit our formal objection to the proposed permanent road closure of a portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue hereinafter referred to as Otto Road as per the public notice), Highlands, Harare, as advertised in the Public Notice placed in The Herald on Tuesday 2 September 2025, read the petition.\n\nThe residents lashed out at the City Council for the lack of transparency in the process, arguing that the sale of the land deprives the public of the benefits it carries.\n\nOtto Road is public land. Its permanent closure and subsequent sale would deprive current and future residents of their right to access and benefit from public infrastructure.\n\nOtto Road provides a safe and established route for domestic workers, security guards, gardeners, pedestrians, cyclists, schoolchildren, walkers and joggers. Closing it will force vulnerable users onto busier, more dangerous routes.\n\nMany people who rely on Otto Road do not own cars. Closure would disproportionately harm women, children, and low-income workers who depend on safe non-motorised routes.\n\nThe proposed closure appears to serve private interests at the expense of the broader community. Council has a duty to uphold transparency and protect public assets for collective benefit, read the petition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Staff Reporter HIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwa’s son. Harare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/\">Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe",
            "url": "https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhalas home, describing it as a barbaric act of violence and urged authorities to thoroughly investigate and arrest perpetrators.\n\nThe incidentreportedlyoccurredon August 30while Sikhala was in South Africa launching his book,Footprints in the Chains: The Life Story of Job Sikhala.\n\nThe bomb attack came after Sikhalas book launch in Masvingo was violently disrupted by suspected Zanu PF activists who confiscated and tore some books, broke furniture and also physically assaulted some panelists at the launch.\n\nIn a statement Monday, ZHRC voiced grave concern over the safety of Sikhalas family, noting that children were reportedly inside the house when the incident occurred.\n\nThe ZHRC is concerned about this dangerous explosion, which, if it is an attack, it strongly condemns as a barbaric act of violence which threatens the enjoyment of a number of constitutionally guaranteed human rights, particularly the right to life.\n\nThe ZHRC is deeply concerned about the safety and well-being of Mr. Sikhalas family, especially the children who were reportedly present when the explosion took place.\n\nChildren must be shielded from all forms of violence, abuse, and neglect. Exposure of children to such traumatic events can have enduring psychological and emotional consequences, ZHRC said.\n\nThe human rights commission also urged law enforcement authorities to investigate the matter and bring the perpetrators to book.\n\nThe ZHRC acknowledges the swift response by thepoliceand otherstate agencies in attending to the scene and initiating investigations.\n\nIt commends these efforts and urges the authorities to pursue a timely,thoroughand impartial investigation toidentify andprosecute those responsible so that they are punished in a deterrent manner, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhala’s home, describing it as a “barbaric act of violence” and urged authorities to thoroughly investigate and arrest perpetrators. The incident reportedly occurred on August 30 while Sikhala was in South Africa launching his book, “Footprints in the Chains: The Life</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/\">Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Judge rejects father’s bid to reclaim house from son",
            "url": "https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a fathers attempt to revoke a property registered in his sons name, saying the case reflected evidence of a broken family.\n\nOnias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had purchased and donated to him.\n\nJustice Philda Muzofa, sitting in Chinhoyi, noted the unusual family feud: It is never easy for a father to drag his son to courts; this is just evidence of a broken family. Something must have gone seriously wrong.\n\nOnias argued the property was a donation that could be revoked because Pride had become disrespectful and violent towards him, and had even tried to sell it against his wishes.\n\nBut the court ruled there was never a valid donation. There was never an intention to gratuitously and without obligation give the 1st respondent the property, Justice Muzofa said. There were strings attached. The applicant intended to continue to derive a benefit from the property.\n\nThe judge stressed that while Onias funded the purchase, the house was always registered in Prides name. The evidence before the Court strongly shows that the applicant purchased the property for the 1st respondent and he had strings attached, the judge said.\n\nDismissing the claim with costs, the judge concluded: Revocation can only be made where there is a valid donation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a father’s attempt to revoke a property registered in his son’s name, saying the case reflected “evidence of a broken family.” Onias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/\">Judge rejects father’s bid to reclaim house from son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Motorist loses US$10,000 and pistol to attendant at Harare car wash",
            "url": "https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/",
            "content": "By Staff Reporter\n\nA HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle.\n\nThe offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his clients car at a Mabelreign washing bay in March.\n\nChimukuyu was slapped with 13 months imprisonment, of which five months were conditionally suspended. He will, therefore, serve an effective eight months behind bars.\n\nCourt heard that on March 21, 2025, the complainant left the money and firearm inside his Mercedes-Benz before handing it over to the offender for cleaning.\n\nInstead of performing his duties, Chimukuyu fled with the bag containing the valuables.\n\nIt was further heard that following a tip-off, police detectives arrested the offender at Pamuzinda Lodge, Claudia in Harare and recovered US$1,850 in his trousers pocket. The stolen pistol and bag were later recovered during a follow-up search.\n\nOf the stolen cash, only US$3,450 was recovered.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) urged motorists to avoid leaving large sums of money and firearms unattended in vehicles, even when dealing with trusted service providers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09045858/Car-wash_.png",
            "description": "<p>By Staff Reporter A HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle. The offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his client’s car at a Mabelreign washing bay in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/\">Motorist loses US$10,000 and pistol to attendant at Harare car wash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "DJ Maphorisa taps Davido for blockbuster ‘Biri Marung’ remix",
            "url": "https://www.newzimbabwe.com/dj-maphorisa-taps-davido-for-blockbuster-biri-marung-remix/",
            "content": "By TshisaLive\n\nDJ Maphorisa is recruiting Afrobeats megastar Davido for the official remix of the amapiano smash hit Biri Marung.\n\nFeaturing a powerhouse line-up of Sje Konka, Focalistic, Scotts Maphuma, CowBoii and DJ Maphorisa himself, the original track has shattered records since its release, amassing 33-million streams, spending eight weeks at No.1 on the BMAT Chart, and maintaining a spot in the Top 30 for 25 consecutive weeks.Driven by its viral success on TikTok with more than 4.2-million creations and 5.6 million views the song has become a true cultural moment. Its also garnered 2.7-million Shazams, underlining its global appeal.Now, the highly anticipated remix introduces a fresh Afro-fusion twist, blending amapianos infectious rhythms with Davidos signature Afrobeats energy.We wanted it to speak to a wider market while maintaining the core vibe, says Maphorisa.The goal was to blend amapiano and Afrobeats  sounds that represent South Africa and Nigeria and create something all of Africa can vibe to.According to the producer, the collaboration came about organically during a trip to Nigeria.We were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nFeaturing a powerhouse line-up of Sje Konka, Focalistic, Scotts Maphuma, CowBoii and DJ Maphorisa himself, the original track has shattered records since its release, amassing 33-million streams, spending eight weeks at No.1 on the BMAT Chart, and maintaining a spot in the Top 30 for 25 consecutive weeks.\n\nDriven by its viral success on TikTok with more than 4.2-million creations and 5.6 million views the song has become a true cultural moment. Its also garnered 2.7-million Shazams, underlining its global appeal.Now, the highly anticipated remix introduces a fresh Afro-fusion twist, blending amapianos infectious rhythms with Davidos signature Afrobeats energy.We wanted it to speak to a wider market while maintaining the core vibe, says Maphorisa.The goal was to blend amapiano and Afrobeats  sounds that represent South Africa and Nigeria and create something all of Africa can vibe to.According to the producer, the collaboration came about organically during a trip to Nigeria.We were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nDriven by its viral success on TikTok with more than 4.2-million creations and 5.6 million views the song has become a true cultural moment. Its also garnered 2.7-million Shazams, underlining its global appeal.\n\nNow, the highly anticipated remix introduces a fresh Afro-fusion twist, blending amapianos infectious rhythms with Davidos signature Afrobeats energy.We wanted it to speak to a wider market while maintaining the core vibe, says Maphorisa.The goal was to blend amapiano and Afrobeats  sounds that represent South Africa and Nigeria and create something all of Africa can vibe to.According to the producer, the collaboration came about organically during a trip to Nigeria.We were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nNow, the highly anticipated remix introduces a fresh Afro-fusion twist, blending amapianos infectious rhythms with Davidos signature Afrobeats energy.\n\nWe wanted it to speak to a wider market while maintaining the core vibe, says Maphorisa.The goal was to blend amapiano and Afrobeats  sounds that represent South Africa and Nigeria and create something all of Africa can vibe to.According to the producer, the collaboration came about organically during a trip to Nigeria.We were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nWe wanted it to speak to a wider market while maintaining the core vibe, says Maphorisa.\n\nThe goal was to blend amapiano and Afrobeats  sounds that represent South Africa and Nigeria and create something all of Africa can vibe to.According to the producer, the collaboration came about organically during a trip to Nigeria.We were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nThe goal was to blend amapiano and Afrobeats  sounds that represent South Africa and Nigeria and create something all of Africa can vibe to.\n\nAccording to the producer, the collaboration came about organically during a trip to Nigeria.We were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nAccording to the producer, the collaboration came about organically during a trip to Nigeria.\n\nWe were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.For Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nWe were in Nigeria last year and the reception to Biri Marung was massive. It just made sense to bring in Davido and elevate the track even further.\n\nFor Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.Sometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nFor Ego Slimflow, one of the creative forces behind the hit, the journey has been surreal.\n\nSometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.As Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nSometimes we doubt how powerful music really is, but this journey has been a blessing and a constant reminder of its impact.\n\nAs Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.Amapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nAs Amapiano continues to break boundaries, cross-continental collaborations like this are proving essential to its global rise.\n\nAmapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\nAmapiano is still a baby, says Maphorisa. But with Afrobeats stars embracing it, were showing the world the versatility of African sound.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/29164240/Davido1.jpg",
            "description": "<p>By TshisaLive DJ Maphorisa is recruiting Afrobeats megastar Davido for the official remix of the amapiano smash hit Biri Marung. Featuring a powerhouse line-up of Sje Konka, Focalistic, Scotts Maphuma, CowBoii and DJ Maphorisa himself, the original track has shattered records since its release, amassing 33-million streams, spending eight weeks at No.1 on the BMAT</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dj-maphorisa-taps-davido-for-blockbuster-biri-marung-remix/\">DJ Maphorisa taps Davido for blockbuster ‘Biri Marung’ remix</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "09 Sep 2025"
        }
    ]
}