{
    "news": [
        {
            "title": "U.S. federal prosecutors announce more charges against Sean ‘Diddy’ Combs",
            "url": "https://www.newzimbabwe.com/u-s-federal-prosecutors-announce-more-charges-against-sean-diddy-combs/",
            "content": "By CNN\n\nUNITED States federal prosecutors added two additional criminal charges against music mogul Sean Diddy Combs, one month before he is set to go to trial in New York on sex trafficking charges.\n\nProsecutors charged Combs with one additional count of sex trafficking and one additional count of transportation to engage in prostitution relating to Victim-2, according to a superseding indictment filed Friday. Authorities allege that conduct occurred between 2021 and 2024.\n\nCombs was previously charged with racketeering conspiracy and transportation to engage in prostitution related to three victims and one count of sex trafficking related only to Victim-1. He now faces five federal charges.\n\nJury selection for his trial is scheduled to start on May 5. Combs has pleaded not guilty.\n\nWhen reached for comment, lawyers for Combs said, These are not new allegations or new accusers. These are the same individuals, former long-term girlfriends, who were involved in consensual relationships. This was their private sex life, defined by consent, not coercion.\n\nThey allege Combs and his associates used his position of power to coerce women, often under the pretense of a romantic relationship, into engaging in sex acts, according to the indictment.\n\nProsecutors said during these encounters, known as Freak Offs, women were drugged and forced to have sex with male prostitutes. The Freaks Offs often lasted days and were video recorded, the indictment alleges.\n\nCombs lawyers have maintained no crimes were committed and the sexual encounters were consensual and part of a long-term relationship.\n\nCombs is also accused of reacting violently when his authority was threatened. On one occasion, the indictment says, Combs allegedly dangled a victim over an apartment balcony and was involved in kidnapping and arson.\n\nProsecutors also revealed in a new court filing that four accusers are expected to testify at the trial.\n\nVictim-1, who was Combs long-term girlfriend, is planning to testify under her real name. Prosecutors have asked that three other alleged victims be allowed to testify under pseudonyms.\n\nThis case has already received an exceptional amount of media coverage, which will presumably only increase as trial proceeds. Permitting these measures will prevent unnecessary public disclosure of the victims identities, and the harassment from the media and others, they wrote in a court filing Friday.\n\nIn addition, prosecutors said, publicizing the names of these three victims will cause them significant embarrassment, anxiety, and social stigma. The accusers have said they are concerned that their testimony would impact their personal relationships and future employment, the government said.\n\nAccording to prosecutors, the accusers identities are known to Combs and his lawyers.\n\nJudges have allowed accusers to testify using nicknames or pseudonyms in other high-profile cases, including the sex trafficking trial of Ghislaine Maxwell, Jeffrey Epsteins former girlfriend and accomplice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/24142645/Sean-%E2%80%9CDiddy%E2%80%9D-Combs.jpg",
            "description": "<p>By CNN  UNITED States federal prosecutors added two additional criminal charges against music mogul Sean “Diddy” Combs, one month before he is set to go to trial in New York on sex trafficking charges. Prosecutors charged Combs with one additional count of sex trafficking and one additional count of transportation to engage in prostitution relating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-federal-prosecutors-announce-more-charges-against-sean-diddy-combs/\">U.S. federal prosecutors announce more charges against Sean ‘Diddy’ Combs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Barack Obama admits to ‘deep deficit’ in marriage after White House years",
            "url": "https://www.newzimbabwe.com/barack-obama-admits-to-deep-deficit-in-marriage-after-white-house-years/",
            "content": "By Bang Showbiz\n\nBARACK Obama opens up about the challenges he faced in his marriage to Michelle after their time in the White House, revealing a deep deficit and how he has worked to reconnect with her.\n\nBarack claims he was in a deep deficit with his wife Michelle Obama after leaving the White House.\n\nBarack, 63, served two terms as US President between 2009 and 2017 and claims they took a toll on his relationship with former First Lady Michelle, 61.\n\nThe Daily Beast reports that Obama told an audience at Hamilton College: I was in a deep deficit with my wife.\n\nSo, I have been trying to dig myself out of that hole by doing occasionally fun things.\n\nThe Obamas have been married since 1992, and have daughters Malia, 26, and Sasha, 23, together.\n\nThey have previously admitted that the presidency affected their marriage, with Michelle once revealing there was a time when she couldnt stand her husband.\n\nSpeaking to Revolt TV, she said: People think Im being catty by saying this  its like, there were 10 years where I couldnt stand my husband. And guess when it happened? When those kids were little.\n\nWhen asked about Michelles comments, Barack told CBS Mornings: Let me just say this: it sure helps to be out of the White House. And to have a little more time with her.\n\nMichelle  when our girls were growing up, that was priority number one, two, three and four. And so, I did not fully appreciate, I think, as engaged of a father as I was, the degree of stress and tension for her, knowing that not just me and Michelle were under scrutiny and in this strange environment, but that we were raising our daughters in a kind of situation that just wasnt normal.\n\nMichelle met Barack in 1989 when she was 25 and he was 28, while both were working at the Sidley Austin LLP law firm in Chicago.\n\nThe former president asked Michelle on a date within a month of meeting, and they became engaged in 1991.\n\nThey married the following year and later had two daughters, Malia in 1998 and Sasha in 2001.\n\nBaracks political career began in earnest in 2004 when he was elected as an Illinois state senator, bringing the family into the public eye.\n\nIn 2008, he was elected the 44th president of the United States and won re-election in 2012.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/06070214/Barack-Obama-admits-to-deep-deficit-in-marriage-after-White-House-years.webp",
            "description": "<p>By Bang Showbiz BARACK Obama opens up about the challenges he faced in his marriage to Michelle after their time in the White House, revealing a ‘deep deficit’ and how he has worked to reconnect with her. Barack claims he was in a “deep deficit” with his wife Michelle Obama after leaving the White House.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/barack-obama-admits-to-deep-deficit-in-marriage-after-white-house-years/\">Barack Obama admits to ‘deep deficit’ in marriage after White House years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "War veteran Geza’s supporter spends nearly a month in custody for ‘insulting’ Mnangagwa",
            "url": "https://www.newzimbabwe.com/war-veteran-gezas-supporter-spends-nearly-a-month-in-custody-for-insulting-mnangagwa/",
            "content": "By Staff Reporter\n\nA RUSAPE man has spent close to a month behind bars following his arrest for allegedly criticizing President Emmerson Mnangagwa and expressing support for war veteran Blessed Runesu Geza.\n\nGeza, an expelled Zanu PF Central Committee member, has recently been one of Mnangagwas fiercest critics, opposing the 2030 agenda.\n\nThe detained man, Alfred Ngonidzaishe Machakaire (34), who resides in Gowo village in Inyati, Makoni district, Manicaland province, had by time of publishing spent a combined 26 days in custody.\n\nMachakaire is charged with undermining the authority of or insulting President Mnangagwa, as defined in Section 33(2)(a)(b) of the Criminal Law (Codification and Reform) Act.\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR), which is representing Machakaire, said the allegations against their client stem from a verbal altercation with Zanu PF Councillor Leonard Chidemo at a bar in Chendambuya after Chidemo refused to buy him beer.\n\nProsecutors said Machakaire, who is represented by Leonard Chigadza of the Zimbabwe Lawyers for Human Rights, undermined the authority of or insulted President Mnangagwa by uttering the following words: You, Chidemo, down with Mnangagwa! I am Geza! On the 31st, the country will be fine. Mnangagwa is a (genital organ). You have caused the death of people in the country, ZLHR said.\n\nGeza had called for protests on March 31 to demand Mnangagwas immediate resignation, however, the highly anticipated demonstrations largely turned into a nationwide stay-away.\n\nMachakaire is one of several people who have been arrested and prosecuted across Zimbabwe for allegedly undermining the authority of or insulting President Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Staff Reporter A RUSAPE man has spent close to a month behind bars following his arrest for allegedly criticizing President Emmerson Mnangagwa and expressing support for war veteran Blessed Runesu Geza. Geza, an expelled Zanu PF Central Committee member, has recently been one of Mnangagwa’s fiercest critics, opposing the “2030 agenda.” The detained man,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-veteran-gezas-supporter-spends-nearly-a-month-in-custody-for-insulting-mnangagwa/\">War veteran Geza’s supporter spends nearly a month in custody for ‘insulting’ Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Zimbabwe misses the boat on billionaire Strive Masiyiwa’s AI factory as South Africa strikes jackpot",
            "url": "https://www.newzimbabwe.com/zimbabwe-misses-the-boat-on-billionaire-strive-masiyiwas-ai-factory-as-south-africa-strikes-jackpot/",
            "content": "By Costa Nkomo\n\nCASSAVA Technologies, the tech firm founded by Zimbabwean telecoms magnate Strive Masiyiwa, dealt a blow to President Emmerson Mnangagwas Open for Business mantra last week.\n\nTheir announcement that they would be building Africas first artificial intelligence factory in South Africa, in partnership with leading AI chipmaker Nvidia, represents a missed opportunity for Zimbabwe.\n\nMnangagwa, fresh from seizing power in November 2017 via a military coup, threw open doors to the world, pitching Zimbabwe as the premier business destination.\n\nOn paper, this looked like a masterstroke strategy to attract Foreign Direct Investment (FDI). However, time and again, the government has been its own worst enemy, shooting itself in the foot with policies and practices that deter investors.\n\nNvidias supercomputers, powered by graphic processing units, or GPUs (the workhorse chips behind AI), will be deployed at Cassavas data centres in South Africa from as early as June, with plans to roll them out across the companys other facilities in Egypt, Kenya, Morocco, and Nigeria.\n\nThis is a clear indication that, where AI development is concerned, South Africa will be punching above its weight in the coming years.\n\nSpeaking in Kigali, Rwanda, at the Inaugural Global AI Summit on Africa, Masiyiwa was blunt about his reasons for side-lining Zimbabwe and other African nations due to their less-than-stellar business environments.\n\nMasiyiwa emphasised the need for African leaders to cultivate a pro-investor ecosystem.\n\nI cannot overemphasise the need for our leaders to create an ecosystem for investment because people like me stepping forward and going out to raise billions of dollars to buy these chips, we can only go to where it is investor friendly, he said.\n\nHe added, underlining his point with a stark warning: We wont come back and tell you your investment environment doesnt work. We just walk away. So, weve got to talk to each other. Youve got to listen to what we feel we need to comfortably raise the capital to do this.\n\nInformation and Communication Technology (ICT) Minister Tatenda Mavetera acknowledged the uphill battle in creating a favourable business climate that attracts investment, particularly in the ICT sector.\n\nOur ministry is prioritising: Streamlining regulations to fast-track tech infrastructure projects, Incentivising R&D (research and development) partnerships and private-sector co-investment and building secure digital ecosystems with reliable power, connectivity and talent pipelines, Mavetera posted on her X account Saturday.\n\nShe added: More investor friendly policies in the ICT sector are essential and urgent. Lets deepen this dialogue.\n\nWe are working on a lot of policies e.g ICT start up and venture capital policy, fintech and cryptocurrency policy and also look at implementing tax incentives in the ICT sector so that we position Zimbabwe as the next tech hub, Mavetera further wrote.\n\nMasiyiwa famously navigated a hostile environment in the 1990s to establish Econet Wireless and has publicly thanked the late Vice President Joshua Nkomo for his support in founding Econet.\n\nMnangagwas critics were quick to accuse the Zanu-PF leader of a monumental blunder.\n\nMasiyiwas decision to establish the AI factory in South Africa has been interpreted by many as an own goal that has left Zimbabwe in the digital doldrums.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/07/22062820/Strive-Masiyiwa.jpg",
            "description": "<p>By Costa Nkomo CASSAVA Technologies, the tech firm founded by Zimbabwean telecoms magnate Strive Masiyiwa, dealt a blow to President Emmerson Mnangagwa’s “Open for Business” mantra last week. Their announcement that they would be building Africa’s first artificial intelligence factory in South Africa, in partnership with leading AI chipmaker Nvidia, represents a missed opportunity for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-misses-the-boat-on-billionaire-strive-masiyiwas-ai-factory-as-south-africa-strikes-jackpot/\">Zimbabwe misses the boat on billionaire Strive Masiyiwa’s AI factory as South Africa strikes jackpot </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Zimbabwe’s plan to drop the dollar is faltering on ZiG crunch",
            "url": "https://www.newzimbabwe.com/zimbabwes-plan-to-drop-the-dollar-is-faltering-on-zig-crunch/",
            "content": "By Bloomberg\n\nA LIQUIDITY crunch in Zimbabwe is deepening the economys embrace of the US dollar and undermining the bullion-backed currency introduced by the government almost a year ago.\n\nThe ZiG, short for Zimbabwe Gold, which began trading on April 8, is the southern African nations sixth attempt since 2009 at replacing the dollar with a functional local currency. It has not gone well.\n\nIn September, after persistent weakness against the dollar, the Reserve Bank of Zimbabwe devalued the ZiG by 43%, raised the key interest rate to 35% from 20% and increased cash reserve requirements to steady the currency. It has depreciated almost 4% this year.\n\nThe stability measures have led to an economy swimming in dollars, said Eddie Cross, a Harare-based independent economist and former monetary policy committee member.\n\nThe liquidity crunch has now killed the ZiG, he said.\n\nThe ZiG has retreated as a currency of trade and effectively we have dollarized.\n\nThe tight monetary policy stance has fuelled a slump with stocks plunging on Harares main exchange, consumer prices falling 0.1% in March and ZiG supply scant on the unofficial market.\n\nThe ZiG is being used to settle mostly minor transactions including utility and tax payments and a portion of civil servant wages. The rest is paid in dollars. The currency cannot be used to pay for essentials including fuel, rent and medicines.\n\nThe highest denomination ZiG banknote is worth about $7.50  enough to buy six loaves of bread.\n\nDespite being backed by more than $550 million in gold and cash reserves, used as a selling point to win public trust, its limited use in salient sectors of the economy makes differences with its failed predecessors seem cosmetic, said Jacques Nel, head of Africa macro at Oxford Economics.\n\nIt would have taken something special to convince Zimbabweans that this time is different, he said.\n\nBumpy ride\n\nNot even the more than 30% surge in the bullion price since the gold-backed currencys adoption has helped.\n\nPart of the problem is that the level of hard currency reserves backing it are woefully inadequate, because the nation has been locked out of capital markets since a debt default in 1999, said Hasnain Malik, an emerging-market strategist at Tellimer in Dubai.\n\nIts demise should be no surprise, he said.\n\nStill, policymakers dont plan to loosen their tight monetary stance or ditch the ZiG. Last week, the central bank kept the key rate at 35% and added that it would remain vigilant to any emerging risks to inflation and exchange rate stability.\n\nIts going to be a bumpy ride, but we are fully committed, Innocent Matshe, the RBZs deputy governor told business leaders on Feb. 13 in the capital, Harare.\n\nThe currencys survival depends on the ruling partys support, said Tony Hawkins, an independent economic consultant in Harare and former economics professor at the University of Zimbabwe.\n\nHistory has shown that every new currency in Zimbabwe has a shorter lifespan than its predecessor and with the ZiG not really being used it could be headed for the same fate, he said.\n\nWhat else is the ZiG used for except arbitrage opportunities and to pay civil servants, Hawkins, said.\n\nI cant see the ZiG surviving that long.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Bloomberg  A LIQUIDITY crunch in Zimbabwe is deepening the economy’s embrace of the US dollar and undermining the bullion-backed currency introduced by the government almost a year ago. The ZiG, short for Zimbabwe Gold, which began trading on April 8, is the southern African nation’s sixth attempt since 2009 at replacing the dollar with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-plan-to-drop-the-dollar-is-faltering-on-zig-crunch/\">Zimbabwe’s plan to drop the dollar is faltering on ZiG crunch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Mnangagwa’s former advisor Eddie Cross apologises for labelling First Family corrupt",
            "url": "https://www.newzimbabwe.com/mnangagwas-former-advisor-eddie-cross-apologises-for-labelling-first-family-corrupt/",
            "content": "By Tapiwa Svondo\n\nTOP economist and former presidential advisor, Eddie Cross, has publicly apologised to President Emmerson Mnangagwa after he was summoned to State House to explain his recent interview with Newzroom Afrika in which he alleged the Zanu PF leaders sons are looting public funds.\n\nThis comes after his latest interview with the South African-based television station, which was aired ahead of March 31 planned protests.\n\nDuring the interview, Cross said Mnangagwa is lethargic to stop corruption as his own family members are involved.\n\nThe problem is his not been able to tackle some of the fundamental problems we have for example, he has not tackled corruption in fact theres lots of evidence that his own family is deeply corrupt, that some of his children are engaged in criminal activity on a large scale and hes not tackled that and I think if he would tackle a few of those, I mean the amount of money being stolen here is just enormous it probably exceeds our national budget, said Cross.\n\nIn an interview with NewZimbabwe.com, Cross confirmed the authenticity of his letter which was made public, saying that in the meeting with Mnangagwa, he was asked to provide evidence of his claims which he says he could not give, hence the apology and withdrawal of his unfounded statement.\n\nOn Monday the 31st of March I gave an interview to a South African television Station regarding the stay away that took place that day across the country.\n\nIn that interview I stated that one of the reasons for this event was dissatisfaction with the very substantial corruption taking place across the country. I also stated that the Presidents family were involved.\n\nOn Tuesday I requested a meeting with the President and told him that I recognised that I should not have involved his family, and I apologised unreservedly.\n\nHe expressed concern about the substance of my general allegations on the magnitude of corruption and asked that I substantiate this. I agreed to provide him with a dossier of what I understand is going on. On the issue of his children being involved, he asked who was implicated and I identified 3 (three) of his sons.\n\nOn Wednesday I returned to State House to discuss this further with the three men involved and I outlined what I was hearing but could not provide firm evidence to support these allegations and rumors. I again apologised and said I would withdraw my statement on this matter, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/06/23044027/Eddie-Cross.jpg",
            "description": "<p>By Tapiwa Svondo  TOP economist and former presidential advisor, Eddie Cross, has publicly apologised to President Emmerson Mnangagwa after he was summoned to State House to explain his recent interview with Newzroom Afrika in which he alleged the Zanu PF leader’s sons are looting public funds. This comes after his latest interview with the South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-former-advisor-eddie-cross-apologises-for-labelling-first-family-corrupt/\">Mnangagwa’s former advisor Eddie Cross apologises for labelling First Family corrupt </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Limpopo police arrest man with R300,000 in illegal explosives at Beitbridge Border",
            "url": "https://www.newzimbabwe.com/limpopo-police-arrest-man-with-r300000-in-illegal-explosives-at-beitbridge-border/",
            "content": "By IOL\n\nA 37-year-old man was arrested for attempting to enter South Africa with two boxes containing illegal explosives valued at around R300,000, at the Beitbridge Port of Entry in Musina, Limpopo police said.\n\nThe police said the arrest occurred on Thursday night in the Vhembe District, during the routine inspections at the South Gate.\n\nProvincial police spokesperson Brigadier Hlulani Mashaba said the police stopped a white truck with Gauteng registration plates and conducted a search.\n\nPolice officers conduct a search at Beitbridge Port of Entry, uncovering illegal explosives in a white truck bound for Gauteng.\n\nHe said during a search, officers discovered two boxes containing illegal explosives valued at approximately R300,000.\n\nPreliminary investigations revealed that the vehicle was en route to Gauteng Province, Mashaba said.\n\nThe suspect was immediately arrested, and the vehicle was confiscated.\n\nMashaba said the suspect is expected to appear before the Musina Magistrates Court soon on charges of possession of illegal explosives.\n\nLimpopo police officers uncover illegal explosives hidden in a truck at Beitbridge Port of Entry during a routine inspection.\n\nMeanwhile, Limpopo police provincial commissioner Lieutenant General Thembi Hadebe commended the men and women in blue for their vigilance and swift action.\n\nThe interception of these explosives is a significant achievement in our ongoing efforts to combat crime and protect our communities, Hadebe said.\n\nWe will continue to strengthen security measures at all entry points to prevent such illegal activities.\n\nMashaba added that the investigation is ongoing.\n\nLast month, IOL News reported that a relatively routine border crossing took a dramatic turn after Limpopo police arrested a 48-year-old Zimbabwean man for alleged unlawful possession of explosives valued at over R600,000 at the Beitbridge Port of Entry.\n\nThe Directorate for Priority Crime Investigation, also known as the Hawks, said the man was arrested on Tuesday after police stopped a trailer truck from Zimbabwe to South Africa at the Beitbridge border.\n\nThey asked a driver to open a trailer so that the search can be conducted. The driver informed the police that he does not have keys for the trailers. Police forcibly opened the trailer and conducted a search, and they found bags containing items suspected to be explosives, said provincial Hawks spokesperson, Warrant Officer Lethunya Mmuroa.\n\nAfter the discovery, Mmuroa said police called the Musina-based Bomb Technicians, Hawks Serious Organised Crime Investigation, and Local Criminal Record Central for further assistance.\n\nMmuroa added that when the units arrived, they thoroughly searched the truck for the second time.\n\nAs a result, the team found 16 reels of detonating fuse explosives, 2182 superpowers, and 90 blasting cartridges explosives. The suspect was arrested.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05185149/download-1-3.webp",
            "description": "<p>By IOL A 37-year-old man was arrested for attempting to enter South Africa with two boxes containing illegal explosives valued at around R300,000, at the Beitbridge Port of Entry in Musina, Limpopo police said. The police said the arrest occurred on Thursday night in the Vhembe District, during the routine inspections at the South Gate.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/limpopo-police-arrest-man-with-r300000-in-illegal-explosives-at-beitbridge-border/\">Limpopo police arrest man with R300,000 in illegal explosives at Beitbridge Border</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Dynamos F.C suffers first defeat of the season, as Simba Bhora finally win",
            "url": "https://www.newzimbabwe.com/dynamos-f-c-suffers-first-defeat-of-the-season-as-simba-bhora-finally-win/",
            "content": "By Sports Reporter\n\nCHARLES Tegurus first half strike was enough to hand Manica Diamonds a 1-0 win over Dynamos in a Castle Lager Premier Soccer League (PSL) match played at Sakubva Stadium Saturday afternoon.\n\nThe result saw Dembare registering its first defeat of the season while Manica Diamonds streched its home winning record for this season to three consecutive games.\n\nAlthough Manica Diamonds collected maximum points on the day, Dynamos had a good show thanks to their team captain Emmanuel Jalai, who created a number of chances for the youngsters upfront but couldnt convert the opportunities to goals.\n\nCommenting after the match, Dynamos coach Lloyd Chigowe said a poor first half performance cost his side.\n\nWe lost it in the first half. We started slowly, did not have a good warm-up. In the end, we tried our best in the second half, but Manica Diamonds threw everybody behind the ball.\n\nSo, in the end, they got three points, which they deserved.\n\nNaturally, we could have done better, but we believe that we must now take advantage of our home ground and make sure that we maximise our home advantage, he said.\n\nManica Diamonds gaffer Jairos Tapera admitted that his side had a poor second half performance and bemoaned several chances they failed to convert throughout the game.\n\nA very good game, especially the first half in which we overran them.\n\nI feel we didnt do justice to numerous chances that we created, our conversion rate was very poor.\n\nWe could have gotten a cushioned goal, but thats football, second half, we came flat, and we salute Dynamos because they were very strong, said Tapera.\n\nMeanwhile, defending champions Simba Bhora finally registered their first win of the season Saturday afternoon after picking a 1-0 win over TelOne at Wadzanayi Stadium.\n\nThe Shamva-based side had gone for four consecutive games without a win, recording two draws and two defeats in the process.\n\nSaturdays win was a boost for team coach Joel Lupahla, who was reportedly given a target to win three games, starting with the TelOne fixture.\n\nMatchday 5, Castle Lager Premier Soccer League Results:\n\nScottland 3-0 Bikita MineralsManica Diamonds 1-0 DynamosSimba Bhora 1-0 TelOneGreen Fuel 1-0 YadahKwekwe United 0-0 FC PlatinumMWOS 1-0 ZPC KaribaChicken Inn 0-0 Herentals.\n\nScottland 3-0 Bikita Minerals\n\nManica Diamonds 1-0 DynamosSimba Bhora 1-0 TelOneGreen Fuel 1-0 YadahKwekwe United 0-0 FC PlatinumMWOS 1-0 ZPC KaribaChicken Inn 0-0 Herentals.\n\nManica Diamonds 1-0 Dynamos\n\nSimba Bhora 1-0 TelOneGreen Fuel 1-0 YadahKwekwe United 0-0 FC PlatinumMWOS 1-0 ZPC KaribaChicken Inn 0-0 Herentals.\n\nSimba Bhora 1-0 TelOne\n\nGreen Fuel 1-0 YadahKwekwe United 0-0 FC PlatinumMWOS 1-0 ZPC KaribaChicken Inn 0-0 Herentals.\n\nGreen Fuel 1-0 Yadah\n\nKwekwe United 0-0 FC PlatinumMWOS 1-0 ZPC KaribaChicken Inn 0-0 Herentals.\n\nKwekwe United 0-0 FC Platinum\n\nMWOS 1-0 ZPC KaribaChicken Inn 0-0 Herentals.\n\nMWOS 1-0 ZPC Kariba\n\nChicken Inn 0-0 Herentals.\n\nChicken Inn 0-0 Herentals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/01011559/Dynamos-Player.png",
            "description": "<p>By Sports Reporter  CHARLES Teguru’s first half strike was enough to hand Manica Diamonds a 1-0 win over Dynamos in a Castle Lager Premier Soccer League (PSL) match played at Sakubva Stadium Saturday afternoon. The result saw ‘Dembare’ registering its first defeat of the season while Manica Diamonds streched its home winning record for this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-f-c-suffers-first-defeat-of-the-season-as-simba-bhora-finally-win/\">Dynamos F.C suffers first defeat of the season, as Simba Bhora finally win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Fraud-accused Highlanders CEO resigns just four months into new job",
            "url": "https://www.newzimbabwe.com/fraud-accused-highlanders-ceo-resigns-just-four-months-into-new-job/",
            "content": "By Sports Reporter\n\nFOLLOWING his suspension Thursday over fraud allegations, Highlanders Chief Executive Officer Brian Moyo has resigned.\n\nMoyo was alleged to have forged a fake invoice of US$23,000 for Highlanders to pay Bulawayo Chiefs in a two players transaction they were supposed to pay US$18,000 hence pocketing US$5,000.\n\nThis led to his suspension after the club sat for a joint board and executive meeting.\n\nHowever, in a twist of events, the CEO has since submitted his resignation letter, which has been accepted by the club.\n\nHighlanders FC has received and accepted a letter of resignation from its Chief Executive Officer Brian Moyo.\n\nHis resignation comes at a time when the club had initiated investigations and a disciplinary process against him as a result of allegations of corruption and misappropriation of club funds.\n\nThe club would like to assure its stakeholders that due processes will be followed to deal with this issue, read Highlanders statement.\n\nMoyo quits four months after he was appointed to take over from the late Sihlangu Dhlodhlo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/05154042/brian-bosso-CEO.jpeg",
            "description": "<p>By Sports Reporter  FOLLOWING his suspension Thursday over fraud allegations, Highlanders Chief Executive Officer Brian Moyo has resigned. Moyo was alleged to have forged a fake invoice of US$23,000 for Highlanders to pay Bulawayo Chiefs in a two players’ transaction they were supposed to pay US$18,000 hence pocketing US$5,000. This led to his suspension after</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fraud-accused-highlanders-ceo-resigns-just-four-months-into-new-job/\">Fraud-accused Highlanders CEO resigns just four months into new job</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        },
        {
            "title": "Another Zimbabwean shot dead at Chinese-owned mine",
            "url": "https://www.newzimbabwe.com/another-zimbabwean-shot-dead-at-chinese-owned-mine/",
            "content": "By Costa Nkomo\n\nTHE Centre for Natural Resources Governance (CNRG) is demanding a thorough investigation into the death of another Zimbabwean at the Chinese-run Sino Africa Huijin Mine at Premier Estate in Old Mutare.\n\nAlfred Dzodzo was allegedly shot dead Wednesday night by a security guard who, without warning, fired directly into his face. Dzodzo was accused of attempting to steal gold.\n\nThe mine has operated illegally since 2023, its licence having expired. This unlawful operation has continued with the full knowledge of the government through the Environmental Management Agency (EMA), as confirmed to Parliament two years ago.\n\nIn a statement Thursday, CNRG called for a comprehensive investigation charging that the company has an apparent disregard for human life.\n\nWe also call for a thorough investigation into the killing of Alfred Dzodzo, with those responsible held accountable under the Zimbabwean law, reads part of the statement.\n\nAdditionally, an audit should be carried out on Sino Africa Huijins financial activities, particularly its alleged involvement in gold smuggling and organized crime, their statement reads.\n\nFollowing Dzodzos death, CNRG has urged the Zimbabwean government to shut down the mine, expel the Chinese operatorswho are understood to be working without a valid licenceand grant mining rights to local artisanal miners. They argue these miners deserve to benefit from the natural resources in their communities.\n\nIn light of this, CNRG calls on the government to permanently shut down Sino Africa Huijin and open the site to Zimbabwean artisanal miners under the auspices of Zimbabwe Mining Development Corporation and Minerals Marketing Corporation of Zimbabwe. This will ensure Zimbabwean nationals can benefit from their natural resources whilst also ensure government generate revenues, part of the statement reads.\n\nSino Africa Huijin is no stranger to controversy. In January this year, Taurai Dozva died mysteriously while on night duty at the mine. The Chinese offered his family US$2,000 as compensation  a plaster on a gaping wound.\n\nIn November 2023, CNRG implored Parliament to shut down the mine due to environmental crimes and exploitative labour practices. The company also reportedly smuggles unprocessed gold out of the country, robbing Zimbabwe of crucial revenue, a financial haemorrhage bleeding the nation dry.\n\nReports of killings and abusive labour practices by Chinese nationals at Zimbabwean mining sites are rampant, a grim tapestry woven with threads of exploitation.\n\nThe Zimbabwe Environmental Law Society (ZELA) and other labour rights activists have condemned these killings.\n\nA violent confrontation at Bijou Farm in Gweru on January 21 further illustrates the tension. A worker demanding unpaid wages clashed with supervisors, igniting outrage on social media and strengthening calls for action against exploitative Chinese investors.\n\nThe incident involved Kholwani Dube, an excavator operator employed by Ming Chang Sino-Africa Mining Investments.\n\nBeyond its appalling human rights and safety record, Sino Africa Huijin is accused of siphoning gold from Zimbabwe. Workers allege that much of the gold they mine goes undeclared, disappearing into the pockets of the Chinese owners.\n\nDzodzos killing has reignited the debate surrounding the treatment of Zimbabwean workers by Chinese investors, with critics accusing authorities of turning a blind eye to labour violations, leaving a bitter taste of injustice.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/23170027/Screenshot-2025-01-23-at-18.58.25.png",
            "description": "<p>By Costa Nkomo THE Centre for Natural Resources Governance (CNRG) is demanding a thorough investigation into the death of another Zimbabwean at the Chinese-run Sino Africa Huijin Mine at Premier Estate in Old Mutare. Alfred Dzodzo was allegedly shot dead Wednesday night by a security guard who, without warning, fired directly into his face. Dzodzo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-zimbabwean-shot-dead-at-chinese-owned-mine/\">Another Zimbabwean shot dead at Chinese-owned mine </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "06 Apr 2025"
        }
    ]
}