{
    "news": [
        {
            "title": "Pomona City Biodigesters: WestProp’s Bold Blueprint for Sustainable Urban Living",
            "url": "https://www.newzimbabwe.com/pomona-city-biodigesters-westprops-bold-blueprint-for-sustainable-urban-living/",
            "content": "By Staff Reporter\n\nAT the heart of Westprops most ambitious urban development, Pomona City, a quiet revolution is underway  one that does not just build homes, but redefines how cities breathe, grow, and sustain themselves. At the centre of this transformation stands a $1 million biodigester facility, a bold move that signals a new era of infrastructure-led community building.\n\nThe Pomona City project, the brainchild of chief executive Mr Ken Sharpe, is not just a real estate project but a philosophy. Designed as a self-contained enclave where residents can live, work, shop, and play, the development is anchored in the belief that modern urban life must be both convenient and ecologically responsible. WestProps investment in wastewater treatment is a testament to that vision.\n\nWith the capacity to treat up to 6 million litres of wastewater daily, the biodigester facility is more than a utility  it is a statement. It ensures that Pomona Citys growth does not come at the expense of the environment, and that sustainability is not an afterthought but a foundational principle.\n\nIn a city where urban sprawl often outpaces infrastructure, WestProps decision to prioritize wastewater management is both rare and radical. The biodigesters not only reduce environmental strain but also support long-term health, hygiene, and resilience for thousands of future residents.\n\nThis is not just about pipes and pumps  it is about dignity and creating a city where families do not have to worry about sanitation, where businesses can thrive without infrastructure bottlenecks, and where urban planning meets global benchmarks.\n\nThe biodigester system also opens the door to circular resource use. Treated water can be repurposed for landscaping, construction, or even watering the Pomona City orchard use within the developmentturning waste into opportunity and reinforcing Pomona Citys ethos of regenerative living.\n\nObservers have begun noting that Westprop has consistently pushed the boundaries of what is possible in Zimbabwean real estate. From smart city ambitions to green infrastructure.\n\nPomona City is a living portfolio of innovation. The biodigester facility is just one chapter in a larger storyone where urban evolution meets strategic foresight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Staff Reporter AT the heart of Westprop’s most ambitious urban development, Pomona City, a quiet revolution is underway – one that does not just build homes, but redefines how cities breathe, grow, and sustain themselves. At the centre of this transformation stands a $1 million biodigester facility, a bold move that signals a new</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pomona-city-biodigesters-westprops-bold-blueprint-for-sustainable-urban-living/\">Pomona City Biodigesters: WestProp’s Bold Blueprint for Sustainable Urban Living</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "Warriors intensify preparations ahead of Benin clash",
            "url": "https://www.newzimbabwe.com/warriors-intensify-preparations-ahead-of-benin-clash/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens football team coach, Michael Nees, conducted training on Wednesday afternoon with a full squad following the arrival of European-based players.\n\nThe Warriors are in Abidjan, Ivory Coast, where they are set to play against Benin in a Group C World Cup Qualifiers encounter.\n\nZimbabwes group of players arrived on Monday, together with the technical team, followed by South African-based players on Tuesday, before the European-based players touched down on Wednesday.\n\nTeam vice captain Marshall Munetsi will not be with the squad in the Ivory Coast as he is serving a suspension; rather, he will meet with the rest of the squad on Sunday in South Africa, where they will play Rwanda on Tuesday.\n\nSpeaking ahead of Benin clash, Warriors goalkeeper Washington Arubi said the teams preparations will determine Fridays outcome.\n\nWe have had a good session, you can tell that the boys are ready to fight and we are looking forward to the game.\n\nSo for now, we are focusing on Benin and we are not thinking about the next game.\n\nOur preparations will determine if we will get the maximum points because we dont want to drop points at this stage in time, he said.\n\nZimbabwe is currently bottom in Group C of the 2026 Africa World Cup Qualifiers with 4 points and a win against Benin will keep their hopes of qualifying alive.\n\nHowever, this will depend on how group leaders South Africa (13 points) would have played against Lesotho, because a win for them will automatically shatter Zimbabwes chance of progressing despite a win against Benin.\n\nSouth Africa = 13 points\n\nBenin = 8 points\n\nRwanda = 7 points\n\nNigeria = 6 points\n\nLesotho = 5 points\n\nZimbabwe = 4 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03210657/warriors.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s football team coach, Michael Nees, conducted training on Wednesday afternoon with a full squad following the arrival of European-based players. The Warriors are in Abidjan, Ivory Coast, where they are set to play against Benin in a Group C World Cup Qualifiers encounter. Zimbabwe’s group of players arrived</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-intensify-preparations-ahead-of-benin-clash/\">Warriors intensify preparations ahead of Benin clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "No law bans tinted vehicle windows – Justice Minister says as police fines motorists",
            "url": "https://www.newzimbabwe.com/no-law-bans-tinted-vehicle-windows-justice-minister-says-as-police-fines-motorists/",
            "content": "By Anna Chibamu\n\nJustice Minister Ziyambi Ziyambi told the National Assembly on Wednesday that there is no law prohibiting tinted vehicle windows.\n\nHis remarks followed an announcement by Presidential Secretary Tafadzwa Muguti claiming that tinting had been banned, which sparked confusion and questions from legislators seeking clarification on the legal framework behind the directive.\n\nDuring the Question and Answer session, Zanu PF Zvimba East MP Kudakwashe Mananzva asked, We heard that it is now a criminal offence to tint car windows. Is it illegal to put some tint on your car?\n\nIn response, Ziyambi clarified: The law allows tinting on a vehicle, provided it does not obstruct the drivers clear line of vision. For side windows, we have not yet reached a final agreement together with Hon. (Felix) Mhona, Hon. (Kazembe Kazembe), and other stakeholders.\n\nDangamvura-Chikanga MP Prosper Mutseyami pressed further, asking whether Mugutis announcement represented government policy or his personal opinion.\n\nZiyambi stressed that only Information Minister Jenfan Muswere, Information Secretary Nick Mangwana, and Presidential Spokesperson George Charamba are authorised to speak on behalf of government. The moment someone speaks on behalf of the whole government without that authority, it becomes a mistake,he said.\n\nKuwadzana East MP Charlton Hwende revealed that some drivers had been fined by police following Mugutis announcement.\n\nZiyambi responded: There is no policeman who enforces social media announcements without a Statutory Instrument. Policemen enforce the law by quoting Statutory Instruments. If anyone was given a ticket, they have the right to go to court, and the court will take corrective measures. Our policemen are orderly; they do not do that.\n\nMP Gladys Hlatywayo questioned how government planned to address the policy discord that had caused confusion and public outcry. Ziyambi replied that the role of MPs was to provide oversight, not to set policy.\n\nEarlier, Charamba took to X (formerly Twitter) to clarify that Mugutis announcement was a miscommunication by an unauthorised official.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Anna Chibamu Justice Minister Ziyambi Ziyambi told the National Assembly on Wednesday that there is no law prohibiting tinted vehicle windows. His remarks followed an announcement by Presidential Secretary Tafadzwa Muguti claiming that tinting had been banned, which sparked confusion and questions from legislators seeking clarification on the legal framework behind the directive. During</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-law-bans-tinted-vehicle-windows-justice-minister-says-as-police-fines-motorists/\">No law bans tinted vehicle windows – Justice Minister says as police fines motorists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "Ten Chinese nationals in court over Harare cocaine bust",
            "url": "https://www.newzimbabwe.com/ten-chinese-nationals-in-court-over-harare-cocaine-bust/",
            "content": "By James Muonwa\n\nTEN Chinese nationals have appeared at the Harare Magistrates Court for initial remand following their arrest in a drug raid at a lodge.\n\nThe 10 accused personsare Huang Zhen (a male aged 39), You Hefe (male, 35), Song Yunmel (female, 27), Yuang Wanwan (female, 29), Wu Yuejun (female, 46), Yang Qin (female, 29), Fan Yue (male, 36), Sun Jie (male, 36), Yao Wenming (male, 40) and Li Zhongju (male, 31).\n\nThe prosecutor alleged that police pounced on the accused persons following a tip-off about all-night parties at 60 Knightsbridge Road, Newlands in Harare.\n\nAccused persons were caught sniffing cocaine, benzodiazepam and methamphetamine.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) noted that drug use fuels crime and destroys lives.\n\nThe justice system will deal firmly with those found peddling and abusing dangerous substances in Zimbabwe, said NPAZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By James Muonwa TEN Chinese nationals have appeared at the Harare Magistrates Court for initial remand following their arrest in a drug raid at a lodge. The 10 accused persons are Huang Zhen (a male aged 39), You Hefe (male, 35), Song Yunmel (female, 27), Yuang Wanwan (female, 29), Wu Yuejun (female, 46), Yang Qin (female,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ten-chinese-nationals-in-court-over-harare-cocaine-bust/\">Ten Chinese nationals in court over Harare cocaine bust </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "Love triangle turns deadly: Axe murder suspect arrested while fleeing to Zimbabwe",
            "url": "https://www.newzimbabwe.com/love-triangle-turns-deadly-axe-murder-suspect-arrested-while-fleeing-to-zimbabwe/",
            "content": "IOL\n\nPolice in Limpopo have arrested a 51-year-old Zimbabwean man who had been on the run after a violent love triangle turned deadly at Wegdraai Village, Maleboho.\n\nOn Wednesday morning,IOL reported thatthe horrific incident occurred on Monday at around 11 pm.\n\nThe suspect, who is the elder brother of a 20-year-old man arrested earlier this week, was cornered in the Alldays policing area on Tuesday night while attempting to flee the country.\n\nProvincial police spokesperson Colonel Malesela Ledwaba confirmed the arrest: The suspect, who had been on the run, was arrested at about 9 pm after he was found hiding in a truck headed towards Zimbabwe. Upon arrival, he was found carrying a bag of clothes in an attempt to flee the country. Like his younger brother, he was also found to be in the country illegally.\n\nThe case stems from the violent confrontation late on Monday after the brothers allegedly received information that the 55-year-old victim was romantically involved with the elder brothers girlfriend. They stormed into a homestead where the victim and a 38-year-old woman were present.\n\nOn arrival, a confrontation ensued, during which the elder brother allegedly attacked the man with an axe and severely injured the woman, said Ledwaba.\n\nParamedics certified the 55-year-old man dead at the scene, while the injured woman was rushed to hospital for urgent treatment.\n\nPolice swiftly arrested the younger brother at his home, where they recovered the bloodied axe, which he had allegedly tried to wash in an effort to destroy evidence. He was also confirmed to be an undocumented foreign national.\n\nBoth suspects  aged 20 and 51  face charges of murder, attempted murder, defeating the ends of justice, and contravention of the Immigration Act. They are scheduled to appear before the Senwabarwa Magistrates Court on Wednesday.\n\nMeanwhile,Limpopos provincial police commissioner, Lieutenant General Thembi Hadebe,welcomed the swift arrest and applauded community members for helping police track down the fugitive.\n\nThis was a brutal act of violence. We call upon communities to continue working closely with the police. We will not tolerate such despicable behaviour, and no one is above the law, said Hadebe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03144323/axe.png",
            "description": "<p>IOL Police in Limpopo have arrested a 51-year-old Zimbabwean man who had been on the run after a violent love triangle turned deadly at Wegdraai Village, Maleboho. On Wednesday morning, IOL reported that the horrific incident occurred on Monday at around 11 pm. The suspect, who is the elder brother of a 20-year-old man arrested earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/love-triangle-turns-deadly-axe-murder-suspect-arrested-while-fleeing-to-zimbabwe/\">Love triangle turns deadly: Axe murder suspect arrested while fleeing to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "Dali Mpofu: ‘People of Matabeleland in Zimbabwe are literally from South Africa’",
            "url": "https://www.newzimbabwe.com/dali-mpofu-people-of-matabeleland-in-zimbabwe-are-literally-from-south-africa/",
            "content": "By Jonisayi Maromo | IOL\n\nAdvocate Dali Mpofu, a senior member of theuMkhonto weSizwe (MK) party led by former president Jacob Zuma, has castigated deepening divisions among Africans, and called for development on the continent and the free movement of people.\n\nThe seasoned legal counsel was speaking at the launch ofZimbabwean veteran opposition politician Job Sikhalas book, Footprints in the Chains: The Life Story of Job Sikhala, in Johannesburg. Zimbabwean journalist and commentator Hopewell Chinono also attended and addressed the event.\n\nThe guest of honour at the Joburg event,Mozambican main opposition leader Venncio Mondlane, was allegedly blocked by Mozambican authorities from attending physically, but he addressed the event virtually.\n\nIn his address, Mpofu said Africans today are heavily dividedalong lines they cannot explain.\n\nIn the song (that was sung at the book launch event) somebody was talking about makwerekwere (a commonly used derogatory slur in South Africa against foreign nationals, particularly those from other African countries). We have allowed ourselves to be divided along lines that we also cannot even explain ourselves, said Mpofu.\n\nHow can we havemakwerekwerehere in Africa? Just tell me, how many people know that people of Matabeleland actually come from here? The entire Matabeleland  they come from here literally.\n\nMatabeleland is a vast region in southwestern Zimbabwe, named after the indigenous Ndebele people who reside there. It is divided into three modern-day provinces: Matabeleland North, Matabeleland South, and the city-province of Bulawayo.\n\nMpofu also referred to the sharing of languages among different groups of Africans found in different nations.\n\nThat is not a coincidence, we do not ask ourselves why? Why is that so? It is becauseMziilikaziwho moved from here, is the same person who was fighting alongside Shaka, and this is not a long time ago. It is less than 200 years ago. In historical terms, that is not a long time.\n\nBecause of those wars, Mzilikazi actually moved from what we call KZN (KwaZulu-Natal) now and lived here, in Gauteng, for a long time until the so-called Voortrekkers came and then it is only then that he moved across the Limpopo. So the very same people, who 200 years ago were sitting together in KZN are now calling each other  this one is makwerekwere. We must wake up as Africans, we really must, said the former chairperson of the Economic Freedom Fighters (EFF).\n\nHe said oppressors have used borders to divide Africans.\n\nWe worship things that have been imposed on us. Who came up with the borders? Was it us? In 1884 there was a meeting in Germany with white people only, not a single African. Not one African, I think even the people that were serving tea were white. And those people decided to cut our continent into pieces as they liked.\n\nIf my village and Jobs village, if they decided and cut it, he is now in another country and I am now in another country. They didnt care, they were cutting it according to the riches of the continent, said Mpofu.\n\nWhy is it that in the United States, you have 51 states and can move around without borders? Why are we as Africans not asking those questions? The answer is this: the only reason we are fighting is that we are not economically developing our continent.\n\nMpofu said if Africa was developing as a continent, there would be no need for the extensive restrictions on peoples movement.\n\nPeople do not move because they hate their homes. They move because of economic factors. That happens everywhere. I am here because of economic factors. I come from the Eastern Cape. So you can call me kwerekwere as well, said Mpofu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03143601/Dali-Hopewell.png",
            "description": "<p>By Jonisayi Maromo | IOL Advocate Dali Mpofu, a senior member of the uMkhonto weSizwe (MK) party led by former president Jacob Zuma, has castigated deepening divisions among Africans, and called for development on the continent and the free movement of people. The seasoned legal counsel was speaking at the launch of Zimbabwean veteran opposition politician Job</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dali-mpofu-people-of-matabeleland-in-zimbabwe-are-literally-from-south-africa/\">Dali Mpofu: ‘People of Matabeleland in Zimbabwe are literally from South Africa’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "Zimbabwe begins inventory of historical sites in Mozambique",
            "url": "https://www.newzimbabwe.com/zimbabwe-begins-inventory-of-historical-sites-in-mozambique/",
            "content": "AIM\n\nMozambican Prime Minister Benvinda Levi has announced that the Zimbabwean government has begun an inventory of historical sites and of their citizens who died in Mozambique during the struggle for liberation from colonial rule.\n\nZimbabwe gained its independence from British rule on April 18, 1980. During the liberation struggle, many Zimbabweans settled in Mozambican territory, especially in the central province of Manica, where both countries share a border.\n\nAccording to Levi  who was speaking to reporters on Monday, in Maputo, minutes after the end of a courtesy meeting granted to Zimbabwes Deputy President, Kembo Dugish Mohadi  the Deputy President came to Mozambique on a mission related to the monuments built in Mozambique to commemorate the deaths of Zimbabwean citizens.\n\nThe Prime Minister explained that the Zimbabwean mission will be accompanied by experts, including archaeologists, who will gather the necessary information to provide Zimbabweans with more information about their historical journey towards independence.\n\nMohadi, for his part, said that during the meeting, both countries discussed several issues, highlighting concern for creating better conditions for both peoples, Mozambicans and Zimbabweans.\n\nWe also discussed what we should do to improve the lives of our people economically; and we emphasized that, yes, we have our independence, we have our parliaments, we have our judiciary. But what we still dont have is economic independence, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03145249/MOHADI.jpeg",
            "description": "<p>AIM Mozambican Prime Minister Benvinda Levi has announced that the Zimbabwean government has begun an inventory of historical sites and of their citizens who died in Mozambique during the struggle for liberation from colonial rule. Zimbabwe gained its independence from British rule on April 18, 1980. During the liberation struggle, many Zimbabweans settled in Mozambican</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-begins-inventory-of-historical-sites-in-mozambique/\">Zimbabwe begins inventory of historical sites in Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        },
        {
            "title": "Musician Chillmaster banned from driving",
            "url": "https://www.newzimbabwe.com/musician-chillmaster-banned-from-driving/",
            "content": "By Mary Taruvinga\n\nProminent musician Kudakwashe Hombarume, better known as Chillmaster, has been banned from driving for nine months by Mbare Magistrate Tendayi Mukurunge, who convicted him three months ago.\n\nThe development comes after his case was remitted back to the lower court for the magistrate to reconsider punishment and to conduct a mandatory inquiry into whether Hombarume should be prohibited from driving under section 64(3) of the Road Traffic Act.\n\nJudge President, Justice Mary Zimba-Dube, on automatic review, slammed the magistrate for trivialising the offence after he spared him jail and committed the musician to community service.\n\nIn his latestrevised ruling, Mukurunge banned Chillmaster from driving for nine months with no other conditions.\n\nThe High Court had blasted the Mbare magistrate for imposing community service on a 24-year-old unlicensed musician ruling that the sentence trivialised the seriousness of culpable homicide arising from road traffic accidents.\n\nDelivering judgment on review, Justice Dube said the trial court misdirected itself by treating the offence as one of ordinary negligence when in fact the accuseds conduct showed gross negligence.\n\nThe facts of this case reveal a serious breach of road safety regulations by an offender who, without restraint, takes it upon himself to drive a vehicle without a licence, speeds and causes an accident leading to loss of life of an innocent person, Justice Dube wrote. Contrary to a finding of ordinary negligence, the facts disclose gross negligence.\n\nHombarume admitted driving a Honda Shuttle at up to 100 km/hr in a 60 km/h zone when he struck and killed 46-year-old Custon Charumbira in April this year.\n\nHe had no drivers licence.\n\nThe trial court sentenced him to 24 months imprisonment, wholly suspended on condition that he performs community service and does not commit a similar offence.\n\nJustice Dube said the magistrate erred by placing undue weight on the victim impact statement from Charumbiras widow, who had recommended a non-custodial sentence after the accused paid compensation, funeral expenses and pledged further support.\n\nA victim impact statement cannot trump the interests of justice, said the judge.\n\nCourts should not allow offenders to buy themselves out of a custodial sentence simply because they can pay compensation.\n\nThe judge stressed that with Zimbabwe facing high rates of accidents on our roads, courts had a duty to send a strong warning to offenders who drive without licences resulting in fatalities, that such conduct will attract censure of the courts.\n\nThe High Court withheld its confirmation of sentence, remitting the matter to the magistrate to reconsider punishment and to conduct a mandatory inquiry into whether Hombarume should be prohibited from driving under section 64(3) of the Road Traffic Act.\n\nThe aggravating features of this case do not justify community service, Justice Dube concluded. Community service imposed in circumstances such as these has the effect of trivialising the offence of culpable homicide arising from road traffic accidents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220103/Chillmaster.webp",
            "description": "<p>By Mary Taruvinga Prominent musician Kudakwashe Hombarume, better known as Chillmaster, has been banned from driving for nine months by Mbare Magistrate Tendayi Mukurunge, who convicted him three months ago. The development comes after his case was remitted back to the lower court for the magistrate to reconsider punishment and to conduct a mandatory inquiry</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musician-chillmaster-banned-from-driving/\">Musician Chillmaster banned from driving</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "04 Sep 2025"
        }
    ]
}