{
    "news": [
        {
            "title": "Mnangagwa moves to shield himself from coup threat with army vehicle handout",
            "url": "https://www.newzimbabwe.com/mnangagwa-moves-to-shield-himself-from-coup-threat-with-army-vehicle-handout/",
            "content": "By Staff Reporter\n\nAs the succession battle within Zanu-PF intensifies, President Emmerson Mnangagwa has moved to stave off any potential coup by awarding more than 700 senior army officers top-of-the-range, all-terrain vehicles, his spokesperson George Charamba has confirmed.\n\nMnangagwas decision follows his absence from the United Nations General Assembly amid intelligence reports suggesting the possible arrest of his loyalists, controversial business tycoons Kudakwashe Tagwirei, Wicknell Chivayo, Delish Nguwaya, and Paul Tungwarara.\n\nThe four were reportedly named in a corruption dossier Vice President Constantino Chiwenga presented at the recent Zanu-PF politburo meeting in Harare.\n\nHaunted by the spectre of November 2017, Mnangagwa appears to be taking no chances, seeking to appease the military, the traditional kingmakers in Zimbabwean politics.\n\nHis Excellency the President today handed over 102 vehicles to the ZDF in order to capacitate the Defence Force. All told, the ZDF will get over 700 vehicles, the first ever time that ZDF has received such a consignment within a short-time bracket, Charamba announced on his X account on Monday.\n\nThe timing has raised eyebrows, with many viewing the gesture as a clear coup-proofing strategy.\n\nCharamba defended the move, framing it as a fulfilment of service conditions for senior officers: The vehicles, which are part of the conditions of service for senior army officers, plug a gap in conditions of service for officers, some of whom had gone for a couple of years without a full set of their entitlements.\n\nHowever, he also revealed the allocation is structured as a loan. In public sector parlance, these vehicles are called personal issue service vehicles. What that means is that the vehicle is personal to the haver, who is also allowed to buy the vehicle after a stipulated time.\n\nThe development has already sparked public scrutiny, with critics demanding clarity on the source of funds and whether the purchase was accounted for in the 2025 national budget.\n\nObservers warn Zimbabwe is increasingly resembling a mafia-style economy where political elites distribute vehicles and perks like candy to loyalists and strategic allies in order to cling to power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29181705/army-ED.jpeg",
            "description": "<p>By Staff Reporter As the succession battle within Zanu-PF intensifies, President Emmerson Mnangagwa has moved to stave off any potential coup by awarding more than 700 senior army officers top-of-the-range, all-terrain vehicles, his spokesperson George Charamba has confirmed. Mnangagwa’s decision follows his absence from the United Nations General Assembly amid intelligence reports suggesting the possible</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-moves-to-shield-himself-from-coup-threat-with-army-vehicle-handout/\">Mnangagwa moves to shield himself from coup threat with army vehicle handout   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Zimbabwe to host IATF permanent secretariat",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/",
            "content": "APA News\n\nThe Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO).\n\nThe move, announced during IATF2025 in Algiers, marks a major milestone in Africas push for economic integration under the African Continental Free Trade Area (AfCFTA).\n\nThe decision to base the headquarters in Zimbabwe followed a competitive bidding process involving Burkina Faso, Cameroon, Malawi, Zambia, South Africa and Zimbabwe.\n\nFormer Nigerian President Olusegun Obasanjo, chairperson of the IATF Advisory Council, said Zimbabwe was selected for its strong conferencing infrastructure, air connectivity, accommodation capacity and commitment to land provision for future expansion.\n\nThis opens a new chapter for IATF as it continues powering growth in intra-African trade and playing its role as the most important trade and investment gathering on the continent, Obasanjo said.\n\nBacked by an initial capitalisation of $28 million approved by the African Export-Import Bank (Afreximbank), IATFCO will serve as the institutional anchor for the biennial trade fair, which has grown into the continents largest marketplace for intra-African commerce.\n\nAfreximbank president Benedict Oramah hailed the development as a huge milestone, urging African governments, corporations and financial institutions to support the institution during its formative phase.\n\nIATF is co-convened by Afreximbank, the African Union Commission and the AfCFTA Secretariat.\n\nIt provides a platform for businesses to showcase goods and services, forge partnerships and tap into AfCFTAs single market of over 1.4 billion people and a combined gross domestic product exceeding $3.5 trillion.\n\nThe 2025 edition of the fair, held from 4 to 10 September in Algiers, attracted over 112,000 visitors from 132 countries, hosted 2,148 exhibitors and generated $48.3 billion in trade and investment deals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>APA News The Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO). The move, announced during IATF2025 in Algiers, marks a major milestone in Africa’s push for economic integration under the African Continental Free Trade Area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/\">Zimbabwe to host IATF permanent secretariat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "Seychelles to hold presidential run-off after vote fails to produce clear winner",
            "url": "https://www.newzimbabwe.com/seychelles-to-hold-presidential-run-off-after-vote-fails-to-produce-clear-winner/",
            "content": "BBC\n\nSeychelles is set to hold a rerun of its presidential elections between the two main contenders, after no outright winner was announced.\n\nOpposition leader Patrick Herminie received 48.8% of the vote against the incumbent President Wavel Ramkalawan who garnered 46.4%, the electoral commission announced.\n\nAccording to the electoral rules, a candidate must obtain more than 50% of the vote to be declared the winner, and a run-off election has subsequently been scheduled for next week.\n\nSeychelles is Africas smallest country, a 115-island archipelago in the Indian Ocean with a population of just over 120,000.\n\nThere were eight presidential hopefuls in last weeks election.\n\nRamkalawan is seeking a second term, with his Linyon Demokratik Seselwa (LDS) party campaigning on economic recovery, social development and environmental sustainability.\n\nHis main challenger Herminie is from the United Seychelles party, which dominated the countrys political landscape from 1977 until 2020, when it lost its majority to Ramkalawans party.\n\nUnited Seychelles has regained control of the National Assembly, taking 19 out of 35 seats in the parliamentary elections held alongside the presidential vote.\n\nWe are ready for a second round. We start campaigning tomorrow, Herminie said in a televised address.\n\nPublic disquiet over the sovereignty and ecological stewardship of Assumption Island, one of the archipelagos most eco-sensitive territories, surfaced in recent days as an electoral touchpoint, following the islands leasing to a foreign hotel developer.\n\nThe issue may energise decisive backing from the six trailing presidential candidates and their supporters ahead of the run-off ballot slated for 9-11 October.\n\nSeychelles is renown for luxury and environmental tourism and is Africas wealthiest country in terms of average income per person, according to the World Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29192227/seychelles-vote.webp",
            "description": "<p>BBC Seychelles is set to hold a rerun of its presidential elections between the two main contenders, after no outright winner was announced. Opposition leader Patrick Herminie received 48.8% of the vote against the incumbent President Wavel Ramkalawan who garnered 46.4%, the electoral commission announced. According to the electoral rules, a candidate must obtain more</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seychelles-to-hold-presidential-run-off-after-vote-fails-to-produce-clear-winner/\">Seychelles to hold presidential run-off after vote fails to produce clear winner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "ZWG inflation rate slips to a negative 0,2%",
            "url": "https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to 0.2%, raising hopes that annual inflation,still in double digits,will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday.\n\nAccording to the latest data, the ZWG has maintained notable stability against the US dollar since September 2024, when it last registered a major dip.\n\nThe ZWG month-on-month inflation rate was 0.2% in September 2025, shedding 0.6 percentage points from the August 2025 rate of 0.4%. This means that prices, as measured by the all-items ZWG Consumer Price Index (CPI), decreased by an average of 0.2% between August and September 2025, Zimstat said.\n\nFood and Non-Alcoholic Beverages recorded a month-on-month inflation rate of 0.2% in September, up from 0.1% in August. In contrast, non-food inflation fell to 0.5%, down from 0.6% in the previous month.\n\nYear-on-year, however, inflation remains elevated. The ZWG year-on-year inflation rate for September 2025 was 82.7%, meaning prices increased by an average of 82.7% compared to September 2024, Zimstat added.\n\nThe Reserve Bank of Zimbabwe (RBZ) has continued to pursue a tight monetary policy to safeguard the ZiG currency introduced in April 2024. This has included maintaining a high policy rate to curb speculative borrowing and anchor both inflation and exchange rate expectations.\n\nMeanwhile, Zimstat reported that US dollar inflation remained steady, with the September 2025 month-on-month rate unchanged at 0%, while year-on-year inflation stood at 13.4%.\n\nOn the poverty benchmarks, the Food Poverty Line (FPL) for one person in September was ZWG 877.03, while the Total Consumption Poverty Line (TCPL) stood at ZWG 1,292.80,the minimum needed per person to cover both food and non-food requirements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to –0.2%, raising hopes that annual inflation, still in double digits, will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday. According to the latest data, the ZWG has maintained notable stability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/\">ZWG inflation rate slips to a negative 0,2%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "China opens world’s highest bridge, breaking its own record",
            "url": "https://www.newzimbabwe.com/china-opens-worlds-highest-bridge-breaking-its-own-record/",
            "content": "NBC News\n\nThe worlds highest bridge opened inChinaon Sunday, taking the crown from another bridge in the same province.\n\nThe Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province ofGuizhou.It is more than twice as high as the Royal Gorge Bridge, which is suspended 956 feet above the Arkansas River in Colorado and is the highest in the United States.\n\nAccording to Chinese state media, the new Guizhou bridge also sets a record as the worlds longest bridge in a mountainous region, spanning 4,600 feet across.\n\nHailed as Chinas latest infrastructure miracle, the bridge is designed to spur tourism and economic growth in one of the countrys least developed regions.\n\nThe mega project, constructed over three years and eight months, will cut travel time between the two sides of the canyon from two hours to two minutes and connect major tourist spots, officials said.\n\nTian Hongrui, a technician for the Huajiang Grand Canyon Bridge, said he felt proud to have left a mark.\n\nLeaving now is bittersweet, but this isnt the end, Tian told state-run broadcaster CCTV News. Its the start of a new chapter.\n\nThe bridge has a high-speed glass elevator that can send visitors to a coffee spot 2,600 feet above the river. Visitors can also try bungee jumping or a 1,900-foot-high glass walkway.\n\nThe province of Guizhou, which is home to about 40 million people, has undergone an infrastructure campaign in recent decades as part of theChinese governments war on poverty. It now has more than 32,000 bridges that are either completed or under construction, compared with about 2,900 in the 1980s.\n\nGuizhou is also home to what is now the worlds second-highest bridge, Duge Bridge, which opened in 2016.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29192519/china-bridge.png",
            "description": "<p>NBC News The world’s highest bridge opened in China on Sunday, taking the crown from another bridge in the same province. The Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province of Guizhou. It is more than twice as high as the Royal Gorge Bridge, which is suspended 956</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/china-opens-worlds-highest-bridge-breaking-its-own-record/\">China opens world’s highest bridge, breaking its own record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "High Court quashes Rusape councillors’ malicious prosecution damages award",
            "url": "https://www.newzimbabwe.com/high-court-quashes-rusape-councillors-malicious-prosecution-damages-award/",
            "content": "By Mary Taruvinga\n\nThe High Court has overturned a ruling that had awarded damages to six Rusape councillors who sued the town council for malicious prosecution, finding that the council never instigated their arrest and that their claims for legal fees and lost business were unsupported.\n\nJustices Sijabuliso Siziba and Isaac Muzenda allowed Rusape Town Councils appeal and dismissed the councillors claims, which had each been pegged at US$7,500.\n\nThe court a quo erred in finding the appellant liable for the delict of malicious prosecution, ruled Justice Siziba. There was no evidence that the council, as a legal persona, took a resolution to set the law in motion against the respondents. Without such resolution, the council cannot be said to have instigated prosecution.\n\nThe case stemmed from a 2020 tender row over the provision of legal services. The six councillors Lyton Sithole, Elizabeth Chidza, Joseph Nyamupera, Ndabaningi Mataga, Preference Chigwede and Peter Kwesha were arrested and charged by the Zimbabwe Anti-Corruption Commission (ZACC) with criminal abuse of duty after the tender was cancelled.\n\nHowever, at their criminal trial, State witnesses, including then Acting Town Secretary Fansen Shuwa, cleared them of wrongdoing, testifying that they had not been part of the committee handling the tender. The councillors were acquitted at the close of the States case.\n\nIn 2023, the six sued the council for malicious prosecution, demanding US$40,000 collectively in damages. The magistrates court later awarded them each US$5,500 for legal fees and US$2,000 for lost business opportunities.\n\nThe High Court said those awards had no evidentiary basis.\n\nMalicious prosecution requires more than merely reporting a case to the police, Justice Siziba said. A party can only be found liable if it acted in a manner that tended to overbear on the police to institute proceedings which they would not otherwise commence. That was not the case here.\n\nThe court noted that ZACC had independently approached town officials and obtained statements while the councillors were away, with no council resolution authorising or directing such action.\n\nOn the issue of damages, the judges stressed that special damages must be strictly proven. No receipts were produced to show that any payment was made to lawyers, Justice Siziba wrote. It was a misdirection for the trial court to rely on the Law Society tariff in the absence of proof of actual payment.\n\nThe judges also dismissed the claims for lost business opportunities as unsubstantiated.\n\nThe councillors victory in the lower court has now been nullified. Rusape Town Council will not be liable for any damages.\n\nIn the result, we found merit in the appeal by the appellant and thereby upheld the appeal, the judgment concluded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29191212/rusape.jpg",
            "description": "<p>By Mary Taruvinga The High Court has overturned a ruling that had awarded damages to six Rusape councillors who sued the town council for malicious prosecution, finding that the council never instigated their arrest and that their claims for legal fees and lost business were unsupported. Justices Sijabuliso Siziba and Isaac Muzenda allowed Rusape Town</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-quashes-rusape-councillors-malicious-prosecution-damages-award/\">High Court quashes Rusape councillors’ malicious prosecution damages award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        },
        {
            "title": "High Court slams magistrate for ‘excessive’ lifetime driving ban on reckless kombi driver",
            "url": "https://www.newzimbabwe.com/high-court-slams-magistrate-for-excessive-lifetime-driving-ban-on-reckless-kombi-driver/",
            "content": "By Mary Taruvinga\n\nThe High Court has revised the sentence of a commuter omnibus driver, ruling that a magistrate had gone too far in imposing a lifetime driving ban across all vehicle classes following a reckless driving conviction.\n\nRuzvidzo Freedom was convicted in June 2025 of reckless driving after he drove a Toyota Hiace kombi into oncoming traffic at the intersection of Second Street Extension and Upper East Road, Harare. Though no accident occurred, the trial court jailed him for two years and prohibited him from driving vehicles in classes 2, 4 and 5 for life, cancelling his licence entirely.\n\nOn automatic review, Justices Esther Muremba and Munamato Mutevedzi upheld the two-year mandatory jail term but blasted the blanket lifetime prohibition as a misdirection in law.\n\nThe trial magistrates decision to prohibit the accused from driving classes 2, 4, and 5 for life without distinguishing between the vehicle involved in the offence and other classes was therefore excessive and ultra vires, the judges ruled. Imposing a lifetime driving ban across all classes of motor vehicles on a first-time offender is a measure so severe that it should be reserved only for exceptional circumstances.\n\nThe court found that the magistrate had misapplied Section 53 of the Road Traffic Act, which provides escalating penalties based on repeat offences. For first-time offenders, the law prescribes a mandatory two-year minimum sentence plus a lifetime ban only from driving commuter omnibuses or heavy vehicles, not light motor vehicles.\n\nDriving against oncoming traffic signifies utter recklessness.\n\nBut apart from that, the magistrate must have noted that the offender was not involved in any accident, and there were no aggravating factors such as injury or damage. The degree of recklessness remained at the base of the recklessness ladder.\n\nThe High Court also warned magistrates against arbitrary prohibitions. A magistrate who plucks a prohibition from nowhere commits a gross irregularity which vitiates their decision.\n\nThe High Court reduced the lifetime ban to six months for light vehicles (Classes 4 and 5), while confirming that Freedom remains barred for life from driving commuter omnibuses (Class 2).\n\nHis licence was cancelled accordingly.\n\nThe judges ordered the trial magistrate to recall the offender from prison and formally advise him of the corrected sentence, ensuring the Registrar of Road Traffic Licences makes the proper amendments.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10145359/Kombi.jpg",
            "description": "<p>By Mary Taruvinga The High Court has revised the sentence of a commuter omnibus driver, ruling that a magistrate had gone too far in imposing a lifetime driving ban across all vehicle classes following a reckless driving conviction. Ruzvidzo Freedom was convicted in June 2025 of reckless driving after he drove a Toyota Hiace kombi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-slams-magistrate-for-excessive-lifetime-driving-ban-on-reckless-kombi-driver/\">High Court slams magistrate for ‘excessive’ lifetime driving ban on reckless kombi driver</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "30 Sep 2025"
        }
    ]
}