{
    "news": [
        {
            "title": "ZimParks successfully relocates 74 wildlife to revive Matusadona",
            "url": "https://www.newzimbabwe.com/zimparks-successfully-relocates-74-wildlife-to-revive-matusadona/",
            "content": "By Mary Taruvinga\n\nThe Zimbabwe Parks and Wildlife Management Authority (ZimParks), working with the Matusadona Conservation Trust, has successfully translocated 74 large herbivores to restore biodiversity in Matusadona National Park.\n\nThe month-long operation,completed in July 2025, according to ZimParks spokesperson Tinashe Farawosaw the relocation of 50 African buffalo and 10 common eland from Tsetse Island on Lake Kariba, along with 14 sable antelope from the Sibilobilo Safari Area on the Zambezi River.\n\nThis marks an important milestone in ongoing conservation efforts within Matusadona National Park, Farawo said.\n\nThese operations represent a significant step in the ongoing restoration of one of Zimbabwes most important conservation areas.\n\nFarawo said feasibility assessments were carried out beforehand to ensure the sustainability of the species and the long-term health of the parks ecosystem.\n\nHe said the translocations are expected to revive graze and browse dynamics, strengthen prey bases, and enhance ecosystem resilience across the Sebungwe region.\n\nThe translocations will help restore the ecological balance of the park, while supporting the broader restoration of the Sebungwe Region in the years to come, he said.\n\nThe initiative also received strong backing from the Nyaminyami community, whose newly ratified Land Use Plan, approved by the Minister of Local Government on July 29, was hailed as exceptional conservation leadership reinforcing long-term wildlife protection goals.\n\nDemonstrating world-class collaboration, the translocations were carried out with the expertise of African Wildlife Management and Conservation (AWMC), Wildlife Management Services International (WMSI), and Matusadonas Conservation and Veterinarian Unit.\n\nFunding was provided by both local and international donors, including the Global Wildlife Fund.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/14144612/MATUSADONHA.jpg",
            "description": "<p>By Mary Taruvinga The Zimbabwe Parks and Wildlife Management Authority (ZimParks), working with the Matusadona Conservation Trust, has successfully translocated 74 large herbivores to restore biodiversity in Matusadona National Park. The month-long operation, completed in July 2025, according to ZimParks spokesperson Tinashe Farawosaw the relocation of 50 African buffalo and 10 common eland from Tsetse Island</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-successfully-relocates-74-wildlife-to-revive-matusadona/\">ZimParks successfully relocates 74 wildlife to revive Matusadona</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "22 Aug 2025"
        },
        {
            "title": "Zimbabwe’s Rainbow Tourism Group invests R100 million in Cape Town hotel acquisition",
            "url": "https://www.newzimbabwe.com/zimbabwes-rainbow-tourism-group-invests-r100-million-in-cape-town-hotel-acquisition/",
            "content": "By Tawanda Karombo | IOL\n\nZimbabwe-listed hotelier, Rainbow Tourism Group (RTG), is expanding into South Africa with the $5.6 million (nealry R100 million) acquisition of a Cape Town commercial property that it intends to turn into a prime hotel.\n\nRTG, which runs city and resort hotels in Zimbabwe, said on Thursday that it wasin the process of finalising a strategicacquisition in Cape Townthrough its South African-registered subsidiary,Rainbow Tourism Group (SA).\n\nRTG SA hasentered into asale andpurchaseagreement withElleke Hospitality forthis acquisition. Under the agreement, RTG will acquire theseven-storey commercial property locatedalongBuitengracht StreetinCape Town.\n\nThe property which is currently a commercial asset,will undergo adaptive reuse and refurbishment to transform it into a branded hotel operated undera leading international hospitality group, said Tapiwa Mari, RTG company secretary.\n\nThe total consideration for the acquisition is roughly 9.3% of the companys market capitalisation on the Zimbabwe Stock Exchange (ZSE).\n\nRTG said the acquisition of the Cape Town property and its development into a branded hotel was in alignment with the boards overarching mandate to identify and pursue growthopportunities that support thecompanyslong-term vision of expansion.\n\nTo ensure world-class delivery, the Company is presently in advanced discussions with reputableinternational hotel brands to secure a management agreement for the acquired property, explained Mari.\n\nPartnering witha global operator is expected to drive international skills transfer, operational efficiency, and increasedvisibility of the RTG brand on the global stage.\n\nThe redevelopment of the property intoa modern, fully operationalhotelwill beconsistent with international hospitality standardsguided by thespecifications and brand standards of the selected global hotel partner.\n\nThis will ensure that the final productmeets world-class benchmarks in design, guest experience, and servicedelivery.\n\nRTG plans the Cape Town hotel tostand as a competitive and high-impact asset within Cape Towns hospitality landscape.\n\nTo finance the acquisition,RTGhas secured $6mloan facility from a Zimbabwean finance institution at terms it said were consistent with itsexisting borrowing arrangements.The loan facilitycarries a fixed interest rate of 12.5% per annum with a tenure of five years.\n\nOn drawdown, theloanfacility is expected toraise RTGsgearing ratio from 9% as at the endof 2024 to approximately 32% post the transaction.\n\nWith a premium location along a major arterial route leading into Cape Towns Central Business District (CBD)andofferinghigh visibility and pedestrian traffic,the acquisition property has closeproximity to key business and leisure landmarkssuch asincluding the V&A Waterfront, Cape Town International Convention Centre (CTICC), the DHL Cape TownStadium and the Bo-Kaap tourist district.\n\nThis premium location positions theproperty as an ideal candidate for conversion into a hotel development that caters to both corporateand leisure travellers, noted Mari.\n\nIts proximity to the CTICC enhances its suitability for the Meetings, IncentivesConferences, and Exhibitions (MICE) segment, while the surrounding cultural, culinary, and recreationalattractions boost its appeal to domestic and international tourists alike.\n\nThe Cape Town acquisition presents an opportunity to diversify both the Groups balance sheet and revenue streams byestablishing a presence in one of Africas most vibrant and competitive tourismmarkets.\n\nCape Townis aglobally acclaimed destination and a key hospitality hubofferingstrong market fundamentals, includinghigh occupancy rates, well-developed infrastructure, and year-round international visitor appeal.\n\nMari said establishing a footprint in this environment not only enhancesRTGsregional and global profilebut also provides direct access to global best practices in hospitality operations, customer experience,and service excellence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/09015520/Vic-Falls-Hotel.png",
            "description": "<p>By Tawanda Karombo | IOL Zimbabwe-listed hotelier, Rainbow Tourism Group (RTG), is expanding into South Africa with the $5.6 million (nealry R100 million) acquisition of a Cape Town commercial property that it intends to turn into a prime hotel. RTG, which runs city and resort hotels in Zimbabwe, said on Thursday that it was in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-rainbow-tourism-group-invests-r100-million-in-cape-town-hotel-acquisition/\">Zimbabwe’s Rainbow Tourism Group invests R100 million in Cape Town hotel acquisition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "22 Aug 2025"
        },
        {
            "title": "Four Zim referees selected for September World Cup Qualifiers",
            "url": "https://www.newzimbabwe.com/four-zim-referees-selected-for-september-world-cup-qualifiers/",
            "content": "By Sports Reporter\n\nFour Zimbabwean referees have been selected to officiate during the upcoming 2026 World Cup Qualifiers in September.\n\nThe four selected referees are Brighton Chimene, Luckson Mhara, Edgar Rumeck, and Lawrence Zimhondi.\n\nCenter referee Brighton Chimene and the trio will take charge of the match between the Democratic Republic of Congo and South Sudan on the 5th of September at the National Stadium in Juba.\n\nLuckson Mhara and Edgar Rumeck will serve as assistant referees, while Lawrence Zimhondi will be the fourth match official.\n\nThe quartets appointment is a testament to how well Zimbabwean match officials are performing on the international stage.\n\nChimene is currently officiating at the ongoing CHAN tournament, making him the only Zimbabwean referee at the games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Four Zimbabwean referees have been selected to officiate during the upcoming 2026 World Cup Qualifiers in September. The four selected referees are Brighton Chimene, Luckson Mhara, Edgar Rumeck, and Lawrence Zimhondi. Center referee Brighton Chimene and the trio will take charge of the match between the Democratic Republic of Congo and South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-zim-referees-selected-for-september-world-cup-qualifiers/\">Four Zim referees selected for September World Cup Qualifiers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "22 Aug 2025"
        },
        {
            "title": "Former clinic accountant jailed nine years for fraud and money laundering",
            "url": "https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/",
            "content": "By Mary Taruvinga\n\nThe Harare Magistrates Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering.\n\nAfter a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial.\n\nIn sentencing, the magistrate imposed a nine-year jail term, of which six years were suspended.\n\nThree were scrapped on condition of good behaviour and another three on condition of restitution.\n\nShayimana will serve an effective three-year prison term for fraud.\n\nOn the money laundering charge, he was handed a five-year sentence wholly suspended.\n\nMagistrates heard that between August 2023 and March 2024, Shayimana created and used fake company email accounts to mislead medical aid societies, fraudulently instructing them to divert payments due to the clinic into his First Capital Bank account and Ecobank Nostro account.\n\nProsecutors revealed that he pocketed ZWL$15,362,415, ZIG$95,409 and US$123,739, which he later converted into personal assets.\n\nThe offender deliberately abused his position of trust and orchestrated a sophisticated scheme to deprive the clinic and medical societies of large sums of money, the court noted.\n\nWith the proceeds of crime, Shayimana purchased a residential stand in Budiriro for US$6,500, developed it into a seven-roomed house complete with a durawall, security cameras and solar system, and also bought a Nissan NV200 vehicle. Both the house and the vehicle have since been forfeited to the State.\n\nThe court said deterrent penalties in cases of insider fraud would serve justice.\n\nConvicted white-collar criminals will face stiff penalties and ill-got wealth will be forfeited, the National Prosecuting Authority said, commenting on the conviction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga The Harare Magistrates’ Court has convicted and jailed for nine years a former Highview Clinic accountant on charges of fraud and money laundering. After a full trial, Tonderai Shayimana (30) was found guilty of siphoning funds meant for the medical institution into his personal accounts after a full trial. In sentencing, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-clinic-accountant-jailed-nine-years-for-fraud-and-money-laundering/\">Former clinic accountant jailed nine years for fraud and money laundering</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "22 Aug 2025"
        },
        {
            "title": "Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud",
            "url": "https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/",
            "content": "By Mary Taruvinga\n\nA Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare.\n\nShepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested in the UAE after years on the run and handed over to local authorities through Interpol cooperation.\n\nHe has since been remanded in custody pending trial.\n\nAccording to prosecutors, Beven Capital lured unsuspecting investors with promises of 50% returns in just six weeks, only for the schemes operators to vanish with millions.\n\nInstead of helping victims recover their money, Chibaya allegedly re-emerged to exploit them further by posing as a medical doctor at Parirenyatwa and Parktown Hospitals and pretending to have insider access to the schemes management. Authorities say he even became chairman of the defrauded investors group by leveraging these lies.\n\nIn one of the most elaborate scams, between 2020 and 2021, Chibaya allegedly defrauded a female investor of US$98,000, concocting stories about taxes, bribes and legal fees.\n\nHe is accused of faking his own arrest, impersonating a police officer, and later pretending to be dead to avoid detection.\n\nA stolen Samsung S20 cellphone was also traced back to him.\n\nOther counts include defrauding a complainant of US$850 in 2021 under the guise of tax fees and swindling another investor of US$2,000 after promising to help recover a US$30,000 investment while posing on duty as a doctor.\n\nA third investor lost US$2,000 after being promised recovery of his US$30,000 investment, with the accused again pretending to be on duty as a doctor when collecting cash, the court.\n\nAfter years on the run, the accused person was tracked down by Interpol in the UAE and handed over to Zimbabwean authorities. He has since been remanded in custody pending trial.\n\nIf convicted, Chibaya faces lengthy prison time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Mary Taruvinga A Zimbabwean man accused of masterminding the notorious Beven Capital Ponzi scheme has been extradited from the United Arab Emirates (UAE) and is now facing multiple charges of fraud, theft by deception, and impersonation in Harare. Shepherd Chibaya (36), identified as one of the founders of the collapsed investment scam, was arrested</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beven-capital-ponzi-scheme-fugitive-arrested-in-uae-after-years-on-the-run-extradited-to-zimbabwe-over-100000-fraud/\">Beven Capital Ponzi scheme fugitive arrested in UAE after years on the run, extradited to Zimbabwe over $100,000 fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "22 Aug 2025"
        }
    ]
}