{
    "news": [
        {
            "title": "New Start Centre suspends ART, PrEP refills",
            "url": "https://www.newzimbabwe.com/new-start-centre-suspends-art-prep-refills/",
            "content": "By Mary Taruvinga\n\nThe Population Solutions for Health (PSH) New Start Centre in Harares CBD has temporarily halted services for patients on ART and those seeking PrEP refills, NewZimbabwe.com has established.\n\nThis suspension follows the recent cessation of USAID funding resulting from the implementation of President Donald Trumps America First policy.\n\nAvisitby NewZimbabwe.com on Thursday revealed that the centre is currently providing only HIV testing services, while other programs, such as family planning and cervical cancer screening assistance, have been suspended.\n\nA notice put upat the entrance of the centre, instructsindividuals seeking services to visit their local clinics.\n\nPlease note that the New Start Centre is temporarily closed. For those due for (Antiretroviral Treatment) ART or PrEP refills, please proceed to the nearest city health clinic for assistance. Thank you for understanding, the notice states.\n\nPrEP is a medication that can help reduce your risk of contracting HIV through sexual contact.\n\nSome officials confirmed that testing services are the only offerings at this time.\n\nThe clinic is only open for those who want to be tested for HIV. We are currently not offering other services, officials at the reception explained.\n\nA similar situation is being reported in Masvingo.\n\nThe centre has typically provided integrated clinical services that included HIV testing, PrEP, TB screening and treatment, cervical cancer screening and treatment, as well as short-term and long-acting reversible contraceptives, and sexually transmitted infection (STI) screening and treatment, among other services.\n\nUpon his inauguration, Trump announced a range of changes to the United States funding model, emphasizing reasonable use of taxpayers money and prioritizing developments within the superpower itself.\n\nThis policy shift has led to millions of US dollars in funding being paused for local civil society organizations (CSOs), impacting billions globally.\n\nGiven that the United States is a significant funder of development in both the health and education sectors of Zimbabwe, there are growing concerns regarding the potential ramifications of these changes.\n\nThe US plays a crucial role in Zimbabwes efforts to combat sexually transmitted diseases and HIV, with PEPFAR providing funding for the majority of condoms and antiretroviral drugs (ARVs) distributed by local hospitals.\n\nCurrently, approximately 1.2 million Zimbabweans benefit from PEPFAR, and over 1,600 public hospitals and clinics have received training and technical support from the US government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06134918/WhatsApp-Image-2025-02-06-at-15.47.59.jpeg",
            "description": "<p>By Mary Taruvinga The Population Solutions for Health (PSH) New Start Centre in Harare’s CBD has temporarily halted services for patients on ART and those seeking PrEP refills, NewZimbabwe.com has established. This suspension follows the recent cessation of USAID funding resulting from the implementation of President Donald Trump’s America First policy. A visit by NewZimbabwe.com on Thursday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-start-centre-suspends-art-prep-refills/\">New Start Centre suspends ART, PrEP refills</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "Mafume fingers wife in hostel inspection storm",
            "url": "https://www.newzimbabwe.com/mafume-fingers-wife-in-hostel-inspection-storm/",
            "content": "By Staff Reporter\n\nHarare Mayor Jacob Mafume has pointed the finger at his wife in the growing controversy surrounding a luxury hostel inspection report he is building in Belvedere. Mafume told the retired High Court Judge Justice Maphios Cheda-led Commission of Inquiry today that his wife is overseeing the construction of the hostel intended to accommodate over 60 Harare Institute of Technology (HIT) students.\n\nThe property, allegedly acquired through kickbacks from South African firm Quill Associates (involved in Harare City Councils Enterprise Resource Plan), was reportedly built without adhering to council regulations regarding planning and inspection.\n\nMafume presented the commission with an inspection report showing six visits to the property in a single month, sometimes just three days apart, all seemingly documented with the same pen.\n\nTapiwa Fresh Godzi, leading the commissions evidence, questioned the speed of construction. I wonder at what rate the builders are working. Inspection after inspection every three days. Is that reasonable? he asked.Mafume maintained it was reasonable.\n\nCommission chairperson Justice Cheda inquired about the identity of the inspector. Mafume admitted he had never met the person face to face.\n\nThese people approving this building all have the same signature, correct? Justice Cheda asked. Mafume confirmed this and again, implicated his wife in the inspection furore.\n\nI have not met the inspector personally. They visit the site where there is a contractor. This is being handled by my wife, he stated.\n\nNewZimbabwe.com has learned that the City Council has no record of Mafume paying for any of the six inspections he presented to the commission. Sources say Mafume himself lacks receipts to prove payment.\n\nPayment is required for each inspection stage by city officials. Mafume made no payments and has no proof of payment for any of the inspections, a source stated.\n\nDuring his testimony, Mafume admitted he had not obtained council approval to change the propertys use from residential to commercial. Such changes require approval from the works and town planning committee, but Mafume made no application, and no committee meeting minutes exist approving the renovations.\n\nThe change of use plan does not exist. That one is not there, said a noticeably nervous Mafume.\n\nChange-of-use plans are typically paid for before construction begins.\n\nA typical building plan for the hostel Mafume is building costs around United States Dollars three thousand, which he has not paid to the council, a source said.\n\nThis represents a violation of by-laws that Mafume, as Harares mayor, is expected to uphold.\n\nAnother source claims Mafume used intermediaries to handle the hostel construction and the purchase of a Greendale mansion, avoiding direct involvement.\n\nThis, the source believes, was a strategy to evade scrutiny, but his shady deals have now come back to haunt him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05173920/mafume-home.png",
            "description": "<p>By Staff Reporter Harare Mayor Jacob Mafume has pointed the finger at his wife in the growing controversy surrounding a luxury hostel inspection report he is building in Belvedere. Mafume told the retired High Court Judge Justice Maphios Cheda-led Commission of Inquiry today that his wife is overseeing the construction of the hostel intended to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mafume-fingers-wife-in-hostel-inspection-storm/\">Mafume fingers wife in hostel inspection storm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "Tyla announced as part of the host committee for 2025 Met Gala",
            "url": "https://www.newzimbabwe.com/tyla-announced-as-part-of-the-host-committee-for-2025-met-gala/",
            "content": "IOL\n\nAs the countdown to the2025 Met Galabegins, all eyes are on the fresh faces set to make their mark on the iconic event.\n\nAmong the highly anticipated figures this year is Tyla, the South African singer whose rise to international fame has been marked by an unmatched blend of musical talent and bold style choices.\n\nFor the 2025 Met Gala,Tylas presenceon the Host Committee signals her role in amplifying the theme: Superfine: Tailoring Black Style.\n\nVogue revealed that the exhibition will spotlight the role of fashion in the formation and evolution of Black identities, specifically focusing on the rise and significance of theblack dandy.\n\nThis historic figure, whose fashion choices have long been a blend of self-expression and cultural defiance, will be front and center in an exploration of how Black men have reshaped traditional tailoring norms while influencing global style trends.\n\nTylas inclusion on the Host Committee for the event is no coincidence. The singer has become a symbol of how music and fashion intersect in the 21st century.\n\nWith her infectious tracks and dynamic visuals, Tyla has embraced a style that mixes bold streetwear with refined, tailored elements perfectly aligned with the Galas exploration of tailorings role in Black culture. For Tyla, the 2025 Met Gala is not just an event, its an opportunity to push boundaries and represent Black culture through fashion.\n\nThe dress code for the 2025 Met Gala,Tailored For You,invites attendees to interpret the theme with creative freedom, but with an emphasis on structure, fit, and the unique ways that black identity has been shaped by clothing.\n\nTylas influence on fashion and music is proof to how these worlds can converge, showcasing how modern Black style draws inspiration from the past while embracing the future.\n\nHer eclectic approach to fashion, blending bold colours, intricate tailoring, and African cultural elements, places her at the intersection of the events theme: the celebration of sartorial innovation within the Black community.\n\nTylas presence at the Gala alongside other cultural icons like Andr 3000, Janelle Mone, and Usher emphasises the importance of diverse representation across all fields.\n\nFrom music to sports, the committee is a true reflection of the multifaceted ways black culture influences global trends, especially in the world of fashion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06094120/Tyla-at-the-2024-Met-Gala.webp",
            "description": "<p>IOL As the countdown to the 2025 Met Gala begins, all eyes are on the fresh faces set to make their mark on the iconic event. Among the highly anticipated figures this year is Tyla, the South African singer whose rise to international fame has been marked by an unmatched blend of musical talent and bold</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tyla-announced-as-part-of-the-host-committee-for-2025-met-gala/\">Tyla announced as part of the host committee for 2025 Met Gala</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "Pilot dies in Air Force of Zimbabwe jet trainer crash",
            "url": "https://www.newzimbabwe.com/pilot-dies-in-air-force-of-zimbabwe-jet-trainer-crash/",
            "content": "By Staff Reporter\n\nA young trainee pilot Nesbert Tambudza has died following the crash of a Karakorum-8 (K-8) jet trainer aircraft in Gweru.\n\nThe accident happened near Guinea Fowl where Tambudza, an Air Lieutenantwas engaged in solo navigation training.\n\nIn a statement, ZDF Commander in Chief, Valerio Sibanda said there were no civilian casualties nor damage to property on the ground.\n\nOn behalf of Officers, men and women of the ZDF, the Commander Zimbabwe Defence Forces wishes to express his heartfelt condolences to the family, relatives, friends and colleagues of our departed Officer, Air Lieutenant Tambudza.\n\nAir Lieutenant Tambudza was a young pilot who had demonstrated immense potential and was therefore selected to undergo a jet flying conversion training course at Number 2 Squadron, Josiah Tungamirai Air Force Base in Gweru. At the time of his death, he was in the final phases of training on the K-8 jet.\n\nThe accident occurred about 5 kilometres East of Guinea Fowl and on impact with the ground the aircraft was extensively damaged, reads the statement.\n\nA Board of Inquiry has been constituted to investigate the cause of the accident.\n\nArrangements for the funeral parade and burial for Air Lieutenant Tambudza will be announced in due course.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06184352/airforce.jpg",
            "description": "<p>By Staff Reporter A young trainee pilot Nesbert Tambudza has died following the crash of a Karakorum-8 (K-8) jet trainer aircraft in Gweru. The accident happened near Guinea Fowl where Tambudza, an Air Lieutenant was engaged in solo navigation training. In a statement, ZDF Commander in Chief, Valerio Sibanda said there were no civilian casualties nor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pilot-dies-in-air-force-of-zimbabwe-jet-trainer-crash/\">Pilot dies in Air Force of Zimbabwe jet trainer crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "‘King Munhumutapa’ out on bail a month after arrest for insulting Mnangagwa",
            "url": "https://www.newzimbabwe.com/king-munhumutapa-out-on-bail-a-month-after-arrest-for-insulting-mnangagwa/",
            "content": "By Staff Reporter\n\nTimothy Chiminya, a man claiming to be King Munhumutapa who landed in trouble for insulting President Emmerson Mnangagwa is finally free after he was granted bail by the High Court.\n\nHe was arrested over a month ago. He was charged with undermining the authority of the president after he claimed to have been appointed as King Munhumutapa by a spirit medium which also gave him authority to appoint chiefs in Zimbabwe.\n\nIt is alleged that in February2024, Chiminya went to Chief Sekes homestead where he met Stanley Chimanike who was legally appointed as Chief Seke and told him that he had dethroned him and replaced himwithMasimba Rubatika.\n\nThe court heard that on 11 June 2024, Chimanike made a report of his dethronement by the accused to the Ministry of Local Government.\n\nThereafter, on dates unknown to the prosecutor but during the period from 11 June 2024 to 31 October 2024, the accused further appointed three more chiefs in Chirumhanzu and Zaka areas.\n\nHe appointed Julius Chimbi as Chief Chigegwe and Hama Piki in Chirumanzu. The accused also appointed Chief Nyakunhuwa in Zaka, Masvingo.\n\nAll the accuseds appointments were contrary to the Constitution of Zimbabwe and the Traditional Leaders Act and ridicule to the office of the President who has the executive powers to appoint Chiefs in Zimbabwe.\n\nHe proceeded to create parallel structures contrary to the ones set up by the President as per the Constitution of the Republic of Zimbabwe,  the State alleges further.\n\nThe State alleges that Chiminya undermined the authority of the president by causing ridicule as hepurportedto appoint chiefs he was performing a function that is the preserve of the president.\n\nHarare Magistrate Isheanesu Matova had dismissed his bail application ruling thathe is a security threat and did not deserve to be released from prison as he had dethroned some traditional leaders, who were installed by President Mnangagwa and that some subjects of the Chiefs, who were removed, were bound tofight the Chiefs, whom he had installed.\n\nAfter being denied bail, he mounted an appeal through his lawyerGift Mtisi of Zimbabwe Lawyers for Human Rights.\n\nThe appeal was upheld by High Court judge Justice Faith Mushure whoordered him to pay US$200 or its ZiG equivalent as bail surety.\n\nMushure also restricted him to a 25-kilometre travel radius from Harare Central Police Station until his matter is finalised.\n\nThe Judge also ordered Chiminya to report twice every week on Mondays and Fridays at Harare Central Police Station until his matter is finalised including surrendering his passport to the Clerk of Court at Harare Magistrates Court.\n\nThe traditional leader was also ordered not to interfere with state witnesses or investigations and to continue residing at his given residential address until his matter gets finalised.\n\nChiminya returns to court on 5 March 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/19060748/Timothy-Chiminya-King-Munhumutapa-e1734588504687.jpg",
            "description": "<p>By Staff Reporter Timothy Chiminya, a man claiming to be King Munhumutapa who landed in trouble for insulting President Emmerson Mnangagwa is finally free after he was granted bail by the High Court. He was arrested over a month ago. He was charged with undermining the authority of the president after he claimed to have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-munhumutapa-out-on-bail-a-month-after-arrest-for-insulting-mnangagwa/\">‘King Munhumutapa’ out on bail a month after arrest for insulting Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "Zimbabwe central bank keeps policy rate at 35%",
            "url": "https://www.newzimbabwe.com/zimbabwe-central-bank-keeps-policy-rate-at-35/",
            "content": "Reuters\n\nZimbabwes central bank said on Thursday that its monetary policy rate had been kept unchanged at 35%.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171617/rbz-.jpg",
            "description": "<p>Reuters Zimbabwe’s central bank said on Thursday that its monetary policy rate had been kept unchanged at 35%. Spurred by food and housing prices, Zimbabwe’s inflation rose sharply in January in both U.S. dollar and local currency terms. It launched a new gold-backed currency in April last year, but it was sharply devalued in September. Since the devaluation, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-central-bank-keeps-policy-rate-at-35/\">Zimbabwe central bank keeps policy rate at 35%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "US$4.5 million mysteriously disappeared from Harare City Council – Mayor Mafume tells Commission of Inquiry",
            "url": "https://www.newzimbabwe.com/us4-5-million-mysteriously-disappeared-from-harare-city-council-mayor-mafume-tells-commission-of-inquiry/",
            "content": "By Darlington Gatsi\n\nMORE than US$4.5 million inexplicably vanished from the Harare City Council (HCC) through its subsidiary, Harare Quarry, exposing rampant corruption within the local authority.\n\nThis was revealed during the ongoing Commission of Inquiry investigating the operations of the HCC.\n\nHarare Quarry received US$4.5 million from the City Council in 2018 to revive its operations. However, the money was blown withno traceablepaper trail.\n\nMayor Jacob Mafume made the startling disclosure to the retired Justice Maphios Cheda-led Commission of Inquiry Thursday as he continued with his testimony.\n\nThe money was stolen, Mafume said bluntly.\n\nWhen pressed by Cheda on who was responsible for the theft and what measures had been taken to investigate the missing funds he replied: The management of Quarry. We resolved to get the Police involved. What we did is, we instituted, what was done before we were elected as Councillors. This was done by the previous Council and the previous management.\n\nWe were elected in 2018. The money was stolen, I am trying to think when the loan was advanced. I am not too sure.\n\nHarare Quarry, one of theCity Councils subsidiaries, has become a hub of corruption, with top officials allegedly exploiting it for personal gain.\n\nThe company has also not been remitting funds to the City Council despite its premises being leased to private companies.\n\nMafume acknowledged that the company has been a financial burden to the Council requiring constant bailouts.\n\nI am very passionate about that US$4 million because that US$4 million is the one that has caused us to have differences with the management that was there. I have pursued it in different Council meetings. I have taken the actions within my power.\n\nAs of current, because the properties are being constantly attached, I have suggested that the entity be put under management or what we used to call liquidation. For the past three weeks, as Council we have had to pay amounts that are owed by the Quarry, said Mafume.\n\nHCC chamber secretary Warren Chiwawa said the matter has been reported to the Zimbabwe Anti-Corruption Commission.\n\nI had discussions with the Business Developmentmanager, who confirmed that we indeed made a report after the matter came up in one of the committee meetings, said Chiwawa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06142935/mafume-mayor.jpg",
            "description": "<p>By Darlington Gatsi MORE than US$4.5 million inexplicably vanished from the Harare City Council (HCC) through its subsidiary, Harare Quarry, exposing rampant corruption within the local authority. This was revealed during the ongoing Commission of Inquiry investigating the operations of the HCC. Harare Quarry received US$4.5 million from the City Council in 2018 to revive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us4-5-million-mysteriously-disappeared-from-harare-city-council-mayor-mafume-tells-commission-of-inquiry/\">US$4.5 million mysteriously disappeared from Harare City Council – Mayor Mafume tells Commission of Inquiry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "Miss Cote d’Ivoire 2025 pageant to emphasize African authenticity, bans weaves and wigs from upcoming beauty competition",
            "url": "https://www.newzimbabwe.com/miss-cote-divoire-2025-pageant-to-emphasize-african-authenticity-bans-weaves-and-wigs-from-upcoming-beauty-competition/",
            "content": "KenyaTimes\n\nFor the first time in the history of pageantry, a national beauty pageant has banned the use of weaves and wigs in the competition.\n\nThe Miss Cote dIvoire 2025 beauty pageant has prohibited the use of weaves, wigs, and any other hair extensions during the preselection stages of the competition.\n\nContestants are expected to showcase their natural hair. It could be long, short, braided, or shaved.\n\nThe organizing committee stated that these changes are meant to emphasize natural African beauty and authenticity.\n\nThe president of the organizing committee, Victor Yapobi, referenced past participants at the Miss Universe pageant that presented themselves with short natural hair.\n\nCote dIvoire becomes the first country pageant to introduce such measures, in a national competition.\n\nThis new requirement was also influenced by Marlene Kouassi who was crowned Miss Cote dIvoire in 2022. Kouassi participated in the pageant with short hair. The initiative aims at promoting self-acceptance and confidence among contestants.\n\nThe move has attracted mixed reactions with some people stating that Africa is setting its own standards while others felt it is a means to oppress black women.\n\nSo amazing! The Queens will save so much money, and CotedIvoirewill be the standard bearer for other nations to follow, said Maxine.\n\nMeanwhile the white, Latina, and Asian miss in other countries all wear extensions. People just love to oppress black women so badly. That should be a choice, not an obligation, said Caviar Olms.\n\nOther adjustments to the requirement include the minimum height requirement which has been adjusted from 1.68 meters to 1.67 meters. The age limit has also been extended from 25 years to 28 years.\n\nThe crowning of the Miss Cote dIvoire 2025 will take place on June 26, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06100722/cote-divoire.webp",
            "description": "<p>KenyaTimes For the first time in the history of pageantry, a national beauty pageant has banned the use of weaves and wigs in the competition. The Miss Cote d’Ivoire 2025 beauty pageant has prohibited the use of weaves, wigs, and any other hair extensions during the preselection stages of the competition. Contestants are expected to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miss-cote-divoire-2025-pageant-to-emphasize-african-authenticity-bans-weaves-and-wigs-from-upcoming-beauty-competition/\">Miss Cote d’Ivoire 2025 pageant to emphasize African authenticity, bans weaves and wigs from upcoming beauty competition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "Confirmed cases of cholera rise to 44 in Zimbabwe",
            "url": "https://www.newzimbabwe.com/confirmed-cases-of-cholera-rise-to-44-in-zimbabwe/",
            "content": "Xinhua\n\nZimbabwe has recorded 44 confirmed cases of cholera since the latest outbreak started in November last year, the Ministry of Health and Child Care said Tuesday night.\n\nAccording to a report released by the ministry, 10 new suspected cases were reported Tuesday and confirmed cholera deaths remained at two.\n\nThe latest outbreak occurred just three months after Zimbabwe declared the end of a previous 18-month-long outbreak, which resulted in 718 cumulative deaths, including 87 confirmed through laboratory testing, according to the World Health Organization.\n\nCholera is common in Zimbabwe, primarily due to poor sanitation infrastructure and residents exposure to contaminated drinking water.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/24110127/cholera.webp",
            "description": "<p>Xinhua Zimbabwe has recorded 44 confirmed cases of cholera since the latest outbreak started in November last year, the Ministry of Health and Child Care said Tuesday night. According to a report released by the ministry, 10 new suspected cases were reported Tuesday and confirmed cholera deaths remained at two. The latest outbreak occurred just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/confirmed-cases-of-cholera-rise-to-44-in-zimbabwe/\">Confirmed cases of cholera rise to 44 in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        },
        {
            "title": "‘Studio sex’ and ‘hitman threats’: Insiders speak out about Diddy’s 90s music empire",
            "url": "https://www.newzimbabwe.com/studio-sex-and-hitman-threats-insiders-speak-out-about-diddys-90s-music-empire/",
            "content": "BBC\n\nI have so much money now that I could hire someone to kill you, and nobody would know. No-one would miss you. No-one would know anything.\n\nFormer music executive Daniel Evans says he can still remember the threat from his old boss, Sean Diddy Combs  then known as Puff Daddy  to a colleague. It was 1997, he says, in the New York office of Combss Grammy Award-winning music label Bad Boy Records.\n\nIt was like, this is what money does to you, he says.\n\nCombs was often prickly, but Evans says power was transforming him. Just days before, the hip-hop mogul had received his biggest reward to date  $6m (4.8m) to mark the labels success, which boasted platinum-selling artists like The Notorious B.I.G.\n\nThat year Combss music career reached its peak, with his empire soon expanding into fashion, alcohol and even his own TV network.\n\nNearly three decades on, his legacy is in ruins as he sits in jail awaiting trial on charges of sex trafficking and racketeering alongside battling dozens of lawsuits accusing him of drugging and assault at lavish parties, high-end hotels and in his labels recording studio. He denies all the allegations.\n\nNow the BBC has spoken to more than 20 people who worked with Combs at Bad Boy Records  including former executives, assistants and producers  who describe for the first time troubling incidents they say they witnessed during its 1990s rise.\n\nSome executives say they had concerns after seeing Combs having sex with women in the studio, including one incident where the employee says the young woman did not seem to react when he walked in. Another staff member complained Combs asked her to bring him condoms.\n\nThe BBC also heard that corporate funds were used to fly in women from across the US for sex at the request of artists and other employees.\n\nThere was a course of conduct that became more egregious over time and that conduct does go back to the 90s, says Tony Buzbee, a US lawyer representing dozens of alleged victims, including one who says Combs threatened to kill her in similar terms to the incident Evans says he witnessed.\n\nHis client alleges Combs raped her on a bathroom floor at a promotional party held for The Notorious B.I.G., the labels biggest star, in 1995. She says in her lawsuit that afterwards, Combs told her not to tell anyone or you will disappear.\n\nIn a statement, Combss legal team accused Buzbee of being more interested in media attention than the truth and said the hip-hop star never sexually assaulted or trafficked anyone.\n\nThe 55-year-olds lawyers said they had not been provided with sufficient details about the BBCs claims to present the facts that would counter these fabricated accusations.\n\nAs weve said before, Mr Combs cannot dignify every publicity stunt or facially absurd claim with a response. He has full confidence in the judicial process, where the truth will prevail: these accusations are pure fiction, they said.\n\nA brash go-getter, Sean Combs became an overnight millionaire when he launched Bad Boy Records in 1993 with a roster of top artists.\n\nIt was Combss first venture, having already built a name for himself as a talent director at another music label, Uptown Records, aged 19.\n\nHe said that he wanted to be one of the biggest artists in the world and it didnt matter if I believed him or not, remembers Jimmy Maynes, a former Uptown colleague.\n\nMaynes remembers Combs having a short fuse in the office, sometimes banging his hands up against the desk like a bratty kid and yelling if he did not get his way.\n\nCombs was eventually fired from Uptown and at the age of 23 started Bad Boy Records.\n\nHes the hardest working man that Ive ever met and always wanted people to match his energy, says Daniel Evans, a senior executive who managed Bad Boys recording budgets and artists contracts between 1994 and 1997.\n\nCombs described himself as the Great Gatsby and swiftly became known for hosting coveted celebrity bashes at New York nightclubs, on the beaches of Cancun, Mexico, and later infamous White Parties  named after the all-white dress code  in the Hamptons.\n\nEven President Donald Trump attended events in the 90s, says Evans, who once saw him sit on a golden throne at Combss 30th birthday and exclaim: Im the real King of New York!\n\nWe were all really young. I was 24 years old, reflects Evans, who was one of the labels original employees. People wanted to party, have fun, hook up and build good memories.\n\nBut looking back, Evans says he is troubled by some of the things he witnessed about his bosss behaviour and the company culture.\n\nIn about 1995, he says he walked in on Combs having sex with a young woman at Daddys House, Bad Boys New York recording studio near Times Square.\n\nI was getting ready to go home for the night and looking for my jacket. Open the door and hes having sex with this girl, says Evans, who thought the studio was empty as it was silent. Combs swore and shouted at him to leave. I thought I was getting fired, he says.\n\nEvans remembers the young woman had been brought to the studio, presumably for a tour, by a party-promoter who was a friend of Combs. His boss seemed sober, while she was quiet and did not really talk, he says, wondering if she was high on drugs or just shy.\n\nHe says it did not seem unusual at the time. But recalling how the woman did not react when he entered the room, he says: Knowing what I know now, theres a lot of speculation about what state she was in usually both parties are very responsive during the act.\n\nFelicia Newsome, the manager of Daddys House recording studio between 1994 and 2000, says inappropriate conduct in the music industry as a whole was rife at the time.\n\nIt was abnormal if somebody reported it, but it wasnt abnormal for it to be happening, she says.\n\nNewsome says an employee once called her to the studio in the middle of the night because Combs was in his underwear, about to have sex with a model and another woman. He was demanding the staff member fetch him condoms, she recalls.\n\nI said to Puffy, dont ever ask anyone here to go and get condoms, says Newsome, who arrived while they were getting dressed again. He replied: I didnt need anything like that, ma, and never did it again.\n\nNewsome, then in her 30s, says she found Combs reasonable and that he changed his behaviour when she challenged him. On one occasion, when the studio first opened in 1995, she says Combs was unhappy about the look of the countertops and called her a bitch in front of staff.\n\nShe says she demanded a public apology and temporarily shut the studio, asking him: If Im bringing women into this space, which is open 24 hours, how do you want to treat people?\n\nCombs responded that he wanted it to be an inclusive and safe environment, she says.\n\nBut while Newsome ran the studio with an iron fist, she says other staff were less comfortable calling Combs out.\n\nBad Boy Records was a crazy house with a lot of young people who wanted to touch the Kings robes, she says.\n\nFormer staff say the label was run by twenty-something executives and a large number of interns, some of whom were of school age. There were often sexual relationships between employees and the interns, they say.\n\nEvans remembers an uncomfortable moment with a 14-year-old in his own team, who he says propositioned him.\n\nShe says to me, you work really hard. If you ever want to like, get loose, you and I should kick it but not tonight, I have a curfew.\n\nEvans says he sent her home and called the next day, telling her not to return to work. He did not report her, but two weeks later she was back working in the mailroom.\n\nArtists and other employees at Combss record label would sometimes also request for women to be flown in to have sex at the studio, the former executive says.\n\nIf they had a [sexual] specialty in something, they would be flown in, says Evans, who told the BBC he knew because he controlled the budgets. Money for the flights would be set aside and logged under travel, he adds.\n\nIt was probably like thousands of dollars, says Evans. I dont think it happened all that often, but it was definitely a recording expense.\n\nEvans says Combss own requests were managed by his personal assistants. One told the BBC that Combs would often ask them to fly in women he was messing around with and put them up in hotels, though the assistant said they were not sex workers.\n\nIn the 2000s, the Daddys House recording studio further changed, two former staff say, into a culture of sex, drugs and rocknroll. Combs would regularly bring random women there to party, turning up with an entourage of dozens of people in three white jeeps, with white rims and white leather seats, they say. Other artists would demand suitcases of Ciroc vodka and one even brought a monkey to a session, according to a former executive.\n\nThe studio is one of the locations where women have since accused Combs of drugging and raping them. Model Crystal McKinney alleges the mogul plied her with alcohol and marijuana before sexually assaulting her there in 2003. That same year, a woman alleges that Combs and two associates gang raped her at the studio when she was 17.\n\nCombss lawyers say he looks forward to proving his innocence, adding that McKinneys claims are without merit.\n\nMany ex-staff say they still find it hard to reconcile the allegations with the man they knew. These accusations are a surprise to me, as I am sure it is to many of our circle, says Jeffery Walker, a close friend of Combs who was part of Bad Boys original production team. Ive been to White Parties and of course studio sessions, and none of what he is accused of went down in my sight.\n\nEvans was also sceptical about some of the claims until he saw the footage of Casandra Ventura, Combss ex-partner of 10 years and a former Bad Boy artist, being brutally beaten by the rapper in a hotel in Los Angeles in 2016.\n\nVentura was the first person to sue Combs back in November 2023, alleging that he had trapped her in a cycle of abuse, violence, and sex trafficking during their relationship. Combs settled the lawsuit the next day for an undisclosed amount.\n\nIts not the first time Ive seen that temper, recalls Evans, thinking back to the death threat he says he witnessed back in 1997. Its hard to see. The guy in the video with Cassie is almost identical to the guy who threatened the employee. So, you wonder, has anything changed?\n\nOver the years, Sean Combs has repeatedly reinvented himself  from Puff Daddy, to P Diddy and in recent years, Love.\n\nIf Im acting crazy, like ahhh! thats Diddy. If Im dancing real smooth with a girl, thats Puff Daddy. And if Im looking like Im nervous or scared or shy, thats Sean, he said in an interview in 2015.\n\nWith more details likely to emerge when he goes on trial in May, many of those who were close to the rapper are questioning whether they knew the real Sean Combs at all.\n\nOne could think that hes just a disgusting human being, but thats not my memory of Puff, says Jimmy Maynes, who grew up with Combs in Mount Vernon, New York.\n\nBut after a pause, he adds: Or maybe money just gives people the freedom to be exactly who they really are, and he was that guy all along.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06095515/diddy.webp",
            "description": "<p>BBC “I have so much money now that I could hire someone to kill you, and nobody would know. No-one would miss you. No-one would know anything.” Former music executive Daniel Evans says he can still remember the threat from his old boss, Sean “Diddy” Combs – then known as Puff Daddy – to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/studio-sex-and-hitman-threats-insiders-speak-out-about-diddys-90s-music-empire/\">‘Studio sex’ and ‘hitman threats’: Insiders speak out about Diddy’s 90s music empire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:08",
            "date": "07 Feb 2025"
        }
    ]
}