{
    "news": [
        {
            "title": "Supreme Court upholds High Court ruling on tacit universal partnerships in Zimbabwe",
            "url": "https://www.newzimbabwe.com/supreme-court-upholds-high-court-ruling-on-tacit-universal-partnerships-in-zimbabwe/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has dismissed an appeal by a Harare lawyer, Samantha Nhende, challenging a High Court ruling that found she was in a tacit universal partnership with her former partner, Andrew Zigora, effectively upholding the division of their jointly acquired property.\n\nThe ruling reinforces the growing judicial recognition of tacit universal partnerships in Zimbabwe, particularly in relationships governed by customary law but exhibiting economic interdependence and joint contribution akin to civil marriages.\n\nIn Zimbabwe, a tacit universal partnership can arise when a couple cohabitates without a formal marriage, and a court determines they were operating as a partnership based on their conduct.\n\nTo establish this, one must prove: each party contributed something to the partnership (money, labour, or skills), the business was for their joint benefit, and the objective was to make a profit.\n\nIn a recent judgment delivered by Justice Hlekani Mwayera, sitting with Justices Susan Mavangira and George Chiweshe, the court ruled that Nhendes appeal had no merit.\n\nThe court also confirmed the lower courts decision to allocate 55% of the property to Nhende and 45% to Zigora.\n\nThe appeal be and is hereby dismissed with no order as to costs, the Supreme Court ruled.\n\nThe parties entered into an unregistered customary law union on 1 August 2010 and later dissolved it in February 2021.\n\nThroughout the subsistence of the union, both parties were formally employed.\n\nNhende earned US$2,000 monthly as a legal officer, while Zigora was also formally employed by a leading telecommunications company, receiving a gross monthly salary of US$5,000.\n\nPrior to the parties entering into the customary law union, Nhende owned a stand in Manresa Suburb, which was allocated to her by her employer.\n\nZigora also owned a stand in Madokero Suburb.\n\nDuring the union, on 1 November 2015, the parties moved into a flat in Avondale.\n\nThey split financial responsibilities with Zigora responsible for paying rentals of US$550 per month and utilities.\n\nNhende was accountable for food, clothes and maintenance of the house.\n\nWith time, the parties agreed to purchase a property in Mabelreign.\n\nThey mutually secured a mortgage home loan facility through Nhendes bank. The title was thus in Nhendes name.\n\nZigoras stand in Madokero was used as collateral for the mortgage loan.\n\nHe also made deposits into Nhendes bank account, including payments for the home insurance of the property.\n\nZigora also made contributions towards the renovations of the property.\n\nThe parties also incurred and shared medical bills in their efforts to undergo medical procedures to help Nhende conceive.\n\nThe medical issue led to the fallout of the parties, culminating in the dissolution of their customary law union.\n\nZigora approached the court a quo seeking an order for the distribution of the matrimonial property of the parties.\n\nHe argued that the parties unregistered customary law union was a tacit universal partnership in which both parties contributed individually and collectively to the acquisition of the property.\n\nAfter obtaining the mortgage bond, Nhendes salary was centred on the repayments of the loan, whereas he catered for all other expenses, including the renovations of the property, as it had been purchased to be a matrimonial home.\n\nThe parties intended to raise a family on that property.\n\nNhende in the High Court averred that there was no tacit universal partnership between herself and the respondent, because they each managed their finances individually, even though they were staying as husband and wife.\n\nShe argued that the concept of tacit universal partnership does not apply to customary law unions.\n\nThe property in question, located at 2 Glynde Avenue, Mabelreign, was purchased during the parties unregistered customary law union, which lasted from August 2010 to February 2021.\n\nThough the property was registered in Nhendes name and the mortgage was drawn from her salary, the court found that Zigora contributed significantly to the household, renovations, and insurance, and had even offered his own property in Madokero as collateral for the mortgage loan.\n\nThe High Court had ruled that the property was jointly owned through a tacit universal partnershipa finding Nhende contested on appeal.\n\nNhendes legal counsel, Mr. T. Mapuranga, argued that the High Court erred in law by finding a tacit universal partnership without direct evidence of pooled finances or shared ownership intentions. He further contended that the court failed to consider Zigoras Madokero stand as part of the parties combined estate and that improvements made by Zigora should have been addressed under unjust enrichment rather than as contributions justifying ownership.\n\nHowever, the Supreme Court disagreed.\n\nJustice Mwayera wrote: Their conduct during the acquisition and development of the property meets the requirements of a tacit universal partnership The parties consistently consulted each other on every intricate detail relating to the acquisition and renovation of the property.\n\nMwayera noted that the doctrine of tacit universal partnership applies where individuals in a close personal relationship contribute jointlyfinancially or otherwisefor their shared benefit, even outside a formal legal marriage.\n\nOn the issue of law application, the court reinforced that when customary law is inadequate to resolve a property dispute equitably, general law principles, such as tacit universal partnership and unjust enrichment, may justifiably be invoked.\n\nAddressing the division of the property, the court held that the High Court exercised its discretion judiciously by acknowledging both parties contributions.\n\nRegarding the Madokero property, the Supreme Court concurred with the respondents argument that it was irrelevant to the current dispute as it was not part of the pleadings before the High Court and had been acquired before the union.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has dismissed an appeal by a Harare lawyer, Samantha Nhende, challenging a High Court ruling that found she was in a tacit universal partnership with her former partner, Andrew Zigora, effectively upholding the division of their jointly acquired property. The ruling reinforces the growing judicial recognition of tacit universal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-upholds-high-court-ruling-on-tacit-universal-partnerships-in-zimbabwe/\">Supreme Court upholds High Court ruling on tacit universal partnerships in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        },
        {
            "title": "High Court dismisses application by Mugabe’s secret son seeking inclusion in late former President’s estate",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-application-by-mugabes-secret-son-seeking-inclusion-in-late-former-presidents-estate/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by the late former president Robert Mugabes secret son, who was seeking to be included as a beneficiary in the longtime rulers estate.\n\nThe alleged son, Tonderayi Gabriel Mugabe, was seeking condonation for the late filing of his review against the estate of the late Robert Gabriel Mugabe.\n\nIn his application, he cited Bona Nyemudzai Ouma Mutsahuni, acting in her capacity as the estates executrix and the Master of the High Court.\n\nBut High Court judge Fatima Maxwell dismissed his application, noting among other things that there was no documentation confirming that he is Mugabes son.\n\nThe inclusion of the fathers details on a birth certificate is proof of acknowledgement of paternity.\n\nThe exclusion, therefore, when the birth certificate was obtained during the lifetime of the alleged father is a clear indication that paternity was not acknowledged, said the judge.\n\nThe judge said re-registration of birth is governed by section 19 of the Births and Deaths Registration Act [Chapter 5:02].\n\nHe saidit can only be conducted where the status of a child is to be changed from being born out of wedlock to born in wedlock.\n\nSection 19 does not allow the re-registration of a birth of a child born out of wedlock whose parents never married and whose father is late.\n\nApplicant did not state that his mother ever married the late former President Robert Gabriel Mugabe.\n\nThat may be the reason why, even though the Births and Deaths Registration office might have bowed to the pressure of the name, they did not go as far as to reflect the details of the alleged father on the birth certificate.\n\nApplicant seems not to have understood the request by the Masters Office in Annexure D to obtain a birth certificate confirming his position.\n\nIt is not simply a matter of having a surname, but of having a birth certificate confirming that the alleged father is indeed the father as claimed.\n\nSuch confirmation would have been if the tendered birth certificate had the details of the father of the child.\n\nNone of the documents confirms who the father of the child is.\n\nWhilst it confirms that the applicant is a sibling of the other person tested, it does not show paternity. What it shows is that he might have been sired by one of the males related to the person who was tested.\n\nFor the above reasons, I find that the applicant has not discharged the onus of proving that he was entitled to benefit from the estate of the Late Robert Gabriel Mugabe.\n\nThere is no reason to allow the reopening of Estate Late Robert Gabriel Mugabe DR 2703/19. No basis has been laid to justify reviewing the Masters decision to confirm the account and close the estate, ruled the judge.\n\nMugabe asserted that he was the son of the former President Robert Gabriel Mugabe, having been born in Mozambique in 1977.\n\nHe presented a narrative of secretive family ties and a quest for identity within the Mugabe lineage.\n\nMugabe said he was born on 20 April 1977 in Chimoio, Mozambique to one Hilda Maeka, having been fathered by the late former president.\n\nHe said his parents met in Zimbabwe after independence, and for reasons unknown to him, his father did not want it to be disclosed to the public that he was his son until a later stage.\n\nHis mother died before the disclosure.\n\nMugabe also alleged that he would meet his father occasionally, but that was kept a secret from the first family.\n\nHe was, however, in contact with his fathers siblings, such as Bridget Mugabe, read court papers.\n\nMugabe further alleged that his father passed away before he was formally introduced to the Mugabe family.\n\nThe estate was advertised, and he notified the executor, Bona Mugabe, about his claim and the fact that he was the deceaseds son.\n\nAccording to court documents, Bonas lawyers requested a DNA Test.\n\nThe DNA tests confirmed that he was born of the Mugabe parental lineage.\n\nThrough a Notarial Deed of Change of Name, he changed his name from Tonderayi Maeka to Tonderayi Gabriel Mugabe.\n\nHe then approached Bona and her lawyers, but was not entertained.\n\nOn the 2nd of June 2023, he then learnt that the estate was closed on 18th of December 2020 by confirmation of the account.\n\nMugabe said he attempted to obtain a declaratory order for the reopening of the Estate of Late Gabriel Mugabe under case number HCH 3729/23 but was not successful.\n\nDespite these claims, the High Court also found the application for condonation lacking in merit, primarily due to his failure to provide a satisfactory explanation for the substantial delay of over four years in pursuing his claims.\n\nThe degree of non-compliance is inordinate, and the explanations given are rife with gaps, ruled the judge, emphasising the need for clear and convincing evidence in matters of inheritance.\n\nThe court deliberated on various factors, including the significance of the alleged heirs delay, which was described as inexplicable by the judge.\n\nWhile the applicant claims a right to the estate, he has not established a reasonable basis for the delay in filing his application, Justice Maxwell articulated, reinforcing the gravity of procedural timelines in legal proceedings.\n\nIn dismissing the application, the court cautioned against potential prejudice to the rightful beneficiaries of the Mugabe estate.\n\nThe balance of convenience favours the dismissal of this application as the deserving beneficiaries of the Estate Late Robert Gabriel Mugabe would be greatly prejudiced by the reversal of a process that was completed more than four years ago, said the judge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/29193343/Mugabe-Today.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by the late former president Robert Mugabe’s ‘secret son’, who was seeking to be included as a beneficiary in the longtime ruler’s estate. The alleged son, Tonderayi Gabriel Mugabe, was seeking condonation for the late filing of his review against the estate of the late</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-application-by-mugabes-secret-son-seeking-inclusion-in-late-former-presidents-estate/\">High Court dismisses application by Mugabe’s secret son seeking inclusion in late former President’s estate</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        },
        {
            "title": "ZIDA injects US$1,4 billion investments in just six months",
            "url": "https://www.newzimbabwe.com/zida-injects-us14-billion-investments-in-just-six-months/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Investment Development Agency (ZIDA) injected investments worth US$1,4 billion in the years first six months.\n\nThe details contained in the Mid-Term Budget Review published last week say ZIDA licensed 178 new investment projects, with a cumulative projected value of US$1.4 billion.\n\nThe investments are distributed as follows: Energy and Mining 36%; Manufacturing 24%; Agriculture and Agro-processing 20%; and Tourism, ICT, and Services 20%.Meanwhile, ZIDA strengthened its capacity to process and automate licensing processes during the period, said the Treasury.\n\nThe systems were strengthened by introducing an improved licensing tracker to monitor turnaround time for processing investor licenses and automating the license renewal process and compliance reporting as well as developing investor service charters in collaboration with key ministries.\n\nDuring the first half of 2025, ZIDA significantly advanced the Special Economic Zones (SEZ) agenda through strengthened partnerships, investment promotion and rendering operational support to SEZ owners, Treasury added.\n\nNotable achievements include signing key agreements to unlock the development of SEZs in Masuwe and Beitbridge.\n\nThe developments come at a time when Zimbabwe is desperately seeking investments after decades of isolation due to high country risk factors.\n\nWhile the government has made assurances to deal with all related bottlenecks, progress has been slow in addressing some factors like scarce capital, currency stability and exorbitant licensing fees.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26023140/Sec-Zim-CEO-Tafadzwa-Chinamo-scaled-1.jpeg",
            "description": "<p>By Alois Vinga THE Zimbabwe Investment Development Agency (ZIDA) injected investments worth US$1,4 billion in the year’s first six months. The details contained in the Mid-Term Budget Review published last week say ZIDA licensed 178 new investment projects, with a cumulative projected value of US$1.4 billion. “The investments are distributed as follows: Energy and Mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zida-injects-us14-billion-investments-in-just-six-months/\">ZIDA injects US$1,4 billion investments in just six months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        },
        {
            "title": "British drug mules jailed for 9 years each",
            "url": "https://www.newzimbabwe.com/british-drug-mules-jailed-for-9-years-each/",
            "content": "By Mary Taruvinga\n\nTwo British nationals have been slapped with a nine-year jail term each after they were convicted of smuggling 66 kgs of dagga into the country.\n\nThe two are Tihaise Darlin Elisha (19) and Taylor Tamara Simone (21).\n\nThe two were charged with unlawful dealing in dangerous drugs.\n\nProsecutors proved they were caught with 65,415kg of dagga at Robert Mugabe International Airport on May 1 this year.\n\nThe couple arriving aboard Ethiopian Airways Flight ET 873 were flagged by detectives from the CID Drugs and Narcotics after suspicious behaviour and intelligence led to a successful search of their four suitcases.\n\nThe search uncovered a total of 53 packets of cannabis hidden in red and brown luggage, tagged names of the offenders, said the National Prosecuting Authority.\n\nThe two will serve six years each after part of their sentence was suspended on condition of behaviour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Mary Taruvinga Two British nationals have been slapped with a nine-year jail term each after they were convicted of smuggling 66 kgs of dagga into the country. The two are Tihaise Darlin Elisha (19) and Taylor Tamara Simone (21). The two were charged with unlawful dealing in dangerous drugs. Prosecutors proved they were caught</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/british-drug-mules-jailed-for-9-years-each/\">British drug mules jailed for 9 years each</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        },
        {
            "title": "Ramaphosa admits SA is reeling from US tariffs, but insists it is not alone",
            "url": "https://www.newzimbabwe.com/ramaphosa-admits-sa-is-reeling-from-us-tariffs-but-insists-it-is-not-alone/",
            "content": "IOL\n\nPresident Cyril Ramaphosa has conceded that South Africa is grappling with the United States decision to impose a30% tariff on local imports, but insists the country is not alone in facing mounting global trade challenges.\n\nIn his weekly newsletter, Ramaphosa described the new US tariffs as a stark reminder of the urgent need to adapt to increasingly turbulent headwinds in international trade.\n\nThe US is South Africas second-largest trading partner by country, and these measures will have a considerable impact on industries that rely heavily on exports to that country and on the workers they employ, as well as on our fiscus, he said.\n\nSectors such as agriculture, automotive and textiles have historically benefited from duty-free access to the US market under the African Growth and Opportunity Act (AGOA), which now faces disruption.\n\nRamaphosa said that South Africas trade relationship with the US has historically been complementary, saying local exports do not compete with US producers and do not pose a threat to US industry.\n\nLargely, our exports are inputs into US industries and therefore support the United States industrial base, he said.\n\nSouth Africa is also the biggest investor from the African continent into the US, with 22 of our companies investing in a number of sectors including mining, chemicals, pharmaceuticals and the food chain.\n\nThe 30% tariff was recently announced by the Trump administration and will take effect on 7 August.\n\nSouth Africa is the only country in sub-Saharan Africa singled out for the steep tariff, reflecting deteriorating relations between Pretoria and Washington.\n\nOther African countries, such as Lesotho and Zimbabwe, will face a 15% tariff from the same date.\n\nThe announcement is a significant blow to South Africas economy, particularly as the government had been working to strengthen trade ties with the US.\n\nThis included deals on liquefied natural gas imports, easing poultry import regulations and investments in US industries.\n\nRamaphosa defended South African imports, arguing they ultimately benefit US consumers through greater variety and lower costs.\n\nFor example, citrus production is counter-seasonal and does not pose a threat to US production, he said.\n\nFurthermore, production by US companies has been on the decline due to low yields, citrus greening disease and other factors unrelated to competition from imports.\n\nSouth Africa, the worlds second-largest citrus exporter, has helped to stabilise supply and prices in the US market.\n\nWe have been engaging the United States to enhance mutually beneficial trade and investment relations. All channels of communication remain open, said Ramaphosa.\n\nOur foremost priority is protecting our export industries.\n\nHe said the government would continue to engage with US officials while also accelerating efforts to diversify export markets, particularly within Africa.\n\nWith a view to helping our producers and exporters aggressively explore alternative markets, we have established an Export Support Desk to assist affected producers, he said.\n\nRamaphosa added that details of a support package for companies, producers and workers impacted by the tariffs would be announced soon.\n\nHe said the intervention would also assist industries seeking to expand into regions such as the rest of Africa, Asia, the Middle East and other existing trade agreement markets.\n\nStrengthening regional value chains will be key to building resilience for our export markets in the longer term, he said.\n\nMuch as strengthening and establishing alternative value chains will take time, this moment presents us with an opportunity to push forward with the implementation and expansion of the African Continental Free Trade Area (AfCFTA).\n\nRamaphosa stressed the need to reduce South Africas dependence on specific export markets, calling it a strategic imperative to build economic resilience.\n\nIn the coming months, we will be scaling up our trade missions into new markets in Africa and beyond, as well as the National Exporter Development Programme, whose aim is to grow the pool of export-ready companies, he said.\n\nTrump has opposed several South African policies, including land expropriation, which he controversially claimed allowed land to be taken from white farmers.\n\nThe Presidency has firmly denied such claims,including that one of genocide on white farmers.\n\nRamaphosa met with Trump in May in a bid to mend relations, but no progress was made as things had gone worse.\n\nDespite growing tensions, Ramaphosa insisted that South Africa is not alone in facinghigh tariffs.\n\nA number of export-reliant developed and developing economies, including several on the continent, are also grappling with these measures, he said.\n\nThe international trading system is changing. Complacency will not serve us, and building resilience is imperative.\n\nMeanwhile, the Minister of Departments of Trade, Industry and Competition Parks Tau and Minister of International Relations and Cooperation Ronald Lamola will be having a joint press briefing on Monday morning to address the issue of high tariffs.\n\nThe briefing will take place at 10 a.m. at the Germiston Civic Centre, in Ekurhuleni.\n\nMeanwhile on Saturday,ANC NEC member Dr Kgosientsho Ramokgopatold journalists there had been a spirited and robust discussion on the US tariffs.\n\nHe said negotiations between the US and South Africa were ongoing, and expressed confidence that the two nations would be able to find each other.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/02032135/Cyril-Ramaphosa.png",
            "description": "<p>IOL President Cyril Ramaphosa has conceded that South Africa is grappling with the United States’ decision to impose a 30% tariff on local imports, but insists the country is not alone in facing mounting global trade challenges. In his weekly newsletter, Ramaphosa described the new US tariffs as a stark reminder of the urgent need to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-admits-sa-is-reeling-from-us-tariffs-but-insists-it-is-not-alone/\">Ramaphosa admits SA is reeling from US tariffs, but insists it is not alone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        },
        {
            "title": "ZBC appoints Sugar Chagonda as CEO",
            "url": "https://www.newzimbabwe.com/zbc-appoints-sugar-chagonda-as-ceo/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Broadcasting Corporation (ZBC) has appointed veteran broadcaster Sugar Chagonda as its Chief Executive Officer (CEO).\n\nHis appointment comes after a series of interim leadership changes following the departure of Adelaide Chikunguru under controversial circumstances last year.\n\nChagondas return to the national broadcaster marks a full-circle moment, having worked at ZBC as a reporter and news anchor.\n\nZBC confirmed Chagondas appointment, saying his expertise will transform the public broadcaster.\n\nThe Zimbabwe Broadcasting Corporation (ZBC) Board of Directors is pleased to announce the appointment of Mr. Sugar Chagonda as the substantive Chief Executive Officer (CEO) of the national broadcaster, effective August 1, 2025.\n\nA distinguished media strategist and corporate affairs expert, Mr. Chagonda brings a wealth of experience, intellectual rigour and transformative leadership to ZBC.\n\nMr. Chagondas illustrious career spans over two decades, marked by strategic foresight and an unrelenting dedication to organisational growth, read the statement.\n\nChagonda faces an uphill task of transforming ZBC into a viable entity after it emerged that the public broadcaster is haunted by mismanagement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/04122229/Sugar-Chagonda.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Broadcasting Corporation (ZBC) has appointed veteran broadcaster Sugar Chagonda as its Chief Executive Officer (CEO). His appointment comes after a series of interim leadership changes following the departure of Adelaide Chikunguru under controversial circumstances last year. Chagonda’s return to the national broadcaster marks a full-circle moment, having worked at ZBC</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zbc-appoints-sugar-chagonda-as-ceo/\">ZBC appoints Sugar Chagonda as CEO </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        },
        {
            "title": "Edgar Lungu repatriation matter back in the High Court in Pretoria",
            "url": "https://www.newzimbabwe.com/edgar-lungu-repatriation-matter-back-in-the-high-court-in-pretoria/",
            "content": "SABC News\n\nThe impasse over the final resting place offormer Zambian President Edgar Lunguheads back to the High Court in Pretoria today for a final determination on the matter.\n\nThe Zambian government is seeking declaratory relief, which would entitle it the right to repatriate the former Presidents body to Zambia for a state funeral and burial in Embassy Park, Lusaka.\n\nLungus burial, which was set to take place in June this year, was interdicted (by agreement between parties) pending the final determination of this issue.\n\nThe Zambian government charges in papers that while former President Lungus benefits were suspended when he became engaged in active politics, that impediment fell away upon his passing.\n\nAs a result, Lungu became entitled to a state funeral and the Zambian government acquired the right to accord him such.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>SABC News The impasse over the final resting place of former Zambian President Edgar Lungu heads back to the High Court in Pretoria today for a final determination on the matter. The Zambian government is seeking declaratory relief, which would entitle it the right to repatriate the former President’s body to Zambia for a state funeral and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/edgar-lungu-repatriation-matter-back-in-the-high-court-in-pretoria/\">Edgar Lungu repatriation matter back in the High Court in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:17",
            "date": "05 Aug 2025"
        }
    ]
}