{
    "news": [
        {
            "title": "UK gospel singer Chahwanda charged with further offences as part of sexual offences investigation",
            "url": "https://www.newzimbabwe.com/uk-gospel-singer-chahwanda-charged-with-further-offences-as-part-of-sexual-offences-investigation/",
            "content": "UNITED KINGDOM-based gospel musician and pastor Walter Chahwanda has been charged with ten additional offences as part of an ongoing sexual offences investigation.\n\nChahwanda (33) of Plemonstall Court, remains in custody on remand. He was previously arrested by Merseyside Police detectives on 13 March 2025 and 27 February 2024.\n\nHe was initially charged with eleven offences in March 2025, as follows:RapeAssault by penetrationCyber flashingFive offences of Sexual activity with a female aged 13-15yrsSexual communication with a childCause a child to watch an image of sexual activityBlackmail\n\nAs part of this investigation, ten further charges have now been authorised as follows, involving multiple victims:BlackmailTwo counts of engaging in sexual communications with a childSix counts of Malicious communicationsCause a child to view a sexual act\n\nChahwanda will remain in custody to appear on trial in September.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/11152727/Walter-Chahwanda.webp",
            "description": "<p>UNITED KINGDOM-based gospel musician and pastor Walter Chahwanda has been charged with ten additional offences as part of an ongoing sexual offences investigation. Chahwanda (33) of Plemonstall Court, remains in custody on remand. He was previously arrested by Merseyside Police detectives on 13 March 2025 and 27 February 2024. He was initially charged with eleven</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-gospel-singer-chahwanda-charged-with-further-offences-as-part-of-sexual-offences-investigation/\">UK gospel singer Chahwanda charged with further offences as part of sexual offences investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "Boy’s mutilated body found with missing parts in suspected ritual killing",
            "url": "https://www.newzimbabwe.com/boys-mutilated-body-found-with-missing-parts-in-suspected-ritual-killing/",
            "content": "By Staff Reporter\n\nPOLICE in Mashonaland West have arrested a 32-year-old Chinhoyi man for allegedly killing a boy before removing some body parts suspectedly for rituals.\n\nThe mutilated body was found with the stomach ripped open and the genitals were missing.\n\nThe discovery was made on Monday, leading to the arrest of Lloyd Gwenhere of Chogi farm, Inyathi, Chinhoyi.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera confirmed the gory incident.\n\nCID Chinhoyi arrested Lloyd Gwenhere aged 32, in connection with a case of murder which occurred at Chogi Farm, Inyathi in Chinhoyi, said Kohwera.\n\nThe victim, Munyaradzi Shumba (9), was found dead with a ripped stomach. The neck and left hand were cut, while the victims private parts were missing.\n\nAccording to police, the suspect was allegedly spotted assaulting the victim for letting cattle stray onto his field.\n\nCircumstances are that on June 8, 2025, the deceased was harvesting grains with his grandfather, Isaac Shumba (70) when he was ordered to take over herding cattle from his sister, aged 10, at around 1500 hours.\n\nAt around 1600hrs, elder Shumba sent his daughter, Vongai Shumba (29), to look for Munyaradzi so that he could bring cattle to pull a cart laden with harvested grains.\n\nVongai failed to locate Munyaradzi, prompting her and her father to collect the grain up to around 1700 hours, but Munyaradzi was still nowhere to be found, leading to a search.\n\nA neighbour, Tariro Kwangwari, later told the family that she had witnessed the accused person assaulting the boy before sunset for letting cattle graze on his field.\n\nSearches were conducted by family members and other villagers around the area where the suspect had been seen assaulting the deceased, but they found only his rafters and a pool of blood, said Kohwera.\n\nA further search the next morning unearthed the grisly find of the mutilated body tucked in the grass about 15 metres from the point where the juvenile was allegedly assaulted.\n\nGwenhere was immediately arrested and is helping police with investigations.\n\nInvestigations are underway to establish the cause of the death in a case suspected to be ritual murder. The general public is urged to respect the sanctity of life, said the police spokesman.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter POLICE in Mashonaland West have arrested a 32-year-old Chinhoyi man for allegedly killing a boy before removing some body parts suspectedly for rituals. The mutilated body was found with the stomach ripped open and the genitals were missing. The discovery was made on Monday, leading to the arrest of Lloyd Gwenhere of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boys-mutilated-body-found-with-missing-parts-in-suspected-ritual-killing/\">Boy’s mutilated body found with missing parts in suspected ritual killing </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "State drops charges against Mpofu, Chimombe in US$9 million streetlights scandal",
            "url": "https://www.newzimbabwe.com/state-drops-charges-against-mpofu-chimombe-in-us9-million-streetlights-scandal/",
            "content": "By Mary Taruvinga\n\nThe state on Wednesday dropped charges against businessmen Moses Mpofu and Mike Chimombe who were accused of swindling the Harare City Council US$9 million in a botched streetlights tender.\n\nWhisper Mabhaudhi, representing the National Prosecuting Authority (NPA) withdrew the charges against the two before plea without giving reasons for the States decision.\n\nTrial was due to commence before High Court judge Justice Benjamin Chikowero.\n\nThe state was accusing the two of misrepresenting their credentials to secure the tender.\n\nThe state further alleged that the two submitted that they had the specific required experience by falsely claiming they had undertaken light bulb installations in the Harare CBD.\n\nIt was also alleged that they lied that they had previously installed Christmas lights for the City of Harare.\n\nThe state alleged the two provided unregistered audit documents to bolster their application.\n\nAfter being awarded the tender, Mpofu signed as the managing director of Juluka, their company at the centre of the controversy, while Chimombe validated the documents.\n\nThe action facilitated the release of US$260,000 as part payment for the alleged services.\n\nCommenting on the latest development, their lawyers said the States case was too weak.\n\nIm certain the state just realised that its case against our clients was too weak, said Chimombes lawyer Ashiel Mugiya.\n\nThe withdrawal of the charges by the state is a welcome development.\n\nOur clients are on record regarding the weakness of the state case and that the charges they are facing are trumped up, baseless and unfounded. They have no case to answer.\n\nIt is only unfortunate that such withdrawal happens after all this long and after the long pre-trial incarceration for so long, said Advocate Tapson Dzvetero, representing Mpofu.\n\nThe partners still have one more pending criminal case currently being heard before High Court judge Justice Pisirayi Kwenda.\n\nIn this case, they are accused of defrauding the state of US$7 million in a presidential goats pass on project.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga The state on Wednesday dropped charges against businessmen Moses Mpofu and Mike Chimombe who were accused of swindling the Harare City Council US$9 million in a botched streetlights tender. Whisper Mabhaudhi, representing the National Prosecuting Authority (NPA) withdrew the charges against the two before plea without giving reasons for the State’s decision.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/state-drops-charges-against-mpofu-chimombe-in-us9-million-streetlights-scandal/\">State drops charges against Mpofu, Chimombe in US$9 million streetlights scandal </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "Ranger dies after rhino attack",
            "url": "https://www.newzimbabwe.com/ranger-dies-after-rhino-attack/",
            "content": "By Tapiwa Svondo\n\nA Save Valley Conservancy wildlife ranger, Knowledge Mudzimureka, has succumbed to the severe injuries he sustained in a rhino attack.\n\nMudzimureka died on June 8, two weeks after the attack, which happened during a routine patrol.\n\nOn 26th May 2025, Knowledge, accompanied by one other ranger, was on a routine patrol, tracking a different rhino when they unexpectedly encountered a mother black rhino and her calf. The rhino cow severely injured Knowledge, who sustained wounds to his abdomen, particularly his left lung, as well as to his head, shoulder, and knee.\n\nKnowledge was immediately evacuated on an ACE Air Ambulance and received exceptional care from the medical team at a private hospital in Harare, reads a statement by Zimparks spokesperson Tinashe Farawo.\n\nHe underwent two serious operations; on arrival to stabilise him, and a subsequent procedure to address a critical infection in his lungs.\n\nKnowledge had started to turn a corner, and the doctors were expressing optimism and positivity, his passing has shocked our entire community with grief.\n\nThe Zimparks will hold a burial service in honour of Mudzimureka.\n\nAnother Zimparks ranger was trampledto deathby an elephant in Kariba. The fatal accidentsunderscore the increasing risks faced by the frontline conservationworkers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/28022541/Black-Rhinos.png",
            "description": "<p>By Tapiwa Svondo A Save Valley Conservancy wildlife ranger, Knowledge Mudzimureka, has succumbed to the severe injuries he sustained in a rhino attack. Mudzimureka died on June 8, two weeks after the attack, which happened during a routine patrol. “On 26th May 2025, Knowledge, accompanied by one other ranger, was on a routine patrol, tracking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ranger-dies-after-rhino-attack/\">Ranger dies after rhino attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "Warriors in friendly draw against Niger",
            "url": "https://www.newzimbabwe.com/warriors-in-friendly-draw-against-niger/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens team played a one-all draw against Niger in a friendly match played Tuesday at Stade Pere Jego stadium in Morocco.\n\nZimbabwe fielded a new look of the first eleven, different from the one which played Burkina Faso.\n\nMagesi FC goalkeeper, Elvis Chipezeze, made his debut under coach Michael Nees.\n\nYoungster Jonah Fabisch and Tawanda Macheke also enjoyed starting berths in the Warriors lineup.\n\nDesperate to redeem themselves from Fridays 2-0 defeat against Burkina Faso, Zimbabwe managed to find the back of the net in the 9th minute, thanks to Gerald Takwara, who tapped in from the six-yard box.\n\nThe Warriors made several efforts to cushion their lead, but they failed to break Nigers defence, and thus went to the break leading 1-0.\n\nComing back from the break, Nees substituted Chipezeze for third-choice goalkeeper Marley Tavaziva, who marked his international debut.\n\nTavaziva failed to record a clean sheet on debut after conceeding from the spot in the 71stminute as Niger equalised.\n\nThe Warriors could have restored their lead in the 80thminute, but unfortunately, Walter Musonas effort hit the crossbar.\n\nTuesdays draw was the fifth for Michael Nees, who marked his 10thgame in charge of the Warriors.\n\nOf the ten games, Nees has only managed two wins, while the other three ended in defeats.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/11064248/warriors-niger-scaled.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s team played a one-all draw against Niger in a friendly match played Tuesday at Stade Pere Jego stadium in Morocco. Zimbabwe fielded a new look of the first eleven, different from the one which played Burkina Faso. Magesi FC goalkeeper, Elvis Chipezeze, made his debut under coach Michael Nees.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-in-friendly-draw-against-niger/\">Warriors in friendly draw against Niger</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "Serial rapist who preyed on female job seekers jailed 80 years",
            "url": "https://www.newzimbabwe.com/serial-rapist-who-preyed-on-female-job-seekers-jailed-80-years/",
            "content": "By Staff Reporter\n\nArapist who targeted female job seekers has been convicted and sentenced to 80 years imprisonment on four counts of rape.\n\nAaron Sanyamahwe (36) of Unit N, Seke, Chitungwiza appeared at Chitungwiza Regional Magistrates Court this week.\n\nIn passing sentence, the court imposed a severe penalty of 20 years per count, with the sentences to run consecutively.\n\nIt was the States case that on diverse occasions, the offender targeted vulnerable young women seeking jobs, posing as an employment agent in order to gain their trust.\n\nCourt heard that Sanyamahwe would lure his victims to secluded locations in the Dema area, where he would blindfold them before moving them to another location, strangulating and violently sexually assaulting them.\n\nIn a statement following Sanyamahwes sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) noted that the jail term sends a clear message that sexual violence will be met with the full force of the law.\n\nNPA further highlighted the devastating impact of rape on survivors while urging job seekers to be vigilant and desist from putting their trust in strangers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A rapist who targeted female job seekers has been convicted and sentenced to 80 years imprisonment on four counts of rape. Aaron Sanyamahwe (36) of Unit N, Seke, Chitungwiza appeared at Chitungwiza Regional Magistrates Court this week. In passing sentence, the court imposed a severe penalty of 20 years per count, with the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/serial-rapist-who-preyed-on-female-job-seekers-jailed-80-years/\">Serial rapist who preyed on female job seekers jailed 80 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "IMF wants Zimbabwe’s gold-backed ZiG to become sole currency",
            "url": "https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/",
            "content": "Bloomberg\n\nThe International Monetary Fund said it would like to see the ZiG fully becoming a national currency, as it weighs whether to place Zimbabwe on a staff-monitored program.\n\nThe ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. Its the countrys sixth attempt since 2009 to replace the dollar as the southern African nations main transacting currency, but is yet to succeed.\n\nSeveral measures will need to be adopted to boost ZiG usage, including deepening the foreign-exchange market to ensure full price discovery, said Wojciech Maliszewski, the Washington-based lenders mission chief, who is in Zimbabwe to review its request for a new SMP. The nations last program ended abruptly in 2019 after the central bank printed money that fueled the collapse of the local currency.\n\nRight now we see good stability in the official market and we also see a convergence between the parallel and official rate, he told reporters Monday after meeting Zimbabwean President Emmerson Mnangagwa in the capital, Harare. Ideally, we would like to see an elimination of this gap, we would like to see one exchange rate.\n\nStill, the ZiGs 43% devaluation in September to narrow the gap between the official and unofficial rate and its inconvertibility has led citizens to favor dollars.\n\nThe ZiG traded little changed on Tuesday at 26.96 against the dollar and exchanged hands at 32 to 35 on the parallel market.\n\nThe Washington-based lender said it isnt pushing for more exchange rate depreciation but for the two rates to converge supported by government fiscal discipline.\n\nThere is a good chance that these rates will converge, Maliszewski said.\n\nFinance Minister Mthuli Ncube last month at the annual meetings of the African Development Bank said he expected the SMP to be finalized by the end of June. The program would bring Zimbabwe closer toward revamping its $21 billion debt pile with creditors that want assurances that its authorities are pursuing prudent fiscal and monetary policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>Bloomberg The International Monetary Fund said it would like to see the ZiG “fully becoming a national currency,” as it weighs whether to place Zimbabwe on a staff-monitored program. The ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. It’s the country’s sixth attempt since 2009 to replace the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/\">IMF wants Zimbabwe’s gold-backed ZiG to become sole currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "11 Jun 2025"
        }
    ]
}