{
    "news": [
        {
            "title": "Don’t forget that Chiwenga supported you in 2017 – Geza resurfaces with message for Mnangagwa",
            "url": "https://www.newzimbabwe.com/dont-forget-that-chiwenga-supported-you-in-2017-geza-resurfaces-with-message-for-mnangagwa/",
            "content": "By Staff Reporter\n\nExpelled Zanu PF Central Committee member and militant war veteran Blessed Geza has resurfaced, reminding President Emmerson Mnangagwa of the support he received from his deputy, Vice President Constantino Chiwenga, during the 2017 military coup that ousted former and late President Robert Mugabe from power.\n\nGezas address comes on the heels of a thinly veiled attack on Chiwenga by Zanu PF spokesperson Christopher Mutsvangwa, who labelled the former military boss uneducated and cruel, particularly towards women, branding him unfit to succeed Mnangagwa as President.\n\nGeza, who disappeared after previous explosive press briefings aired via Heart and Soul Television (HSTV)  resulting in the arrest of its head and Alpha Media Holdings (AMH) journalist Blessed Mhlanga  re-emerged clad in visibly new military garb, warning Mnangagwa that his time in office is up.\n\nGeza took time to remind Mnangagwa of the support he got from Chiwenga when he fled the country hours after his dismissal as Vice President on November 6, 2017.\n\nMnangagwas expulsion was the spark that lit the tinderbox, setting in motion Operation Restore Legacy led by General Chiwenga in 2017, the historic period referred to as the Two Weeks in November.\n\nYou poisoned General Chiwenga, who assisted you when you had run away. Mugabe wanted to give power to Chiwenga, but he refused. But today you are going after Chiwenga. Are you sure? What exactly did you do during the liberation struggle? fumed Geza.\n\nGeza laid into Mnangagwa, alleging that the Zanu PF figurehead was involved in the poisoning of Chiwenga, referring to when the latter was flown to China for medical attention in 2020.\n\nMnangagwa was 100 per cent involved in the poisoning of General Chiwenga. I have the evidence from his brother, called Joseph Rera. When Mnangagwa was asked by Rera how General Chiwenga was coping with his health while in China, Mnangagwa, you said Chiwenga was a goner, and that he would return to Zimbabwe in a coffin, Geza claimed.\n\nHe further alleged that Mnangagwa had a hand in the deaths of scores of military generals, especially during the Covid-19 era.\n\nGeza further challenged Mnangagwa to arrest him, saying that the Zanu PF figurehead knows his whereabouts.\n\nI am very safe and in buzzing good health. Mnangagwa knows where I am.\n\nRelentless Geza also laid into Christopher Mutsvangwa, warning that he should zip up, otherwise, he will open a can of worms, revealing secrets that would expose him as an anti-revolutionary during the liberation struggle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter Expelled Zanu PF Central Committee member and militant war veteran Blessed Geza has resurfaced, reminding President Emmerson Mnangagwa of the support he received from his deputy, Vice President Constantino Chiwenga, during the 2017 military coup that ousted former and late President Robert Mugabe from power. Geza’s address comes on the heels of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-forget-that-chiwenga-supported-you-in-2017-geza-resurfaces-with-message-for-mnangagwa/\">Don’t forget that Chiwenga supported you in 2017 – Geza resurfaces with message for Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "Six armed robbery suspects killed in shootout with police",
            "url": "https://www.newzimbabwe.com/six-armed-robbery-suspects-killed-in-shootout-with-police/",
            "content": "By James Muonwa\n\nTHE Zimbabwe Republic Police (ZRP) has confirmed a dramatic shoot-out that resulted in the death of six armed robbery suspects.\n\nThe incident occurred in the early hours of Tuesday, near the tollgate along the Bulawayo-Victoria Falls highway at Insuza.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nZRP confirms a shoot-out incident with six armed robbery suspects along the Bulawayo-Victoria Falls tollgate on the 18th of March 2025, between 2am and 4am, said Nyathi.\n\nHe said the suspects had spent the day at Young Money General Dealer Shop at Insuza, drinking and monitoring their target, before pouncing.\n\nThey later pounced on the two complainants while armed with pistols, knives and axes. The suspects went on to tie the hands of the complainants with electric cables before covering their faces with blankets.\n\nThey demanded for gold and cash. The suspects ransacked the whole shop and took away unknown amount of cash, groceries, 48 volts lithium battery, inverter, 9kg gas tank and cellphones, added Nyathi.\n\nThe gang them fled the scene in their getaway vehicle, a silver Honda Fit registration number AEY4843.\n\nOne of the complainants untied themself and called the employer, who quickly alerted police who made a follow up.\n\nDetectives tracked the getaway vehicle and spotted it along the highway as it approached the tollgate.\n\nNyathi said the suspects defied police orders to stop before the dramatic exchange of gunfire ensued.\n\nDetectives ordered the suspects to stop. Instead, the suspects fired shots towards the police officers leading to a shoot-out.\n\nThe suspects went on to hit a boom gate at the tollgate. They were arrested and taken to United Bulawayo Hospital (UBH) where they all unfortunately passed on, he said.\n\nAt the scene, police recovered property stolen from the shop as well as ammunition used in commotion of the crime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By James Muonwa THE Zimbabwe Republic Police (ZRP) has confirmed a dramatic shoot-out that resulted in the death of six armed robbery suspects. The incident occurred in the early hours of Tuesday, near the tollgate along the Bulawayo-Victoria Falls highway at Insuza. National police spokesperson, Commissioner Paul Nyathi confirmed the incident. “ZRP confirms a shoot-out</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/six-armed-robbery-suspects-killed-in-shootout-with-police/\">Six armed robbery suspects killed in shootout with police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "Guns, Condoms, and a Crisis of Faith: Holy Ten slams Uebert Angel and Mudiwa",
            "url": "https://www.newzimbabwe.com/guns-condoms-and-a-crisis-of-faith-holy-ten-slams-uebert-angel-and-mudiwa/",
            "content": "By Costa Nkomo\n\nOutspoken hip-hop artist Holy Ten has launched a blistering attack on Zimbabwes Ambassador-at-Large to Europe and the Americas Uebert Angel and musician Mudiwa Hood.\n\nHoly Ten alleges the duo bring guns and condoms into the church, a claim thats thrown a Molotov cocktail into the already turbulent waters of faith and celebrity. He vows never to return to what he sees as a den of iniquity, run by charlatans preying on unsuspecting congregants.\n\nHoly Ten unleashed these reputation-damaging details during a recent appearance on DJ Ollahs Podcast, claiming Angel routinely propositioned him to find young women for the man of the cloth to bed.\n\nI was first inspired to pray by Uebert Angel. I didnt have to meet him then, I would just watch his sermons. For him to become the gentleman who asks me to find chicks  slay queens  was the worst thing ever. I went to their church where I performed. Mudiwa was showing me guns. From there, I began to doubt their faith, he said.\n\nHoly Ten said it was a source of deep embarrassment that Angel, given his supposed holy standing, would make such requests.\n\nNot only guns, but Mudiwa then opened his bag and showed me condoms. I swear, and Im ready to be taken to court for this, I swear that I will never return to their church again. You can ask my crew. Those people are spinning a yarn, he said.\n\nAngel presides over the Good News Church\n\nTwo years ago, he was embroiled in controversy after being exposed in the four-part Al Jazeera documentary, The Gold Mafia, which detailed undercover operations across three continents and revealed a trove of incriminating documents capturing gold smuggling.\n\nAngel was secretly filmed boasting that he could move over US$1 billion of dirty cash with ease, leveraging his diplomatic immunity to facilitate a scheme where unaccounted funds could be exchanged for Zimbabwes gold.\n\nAngel and his business partner, Rikki Doolan, further claimed their laundering operations had the blessing of President Emmerson Mnangagwa.\n\nMudiwa Hood, on the other hand, is the Chief Executive Officer (CEO) and founder of several companies, including Sky Angel Private Jet Charter, Fundmass, Optima Construction, Disrupt Media, and Bisep Security.\n\nHe fancies himself a serial entrepreneur, author, and fashion mogul.\n\nHoly Tens accusations have struck a chord, laying bare the hypocrisy he perceives within these circles.\n\nThese revelations, if true, paint a portrait of men drunk on power, flaunting wealth, and abusing their positions with impunity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/01113945/Holy-Ten-1.png",
            "description": "<p>By Costa Nkomo Outspoken hip-hop artist Holy Ten has launched a blistering attack on Zimbabwe’s Ambassador-at-Large to Europe and the Americas Uebert Angel and musician Mudiwa Hood. Holy Ten alleges the duo bring guns and condoms into the church, a claim that’s thrown a Molotov cocktail into the already turbulent waters of faith and celebrity.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/guns-condoms-and-a-crisis-of-faith-holy-ten-slams-uebert-angel-and-mudiwa/\">Guns, Condoms, and a Crisis of Faith: Holy Ten slams Uebert Angel and Mudiwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "Govt promises improved accommodation, staff bus, meals following nurses’ protest at Sally Mugabe hospital",
            "url": "https://www.newzimbabwe.com/govt-promises-improved-accommodation-staff-bus-meals-following-nurses-protest-at-sally-mugabe-hospital/",
            "content": "By Thandiwe Garusa\n\nGOVERNMENT has said it will address grievances raised by nursing staff at Sally Mugabe Hospital following a protest on Monday over poor working conditions.\n\nNurses decried low salaries and inadequate working conditions, including the lack of basic amenities such as electricity and running water.\n\nThe disgruntled nurses also highlighted that the hospitals elevators have been out of service for an extended period, forcing them to carry dead bodies down staircases to the mortuary.\n\nIn a statement on Tuesday, the Health Ministry said it is now addressing the water supply issues and upgrading the elevators.\n\nThe Ministry of Health and Child Care is addressing concerns raised by Sally Mugabe Central Hospitals nursing staff, following a demonstration on March 17, 2025.\n\nThe government is prioritizing the improvement of the hospitals water supply, with plans to repair the 2.5-mega-litre tank as soon as possible to increase reservoir capacity and advocate for a more consistent water supply from the Harare City Council.\n\nAdditionally, progress is being made with the hospitals elevator system, with three elevators currently under repair and plans in place to make one operational within the next few days, the statement read.\n\nThe health workers have raised concerns over unexplained deductions from their February salaries, with many of them saying they do not have enough money to cover transport costs.\n\nTransportation for staff has been enhanced, with the hospital receiving a second bus from head office to ensure smoother operations. The hospital is also working to improve staff accommodation and cafeteria services in alignment with government policies, the statement added.\n\nThe crisis at Sally Mugabe Hospital reflects broader issues across Zimbabwes public health sector, with conditions in rural hospitals even worse.\n\nZimbabwes healthcare sector remains severely underfunded and largely dependent on support from Western development partners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18171916/sally-mugabe-nurses.jpg",
            "description": "<p>By Thandiwe Garusa GOVERNMENT has said it will address grievances raised by nursing staff at Sally Mugabe Hospital following a protest on Monday over poor working conditions. Nurses decried low salaries and inadequate working conditions, including the lack of basic amenities such as electricity and running water. The disgruntled nurses also highlighted that the hospital’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-promises-improved-accommodation-staff-bus-meals-following-nurses-protest-at-sally-mugabe-hospital/\">Govt promises improved accommodation, staff bus, meals following nurses’ protest at Sally Mugabe hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "WestProp celebrates Easter with a special gift",
            "url": "https://www.newzimbabwe.com/westprop-celebrates-easter-with-a-special-gift/",
            "content": "By Staff Reporter\n\nIN the spirit of Easter, WestProp Holdings is offering a 10 percent discount to new property customers.\n\nThe April full-month limited-time offer is a token of appreciation for new clients and a celebration of the values of love, kindness and generosity that Easter presents.\n\nThe offer is available for Pomona City, The Hills Luxury Golf Estate, Pokugara and Millennium Heights.\n\nAs we commemorate the Easter season, we are reminded of the importance of compassion, sacrifice, and community. This special offer is our way of sharing the joy and hype of Easter with our customers, said WestProp chief Ken Sharpe.\n\nThe various product prices and discounts will be discussed on a person-to-person basis to enhance understanding of the deal.\n\nThe sales team at WestProp has been apprised of the deal offer and is keenly waiting to receive clients eager to clinch the deal.\n\nThe exclusive deal is meant to make homeownership more accessible and affordable for individuals and families.\n\nTo make the home dream more affordable, the company has also extended the Pomona City payment period to up to 5 years. However, at Pomona City, the offer is only available to a limited number of stands.\n\nWe are thrilled to offer this incredible deal to our valued clients, said Sharpe. Our Pomona stands offer the perfect opportunity for individuals and families to own their dream home in a secure and beautiful community. With our Easter offer, we are making it even easier for people to achieve their dream of homeownership.\n\nPomona is a stunning development located north of Harare, offering a unique blend of natural beauty, modern amenities, and secure living. With its picturesque gate, undulating terrain, tranquil atmosphere, and proximity to the service industry and the Wingate Golf Course Pomona is the perfect place to call home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Staff Reporter IN the spirit of Easter, WestProp Holdings is offering a 10 percent discount to new property customers. The April full-month limited-time offer is a token of appreciation for new clients and a celebration of the values of love, kindness and generosity that Easter presents. The offer is available for Pomona City, The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/westprop-celebrates-easter-with-a-special-gift/\">WestProp celebrates Easter with a special gift</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "Dangerous 200km stretch of dilapidated Victoria Falls highway now being attended as govt finally takes action",
            "url": "https://www.newzimbabwe.com/dangerous-200km-stretch-of-dilapidated-victoria-falls-highway-now-being-attended-as-govt-finally-takes-action/",
            "content": "By Leopold Munhende\n\nWORK to rehabilitate the Bulawayo-Victoria Falls highway has begun, with a dilapidated 200km stretch between the two cities being prepared for total reconstruction.\n\nAccording to Transport Minister Felix Mhona, funds have been released for the total rehabilitation of the major highway while Bitumen World has been identified as a partner.\n\nThe contracting company is already working on critical sections of the road that had been making a trip to Victoria Falls longer than it should have been.\n\nReconstruction of the entire road, which stretches to Beitbridge via Bulawayo, will take 36 months according to Mhona.\n\nGovernment has shifted attention to the Beit Bridge  Victoria Falls highway, said Mhona.\n\nWe know that of the 760km almost 200km is beyond pothole patching and requires complete reconstruction.\n\nThe funding has been availed and the contractor has said within a period of 36 months the entire road will be done.\n\nZimbabwes roads were declared a state of disaster, with a programme for their rehabilitation launched in 2021; the Emergency Road Rehabilitation Programme (ERRP) which ends in December 2026.\n\nThe Bulawayo  Victoria Falls highway is of major concern seeing as it leads to Zimbabwes main tourist attraction.\n\nRehabilitation of the Victoria Falls highway had been put on hold for years, with communities living along the whole stretch raising concerns.\n\nBusinesses were also being affected as trucks and buses would at times abandon the highway for dirt roads in Matebeleland bushes.\n\nThe urgent need to rehabilitate this road was further emphasised in Parliament last week by Senator Priscah Mupfumira who highlighted that Zimbabwe will for the first time be hosting the Conference of the Parties (COP 15) this winter.\n\nSuch a global event, Mupfumira said, might not be held in Zimbabwe ever again. She expressed fear that the countrys poor road network might just humiliate government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/16192007/Felix-Mhona.jpg",
            "description": "<p>By Leopold Munhende WORK to rehabilitate the Bulawayo-Victoria Falls highway has begun, with a dilapidated 200km stretch between the two cities being prepared for total reconstruction. According to Transport Minister Felix Mhona, funds have been released for the total rehabilitation of the major highway while Bitumen World has been identified as a partner. The contracting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dangerous-200km-stretch-of-dilapidated-victoria-falls-highway-now-being-attended-as-govt-finally-takes-action/\">Dangerous 200km stretch of dilapidated Victoria Falls highway now being attended as govt finally takes action</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "We will convince him – vows Chinamasa, as Mnangagwa faction reveals party strategy to keep him in office beyond 2028",
            "url": "https://www.newzimbabwe.com/we-will-convince-him-vows-chinamasa-as-mnangagwa-faction-reveals-party-strategy-to-keep-him-in-office-beyond-2028/",
            "content": "By Staff Reporter\n\nJUST over a month after President Emmerson Mnangagwa said he will tell the convincers not to convince him, regarding a proposed extension of his second term, Zanu PF Secretary for Legal Affairs Patrick Chinamasa has expressed confidence that they can convince him to hang on to 2030.\n\nDespite Mnangagwa being on record saying he is not interested in hanging onto power beyond his constitutionally mandated two terms, ending in 2028, a faction within the ruling party wants him to stay.\n\nThe statement above was told to a select group of editors with whom he had what was described as a no-holds barred, two hour meeting at State House last month.\n\nHis deputy, Constantino Chiwenga, who since 2017 is reported to have been waiting for a bite of the cherry is said to be eagerly waiting for him to step down. Chiwenga is fronting another faction within the party that is all but ready to push Mnangagwa out if he is convinced to hold on to power.\n\nSpeaking at a party event in Mutare over the weekend, Chinamasa said they were ready to speak to the partys politburo and central committees about the issue.\n\nIf the two institutions of the party grant them approval to approach government, said Chinamasa, then they would proceed with efforts to amend the Zimbabwean constitution.\n\nOnce we have a clear plan, which includes consultations with the politburo and central committee, we will instruct government to amend the constitution of Zimbabwe, said Chinamasa to loud applause at the Manicaland District Coordinating Committee meeting.\n\nWe believe that Mnangagwa should finish what he started, what we will do is just convince him to stay up till 2030. If he agrees we would have achieved what was proposed by last years 2030 resolution.\n\nWe want to see how this resolution can be implemented and how the constitution can be amended. We want to know which platforms have to be approached first.\n\nWe will start with the politburo and then the central committee where we will continue requesting that they allow us to give the government the go-ahead to change our constitution.\n\nSection 91(2) of Zimbabwes 2013 constitution bars Mnangagwa from going beyond his constitutionally mandated two terms while its Section 328(7) disqualifies him from benefiting if there are to be any constitutional amendments that might seek to favour an incumbent.\n\nEven despite these clear constitutional provisions, sections, mainly from his home province of Masvingo, are demanding that he stay on while shutting out any hope of Chiwenga taking over.\n\nChiwenga, who is yet to publicly share his presidential aspirations, was recently laid into by party spokesperson and Mnangagwa ally Christopher Mutsvangwa who declared him unworthy to lead.\n\nThe former army general is reported to be livid and has demanded action be taken against Mutsvangwa in what looks to be another interesting episode of Zanu PF factional fights drama.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12051453/patrick-chinamasa-e1599884108669.jpg",
            "description": "<p>By Staff Reporter JUST over a month after President Emmerson Mnangagwa said ‘he will tell the convincers not to convince him,’ regarding a proposed extension of his second term, Zanu PF Secretary for Legal Affairs Patrick Chinamasa has expressed confidence that they can convince him to hang on to 2030. Despite Mnangagwa being on record</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-convince-him-vows-chinamasa-as-mnangagwa-faction-reveals-party-strategy-to-keep-him-in-office-beyond-2028/\">We will convince him – vows Chinamasa, as Mnangagwa faction reveals party strategy to keep him in office beyond 2028</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "Council tax to rise across London as costs mount",
            "url": "https://www.newzimbabwe.com/council-tax-to-rise-across-london-as-costs-mount/",
            "content": "BBC\n\nAll but three of Londons local authorities are to increase council tax bills next financial year by just under 5%, the maximum allowed without a local referendum.\n\nBarnet Council will increase its council tax by 4.98%, while 28 other London boroughs and the City of London have levied maximum council tax increases of 4.99% from 1 April.\n\nResidents in Wandsworth will see their bills rise by 2%, while council tax in Kensington and Chelsea will go up by 4%.\n\nNewham Council, which applied for extra support last year due to housing pressures from temporary accommodation, was allowed by central government to raise its bills by 8.99% in 2025-26.\n\nThe 4.99% cap on council tax rises in England, which includes a 2% rise for adult social care, has been in place for the last three years.\n\nUsually a borough that wants to raise tax more than the cap has to hold a local referendum to approve the rise, but central government can authorise a higher increase.\n\nSeven London boroughs will also receive Exceptional Financial Support loans from the government of more than 418m for the next financial year.\n\nLondon Councils, an umbrella body for the capitals local authorities, said boroughs in the capital received about 28% less in funding per Londoner compared to 2010.\n\nIt is calling for overall council funding to be restored to 2010 levels by 2028-29, requiring real-terms increases of 4% every year.\n\nLondon Councils said emergency borrowing measures like Exceptional Financial Support put a burden on boroughs of further debts and would not be enough to return them to a stable financial footing.\n\nIt added a combination of fast-rising demand for statutory services  where boroughs have a legal duty to provide support  and the increasing cost of delivering these services had led to substantial overspends in London council budgets in recent years.\n\nA spokesperson for the Local Government Association, which represents councils across England, said councils continued to face severe funding shortages and soaring cost and demand pressures on local services.\n\nThey added that councils had to make a tough choice about increasing bills to bring in desperately-needed funds.\n\nHowever, while council tax is an important funding stream, the significant financial pressures facing local services cannot be met by council tax income alone.\n\nThe Spending Review needs to ensure councils have adequate funding to deliver the services local people want to see.\n\nA Ministry of Housing, Communities and Local Government spokesperson said councils should put taxpayers first and carefully consider the impact of their decisions.\n\nThats why we are maintaining a referendum threshold on council tax rises, so taxpayers can have the final say and be protected from excessive increases, they added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18063839/london.webp",
            "description": "<p>BBC All but three of London’s local authorities are to increase council tax bills next financial year by just under 5%, the maximum allowed without a local referendum. Barnet Council will increase its council tax by 4.98%, while 28 other London boroughs and the City of London have levied maximum council tax increases of 4.99%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/council-tax-to-rise-across-london-as-costs-mount/\">Council tax to rise across London as costs mount</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "IOC: Zimbabwe’s Kirsty Coventry aiming to make history",
            "url": "https://www.newzimbabwe.com/ioc-zimbabwes-kirsty-coventry-aiming-to-make-history/",
            "content": "DW\n\nKirsty Coventry will make sporting history if she is electedpresident of the International Olympic Committee (IOC)at its General Assembly on Thursday (March 20,2025). She would be the first woman and first person from Africa to head the IOC.\n\nShe would also be the youngest since Pierre de Coubertin, the founding father of the modernOlympic Games. The Frenchman founded the IOC in 1894 and took over the presidency two years later at the age of 33.\n\nCoventry, a 41-year-old former world-class swimmer fromZimbabwe, has always had a strong will and vision.\n\nWhen I was 9 years old, I told my dad I wanted to go to the Olympics and win gold. He told me it would be a rough road ahead, he explained how difficult it was just to make the Olympic team let alone win a medal, but he believed in me, she wrote in a Facebook post a few years ago.\n\nAt the age of 20, she made her dream come true. At the 2004 Games in Athens, Coventry won the gold medal in the 200-meter backstroke. Four years later, in 2008 in Beijing, she won gold again. In addition to those two gold medals, she collected four Olympic silver medals and one bronze. This makes Coventry Africas most successful female Olympian of all time. The only African who has had more success at the Olympics is long-distance runner Tirunesh Dibaba of Ethiopia  who won three gold medals (and two bronze).\n\nI have been to five Olympic Games, won seven individual Olympic medals, broken multiple world records and had one of the best World Championship careers of all time, Coventry wrote on her Linkedin profile.\n\nHowever, none of this is as important as what this success did and can do for others. It united my country where divisions caused by economic and political turmoil were crippling it, and it gave hope to people who thought their circumstances prevented them from following their dreams.\n\nWhile still an active swimmer, Coventry was elected to the IOC Athletes Commission in 2013. She represented the interests of athletes for eight years, including three years as chairperson. More recently, she has been a member of the IOC Executive Board.\n\nThe increased influence of the Zimbabwean has raised hopes in Africa that the Summer Olympics could be hosted on the African continent for the first time.\n\nAlthoughSouth AfricaandEgypthave expressed their interest, Coventry has played down such expectations.\n\nThe interest is there and now we need to ensure that were working closely with all of these countries that are interested so that they fully understand the magnitude of the Olympic Games, she said.\n\nThe countries of Africa, Coventry said in a Q&A session organized by the Association of International Sports Journalists (AIPS), should really strategically look from the African Union point of view on how we can develop through the All Africa Games our infrastructure that can then be followed up and used by an Olympic Games bid.\n\nCoventry knows from experience just how tough such political processes can be. She has been Zimbabwes Minister of Sport since 2018. She says she now has definitely a thicker skin than she used toas an athlete.\n\nWhen asked whether she thinks trans women should be allowed to compete in womens competitions, she was evasive.\n\n100% it is necessary to find a solution, Coventry said. I think that we as the IOC have to take a little bit more of a leadership role.\n\nThe Zimbabwean also avoided going too far out on a limb on another hot topic before the IOC election: the possibility of Russian and Belarusian athletes competing at the Olympics.\n\nI think above anything else its our duty as the IOC to ensure that all athletes can participate at the Games, she said. Thats going to look different for a number of different athletes but at the end of the day I do believe that we need to find a holistic way of sadly dealing with athletes from conflict areas.\n\nShe was speaking in light of her experience competing for Zimbabwe at a time when the country was in political turmoil and under international sanctions.\n\nIt could have been very easy for the international community to not allow us to take part. I look at (it) and say what would my life be today? I am grateful that I was not held accountable for what the leaders and governments were doing.\n\nKirsty Coventry is not only a sports administrator and politician, but also a mother. She gave birth to her second daughter less than six months ago. Her eldest is six years old.\n\nBy the time she was one year old, she had already been to 10 different countries around the world, Coventry said.\n\nI have an incredible network of support from my husband and family. This is a normal way of life for us. I think its a good way to show that women are just as capable as men even if we are to be expected to be full-time mothers, wives, daughters etc.\n\nWe still have a lot of work to do, and I am excited about leading this movement, Coventry said of gender equality. Women are ready to lead. I look at it as an opportunity to push through boundaries so that when my two girls are growing up, they dont have the same boundaries.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/01/20081424/Kirsty-Coventry.jpg",
            "description": "<p>DW Kirsty Coventry will make sporting history if she is elected president of the International Olympic Committee (IOC) at its General Assembly on Thursday (March 20,2025). She would be the first woman and first person from Africa to head the IOC. She would also be the youngest since Pierre de Coubertin, the founding father of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ioc-zimbabwes-kirsty-coventry-aiming-to-make-history/\">IOC: Zimbabwe’s Kirsty Coventry aiming to make history</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        },
        {
            "title": "Brace for AI-related labour challenges – govt",
            "url": "https://www.newzimbabwe.com/brace-for-ai-related-labour-challenges-govt/",
            "content": "By Alois Vinga\n\nTHE Public Service, Labour and Social Welfare Secretary Simon Masanga has bemoaned the challenges triggered by the emergingArtificial Intelligence technologies on the back of calls for stakeholders to brace for the new environment.\n\nAI is the science and engineering of creating intelligent machines, particularly computer programs, that can perform tasks requiring human intelligence.\n\nIt aims to enable machines to demonstrate human-like reasoning and capabilities, including autonomous decision-making, speech recognition, pattern recognition, and problem-solving.\n\nIndustry experts have described the developments as the catapult to achieving the 4thIndustrial Revolution (4IR).\n\nSpeaking to stakeholders at the Zimbabwe-Namibia bilateral exchange program held in the City of Bulawayo recently, Masanga addressedthe emerging AI challenges in the labour market.\n\nThe world of work is rapidly changing, influenced by technological advancements, global pandemics like Covid 19 and climate change. The advent of AI and automation is reshaping traditional employment structures, raising concerns about job security, fair wages and protection of workers rights.\n\nAs AI continues to permeate into workplaces new forms of labour disputes may arise necessitating adaptative and forward-looking dispute resolution mechanisms that account for algorithm decision making, data privacy and equitable access to opportunities, he said.\n\nSpeaking at a different event during the same week, UN resident coordinator, Edward Kallon said AI presents both opportunities and threats.\n\nUnited Nations resident coordinator Edward Kallon said AI was a key driver of the fourth industrial revolution.\n\nIn view of these realities, countries across the globe are increasingly positioning themselves to take full advantage of opportunities presented by these technological innovations and in particular, artificial intelligence, to advance their respective national development agendas and, consequently, transform the lives of their citizens.\n\nIt is, however, also true that as transformative as these technologies are, there are many risks associated with them, both inherent and overt, that cannot be overlooked and hence must be addressed by countries to ensure the development and application of AI systems in both the public and private sectors are ethically compliant, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18041635/Secretary-for-Public-Service-Labour-and-Social-Welfare-Mr-Simon-Masanga.jpg",
            "description": "<p>By Alois Vinga THE Public Service, Labour and Social Welfare Secretary Simon Masanga has bemoaned the challenges triggered by the emerging Artificial Intelligence technologies on the back of calls for stakeholders to brace for the new environment. AI is the science and engineering of creating intelligent machines, particularly computer programs, that can perform tasks requiring human</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brace-for-ai-related-labour-challenges-govt/\">Brace for AI-related labour challenges – govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "19 Mar 2025"
        }
    ]
}