{
    "news": [
        {
            "title": "It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa",
            "url": "https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/",
            "content": " claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga\n\nBy Leopold Munhende\n\nZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed.\n\nSpeaking to journalist Violet Gonda, Mliswa likened Tagwireis fast-track promotion to opposition leader Nelson Chamisa, describing it in similar terms that were used when the latter took over after the passing of pro-democracy icon Morgan Tsvangirai a generational consensus.\n\nAn ongoing factional fight within Zanu PF has pitted President Emmerson Mnangagwas deputy, Constantino Chiwenga with Tagwirei.\n\nThe two are in a race to succeed Mnangagwa, either in 2028 or beyond, if his term is illegally extended as is being rallied for by sections in the party.\n\nThat Tagwirei has become a strong contender is no longer secret, even hardline critics of the businessman such as Zanu PF spokesperson Christopher Mutsvangwa, have changed their stance.\n\nMliswa said it was time senior party members allowed younger members to take over.\n\nIt is a generational consensus just like when we had national consensus in making sure that people marched (in 2017). It is the generational consensus that Tagwirei must make it because he is young, said Mliswa.\n\nWe have given our liberators time to liberate us from an economic point of view but they have not done what we expected them to do, they have done their best but it is about time that we took over.\n\nWe do not have liberation history but we have economic ability to be able to transform the country and equally transform its fortunes.\n\nMliswa, who was fired from Zanu PF in 2015, has emerged as one of Tagwireis fervent supporters, frequently laying into Chiwenga.\n\nChiwenga is pushing for Tagwireis arrest on a string of corruption allegations. His attempts to get the partys stamp, however, fell by the wayside as he was advised to report all of the alleged graft to Zimbabwe Anti-Corruption Commission (ZACC) or the police.\n\nTagwireis meteoric rise is being supported by claims that he financed the 2017 coup that toppled late leader Robert Mugabe and governments agriculture programme, Command Agriculture.\n\nAdded Mliswa: It is a generational consensus which you cannot stop.\n\nThat is the reason why the opposition moved from the late Morgan Tsvangirai to Nelson Chamisa. Now Zanu PF has moved to Tagwirei.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>–  claims Zanu PF has decided on Tagwirei as next President ahead of Chiwenga By Leopold Munhende ZANU PF is now behind the future candidature of businessman Kudakwashe Tagwirei, outspoken former legislator Temba Mliswa has sensationally claimed. Speaking to journalist Violet Gonda, Mliswa likened Tagwirei’s fast-track promotion to opposition leader Nelson Chamisa, describing it in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-a-generational-consensus-says-mliswa-as-he-likens-tagwirei-to-chamisa/\">It’s a generational consensus – says Mliswa, as he likens Tagwirei to Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        },
        {
            "title": "Diaspora Insurance HQ opens its arms to all Africans abroad",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-hq-opens-its-arms-to-all-africans-abroad/",
            "content": "By Own Correspondent\n\nDiaspora Insurance proudly hosted an exclusive Zamalawi Pre-Event Show at its vibrant Birmingham headquarters, theDiaspora InsuranceHouse, to celebrate African unity and identity whilst reinforcing its role as a home for Africans living abroad.\n\nOrganised by Lifetime Entertainment, the star-studded event brought together talented Zambian and Malawian musicians, meeting their fans and sponsors, creating an unforgettable celebration of African culture. The line-up included Trimple M, Danny Kaya, Yo Maps, Saint Realest, Chanda Na Kay, Zeze Kingston, Neo, Chile One, Namadingo, and Driemo.Diaspora Insurancebrand ambassador and celebrity musician Exq also attended, adding star power to the presser. Fans, community leaders, and artists from across Africa gathered in a cosy, intimate setting to witness the powerful connection of Africans in the diaspora.\n\nA Warm Welcome from Diaspora Insurance\n\nIn his heartfelt welcome remarks, Diaspora Insurance CEO Jeff Madzingo welcomed guests, reinforcing the companys mission of inclusivity and empowerment for Africans everywhere.\n\nThis is your home, said Madzingo.\n\nDiaspora Insurance House is not just our head office, it is a home that welcomes all Africans abroad and within the UK. Whether you are from Malawi, Zambia, Zimbabwe, South Africa, Nigeria, or any part of our beautiful continent, you belong here.\n\nBefore the meet-and-greet session with fans, the Zamalawi artists toured Diaspora Insurance House, exploring the companys operations and global reach. They were also hosted in the headquarters executive boardroom, where they engaged in professional discussions with staff on how culture and business can collaborate to uplift African communities abroad.\n\nCelebrating African Culture and Cuisine\n\nAfter meeting fans and completing the press conference formalities, the stars enjoyed a spread of traditional African cuisine and drinks, immersing themselves in the authentic tastes and warmth of home. The atmosphere was filled with laughter, music, and pride, reflectingDiaspora Insurancesmission of unity and cultural celebration.\n\nWith operations in 25 African countries,Diaspora Insurancecontinues to provide tailored financial solutions that empower Africans worldwide. Diaspora Insurance House has hosted numerous high-profile events, including appearances by South African singer Kelly Khumalo, Stewart Murisa during his book launch, Benjani Mwaruwari, ZIFA stakeholder engagements, and other cultural showcases. The success of the Zamalawi Pre-Event Show and sponsorship of the main event reaffirm thatDiaspora Insuranceis more than an insurance provider but a true home that opens its arms to all Africans abroad, uniting the continents heartbeat in the heart of Birmingham. With 14 years of solid operations and a track record of hosting stars from sports, music, and social influence, Diaspora Insurance proves it is a fully operational, reputable company with a physical and traceable location.\n\nInside view of the ZaMalawi pre-event press conference at Diaspora Insurance HQ, Birmingham\n\nKodak moment: Diaspora Insurance CEO Jeff Madzingo poses with Zambian superstar Tripple M during the pre-event press conference at Diaspora Insurance HQ\n\nDr. Sibert Mandega, Executive Director of Diaspora Insurance, engages with Malawian artist Saint at the ZaMalawi concert press conference held at Diaspora Insurance HQ in Birmingham.\n\nA star-studded lineup of ZaMalawi musicians gathered and relaxed inside the Diaspora Insurance HQ boardroom in Birmingham\n\nA star-studded lineup of ZaMalawi musicians gathered and relaxed inside the Diaspora Insurance HQ boardroom in Birmingham.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31170830/Diaspora-Insurance-House.png",
            "description": "<p>By Own Correspondent Diaspora Insurance proudly hosted an exclusive Zamalawi Pre-Event Show at its vibrant Birmingham headquarters, the Diaspora Insurance House, to celebrate African unity and identity whilst reinforcing its role as a home for Africans living abroad. Organised by Lifetime Entertainment, the star-studded event brought together talented Zambian and Malawian musicians, meeting their fans</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-hq-opens-its-arms-to-all-africans-abroad/\">Diaspora Insurance HQ opens its arms to all Africans abroad </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        },
        {
            "title": "Zim traders set to benefit from Grindrod’s Walvis Bay warehouse",
            "url": "https://www.newzimbabwe.com/zim-traders-set-to-benefit-from-grindrods-walvis-bay-warehouse/",
            "content": "By Alois Vinga\n\nJSE-listed freight and logistics company, Grindrod Limiteds new Walvis Bay warehouse facility is set to benefit Zimbabwes traders whose goods transit through the close routes.\n\nBuilt on Grindrods existing 50,000 m premises, the new weatherproof warehouse spans 4,000 m and meets all Safety, Health, Environment, and Quality (SHEQ) standards as outlined by the Namibian Ports Authority (Namport).\n\nThis milestone marks a significant collaboration between Grindrod and Namport, aimed at enhancing the ports operational efficiency and positioning Walvis Bay as a resilient and sustainable trade gateway.\n\nWalvis Bay is a strategic alternative for Zimbabwe, which presents opportunities like reduced congestion, faster clearance times, and lower costs. Consignments to Zimbabwe using this route include a variety of goods such as equipment, vehicles, and consumer products like frozen chicken and furniture.\n\nGrindrod Limited Operations Executive, Frans Visser, said Zimbabwe is one of the nations which can reap the low-hanging fruit from the investment.\n\nWalvis Bay is ideally situated as a gateway to global markets, especially for cargo originating from the West Coast of Africa and neighbouring countries such as South Africa, Zambia, Botswana, Malawi, Zimbabwe, and the Democratic Republic of Congo (DRC), he said.\n\nAndrew Sturrock, CEO of Grindrods Logistics segment, emphasised the strategic importance of this investment.\n\nOur continued infrastructure development in Walvis Bay reflects our commitment to growth and our purpose of making a positive difference in Africas trade with the world. We see this region evolving into a secure and efficient transit corridor, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28202359/Frans-Visser.jpg",
            "description": "<p>By Alois Vinga JSE-listed freight and logistics company, Grindrod Limited’s new Walvis Bay warehouse facility is set to benefit Zimbabwe’s traders whose goods transit through the close routes. Built on Grindrod’s existing 50,000 m² premises, the new weatherproof warehouse spans 4,000 m² and meets all Safety, Health, Environment, and Quality (SHEQ) standards as outlined by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-traders-set-to-benefit-from-grindrods-walvis-bay-warehouse/\">Zim traders set to benefit from Grindrod’s Walvis Bay warehouse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        },
        {
            "title": "Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA",
            "url": "https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/",
            "content": "By Thandiwe Garusa\n\nThe Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwas State of the Nation Address (SONA) was disrupted by a power outage,NewZimbabwe.comhas learnt.\n\nMnangagwa was concluding his SONA when the power outage occurred, forcing him to use a torchlight to finish his speech.\n\nSpeaker of Parliament Jacob Mudenda was visibly angered by the incident, saying, We shall go beyond what happened, trace the culprit, and deal with them accordingly. Those found wanting will regret the day of their existence.\n\nAccording to Parliament, the generator had been activated at midday, with ZESA engineers on site to monitor proceedings.\n\nHowever, the backup system reportedly developed a technical fault approximately two and a half hours into the address, causing the blackout while Mnangagwa was still delivering his speech.\n\nA letter from Acting Clerk of Parliament Nomasonto Sunga to Local Government Permanent Secretary John Bhasera, dated October 21, had requested a serviced, fully tested and fit generator for the SONA, citing previous blackouts during important sessions.\n\nWATCH : President Emmerson Mnangagwa was on Tuesday forced to complete his State of the Nation Address (SONA) using a torchlightafter the New Parliament Building was plunged into darkness.\n\n\"The person who switched off electricity while the President was speaking will regrethttps://t.co/TqTPubyuMxpic.twitter.com/IIlyQncs8O\n\n NewZimbabwe.com (@NewZimbabweCom)October 28, 2025\n\nThis is the second time a blackout has occurred at the Parliament Building in Mnangagwas presence, following a similar incident in November 2024 during Finance Minister Mthuli Ncubes 2025 National Budget presentation.\n\nWe request your ministrys coordination and oversight in ensuring uninterrupted power supply during the State of the Nation Address (SONA), which has been tentatively scheduled for 28 October 2025 at Parliament Building.\n\nIt is noted that there is an approved arrangement to run the event using the generator as the primary source of power, with ZETDC on standby, following previous power disruptions experienced during important sessions, Sunga wrote.\n\nIn view of this, the generator must be serviced, fully tested, and confirmed fit for uninterrupted operation during the event. ZETDC technical staff should be physically on standby throughout the proceedings to provide an immediate response if required.\n\nParliament also assured that it would promptly pay the company contracted to provide generator services and supply sufficient fuel to ensure smooth power supply throughout the event.\n\nParliament will ensure timely payment to the service provider contracted for the generator service, as well as the provision of adequate fuel to power the system throughout the duration of the event, added Sunga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130416/ED-SONA-torch-1.jpeg",
            "description": "<p>By Thandiwe Garusa The Parliament Building was being powered by a generator with ZESA electricity on standby as per prior arrangements when President Emmerson Mnangagwa’s State of the Nation Address (SONA) was disrupted by a power outage, NewZimbabwe.com has learnt. Mnangagwa was concluding his SONA when the power outage occurred, forcing him to use a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mudenda-says-culprit-will-regret-the-day-of-their-existence-after-generator-failure-causes-power-outage-during-mnangagwas-sona/\">Mudenda says culprit will ‘regret the day of their existence’ after generator failure causes power outage during Mnangagwa’s SONA</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        },
        {
            "title": "In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight",
            "url": "https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/",
            "content": "A power outage plunged parliament into darkness during President Emmerson Mnangagwas State of the Nation Address (SONA), forcing him to complete his speech using a torchlight.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28130418/ED-SONA-torch.jpeg",
            "description": "<p>A power outage plunged parliament into darkness during President Emmerson Mnangagwa’s State of the Nation Address (SONA), forcing him to complete his speech using a torchlight. Below are some images captured during the address. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-power-outage-disrupts-sona-president-mnangagwa-completes-speech-using-torchlight/\">In Pictures: Power outage disrupts SONA, President Mnangagwa completes speech using torchlight</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        },
        {
            "title": "Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid",
            "url": "https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/",
            "content": "By Staff Reporter\n\nA planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue.\n\nOpposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU PF to extend President Emmerson Mnangagwas term beyond 2028.\n\nIn the early hours of Tuesday, the SAPES Trust premises were reportedly petrol-bombed and a guard on duty was abducted, in what is believed to be a coordinated attempt to stop the discussion.\n\nSAPES Trust Director Ibbo Mandaza said there appeared to be a clear link between the arson attack and the subsequent police disruption.\n\nIt is not surprising at all. There is a correlation between what happened after midnight,the arson, the abduction of the security guard.\n\nIt was done by people who know the job of fear. They seem to have forgotten that we have endured such harassment for the past two years, said Mandaza.\n\nThe ruling party has endorsed a resolution seeking to extend Mnangagwas presidency to 2030, which would require amending Section 91(2) of the Constitution, which limits a president to two terms, and Section 328(7), which bars incumbents from benefiting from constitutional amendments.\n\nAccording to party insiders, ZANU PF intends to use its parliamentary majority to push through the proposed changes.\n\nSpeaking at the disrupted event, Biti condemned the attacks and reaffirmed the groups commitment to defending the Constitution.\n\nWe are very sorry to Dr. Mandaza over the arson, and to Gilbert Mbwende, whose house was also attacked.\n\nThis is a new initiative by concerned citizens to resist the mutilation of the Constitution. It is not a political effort, but a civic one, to defend the rule of law, Biti said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/28164119/biti-sikhala-sapes.jpg",
            "description": "<p>By Staff Reporter A planned address by opposition and civic society leaders at the Southern Africa Political Economy Series (SAPES) Trust was abruptly disrupted on Tuesday after Zimbabwe Republic Police (ZRP) anti-riot officers stormed the venue. Opposition figures Tendai Biti, Job Sikhala, and Jacob Ngarivhume were scheduled to speak on an alleged plot by ZANU</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dawn-arson-police-raid-scuttle-bitis-address-on-mnangagwas-term-extension-bid/\">Dawn arson, police raid scuttle Biti’s address on Mnangagwa’s term extension bid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        },
        {
            "title": "KZN launches major offensive against illegal trucking operations, Zimbabweans arrested",
            "url": "https://www.newzimbabwe.com/kzn-launches-major-offensive-against-illegal-trucking-operations-zimbabweans-arrested/",
            "content": "IOL\n\nKwaZulu-Natal MEC for Transport and Human Settlements, Siboniso Duma, has declared war on rogue elements in the provinces trucking industry, following a far-reaching enforcement operation that laid bare a web of exploitation, corruption, and unsafe practices along South Africas busiest freight routes.\n\nOver the weekend, Duma joined law enforcement agencies at the Mkhondeni Weighbridge in Pietermaritzburg, where his departments #NenzaniLaEzweni (What Are You Doing in This World?) campaign intensified its push to restore order on KZNs roads.\n\nThe operation saw 98 trucks stopped, 47 drivers interviewed, and several arrests made, including one of a Zimbabwean truck driver found driving under the influence of alcohol.\n\nUndoubtedly, he was on his way to cause a horrific accident that could have resulted in fatalities, Duma said, adding that the operations purpose was to clean our road networks as part of creating a safe and secure KwaZulu-Natal for citizens.\n\nAuthorities also arrested five foreign nationals for being in the country illegally or for presenting fraudulent documents, while another Zimbabwean driver was charged for transporting European tourists without a valid permit.\n\nA bus from Zimbabwe carrying foreign nationals was also impounded for inspection by a multi-agency team that included the RTI, SAPS Dog Unit, and Home Affairs Immigration officials.\n\nA KwaZulu-Natal Road Traffic Inspectorate (RTI) officer with some of the undocumented foreign national truck drivers who were arrested at a multi-displinary road traffic blitz at Mkhondeni, Pietermaritzburg over the weekend Image:KwaZulu-Natal Department of Transport\n\nIndustry in Crisis: Drivers Speak of Exploitation and Fear\n\nBehind the arrests, however, lies a deeper crisis within the provinces freight sector. Interviews with truck drivers, conducted during and after the operation, painted a grim picture of exploitation and labour violations that Duma described as human rights abuses in broad daylight.\n\nWe have uncovered exploitative practices, financial fraud and human rights violations involving certain players in the logistics and freight industry, he said.\n\nThey are behaving with impunity and must be held accountable for turning our road networks into killing fields.\n\nAccording to the MEC, drivers reported that:\n\n-They have no written contracts or employment protection.\n\n-Local drivers are being replaced by undocumented foreign nationals willing to work for less.\n\n-Bribes are paid to law enforcement officers to bypass inspections.\n\n-No payslips or overtime payments are issued, despite long hours on the road.\n\n-Many work without rest days or leave, are paid per load, and are not compensated for weekends or public holidays.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27131537/KZN-transport-dept.jpg",
            "description": "<p>IOL KwaZulu-Natal MEC for Transport and Human Settlements, Siboniso Duma, has declared war on rogue elements in the province’s trucking industry, following a far-reaching enforcement operation that laid bare a web of exploitation, corruption, and unsafe practices along South Africa’s busiest freight routes. Over the weekend, Duma joined law enforcement agencies at the Mkhondeni Weighbridge</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kzn-launches-major-offensive-against-illegal-trucking-operations-zimbabweans-arrested/\">KZN launches major offensive against illegal trucking operations, Zimbabweans arrested</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:35",
            "date": "29 Oct 2025"
        }
    ]
}