{
    "news": [
        {
            "title": "Zimbabwe’s dollar stock market closes in on 131-year-old main bourse",
            "url": "https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourses mantle as the southern African nations main trading platform.\n\nThe 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for the 49 stocks trading in the local ZiG currency on theZimbabwe Stock Exchange.\n\nThe gap between the two exchanges is substantial but could narrow quickly in the event of a currency event that impacts on company valuations or if a large firm migrates to the new bourse, according to Lloyd Mlotshwa, head of research at IH Securities.\n\nIf we are looking at purely organic growth, the total value of shares on the VFEX could exceed those on the ZSE within the next 24 months, he said.\n\nTrade in blue-chips, including Delta Corp and Econet Wireless Zimbabwe, is still anchored on the local-currency exchange.\n\nThe two firms, which make up 54% of the ZSEs total market value, may face pressure to migrate to VFEX to better protect shareholder returns, Imara Asset Management Chief Executive Officer Shelton Sibanda said.\n\nThe economy is dollarised with pension funds doing more trading on the VFEX, he said in an interview.\n\nThe VFEX has posted broad gains this year, mirroring rallies across emerging markets on the back of firm commodity prices, a steadier local currency, and renewed confidence, IH Securities said. That contrasts with the ZSE  long a haven for investors during bouts of high inflation  which is slightly lower.\n\nThe VFEX has been the standout performer, with market capitalisation rising over 40% year to date, the Harare-based brokerage said in its latest equity report, attributing the strong performance to gold-linked and consumer-facing stocks.\n\nLiquidity on the VFEX has also improved significantly, the brokerage added. With average daily turnover up 197% from the prior year, reflecting deepening participation by both institutional and retail investors.\n\nThe main exchange in Harare has borne the brunt of a yearlong liquidity squeeze thats been in place since the 43% devaluation of the ZiG, short for Zimbabwe Gold, last September.\n\nTrading on the ZSE has slumped, and IH Securities expects the slowdown will continue to suppress stock market activity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/23081422/zse.jpeg",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock exchange, created in 2020 amid a currency crisis, is fast closing in on the 131-year-old main bourse’s mantle as the southern African nation’s main trading platform. The 17 companies listed on the Victoria Falls Stock Exchange had a combined market value of $1.9 billion on Tuesday, compared with $2.6 billion for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-dollar-stock-market-closes-in-on-131-year-old-main-bourse/\">Zimbabwe’s dollar stock market closes in on 131-year-old main bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "19 Nov 2025"
        },
        {
            "title": "Zimbabwe’s inflation drops, but debt management remains key",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/",
            "content": "Forbes Africa\n\nThe Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025.\n\nZimbabwes economy hasbeenimpactedbysevere inflation since the early 2000s, but officialsmaybebreathing a sigh of relieffollowinga recentConfederation of Zimbabwe Industries (CZI) report, which showed inflation to have droppedfrom82.7% in September to 32.7% in October.\n\nThe future appears brighter with inflation projected to fall to between 15% and 20% by the end of the year, marking a significant recovery from 2020, when inflation soared past 500%,amid the pandemic.\n\nIntroduced by the Reserve Bank of Zimbabwe (RBZ) in April 2024, the rising valuation ofZiG, pegged to foreign currency and precious metals, primarily gold, has beenaleading protagonist behind Zimbabwes economic resurgence.\n\nAccording to theInternational Monetary Fund, the nations current GDP is $53.31 billionup $13.35 billion from 2020.\n\nHowever, despitetheimpactof theZiG, expertsseem to becautiousofa recurring theme of volatility.\n\nThe outlook for the ZiG has improved over the near term, supported by elevated gold prices. However, it still has a long way to go before it becomes the sole legal tender for Zimbabwe, says Lyle Begbie, an economist at Oxford Economics Africa.\n\nZimbabwes history of hyperinflation and failed monetary experiments means itremainshighly dollarized. The U.S.dollar is the main medium of exchange, while the share ofZiGin monetary aggregates is small at around 17%. Prices are rarely quoted inZiG, and salaries and goods and services transactions are typically either fully or partially paid in U.S.dollars.\n\nWhile stabilizing inflation is undoubtedly positive, the landlocked nationwill need to remain steadfastregardingother challenges,before unlocking national sovereignty. Zimbabwes public debt, which reached $23.2 billion in 2024 (72.9% of GDP),per the World Bank,remainsa discouraging barrier to foreign investment.\n\nZimbabwes debt arrearssubstantially weighon its economic growth outlook, Begbie explains, before adding, Due to these arrears, the country cannot access concessional funding from multilateralorganizations, andis excluded from obtaining any sort of debt relief.\n\nThe World Bank has placed Zimbabwe in non-accrual status since 2000. Whilemassivedebtrisks stallingmomentum, addressing inflationwillput thatsummitwithin reach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Forbes Africa The Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025. Zimbabwe’s economy has been impacted by severe inflation since the early 2000s, but officials may be breathing a sigh of relief following a recent Confederation of Zimbabwe Industries (CZI) report, which showed inflation to have dropped from 82.7% in September</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/\">Zimbabwe’s inflation drops, but debt management remains key</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "19 Nov 2025"
        },
        {
            "title": "ANC NEC members demand investigation into intelligence failures over Palestinian refugee flights",
            "url": "https://www.newzimbabwe.com/anc-nec-members-demand-investigation-into-intelligence-failures-over-palestinian-refugee-flights/",
            "content": "IOL\n\nMembers of the ANCs national executive committee (NEC) have called for an investigation into how the South Africas intelligence services failed to warn the government about the imminent arrival of planes transporting refugees from Palestine.\n\nThe Mercury understands from NEC members, who were part of themeeting this past weekend, that concerns were raised that refugees had arrived in the country, with the intelligence services knowing nothing about it.\n\nTwo planes have landed in the country, withone landing a few days ago. The arrival of the passengers raised alarms within government circles, as it has since emerged that the refugees did not know where they were being taken.\n\nA source in the NEC said during discussions, members were shocked that the intelligence services failed to detect this situation.\n\nKeep in mind that this is not the first time something like this has happened; there is another plane that has arrived before, and there have been people coming from Palestine and, we understand, others from Ukraine. However, the intelligence service was unaware; how can that be? We now want them to be investigated, stated the source.\n\nThe NEC members said that both the domestic and foreign intelligence arms should take responsibility for this security breach.\n\nA plane filled with people just landed in our country and they know nothing about it. We wanted answers because this means this could happen again and again.\n\nThe source said the issue was not about the Palestinian refugees but the fact that such a security breach was allowed to happen. The party also wants a profile of everyone that is in the country.\n\nWe are concerned that some of the people that have arrived stated that they paid about R30 000 to be taken here, and we wanted to confirm if that is indeed the case.\n\nThe NEC member also said the party would want to put more stringent visa regimes in place going forward, pointing out that Palestinians and Israelis could get into the country with visas, and that could be beefed up going forward. We have to know who is in the country.\n\nSeveral attempts to get comment from the ANC yesterday were unsuccessful.\n\nPolitical analyst Thabani Khumalo said the situation has left many questions for the ruling party to answer.\n\nIn South Africa, you do not know whether this is a country or what; the manner in which this unfolded has left many people feeling unsafe. We do not feel safe, and the visitors to the G20 will feel unsafe as well.\n\nHow many people are roaming the streets that are unknown? There have been reports of people operating training camps, and even the defence members are complaining, indicating that many things are not going well.\n\nInternational Relations Minister Ronald Lamola said the flight was part of a clear agenda to cleanse Palestinians from Gaza and the West Bank.\n\n[This] is a clearly orchestrated operation because they are not only being sent to South Africa. There are other countries where such flights have been sent, he said.\n\nIt was reported that the Palestinian embassy in South Africa stated that the group left Israels Ramon Airport and flew to the country via the Kenyan capital, Nairobi, without any prior notice or co-ordination.\n\nThe embassy added that an unregistered and misleading organisation had exploited the plight of the Gaza citizens, deceived families, collected money from them, and facilitated their travel in an irregular and irresponsible manner.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/28060019/ANC-rally.jpeg",
            "description": "<p>IOL Members of the ANC’s national executive committee (NEC) have called for an investigation into how the South Africa’s intelligence services failed to warn the government about the imminent arrival of planes transporting refugees from Palestine. The Mercury understands from NEC members, who were part of the meeting this past weekend, that concerns were raised that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/anc-nec-members-demand-investigation-into-intelligence-failures-over-palestinian-refugee-flights/\">ANC NEC members demand investigation into intelligence failures over Palestinian refugee flights</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "19 Nov 2025"
        },
        {
            "title": "Mutapa Fund mining cluster injects 2.4 tons of gold in nine months",
            "url": "https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/",
            "content": "By Alois Vinga\n\nThe Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions.\n\nAs the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests in opportunities aligned with national development priorities across agriculture, renewable energy, technology, and mining. The Fund derives income primarily through dividends and investment returns, and may selectively pursue third-party funding while maintaining conservative leverage under strict risk and governance frameworks.\n\nAddressing delegates at the Zimbabwe Gold Investment Conference 2025, MIF Deputy Chief Investment Officer Ernest Denhere said the strong performance was driven by investee companies within the mining cluster.\n\nThe Fund has strong presence in the gold space through Kuvimba Mining House (KMH) and Defold Mine, delivering 29% of Large Scale Miners gold to Fidelity between January and September, at 2.4 tons. The Fund recognises that gold currently presents a unique opportunity for value creation and growth in export receipts, he said.\n\nMIF officials noted that precious metals, especially gold, have surged in 2025 as investors seek safe-haven assets amid geopolitical and economic uncertainty. Gold has gained 56% year-to-date, while Zimbabwes gold exports have grown by 71% for the nine months to September 2025.\n\nDenhere said the value of gold exported by September stood at US$3.2 billion, with artisanal and small-scale miners contributing 74% of total gold output.\n\nWith a funding pipeline of at least US$500 million across several gold projects, the Fund is open to exploring different strategies to support the sector and bolster the gold value chain. MIF is a long-term, non-speculative investor focused on providing patient capital to its investors.\n\nThe Funds strategy also includes establishing an exploration fund. With gold as a safe-haven asset with long-term upside, there is strong upside for new discoveries, added Denhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>By Alois Vinga The Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions. As the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/\">Mutapa Fund mining cluster injects 2.4 tons of gold in nine months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "19 Nov 2025"
        },
        {
            "title": "ZIFA blocks PSL bid to suspend relegation, says proposal is invalid",
            "url": "https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer Leagues (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, cannot be implemented.\n\nAt an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under PSLs proposal, eight teams that were facing relegation this season would survive, while the four regional division champions would be promoted to the topflight, bringing the league to 22 clubs.\n\nThe meetingwas convened after ZIFA had earlier recommended a 20-team league structure.\n\nIn a statement, ZIFA, however, trashed the PSLs resolution,\n\nThe Association wishes to make it unequivocally clear that this proposal cannot be implemented. Promotion and relegation are fundamental components of football competition and are essential to maintaining the integrity, fairness, and sporting merit of the league system.\n\nZIFA confirmed that four clubs will be relegated at the conclusion of the 2025 Castle Lager Premier Soccer League season, which officially ends on 23 November 2025.\n\nThe association also reminded the PSL to follow proper procedure when proposing structural changes in the future.\n\nShould the Premier Soccer League or any other member wish to propose an adjustment to the number of participating teams or propose any other resolution, such a request must be formally submitted to the Association. In accordance with ZIFA statutes, the proposal will then be tabled for consideration at the next ZIFA Congress, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer League’s (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, “cannot be implemented.” At an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/\">ZIFA blocks PSL bid to suspend relegation, says proposal is invalid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "19 Nov 2025"
        },
        {
            "title": "Cloudflare outage disrupts X, ChatGPT and other parts of the internet",
            "url": "https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/",
            "content": "The Verge\n\nCloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage thats taking down sites across the web. Users encountered error messages when trying to access X,ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs of recovery.\n\nMany sites displayed an error message saying Please unblock challenges.cloudflare.com to proceed. On Cloudflaresstatus page, the most recent update from the company at 9:34AM ET says:\n\nWeve deployed a change which has restored dashboard services. We are still working to remediate broad application services impact.\n\nIn a statement toThe Verge, Cloudflare spokesperson Jackie Dutton says the company noticed a spike in unusual traffic to one of its services starting at 6:20AM ET, causing some traffic passing through Cloudflares network to experience errors. Dutton adds, We do not yet know the cause of the spike in unusual traffic. We are all hands on deck to make sure all traffic is served without errors. The company is also planning to investigate the cause of the unusual spike in traffic.\n\nOther online services, including Indeed, Grindr, Uber, Canva, Spotify, NJ Transit,League of Legends, and Archive of Our Own, experienced issues during the outage, while digital outlets likeAxios,The Information, andPoliticoalso went down.\n\nThe Cloudflare outage comes less than a month after a hugeAmazon Web Services crash took downFortnite, Alexa, Snapchat, and other services, which was followed by issues atMicrosoft Azure that brought Xbox offlinefor hours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18150503/cloudflare.jpeg",
            "description": "<p>The Verge Cloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage that’s taking down sites across the web. Users encountered error messages when trying to access X, ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/\">Cloudflare outage disrupts X, ChatGPT and other parts of the internet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "19 Nov 2025"
        }
    ]
}