{
    "news": [
        {
            "title": "Zimbabwe launches wildlife translocation programme to restore biodiversity at national park",
            "url": "https://www.newzimbabwe.com/zimbabwe-launches-wildlife-translocation-programme-to-restore-biodiversity-at-national-park/",
            "content": "By Mary Taruvinga\n\nZIMBABWE Parks and Wildlife Management Authority (ZimParks) has announced the implementation of a comprehensive wildlife transformation programme.\n\nThe exercise is aimed at improving the biodiversity in one of its major game reserves, the Matusadonha National Park (MNP).\n\nZimParks spokesperson Tinashe Farawo said the multi-year initiative will be rolled out in partnership with the African Parks Network and The Matusadona Conservation Trust.\n\nThis will be done to restore biodiversity, enhance ecological resilience, and support sustainable natural resource management within MNP and its broader landscape.\n\nThe authority issued permits to translocate 10 eland (Taurotragus oryx) and 50 buffalos (Syncerus caffer) from Tsetse Island, part of the Lake Kariba Recreational Park, to Matusadona.\n\nAdditionally, 20 sable antelope (Hippotragus niger) will be relocated from Sibilobilo Safari Area, alongside other key herbivores-including sable, eland, and roan antelope (Hippotragus equinus) sourced from carefully selected populations across the country.\n\nThis strategic intervention aims to re-establish viable, self-sustaining herbivore populations, contributing to ecosystem restoration and the rewilding of Matusadona as part of the larger Sebungwe landscape, Farawo said in a Friday statement.\n\nAccording to Farawo these efforts are underpinned by scientific ecological assessments to safeguard the health and sustainability of source populations.\n\nHe said throughout the duration of this multi-year programme, additional measures will be implemented to strengthen conservation outcomes.\n\nThese include enhanced law enforcement, biodiversity monitoring, and community development initiatives aimed at improving local livelihoods, boosting anti-poaching efforts, and generating tangible conservation benefits for communities living adjacent to the national park.\n\nSuch integrated approaches are essential to promoting coexistence and ensuring the long-term sustainability of conservation efforts.\n\nMatusadona National Park is currently undergoing a transformative phase, driven by substantial investments in infrastructure, ecological restoration, and stakeholder engagement, these initiatives are positioning the park once again as a key national conservation asset.\n\nThe translocation programme is a vital component of this broader strategy, ensuring that wildlife populations thrive and that the ecological, cultural, and economic benefits are preserved for present and future generations.\n\nFarawo said ZimParks and its partners remain committed to responsible, evidence-based conservation practices that uphold biodiversity integrity, ecosystem health, and community well-being.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/08134815/Hwange-National-Park.jpg",
            "description": "<p>By Mary Taruvinga  ZIMBABWE Parks and Wildlife Management Authority (ZimParks) has announced the implementation of a comprehensive wildlife transformation programme. The exercise is aimed at improving the biodiversity in one of its major game reserves, the Matusadonha National Park (MNP). ZimParks spokesperson Tinashe Farawo said the multi-year initiative will be rolled out in partnership with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-launches-wildlife-translocation-programme-to-restore-biodiversity-at-national-park/\">Zimbabwe launches wildlife translocation programme to restore biodiversity at national park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "06 Jul 2025"
        },
        {
            "title": "Woman imprisoned 15 years for bizarre sexual act on girl (7)",
            "url": "https://www.newzimbabwe.com/woman-imprisoned-15-years-for-bizarre-sexual-act-on-girl-7/",
            "content": "By Mary Taruvinga\n\nA 19-year-old woman from Chirumanzu in Midlands province has been slapped with a 15-year jail term for indecent assault on a seven-year-old girl.\n\nTatenda Madanhire of Munetsi village in Chirumazu, Midlands province, was convicted by Gweru Magistrate Christopher Maturure after pleading guilty to the charge.\n\nThe court heard she violated the minor on the pretext of teaching her a game.\n\nThe accused and the complainant are not related.\n\nThe State proved that the incident occurred on June 21, 2025, at around 1500 hours.\n\nThe complainant was walking from school with her schoolmate also aged seven.\n\nThey then met Madanhire, who was gathering firewood in a bush in the riverbanks of dry stream near the village.\n\nThe accused walked for a distance of approximately 500 metres with the two and she grabbed the complainants hand and told that she wanted to play a game with her.\n\nShe scolded the other child and instructed her to proceed home.\n\nThe accused took the complainant to a secluded place where she undressed her before sexually assaulting her using her enlarged genitalia, which bizarrely resembles a male persons private organ.\n\nWhen the complainant arrived home, she told her aunt that she was sexually abused by a male person who was wearing a skirt.\n\nThe matter was reported to the police and investigations were carried out leading to the arrest of the accused.\n\nThe complainant and accused were sent to St Theresas Hospital for medical examination, and they were medically examined.\n\nMonica Mungwena prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Mary Taruvinga A 19-year-old woman from Chirumanzu in Midlands province has been slapped with a 15-year jail term for indecent assault on a seven-year-old girl. Tatenda Madanhire of Munetsi village in Chirumazu, Midlands province, was convicted by Gweru Magistrate Christopher Maturure after pleading guilty to the charge. The court heard she violated the minor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-imprisoned-15-years-for-bizarre-sexual-act-on-girl-7/\">Woman imprisoned 15 years for bizarre sexual act on girl (7)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "06 Jul 2025"
        },
        {
            "title": "FC Platinum challenged to win PSL title in honour of late Brian Banda",
            "url": "https://www.newzimbabwe.com/fc-platinum-challenged-to-win-psl-title-in-honour-of-late-brian-banda/",
            "content": "By Sports Reporter\n\nWARRIORS midfielder Thandolwenkosi Ngwenya has challenged former club FC Platinum to win the 2025 Castle Lager Premier Soccer League title in honour of the late Brian Banda, who passed away Sunday last week.\n\nBanda was involved in an accident, which claimed two other lives on the spot along Zvishavane -Filabusi road and was laid to rest last Wednesday in Bulawayo.Ngwenya, who completed a move from FC Platinum to South Africas Betway Premiership side Amazulu, was last week voted Castle Lager Premier Soccer League Player of The Month June after a good run which saw him scoring three goals.Brian Bandas passing away was a shock but we just have to accept the reality.I just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nBanda was involved in an accident, which claimed two other lives on the spot along Zvishavane -Filabusi road and was laid to rest last Wednesday in Bulawayo.\n\nNgwenya, who completed a move from FC Platinum to South Africas Betway Premiership side Amazulu, was last week voted Castle Lager Premier Soccer League Player of The Month June after a good run which saw him scoring three goals.Brian Bandas passing away was a shock but we just have to accept the reality.I just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nNgwenya, who completed a move from FC Platinum to South Africas Betway Premiership side Amazulu, was last week voted Castle Lager Premier Soccer League Player of The Month June after a good run which saw him scoring three goals.\n\nBrian Bandas passing away was a shock but we just have to accept the reality.I just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nBrian Bandas passing away was a shock but we just have to accept the reality.\n\nI just want to say to the boys (FC Platinum team) stay strong and work hard.You (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nI just want to say to the boys (FC Platinum team) stay strong and work hard.\n\nYou (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.The 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nYou (players ) just have to win the league for the sake of Brian Banda, said Ngwenya.\n\nThe 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.I can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nThe 22-year-old added that 2025 has been the best year for him at FC Platinum and he will forever cherish the memories.\n\nI can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.Ngwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nI can say this was the best season for me at FC Platinum, especially the month of June, l did enjoy a lot although we had to part, added Ngwenya.\n\nNgwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\nNgwenya was FC Platinums best performing player during the first half of the season, scoring nine goals in 17 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/29175151/IMG-20250629-WA0043.jpg",
            "description": "<p>By Sports Reporter WARRIORS midfielder Thandolwenkosi Ngwenya has challenged former club FC Platinum to win the 2025 Castle Lager Premier Soccer League title in honour of the late Brian Banda, who passed away Sunday last week. Banda was involved in an accident, which claimed two other lives on the spot along Zvishavane -Filabusi road and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fc-platinum-challenged-to-win-psl-title-in-honour-of-late-brian-banda/\">FC Platinum challenged to win PSL title in honour of late Brian Banda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "06 Jul 2025"
        },
        {
            "title": "Nutty O’s new album ‘Too Much’ arrives July 8, packed with love",
            "url": "https://www.newzimbabwe.com/nutty-os-new-album-too-much-arrives-july-8-packed-with-love/",
            "content": "By Tapiwa Svondo\n\nAWARD-winning Afro-fusion artist Nutty O is set to shake the music scene once more with his second solo project of the year, a powerful ode of love and positivity titled Too Much.\n\nThe album, which is slated to drop on July 8, 2025, has been dubbed as not just a collection of tracks but a vessel for hope, a beacon against the shadows forged in the crucible of challenging times.\n\nBorn Carrington Simbarashe Chiwadzwa, the 32-year-old musical powerhouse, in a statement said, the album will bring love.\n\nI am thrilled to announce the release of my second solo project this year, a testament to the power of love and music in these challenging times.\n\nAs the world navigates difficult moments, I believe love is the answer, and this new project embodies that spirit.Through my music, I aim to spread love, positivity, and hope. I hope you enjoy this new release and join me in embracing the transformative power of love, said Nutty O.His little to non-controversial career began in 2013 and blossomed when he gained international recognition for his feature on the Grammy-nominated Reggae Forever album, followed by his debut record, Mustard Seed, which saw him scoop three prestigious awards in 2022, including Best Album, Song of The Year, and Best Male Artist.Further cementing his legacy, Nutty O was featured alongside the iconic Bob Marley in the reimagined Africa Unite album in 2023\n\nAs the world navigates difficult moments, I believe love is the answer, and this new project embodies that spirit.\n\nThrough my music, I aim to spread love, positivity, and hope. I hope you enjoy this new release and join me in embracing the transformative power of love, said Nutty O.\n\nHis little to non-controversial career began in 2013 and blossomed when he gained international recognition for his feature on the Grammy-nominated Reggae Forever album, followed by his debut record, Mustard Seed, which saw him scoop three prestigious awards in 2022, including Best Album, Song of The Year, and Best Male Artist.\n\nFurther cementing his legacy, Nutty O was featured alongside the iconic Bob Marley in the reimagined Africa Unite album in 2023\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/08/07191401/Musician-Nutty-O.jpg",
            "description": "<p>By Tapiwa Svondo AWARD-winning Afro-fusion artist Nutty O is set to shake the music scene once more with his second solo project of the year, a powerful ode of love and positivity titled “Too Much.” The album, which is slated to drop on July 8, 2025, has been dubbed as not just a collection of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nutty-os-new-album-too-much-arrives-july-8-packed-with-love/\">Nutty O’s new album ‘Too Much’ arrives July 8, packed with love</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "06 Jul 2025"
        },
        {
            "title": "UK: Police appeal to find family of Zimbabwean man who died on train tracks",
            "url": "https://www.newzimbabwe.com/uk-police-appeal-to-find-family-of-zimbabwean-man-who-died-on-train-tracks/",
            "content": "By UK Media\n\nBIRMINGHAM: An appeal has been launched to trace the family of a man whose body was found on train tracks.\n\nOfficers were called to a section of railway in Ladywood at around 9.15am on June 23.\n\nThe death was not been treated as suspicious.\n\nBritish Transport Police later identified him as Brian Bande.\n\nThe 39-year-old was born in Zimbabwe and had links toBirmingham, Wiltshire, Dorset and Bournemouth.\n\nBut police have been unable to trace his family and asked anyone who could help to make contact.\n\nThe force said: On Monday, June 23, at around 9.15am, officers were called to an area of the line in Ladywood to reports of a casualty on the tracks.\n\nParamedics also attended, however sadly a man was pronounced dead at the scene. The incident is not being treated as suspicious.\n\nThe man has been identified as 39-year-old Brian Bande.\n\nMr Bande was born in Zimbabwe, but had links to Birmingham, Wiltshire, Dorset and Bournemouth.\n\nDespite extensive enquiries, officers have been unable to trace Mr Bandes next-of-kin or any other family members to inform them of this sad news. They are appealing for any relatives or anyone who may have information about Mr Bandes family to come forward and assist their investigation.\n\nAnyone with information is asked to contact BTP by texting 61016 or calling 0800 40 50 40 quoting reference 123 of June 23.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/05145126/UK-TRAINS-e1751723520920.jpg",
            "description": "<p>By UK Media BIRMINGHAM: An appeal has been launched to trace the family of a man whose body was found on train tracks. Officers were called to a section of railway in Ladywood at around 9.15am on June 23. The death was not been treated as suspicious. British Transport Police later identified him as Brian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-police-appeal-to-find-family-of-zimbabwean-man-who-died-on-train-tracks/\">UK: Police appeal to find family of Zimbabwean man who died on train tracks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "06 Jul 2025"
        }
    ]
}