{
    "news": [
        {
            "title": "With tobacco output record already set, Zimbabwe eyes 400m kg milestone",
            "url": "https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/",
            "content": "Tobacco Reporter\n\nTwo weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this years crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million kg.\n\nDriving the surge is a sharp increase in smallholder participation, government-led reforms, and research-driven innovations. More than 127,000 farmers, 85% of them smallholders, are registered this season, which ensures access to inputs, training, and markets.\n\nDr. Frank Magama, CEO of Kutsaga, Zimbabwes leading tobacco research institute, credited the Tobacco Value Chain Transformation Plan introduced in 2021 for boosting productivity through better farming practices, climate-smart seed varieties, and sustainability initiatives.\n\nOver 80% of our crop was produced under contract, ensuring inputs, technical support, and guaranteed markets, Magama said. While expansion has occurred, what is more exciting is the productivity increase per unit area. With improved post-harvest handling, energy-efficient barns, and better training, the numbers are speaking for themselves.\n\nHe also warned, however, of the risks from global oversupply and stressed the importance of environmental compliance to maintain competitiveness.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31054919/Tobacco-Agriculture.jpg",
            "description": "<p>Tobacco Reporter Two weeks after topping 300 million kilograms of tobacco output for the first time, Zimbabwean officials say this year’s crop should top 330 million kg, and that achieving 400 million kg in the future is within reach. According to the Tobacco Industry and Marketing Board, on June 27, the harvest reached 319.2 million</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/with-tobacco-output-record-already-set-zimbabwe-eyes-400m-kg-milestone/\">With tobacco output record already set, Zimbabwe eyes 400m kg milestone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "01 Jul 2025"
        },
        {
            "title": "Three days of protests leave seven dead in Togo, rights groups say",
            "url": "https://www.newzimbabwe.com/three-days-of-protests-leave-seven-dead-in-togo-rights-groups-say/",
            "content": "BBC\n\nCivic rights groups say at least seven people have been killed during a crackdown on protesters who are calling for Togos leader, Faure Gnassingb, to step down and release political prisoners.\n\nSeven bodies were recovered from rivers in the capital city Lom, according to a coalition called Le Front Citoyen Togo Debout which accuses security forces and militias of committing abuses.\n\nThe Togolese government has denied these deaths were linked to last weeks demonstrations.\n\nIt is now threatening legal action against the protest organisers, calling the protests a campaign of disinformation and hatred that was orchestrated from abroad.\n\nThere is growing anger in Togo due to a crackdown on critical voices, and changes to the constitution labelled by labelled by critics and opposition figures as an institutional coup dtat.\n\nThese protests comes weeks after Gnassingb  who was president for two decades and whose family has ruled the country for 58 years  wassworn into a new post of President of the Council of Ministers, which has no official term limits.\n\nDemonstrations have been banned in the West African country since 2022, with the authorities citing security reasons.\n\nThree days of demonstrations by online activists and youth-led movements began in Lom on Thursday, before taking a violent turn on Friday and Saturday.\n\nTear gas was fired by anti-riot police at protesters, who pelted them with stones and other missiles.\n\nSome determined anti-government protesters engaged security forces in street battles in several areas considered to be opposition strongholds, including B, where police chased demonstrators into their hideouts.\n\nA coalition of 23 Togolese civil rights groups  known as the National Platform for Civic Space and Development Effectiveness  has since asked the authorities to carry out investigations into the bloody police repression.\n\nThey condemned what they described as the use of disproportionate force against peaceful demonstrators, adding that peaceful protest is a fundamental right, recognized both by the Togolese Constitution and by international instruments ratified by our country.\n\nBy Sunday calm had returned to most of Lom, with shops reopened at the main central market at Assigam and businesses operating as usual.\n\nThe recent change of regime orchestrated by the Togolese leader continues to fuel resentment. In addition to the new post which he can keep for life, constitutional reform in Togo has ended presidential elections, and introduced a parliamentary system.\n\nLast months arrest and psychiatric detention of the Togolese rapper Narcisse Essow Tchalla, also known as Aamron, acted as a catalyst for public outrage, culminating in over 50 arrests during protests earlier this month.\n\nThough most have been released, at least three people remain in custody.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01005735/Screenshot-2025-07-01-at-01.55.48.png",
            "description": "<p>BBC Civic rights groups say at least seven people have been killed during a crackdown on protesters who are calling for Togo’s leader, Faure Gnassingbé, to step down and release political prisoners. Seven bodies were recovered from rivers in the capital city Lomé, according to a coalition called Le Front Citoyen Togo Debout which accuses</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-days-of-protests-leave-seven-dead-in-togo-rights-groups-say/\">Three days of protests leave seven dead in Togo, rights groups say</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwean man sentenced in Limpopo for attempt to smuggle stolen Toyota Corolla Cross",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-sentenced-in-limpopo-for-attempt-to-smuggle-stolen-toyota-corolla-cross/",
            "content": "IOL\n\nThe Mokopane Regional Court has imposed six years of direct imprisonment against a 37-year-old Zimbabwean man,Joseph Kungwengwe, after he was found in possession of a stolen vehicle, aToyota Corolla Cross.\n\nThe police intercepted and recovered the compact sport utility vehicle in Mokopane on 29 December last year.\n\nKungwengwe was subsequently arrested after the stolen vehicle was intercepted.\n\nLimpopo provincial police spokesperson, Colonel Malesela Ledwaba, said the Toyota Corolla Cross was reported stolen at Brakpan, in Gauteng province, last year.\n\nLimpopo provincial anti-smuggling team received intelligence information about a suspected stolen motor vehicle from Gauteng province driving along N1, en route to Beitbridge port of entry, said Ledwaba.\n\nHe added that the stolen vehicle was to be smuggled from the South African side of the border, into neighbouring Zimbabwe.\n\nThe team operationalized the lookout information, and the vehicle matching the description was spotted driving along N1, next to Zebediela Toll Plaza, where it was cornered, said Ledwaba.\n\nThe driver was arrested for possession of a suspected stolen motor vehicle, and the car was confiscated for further investigations.\n\nFollowing trial, the Mokopane Regional Court convicted 37-year-old Kungwengwe and sentenced him to six years of direct imprisonment for possession of a suspected stolen vehicle.\n\nMeanwhile, provincial commissioner of police in Limpopo,Lieutenant General Thembi Hadebehas applauded the provincial anti-smuggling team for their sterling work to prevent smuggling of motor vehicles.\n\nLast month, IOL reported that31-year-old man,Mikael Mlambo, appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was also being driven towards the Beitbridge port of entry.\n\nAt the time,Brigadier Hlulani Mashabatold IOL that Mlambo was remanded in custody.\n\nMikael Mlambo, a South African man, was arrested by police in Limpopo while he was allegedly driving a stolen Toyota Corolla Cross towards Zimbabwe. Image:SAPS\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen last month,around Pretoria central.\n\nOn Friday, 16 May 2025, members of the provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01005437/Screenshot-2025-07-01-at-01.52.50.png",
            "description": "<p>IOL The Mokopane Regional Court has imposed six years of direct imprisonment against a 37-year-old Zimbabwean man, Joseph Kungwengwe, after he was found in possession of a stolen vehicle, a Toyota Corolla Cross. The police intercepted and recovered the compact sport utility vehicle in Mokopane on 29 December last year. Kungwengwe was subsequently arrested after the stolen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-sentenced-in-limpopo-for-attempt-to-smuggle-stolen-toyota-corolla-cross/\">Zimbabwean man sentenced in Limpopo for attempt to smuggle stolen Toyota Corolla Cross</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "01 Jul 2025"
        },
        {
            "title": "Ignoring government failures is patriotism – ZANU PF MPs say, push for National Ideology",
            "url": "https://www.newzimbabwe.com/ignoring-government-failures-is-patriotism-zanu-pf-mps-say-push-for-national-ideology/",
            "content": "By Darlington Gatsi\n\nRULING party ZANU PFs legislators remain resolute in pushing for legislation that criminalises criticising the governments shortcomings, despite pushback from the opposition.\n\nZANU PF MP Joseph Mapiki recently tabled a motion for Zimbabwe to adopt a National Ideology, which is currently being debated in Parliament.\n\nAccording to Mapiki, the National Ideology would entrench patriotism and foster a Zimbabwean identity.\n\nZANU PF legislator Ophias Murambiwa said the governments failures should not warrant bad-mouthing.\n\nI am very amazed that there are some Hon. Members who debated and spoke, yet they cannot show their love for the country because hospitals do not have medication.\n\nAccording to me, how can you say that you are not in love with your country when it lacks medication in hospitals? That alone is not sufficient because it does not mean that tomorrow we are not going to have the medication, said Murambiwa.\n\nMurambiwa added that there should be a law that punishes government critics.\n\nThe most important issue is to love our country, let us praise our country in all circumstances, whether in good or in bad times, during the night or during the day. Let us love our country.\n\nI also suggest that this august House must come up with a law which states that those who speak evil of their country must face the full wrath of the law and then be jailed.\n\nZANU PF has long been mooting a law that criminalises speaking ill of the country under the guise of patriotism.\n\nPushing ahead with the National Ideologya replica of ZANU PFs Herbert Chitepo School of Ideologythe ruling party plans to incorporate it into the education curriculum.\n\nHowever, this has been resisted by opposition legislators, who fear the National Ideology will be used to clamp down on dissenting voices.\n\nOpposition MP Prosper Mutseyami said Zimbabwe risks degenerating into authoritarianism.\n\nWhat then is true patriotism? Patriotism is not blind loyalty. It is not empty slogans. It is a conscious love for our country that demands honest reflection, accountability and action.\n\nTrue patriots question injustice, challenge corruption and demand systems that serve the people, not select a few. It is the voice that speaks when citizens are denied opportunities, when our youth struggle for employment, and when economic policies fail to uplift the masses.\n\nOur patriotism must ignite participation, ensuring that every Zimbabwean plays an active role in shaping the future, said Mutseyami.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/24030405/New-Parliament-.jpeg",
            "description": "<p>By Darlington Gatsi  RULING party ZANU PF’s legislators remain resolute in pushing for legislation that criminalises criticising the government’s shortcomings, despite pushback from the opposition. ZANU PF MP Joseph Mapiki recently tabled a motion for Zimbabwe to adopt a National Ideology, which is currently being debated in Parliament. According to Mapiki, the National Ideology would</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ignoring-government-failures-is-patriotism-zanu-pf-mps-say-push-for-national-ideology/\">Ignoring government failures is patriotism – ZANU PF MPs say, push for National Ideology </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "01 Jul 2025"
        }
    ]
}