{
    "news": [
        {
            "title": "Mai TT apologises to businesswoman Jere amid US$100,000 lawsuit",
            "url": "https://www.newzimbabwe.com/mai-tt-apologises-to-businesswoman-jere-amid-us100000-lawsuit/",
            "content": "By Staff Reporter\n\nComedienne Mai TT, has, in a shocking twist, publicly apologised to businesswoman Shingirayi Ziwange Jere, who slapped her with a US$100,000 defamation lawsuit.\n\nShingirayi is the wife of CAPS United owner and Zanu PF legislator, Farai Jere.\n\nThis marks a notable departure from the socialites past approach to public disputes, where she rarely apologises.\n\nI would like to offer my deepest and most sincere apology to Hon. Farai Jere and his wife, Mrs. Shingi Ziwange-Jere, for the posts made on social media regarding you. I regret the hurt and distress caused and take full responsibility for my actions.\n\nIt was never my intention to bring harm or disrespect. I acknowledge the damage done. Please accept this apology with genuine remorse, said Mai TT in a Facebook post.\n\nThe lawsuit followed Mai TTs Facebook posts on June 9, where she accused Jere of threatening her, orchestrating assaults, and manipulating the justice system.\n\nThe businesswoman represented by lawyer Admire Rubaya labelled the claims unfounded, fabricated and portrayed her as a criminal queenpin.\n\nIn addition to the lawsuit, Jere lodged a criminal complaint under Zimbabwes Cyber and Data Protection Act, citing cyberbullying, harassment, and spreading false information.\n\nBefore the public apology, Mai TT said she had accepted that certain conflicts cannot be won.\n\nI have never created a fake account or utilised a ghost account to attack anyone, as I believe in expressing myself directly and honestly. However, when I respond to someone who has initially attacked me, I am often perceived as being in the wrong.\n\nI am willing to accept that there are certain conflicts that cannot be won. I often wonder what I have done to provoke such behaviour, but I recognise that some individuals will fabricate reasons to criticise me.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08103324/WhatsApp-Image-2025-07-08-at-11.32.46.jpeg",
            "description": "<p>By Staff Reporter Comedienne Mai TT, has, in a shocking twist, publicly apologised to businesswoman Shingirayi Ziwange Jere, who slapped her with a US$100,000 defamation lawsuit. Shingirayi is the wife of CAPS United owner and Zanu PF legislator, Farai Jere. This marks a notable departure from the socialite’s past approach to public disputes, where she</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mai-tt-apologises-to-businesswoman-jere-amid-us100000-lawsuit/\">Mai TT apologises to businesswoman Jere amid US$100,000 lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Jul 2025"
        },
        {
            "title": "Sables coach predicts competitive Rugby Africa Cup, as Zimbabwe eyes title defense",
            "url": "https://www.newzimbabwe.com/sables-coach-predicts-competitive-rugby-africa-cup-as-zimbabwe-eyes-title-defense/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade believesthat this years Rugby Africa Cup will be more challenging as his side defends itstitle.\n\nThe Rugby Africa Cup kickedoffTuesday at Nelson Mandela Stadium in Ugandawithdefending champions Zimbabweopeningits campaign against North African side Morocco.\n\nAlthough Benade boasts of continuity as he has managed to retain the bulk of players who won last years Rugby Africa Cup edition, the Sables gaffer is not undermining his competitors efforts.\n\nMany teams have invested in players and new staff so there is definitely going to be an increased level of competitiveness in this edition with the prize being the World Cup qualification, said Benade.\n\nThis years Rugby Africa Cup comes with an automatic ticket to the 2027 Rugby World Cup, and Benade has all that in mind.\n\nThe target is to take it game by game and hopefully we do enough to really challenge each opponent.\n\nWhile the vision is there for qualification to the global showpiece, we need to take a number of steps and overcome tough opponents to get there, he added.\n\nZimbabwe last qualified for the Rugby World Cup in 1991, and hopes are high that the current crop of players can break the jinx.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/29051559/Sables-7.png",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s rugby team coach Piet Benade believes that this year’s Rugby Africa Cup will be more challenging as his side defends its title. The Rugby Africa Cup kicked off Tuesday at Nelson Mandela Stadium in Uganda with defending champions Zimbabwe opening its campaign against North African side Morocco. Although Benade boasts of continuity as he has managed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-coach-predicts-competitive-rugby-africa-cup-as-zimbabwe-eyes-title-defense/\">Sables coach predicts competitive Rugby Africa Cup, as Zimbabwe eyes title defense</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Jul 2025"
        },
        {
            "title": "Harare City Council fights court order to fix Mbare flats, sparking residents’ fury",
            "url": "https://www.newzimbabwe.com/harare-city-council-fights-court-order-to-fix-mbare-flats-sparking-residents-fury/",
            "content": "By Darlington Gatsi\n\nHARARE City Council is seeking the reversal of a High Court judgment that ordered the municipality to renovate the Mbare flats, a move that has riled the capitals residents.\n\nHarare City Council has filed an application appealing Justice Priscilla Munangati-Manongwas judgment, which compelled it to improve the living standards of Mbare residents.\n\nJustice Munangati-Manongwa ordered the City Council to exercise its mandate by renovating the Matapi, Matererini, Nenyere, and Mbare flats, which are in a state of disrepair.\n\nHCC is challenging this judgment, and the matter has been set for 18 July before Justice Manyangadze.\n\nThe Combined Harare Residents Association (CHRA), cited as the first respondent, has lashed out at the City Councils latest move, accusing it of abdicating its responsibility as the landlord of the Mbare flats.\n\nThe City of Harare has sparked outrage after launching an appeal to reverse a High Court judgment (HCH4825/24) compelling it to rehabilitate Mbare Flats and provide residents with basic water, sanitation, and hygiene services.\n\nThe court order was issued following a successful legal challenge led by the Combined Harare Residents Association (CHRA), which took the City of Harare to court over its failure to uphold residents constitutional right to safe and adequate housing, said CHRA in a statement.\n\nMbare flats have, in recent times, become hotbeds of disease and bedbugs, attributed to the unsanitary conditions. The hostels are characterised by raw sewage and a lack of water, amid a ballooning number of residents.\n\nCHRA said the situation is likely to worsen, with HCC failing to take responsibility for renovating the flats.\n\nThe court had ruled that the city must take immediate action to restore dignity and protect public health by upgrading the dilapidated and unsanitary Mbare hostels, which have long suffered from broken sewer systems, water shortages, and unsafe living conditions.\n\nNow, instead of complying with the judgment, the City of Harare is fighting to reverse the ruling, raising alarm bells among housing rights advocates and public health experts. This move threatens to deepen the housing and hygiene crisis already faced by thousands of Mbare residents, many of whom live in overcrowded, hazardous environments, said CHRA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04110814/mbare-3-e1667562235561.png",
            "description": "<p>By Darlington Gatsi HARARE City Council is seeking the reversal of a High Court judgment that ordered the municipality to renovate the Mbare flats, a move that has riled the capital’s residents. Harare City Council has filed an application appealing Justice Priscilla Munangati-Manongwa’s judgment, which compelled it to improve the living standards of Mbare residents.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-fights-court-order-to-fix-mbare-flats-sparking-residents-fury/\">Harare City Council fights court order to fix Mbare flats, sparking residents’ fury</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Jul 2025"
        },
        {
            "title": "Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures",
            "url": "https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/",
            "content": "By Business Report\n\nAn uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities.\n\nHippo Valley, Tongaat Huletts Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this monthalthough the gross profit for the year to end March rose 2% to$66.87m.\n\nAnother Zimbabwean consumer company, Star Africa Corporation that also trades in sugar, however, raised revenues by 22% over the same period.\n\nNonetheless, analysts at IH Securities on Friday said in the securities and advisory firms latest research note on Zimbabwes consumer sector that they anticipate an uplift to volumes for consumer-facing companies this year owing to a likely recovery in consumer spend.\n\nHowever, this was against the backdrop of general cost structures continuing to be on the rise corresponding to a volatile policy environment and the crystallization of costs in United States dollars.\n\nOn the demand side, private consumption growth, which had slowed down from 4.8% in 2023 to 2.5% in 2024, is expected to have a rosier year with household spending rebounding by 6.6% in 2025, said the report.\n\nAfter an improved rainy season and prices for minerals such as gold firming up, Zimbabwean consumer firms are well placed for stronger consumer spending.\n\nCompanies expected to benefit from this include beer and soft drinks manufacturer, Delta Corporation, which has cited stiffer competition in some beverage categories.\n\nZimbabwean consumer discretionary spend however remains subdued, with data from Zimstats recently showing average earnings of 55% of the employed population at less than $100.\n\nMoreover, Zimbabwean companies have to absorb some of the legislation-linked costs of production, such as sugar taxes and fast-food taxes, to support volumes.\n\nIH Securities is thus skewed towards consumer-facing stocks thatexhibit the ability to generate a significant portion of revenue in US dollar, have good management practices, and are also consistent in paying dividends.\n\nCompanies offering defensive staples such as National Foods  in which Tiger Brands has an interest  were displaying volume growth, said the analysts.National Foods maize division recordeda significant volume growth of 58% in May over the comparative nine-month period, largely attributable to the market dynamics.\n\nDairy company, Dairibord, saw consolidated volume growth of 14% for itsfirst quarter ended 31 March 2025.\n\nOn the retail front, the past two years have been challenging for formal operators on account of several issues. As per leading retailers, a key impediment to viability has been S.I 81A of 2024, an exchange control act that mandated the selling of goods and services at the official exchange rate, noted the report.\n\nIt further though stated that Zimbabwesoperating environment for companiesremained challenging overall, citing key issues such as elevated production costs as well as sporadic operating liquidity squeezes in light of the tightening of monetary conditions.\n\nIt mentioned emerging cost pressures including the governments recent increase of 19.1% to the diesel levy as further worsening costs for companies.\n\nHeadwinds in Zimbabwe had already affected Hippo Valley, which has had to rightsize its workforce with 1 000 workers expected to be let go by August.\n\nOK Zimbabwe, another prominent retailer battling headwinds, is now undertaking a $30m rights issue to stabilize the company. The retailer has also announced further closures of stores, pointing to a 2025 year that remains volatile and fragile, but with a possibility of better performances by consumer companies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>By Business Report An uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities. Hippo Valley, Tongaat Hulett’s Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this month although the gross profit for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/\">Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "08 Jul 2025"
        }
    ]
}