{
    "news": [
        {
            "title": "Robert Mugabe Jnr issued with arrest warrant",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand.\n\nHarare magistrate Lisa Mutendereki issued the warrant after Mugabes name was called three times with no response.\n\nMugabe who is out on bail, was arrested last month for unlawful possession of dagga. He was nabbed during a police traffic blitz after driving against a one-way street along Second Street Extension in Harare.\n\nProsecutors allege police recovered two sachets of dagga, a pack of rizla, and a dagga crusher from his sling bag. The drugs, weighing two grams and valued at US$30, were verified at Harare Main Post.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand. Harare magistrate Lisa Mutendereki issued the warrant after Mugabe’s name was called three times with no response. Mugabe who is out on bail,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/\">Robert Mugabe Jnr issued with arrest warrant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        },
        {
            "title": "Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nA GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora.\n\nMwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling partys controversial resolution to extend President Emmerson Mnangagwas tenure to 2030 or beyond.\n\nIn a statement, the opposition party saidthe attackers armed with guns were donning Zanu PF regalia.\n\nMwonzora had made a brief stop at the MDC Bulawayo Provincial Office to address party members and journalists on Zanu PFs Agenda 2030.\n\nYesterday a group of Zanu PF vigilantes calling themselves Boys  dzaMudhara disrupted a peaceful meeting of the MDC in Bulawayo. We shall never bow down to thuggery. Our fight against desecration of our constitution and the 2030 agenda will be intensified.pic.twitter.com/yHJnTicoqS\n\n Sen Douglas Mwonzora (@DMwonzora)November 6, 2025\n\nTrouble reportedly started after Mwonzora finished addressing journalists.\n\nSoon after the members of the Press left, members of the police mainly from PISI and CID and youths wearing Zanu PF regalia entered the office from the back door, numbering about 20, armed with guns and knives and started dismissing people as they advanced towards the MDC leader threateningly.\n\nThey were chanting 2030 ino budirira chete (The 2030 agenda will succeed), said the opposition.\n\nA stampede then followed as members of the security whisked away the president (Mwonzora).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter A GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora. Mwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling party’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/\">Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        },
        {
            "title": "German nurse gets life in jail after murdering 10 to reduce workload",
            "url": "https://www.newzimbabwe.com/german-nurse-gets-life-in-jail-after-murdering-10-to-reduce-workload/",
            "content": "BBC\n\nA palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others.\n\nProsecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to ease his workload during shifts overnight.\n\nThe offences were committed between December 2023 and May 2024 in a hospital in Wuerselen, in western Germany.\n\nInvestigators are reported to be looking into several other suspicious cases during his career.\n\nAccording to media outlet Agence France-Presse (AFP), the unnamed man had been employed at the hospital in Wuerselen since 2020, after completing training as a nursing professional in 2007.\n\nProsecutors told a court in Aachen that he showed irritation and a lack of empathy to patients who required a higher level of care, and accused him of playing master of life and death.\n\nThe court was told that he injected patients with large doses of morphine and midazolam, a type of sedative, in an effort to reduce his workload during night shifts.\n\nHe was arrested in 2024.\n\nWhen issuing the life sentence, the court said that the mans crimes carried a particular severity of guilt which should bar him from early release after 15 years.\n\nHe will be able to appeal the verdict.\n\nProsecutors have told AFP that exhumations are taking place to identify further potential victims, which could see the man put on trial again.\n\nThe case bears similarityto that of former nurse Niels Hgel, who was handed a life sentence in 2019 after he was convicted of murdering 85 patients at two hospitals in northern Germany.\n\nA court found that he administered lethal doses of heart medication to people in his care between 1999 and 2005.\n\nHe is believed to be the most prolific killer in Germanys modern history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06105744/morphine-injection.webp",
            "description": "<p>BBC A palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others. Prosecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/german-nurse-gets-life-in-jail-after-murdering-10-to-reduce-workload/\">German nurse gets life in jail after murdering 10 to reduce workload</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        },
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        },
        {
            "title": "Man (22) jailed for raping 93-year-old woman",
            "url": "https://www.newzimbabwe.com/man-22-jailed-for-raping-93-year-old-woman/",
            "content": "By Staff Reporter\n\nA GWANDA man has been sentenced to 20 years imprisonment for raping a 93-year-old womanfrom his village in Esigodini.\n\nThe offender, aged 22 this week, appeared before the Gwanda Magistrates Court, where he was convicted.\n\nThe State case was that on July 6, 2025, during the night and in the Esibomvu area of Esigodini, the offender broke down the door to the victims bedroom to gain entry.\n\nWhile inside, he pulled the victim from her bed, undressed and raped her.\n\nIt was heard in court that during the same night, the offender committed another crime of unlawful entry and theft, which prompted villagers to trace his footprints, leading to his arrest, which then linked him to the rape.\n\nThe National Prosecuting Authority of Zimbabwe (NPAZ) noted that the appalling act was intolerable, considering that elderly persons are vulnerable members of society who deserve the protection of communities.\n\nMeanwhile, the Bulawayo Magistrates Court has slapped a 40-year-old man from Tsholotsho with 20 years imprisonment after he was convicted of two counts of rape perpetrated on his biological daughter, aged 19.\n\nThe offences occurred between June 2022 and August 2025 on two separate locations in Tsholotsho, where the offender would force himself on the victim. She later filed a police report leading to the offenders arrest.\n\nThe court imposed 20 years imprisonment for each count, to run concurrently.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06063336/Gwanda-court_magistrate.jpg",
            "description": "<p>By Staff Reporter A GWANDA man has been sentenced to 20 years’ imprisonment for raping a 93-year-old woman from his village in Esigodini. The offender, aged 22 this week, appeared before the Gwanda Magistrates Court, where he was convicted. The State case was that on July 6, 2025, during the night and in the Esibomvu area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-22-jailed-for-raping-93-year-old-woman/\">Man (22) jailed for raping 93-year-old woman</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        },
        {
            "title": "ZWG to strengthen further in fourth quarter of 2025 – Finance Minister",
            "url": "https://www.newzimbabwe.com/zwg-to-strengthen-further-in-fourth-quarter-of-2025-finance-minister/",
            "content": "By Alois Vinga\n\nFINANCE Minister, Mthuli Ncube, says the local ZWG currency is set to strengthen further in the Fourth Quarter of the year as demand rises for periodical tax settlements.\n\nSince last year, the central bank has implemented a restrictive monetary policy aimed at anchoring price, currency, and exchange rate stability. The approach involves maintaining a high bank policy rate, currently at 35%,to curb speculative borrowing, which has been a major driver of excess liquidity and illicit parallel market activity.\n\nTo this end, the exchange rate premium has remained stable for a period in excess of one year, which has seen annual inflation receding by more than 50% to 32,7%.\n\nSpeaking to parliamentarians in Bulawayo Wednesday, Ncube said the local unit is poised to strengthen further as the year comes to an end.\n\nFourth quarter taxes are expected to increase demand for ZiG, and the appreciation of the exchange rate. In the outlook, exchange rate stability is envisaged, underpinned by the broad acceptance of the ZiG and the continued implementation of prudent fiscal and monetary policies by the Government, Ncube said.\n\nHe attributed the obtaining stability, which has seen the exchange rate maintaining a premium of US$1: ZWG 26.68 to the aggressive policies employed to ring fence the currency.\n\nThe parallel market exchange rate premium has remained stable, falling to below 25% in August 2025, aligning with other countries, including Kenya and Zambia, he said.\n\nNcube said the strategy for accelerated building of foreign currency reserves is bearing fruit following the introduction of the ZiG, which has seen total foreign currency reserves increasing from below US$300 million in April 2024 to over US$900 million by September 2025, targeting US$1 billion by December 2025.\n\nZimbabwe is accumulating both gold and USD reserves which are expected to fully cover both ZiG reserve money and deposits.\n\nAdded Ncube, Inflation is projected to average 61.3% in 2025, end the year at 22.8%, and decline to single-digit levels by 2027, supported by continued exchange rate stability and prudent fiscal and monetary policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>By Alois Vinga FINANCE Minister, Mthuli Ncube, says the local ZWG currency is set to strengthen further in the Fourth Quarter of the year as demand rises for periodical tax settlements. Since last year, the central bank has implemented a restrictive monetary policy aimed at anchoring price, currency, and exchange rate stability. The approach involves</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-to-strengthen-further-in-fourth-quarter-of-2025-finance-minister/\">ZWG to strengthen further in fourth quarter of 2025 – Finance Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        },
        {
            "title": "Glenview residents protest removal of borehole serving thousands of people",
            "url": "https://www.newzimbabwe.com/glenview-residents-protest-removal-of-borehole-serving-thousands-of-people/",
            "content": "By Thandiwe Garusa\n\nResidents of Glenview, one of Harares cholera hotspots, have petitioned Mayor Jacob Mafume to stop the planned demolition of a public borehole that serves more than 2,800 people.\n\nThe move follows a 48-hour removal notice issued by the City of Harare, ordering the clearing of the borehole site to pave way for four residential infill stands. The council cited illegal occupation under municipal by-laws.\n\nThe borehole, drilled in 2019 under the Presidential Borehole Scheme, remains the communitys main source of clean water in an area already suffering from severe shortages. No alternative water source has been proposed to replace it.\n\nIn a petition signed by 280 residents and submitted to the mayor on Wednesday, the community urged council to form a special committee to investigate the land allocations and assess how many boreholes would be affected by the planned housing development.\n\nThe Petitioner beseeches the Harare City Council to establish a Special Committee pursuant to Section 100 of the Urban Councils Act (Chapter 29:15), conduct an investigation into the allocation of infill residential stands in Glen View, determine the number of boreholes that will be affected, and provide recommendations to mitigate the water supply issues that may arise from the removal of the boreholes, the petition reads in part.\n\nResidents warned that demolishing the borehole without providing an alternative water source would violate their constitutional right to water and risk triggering another public health crisis in the cholera-prone suburb.\n\nThey also questioned how stands approved in 2024 could overlap with a borehole installed in 2018 and upgraded in 2025, describing the sequence as evidence of poor planning and possible corruption.\n\nAdding to their frustration, residents said individuals allocated the contested stands have already begun bringing building materials to the site, despite the ongoing dispute.\n\nThe petitioners further demanded that the City of Harare convene a public meeting to release documents showing whether the land was properly allocated before the borehole was drilled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/23184817/Highfields-residents-queuing-for-water-at-a-borehole-in-Highfields-as-the-water-crisis-worsens-in-the-country.jpg",
            "description": "<p>By Thandiwe Garusa Residents of Glenview, one of Harare’s cholera hotspots, have petitioned Mayor Jacob Mafume to stop the planned demolition of a public borehole that serves more than 2,800 people. The move follows a 48-hour removal notice issued by the City of Harare, ordering the clearing of the borehole site to pave way for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/glenview-residents-protest-removal-of-borehole-serving-thousands-of-people/\">Glenview residents protest removal of borehole serving thousands of people</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:32",
            "date": "06 Nov 2025"
        }
    ]
}