{
    "news": [
        {
            "title": "CZI tips businesses to align prices with deflationary trends",
            "url": "https://www.newzimbabwe.com/czi-tips-businesses-to-align-prices-with-deflationary-trends/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) has urged businesses to adapt to the emerging reality of sustained inflation decline and adjust their prices in line with the current deflationary trends.\n\nZimbabwes annual inflation, measured in the Zimbabwe Gold (ZiG) currency, fell sharply to 32.7% in October from 82.7% in September 2025, with analysts projecting a further drop to between 15% and 20% by December 2025.\n\nQuoting Ben Bernanke, former Chair of the U.S. Federal Reserve, CZI noted that deflationary patterns are not artificially induced but stem from underlying economic realities.\n\nThe sources of deflation are not a mystery. Deflation is in almost all cases a side effect of a collapse of aggregate demand a drop in spending so severe that producers must cut prices on an ongoing basis in order to find buyers, the industry lobby group said in its report.\n\nCZI highlighted that ZiG month-on-month inflation has been on a downward trajectory for three consecutive months, dropping to -0.4% in October 2025 from -0.2% in September 2025, the lowest inflation rate recorded so far this year.\n\nHowever, the organisation cautioned that local traders may remain hesitant to reduce prices due to historical fears of economic volatility. It warned that price stickiness, the resistance of market prices to decrease despite changes in the broader economy, could negatively impact market efficiency if left unchecked.\n\nDeflation, the CZI explained, means that goods and services are becoming cheaper in ZiG terms, which benefits consumers in the short term by increasing their purchasing power.\n\nIt also means that consumers who kept ZiG balances in their bank accounts are now able to purchase slightly more goods than what they could have bought in August 2025. If this momentum is maintained, it could significantly enhance confidence in the ZiG, said the CZI.\n\nThe industry body added that the steep fall in inflation largely reflects the fading effects of the September 2024 devaluation, which had sharply driven up the Consumer Price Index (CPI). With month-on-month inflation now well contained, CZI expects further easing in the coming months.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) has urged businesses to adapt to the emerging reality of sustained inflation decline and adjust their prices in line with the current deflationary trends. Zimbabwe’s annual inflation, measured in the Zimbabwe Gold (ZiG) currency, fell sharply to 32.7% in October from 82.7% in September 2025, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-tips-businesses-to-align-prices-with-deflationary-trends/\">CZI tips businesses to align prices with deflationary trends</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        },
        {
            "title": "South Africa outscore Zimbabwe in final, earn spot in WBSC U-23 Baseball World Cup 2026",
            "url": "https://www.newzimbabwe.com/south-africa-outscore-zimbabwe-in-final-earn-spot-in-wbsc-u-23-baseball-world-cup-2026/",
            "content": "The winners dominated the two-way round-robin against Zimbabwe and Benin and outscored Zimbabwe in the African Championship Game, becoming the 11th team to earn a spot in the WBSC U-23 Baseball World Cup 2026. Australia and Guam will compete for the 12th and final spot.\n\nWorld No. 26 South Africa defeated No. 77 Zimbabwe in the final, 21-1, to win the U-23 African Championship on home soil at the Boksburg Cardinals facility in Gauteng and claim Africas spot in theWBSC U-23 Baseball World Cup 2026.\n\nSouth Africa dominated the three-team and two-way round-robin, completing their campaign undefeated. Zimbabwe won their two games against Benin, one of the most recent baseball programmes to develop on the continent.\n\nIt is encouraging to see South Africa working alongside our international counterparts to further the development of baseball across Africa, commented South Africa Baseball Union President Marc Moreay. The WBSC Africa Championships have once again demonstrated the value of cooperation in advancing the sport on the continent.\n\nDAY 1\n\nZimbabwe-Benin 12-4South Africa-Benin 24-0 (5 innings)\n\nDAY 2\n\nSouth Africa-Zimbabwe 15-1South Africa-Benin 23-1\n\nDAY 3\n\nZimbabwe-Benin 12-5South Africa-Zimbabwe 19-4\n\nNicaragua will host the VI WBSC U-23 Baseball World Cup fromNovember 6 to 15, 2026. The WBSC U-23 Baseball World Cup is an evolution of the U-21 Baseball World Cup, hosted by the Chinese Taipei Baseball Association (CTBA) in 2014 in Taichung.\n\nThe Local Organising Committee has proposed three venues  Soberana National Stadium in Managua, the brand-new Roberto Clemente Stadium in Masaya, and Rigoberto Lpez Prez Stadium in Len  to host the tournament. The venues will be confirmed at a later stage.\n\nTen other teams have already qualified.\n\nNo. 16 Nicaragua have earned an automatic berth as the host nation.\n\nNo. 17 Great Britain and No. 15 Czechia secured Europes two tickets by finishing first and second, respectively, at theEuropean Championshipheld in Czechia this past August.\n\nNo. 1 Japan, No. 2 Chinese Taipei and No. 4 Korea qualified through theXXXI BFA Asian Championshipin September.\n\nIn October,No. 8 Panama, No. 7 Puerto Rico and No. 9 Cubaearned three of the four WBSC Americas spots in the North, Central America and Caribbean Qualifier, and World No. 5 Venezuela won theWBSC Americas Qualifier for the South America regionheld in Lima, Peru.\n\nThe winner of the WBSC Oceania Qualifier, a best-of-five series between Australia and Guam scheduled from November 6 to 9 at the Blacktown International Sportspark near Sydney, will complete the set of 12 participants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04030016/zim-SA-baseball.jpg",
            "description": "<p>WBSC The winners dominated the two-way round-robin against Zimbabwe and Benin and outscored Zimbabwe in the African Championship Game, becoming the 11th team to earn a spot in the WBSC U-23 Baseball World Cup 2026. Australia and Guam will compete for the 12th and final spot. World No. 26 South Africa defeated No. 77 Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-outscore-zimbabwe-in-final-earn-spot-in-wbsc-u-23-baseball-world-cup-2026/\">South Africa outscore Zimbabwe in final, earn spot in WBSC U-23 Baseball World Cup 2026</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        },
        {
            "title": "UN says 90% of cases in journalists’ murder cases go unresolved",
            "url": "https://www.newzimbabwe.com/un-says-90-of-cases-in-journalists-murder-cases-go-unresolved/",
            "content": "By Alois Vinga\n\nTHE UN High Commissioner for Human Rights, Volker Trk, says that worldwide 90% of cases involving the murder of journalists have gone unresolved amid calls for member states to put in place watertight measures to protect media practitioners.\n\nWhile Zimbabwe has recorded improvements in recent years, as shown by the countrys leap ten places up the Reporters Without Borders 2024 World Press Freedom Index, local journalists still face different types of persecution, including arbitrary arrests, harassment and intimidation prompted by a blend of a hostile legal framework.\n\nJournalists Blessed Mhlanga and Faith Zaba, both from Alpha Media Holdings (AMH), were recently arrested and detained in 2025 on charges of transmitting data messages inciting violence and undermining the authority of or insulting the President, respectively.\n\nAnother UNESCO 2025 report revealed that 63% of women journalists in Zimbabwe have experienced technology-facilitated gender-based violence (TFGBV), including hate speech and cyber harassment, contributing to self-censorship.\n\nOver the past decade, more than one thousand journalists have been killed, in both peacetime and war. In Gaza alone, my Office has documented the killing of 252 journalists since 7 October 2023. And in nearly nine out of ten cases, those who kill journalists around the world have not been brought to justice. This culture of impunity fuels further attacks and undermines freedom of expression, civic space, and ultimately, peace, Trk said.\n\nThe UN High Commissioner made the remarks in a video message to mark the International Day to End Impunity for Crimes against Journalists, which is commemorated annually on November 2.\n\nHe said journalists who expose injustice and give voice to the voiceless are human rights defenders, yet, across the globe, governments, corporations and criminals threaten, harass and detain them as well as subjecting them to arbitrary detention, to transnational repression, and even murder.\n\nThe UN official said the emergence of new journalisms have been weaponised to amplify abuse, distort reality, and intensify harm including deepfake sexual images, AI-generated defamatory content, and the amplification of misogynistic hate speech through algorithmic tools and bots.\n\nWomen journalists are targeted not only for their reporting, but also because of their gender. They face harassment, sexual violence, and coordinated online attacks designed to silence their voices and strengthen patriarchal norms. Nearly three in four women journalists report that they have been subjected to online violence. This may lead them to self-censor, to leave their jobs, or to live in fear, said Trk.\n\nThe UN official said his office is working to address these challenges by monitoring, documenting and reporting violations against journalists, including online, and advocating with States and technology companies guided by the dimensions of GBV online.\n\nStates have a legal obligation to prevent, investigate, and punish all attacks against journalists  including those that take place online. Technology companies also have responsibilities to respect human rights and to pursue accountability for people who use their platforms and products to perpetrate abuses.\n\nTo end impunity for crimes against journalists, we need stronger, more determined political will, better legal frameworks, and accountability mechanisms that respond to todays digital world, added Trk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04022728/Volker-Turk.jpg",
            "description": "<p>By Alois Vinga THE UN High Commissioner for Human Rights, Volker Türk, says that worldwide 90% of cases involving the murder of journalists have gone unresolved amid calls for member states to put in place watertight measures to protect media practitioners. While Zimbabwe has recorded improvements in recent years, as shown by the country’s leap</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-says-90-of-cases-in-journalists-murder-cases-go-unresolved/\">UN says 90% of cases in journalists’ murder cases go unresolved</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        },
        {
            "title": "Chiwenga rips into Tanzania’s post-election violence – describes it as disturbing, days after Mnangagwa salutes ‘visionary’ Samia Hassan",
            "url": "https://www.newzimbabwe.com/chiwenga-rips-into-tanzanias-post-election-violence-describes-it-as-disturbing-days-after-mnangagwa-salutes-visionary-samia-hassan/",
            "content": "By Leopold Munhende\n\nVICE President Constantino Chiwenga has described fatal post-election violence that gripped Tanzania recently as disturbing and something that has to be avoided at all costs.\n\nChiwenga, who spoke after attending the inauguration of Chama Cha Mapinduzis (CCM) Samia Suluhu Hassan, fell short of dismissing the election, rather choosing to encourage reconciliation and urging that violence be avoided in future.\n\nAccording to opposition party, CHADEMA, over 800 Tanzanians were killed in a heavy clampdown by state security agencies that sought to ensure Hassans second term against competition.\n\nCHADEMA, Tanzanias main opposition party, protesting her election and the Independent National Electoral Commissions (INEC) handling of the poll, was barred from contesting after it refused to sign an electoral code of conduct in April this year.\n\nInternet was shut down on election day, transport operators stopped and tens of thousands arrested despite state communication indicating that 87% of registered Tanzanians turned out for what the SADC also said was an election that fell short of SADC requirements and expectations.\n\nSchools were also shut as state security cautioned unrest could continue for weeks, according to reports.\n\nInternet connection for ordinary Tanzanians was only restored on Monday afternoon in the East African country, with prices of basic necessities ballooning.\n\nImages of Hassans victims were pasted online with battered backs, open sores from beatings and some dead bodies.\n\nDespite the queries, Hassan claimed a 97.66% win.\n\nWhat has happened in Tanzania is quite disturbing and something that has got to be avoided at all costs, said Chiwenga, who was in Tanzania representing President Emmerson Mnangagwa.\n\nI believe Tanzania has come of age and is the mother of all liberation movements. When we fought for our independence, we were all based in Tanzania, so to us it is something we would not want to see.\n\nI am quite convinced that they will be able to sit down, iron out their differences and move forward.\n\nChiwengas statement came barely a day after Mnangagwa showered praises on Samia in a congratulatory message posted on his social media platforms.\n\nExpressing his heartfelt congratulations, Mnangagwa described Hassan as a visionary whose victory reflected the trust and confidence Tanzanians had in her.\n\nAnalysts have likened Hassans electoral triumph to late President Robert Mugabes 2008 run-off election, where he did not have any contender after overseeing the bludgeoning of opposition supporters, ordinary villagers and other sections of the Zimbabwean population, Zanu PF suspected to have voted for late democracy icon Morgan Tsvangirai in the initial race.\n\nHassan used a familiar method of banning opposition rallies and detaining opposition figures, such as her rival Tundu Lissu, who is currently facing treason charges.\n\nHer inauguration was a stark contrast to her first, when she took over from late President John Magufuli or her second after winning her first term.\n\nThe event was held in military barracks, under tight security, with none of the usual pomp and fanfare from members of the public, as they were barred.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/30052903/Chiwenga-680x380-1.webp",
            "description": "<p>By Leopold Munhende VICE President Constantino Chiwenga has described fatal post-election violence that gripped Tanzania recently as disturbing and something that has to be avoided at all costs. Chiwenga, who spoke after attending the inauguration of Chama Cha Mapinduzi’s (CCM) Samia Suluhu Hassan, fell short of dismissing the election, rather choosing to encourage reconciliation and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chiwenga-rips-into-tanzanias-post-election-violence-describes-it-as-disturbing-days-after-mnangagwa-salutes-visionary-samia-hassan/\">Chiwenga rips into Tanzania’s post-election violence – describes it as disturbing, days after Mnangagwa salutes ‘visionary’ Samia Hassan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        },
        {
            "title": "Seventh suspect arrested over businessman Mutangadura’s murder",
            "url": "https://www.newzimbabwe.com/seventh-suspect-arrested-over-businessman-mutangaduras-murder/",
            "content": "By Staff Reporter\n\nPOLICE have confirmed the arrest of a seventh suspect over the cold-blooded killing of prominent Ruwa businessman Joseph Mutangadura.\n\nThe businessman was shot dead in August at his farmhouse by seven assailants, six of whom have since been accounted for.\n\nThe seventh suspect was identified as Webster Nhau (57) of Ruwa.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the arrest this Monday.\n\nThe ZRP confirms the arrest of Webster Nhau (51) in connection with robbery and murder of a businessperson Joseph Mutangadura (67) on August 17, 2025 at Mutangadura Hideout Farm, Ruwa, said Nyathi.\n\nThe suspect was arrested near his residence along Dustan Road, Ruwa on November 2, 2025. The police has arrested seven suspects in connection with the case.\n\nIn recent weeks, police nabbed Given Mandizadza (34), Phillip Mutasa (38) and Anesu Machadu (32) over the alleged murder and the trio has since appeared in court.\n\nAnother fugitive suspect, Vengesai Jabulani Mutasa (41), was captured in dramatic fashion after he shot dead a police officer in Sanyati, Mashonaland West province.\n\nLast week, police arrested Tariro Mutsamanye (34) and Dexter Mugaro (31) in connection with Mutangaduras murder that shook the nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Staff Reporter POLICE have confirmed the arrest of a seventh suspect over the cold-blooded killing of prominent Ruwa businessman Joseph Mutangadura. The businessman was shot dead in August at his farmhouse by seven assailants, six of whom have since been accounted for. The seventh suspect was identified as Webster Nhau (57) of Ruwa. Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seventh-suspect-arrested-over-businessman-mutangaduras-murder/\">Seventh suspect arrested over businessman Mutangadura’s murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        },
        {
            "title": "Zambezi River Authority allocates 30 billion cubic metres of water for 2026 power generation",
            "url": "https://www.newzimbabwe.com/zambezi-river-authority-allocates-30-billion-cubic-metres-of-water-for-2026-power-generation/",
            "content": "Mwebantu\n\nTHEZambezi River Authority has allocated a total of 30 billion cubic metres (BCM) of water for power generation at Lake Kariba for the year 2026.\n\nThis allocation will be equally shared between Zesco Limited of Zambia and the Zimbabwe Power Company (ZPC), with each utility utilising 15 BCM of water.\n\nIn a statement, Authority acting chief executive officer Christopher Chisense said the allocation is based on the normal to above-normal rainfall forecast for the 2025/2026 rainy season, as projected by the Southern Africa Climate Outlook Forum (SARCOF-31) and further downscaled by the Meteorological Agencies of Zambia and Zimbabwe.\n\nMr Chisense clarified that while the Authority allocates water for power generation, it does not generate electricity or manage load distribution.\n\nActual power generation outcomes will be communicated by the respective utilitiesZesco Limited in Zambia and the Zimbabwe Power Company (ZPC) in Zimbabwe, he said.\n\nHe further said the Authority will continue to maintain vigilant monitoring of rainfall, inflows, and lake levels through its hydrometric network, which includes 13 monitoring stations across the Kariba catchment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/04140213/Kariba-Dam.jpeg",
            "description": "<p>Mwebantu THE Zambezi River Authority has allocated a total of 30 billion cubic metres (BCM) of water for power generation at Lake Kariba for the year 2026. This allocation will be equally shared between Zesco Limited of Zambia and the Zimbabwe Power Company (ZPC), with each utility utilising 15 BCM of water. In a statement, Authority</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambezi-river-authority-allocates-30-billion-cubic-metres-of-water-for-2026-power-generation/\">Zambezi River Authority allocates 30 billion cubic metres of water for 2026 power generation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        },
        {
            "title": "Chivayo gifts Scotland FC US$250,000 for winning 2025 PSL title",
            "url": "https://www.newzimbabwe.com/chivayo-gifts-scotland-fc-us250000-for-winning-2025-psl-title/",
            "content": "By Sports Reporter\n\nControversial businessman Wicknell Chivhayo has gifted US$250,000 to 2025 Castle Lager Premier Soccer League champions Scottland FC.\n\nThis comes a day after the team sealed its 2025 league championship with a 5-1 win against relegated side Kwekwe United.\n\nIn recognition of this massive history-breaking achievement, and for your exemplary leadership and passion for the game of football.\n\nI invite the team captain and the team manager to come and see me personally on Saturday to collect USD250,000 as a small token of my appreciation and to share it with the entire team, the coach and the technical staff, wrote Chivayo.\n\nScotland FC became the second club since Black Rhinos in 1984 to win a PSL league title in its debut season.\n\nMabviravira sealed its title with two games to spare, so its remaining two league fixtures against Green Fuel and Tel One will be dead rubbers.\n\nScottland FCs coronation will be held at Ascot Stadium on the last matchday when they face Tel One.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04024655/chivayo-scot.jpeg",
            "description": "<p>By Sports Reporter Controversial businessman Wicknell Chivhayo has gifted US$250,000 to 2025 Castle Lager Premier Soccer League champions Scottland FC. This comes a day after the team sealed its 2025 league championship with a 5-1 win against relegated side Kwekwe United. “In recognition of this massive history-breaking achievement, and for your exemplary leadership and passion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivayo-gifts-scotland-fc-us250000-for-winning-2025-psl-title/\">Chivayo gifts Scotland FC US$250,000 for winning 2025 PSL title</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Nov 2025"
        }
    ]
}