{
    "news": [
        {
            "title": "Harare man jailed for selling chocolates laced with drugs",
            "url": "https://www.newzimbabwe.com/harare-man-jailed-for-selling-chocolates-laced-with-drugs/",
            "content": "By Staff Reporter\n\nA HARARE man has been slapped with a three-month jail term for selling chocolateslaced with dangerous drugs, known in street lingo as ganja chocolates.\n\nNorman Churume (36) of Mufakose, Harare appeared before the Harare Magistrates Court, where he was sentenced to three months imprisonment following his conviction for unlawful possession and distribution of dangerous drugs.\n\nProsecutors proved that on January 16, 2025, detectives from the Criminal Investigations Department (CID) Drugs and Narcotics raided Chirumes house following a tip-off that he was manufacturing and selling dagga-laced chocolates.\n\nAccused person targeted youths in the community to take up his products.\n\nPolice searched Chirumes residence, leading to the recovery of 270 prepared ganga chocolates, 75 nuggets in brown trays, chocolate bars, aluminium foils, trays and loose dagga. The total street value of the sweets was Zig$ 5,175, and preliminary tests confirmed the presence of tetrahydrocannabinol (THC) in the chocolates.\n\nAll recovered items were sent to the Forensic Laboratory and were presented in court as evidence.\n\nThe National Prosecuting Authority (NPA) warned members of the public against producing and selling drug-laced edibles, especially those targeting youths.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23203047/ganja-chocolate.webp",
            "description": "<p>By Staff Reporter A HARARE man has been slapped with a three-month jail term for selling chocolates laced with dangerous drugs, known in street lingo as “ganja chocolates.” Norman Churume (36) of Mufakose, Harare appeared before the Harare Magistrates Court, where he was sentenced to three months’ imprisonment following his conviction for unlawful possession and distribution</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-man-jailed-for-selling-chocolates-laced-with-drugs/\">Harare man jailed for selling chocolates laced with drugs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Zim Diaspora Property Showcase: Broadhaven offers ‘Build Now, Pay Later’ facility to US-Canada diasporas",
            "url": "https://www.newzimbabwe.com/zim-diaspora-property-showcase-broadhaven-offers-build-now-pay-later-facility-to-us-canada-diasporas/",
            "content": "By Alois Vinga\n\nFAST-rising technology construction firm, Broadhaven Construction Pvt Ltd says Zimbabweans living in the US and Canada should embrace the flexible Build Now, Pay Later facility as a swift path towards property ownership.\n\nThe Build Now, Pay Later is offered by Borrowdale Valley Estate, a flagship project developed by Broadhaven.\n\nSpeaking to NewZimbabwe.com ahead of theZim Diaspora Property Showcasescheduled to take place in Dallas-Fort Worth, Texas, at The Westin Hotel from April 25 to 27, Broadhaven CEO Munyaradzi Majoni implored the market to seize the opportunity.\n\nOne of our flagship developments, Borrowdale Valley Estate, features our innovative Build Now, Pay Later model. This unique approach allows individuals to build and move into their homes before paying for the land itself. Our aim is to make home-ownership more accessible by providing a faster, more efficient, seamless, and dignified way for people to build, he said.\n\nMajoni said Broadhaven is engaged in several significant projects across Zimbabwe, one being the large-scale public sector housing project, which involves the construction of 130 blocks, totalling 1,560 three-bedroom flats in Dzivarasekwa, Harare and Bulawayo.\n\nThe project utilises modern concrete modular building techniques for efficient and scalable development.\n\nWe are also developing an affordable resort, designed to offer a tranquil retreat for individuals and families, as well as serve as an outdoor venue for events. In addition, were working on a private university development aimed at elevating Zimbabwes educational sector to compete with the worlds top institutions, with support from both public and philanthropic sectors, said Majoni.\n\nBroadhaven is also developing several residential clusters in and around Harare to meet the growing demand for quality housing in urban centres.\n\nOver the years, the company has delivered many projects across Zimbabwe in its capacity as a ZBCA Group A company, and the quality and expertise behind the construction projects are evident. One of Broadhavens flagship projects is the superstructure of AfreximBank African Trade Centre in Harare, showcasing the high level of excellence brought to every project.\n\nFurthermore, our strong partnerships in renewable energy and water technology underscore our commitment to sustainable development.\n\nWith a comprehensive inventory of equipment and a proven track record in securing financing, we manage diverse building and infrastructure projects seamlessly, both locally and internationally. We have attracted top-tier professionals back to Zimbabwe, and we are proud of the exceptional team weve built, added Majoni.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23094321/1000078303.jpg",
            "description": "<p>By Alois Vinga FAST-rising technology construction firm, Broadhaven Construction Pvt Ltd says Zimbabweans living in the US and Canada should embrace the flexible ‘Build Now, Pay Later’ facility as a swift path towards property ownership. The ‘Build Now, Pay Later’ is offered by Borrowdale Valley Estate, a flagship project developed by Broadhaven. Speaking to NewZimbabwe.com</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-diaspora-property-showcase-broadhaven-offers-build-now-pay-later-facility-to-us-canada-diasporas/\">Zim Diaspora Property Showcase: Broadhaven offers ‘Build Now, Pay Later’ facility to US-Canada diasporas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "ZRU president threatens Lady Sables with ban for raising complaints over paltry allowances after a week of national duty",
            "url": "https://www.newzimbabwe.com/zru-president-threatens-lady-sables-with-ban-for-raising-complaints-over-paltry-allowances-after-a-week-of-national-duty/",
            "content": "By Sports Reporter\n\nZimbabwe senior womens rugby team players are disgruntled after receiving meagre allowances from the Zimbabwe Rugby Union after their Rugby Africa Womens Cup Division One tournament in Ivory Coast, which lasted a week and ended on Saturday.\n\nLady Sables arrived back in Zimbabwe on Monday, receiving US$150 allowance per player as remuneration for their efforts.\n\nOther than giving the team meagre allowances, Zimbabwe Rugby Union asked all the players to return the national teams tracksuits they were wearing.\n\nWe were told by president Losson Mtongwiza that playing for the national team is more of volunteering, so we should not expect any money from the union; rather, we are lucky to be getting US$150 allowances.\n\nSo they forced us to surrender the tracksuitsin orderto get the US$150 allowances, so one was forced to surrender the kit first before being given the money.\n\nThe union then threatened us not to post on social media, saying that this would drive away sponsors, and they even said that those who would not cooperate would be banned from playing rugby, one of the players told New Zimbabwe.com.\n\nShe added, We had to pay US$35 each for the national green blazers.\n\nAt first, we were told our money would be compensated, but that never happened.\n\nLady Sabless troubles started before they left for the Ivory Coast. New Zimbabwe.com has it on good authority that the newly appointed coach, Nsikelelo Sibanda did not travel with the team to Ivory Coast because they could not meet his required allowances.\n\nThe team had to be led by assistant coach Takudzwa Ngirazi during their campaign.\n\nEfforts to get a comment from Zimbabwe Rugby Union were fruitless.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/26074443/Losson-Pic2-1-696x1149-1-e1724150059820.jpg",
            "description": "<p>By Sports Reporter Zimbabwe senior women’s rugby team players are disgruntled after receiving meagre allowances from the Zimbabwe Rugby Union after their Rugby Africa Women’s Cup Division One tournament in Ivory Coast, which lasted a week and ended on Saturday. Lady Sables arrived back in Zimbabwe on  Monday, receiving US$150 allowance per player as remuneration</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zru-president-threatens-lady-sables-with-ban-for-raising-complaints-over-paltry-allowances-after-a-week-of-national-duty/\">ZRU president threatens Lady Sables with ban for raising complaints over paltry allowances after a week of national duty </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Fast spins and first wins: two ways 1win Redefines the player journey",
            "url": "https://www.newzimbabwe.com/fast-spins-and-first-wins-two-ways-1win-redefines-the-player-journey/",
            "content": "In the digital casino space, attention spans are short and decisions are instant  which is exactly why 1win continues to introduce game formats and systems that cater to the pace of modern life. One such standout is the Lightning Roulette experience, where every spin is electrified with speed, high-stakes multipliers, and the kind of rapid gameplay that appeals to thrill-seekers who value adrenaline over waiting.\n\nBut while speed hooks the experienced player, newcomers to 1win are greeted with something entirely different: the power of starting smart. The first deposit bonus isnt just a welcome gift  its an opportunity to shape your early gameplay with maximum value. For those who understand how to unlock and manage their bonus correctly, that first deposit becomes more than a transaction. It becomes a strategic move.\n\nThese two contrasting dynamics  lightning-fast roulette and methodical bonus building  reveal how1win-casino.rwcaters to both ends of the player spectrum: the ones who rush into action and the ones who plan before they play. And somewhere between the spin and the strategy is where most players find their sweet spot.\n\nIn this article, well explore the popularity of lightning-speed roulette formats and break down the math behind first-time deposit bonuses on 1win  giving both new and experienced players a deeper look into what makes the platform pulse with energy and opportunity.\n\nAmong the many live games on 1win, one format continues to captivate players who crave urgency and excitement: Lightning Roulette. Its not just a faster version of the classic table  its a reimagining of how chance and choice can collide in seconds. With electrified multipliers, high-speed spins, and dramatic visuals, Lightning Roulette has become a go-to for players who want maximum impact in minimal time.\n\nBut the games appeal isnt only in its pace  its in its psychology. Unlike traditional roulette, where players may bet methodically and watch the wheel at a relaxed rhythm, Lightning Roulette creates a heightened state of focus, where every moment counts. The presence of randomized multipliers (ranging from 50x to 500x) on select numbers amplifies both the risk and the reward, turning a simple bet into a potential jackpot with every spin.\n\nSo why are so many players leaning into this high-volatility experience on 1win? Lets break it down:\n\nLightning Roulette on 1win proves that not all games need to be slow and strategic to be thrilling. For many, the allure lies in speed, stakes, and sensation  the chance to light up the screen with one well-timed bet.\n\nIn a world where attention is currency, Lightning Roulette delivers fast-paced entertainment that keeps players coming back  not just for the wins, but for the rush of the moment itself.\n\nFor new players joining 1win, the first deposit is more than just a step into the platform  its the beginning of a smarter, more strategic journey. The welcome bonus isnt just there to make you feel good about signing up; its a tool designed to amplify your balance, stretch your bets, and give you the breathing room to explore without immediate pressure. But to truly get the most out of it, you need to understand how it works  and how to make the math work for you.\n\nHeres how a beginner can maximize their first deposit bonus on 1win, not by luck  but through smart preparation and realistic expectations:\n\nYour first deposit sets the tone for your 1win experience. Use it as a launchpad, not a lottery ticket  and youll not only stretch your bankroll but build a foundation for future play with confidence, control, and a clear plan.\n\nSpeed and strategy may seem like opposites in the world of online gaming, but 1win proves they can coexist  and even complement each other. Whether youre diving into the electrifying intensity of Lightning Roulette or carefully planning your way through your first deposit bonus, each path offers a unique experience tailored to different kinds of players.\n\nLightning Roulette is about living in the moment, riding the energy of quick decisions and amplified rewards. It captures the spirit of those who thrive on instinct, pace, and unpredictability. Meanwhile, making the most of your welcome bonus is about playing the long game  understanding mechanics, managing risk, and using every opportunity to extend and enrich your journey on the platform.\n\nUltimately, 1win is not about choosing one style over the other. Its about knowing when to accelerate and when to slow down, when to chase multipliers and when to calculate your next move. Because the real win isnt just in a lucky spin or a boosted balance  its in finding a rhythm that works for you.\n\nAnd once you do, every spin, bet, and bonus becomes part of something bigger: a game youre not just playing, but mastering on your terms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23093657/Screenshot-2025-04-23-at-10.36.32.png",
            "description": "<p>In the digital casino space, attention spans are short and decisions are instant — which is exactly why 1win continues to introduce game formats and systems that cater to the pace of modern life. One such standout is the Lightning Roulette experience, where every spin is electrified with speed, high-stakes multipliers, and the kind of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fast-spins-and-first-wins-two-ways-1win-redefines-the-player-journey/\">Fast spins and first wins: two ways 1win Redefines the player journey</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Chances, choices, and real-time thrills: inside the mind and mood of 1win bet",
            "url": "https://www.newzimbabwe.com/chances-choices-and-real-time-thrills-inside-the-mind-and-mood-of-1win-bet/",
            "content": "In the heart of every game on 1win bet, two forces are always at play  probability and emotion. On one side, you have the cold, calculated logic of numbers: odds, percentages, and patterns. On the other, the rush of adrenaline, the instinct to double down, the feeling that your next spin could be the one. And somewhere in between? The player, caught in a dance between strategy and spontaneity.\n\nMore and more users are beginning to ask: Can math help me win? Can understanding probability truly give you an edge  or does luck always have the final say? These questions arent just philosophical. For many, they shape the way they play on 1win bet, especially in games like roulette, blackjack, and crash formats where timing and odds play a major role.\n\nAt the same time, the rise of live casino games on1win betis changing how players experience digital gambling. Its no longer just about spinning reels or tapping buttons. With real dealers, real tables, and real-time interaction, the line between online and offline gaming is quickly disappearing  offering a deeply immersive alternative to the traditional casino floor.\n\nIn this article, well explore two powerful aspects of the 1win bet experience: how probability theory fits into modern gameplay, and why live casino formats are becoming the go-to choice for those who want the feel of a real casino  without ever leaving home.\n\nAt first glance, the world of online gaming may seem like pure chaos  flashing reels, unpredictable crashes, cards flipped in the blink of an eye. But beneath the vibrant surface of 1win bet, theres a deeper structure in play: one governed not by instinct, but by mathematics. Specifically, the logic of probability quietly influences every decision, every outcome, and every chance a player takes  whether they realize it or not.\n\nMost casual players rely on feeling. A streak of red on the roulette table? Bet black next. Lost three slots in a row? The next one must hit. But these are illusions  products of a mental trap called the gamblers fallacy. In reality, games like roulette, blackjack, crash, or even slots follow rules that are statistically predictable, even if their outcomes remain random. The secret? Understanding those rules not to control the game, but to control yourself within it.\n\nLets take a closer look at how probability theory applies to different game types on 1win bet  and how knowledge of odds, frequency, and expected value can empower players to play with more clarity and less chaos:\n\nWhile its true that no algorithm can guarantee a win, the role of probability is undeniable  and underutilized. On 1win bet, players who take time to understand the math behind the entertainment begin to see patterns, trends, and smarter paths through the randomness. They stop betting based on what feels right, and start betting with intent.\n\nThat doesnt mean removing the fun. In fact, understanding probability makes the experience richer. You no longer fear a loss  you expect it occasionally  and that expectation sharpens your focus, steadies your play, and stretches your balance further.\n\nSo, can math truly beat emotion on 1win bet? Not always. But it can guide it, and in a world where one decision can change your session, that guidance might just be the most powerful bet you place.\n\nThere was a time when the only way to experience the elegance of a roulette table, the rhythm of cards in a blackjack game, or the thrill of interacting with a real dealer was by walking into a traditional casino. But with the rise of live casino technology on 1win bet, that boundary has blurred  and for many players, the screen has become just as immersive as the showroom.\n\n1wins live casino isnt a simulation  its a real-time broadcast, streamed from professional studios with real dealers, real equipment, and real outcomes. Every move you see is happening live, and every bet you place becomes part of a global moment shared with thousands of other players. The charm of eye contact with a dealer, the anticipation of the spin, the pulse of real-time chat  it all creates a sense of presence that rivals, and in some ways surpasses, the physical casino experience.\n\nHeres how 1wins live casino brings the real thing closer than ever before:\n\nWith all of this combined, 1wins live casino doesnt just copy the offline experience  it evolves it. It blends the intimacy of real human connection with the accessibility and convenience of digital play.\n\nWhether youre betting from your living room or a caf, that moment when the dealer spins the wheel, looks into the camera, and wishes you good luck  it feels real because it is. On 1win, the casino isnt somewhere you go. Its something you bring to life, anytime you want.\n\nAs weve explored, the world of 1win bet is not just about chasing wins  its about understanding the forces that shape how we play, and how we feel while playing. From the structured mindset of probability-based betting to the immersive warmth of live dealer experiences, the platform brings together science and sensation in a way few others do.\n\nMathematics may not guarantee victories, but it offers clarity. Knowing the odds, understanding return-to-player rates, and practicing self-control are not constraints  theyre tools for longevity and smarter decision-making. For players who crave more than just luck, probability is not a barrier to fun  its a bridge to better play.\n\nAt the same time, the rise of 1wins live casino offerings proves that connection still matters. In a digital world, real-time dealers, authentic environments, and human interaction restore the emotional core of gaming. Its not just about numbers or cards  its about presence, attention, and energy.\n\nSo whether youre calculating your next move or enjoying the charm of a live roulette table, 1win bet reminds us that the future of online gaming lies not in choosing between brains and thrill  but in blending both. Strategy and experience. Precision and pleasure. One spin, one moment, one decision at a time.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23093418/Screenshot-2025-04-23-at-10.32.40.png",
            "description": "<p>In the heart of every game on 1win bet, two forces are always at play — probability and emotion. On one side, you have the cold, calculated logic of numbers: odds, percentages, and patterns. On the other, the rush of adrenaline, the instinct to double down, the feeling that your next spin could be the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chances-choices-and-real-time-thrills-inside-the-mind-and-mood-of-1win-bet/\">Chances, choices, and real-time thrills: inside the mind and mood of 1win bet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Behind the screen & beyond the spin: exploring value and reality on 1win",
            "url": "https://www.newzimbabwe.com/behind-the-screen-beyond-the-spin-exploring-value-and-reality-on-1win/",
            "content": "In the digital era of gaming, 1win offers far more than just flashy slots or spinning wheels. Its created a dynamic system where even virtual bonuses hold real-world value  especially in places like Rwanda, where mobile gaming is on the rise. What used to be just fun coins now act as a bridge between casual play and actual earnings, turning entertainment into a subtle but effective form of micro-economy.\n\nAt the same time, one of the most immersive parts of the 1win experience  live dealer games  often feels like a world of its own. While players are focused on the cards or the wheel, few stop to ask: Who are these dealers? Where are these games actually filmed? Behind the polished presentation lies a carefully crafted system of real people, real studios, and complex technology that blends human interaction with seamless betting.\n\nThis blend of real stakes and real presence is part of what makes1winso engaging. Its not just a gaming platform  its an experience where your bonus balance might unlock a cashout, and the person dealing your cards is part of a professionally choreographed production broadcast across continents.\n\nIn this article, well explore two sides of 1wins unique appeal: how bonus coins are becoming a new form of digital currency for players in Rwanda, and whats really going on behind the scenes of those smooth, live-dealt games we all know and trust.\n\nFor many casual gamers on 1win Rwanda, bonus coins might seem like small extras  something to collect, spend, or enjoy for entertainment value. But beneath the surface, these seemingly free tokens are part of a smartly designed ecosystem that can translate into real financial value. The idea is simple: reward activity, encourage engagement, and turn loyalty into a currency that pays off.\n\nUnlike traditional points systems that expire or lock users into low-value rewards, 1wins bonus structure is built to be flexible and functional. In Rwanda, where mobile-first play is dominant and budgets matter, these bonuses become an essential part of how users extend gameplay and even cash out real money  without always making deposits.\n\nLets take a closer look at how this unique fun economy works on 1win Rwanda, and how players are turning bonus coins into something far more valuable than digital fluff:\n\nWhat makes this system especially impactful is how accessible and low-risk it is. Players can build their balances slowly, test games safely, and explore more of the platform  all with minimal financial pressure. Over time, a few smart bets using bonus coins can lead to real withdrawals, making every interaction feel rewarding.\n\nIn the 1win Rwanda community, this fan economy isnt just fun  its functional. It transforms casual users into engaged players and proves that with the right approach, even play money can become a smart tool for real gains.\n\nWhen you join a live roulette spin or a round of blackjack on 1win, the experience feels smooth, real, and immediate  as if the dealer is right there with you. But behind that sense of immersion lies an impressive combination of people, technology, and precision. The live casino section isnt just an add-on  its a carefully curated production, powered by skilled professionals working behind the curtain to make every second feel seamless.\n\nFar from being just digital avatars, the live dealers on 1win are trained individuals working in high-tech studios, built to mirror the elegance and energy of real casinos. They dont just deal cards  they maintain the tempo of the game, interact with players in real-time, and create a bridge between human warmth and online efficiency.\n\nHeres whats really happening behind the scenes of the live games you play on 1win:\n\nSo the next time youre watching a roulette ball spin or a blackjack card being dealt on 1win, remember: what youre seeing is more than just a game  its a real performance, powered by professionals and designed to make online gaming feel fully alive.\n\nIts entertainment with a human touch  and its what sets the live experience on 1win apart from any standard digital gameplay.\n\nAs we peel back the layers of 1win Rwanda, it becomes clear that this platform offers much more than just games. It delivers a full ecosystem  where virtual coins can lead to real cash, and where every hand dealt by a live dealer is part of a choreographed experience that blends technology with human interaction.\n\nFor players in Rwanda, this means two things: opportunity and immersion. Through its bonus system, 1win has built a structure where loyalty and participation convert into real rewards  giving casual users a way to play smart and earn without pressure. At the same time, the live casino side offers a uniquely authentic experience, proving that even behind a screen, genuine human presence matters.\n\nWhether youre stacking bonus coins or watching a live spin unfold in real time, youre part of something more dynamic than just a betting site. Youre inside a living, evolving digital world where value and entertainment go hand in hand.\n\nAnd thats the magic of 1win Rwanda  turning every spin, click, and card into a moment that feels real, rewarding, and just a little bit remarkable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23093123/Screenshot-2025-04-23-at-10.27.49.png",
            "description": "<p>In the digital era of gaming, 1win offers far more than just flashy slots or spinning wheels. It’s created a dynamic system where even virtual bonuses hold real-world value — especially in places like Rwanda, where mobile gaming is on the rise. What used to be just “fun coins” now act as a bridge between</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/behind-the-screen-beyond-the-spin-exploring-value-and-reality-on-1win/\">Behind the screen & beyond the spin: exploring value and reality on 1win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "‘Were they just voting on vibes?’: Oscars’ new compulsory viewing rule sparks backlash",
            "url": "https://www.newzimbabwe.com/were-they-just-voting-on-vibes-oscars-new-compulsory-viewing-rule-sparks-backlash/",
            "content": "The Guardian\n\nA new rule introduced by the Academy of Motion Picture Arts and Sciences to ensure voters have seen all the films in a category before they cast their ballots has provoked disquiet online, with many expressing surprise it wasnt already a requirement.\n\nA raft of measures were announced by theOscarsgoverning body on Monday, including the stipulation that Academy members must now watch all nominated films in each category to be eligible to vote in the final round for the Oscars.\n\nAbsolutely insane this wasnt already a thing, wrote one person on X, a sentiment echoed by many others, who questioned the validity of previous Academy decisions and theorised about the reasons key titles had been celebrated  or snubbed.\n\nYoure telling me all this time people could just watch one movie and be like yeah that should win all the awards, said another, with one X commentator asking: Were they just voting on vibes?\n\nTHEY WERENT DOING THAT BEFORE?, wrote one user, adding: This explains why movies like The Color Purple, Whats Love Got to Do With It, and Malcolm X were snubbed. These voters were NOT watching black films?\n\nAnonymous Oscar voters have previously admitted to not watching all the contenders in a category before voting in the final round.\n\nIm bummed because I havent seen The Substance or Im Still Here yet, one toldEntertainment Weeklyahead of the most recent ceremony. The first Dune, I couldnt get through; Im not rushing for another three hours of Dune. Theres still time to re-evaluate, but I really struggled.\n\nIn this event, voters are expected to abstain in that category, however there is no enforcement for this, and category error and ignorance can persist.\n\nOther leaked ballots earlier this year suggested a widespread misapprehension among voters that Conclaves Ralph Fiennes had already won an Oscar in 1994 for Schindlers List. In fact he has never won, and this year lost out to Adrien Brody for The Brutalist.\n\nOther changes to the awards included an update to the international feature film category, to include film-makers with refugee or asylum status, and the clarification that the use of generative AI in a film would neither help nor harm their submission.\n\nTwo of this years key nominees  The Brutalist and Emilia Prez  were involved in minor controversies over their use of AI to enhance the voices of their leading actors.\n\nMondays statement also provided further details on how the inaugural casting prize will be decided  the equivalent award was first introduced at theBaftasin 2020.\n\nCompulsory viewing was enforced by the British Academy as part of its radical overhaul of rules and regulations that same year, in response to the #BaftasSoWhite controversy.\n\nStringent regulations are in force to ensure not only that voters view all the films in the categories for which they cast their ballot, but also that they watch 15 randomised movies participating in the first stage of voting. As with the strict gender quotas in force on the director longlist, and the inclusivity criteria necessary for inclusion in a number of key categories such as outstanding British film, this measure is to try to promote a more diverse spread of contenders.\n\nSpeaking to theGuardian in 2018, ahead of her Oscar win for The Favourite,Olivia Colmansaid that she would always abstain from voting should she not have seen all films in consideration.\n\nThe alternative, she said, feels so naughty. I think maybe Im just really square. Colman went on to attribute her response to the fate of Paddy Considines 2011 filmTyrannosaur, in which she starred, and which was ignored by Bafta in its best film nominations: Very few people watched it and it broke my heart a bit.\n\nPreliminary voting for next yearsOscarsbegins in December, with the nominations announcement on 22 January ahead of the 15 March ceremony  an unusually long campaigning period. This years emcee, Conan OBrien, will return as host.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23064633/Screenshot-2025-04-23-at-07.44.26.png",
            "description": "<p>The Guardian A new rule introduced by the Academy of Motion Picture Arts and Sciences to ensure voters have seen all the films in a category before they cast their ballots has provoked disquiet online, with many expressing surprise it wasn’t already a requirement. A raft of measures were announced by the Oscars governing body on Monday,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/were-they-just-voting-on-vibes-oscars-new-compulsory-viewing-rule-sparks-backlash/\">‘Were they just voting on vibes?’: Oscars’ new compulsory viewing rule sparks backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Ghana president suspends chief justice in unprecedented move",
            "url": "https://www.newzimbabwe.com/ghana-president-suspends-chief-justice-in-unprecedented-move/",
            "content": "BBC\n\nGhanaian President John Mahama has suspended the countrys Supreme Court chief justice  a move that marks a first in the countrys history.\n\nAn investigation has been launched and three undisclosed petitions have been filed making allegations against Gertrude Torkornoo, calling for her permanent removal.\n\nChief justices in Ghana enjoy security of tenure  meaning they can only be removed from office on a few grounds, which include incompetence and misbehaviour.\n\nThe content of the petitions has not been made public and she is yet to comment, while Ghanas former attorney general has claimed her suspension is an attempt to undermine the judiciary.\n\nI think it is a complete charade, Godfred Yeboah Dame told the BBC.\n\nIts the biggest assault on the [judiciary] in the nations history, the greatest assault on the independence of the judiciary under the constitutional dispensation of this country.\n\nMs Torkornoo is Ghanas third female chief justice and was nominated in 2023 by former president Nana Akufo-Addo.\n\nIt is her responsibility to oversee the administration of justice in Ghana.\n\nAccording to news agency Reuters, Ms Torkornoo survived a removal request earlier this year when former President Akufo-Addo said a petition to have her dismissed had several deficiencies.\n\nCopies of the three recently filed petitions against Ms Torkornoo were not initially made available to her.\n\nBut some lawyers argued that withholding the documents was a violation of Ms Torkornoos right to a fair hearing.\n\nCopies of the petition were subsequently made available to the chief justice, allowing her to respond to the allegations privately and in writing.\n\nMs Torkornoo will be invited by the five-member committee to respond again to the petitions before a final decision is reached as to whether she should be removed from office or not.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23062631/torkornoo-ghana.webp",
            "description": "<p>BBC Ghanaian President John Mahama has suspended the country’s Supreme Court chief justice – a move that marks a first in the country’s history. An investigation has been launched and three undisclosed petitions have been filed making allegations against Gertrude Torkornoo, calling for her permanent removal. Chief justices in Ghana enjoy security of tenure –</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ghana-president-suspends-chief-justice-in-unprecedented-move/\">Ghana president suspends chief justice in unprecedented move</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "Easter and Independence holiday road traffic accidents up by 34% – police",
            "url": "https://www.newzimbabwe.com/easter-and-independence-holiday-road-traffic-accidents-up-by-34-police/",
            "content": "By Costa Nkomo\n\nThe Zimbabwe Republic Police (ZRP) has reported a concerning increase of 34 percent in the number of accidents that occurred over the Easter and Independence holidays this year, compared to the same period in 2024.\n\nWhile the police noted that the number of fatalities during the 2025 Easter holidays fell slightly from 25 to 21 compared to the previous year, the number of injured persons actually rose, from 159 recorded last year to 178 this year.\n\nIn a statement released on Tuesday, national police spokesperson Commissioner Paul Nyathi said that both the number of accidents and the number of people injured were up on last years figures for the same period.\n\nOn Easter and Independence Holidays, a total of 384 road traffic accidents were recorded compared to 286 recorded during the same period last year.\n\nThe number of fatal road traffic accidents and people killed decreased from 27 to 24 and the number of fatal accidents decreased from 26 to 21. The number of people injured went up from 159 to 178, Nyathi said.\n\nHe highlighted the most serious accident, which occurred in Norton on 21 April 2025 which claimed four (4) lives.\n\nOne of the road traffic accidents recorded during the 2025 Easter and Independence Holidays includes the accident which occurred at the 51km peg along Harare Bulawayo Road on the 21st of April at around 1200hrs, where four people were killed, while 14 others were injured when a Toyota Hiace kombi which had 18 passengers on board, veered off the road and overturned.\n\nAs a result, three (3) passengers died on the spot and one (1) died upon admission at Norton Hospital.\n\nNyathi also drew attention to the tragic consequences of hit-and-run accidents, where motorists failed to stop at the scene.\n\nDuring the period, three (3) hit-and-run fatal accidents were recorded in Murewa and Harare. The first accident occurred on the 19th of April 2025, at the 57km peg along the Mutoko Chidye dust road, when an unknown motorcyclist hit a pedestrian and sped off. The victim died upon admission at Mutoko Hospital. The second accident occurred on the 20th of April 2025 along Harare-Bulawayo Road at Tynwald flyover when an unknown male adult was hit by an identified vehicle and died on the spot.\n\nOn the same date, another accident occurred along Harare- Bulawayo Road, near Puma Service Station in Whitehouse, where a 66-year-old man was hit by a Nissan Caravan vehicle. The victim died upon admission at Parirenyatwa Group Hospital, and the driver of the vehicle did not stop after the accident, Nyathi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18062359/IMG-20250417-WA0074.jpg",
            "description": "<p>By Costa Nkomo The Zimbabwe Republic Police (ZRP) has reported a concerning increase of 34 percent in the number of accidents that occurred over the Easter and Independence holidays this year, compared to the same period in 2024. While the police noted that the number of fatalities during the 2025 Easter holidays fell slightly from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/easter-and-independence-holiday-road-traffic-accidents-up-by-34-police/\">Easter and Independence holiday road traffic accidents up by 34% – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        },
        {
            "title": "We cannot stay home when we have to put food on the table –  Zimbabweans ignore calls for a stay away, cite tough economy",
            "url": "https://www.newzimbabwe.com/we-cannot-stay-home-when-we-have-to-put-food-on-the-table-zimbabweans-ignore-calls-for-a-stay-away-cite-tough-economy/",
            "content": "By Darlington Gatsi\n\nSCEPTICISM is growing towards war veteran Blessed Bombshell Gezas strategy to nullify a ZANU PF clique pushing for the extension of President Emmerson Mnangagwas rule beyond the stipulated two terms.\n\nGeza, who has positioned himself as a champion of constitutionalism by challenging the extension of President Mnangagwas rule, now faces doubts over his ambitious plan.\n\nThe firebrand war veteran has called for stay-aways as a sign of protest against Mnangagwas rule but has twice received a tepid response from the public.\n\nGezas call for indefinite protests flopped Tuesday, with the countrys major cities bustling with activity.\n\nHarare resident Daniel Mateta told NewZimbabwe.com that the stay-away puts ordinary citizens in a difficult position, forcing them to choose between survival and the change Geza is advocating for.\n\nComing to work today is a result of poverty. Someone telling us to stay awayI find it meaningless. I have to solve my problem by coming to work. I dont even know this Geza, said Mateta.\n\nGeza is banking on the support of citizens frustrated by the ailing economy, which has left the majority on the brink of formal unemployment.\n\nHowever, with most people engaged in informal employment, Gezas proposed strategy has fallen on deaf ears as citizens prioritise making a living over protesting against the government.\n\nRobert Moyo, who operates a grinding mill in Mbare, said that while there is an appetite for change, earning a living takes precedence over anti-Mnangagwa protests.\n\nWe are being squeezed from both sides. The economy is tough, which makes it hard for me to stay at home. I want economic change, but its difficult to choose which side to take. You cant stay at home because I have to put food on the table in the evening, which requires me to be at work during the day, said Moyo.\n\nMoyos sentiments are shared by many Zimbabweans who are frustrated by the countrys economic and political situation.\n\nThe ruling party, ZANU-PF, has been accused of entrenching corruption, with elites benefiting at the expense of the poor, who bear the brunt of the failing economy.\n\nThe countrys opposition is also in disarray, leaving citizens without a strong alternative voice or representation.\n\nDespite boasting military backing, Gezas plan risks fizzling out, with citizens taking it with a pinch of salt.\n\nIn 2017, President Mnangagwawith the armys support and street proteststoppled long-time leader Robert Mugabe, a playbook Geza is attempting to replicate.\n\nPolitical analyst Lazarus Sauti said that while Geza has silenced voices supporting President Mnangagwas term extension, he must reconsider his modus operandi.\n\nGeza is riding on the general consensus of Zimbabweans, especially regarding presidential term limits. Zimbabweans are against that. However, stay-aways in an informal economy like Zimbabwes are not sustainable.\n\nHe should change his tack if he is to silence the ED 2030 discourse. Credit to himGeza has managed to frighten the bootlickers who were singing the 2030 chorus, said Sauti.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/22155536/Shutdown-flops-5.png",
            "description": "<p>By Darlington Gatsi SCEPTICISM is growing towards war veteran Blessed “Bombshell” Geza’s strategy to nullify a ZANU PF clique pushing for the extension of President Emmerson Mnangagwa’s rule beyond the stipulated two terms. Geza, who has positioned himself as a champion of constitutionalism by challenging the extension of President Mnangagwa’s rule, now faces doubts over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-cannot-stay-home-when-we-have-to-put-food-on-the-table-zimbabweans-ignore-calls-for-a-stay-away-cite-tough-economy/\">We cannot stay home when we have to put food on the table –  Zimbabweans ignore calls for a stay away, cite tough economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "23 Apr 2025"
        }
    ]
}