{
    "news": [
        {
            "title": "Police officer arrested for receiving US$40 bribe",
            "url": "https://www.newzimbabwe.com/police-officer-arrested-for-receiving-us40-bribe/",
            "content": "By Staff Reporter\n\nA POLICE officer stationed at Zengeza, Harare, landed in the dock after allegedly receiving a US$40 bribe to release a theft suspect.\n\nEdson Nangwani was caught red handed with trap money after he was reported to the Police Anti-Corruption Unit (PACU).\n\nNangwani appeared before a Chitungwiza magistrate charged with criminal abuse of office and extortion. He was granted US$100 bail.\n\nHe is expected back in court in two weeks time when he is expected to be furnished with a trial date.\n\nAllegations are that on June 7, 2025, a suspect, Tatenda Tichareva was arrested for allegedly possessing a stolen Samsung Galaxy A04E.\n\nThat same day, the suspects friend, Vincent Joni approached the investigating officer (the accused) to seek clarity on the case.\n\nInstead of offering a professional explanation, the accused demanded US$200 in exchange for the suspects release and for the matter to be shelved, said the State.\n\nThe friend reported the bribe demand to the CID Police Anti-Corruption Unit (PACU), triggering a carefully coordinated trap operation.\n\nOn the 9th of June 2025, a team of PACU detectives accompanied the friend to ZRP Zengeza, where the accused contacted the suspects friend and directed him to Office G13, and later to Office G16 for the transaction.\n\nThe court heard, under surveillance, the friend handed over US$40 in marked trap money:1 x US$20 (Serial: PH50115833C) 2 x US$10 (Serials: PK45658296B & PB36416637E) the accused received the cash inside Office G16, unaware he was being watched by detectives.\n\nMoments later, Nangwani was caught red-handed with the trap money in his left hand and immediately arrested.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/02234101/handcuffs.jpg",
            "description": "<p>By Staff Reporter A POLICE officer stationed at Zengeza, Harare, landed in the dock after allegedly receiving a US$40 bribe to release a theft suspect. Edson Nangwani was caught red handed with trap money after he was reported to the Police Anti-Corruption Unit (PACU). Nangwani appeared before a Chitungwiza magistrate charged with criminal abuse of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-arrested-for-receiving-us40-bribe/\">Police officer arrested for receiving US$40 bribe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        },
        {
            "title": "Chivhayo gifts Highlanders with US$250,000 sponsorship",
            "url": "https://www.newzimbabwe.com/chivhayo-gifts-highlanders-with-us250000-sponsorship/",
            "content": "By Sports Reporter\n\nCONTROVERSIAL businessman Wicknell Chivhayo has donated US$250,000 to Zimbabwe football giants Highlanders.\n\nChivhayo announced this on his social media handles this Wednesday.\n\nIn recognition of my beloved uncles last wishes and my personal love for the game of football, it is my greatest pleasure to avail sponsorship worth US$250,000 in cash to Highlanders FC, as my small token to assist the club in its various administrative requirements, read part of Chivhayos post.\n\nChivhayos sponsorship to Bosso comes a few months after he settled the clubs US$26,500 debt to former coach Baltermir Britto, hence bailing out the club from a FIFA ban.\n\nThe flamboyant businessman added that the sponsorship is part of US$1 million package which he will further disburse next year.\n\nThis is just but part of a broader sponsorship package of US$1 million that will run over the next year to help the club to secure new talent and cover player sign-on fees in order to foster a more competitive 2025 Premier Soccer League, further read his post.\n\nBosso had a poor 2025 pre-season preparations due to lack of finances. The Bulawayo-based side even failed to make meaningful signings of new players after losing key players to better paying clubs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/31043415/Highlanders.png",
            "description": "<p>By Sports Reporter CONTROVERSIAL businessman Wicknell Chivhayo has donated US$250,000 to Zimbabwe football giants Highlanders. Chivhayo announced this on his social media handles this Wednesday. “In recognition of my beloved uncle’s last wishes and my personal love for the game of football, it is my greatest pleasure to avail sponsorship worth US$250,000 in cash to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivhayo-gifts-highlanders-with-us250000-sponsorship/\">Chivhayo gifts Highlanders with US$250,000 sponsorship</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        },
        {
            "title": "‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP",
            "url": "https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/",
            "content": "FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomonas recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid.\n\nGeo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under the then Ministry of Local Government, led by Winston Chitando (now Mines and Mining Minister).\n\nThe company was registered by Mirel Mrtiri, an Albanian businessman linked to corruption in his home country. Its Executive Chairman and CEO, Delish Nguwaya, is a regular attendee at state functions and is known to be a close associate of President Emmerson Mnangagwas son, Sean Mnangagwa.\n\nNguwaya was previously charged with corruption over Covid-19 procurement contracts involving his company, Drax International, in 2020, but was acquitted by court in September 2023.\n\nThey have no legal mandate to independently take over public waste management under our law, Mahere posted on her X account on Wednesday.\n\nMahere, a constitutional lawyer, argued that Geo Pomona should not impose itself on residents, as their obligations lie with the CoH, not individual households.\n\nFormer Mt Pleasant MP Fadzayi Mahere\n\nThey are not a statutory body. At best, if they have a contract with City of Harare, they are the citys agent. This means that the City of Harare is the principal and public facing party with Geo Pomona working under them as an agent. They cannot do their business independently of the city and force themselves onto people with whom they have no legal relationship.\n\nMahere questioned Geo Pomonas authority to bill residents directly, stating that the company lacks the legal basis to do so.\n\nFor the avoidance of doubt, they have no right to bill or otherwise engage residents directly absent a valid agreement with individual residents to do so. Only the City of Harare can do that in line with its powers as a local authority under Zimbabwes local government laws, she said.\n\nGeo Pomona is set to receive over US$162 million from the CoH over five years, with ratepayers ultimately footing the bill.\n\nThe 30-year agreement stipulated that Harare must deliver 550 tonnes of waste, or a minimum of 200,750 tonnes per year, resulting in US$8.03 million for the company in the first year.\n\nThis has opened doors for Geo Pomona to potentially take control of the entire waste management process, from street sweeping and refuse collection to waste disposal thereby billing residents directly.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/09034942/solid-waste.jpg",
            "description": "<p>By Staff Reporter FORMER Mt Pleasant legislator, Fadzayi Mahere has questioned the legitimacy of Geo Pomona’s recent move to assume public waste management responsibilities and directly engage with residents in Harare, describing it as legally invalid. Geo Pomona, whose Netherlands-registered parent company, Geogenix BV, was contracted by the City of Harare (CoH) in 2022 under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geo-pomona-waste-management-role-is-legally-invalid-claims-former-mt-pleasant-mp/\">‘Geo Pomona waste management role is legally invalid’ — claims former Mt Pleasant MP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare’s roads patched with soil as city council fails to procure tar for over a year",
            "url": "https://www.newzimbabwe.com/harares-roads-patched-with-soil-as-city-council-fails-to-procure-tar-for-over-a-year/",
            "content": "By Darlington Gatsi\n\nCITY of Harare (CoH) has been without tar for over a year, with its workers resorting to using soil and rubble to patch roads in the capitalanother sign of deteriorating basic service delivery.\n\nCoH has been struggling to maintain road networks in residential areas, with blame being apportioned to the Zimbabwe National Road Administration (ZINARA) for disbursing insufficient funds to the local authority.\n\nThe majority of roads in Harare are riddled with potholes, with council, on numerous occasions, spotted using soil and rubble to give a semblance of road maintenance.\n\nRecently, during a full council meeting at the Town House, it emerged that CoH has not managed to buy tar, a key component in road construction.\n\nHarare Mayor Jacob Mafume attributed this to the local authoritys garnished accounts, before criticising Town House officials for failing to acquire basic supplies.\n\nRight now, I have messages from every government office in town. When they say the road is bad, people are going to pour dust. Everywhere, dust is being poured. We have money from City Parking and ZINARA that is being garnished in our bank accounts without buying tar.\n\nLook at the embarrassmentthe whole town is dusty. This is because we are patching potholes using dust, said Mafume.\n\nCoH receives remittances from its subsidiary, City Parking, and from ZINARA, which are supposed to be channelled towards road maintenance.\n\nThe citys procurement department has blamed the slow approval of purchases by the Procurement Regulatory Authority of Zimbabwe (PRAZ).\n\nHarare Councillor Denford Ngadziore accused officials of dishonesty, stating that they face no hurdles when purchasing vehicles and other luxury perks.\n\nThe challenge at the city council is that there is a cartel or a system that has to be broken. If we do not do that, we will not succeed.\n\nThe management at one time bought themselves vehicles without any challenges. The challenge is, if we do not break that [system], we will remain in one place, said Ngadziore.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/11130755/potholes-road.jpg",
            "description": "<p>By Darlington Gatsi CITY of Harare (CoH) has been without tar for over a year, with its workers resorting to using soil and rubble to patch roads in the capital—another sign of deteriorating basic service delivery. CoH has been struggling to maintain road networks in residential areas, with blame being apportioned to the Zimbabwe National</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-roads-patched-with-soil-as-city-council-fails-to-procure-tar-for-over-a-year/\">Harare’s roads patched with soil as city council fails to procure tar for over a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        },
        {
            "title": "Fugitive cop who flogged suspect to death arrested, appears in court",
            "url": "https://www.newzimbabwe.com/fugitive-cop-who-flogged-suspect-to-death-arrested-appears-in-court/",
            "content": "By Tapiwa Svondo\n\nA RUWA police officer, Constable Prince Ndavambi (39) has been charged with murder following his arrest, nearly two weeks on the run.\n\nAccused person assaulted Blessed Believe Juruvenge (30) in police custody leading to his death.\n\nNdavambi was a fugitive of the law since May 28, 2025, when the victim was declared dead. He was only arrested on June 10 and appeared in court the day after.\n\nThe murder followed Juruvenges arrest on May 27, 2025, after an altercation with a fellow resident, Mwazha/Maphosa, who reported him for assault and theft. Upon detention, the now deceased was told by Ndavambi that he would return home in a coffin.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said, Ndavambi allegedly tortured the now deceased using a hoe handle before placing him in a cell.\n\nAllegations are that on the 27th of May 2025, the accused arrested a man in connection with assault and theft and took him to ZRP Ruwa. While in custody, it is alleged that the accused assaulted the suspect with a hoe handle before detaining him in the cells.\n\nLater that evening, the suspects condition reportedly deteriorated. He was taken to Ruwa Rehabilitation Clinic, where he died the following day, said NPAZ.\n\nNdavambi was granted US$400 bail and remanded to July 2, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Tapiwa Svondo A RUWA police officer, Constable Prince Ndavambi (39) has been charged with murder following his arrest, nearly two weeks on the run. Accused person assaulted Blessed Believe Juruvenge (30) in police custody leading to his death. Ndavambi was a fugitive of the law since May 28, 2025, when the victim was declared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fugitive-cop-who-flogged-suspect-to-death-arrested-appears-in-court/\">Fugitive cop who flogged suspect to death arrested, appears in court </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        },
        {
            "title": "Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats",
            "url": "https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF partys primary elections.\n\nKaroro spoke following Mutukudzis appearance as a State witness in a case he is facing charges of diverting agricultural inputs.\n\nHe said Mutukudzi and Chikwamba were bitter that they had failed to unseat him in 2015, 2018 and 2023 when he won the election while on remand as a result of the case.\n\nThe primaries sought a candidate from Mbire constituency to represent Zanu PF in Parliamentary elections.\n\nAt the time the allegations arose, Chikwamba was the partys District Coordinating Committee (DCC) Chairperson while Mutukudzi was his deputy.\n\nMutukudzi told the court that he was informed by a certain Zanu PF leader of suspicious trucks, allegedly linked to Karoro, that were loading fertiliser at GMB Mushumbi depot.\n\nHe said he then proceeded, with the blessing of Chikwamba, to file a report with the police. Chikwamba accompanied him.\n\nMutukudzi admitted that he lost thrice to Karoro in the race to represent Mbire in Parliament but said he was not bitter. He said it was just human nature to want to win.\n\nIt is human nature to want to win every election, said Mutukudzi, to which Karoros lawyer Admire Rubaya further asked if he was happy with the defeat.\n\nRubaya questioned why malpractices at GMB would be reported to him if he was neither a government official nor an interested party.\n\nThe matter continues on Friday before Regional Magistrate Marehwanazvo Gofa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF party’s primary elections. Karoro spoke following Mutukudzi’s appearance as a State witness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/\">Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare councillors fight undervaluation of land compensated to Chiyangwa’s Pinnacle Holdings",
            "url": "https://www.newzimbabwe.com/harare-councillors-fight-undervaluation-of-land-compensated-to-chiyangwas-pinnacle-holdings/",
            "content": "By Darlington Gatsi\n\nHARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate land to Pinnacle Holdings as compensation for property acquired by the government.\n\nPinnacle Holdings is owned by businessman Philip Chiyangwa, who is also a ZANU PF member.\n\nThe directive sparked a heated debate in a recent Council meeting, with Ward 16 Denford Ngadziore expressing concern that the council might part with the land at a value lower than its actual price.\n\nThe report is saying US$5 per square metre. So my argument is, in Malbereign and around Harare, we are selling at US$20 per square metre, whilst on the other side, it is going for US$5 per square metre.\n\nWe cannot transfer land whose value we do not know. We are not transferring tomatoes; this is land we are talking about, said Ngadziore.\n\nThe proposed compensation has angered residents, with associations labelling the move as unconstitutional and tantamount to government interference in the affairs of the local authority.\n\nAs a result, residents are calling for the compensation to Pinnacle Holdings to be halted.\n\nSeveral stands have been earmarked for compensation, subject to the Councils approval. However, anomalies have been raised regarding some of the stands.\n\nAdonia Shoko raised a red flag over stands in Kuwadzana, stating that some individuals already hold offer letters for the land.\n\nKudzai Kadzombe also raised a similar concern regarding land identified as part of the compensation to Pinnacle Holdings.\n\nI have a personal interest because, as Councillor of Ward 41, we have already raised this issue. We have a piece of land in Bluffhill which is on that list, but residents had already submitted a petition and begun mobilising to build a council school, said Kadzombe.\n\nThe HCC Finance Committee is set to deliberate on Garwes directive and conduct due diligence on the anomalies raised in the meeting.\n\nHowever, Mafume bluntly told the Council that those aggrieved should consider mounting a legal challenge.\n\nAnyone who feels aggrieved or has their property rights affected by the letter is advised to make a beeline to their lawyers, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/07224513/town-house.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands. The Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-councillors-fight-undervaluation-of-land-compensated-to-chiyangwas-pinnacle-holdings/\">Harare councillors fight undervaluation of land compensated to Chiyangwa’s Pinnacle Holdings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "13 Jun 2025"
        }
    ]
}