{
    "news": [
        {
            "title": "Zimbabwe isn’t yet ready for a sole currency, finance chief says",
            "url": "https://www.newzimbabwe.com/zimbabwe-isnt-yet-ready-for-a-sole-currency-finance-chief-says/",
            "content": "Bloomberg\n\nZimbabwes Finance Minister Mthuli Ncube said the southern African nation needs to regain access to credit lines before it can adopt the ZiG as its sole currency.\n\nWe need a few things in place before the nation can have a mono currency, including making progress on restructuring $21 billion in debt, Ncube said. The nation has been locked out of capital markets since 1999 after defaulting on its debt.\n\nClearing the arrears would allow us to access balance of payments support, in terms of credit lines to support Zimbabwes reserve position, deal with demand by importers and defend the currency, Ncube said.\n\nThe ZiG, short for Zimbabwe Gold, was introduced in April to replace the dollar as the nations main transacting currency, after several previous attempts failed.\n\nThe new currency has faced setbacks including a 43% devaluation in September and calls for it to be abandoned.\n\nTo support the currency the central bank has spent more than $400 million and significantly tightened liquidity.\n\nAn International Monetary Fund team is in the country until February 13 to determine whether to place Zimbabwe on a so-called staff-monitored program, a crucial to for the nation to secure a debt overhaul.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>Bloomberg Zimbabwe’s Finance Minister Mthuli Ncube said the southern African nation needs to regain access to credit lines before it can adopt the ZiG as its sole currency. “We need a few things in place” before the nation can have a mono currency, including making progress on restructuring $21 billion in debt, Ncube said. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-isnt-yet-ready-for-a-sole-currency-finance-chief-says/\">Zimbabwe isn’t yet ready for a sole currency, finance chief says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Kalisto Pasuwa appointed Malawi head coach",
            "url": "https://www.newzimbabwe.com/kalisto-pasuwa-appointed-malawi-head-coach/",
            "content": "By Sport Reporter\n\nCelebrated Zimbabwean football coach Kalisto Pasuwa has been appointed the head coach for Malawis mens football team.\n\nNicknamed Manabundu, Pasuwa has signed a two-year contract which will see him leading The Flames until 2027.\n\nThe former Dynamos coachs substantive appointment comes after he led the side from November last year onaninterim basis.\n\nThe Football Association of Malawi (FAM) has today unveiled former FCB Nyasa Big Bullets Coach Kalisto Pasuwa as the new Malawi Mens Senior National Team Head Coach.\n\nThe Zimbabwean will be in charge of the Flames for two years, the football association said in a statement.\n\nPasuwa enjoyed a huge success as the head coach for Malawi football giants Nyasa Big Bullets.\n\nAt Nyasa, he won four consecutive league titles and several silverware before parting ways with the side in December 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12135744/Kalisto-Pasuwa.webp",
            "description": "<p>By Sport Reporter Celebrated Zimbabwean football coach Kalisto Pasuwa has been appointed the head coach for Malawi’s men’s football team. Nicknamed Manabundu, Pasuwa has signed a two-year contract which will see him leading The Flames until 2027. The former Dynamos coach’s substantive appointment comes after he led the side from November last year on an interim basis.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kalisto-pasuwa-appointed-malawi-head-coach/\">Kalisto Pasuwa appointed Malawi head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zanu PF factional war: Police hunt for Geza; say he faces theft, incitement of public violence, insulting President charges",
            "url": "https://www.newzimbabwe.com/zanu-pf-factional-war-police-hunt-for-geza-say-he-faces-theft-incitement-of-public-violence-insulting-president-charges/",
            "content": "By Costa Nkomo\n\nThe Zimbabwe Republic Police (ZRP) has said it wants to question Blessed Runesu Geza, the outspoken war veteran opposing the 2030 agenda who faces four counts of criminal charges.\n\nThe charges include vehicle theft, undermining President Emmerson Mnangagwa, and inciting public violence.\n\nGeza, known as Bombshell, has been something of a thorn in the Presidents side.\n\nThis development follows a series of press conferences held by Geza and a group of Zanu PF war veterans, where they called for Mnangagwas resignation. They accuse the Zanu-PF leader of overseeing rampant corruption and nepotism, and of plotting to extend his term beyond the constitutionally mandated limit.\n\nGeza also turned his fire on the First Lady, Auxilia Mnangagwa, accusing her of wasting state resources on what he deems unnecessary tours around the country.\n\nConstitutional experts such as Professor Lovemore Madhuku have long maintained that such a term extension is legally impossible.\n\nWhile Mnangagwa himself has publicly pledged to step down at the end of his term in 2028, critics warn that this is simply his modus operandi  giving the impression of heading one way while veering sharply in another.\n\nThey point to his continued silence on the matter, failing to quash those who advocate for a term extension, as further evidence.\n\nMnangagwas term concludes in 2028, yet some of his allies and party members persist in calling for him to remain in power until 2030.\n\nGeza, a Zanu-PF Central Committee member, delivered his most recent press conference on Monday, urging Zimbabweans to prepare for a national shutdown as calls for Mnangagwas resignation grow louder, the tide is turning with the public.\n\nWe implore you to resign peacefully. If you dont resign in peace, people will use the constitution to exercise their right to push you out of office, Geza said.\n\nGeza also warned the police that if they dared to beat or shoot demonstrators protesting against Mnangagwa, the public would hold them accountable in their own neighbourhoods.\n\nIn response, police spokesperson Commissioner Paul Nyathi issued a statement on Wednesday, asserting that Geza faces charges of insulting Mnangagwa and inciting public violence.\n\nTheft allegations as defined in Section 113 of the Criminal Law Codification and Reform Act, Chapter 9: 23. The suspect stole and disposed of three vehicles belonging to a complainant without his consent.\n\nHe is also facing two counts of contravening Section 33 (2) (a) (ii) of the Criminal Law Codification and Reform Act, Chapter 9: 23, Undermining the Authority of or insulting the President,' Nyathis statement reads.\n\nCommissioner Nyathi further stated that Geza had incited the public to commit violence, violating the Criminal Code and Reform Act.\n\nOne count of contravening Section 187 of the Criminal Law Codification and Reform Act, Chapter 9:23, Incitement to commit public violence, Nyathi said.\n\nNyathi also cautioned that anyone found harbouring Geza or assisting him in evading police questioning would be equally liable for arrest and prosecution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12134842/geza.jpg",
            "description": "<p>By Costa Nkomo The Zimbabwe Republic Police (ZRP) has said it wants to question Blessed Runesu Geza, the outspoken war veteran opposing the “2030 agenda”  who faces four counts of criminal charges. The charges include vehicle theft, undermining President Emmerson Mnangagwa, and inciting public violence. Geza, known as Bombshell, has been something of a thorn</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-factional-war-police-hunt-for-geza-say-he-faces-theft-incitement-of-public-violence-insulting-president-charges/\">Zanu PF factional war: Police hunt for Geza; say he faces theft, incitement of public violence, insulting President charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "We will need to be a lot better – Sables Coach on Africa Cup Draw",
            "url": "https://www.newzimbabwe.com/we-will-need-to-be-a-lot-better-sables-coach-on-africa-cup-draw/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade has welcomed the 2025 Africa Cup draw, although he feels there is a need to work hard ahead of the tournament.\n\nThis years Africa Cup will be played from the 20th to the 28th of July in Uganda.\n\nAfter winning the 2024 edition, the Sables will be one of the teams to watch at this years edition.\n\nThis years Rugby Africa Cup will see the winner automatically qualifying for the 2027 Rugby World Cup to be played in Australia.\n\nZimbabwe, Namibia, Ivory Coast, Kenya, Morroco, Senegal, Algeria and Uganda will be battling for the ticket to Australia.\n\nZimbabwe will open its campaign against Morroco before playing the winner between Kenya and Uganda in the semi-finals.\n\nThe Sables, however, avoided tournament favourites Namibia and they will only meet in the final provided both sides make it all the way.\n\nWe knew as top seed we would be playing the side being promoted in the Africa Cup Quarter Final.\n\nThis is sometimes tricky as its a team that has recently been successful and just spent time together preparing for the playoff, said Sables head coach Benade.\n\nIf we get through Morocco we will be up against the winners of Kenya vs Uganda.\n\nSo that will be a massive semi-final considering the match will be in Uganda and even Kenya will enjoy a lot of support.\n\nZimbabwe Rugby Union is already setting sight to the Rugby Africa and NewZimbabwe.com has it on good authority that as part of preparations, two test matches against Zambia and Botswana have been confirmed.\n\nThis will add to the other big fixture against United Arab Emirates which has been scheduled for May 24.\n\nBenade added, I think everyone will be up a few levels and working hard to get their best players onto the field and then getting their preparation right.\n\nWe put in a huge amount of work in last year and got the rewards but we know we will need to be alot better to cope with the new challenges that will be coming our way.\n\nZimbabwe last featured at a rugby World Cup in 1991 and all eyes will be on the current crop of players to break the jinx.\n\nZimbabwe v Morocco\n\nUganda v Kenya\n\nNamibia v Senegal\n\nAlgeria v Cote d Ivoire\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/29051559/Sables-7.png",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s rugby team coach Piet Benade has welcomed the 2025 Africa Cup draw, although he feels there is a need to work hard ahead of the tournament. This year’s Africa Cup will be played from the 20th to the 28th of July in Uganda. After winning the 2024 edition, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-need-to-be-a-lot-better-sables-coach-on-africa-cup-draw/\">We will need to be a lot better – Sables Coach on Africa Cup Draw</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Jub Jub raises hell by exposing infidelity in churches in the new season of ‘Uyajola 9/9’",
            "url": "https://www.newzimbabwe.com/jub-jub-raises-hell-by-exposing-infidelity-in-churches-in-the-new-season-of-uyajola-9-9/",
            "content": "IOL\n\nThe show Uyajola 9/9 is known for revealing the secrets and scandals of South Africans to the public.\n\nHosted byrapperand TV personality Jub Jub, the show has become popular for exposing infidelity in relationships, often sending ripples through the local community.\n\nBut now, Jub Jub has decided to raise the stakes by taking the drama into religious spaces.\n\nIn a recent video going viral,Jub Jubmade a bold proclamation: Everyone cheats, even at church. So now we cannot go in because of church? We are within!\n\nThe idea of exposing pastors  trusted figures in religious communities  has sparked mixed reactions.\n\nFor those who might be unfamiliar with the show, Uyajola 9/9 is South Africas answer to the Cheaters franchise, with a distinctly local twist.\n\nIn each episode, Jub Jub and his team track down people suspected of cheating, confronting them with evidence.\n\nThe show has become known for its intense confrontations, high drama, and unpredictable outcomes, sometimes tearing families apart, other times resolving long-standing issues.\n\nNow, it seems the show is turning a critical eye toward the very institutions that are meant to guide and support moral values  churches.\n\nBy targeting pastors and religious figures, Jub Jub is challenging the belief that these spaces are beyond reproach when it comes tocheating.\n\nThe implications of exposing cheating in religious settings are complex. On one hand, its understandable why some viewers might see this as a necessary step towards transparency.\n\nIf pastors, who are often viewed as role models are coveting with thy neighbour, it raises concerns about their integrity and teachings.\n\nFor those in the congregation, the revelation could be a shock but also a wake-up call about the flaws that exist even in the most revered of spaces.\n\nHowever, theres also a more sensitive side to consider.\n\nThe church is often considered a sanctuary for people to find solace, guidance and community. By airing these personal conflicts on national TV, Uyajola 9/9 might risk eroding the trust people place in their religious leaders.\n\nSome viewers may feel that the show is exploiting sacred spaces for entertainment rather than truly serving the greater good.\n\nUyajola 9/9 is stirring up an important conversation  one about loyalty, accountability and the blurred lines between public and private life.\n\nShould religious leaders be held to a higher standard? Is it right to expose personal matters in such a public way? Or is this a wake-up call that theres no one immune to the temptations of infidelity, even in the holiest of spaces?\n\nSo many questions!\n\nJub Jub says he is also coming for cheating pastors in the next season of Uyajola99.pic.twitter.com/kyUbDcCFcr\n\n@nathit00th commented: Chief we are busy dealing with bigger issues in our country at the moment. we are repositioning south africa in the world and wena you are coming with petty issues of cheaters please dude chill. we will give you attention next year.\n\n@ModiegiLakes commented: They really need to just shut it. No longer relevant this uyajola 99 nonsense.\n\nWhile @r_motlatso wrote: Hes lying, last time he was promoting season 2 of this stupid show, he said hell be exposing celebrities who cheat. This show must be cancelled, and if you support  youre just as much as an idiot.\n\nSjoe, these people are not having it.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12052103/jub-jub.webp",
            "description": "<p>IOL The show “Uyajola 9/9” is known for revealing the secrets and scandals of South Africans to the public. Hosted by rapper and TV personality Jub Jub, the show has become popular for exposing infidelity in relationships, often sending ripples through the local community. But now, Jub Jub has decided to raise the stakes by taking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jub-jub-raises-hell-by-exposing-infidelity-in-churches-in-the-new-season-of-uyajola-9-9/\">Jub Jub raises hell by exposing infidelity in churches in the new season of ‘Uyajola 9/9’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Three Zimbabweans arrested in Limpopo’s illegal gold processing operation",
            "url": "https://www.newzimbabwe.com/three-zimbabweans-arrested-in-limpopos-illegal-gold-processing-operation/",
            "content": "IOL\n\nFour suspects, three Zimbabwean and one Mozambican, were arrested following the discovery of an illegal gold processing laboratory along the R71 near Tarentaalrand in the Letsitele policing area under Mopani District in Limpopo.\n\nWith the amount ofillegal gold miningin South Africa, minerals are sold illicitly before they are processed in various ways through laboratories run by alleged criminals connected in an intricate network to illegal mining kingpins.\n\nSouth African Police Service (SAPS) spokesperson, Colonel Malesela Ledwaba said the suspects who were identified as: Jonh Vondo, 39, Hardlife Manjoko, 35, Biggie Chimwero, 36, from Zimbabwe and Samuel Almeida Mashaba, 46, Mozambican appeared at Ritavi Magistrates Court on Monday, February 10.\n\nThey are facing charges of illegal processing of gold-bearing materials. They were remanded in custody until February 18 for formal bail Mashaba also faces charges of contravening the Immigration Act, said Ledwaba.\n\nLedwaba further stated that the arrests were made as a result of a well-coordinated, intelligence-driven operation by the Mopani District Vala Umgodi Task Team, which was assisted by Tactical Joint Operational Centre (TACJOC) Detectives and Airwing Drone Pilots.\n\nAdditionally, two of these suspects are alleged to be the primarykingpins driving the illicit miningactivities in the area.\n\nDuring the operation, police seized various items believed to have been used in the illegal processing of minerals, including containers with carbon ashes (presumed to be precious minerals), gas bottles, sulfuric acids and oxygen cylinders, Ledwaba added.\n\nFurthermore, two cars: a red Haval and a white Mercedes-Benz with Gauteng registration plates, thought to be owned by the two alleged kingpins, were confiscated by law enforcement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12043715/Discovery-of-illegal-gold-processing-laboratory-leads-to-arrest-of-four-suspects.webp",
            "description": "<p>IOL Four suspects, three Zimbabwean and one Mozambican, were arrested following the discovery of an illegal gold processing laboratory along the R71 near Tarentaalrand in the Letsitele policing area under Mopani District in Limpopo. With the amount of illegal gold mining in South Africa, minerals are sold illicitly before they are processed in various ways through</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/three-zimbabweans-arrested-in-limpopos-illegal-gold-processing-operation/\">Three Zimbabweans arrested in Limpopo’s illegal gold processing operation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Rebels attack DR Congo army ending lull in fighting",
            "url": "https://www.newzimbabwe.com/rebels-attack-dr-congo-army-ending-lull-in-fighting/",
            "content": "BBC\n\nThe Rwandan-backed M23 rebels have attacked Congolese government forces in the South Kivu province, breaking a two-day lull in fighting.\n\nHeavy shelling began on Tuesday morning, three days after a summit of East and Southern African leaders called for an immediate and unconditional ceasefire.\n\nThe rebels have seized vast swathes of land in the eastern DR Congo, including the major city of Goma.\n\nThey are now pushing towards Bukavu, the capital of South Kivu  another key city in the region.\n\nAround 2,900 people have been killed since early January as a result of the hostilities, the latest UN figures suggest.\n\nApproximately 700,000 others are estimated to have been forced from their homes and thousands more injured.\n\nTuesdays fighting erupted near Ihusi, a locality around 70km (43 miles) from Bukavu and 40km from the South Kivus airport, security sources told news agency AFP.\n\nA spokesperson for the Congo River Alliance (known by its French acronym AFC), an alliance of rebel groups including the M23, suggested its fighters could take their battle to Bukavu.\n\nLawrence Kanyuka responded to the arrests by the Congolese authorities of 84 army personnel for crimes such as killing civilians near Bukavu, saying: If these crimes persist, we will take full responsibility to eradicate the threat at its source and protect our people.\n\nMeanwhile, reports say that hundreds and thousands of refugees, who have fled the ongoing fighting, were being forced to return home by the M23.\n\nThe M23 has denied this allegation, but French broadcaster RFI reported that several large camps for displaced people have been dismantled and their inhabitants made to trek back to their villages in conflict zones.\n\nOcha, the UNs humanitarian agency, said the M23 had given displaced people in Goma 72 hours to return to home.\n\nMr Kanyuka said such reports were propaganda and that displaced people were returning voluntarily. The M23 does not compel anyone to return without firm security guarantees, he said.\n\nThe M23, which is made up of ethnic Tutsis, say they are fighting for minority rights, while DR Congos government says the rebels are seeking control of the eastern regions vast mineral wealth.\n\nDR Congo and the UN accused Rwandas Tutsi-dominated government of backing the M23  an allegation which Kigali has persistently denied.\n\nBut recently, the official response has shifted, with government spokespeople stating that fighting near its border is a security threat.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16020044/DRC-Rebels.png",
            "description": "<p>BBC The Rwandan-backed M23 rebels have attacked Congolese government forces in the South Kivu province, breaking a two-day lull in fighting. Heavy shelling began on Tuesday morning, three days after a summit of East and Southern African leaders called for an immediate and unconditional ceasefire. The rebels have seized vast swathes of land in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rebels-attack-dr-congo-army-ending-lull-in-fighting/\">Rebels attack DR Congo army ending lull in fighting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Hands off the Constitution – ZANU PF told",
            "url": "https://www.newzimbabwe.com/hands-off-the-constitution-zanu-pf-told/",
            "content": "By Darlington Gatsi\n\nOPPOSITION party leader Elizabeth Valerio has criticised the ruling party ZANU PF for pushing for the amendment of the constitution to allow President Emmerson Mnangagwa to extend his stay in office.\n\nWhile one faction of the Zanu PF is pushing for the suspension of the 2028 elections to enable President Mnangagwa to remain in power until 2030, another backing his vice Constantino Chiwenga insists on maintaining the constitutionally stipulated two-term limit.\n\nThe ruling party faction has reportedly enlisted some opposition Members of Parliament to undermine the constitution and exploit the current disarray within the opposition to push for the term extension.\n\nUnited Zimbabwe Alliance (UZA) leader Valerio emphasised that ZANU PFs internal disputes should not interfere with the countrys constitution.\n\nThe government needs to respect the Constitution of Zimbabwe. We do not, in any way, want to see a Zimbabwe where the rights of the people are being eroded. In 2028, we expect to go to the polls.\n\nWe expect to have the opportunity to register our candidates and to elect a new president for Zimbabwe. That is our constitutional right, and we are urging those in ZANU PF to keep their factional disputes to themselves. Do not involve the nation, and do not disrespect our constitutional document. It is the right of citizens to choose their leaders, said Valerio.\n\nDespite Mnangagwa refusing to endorse the extension of his rule, his supporters have been rallying to push for the constitutional amendment.\n\nHe, however, has not publicly condemned the actions of this faction within ZANU PF.\n\nValerio warned that the country should not repeat the mistake of being drawn into ZANU PFs internal politics.\n\nIt is quite unfortunate that Zimbabwe keeps going down the same path. In 2017, we were presented with an opportunity for a new future. Now, we are hearing this new mantra saying we must keep the president in power because he is doing such a great job. This is why we are launching the Community Wall Initiative. We are covering the entire country because we want to put it on record: no one wants 2030.\n\nIf you speak to the people, there are hundreds gathered here today, and they will tell you clearly that they want something different every time they go to the polls. We are no longer interested in this. As UZA, we will ensure that the voice of the citizens is on record. We will not get involved in this factional fight, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/14000014/Elisabeth-Valerio-e1686157693693.jpg",
            "description": "<p>By Darlington Gatsi OPPOSITION party leader Elizabeth Valerio has criticised the ruling party ZANU PF for pushing for the amendment of the constitution to allow President Emmerson Mnangagwa to extend his stay in office. While one faction of the Zanu PF is pushing for the suspension of the 2028 elections to enable President Mnangagwa to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hands-off-the-constitution-zanu-pf-told/\">Hands off the Constitution – ZANU PF told</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Govt makes electronic money usage compulsory for businesses",
            "url": "https://www.newzimbabwe.com/govt-makes-electronic-money-usage-compulsory-for-businesses/",
            "content": "By Alois Vinga\n\nCABINET has approved the compulsory usage of electronic money by all businesses as part of measures to fast-track the formalisation of the business sector.\n\nThis year, Zimbabwe faced the full wrath of formalisation after most big retailers who are a source of tax revenue closed shops after a prolonged era of facing unfair competition from players in the alternative market.\n\nOfficial records show that informalisation in Zimbabwe is around 65% of the Gross Domestic Product (GDP) with a huge chunk of workers being employed in the sector. Data also indicates that the informal sector has cost Zimbabwe at least US$1,15 billion in potential fiscal revenue between 2020 and 2023.\n\nUnder this framework, vendors will be licensed by local authorities in consultation with the Central Government.\n\nSpeaking at the post-cabinet briefing Tuesday, Information Minister Jenfan Muswere said, Under short-term measures, the use of electronic money will now be compulsory for all businesses and shall be achieved through the introduction of a compulsory tax payment system to ensure that every eligible taxpayer pays tax and the establishment of a Domestic Inter-agency Team to ensure informal sector compliance with tax laws.\n\nThe government seeks to bring all businesses into the tax bracket and enhance the effectiveness of the foreign exchange market.\n\nIn the long-term, the government will address the business environment to streamline fees, and charges and minimize duplication of work by Government Agencies as well as improve electricity supply in a bid to enable MSMEs to graduate into formal businesses.\n\nThe Cabinet also agreed to expedite the construction of power plants and upgrading of the distribution network to enhance the availability of electricity, incentivise the use of alternative energy sources, and expedite social protection coverage to the informal sector.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/22053126/what-is-pos-machine-works.jpg",
            "description": "<p>By Alois Vinga CABINET has approved the compulsory usage of electronic money by all businesses as part of measures to fast-track the formalisation of the business sector. This year, Zimbabwe faced the full wrath of formalisation after most big retailers who are a source of tax revenue closed shops after a prolonged era of facing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-makes-electronic-money-usage-compulsory-for-businesses/\">Govt makes electronic money usage compulsory for businesses </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        },
        {
            "title": "Zimbabwe begins compensation of BIPPA protected ex-white farmers with US$20 million set aside in 2024 National Budget; AfDB says payouts will improve investor confidence",
            "url": "https://www.newzimbabwe.com/zimbabwe-begins-compensation-of-bippa-protected-ex-white-farmers-with-us20-million-set-aside-in-2024-national-budget-afdb-says-payouts-will-improve-investor-confidence/",
            "content": "By Alois Vinga\n\nFINANCE and Investment Promotion Minister, Mthuli Ncube has announced the beginning of compensation payments to farmers under the US$20 million facility set aside in the 2024 National Budget.\n\nThe compensation exercise targets investors protected by the Bilateral Investment Protection and Promotion Agreements (BIPPAs) whose investments were affected by the Land Reform Program in 2000.\n\nThe claimants under the category are from Denmark, Germany, the Netherlands, Switzerland and former Yugoslavia.\n\nI am pleased to announce that the compensation process has begun. We believe that this process is crucial for building Trust, honoring commitments and ensuring consistency with our Constitution as we address Zimbabwes debt challenge.\n\nThe payments towards the compensation of investors under BIPPA Protection began in the second week of January 2025.Payments is being made to the claimants bank accounts of choice, said Ncube.\n\nThe envoys of Germany, the Netherlands and Switzerland jointly welcomed the announcement describing it as a giant step bringing a sense of closure among the affected parties.\n\nThe framework established by the Government of Zimbabwe leading to the full compensation of affected BIPPA farmers protected by BIPPA Agreements is indeed a historic achievement. We commend the governments allocation of funds in the National Budget as of 2024 to make the compensation a reality.\n\nSeveral affected investors have received initial payouts, and an emerging sense of closure exists.It marks a significant milestone and we consider it a very encouraging step towards a comprehensive and fair settlement for farmers and investors in Zimbabwe, the ambassadors said in a statement.\n\nThe President of the African Development Bank (AfDB) and the champion of the Zimbabwe Arrears clearance and Debt resolution, Dr Akinwumi Adesina hailed the milestone achievement and implored more development partners to support the initiative.\n\nThe compensation demonstrates the governments goodwill and commitment to building trust in the process and improving in the country. The progress Zimbabwe has made, the commitment and resilience it is showing, calls for support from development partners to facilitate the countrys efforts in implementing ongoing reforms and to provide the much-needed cushion to particularly the vulnerable members of the population, he said.\n\nIn 2022, the Government of Zimbabwe established a Structured Dialogue Platform with all its creditors and development partners to institutionalize engagement on economic and governance reforms to underpin the Arrears clearance and Debt Resolution Process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga FINANCE and Investment Promotion Minister, Mthuli Ncube has announced the beginning of compensation payments to farmers under the US$20 million facility set aside in the 2024 National Budget. The compensation exercise targets investors protected by the Bilateral Investment Protection and Promotion Agreements (BIPPAs) whose investments were affected by the Land Reform Program</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-begins-compensation-of-bippa-protected-ex-white-farmers-with-us20-million-set-aside-in-2024-national-budget-afdb-says-payouts-will-improve-investor-confidence/\">Zimbabwe begins compensation of BIPPA protected ex-white farmers with US$20 million set aside in 2024 National Budget; AfDB says payouts will improve investor confidence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "12 Feb 2025"
        }
    ]
}