{
    "news": [
        {
            "title": "SADC Ministers convene in Zimbabwe to boost regional energy, water co-operation",
            "url": "https://www.newzimbabwe.com/sadc-ministers-convene-in-zimbabwe-to-boost-regional-energy-water-co-operation/",
            "content": "Channel Africa\n\nMinisters from the Southern African Development Community (SADC) responsible for energy and water have gathered in Harare this week for a joint meeting.\n\nThe meeting aims to strengthen regional co-operation and review progress on key projects in both sectors.\n\nThe meeting, which began on Monday and will continue for four days, brings together senior officials from member states to discuss pressing challenges and opportunities.\n\nThis session marks the 30th anniversary of the Southern African Power Pool, established by SADCs Council of Ministers in August 1995 to promote regional power sharing and integration.\n\nThe meeting comes at a time when climate change is having a serious impact on energy production across Southern Africa. Zambia and Zimbabwe are among the hardest hit countries, facing frequent power outages due to reduced water levels in Lake Kariba, which have caused a 25% drop in hydroelectric output.\n\nParticipants are expected to review the progress of the Mission 300 initiative, a project backed by the World Bank and African Development Bank that aims to expand energy access to 600 million people in the region by 2030, with the first target being 300 million.\n\nThe agenda also includes discussions on developing the petroleum and gas sectors, as well as adopting emerging technologies such as green hydrogen and smart grids. The Ministers will consider recommendations from a recent regional dialogue on ensuring a just transition to sustainable energy in Southern Africa.\n\nOn the water front, the meeting will evaluate advances in transboundary water management projects, led by River Basin Organisations and other shared institutions, including groundwater and livelihood support programmes.\n\nProfessor Obert Jiri, Permanent Secretary in Zimbabwes Ministry of Lands, Agriculture and Water Development and Chair of the water officials committee, highlighted the critical link between energy and water resources.\n\nSolar power and energy recovered from landfill gases demonstrate the close relationship between water and energy, he said. Managing water resources effectively is vital, not just for energy generation but also as a response to climate change. A small rise in temperature can significantly reduce water availability in our region, affecting agriculture and livelihoods.\n\nHe added that this meeting is crucial for exploring ways to improve water access for irrigation and energy production, both of which are essential for the regions development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/12122242/Screenshot-2024-11-12-at-14.20.53.png",
            "description": "<p>Channel Africa Ministers from the Southern African Development Community (SADC) responsible for energy and water have gathered in Harare this week for a joint meeting. The meeting aims to strengthen regional co-operation and review progress on key projects in both sectors. The meeting, which began on Monday and will continue for four days, brings together</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-ministers-convene-in-zimbabwe-to-boost-regional-energy-water-co-operation/\">SADC Ministers convene in Zimbabwe to boost regional energy, water co-operation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "02 Jul 2025"
        },
        {
            "title": "Mugabe’s son Chatunga in court over five assault charges",
            "url": "https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/",
            "content": "By Mary Taruvinga\n\nBellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals.\n\nChatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo.\n\nThe trio were released on US$200 bail each.\n\nThere are five complainants in the case.\n\nIn the first count, the complainant is Ntandoyokuza Nyathi (31).\n\nHe is employed as an external security guard at Ultimate Mine, Mazowe.\n\nAccording to the state, on June 25, at around 1600 hours, the complainant was on duty at Ultimate Mine, Mazowe, where he was guarding the premises with a security dog.\n\nHe was at the boundary of Ultimate Mine and Grace Mugabes Iron Mask farm when the accused persons approached him in pursuit of illegal miners allegedly evading arrest from Iron Mask security guards.\n\nOne of the accused persons fired a shot from an unidentified pistol and the illegal miners escaped. The accused persons charged towards the complainant whom they accused of harbouring illegal miners.\n\nThey altogether assaulted the complainant with open hands and fists before he fell, the court heard.\n\nIt is alleged that the trio stomped on the complainant several times whilst he was lying down.\n\nThey ordered the complainant to carry a sack of gold ore to their premises, where they also took turns to assault him using wooden logs and an iron bar.\n\nThe complainant sustained several injuries and went to report the matter at ZRP Mazowe where he was referred to the hospital for medical treatment and examination.\n\nIn the second count, the complainant in this case is Philip Chipara, employed as an internal security supervisor at Ultimate Mine, Mazowe.\n\nHe was also on duty at Ultimate Mine when he was assaulted.\n\nHe heard a gunshot sound at the boundary of the Ultimate Mine and Iron Mask farm and went to investigate.\n\nUpon arrival, he saw his colleague, Nyathi, who was patrolling with a dog being assaulted with fists, booted feet and a shambock all over the body by the accused persons.\n\nThe complainant enquired as to why they were assaulting their security guard.\n\nThe accused persons charged towards the complainant and started assaulting him with fists and booted feet all over the body, the court heard.\n\nIt is alleged that the three handcuffed Chipara, together with Elvis Bvumbe and later released them.\n\nBvumbe is the other complainant.\n\nChatunga and his bodyguards also assaulted Collen Muchemwa and Waddington Mutadza who were also on duty at the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/17191946/Chatunga.jpeg",
            "description": "<p>By Mary Taruvinga Bellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals. Chatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo. The trio were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/\">Mugabe’s son Chatunga in court over five assault charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "02 Jul 2025"
        },
        {
            "title": "Former Minister Mzembi challenges placement on remand",
            "url": "https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/",
            "content": "By Mary Taruvinga\n\nFormer Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand.\n\nMzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application.\n\nHis lawyer, Killian Mandiki, intends to file written submissions before the State responds.\n\nFollowing his arrest last month, Mzembi had his bail revoked by a Harare magistrate who trashed his application for cancellation of arrest warrants, ruling that he failed to report back on time when he got the opportunity.\n\nMandiki had told the court that the former minister was not in wilful default.\n\nMzembi said he was sick with a life-threatening condition and was hospitalised most of the time.\n\nHe also said he only decided to come back home after noticing that his health had improved.\n\nBut the magistrate said Mzembi was not sick to the extent that he could not attend court.\n\nIn revoking Mzembis bail, the magistrate also noted that Mzembi was the campaigning manager for fellow former minister Saviour Kasukuwere, who is currently exiled in South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01102551/mzembi.png",
            "description": "<p>By Mary Taruvinga Former Foreign Affairs Minister Walter Mzembi, has launched another freedom bid, this time challenging his placement on remand. Mzembi briefly appeared before Harare magistrate Donald Ndirowei on Tuesday before he was remanded to July 9 for ruling on his application. His lawyer, Killian Mandiki, intends to file written submissions before the State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-minister-mzembi-challenges-placement-on-remand/\">Former Minister Mzembi challenges placement on remand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "02 Jul 2025"
        },
        {
            "title": "Ladysmith Black Mambazo honoured with prestigious award",
            "url": "https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/",
            "content": "TshisaLive\n\nLadysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence.\n\nThegroup, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing ofumculo wesintu, South Africas indigenous music.\n\nIn their acceptance speech, the group thanked Ukhozi FM for this recognition.\n\nWe stand humbled and honoured. Ukhozi FM celebrated us for the role weve played in nurturing and growingumculo wesintu our indigenous music. From the hills of Ladysmith to stages around the world, weve carried the sounds of our ancestors with pride,said Sibongiseni Tshabalala, the son of the founder of Ladysmith Black Mambazo,JosephTshabalala.\n\nThank you, Ukhozi FM, for this beautiful recognition.Siyabonga,thank you for walking this journey with us.\n\nThe group were among other notable artists  Nothembi Mkhwebane, Ringo and Makhadzi  who graced the stage with captivating performances.\n\nThis year marks 65 years of Ladysmith Black Mambazo in the music industry and to celebrate the milestone they are undertaking a special tour.\n\nAfter wrapping up their US tour and the first instalment of the national tour in Johannesburg, the group have performances lined up in Durban and Cape Town.\n\nIts such an amazing experience to walk in the footsteps of our father, the founder of the group Joseph Shabalala, and all others who founded the group. I have realised that I have been with the group for more than 30 years now, said Sibongiseni.\n\nThis means the legacy of the group is continuing to grow from glory to glory. In a few years from now we will celebrate 70 years, an incredible milestone in the history of music. We thank South Africans , the continent and the world for supporting us throughout this journey.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01014629/black-mambazo.png",
            "description": "<p>TshisaLive Ladysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence. The group, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing of umculo wesintu, South Africa’s indigenous music. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/\">Ladysmith Black Mambazo honoured with prestigious award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "02 Jul 2025"
        }
    ]
}