{
    "news": [
        {
            "title": "Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Birmingham, United Kingdom",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-birmingham-united-kingdom/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, we understand that theZimDiaspora Property Showcase is backinthe UK and will be held in Birmingham, UK on 12thJuly, 2025. What can the diaspora market expect?\n\nVM: Yes, I am glad that the Zim Diaspora Property Showcase is back in the UK and will be held in Birmingham on Saturday, 12thJuly, 2025 at the Hilton Metropole between 10am to 5pm.\n\nThanks again to its organisers, Seeff Zimbabwe, this showcase is unique in that it allows real estate and complementary businesses operating in Zimbabwe to engage and discuss with the market in the Diaspora. What is key to latch on to is that these businesses were already offering services to the diaspora market.\n\nThe difference now is that the Zimbabwe-based businesses and the diaspora market can operate from a position of mutual understanding and benefit. The aim is to create a symbiotic and not parasitic relationship between the businesses and their markets.\n\nThe event will showcase businesses in the Zimbabwe real estate industry, including complementary businesses like construction companies, money transfer agents, building equipment suppliers and mortgage providers to engage with their market, tinkering with their payment options to suit specific markets.\n\nReporter:What can the UK community expect from the event?\n\nVM: The community in the United Kingdom can expect that the 15 or more companies attending the event from Zimbabwe will showcase exciting deals and real estate products for the UK market.\n\nOur first showcase in July last year in Birmingham opened the business attendees eyes to the unique needs of this particular market. The diaspora property showcase in Texas, USA assisted the Zimbabwe businesses to understand the general needs of the diaspora community in their quest to invest and have properties in Zimbabwe.\n\nI say this so that the attendees understand that the participants this year have a more developed idea of how to tailor their products for this unique market to allow for more people to own properties, while also considering their unique economic and social obligations in their host countries. A commercialquid pro quo.\n\nReporter: What can we expect from your presentation on legal issues affecting property investments?\n\nVM: I suppose I represent one of the complementary businesses, as no property transaction in Zimbabwe can be done without the assistance of a lawyer and if somehow it is done without one, in more cases than not, a lawyer will get involved at a later stage to mitigate the mess.\n\nMy presentation at the conference will be aimed at clarifying or simplifying to the UK diaspora community the Zimbabwe legal and regulatory framework for real estate investment. My presentation will cover the investment process, including other ancillary social and commercial issues that may affect such investment.\n\nThe overarching objective is to ensure that potential investors at the conference are able to invest safely and wisely in Zimbabwe. To the foreign investors, my presentation will include issues related to the repatriation of capital and profits on disinvestment.\n\nReporter: The main concern for the diaspora is that they are not duped of their hard-earned money, will your presentation also look at what to do not to be duped?\n\nVM: That will be the crux of my presentation to mitigate that possibility so that attendees do not fall victim to fraudsters.\n\nOur property development sector is growing and the natural thing in any growing industry is that unscrupulous people view it as an opportunity for quick gains. The carrot normally being unrealistic deals that offer quick and commercially ridiculous gains.\n\nIt has been my experience that real estate investments should be made with a sober mindset having completed the necessary due diligence required. It is your classic aphorism, all that glitters is not gold.\n\nReporter: Are there any other presenters?\n\nVM: Yes, we have heads of banks and banking departments presenting at the conference offering mortgages and other financial products, Real Estate directors and agents, property developers, alternative energy players and many more attending and presenting at the conference.\n\nReporter: Thank you, Mr. Madzima. We have to end here due to time constraints.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07145305/mcm.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, we understand that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-birmingham-united-kingdom/\">Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Birmingham, United Kingdom</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "08 Jul 2025"
        },
        {
            "title": "Opposition abandoned Sikhala during jail time – Hwende",
            "url": "https://www.newzimbabwe.com/opposition-abandoned-sikhala-during-jail-time-hwende/",
            "content": "By Staff Reporter\n\nCitizens Coalition for Change (CCC) Kuwadzana East MP Charlton Hwende has made a startling admission that his party abandoned former St Marys MP Job Sikhala when he was in prison.\n\nSikhala was arrested in June 2022 and spent 595 days in Chikurubi Maximum Prison, accused of inciting public violence following clashes that broke out in Nyatsime during the funeral of Citizens Coalition for Change (CCC) activist Moreblessing Ali, who was murdered.\n\nAli was killed by Zanu PF activist Pius Jamba Mukandi, who was sentenced to 30 years in jail after mutilating Alis body and dumping her remains in a disused well in rural Nyatsime.\n\nWhile Sikhala was in prison, reports emerged that he had been deserted by the opposition.\n\nThe CCC refuted claims of neglecting Sikhala, with the then party deputy spokesperson Gift Ostalos Siziba dismissing the allegations and insisting that Sikhala was not neglected and that his family was being taken care of.\n\nThere was also speculation that Sikhala and his former party leader Nelson Chamisa had fallen out, but Chamisa recently officiated at Sikhalas book launch in Harare, seemingly dispelling rumours of a rift between the two.\n\nHowever, speaking at the second launch of Sikhalas book, Footprints in the Chains  The life Story of Job Sikhala, in Bulawayo recently, Hwende said he attended the event to apologise to Sikhala for the lack of support he received during his imprisonment.\n\nI came here by bus to apologise. We owe it to Job Sikhala. I was the secretary general of the last united CCC and we betrayed him. We didnt offer the solidarity that was expected by our ordinary members. And today I stand here to apologise, he said.\n\nChalton Hwende\n\nHwende also stated that Sikhalas prolonged stay in prison was due to the democratic movement not pushing hard enough for his release.\n\nIf the united democratic movement had offered the same solidarity that was expected by our ordinary members, this man would not have stayed in prison for over 500 days, Hwende said, to applause from the audience, including Sikhala himself and Bulawayo Mayor David Coltart, among others.\n\nHwende, who appears to be warming up to rejoining his former party boss, Nelson Chamisa, in the political project Chamisa is building, has been engaging in spats with staunch Chamisa supporters on X, who are vowing that Hwende should not be allowed anywhere near Chamisa and the new democratic project he is developing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Staff Reporter Citizens Coalition for Change (CCC) Kuwadzana East MP Charlton Hwende has made a startling admission that his party abandoned former St Mary’s MP Job Sikhala when he was in prison. Sikhala was arrested in June 2022 and spent 595 days in Chikurubi Maximum Prison, accused of inciting public violence following clashes that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-abandoned-sikhala-during-jail-time-hwende/\">Opposition abandoned Sikhala during jail time – Hwende</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "08 Jul 2025"
        },
        {
            "title": "Mai TT slapped with US$100,000 defamation lawsuit",
            "url": "https://www.newzimbabwe.com/mai-tt-slapped-with-us100000-defamation-lawsuit/",
            "content": "By Staff Reporter\n\nCOMEDIENNE Mai TT is facing a US$100,000 defamation lawsuit from businesswoman Shingirayi Ziwange Jere, wife of Murehwa West legislator and CAPS United owner Farai Jere.\n\nThe lawsuit follows Facebook posts in which Mai TT accused Jere of threatening her, sending people to assault her, and manipulating the justice system.\n\nJere represented by lawyer Admire Rubaya of Rubaya and Chatambudza Legal Practitioners, said the statements published on June 9 were unfounded and fabricated and depicted the businesswoman as a criminal queenpin.\n\nShingirayi Ziwange Jere\n\nIn this digital epoch where all and sundry have widespread access to the internet, it is our clients considered view that the statements that you published on your FACEBOOK page are defamatory and were understood by a reasonable reader, follower or Facebook user to carry one or more of the following meanings:\n\nThat our client acts with impunity in that she is a maliciously dangerous person who malevolently hires criminals to commit assault and torture ordinary citizens and non-entities like you.\n\nThat our client, is a criminal queenpin conducting criminal activities of conducting unlawful surveillance on your property without your consent and/or permission and is consistently threatening you with death and harm.\n\nThat our client is a person who manipulates the justice system in Zimbabwe which has led to you losing a case against another socialite Patricia Jack whom you allegedly caused her arrest for alleged uploading your daughters nude pictures yet our client has no connection whatsoever to justice system in Zimbabwe and has no capacity whatsoever to influence any out comes regards cases in Zimbabwe, reads the letter.\n\nJere is also lodging a criminal complaint against Mai TT under Zimbabwes Cyber and Data Protection Act for cyberbullying, harassment, and spreading false information.\n\nThe overall tenor of your ill-founded social media rants is that you are sadfishing at the expense of our client and she will not take this lying low.\n\nIn this vein, please note that our client is in the process of lodging a criminal complaint against you. It is quite ironic and amusing how you must obviously be aware that your actions are clearly criminal, given your history of lodging similar complaints against others. Therefore, this may literally be a charming dose of your own medicine.\n\nWe urge you to consider Section 164B, 164C of the Criminal law Codification and Reform Act [Chapter 9:23] as amended by the Cyber and Data Protection Act [Chapter 12:07.\n\nThese two offences creating provisions relate to cyber-bullying, harassment and transmission of false data messages intending to cause harm, which include economic harm, reads the letter.\n\nFurthermore, Jeres legal team has demanded a full, unconditional and unreserved withdrawal from Mai TT within twelve hours, warning that failure to comply will result in a formal summons for US$100,000 in damages.\n\nIn light of the above, our strict instructions are to demand, as we hereby do, the publication of a full, unconditional and unreserved withdrawal of that defamatory statement, pictures and the related imputations together with an expression of regret on the same within twelve hours of receiving this letter as well as an instruction to your personnel in charge of the content of your Facebook page and/ or other social media pages or handles to delete the posts and comments in question.\n\nIn the event that you fail to retract the defamatory statements as demanded our client shall proceed to issue Summons and claim damages for defamation in the tune of US$100,000 (One Hundred United States Dollars) without any further notice to you, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07195804/WhatsApp-Image-2025-07-07-at-20.55.21.jpeg",
            "description": "<p>By Staff Reporter COMEDIENNE  Mai TT is facing a US$100,000 defamation lawsuit from businesswoman Shingirayi Ziwange Jere, wife of Murehwa West legislator and CAPS United owner Farai Jere. The lawsuit follows Facebook posts in which Mai TT accused Jere of threatening her, sending people to assault her, and manipulating the justice system. Jere represented by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mai-tt-slapped-with-us100000-defamation-lawsuit/\">Mai TT slapped with US$100,000 defamation lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "08 Jul 2025"
        },
        {
            "title": "Youth Minister Machakaire demands public apology, retraction from Mahere following social media row",
            "url": "https://www.newzimbabwe.com/youth-minister-machakaire-demands-public-apology-retraction-from-mahere-following-social-media-row/",
            "content": "By Staff Reporter\n\nYOUTH Empowerment Minister Tinoda Machakaire has written tolawyer and opposition politician Fadzayi Mahere, demanding a retraction and public apology within 24 hours over what he describes as defamatory allegations.\n\nThe two have been engaged in a heated exchange on X, after Machakaire echoed President Emmerson Mnangagwas denunciation of zvigananda.\n\nThe term zvigananda is a derogatory label for individuals with ill-got wealth.\n\nMahere respondedto Machakaire,questioninghim over allegations that his company, TinMac Motors, was corruptly awarded tenders under the US$3 billion Command Agriculture scheme due to his association with controversial businesstycoonKudakwasheTagwirei.\n\nShe also raised concerns about a vehicle scandal during Machakaires tenure as Deputy Youth Minister, where 17 cars were purchased for the ministry, yet only seven were delivered and just four were officially registered under the ministry.\n\nFadzayi Mahere\n\nMahere further questioned Machakaire about an alleged multi-million-dollar tax evasion case involving vehicle imports, which was reportedly dropped by the Zimbabwe Anti-Corruption Commission following political interference.\n\nIn a letter seen by NewZimbabwe.com Monday, Machakaire, through his lawyers, demanded that Mahere issue a public apology and retraction in both print and digital media.\n\nWe hereby demand, as we are instructed, that you comply with the following within 24 hours of receipt of this letter:\n\nYou shall issue a sincere, profuse, and unconditional public apology to our client, acknowledging the harm caused by your nefarious allegations. The apology must be both in print and digital media.\n\nFor the avoidance of doubt, you shall cause an apology to be published in one of the most widely circulating newspapers in this country and post the same apology on your X handle, @advocatemahere.\n\nYou shall unconditionally retract the posts you made on your X handle, regarding Honourable Machakaire, alleging he is corrupt, dishonest, a liar, and misuses public funds to acquire luxury vehicles, the letter reads.\n\nMeanwhile, Mahere acknowledged receipt of the letter but questionedwhether Machakaire was aware that the Access to Information and Protection of Privacy Act (AIPPA), which he cited in his letter, was repealed five years ago.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/14011139/Machakaire-1.jpg",
            "description": "<p>By Staff Reporter YOUTH Empowerment Minister Tinoda Machakaire has written to lawyer and opposition politician Fadzayi Mahere, demanding a retraction and public apology within 24 hours over what he describes as “defamatory allegations”. The two have been engaged in a heated exchange on X, after Machakaire echoed President Emmerson Mnangagwa’s denunciation of “zvigananda.” The term “zvigananda”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/youth-minister-machakaire-demands-public-apology-retraction-from-mahere-following-social-media-row/\">Youth Minister Machakaire demands public apology, retraction from Mahere following social media row</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "08 Jul 2025"
        }
    ]
}