{
    "news": [
        {
            "title": "Warriors intensify preparations ahead of Benin clash",
            "url": "https://www.newzimbabwe.com/warriors-intensify-preparations-ahead-of-benin-clash/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens football team coach, Michael Nees, conducted training on Wednesday afternoon with a full squad following the arrival of European-based players.\n\nThe Warriors are in Abidjan, Ivory Coast, where they are set to play against Benin in a Group C World Cup Qualifiers encounter.\n\nZimbabwes group of players arrived on Monday, together with the technical team, followed by South African-based players on Tuesday, before the European-based players touched down on Wednesday.\n\nTeam vice captain Marshall Munetsi will not be with the squad in the Ivory Coast as he is serving a suspension; rather, he will meet with the rest of the squad on Sunday in South Africa, where they will play Rwanda on Tuesday.\n\nSpeaking ahead of Benin clash, Warriors goalkeeper Washington Arubi said the teams preparations will determine Fridays outcome.\n\nWe have had a good session, you can tell that the boys are ready to fight and we are looking forward to the game.\n\nSo for now, we are focusing on Benin and we are not thinking about the next game.\n\nOur preparations will determine if we will get the maximum points because we dont want to drop points at this stage in time, he said.\n\nZimbabwe is currently bottom in Group C of the 2026 Africa World Cup Qualifiers with 4 points and a win against Benin will keep their hopes of qualifying alive.\n\nHowever, this will depend on how group leaders South Africa (13 points) would have played against Lesotho, because a win for them will automatically shatter Zimbabwes chance of progressing despite a win against Benin.\n\nSouth Africa = 13 points\n\nBenin = 8 points\n\nRwanda = 7 points\n\nNigeria = 6 points\n\nLesotho = 5 points\n\nZimbabwe = 4 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03210657/warriors.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s football team coach, Michael Nees, conducted training on Wednesday afternoon with a full squad following the arrival of European-based players. The Warriors are in Abidjan, Ivory Coast, where they are set to play against Benin in a Group C World Cup Qualifiers encounter. Zimbabwe’s group of players arrived</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-intensify-preparations-ahead-of-benin-clash/\">Warriors intensify preparations ahead of Benin clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "No law bans tinted vehicle windows – Justice Minister says as police fines motorists",
            "url": "https://www.newzimbabwe.com/no-law-bans-tinted-vehicle-windows-justice-minister-says-as-police-fines-motorists/",
            "content": "By Anna Chibamu\n\nJustice Minister Ziyambi Ziyambi told the National Assembly on Wednesday that there is no law prohibiting tinted vehicle windows.\n\nHis remarks followed an announcement by Presidential Secretary Tafadzwa Muguti claiming that tinting had been banned, which sparked confusion and questions from legislators seeking clarification on the legal framework behind the directive.\n\nDuring the Question and Answer session, Zanu PF Zvimba East MP Kudakwashe Mananzva asked, We heard that it is now a criminal offence to tint car windows. Is it illegal to put some tint on your car?\n\nIn response, Ziyambi clarified: The law allows tinting on a vehicle, provided it does not obstruct the drivers clear line of vision. For side windows, we have not yet reached a final agreement together with Hon. (Felix) Mhona, Hon. (Kazembe Kazembe), and other stakeholders.\n\nDangamvura-Chikanga MP Prosper Mutseyami pressed further, asking whether Mugutis announcement represented government policy or his personal opinion.\n\nZiyambi stressed that only Information Minister Jenfan Muswere, Information Secretary Nick Mangwana, and Presidential Spokesperson George Charamba are authorised to speak on behalf of government. The moment someone speaks on behalf of the whole government without that authority, it becomes a mistake,he said.\n\nKuwadzana East MP Charlton Hwende revealed that some drivers had been fined by police following Mugutis announcement.\n\nZiyambi responded: There is no policeman who enforces social media announcements without a Statutory Instrument. Policemen enforce the law by quoting Statutory Instruments. If anyone was given a ticket, they have the right to go to court, and the court will take corrective measures. Our policemen are orderly; they do not do that.\n\nMP Gladys Hlatywayo questioned how government planned to address the policy discord that had caused confusion and public outcry. Ziyambi replied that the role of MPs was to provide oversight, not to set policy.\n\nEarlier, Charamba took to X (formerly Twitter) to clarify that Mugutis announcement was a miscommunication by an unauthorised official.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Anna Chibamu Justice Minister Ziyambi Ziyambi told the National Assembly on Wednesday that there is no law prohibiting tinted vehicle windows. His remarks followed an announcement by Presidential Secretary Tafadzwa Muguti claiming that tinting had been banned, which sparked confusion and questions from legislators seeking clarification on the legal framework behind the directive. During</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-law-bans-tinted-vehicle-windows-justice-minister-says-as-police-fines-motorists/\">No law bans tinted vehicle windows – Justice Minister says as police fines motorists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Ten Chinese nationals in court over Harare cocaine bust",
            "url": "https://www.newzimbabwe.com/ten-chinese-nationals-in-court-over-harare-cocaine-bust/",
            "content": "By James Muonwa\n\nTEN Chinese nationals have appeared at the Harare Magistrates Court for initial remand following their arrest in a drug raid at a lodge.\n\nThe 10 accused personsare Huang Zhen (a male aged 39), You Hefe (male, 35), Song Yunmel (female, 27), Yuang Wanwan (female, 29), Wu Yuejun (female, 46), Yang Qin (female, 29), Fan Yue (male, 36), Sun Jie (male, 36), Yao Wenming (male, 40) and Li Zhongju (male, 31).\n\nThe prosecutor alleged that police pounced on the accused persons following a tip-off about all-night parties at 60 Knightsbridge Road, Newlands in Harare.\n\nAccused persons were caught sniffing cocaine, benzodiazepam and methamphetamine.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) noted that drug use fuels crime and destroys lives.\n\nThe justice system will deal firmly with those found peddling and abusing dangerous substances in Zimbabwe, said NPAZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By James Muonwa TEN Chinese nationals have appeared at the Harare Magistrates Court for initial remand following their arrest in a drug raid at a lodge. The 10 accused persons are Huang Zhen (a male aged 39), You Hefe (male, 35), Song Yunmel (female, 27), Yuang Wanwan (female, 29), Wu Yuejun (female, 46), Yang Qin (female,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ten-chinese-nationals-in-court-over-harare-cocaine-bust/\">Ten Chinese nationals in court over Harare cocaine bust </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Love triangle turns deadly: Axe murder suspect arrested while fleeing to Zimbabwe",
            "url": "https://www.newzimbabwe.com/love-triangle-turns-deadly-axe-murder-suspect-arrested-while-fleeing-to-zimbabwe/",
            "content": "IOL\n\nPolice in Limpopo have arrested a 51-year-old Zimbabwean man who had been on the run after a violent love triangle turned deadly at Wegdraai Village, Maleboho.\n\nOn Wednesday morning,IOL reported thatthe horrific incident occurred on Monday at around 11 pm.\n\nThe suspect, who is the elder brother of a 20-year-old man arrested earlier this week, was cornered in the Alldays policing area on Tuesday night while attempting to flee the country.\n\nProvincial police spokesperson Colonel Malesela Ledwaba confirmed the arrest: The suspect, who had been on the run, was arrested at about 9 pm after he was found hiding in a truck headed towards Zimbabwe. Upon arrival, he was found carrying a bag of clothes in an attempt to flee the country. Like his younger brother, he was also found to be in the country illegally.\n\nThe case stems from the violent confrontation late on Monday after the brothers allegedly received information that the 55-year-old victim was romantically involved with the elder brothers girlfriend. They stormed into a homestead where the victim and a 38-year-old woman were present.\n\nOn arrival, a confrontation ensued, during which the elder brother allegedly attacked the man with an axe and severely injured the woman, said Ledwaba.\n\nParamedics certified the 55-year-old man dead at the scene, while the injured woman was rushed to hospital for urgent treatment.\n\nPolice swiftly arrested the younger brother at his home, where they recovered the bloodied axe, which he had allegedly tried to wash in an effort to destroy evidence. He was also confirmed to be an undocumented foreign national.\n\nBoth suspects  aged 20 and 51  face charges of murder, attempted murder, defeating the ends of justice, and contravention of the Immigration Act. They are scheduled to appear before the Senwabarwa Magistrates Court on Wednesday.\n\nMeanwhile,Limpopos provincial police commissioner, Lieutenant General Thembi Hadebe,welcomed the swift arrest and applauded community members for helping police track down the fugitive.\n\nThis was a brutal act of violence. We call upon communities to continue working closely with the police. We will not tolerate such despicable behaviour, and no one is above the law, said Hadebe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03144323/axe.png",
            "description": "<p>IOL Police in Limpopo have arrested a 51-year-old Zimbabwean man who had been on the run after a violent love triangle turned deadly at Wegdraai Village, Maleboho. On Wednesday morning, IOL reported that the horrific incident occurred on Monday at around 11 pm. The suspect, who is the elder brother of a 20-year-old man arrested earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/love-triangle-turns-deadly-axe-murder-suspect-arrested-while-fleeing-to-zimbabwe/\">Love triangle turns deadly: Axe murder suspect arrested while fleeing to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Dali Mpofu: ‘People of Matabeleland in Zimbabwe are literally from South Africa’",
            "url": "https://www.newzimbabwe.com/dali-mpofu-people-of-matabeleland-in-zimbabwe-are-literally-from-south-africa/",
            "content": "By Jonisayi Maromo | IOL\n\nAdvocate Dali Mpofu, a senior member of theuMkhonto weSizwe (MK) party led by former president Jacob Zuma, has castigated deepening divisions among Africans, and called for development on the continent and the free movement of people.\n\nThe seasoned legal counsel was speaking at the launch ofZimbabwean veteran opposition politician Job Sikhalas book, Footprints in the Chains: The Life Story of Job Sikhala, in Johannesburg. Zimbabwean journalist and commentator Hopewell Chinono also attended and addressed the event.\n\nThe guest of honour at the Joburg event,Mozambican main opposition leader Venncio Mondlane, was allegedly blocked by Mozambican authorities from attending physically, but he addressed the event virtually.\n\nIn his address, Mpofu said Africans today are heavily dividedalong lines they cannot explain.\n\nIn the song (that was sung at the book launch event) somebody was talking about makwerekwere (a commonly used derogatory slur in South Africa against foreign nationals, particularly those from other African countries). We have allowed ourselves to be divided along lines that we also cannot even explain ourselves, said Mpofu.\n\nHow can we havemakwerekwerehere in Africa? Just tell me, how many people know that people of Matabeleland actually come from here? The entire Matabeleland  they come from here literally.\n\nMatabeleland is a vast region in southwestern Zimbabwe, named after the indigenous Ndebele people who reside there. It is divided into three modern-day provinces: Matabeleland North, Matabeleland South, and the city-province of Bulawayo.\n\nMpofu also referred to the sharing of languages among different groups of Africans found in different nations.\n\nThat is not a coincidence, we do not ask ourselves why? Why is that so? It is becauseMziilikaziwho moved from here, is the same person who was fighting alongside Shaka, and this is not a long time ago. It is less than 200 years ago. In historical terms, that is not a long time.\n\nBecause of those wars, Mzilikazi actually moved from what we call KZN (KwaZulu-Natal) now and lived here, in Gauteng, for a long time until the so-called Voortrekkers came and then it is only then that he moved across the Limpopo. So the very same people, who 200 years ago were sitting together in KZN are now calling each other  this one is makwerekwere. We must wake up as Africans, we really must, said the former chairperson of the Economic Freedom Fighters (EFF).\n\nHe said oppressors have used borders to divide Africans.\n\nWe worship things that have been imposed on us. Who came up with the borders? Was it us? In 1884 there was a meeting in Germany with white people only, not a single African. Not one African, I think even the people that were serving tea were white. And those people decided to cut our continent into pieces as they liked.\n\nIf my village and Jobs village, if they decided and cut it, he is now in another country and I am now in another country. They didnt care, they were cutting it according to the riches of the continent, said Mpofu.\n\nWhy is it that in the United States, you have 51 states and can move around without borders? Why are we as Africans not asking those questions? The answer is this: the only reason we are fighting is that we are not economically developing our continent.\n\nMpofu said if Africa was developing as a continent, there would be no need for the extensive restrictions on peoples movement.\n\nPeople do not move because they hate their homes. They move because of economic factors. That happens everywhere. I am here because of economic factors. I come from the Eastern Cape. So you can call me kwerekwere as well, said Mpofu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03143601/Dali-Hopewell.png",
            "description": "<p>By Jonisayi Maromo | IOL Advocate Dali Mpofu, a senior member of the uMkhonto weSizwe (MK) party led by former president Jacob Zuma, has castigated deepening divisions among Africans, and called for development on the continent and the free movement of people. The seasoned legal counsel was speaking at the launch of Zimbabwean veteran opposition politician Job</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dali-mpofu-people-of-matabeleland-in-zimbabwe-are-literally-from-south-africa/\">Dali Mpofu: ‘People of Matabeleland in Zimbabwe are literally from South Africa’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Musician Chillmaster banned from driving",
            "url": "https://www.newzimbabwe.com/musician-chillmaster-banned-from-driving/",
            "content": "By Mary Taruvinga\n\nProminent musician Kudakwashe Hombarume, better known as Chillmaster, has been banned from driving for nine months by Mbare Magistrate Tendayi Mukurunge, who convicted him three months ago.\n\nThe development comes after his case was remitted back to the lower court for the magistrate to reconsider punishment and to conduct a mandatory inquiry into whether Hombarume should be prohibited from driving under section 64(3) of the Road Traffic Act.\n\nJudge President, Justice Mary Zimba-Dube, on automatic review, slammed the magistrate for trivialising the offence after he spared him jail and committed the musician to community service.\n\nIn his latestrevised ruling, Mukurunge banned Chillmaster from driving for nine months with no other conditions.\n\nThe High Court had blasted the Mbare magistrate for imposing community service on a 24-year-old unlicensed musician ruling that the sentence trivialised the seriousness of culpable homicide arising from road traffic accidents.\n\nDelivering judgment on review, Justice Dube said the trial court misdirected itself by treating the offence as one of ordinary negligence when in fact the accuseds conduct showed gross negligence.\n\nThe facts of this case reveal a serious breach of road safety regulations by an offender who, without restraint, takes it upon himself to drive a vehicle without a licence, speeds and causes an accident leading to loss of life of an innocent person, Justice Dube wrote. Contrary to a finding of ordinary negligence, the facts disclose gross negligence.\n\nHombarume admitted driving a Honda Shuttle at up to 100 km/hr in a 60 km/h zone when he struck and killed 46-year-old Custon Charumbira in April this year.\n\nHe had no drivers licence.\n\nThe trial court sentenced him to 24 months imprisonment, wholly suspended on condition that he performs community service and does not commit a similar offence.\n\nJustice Dube said the magistrate erred by placing undue weight on the victim impact statement from Charumbiras widow, who had recommended a non-custodial sentence after the accused paid compensation, funeral expenses and pledged further support.\n\nA victim impact statement cannot trump the interests of justice, said the judge.\n\nCourts should not allow offenders to buy themselves out of a custodial sentence simply because they can pay compensation.\n\nThe judge stressed that with Zimbabwe facing high rates of accidents on our roads, courts had a duty to send a strong warning to offenders who drive without licences resulting in fatalities, that such conduct will attract censure of the courts.\n\nThe High Court withheld its confirmation of sentence, remitting the matter to the magistrate to reconsider punishment and to conduct a mandatory inquiry into whether Hombarume should be prohibited from driving under section 64(3) of the Road Traffic Act.\n\nThe aggravating features of this case do not justify community service, Justice Dube concluded. Community service imposed in circumstances such as these has the effect of trivialising the offence of culpable homicide arising from road traffic accidents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220103/Chillmaster.webp",
            "description": "<p>By Mary Taruvinga Prominent musician Kudakwashe Hombarume, better known as Chillmaster, has been banned from driving for nine months by Mbare Magistrate Tendayi Mukurunge, who convicted him three months ago. The development comes after his case was remitted back to the lower court for the magistrate to reconsider punishment and to conduct a mandatory inquiry</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musician-chillmaster-banned-from-driving/\">Musician Chillmaster banned from driving</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "Parliamentary Committee report exposes revenue losses, corruption in ZINARA operations",
            "url": "https://www.newzimbabwe.com/parliamentary-committee-report-exposes-revenue-losses-corruption-in-zinara-operations/",
            "content": "By Anna Chibamu\n\nA PARLIAMENTARY Public Accounts Committee (PAC) analysis report has revealed that government lost millions of United States (US) dollars due to collusion between the Zimbabwe National Road Administration (ZINARA) officials and truck drivers at the border posts.\n\nPAC conducted an analysis of the Zimbabwe National Road\n\nAdministration (ZINARA) based on the findings of the Auditor Generals report on State-Owned Enterprises and Parastatals for the year ended December 31, 2023.\n\nThe analysis which exposed rampant corruption at ZINARA was crucial for ensuring transparency and accountability in the management of public resources.\n\nThe Auditor General reported that ZINARA improperly released 11 vehicles with ZWL $10.1 million in unpaid overload fees due to a lack of policies without any evidence of payment plans or proof of payment.\n\nThe PAC Committee, in its analysis, noted with concern the high risk of revenue loss due to potential collusion between truck owners and ZINARA officials, as evidenced by the improper release of the 11 vehicles.\n\nZINARA Finance Director, Adam Zvandasara, informed the Committee that the Vehicle Inspection Department (VID) acts as ZINARAs agent for the collection of abnormal, overload, and transit fees. The overload fees were determined and paid at VID.\n\nAccording to Zvandasara, if overloaded vehicles cannot pay on the spot, they are referred to ZINARA for payment plans. ZINARA reviews the paperwork to determine whether to release the vehicle upon fulfilment of the payment plan, with the Finance department signing off on the payment plan and following up on recovery.\n\nTo date, 52% (ZWL $5,284,507,00) of the outstanding amount has been recovered, leaving a balance of ZWL $4,964,363.50. Efforts to recover the remaining amount are ongoing, Zvandasara told the Committee during an oral evidence hearing session, read part of the PAC analysis report.\n\nAlso among the raised issues by the AGs report was the tollgate evasion, where road users bypassed tollgates using unauthorised routes.\n\nThe Committee noted that the manual system used by ZINARA was prone to corruption, as evidenced by the supervisors delayed submission of evasion lists.\n\nZINARA is transitioning from manual to automated flagging.\n\nWhile the manual system provided an audit trail, the new system ensures greater accuracy and accountability.\n\nCCTV cameras are used to validate data on flagged vehicles. The delay in migration was due to the complexity of system development and continuous improvement requests, the Committee analysis report showed.\n\nThe committee had recommended that the ZINARA Board should investigate the supervisors conduct and submit findings by the end of July 2025.\n\nIt also recommended that ZINARA should install a computerised system for recording tollgate evasions by August 2025, with evasion lists submitted to the Auditor General within one week of flagging\n\nAnother concern, regarding the Auditor Generals report, involved transit coupons where the Eskbank Tollgate had obsolete transit coupons, last used in 2018, which were not recorded in the register.\n\nThe coupons lacked security features and were intended for manual ticketing during system downtime.\n\nZvandasara highlighted that the manual coupons were historically used during power outages or system failures.\n\nPAC noted the risk of pilferage due to the lack of security features on the transit coupons.\n\nZINARA should introduce regular spot checks to ensure system integrity beginning 31 October 2025.\n\nIt should also implement additional security measures for transit coupons by 31 October 2025, read part of the PAC analysis report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03195553/tollgate.png",
            "description": "<p>By Anna Chibamu A PARLIAMENTARY Public Accounts Committee (PAC) analysis report has revealed that government lost millions of United States (US) dollars due to collusion between the Zimbabwe National Road Administration  (ZINARA) officials and truck drivers at the border posts. PAC conducted an analysis of the Zimbabwe National Road Administration (ZINARA) based on the findings</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliamentary-committee-report-exposes-revenue-losses-corruption-in-zinara-operations/\">Parliamentary Committee report exposes revenue losses, corruption in ZINARA operations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "I am not a spy – Mliswa denies enticing Mzembi back to Zimbabwe, blames fallout with Kasukuwere",
            "url": "https://www.newzimbabwe.com/i-am-not-a-spy-mliswa-denies-enticing-mzembi-back-to-zimbabwe-blames-fallout-with-kasukuwere/",
            "content": "By Darlington Gatsi\n\nOUTSPOKEN politician Temba Mliswa has denied allegations of luring Walter Mzembi back to Zimbabwe for incarceration, claiming the former cabinet minister was living in fear after a fallout with exiled ex-ZANU PF commissar Saviour Kasukuwere.\n\nMzembi returned to Zimbabwe after seven years of exile and has been in pretrial detention for violating his 2018 bail conditions.\n\nAt the centre of his return and subsequent arrest was allegedly Mliswa, an accusation which he denies.\n\nThe Mzembi issue is an unfortunate exhibition of callous politicians conveniently altering facts and pseudo-journalists crafting an alternative reality for excitable masses to imbibe on. Its a total shame to accuse me or anyone of enticing him back. This was his own idea, said Mliswa in a social media post.\n\nMliswa said the return of Mzembi was of his own volition due to fear of Kasukuwere after a fallout.\n\nThe facts are verifiable. There was never any CIO operation because Mzembi approached me as he wanted to return. One major reason is that he had split with Kasukuwere. For more than a year and half they have never spoke. He felt unsafe which is why he moved from SA to Zambia!\n\nAll this talk about me selling him out is noonday hogwash. Im no spy and never worked for CIO. Characters like Ali Naka, are merely (social media) guns for hire operating as Sekuru Tysons instruments. Ali is working for his food and will peddle any nonsense he is fed.\n\nInstead, they should admit how Mzembi was pushed back here due to fear of Kasukuwere as he no longer felt safe. He crafted his own idea, approached me to facilitate engagements with the relevant powers. Which I did. What part of those actions constitutes enticing him back? said Mliswa.\n\nThe alleged fallout between Kasukuwere and Mzembi comes as a surprise, as the two had been as thick as thieves and worked together during the 2023 election season.\n\nNow languishing in prison, Mzembi is reportedly ill as he awaits the commencement of his trial.\n\nI have always advocated for the return of everyone in exile. For both times involving Mzembi and Kasukuwere in 2018 when approached I simply spoke with the powers that be and facilitated engagements between the parties. Whatever else they agreed or didnt, I was never part of!\n\nAccusations of betrayal are outright fabrications by individuals like Ali Naka who are mere marionettes in this charade. Mzembi is not a victim of anything I did but of that which compelled him to flee from SA. Whatever agreements they spoke about back here I was never part of, added Mliswa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Darlington Gatsi OUTSPOKEN politician Temba Mliswa has denied allegations of luring Walter Mzembi back to Zimbabwe for incarceration, claiming the former cabinet minister was living in fear after a fallout with exiled ex-ZANU PF commissar Saviour Kasukuwere. Mzembi returned to Zimbabwe after seven years of exile and has been in pretrial detention for violating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-am-not-a-spy-mliswa-denies-enticing-mzembi-back-to-zimbabwe-blames-fallout-with-kasukuwere/\">I am not a spy – Mliswa denies enticing Mzembi back to Zimbabwe, blames fallout with Kasukuwere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        },
        {
            "title": "When African digital transformation narratives meet truth-challenged prosperity",
            "url": "https://www.newzimbabwe.com/when-african-digital-transformation-narratives-meet-truth-challenged-prosperity/",
            "content": "By Andile Masuku, IOL\n\nA crypto entrepreneur posting as@goodalexanderon X recently offered some disconcertingobservationsabout powerful people and truth-telling. His cynical take  that Warren Buffetts folksy investment wisdom and Peter Thiels contrarian innovation insights might be theatrical misdirection  feels particularly relevant when applied to how we discuss Africas digital transformation.\n\nThese musings come alongside @goodalexanders promotion ofPost Fiat, a blockchain project that reimagines XRPs consensus mechanism with AI-driven validator selection. Whether his X handle reflects genuine identity or careful branding around good intentions, his scepticism about curated reality deserves journalistic scrutiny.\n\nSide-bar:XRP is a cryptocurrency created in 2012 by developers David Schwartz, Jed McCaleb, and Arthur Britto. Unlike Bitcoin, all 100 billion XRP tokens were created upfront, with most going to Ripple Labsthe company that helped develop it. XRP runs on its own blockchain designed for fast, cheap international payments, though Ripple doesnt actually own the network.\n\nEmpire fragments\n\nTheres something almost poetic about someone called Alexander critiquing the machinery of influence. The original Alexander (the Great) succeeded miserably at conquering the world, dying young after swiftly taking over vast territories that immediately fragmented. Perhaps our modern Alexanders insights about fabricated methodologies and post-truth economics carry similar warnings about the sustainability of narratives built on strategic misdirection.\n\nThis scepticism is a handy tool for weighing how we discuss Africas digital transformation. We celebrate mobile money penetration statistics while sidestepping questions about whose systems actuallypowerthis leapfrogging. We herald blockchain fixes for financial inclusion while rarelyexaminingwhether these primarily extract value to foreign tech conglomerates.\n\nPayment rails\n\nTake Zimbabwes EcoCash, operated by Econet Wireless. The platforms partnerships reveal the intricate web of global alliances that define modern African fintech.EcoCash Diaspora, a nifty product innovation that my family recently found handy for channelling financial lovegifts to my mother from all over the world following my fathers death, facilitates remittances from Zimbabweans abroad through partnerships with Shoprite, WorldRemit, M-Pesa, MTN and other international money transfer agents.\n\nMasterCardsinvolvementruns deeper than simple processing. The company has reportedly issued over 3 million MasterCard debit cards linked to EcoCash accounts, creating Zimbabwes largest EMV chip and PIN card rollout and allowing customers to withdraw money from MasterCard-licensed ATMs whilst paying for goods locally and internationally.\n\nThe same underlying infrastructure also supports newer market entrants like InDrive. The Russian ride-hailing platform, which operates on a haggling model where passengers name their price, accepts EcoCash and MasterCard payments for wallet top-ups. Even though the extent of MasterCards direct role in facilitating InDrives aggressive Zimbabwe expansion lacks detailed public documentation, the payment options clearly build on the existing EcoCash-MasterCard ecosystem that has already reduced barriers for international platforms seeking local market access.\n\nCurated realities\n\nThe arrangement illustrates @goodalexanders point about curated realities. From one angle, its a success story about African fintech systems driving financial inclusion. MasterCards 3 million debit cards represent the largest such rollout in Zimbabwes history, while EcoCash Diaspora processes an increasingly significant portion of total remittances into the country. From another, it demonstrates how global payment networks create pathways for foreign platform market penetration, with transaction fees and data flowing through multiple international intermediaries.\n\nEcoCash benefits from increased transaction volume, MasterCard collects processing fees, InDrive gains market access, and Zimbabwean consumers get cheaper rides, but the value capture primarily accrues outside the local economy.\n\nThis success story operates within the same structural constraints that necessitated its existence: currency volatility, limited formal banking penetration, and regulatory uncertainty that can see mobile money agents nabbed for facilitating transactions in ways that suddenly fall afoul of fiscal and monetary policy oversight.\n\nSimilar complexities emerge when examiningChinese involvementin African technology systems. Cameroons CamTel partnership with Huawei to expand 4G coverage across the country genuinely improved telecommunications access in underserved regions, connecting rural communities to digital services for the first time. Simultaneously, it embedded Chinese technology standards and created dependencies on Huaweis technical expertise and equipment supply chains.\n\nSteel cuts\n\nThe uncomfortable truth is that both narratives can be simultaneously accurate. Zimbabwes Manhize steel plant, a joint venture between Chinese firm Tsingshan and local partners, nowproducessteel that competes directly with South African manufacturers in regional markets. ArcelorMittal South Africa and other domestic producers haveraised concernsabout cheap Zimbabwean steel imports undermining their pricing structures and threatening local employment.\n\nZimbabwes steel industry revival, financed by Chinese capital and technology, potentially destabilises South Africas manufacturing base, even as Beijing emerges as the primary beneficiary of both countries steel consumption patterns.\n\nThese dualities extend beyond individual projects to systemic questions about agency and self-determination.\n\nWhen Lagos-based fintech companies integrate with international payment processors to serve African diaspora communities, theyre solving real problems while also channelling transaction fees to foreign financial infrastructure. When Sub-Saharan African AI researchers collaborate with European institutions onAI for good projects, theyre building local capacity while potentially training algorithms that offshore critical IP and analytical potential which primarily serve Global North applications.\n\nNarrative honesty\n\nIginio Gagliardone, professor of media studies at Wits University and inauguralSARChI SA-UK Bilateral Chair in Digital Humanities, speaks of using technology to reimagine more humane ways of interfacing with digital development, pointing toward something crucial: the need to centre historically marginalised forms of knowledge rather than simply adopting external approaches wholesale.\n\nYet heres where @goodalexanders cynicism about fabricated methodologies becomes most relevant. If powerful actors routinely say whatever serves their immediate objectives  whether thats attracting investment capital or maintaining market position  how do we distinguish between genuine transformation and sophisticated marketing?\n\nFirst-party data\n\n@goodalexanders observation about the only data worth anything being first-party study and collection becomes essential here. We cannot afford to rely on others curated interpretations of our own transformation. When I reflect on CamTels relationship with Huawei or analyse Zimbabwes retail sector challenges, the goal is to place progress within the full complexity of whats actually happening.\n\nThe question becomes whether were tellingcomplete storiesthat serve the next generations ability to make genuinely informed choices about their digital futures.\n\nThe Venn diagram where digital economy meets real economy exists precisely in this space of complexity. Digital banking thrives in markets where traditional banking failed, operating within the samestructural constraintsthat caused that failure. AI-powered systems promise efficiency gains whilstraising questionsabout whose intelligence is being optimised and toward what ends.\n\nPerhaps the most honest approach acknowledges that transformation narratives inevitably serve multiple audiences with different objectives. The challenge for those of us documenting these changes is to be transparent about whose interests our framing serves whilst resisting the temptation to oversimplify for the sake of compelling stories.\n\nCounter algorithm\n\nIf @goodalexander, whoever stands behind that handle, is correct about powerful peoples relationship with truth-telling, then our responsibility as journalists, or indeed quasi-journalists, becomes critical. Someone needs to document whats actually happening, rather than what various interested parties want us to believe is happening.\n\nThe algorithms of influence operate through narrative as much as code. Our counter-algorithm might simply be: radical honesty about complexity, even when complexity is less marketable than tantalising transformation myths.\n\nAndile Masuku is Co-founder and Executive Producer atAfrican Tech Roundup. Connect and engage with Andile onX(@MasukuAndile) and viaLinkedIn.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03142937/truth.png",
            "description": "<p>By Andile Masuku, IOL A crypto entrepreneur posting as @goodalexander on X recently offered some disconcerting observations about powerful people and truth-telling. His cynical take – that Warren Buffett’s folksy investment wisdom and Peter Thiel’s contrarian innovation insights might be theatrical misdirection – feels particularly relevant when applied to how we discuss Africa’s digital transformation. These musings come alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/when-african-digital-transformation-narratives-meet-truth-challenged-prosperity/\">When African digital transformation narratives meet truth-challenged prosperity</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "04 Sep 2025"
        }
    ]
}