{
    "news": [
        {
            "title": "JUST IN: Former CIO boss Isaac Moyo, Ministers Ncube, Sanyatwe delisted from UK sanctions list",
            "url": "https://www.newzimbabwe.com/just-in-former-cio-boss-isaac-moyo-ministers-ncube-sanyatwe-delisted-from-uk-sanctions-list/",
            "content": "By Staff Reporter\n\nTHE United Kingdom (UK) has removed former Central Intelligence Organisation (CIO) boss Isaac Moyo, police Commissioner General Godwin Matanga and former army commander Anselem Sanyatwe from its sanctions list.\n\nMinister of State for Midlands and former Minister of State Security, Owen Ncube and the Zimbabwe Defence Industries (ZDI) have also been removed from the list.\n\nAnnounced in a statement Tuesday, the four top officials and ZDI had been under sanctions for various human rights-related abuses.\n\nMoyo headed the dreaded CIO from 2017 until his exit earlier this year, taking charge of operations that included intimidation, abduction and assault of opposition politicians, human rights activists and journalists.\n\nNcube has been accused of being the godfather of mining gangs in the Midlands. He was fingered as the main man behind violent attacks that claimed the life of an opposition supporter in Kwekwe, in the run-up to the 2018 elections.\n\nThe UK announces the delisting of sanctions against individuals Owen Ncube, Isaac Moyo, Godwin Matanga, Anselem Sanyatwe, and the entity Zimbabwe Defence Industries (ZDI), reads a statement on the UK governments website.\n\nThe revocations follow a similar move from the European Union in February 2025, when they delisted their last remaining entity (ZDI) whilst renewing their existing Zimbabwe sanctions framework.The US also removed a number of designations in March 2024.\n\nZDI was listed by the UK soon after late President Robert Mugabe chucked out the European Union (EU) observer mission ahead of the 2002 elections.\n\nIt stood accused of providing arms used in the abuse of ordinary Zimbabweans.\n\nThe recent round of removals will be taken as a triumph for President Emmerson Mnangagwa, who has been on an overdrive courting the West.\n\nOver recent years, the EU, UK and America have eased restrictions on Zimbabweans and entities that had been fingered in corruption and human rights abuses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/18045457/Owen-Ncube-Minister-of-State-Security.jpg",
            "description": "<p>By Staff Reporter THE United Kingdom (UK) has removed former Central Intelligence Organisation (CIO) boss Isaac Moyo, police Commissioner General Godwin Matanga and former army commander Anselem Sanyatwe from its sanctions list. Minister of State for Midlands and former Minister of State Security, Owen Ncube and the Zimbabwe Defence Industries (ZDI) have also been removed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-former-cio-boss-isaac-moyo-ministers-ncube-sanyatwe-delisted-from-uk-sanctions-list/\">JUST IN: Former CIO boss Isaac Moyo, Ministers Ncube, Sanyatwe delisted from UK sanctions list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 May 2025"
        },
        {
            "title": "Public Accounts Committee “satisfied” with Treasury’s report on issues flagged by Auditor General",
            "url": "https://www.newzimbabwe.com/public-accounts-committee-satisfied-with-treasurys-report-on-issues-flagged-by-auditor-general/",
            "content": "By Anna Chibamu\n\nFINANCE Permanent Secretary George Guvamatanga finally appeared before the Public Accounts Committee last Friday and presented a report on the issues raised by the Auditor Generals report, which the legislators said they were satisfied with.\n\nPart of the findings of the AG report were that there had been a gross mishandling of public funds amounting to US$400 million by the Finance Ministry which was also bypassing ministries and agencies and making payments directly to suppliers,failure by private companies to supply vehiclesand Treasury minutes not being submitted to the committee.\n\nGuvamatanga who had been a no-show on several occasions had requestedthe Committee to give him more time to gather evidence.\n\nAccording to the PAC chairperson, Charlton Hwende, Guvamatangas oral evidence regarding the raised concerns fully satisfied the Committee members during the inquiry.\n\nWe just finished an inquiry with the Finance ministry led by the permanent secretary.\n\nWe received a report on those issues and I think the committee was satisfied that the appropriate response has been given, said Hwende.\n\nHe highlighted: We discussed the burning issue of suppliers that are getting government money and disappearing without supplying goods.\n\nThe secretary has committed that hes going to give us a whole list of every supplier that has received money from the government and has failed to supply, because thats criminal in our view.\n\nWe want to bring them we want to call every supplier to come here because most of them have realized that they receive government money and immediately use it where they receive it in zig, if the ministers follow up they start claiming that the money is lost value they can find us dollars but its a criminal enterprise.\n\nOf the direct payments made to TAPO Commercial Private Limited by the treasury, Guvamatanga explained:\n\nFinance Ministry went into an agreement on December 16, 2022, with TAPO Commercial Private Limited, for the command to supply serving Toyota Hi-Lax GT6 2.8-litre double-cab motor vehicles.\n\nThe ministry paid the US$25,866 to the contractor on December 30, 2022. Since 2021 to date, only four of the seven vehicles have been delivered, leaving three outstanding, Guvamatanga said.\n\nHe told PAC the company had made an undertaking to deliver the outstanding vehicles by the 2nd of July 2025.\n\nThe ministry has also returned to pass a request for the outcome of the debatement hearing to enable the initiation of federal protection against the supplier if they fail to deliver in July.\n\nAlso, the ministry has ensured that no prepayments are made to suppliers of vehicles before delivery.\n\nPayments are only made for vehicles that are already delivered.\n\nIn the event that the supplier is set to receive an advance payment, the ministry will ensure that a bank guarantee equivalent to the requested payment value is provided by a registered commercial bank, said the Finance secretary.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Anna Chibamu FINANCE Permanent Secretary George Guvamatanga finally appeared before the Public Accounts Committee last Friday and presented a report on the issues raised by the Auditor General’s report, which the legislators said they were satisfied with. Part of the findings of the AG report were that there had been a gross mishandling of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/public-accounts-committee-satisfied-with-treasurys-report-on-issues-flagged-by-auditor-general/\">Public Accounts Committee “satisfied” with Treasury’s report on issues flagged by Auditor General</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 May 2025"
        },
        {
            "title": "Unifreight bemoans Zimbabwe’s high operating costs",
            "url": "https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/",
            "content": "By Alois Vinga\n\nLISTED transport and logistics concern, Unifreight Africa Limited says the countrys tough economy added to high licensing fees is making operations very tough.\n\nIndustry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy are clogged with very costly, repetitive licensing fees, choking the ease of doing business.\n\nEchoing similar sentiments recently, Unifreights CEO, Richard Clarke, bemoaned the exorbitant licensing fees affecting transport sector players in the country.\n\nIn the transport sector specifically, operating costs in Zimbabwe are significantly higher than in neighbouring countries, which continues to squeeze margins. For example, fuel in Zimbabwe remains the most expensive in the region at around US$1,58 per litre, compared to about US$1,01 in Zambia. Vehicle registration and licensing fees are also exorbitantly high at roughly US$1,560 locally versus just US$132 in Zambia, he said.\n\nAdditionally, he said, diesel imports carry heavy duties (approx. USD 0.55 per litre)withexporters being forced to surrender 25% of foreign earnings for conversion into local currency (ZWG), which cannot be freely converted back to US$ at market rates.\n\nClarke said the combination of these challenges, added to currency volatility, liquidity constraints, inflationary pressures and a shortage of long-term financing in the local market, led many businesses to tighten their belts, creating a knock-on effect across supply chains.\n\nThe company said compounding cost pressures is the ongoing liquidity crunch in the banking sector prompting many financial institutions to pull back on lending, forcing companies, including Unifreight and our customers, to rely on shorter-term and more expensive financing.\n\nThese factors make operating a cross-border fleet out of Zimbabwe less attractive and more costly than regional competitors, Clarke said.\n\nMeanwhile, during the period, Unifreight Africa Limited delivered a strong start to 2025, with significant revenue growth in Q1.\n\nTotal revenues for the quarter surged by over 30% compared to the same period last year, reflecting robust demand and the success of recent strategic initiatives. Annual turnover rose from US$20.4 million in 2023 to US$24 million in 2024, and is forecast to reach US$32 million in 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03015012/Unifreight-Africa-which-operates-well-known-logistics-brands-including-Swift-Skynet-and-Bulwark-has-not-been-immune-to-these-challenges-Picture-Supplied.webp",
            "description": "<p>By Alois Vinga LISTED transport and logistics concern, Unifreight Africa Limited says the country’s tough economy added to high licensing fees is making operations very tough. Industry has since raised similar concerns with the government over the years, now with several promises to deal with the problem being made. Several value chains in the economy</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unifreight-bemoans-zimbabwes-high-operating-costs/\">Unifreight bemoans Zimbabwe’s high operating costs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 May 2025"
        },
        {
            "title": "Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/",
            "content": "IOL\n\nThe Polokwane Magistrates Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.\n\nLast week, Mashaba said Moyo was arrested during a joint operation comprising the SAPS anti-smuggling task team, Tshimollo Security and Investigation, Reflex Anti-hijacking Security, and Tracker SA.\n\nTheToyota RAV4was intercepted at approximately 8 pm (on Wednesday) near Shell Ultra City in Polokwane on the N1 highway, said Mashaba.\n\nZimbabwean man, Mhlalisi Moyo, was remanded in custody by the Polokwane Magistrates Court after he was arrested for possession of suspected stolen motor vehicle, a Toyota RAV4. Image: SAPS\n\nThe sport utility vehicle was reported stolen in Brooklyn, Tshwane.\n\nThe 43-year-old foreign national male was arrested at the scene, said Mashaba.\n\nOn Friday,IOL reported that the Mokopane Magistrates Court remanded 34-year-old Lucky Msizi Tshabanguin custody after he was arrested in Limpopo, while driving a stolen vehicle towards Zimbabwe.\n\nAt the time, Mashaba said the case against Tshabangu was postponed to Monday, enabling him to get legal representation.\n\nTshabangu is facing charges of possession of a suspected stolen motor vehicle, as well as reckless and negligent driving after he allegedly tried to flee from police.\n\nThe 34-year-old South African national was arrested at Mokopane last week, and police believe he was travelling to Zimbabwe with the stolen vehicle.\n\nLucky Msizi Tshabangu, 34, was remanded in custody after he was arrested in Limpopo, while allegedly driving a stolen Toyota Corolla Cross vehicle towards Zimbabwe. Image: SAPS\n\nIn an intelligence-driven operation, police officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101, which was en route to the Beitbridge port of entry, said Mashaba.\n\nInvestigations revealed that this vehicle had been reported stolen from the Wierdabrug policing area in Tshwane on Friday (16 May 2025).\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has praised the vigilance of all law enforcement units involved.\n\nThe recovery of these twelve vehicles represents a significant blow to this criminal networks. Our officers and their partners continue to work tirelessly to dismantle these syndicates that threaten our communities and economy, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27035716/Screenshot-2025-05-27-at-04.55.57.png",
            "description": "<p>IOL The Polokwane Magistrate’s Court has remanded 43-year-old Zimbabwean national Mhlalisi Moyo in custody after he was arrested in Limpopo for possession of a suspected stolen motor vehicle. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, said Moyo appeared in court on Friday, and his case was postponed to May 29 for formal bail application.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-arrested-in-limpopo-while-driving-toyota-rav4-stolen-in-pretoria/\">Zimbabwean man arrested in Limpopo while driving Toyota RAV4 stolen in Pretoria</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "27 May 2025"
        }
    ]
}