{
    "news": [
        {
            "title": "Mighty Warriors coach announces squad for WAFCON Qualifiers clash",
            "url": "https://www.newzimbabwe.com/mighty-warriors-coach-announces-squad-for-wafcon-qualifiers-clash/",
            "content": "By Sport Reporter\n\nMighty Warriors coach Sithetheliwe Kwinji 15 Sibanda has announced the final 23 players squad to represent the nation in the upcoming Womens Africa Cup Of Nations Qualifiers clash against Angola.\n\nZimbabwe is set to travel to Angola for a date against the Welwitschias in Luanda on February 20 before hosting them a week later at Lucas Moripe Stadium in South Africa.\n\nZimbabwe had a huge boost ahead of the clash as Israel-based striker Ruvimbo Mucherera joined camp on Sunday, strengthening Kwinjis squad.\n\nIf the Mighty Warriors beat Angola on aggregate after both legs, they will have a chance to play the winner between Malawi and Congo in the final qualifying match for the 2026 WAFCON to be held in Morroco.\n\nZimbabwe walks into this clash with a huge boost from the new ZIFA board assuring them of improved welfare for the side.\n\nFor the first time in history, the Mighty Warriors are being paid daily allowances during their stay in camp ahead of the upcoming clash.\n\nMIGHTY WARRIORS FINAL SQUAD\n\nG0ALKEEPERS\n\nVanessa Lunga\n\nPrecious Mudyiwa\n\nLindiwe Magwede\n\nDEFENDERS\n\nEgness Tumbare\n\nheila Antonio\n\nPurity Mugayi\n\nNobukhosi Ncbe\n\nAlice Moyo\n\nFortunate Ngocho\n\nMIDFIELDERS\n\nDaisy Kaitano\n\nMorelife Nyagumbo\n\nEnnetty Chemhere\n\nNatasha Ndowa\n\nDanai Bhobho\n\nEmmaculate Msipa\n\nMavis Chirandu\n\nShyline Dambamuromo\n\nSTRIKERS\n\nChristabel Katona\n\nRutendo Makore\n\nEthel Chinyerere\n\nYolanda Kanyai\n\nRuvimbo Mucherera\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05051611/mighty-warriora.jpeg",
            "description": "<p>By Sport Reporter Mighty Warriors coach Sithetheliwe “Kwinji 15” Sibanda has announced the final 23 players squad to represent the nation in the upcoming Women’s Africa Cup Of Nations Qualifiers clash against Angola. Zimbabwe is set to travel to Angola for a date against the Welwitschias in Luanda on February  20 before hosting them a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-coach-announces-squad-for-wafcon-qualifiers-clash/\">Mighty Warriors coach announces squad for WAFCON Qualifiers clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "24 killed in fatal accident involving Urban Connect bus and haulage truck",
            "url": "https://www.newzimbabwe.com/24-killed-in-fatal-accident-involving-urban-connect-bus-and-haulage-truck/",
            "content": "By Mary Taruvinga\n\nA total of 24 people died and over were 30 injured after an Urban Connect bus rammed into a truck near Lutumba tollgate along the Masvingo-Beitbridge highway Thursday morning.\n\nThe accident took place around 7am and the bus was Beitbridge bound.\n\nEyewitnesses said the bus driver was speeding and overtaking another vehicle when the bus got involved in a head-on collision with the truck.\n\n17 people died on the spot while seven others died upon admission at Beitbridge Hospital.\n\nBeitbridge District Medical Officer Lenos Samhere told State-controlled media that of those admitted, 12 were in critical condition.\n\nPolice spokesperson Paul Nyathi said they will be issuing a comprehensive statement soon.\n\nMore details to follow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13112930/urban-connect.jpeg",
            "description": "<p>By Mary Taruvinga A total of 24 people died and over were 30 injured after an Urban Connect bus rammed into a truck near Lutumba tollgate along the Masvingo-Beitbridge highway Thursday morning. The accident took place around 7am and the bus was Beitbridge bound. Eyewitnesses said the bus driver was speeding and overtaking another vehicle</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/24-killed-in-fatal-accident-involving-urban-connect-bus-and-haulage-truck/\">24 killed in fatal accident involving Urban Connect bus and haulage truck</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "Driving Innovation in Health, Social Care & Education",
            "url": "https://www.newzimbabwe.com/driving-innovation-in-health-social-care-education/",
            "content": "By Dr. Richard Dune\n\nFrom Theory To Reality: The Diffusion Of Innovations In Health, Social Care, And Education Sectors\n\nIn 2015, I reached a significant milestone in my career: completing my PhD on evaluating clinical decision support systems in NHS settings. This intellectually stimulating yet exhausting journey deepened my understanding of how new ideas take root or fail in healthcare.\n\nA decade later, my passion for innovation diffusion and adoption remains unwavering. With artificial intelligence (AI), digital transformation, and data-driven insights shaping the landscape, I am revisiting these themes with a renewed purpose: ensuring that innovation isnt just theoretical but actively drives positive change in health and social care.\n\nThis article explores how new ideas and technologies spread within the health, social care, and education sectors, the barriers that slow down adoption, and how we can accelerate impactful change.\n\nThe past decade has seen exponential advancements in AI, machine learning, and digital health solutions. Yet, many of these innovations fail to gain traction in healthcare, social care, and education services.\n\nFor example, clinical decision support systems (CDSS), which were groundbreaking at the time of my research, are still underutilised today despite overwhelming evidence that they reduce errors, improve patient outcomes, and enhance efficiency.\n\nOne of the most effective ways to answer this question is by using the Diffusion of Innovations (DOI) Theory, which explains how new ideas spread within an organisation or industry.\n\nKey factors influencing adoption include:\n\nUnderstanding these factors is critical for entrepreneurs, compliance professionals, and business leaders aiming to introduce new models, systems, or services in regulated sectors like CQC-regulated health and social care services or Ofsted-regulated education services.\n\nReflecting on my research and decades of experience working with NHS Trusts, GP practices, social care providers, and independent healthcare organisations, I have identified three recurring barriers to innovation:\n\nMany healthcare and social care providers operate in fragmented digital ecosystems. Systems often fail to communicate with each other, leading to inefficiencies in data-sharing, compliance, and service delivery.\n\nFor example:\n\nEven the most promising innovations fail to achieve full-scale adoption without seamless digital integration.\n\nTechnology developers often focus on functionality rather than how users in real-world settings will interact with a system. Many healthcare, social care, and education leaders have seen expensive, cutting-edge solutions fail because they did not align with frontline workflows.\n\nFor example:\n\nEnsuring that new systems are tailored to real-world users rather than designed in isolation is crucial.\n\nRegulatory requirements from bodies like CQC, Ofsted, MHRA, and NICE often lead to a risk-averse culture. Organisations hesitate to adopt new approaches because they are uncertain about compliance.\n\nWhile regulatory oversight is essential for safety and quality, it should not hinder technological progress. Organisations need clear guidance on how innovation can align with compliance rather than conflict with it.\n\nThe AI landscape has evolved dramatically since my early research. Today, AI tools like ChatGPT, machine learning analytics, and predictive modelling can revolutionise health and social care.\n\nHowever, AI adoption in regulated sectors must address key challenges:\n\nFor example, AI-powered compliance tools can significantly reduce the regulatory burden on healthcare managers, but they must be transparent, user-friendly, and aligned with existing governance frameworks.\n\nThe good news? Despite these challenges, I have seen extraordinary innovations emerge in health, social care, and education  many from small businesses, start-ups, and compliance leaders.\n\nKey takeaways for business owners, registered managers, and compliance professionals:\n\nBy following these principles, entrepreneurs, compliance specialists, and business leaders can drive impactful change in CQC-regulated health and social care services, Ofsted-regulated education, and beyond.\n\nAt LearnPac Systems, we recognised these challenges early on, which led to the development of ComplyPlus, a regulatory compliance management platform designed for healthcare, social care, and education providers. ComplyPlus also incorporates workforce development solutions, including learning and training management systems, learner assessment and certification, blended learning capabilities and reporting solutions.\n\nComplyPlus is built on the principles of integration, ease of use, and real-time regulatory alignment. It ensures that organisations can simplify compliance, improve governance, and foster innovation.\n\nLets make 2025 a year of bold, transformative health, social care, and education change.\n\nDr Richard Dune is the CEO of LearnPac Systems, a leading UK provider of edtech and compliance software solutions for regulated sectors. He specialises in governance, compliance, and innovation in both public and private sectors. He can be reached atdocduner@gmail.comor +44 24 7610 0090.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13101043/Dr-Richard-Dune-HSC-Innovation-Observatory-UK--scaled.jpeg",
            "description": "<p>By Dr. Richard Dune From Theory To Reality: The Diffusion Of Innovations In Health, Social Care, And Education Sectors In 2015, I reached a significant milestone in my career: completing my PhD on evaluating clinical decision support systems in NHS settings. This intellectually stimulating yet exhausting journey deepened my understanding of how new ideas take</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/driving-innovation-in-health-social-care-education/\">Driving Innovation in Health, Social Care & Education</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "Opposition lobbies for conversion of Harare Mayor Mafume’s Belvedere home into drug rehabilitation centre",
            "url": "https://www.newzimbabwe.com/opposition-lobbies-for-conversion-of-harare-mayor-mafumes-belvedere-home-into-drug-rehabilitation-centre/",
            "content": "By Staff Reporter\n\nAN opposition political outfit, Labour Economists and African Democrats (LEAD) has called for the conversion of the controversial property belonging to Harare Mayor Jacob Mafume into a drug rehabilitation centre.\n\nLEAD president, Linda Masarira this week wrote to retired Justice Maphios Cheda, Chairperson of the Commission of Inquiry into Harare Urban Planning and Governance outlining her case.\n\nShe proposes to convert Mafumes hostelinto a drug rehabilitation centre rather than have it demolished.\n\nI write to you as a concerned citizen and advocate for social justice, urging the commission to consider an alternative resolution regarding Mayor Jacob Mafumes unauthorised hostel in Belvedere, Masarira wrote.\n\nWhile I acknowledge the importance of upholding urban planning regulations, I propose that, rather than demolishing the structure, it be repurposed into a government-supported drug rehabilitation centre to address the growing substance abuse crisis in Zimbabwe.\n\nZimbabwe is currently facing a surge in drug and substance abuse, particularly among the youth.\n\nUnfortunately, there are very few rehabilitation centres available, and the existing ones are largely inaccessible to low-income individuals.\n\nThe LEAD president highlighted that the situation has led to increased crime, mental health issues, and the destruction of many young lives.\n\nShe argued that instead of demolishing an already-built structure, repurposing it as a rehabilitation centre would provide a cost-effective, socially beneficial, and restorative solution.\n\nReasons supporting her proposal were also contained in the letter she submitted to the commission on Wednesday.\n\nAmong the justifications was that the centre would help ameliorate the effects of drugs and substance misuse scourge.\n\nThis facility could provide detoxification, counselling, mental health support, and vocational training to help reintegrate affected individuals into society.\n\nCost-effective utilisation of resources. Instead of spending resources on demolition, the government and private partners could invest in refurbishing the structure for public benefit.\n\nPublic-Private Partnerships for Sustainability. This initiative could be jointly managed by the Ministry of Health and Child Care, NGOs, faith-based organisations, and private sector partners specialising in addiction recovery, Masarira noted.\n\nFurther LEAD says the move provides social justice and restorative measures among the public.\n\nMany young people battling drug addiction end up incarcerated rather than rehabilitated. Establishing a dedicated rehabilitation centre would provide treatment, skills training, and support for reintegration into society.\n\nThe opposition party says the initiative aligns with national and global health strategies to combat drugs and substance misuse.\n\nThis initiative would align with Zimbabwes National Drug Master Plan and international best practices that prioritize rehabilitation over punitive measures. I respectfully urge the commission to assess the feasibility of this proposal before proceeding with demolition, Masarira pleaded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/07073434/Linda-Masarira.jpg",
            "description": "<p>By Staff Reporter AN opposition political outfit, Labour Economists and African Democrats (LEAD) has called for the conversion of the controversial property belonging to Harare Mayor Jacob Mafume into a drug rehabilitation centre. LEAD president, Linda Masarira this week wrote to retired Justice Maphios Cheda, Chairperson of the Commission of Inquiry into Harare Urban Planning</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-lobbies-for-conversion-of-harare-mayor-mafumes-belvedere-home-into-drug-rehabilitation-centre/\">Opposition lobbies for conversion of Harare Mayor Mafume’s Belvedere home into drug rehabilitation centre</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "Exchange rate volatility, monetary policy impacting trade – Hippo Valley",
            "url": "https://www.newzimbabwe.com/exchange-rate-volatility-monetary-policy-impacting-trade-hippo-valley/",
            "content": "By Alois Vinga\n\nHIPPO Valley Estates Limited (HVEL) has bemoaned exchange rate volatility and monetary policies for creating a very tough operating environment choking trade.\n\nLast year, the Reserve Bank of Zimbabwe (RBZ) introduced the ZWG currency as the countrys lasting solution to decades-long economic turmoil before the local unit began to face inflationary turmoil just after about six months from inception.\n\nIn response to the instability, the central bank unveiled a cocktail of measures, which include increasing the bank policy rate and maintaining tight liquidity among other interventions.\n\nBut presenting a trading update for the third quarter period ended December 31 2024, HVEL said the business environment has remained tough.\n\nThe business environment remains challenging on the back of inflationary pressures, exchange rate volatility with ZWG currency devalued by 45% at the end of the last quarter, tightening the money supply and currency mix dilemma between the ZWG and US. The official exchange rate between the ZWG and currency and US$1:ZWG ZWG 13,56 at the beginning of the year and this eventually closed the third quarter on 31nDecember 2024 at US$1: ZWG27,09, said the company.\n\nPolicy measures pronounced during the same period to support the stability of the domestic currency, among other measures introduced at the onset to curb macro-economic deficiencies, including raising statutory reserve requirements and increasing the bank policy rate.\n\nThese complexities have continued to place immense pressure on the Companys profit margins, narrowing the capacity to retool the business and fuelling the companys foreign currency pressures due to working capital required for critical import type goods and services, cane supply and manpower costs which are largely priced in US$ from normal sales, HVEL said.\n\nMeanwhile, the companys revenue for the period increased by 16% from the prior year same period, driven by a strong recovery of local market sales volumes where higher price realisations are generated and the deliberate prioritization of the local market in place of the lower priced exports which saw a 53% volume decrease.\n\nThe increase in the cost of doing business which largely relates to cane purchases and manpower costs, squeezed profit margins resulting in the need to refine its operational strategies and implement sustainable cost containment plans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/09073842/Hippo-Valley.jpg",
            "description": "<p>By Alois Vinga HIPPO Valley Estates Limited (HVEL) has bemoaned exchange rate volatility and monetary policies for creating a very tough operating environment choking trade. Last year, the Reserve Bank of Zimbabwe (RBZ) introduced the ZWG currency as the country’s lasting solution to decades-long economic turmoil before the local unit began to face inflationary turmoil</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/exchange-rate-volatility-monetary-policy-impacting-trade-hippo-valley/\">Exchange rate volatility, monetary policy impacting trade – Hippo Valley</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "R. Kelly’s sex trafficking conviction upheld",
            "url": "https://www.newzimbabwe.com/r-kellys-sex-trafficking-conviction-upheld/",
            "content": "A federal appeals court on Wednesday upheld R. Kellys sex trafficking and racketeering conviction, saying extensive evidence supported keeping the former R&B superstar behind bars for decades.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29105643/R-Kelly.png",
            "description": "<p>Reuters A federal appeals court on Wednesday upheld R. Kelly’s sex trafficking and racketeering conviction, saying extensive evidence supported keeping the former R&B superstar behind bars for decades. The 2nd U.S. Circuit Court of Appeals in Manhattan rejected Kelly’s claims that federal prosecutors failed to prove he led a racketeering scheme where he recruited women</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/r-kellys-sex-trafficking-conviction-upheld/\">R. Kelly’s sex trafficking conviction upheld</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "Implats production falls as challenges mount in PGM market",
            "url": "https://www.newzimbabwe.com/implats-production-falls-as-challenges-mount-in-pgm-market/",
            "content": "Business Report\n\nImpala Platinums (Implats) production for the six months to December 2024 fell 4% to 1.8 million 6E ounces while its expects earnings for the interim period are expected to plunge despite sales volumes increasing by 5%, on the back of lower capital expenditures and expectations of a less rosy platinum group metals (PGM) outlook.\n\nImplats toldBusiness Reportlast month that it expected the PGM market to remain challenging over the near term.\n\nPGM miners are battling sustained weakness in prices of the commodity, prompting many of them to institute cost rationalisation that has included retrenchments and capital expenditure cuts.\n\nDespite restructuring operations and instituting retrenchments, interim group unit costs per 6E ounce for Implats are expected to increase by 3% to R20 900 on a stock-adjusted basis.\n\nAdditionally, moderating input inflation and labour savings were bolstered by rand appreciation on the translated dollar cost base of Zimplats in Zimbabwe and Impala Canada, said the company on Tuesday.\n\nImplats headline earnings and headline earnings per share for the half year to December are expected to be lower by between 40% and 49% at between R1.65 billion and R1.95bn, and between 184 cents and 217 cents per share, respectively.\n\nHeadline earnings for the period decreased primarily due to lower rand revenue arising from an 8% retracement in achieved rand revenue per 6E ounce sold, Implats said in a trading update Tuesday.\n\nLower dollar pricing was compounded by the strengthening rand exchange rate, which more than offset the benefit of improved refined and saleable output, higher sales volumes and strong cost controls achieved in the period.\n\nThe lower earnings performance of the company for the period comes against the backdrop of a fall in capital expenditure. It said that the commissioning of various projects during the half-year meant capital expenditure fell to R4bn due to lower levels of growth and replacement capital as projects neared completion.\n\nEarnings before interest, tax, depreciation and amortisation for the half year amounted to R6.5bn.\n\nOur expectation is that the physical market will improve further over time with an improved macro outlook, ongoing supply responses and a more pragmatic auto electrification outlook, Johan Theron, spokesperson for Implats toldBusiness Reportby email recently.\n\nHowever, the near term could remain bumpy for some time.\n\nIn terms of production, Implats output fell 4% to 1.82 million 6E ounces. Impala Rustenburg increased production by 2% to 687 000 stock-adjusted 6E ounces while Impala Bafokeng production amounted to 254 000 6E ounces in concentrate, benefiting from improved efficiencies at Styldrift.\n\nProduction from Marula remained challenged by constrained mining flexibility and organisational restructuring implemented in the period, with 6E concentrate production declining 10% to 101 000 ounces.\n\nThe Zimbabwean unit of Implats, Zimplats, saw its 6E production in matte decrease by 15% to 280 000 ounces. This has been attributed to accumulation of concentrates during the commissioning of the expanded smelter complex at Selous.\n\nAt Impala Canada, 6E concentrate volumes reduced by 20% weaker to 116 000 ounces, reflecting revised operating parameters and lower underground grade for the company.\n\nWhile Two Rivers recorded a 1% increase in 6E in concentrate production to 153 000 ounces, the companys Mimosa JV with Sibanye-Stillwater in Zimbabwe raised 6E in concentrate volumes for the period by 3% to 129 000 ounces, despite challenges presented by power outages that are hobbling producers in the country.\n\nImplats ended the half year period under review with excess inventory of about 375 000 6E ounces although sales volumes quickened 5% to 1.77 million 6E ounces. This was inclusive of saleable production from Impala Canada and Impala Bafokeng.\n\nThe softer US dollar basket pricing was compounded by appreciation in the rand exchange rate and group sales revenue decreased to circa R23 800 per 6E ounce sold, explained the company.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13045621/Implats-told-Business-Report-last-month-that-it-expected-the-PGM-market-to-remain-challenging-over-the-near-term-Picture-Supplied.webp",
            "description": "<p>Business Report Impala Platinum’s (Implats) production for the six months to December 2024 fell 4% to 1.8 million 6E ounces while its expects earnings for the interim period are expected to plunge despite sales volumes increasing by 5%, on the back of lower capital expenditures and expectations of a less rosy platinum group metals (PGM)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/implats-production-falls-as-challenges-mount-in-pgm-market/\">Implats production falls as challenges mount in PGM market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Forced Rehabilitation for Drug Offenders in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-forced-rehabilitation-for-drug-offenders-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss what parents or guardians can do when faced with children on drugs who require rehabilitation. What are the general requirements to qualify for rehabilitation?\n\nVM: Thank you\n\nIt is necessary to start by stating that rehabilitation comes in two forms, voluntary or involuntary. Though voluntary rehabilitation is uncommon because it presupposes that the drug user has accepted he or she has a problem he or she wants to solve, which is normally halfway down the road to recovery, it also makes the process easier for the guardians or family members and the drug user to ensure he is placed in rehabilitation.\n\nThe common position is the drug user will be in denial of the fact that they may need rehabilitation. The drug user, in most instances, does not think that they have a drug problem.\n\nSecondly, the requirements differ for 25-year-old drug users who are legally independent and children below the age of majority.\n\nReporter:You are correct to raise those points, let us start with the qualification for rehabilitation for adults or 25-year-old children.\n\nVM: The test to qualify for rehabilitation as an adult drug offender, is the same test that is used for mental disorder. The drug user must pose a danger to themselves and/ or others or that they have lost complete ability to take care of themselves due to a psychological impairment. This may be exhibited by a complete failure to maintain hygiene, eat or even worse, suicidal thoughts.\n\nThe common thing however is that these drug offenders normally start committing petty crimes, especially in the home. Parents hardly report these because they recognize that their child is under some form of sickness.\n\nThe alternative is that the petty crimes are reported to the police creating a criminal record, this criminal route is available for inebriates who have committed offences as a result of habitual intoxication. The courts may view this history of crimes committed as a result of intoxication and order rehabilitation.\n\nReporter: Should a guardian or family be of the mind that the drug user qualifies for rehabilitation, what can they do?\n\nVM: It is critical to understand that our constitution guarantees every persons freedom and that the freedom should not be arbitrarily taken from them. It follows therefore that the rehabilitation process must be sanctioned by the courts who weigh whether it is just to place the drug user in rehabilitation.\n\nAn order to place a person in forced rehabilitation is issued by a Magistrate who considers, among other alternatives, whether a person should be placed in forced rehabilitation after reviewing medical certification from two practitioners, one of whom must be a psychiatrist or government medical officer.\n\nThe Magistrate also considers whether the medical evidence meets the statutory threshold of mental disorder and imposes measures that are commensurate with the action imposed.\n\nReporter: What if the drug user/addict is causing harm to himself, is there another quicker option to rehabilitation that is not through criminal courts?\n\nVM: Our law permits emergency detention for 72 hours on the basis of a single medical practitioners certification where there is imminent harm to the patient. The medical practitioner will be required to present a report to the Magistrate within 24 hours for the Magistrate to decide whether the detention can be extended via a reception order.\n\nA failure to obtain the authority from the Magistrate within 72 hours renders the detention unlawful and the drug user qualifies for immediate release.\n\nReporter: Does the same apply to child offenders?\n\nVM: With children, guardians must demonstrate that the rehabilitation is necessary, in the best interest of the child and is the least restrictive on the child by giving examples of prior interventions.\n\nThe opinion of the child matters, especially those above 16, their opinions are considered. The starting point is the wariness of the judiciary to separate the child from its environment of love and care. The proposed rehabilitation is not supposed to disturb a stable environment, the educational needs of the childet cetera.\n\nThe main difference between adult forced rehabilitation and that for children is that the guardian or parent plays a critical role in determining whether forced rehabilitation should occur\n\nReporter: Thank you, Mr. Madzima we have to end here, because of our time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor atwww.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/15161941/Drug-Use-e1623770429846.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.  Reporter: Welcome back Mr. Madzima, this week we want to discuss what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-forced-rehabilitation-for-drug-offenders-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Forced Rehabilitation for Drug Offenders in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "In default for 25 years, Zimbabwe struggles to feed its citizens",
            "url": "https://www.newzimbabwe.com/in-default-for-25-years-zimbabwe-struggles-to-feed-its-citizens/",
            "content": "Bloomberg\n\nNow, as the country struggles with the impact of a once-in-a-generation drought, ordinary Zimbabweans are paying the price.\n\nA prolonged hot and dry spell caused by the El Nio weather phenomenon has ravaged southern Africa, withering crops and leaving 26 million people across seven nations hungry, according to the United Nations World Food Programme.\n\nZimbabwehas been hardest hit, withthe corn cropfallingby more than two-thirds from previous years. The WFP anticipates that about 7.6 million people will need help accessing food between now and May.\n\nWe couldnt harvest anything from our field. Even the melons failed to grow, Bekezela Dube, a 32-year-old mother of four, told United Nations Assistant Secretary-General for Climate, Reena Ghelani, on a visit to the remote rural area of Maphisa.After more than two decades of economic turmoil, many Zimbabweans cant affordimported food. And fatigue has set in among humanitarian donors.\n\nThat leaves multilateral lenders and development finance institutions as the countrys best hope for feeding roughly half its population. Yet unlike other countries including neighboring Zambia, which has already received $1 billionfrom the World Bankand the International Monetary Fund to replenish its food supplies and hydropower-dependent energy system Zimbabwe is locked out of adding to its debt.\n\nZimbabwes creditors include the World Bank, the African Development Bank, the European Investment Bank and the Paris Club, all of which have declined to provide emergency funds. The IMF said it is bound by rules that preclude it from making loans to a country already in default to related organizations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/13044443/maize-drought.jpeg",
            "description": "<p>Bloomberg Over the last quarter century, Zimbabwe has failed to pay $21 billion in debt. Now, as the country struggles with the impact of a once-in-a-generation drought, ordinary Zimbabweans are paying the price. A prolonged hot and dry spell caused by the El Niño weather phenomenon has ravaged southern Africa, withering crops and leaving 26</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-default-for-25-years-zimbabwe-struggles-to-feed-its-citizens/\">In default for 25 years, Zimbabwe struggles to feed its citizens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        },
        {
            "title": "U.S funding cuts threaten HIV prevention efforts in Zimbabwe as truck-stop clinics suspend operations – Parliament urges govt to look for alternative support models",
            "url": "https://www.newzimbabwe.com/u-s-funding-cuts-threaten-hiv-prevention-efforts-in-zimbabwe-as-truck-stop-clinics-suspend-operations-parliament-urges-govt-to-look-for-alternative-support-models/",
            "content": "By Thandiwe Garusa\n\nTHE temporary closure of truck-stop clinics across Zimbabwe, following a recent cessation of USAID funding has raised alarm over a potential surge in HIV cases among high-risk populations, particularly long-distance truck drivers and sex workers.\n\nThese clinics have played a vital role in providing HIV prevention, testing, and treatment services in border towns and high-traffic areas.\n\nHowever, they have been temporarily closed due to the implementation of U.S. President Donald Trumps America First policy.\n\nSpeaking in a parliamentary session Tuesday, Member of Parliament for Hwange West Vusumuzi Moyo urged the Ministry of Health to take immediate action and look for alternative funding sources to ensure vulnerable communities continue to receive the necessary support in the fight against HIV/AIDS.\n\nWithout funding for laboratory tests, HIV counselling and antiretroviral medications, many truck drivers and sex workers who rely on these clinics may not have access to crucial HIV-related healthcare services. In turn, this could result in an increase in undiagnosed HIV cases and the lack of consistency of the ART adherence, both of which contribute to higher transmission rates, he said.\n\nWith funding cuts, the sustainability of these services is at risk and the impact could be felt in high HIV prevalence, decreased access to care and return to higher transmission rates.\n\nTo mitigate these effects, it is essential to explore and implore the Ministry of Health to seek alternative funding models and to strengthen our local healthcare system to ensure that the vulnerable population continues to receive the support they need in the fight against HIV/AIDS.\n\nMeanwhile, Population Solutions for Health (PSH) New Start Centres have temporarily halted services for patients on ART and those seeking PrEP refills.\n\nApproximately 1.2 million Zimbabweans benefit from the U.S Presidents Emergency Plan for AIDS Relief (PEPFAR), and over 1,600 public hospitals and clinics have received training and technical support from the US government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/12194913/truck-stop-clinic.webp",
            "description": "<p>By Thandiwe Garusa THE temporary closure of truck-stop clinics across Zimbabwe, following a recent cessation of USAID funding has raised alarm over a potential surge in HIV cases among high-risk populations, particularly long-distance truck drivers and sex workers. These clinics have played a vital role in providing HIV prevention, testing, and treatment services in border</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-funding-cuts-threaten-hiv-prevention-efforts-in-zimbabwe-as-truck-stop-clinics-suspend-operations-parliament-urges-govt-to-look-for-alternative-support-models/\">U.S funding cuts threaten HIV prevention efforts in Zimbabwe as truck-stop clinics suspend operations – Parliament urges govt to look for alternative support models</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:35",
            "date": "13 Feb 2025"
        }
    ]
}