{
    "news": [
        {
            "title": "SADC urged to reassess trade ties amid U.S. trade tariffs: official",
            "url": "https://www.newzimbabwe.com/sadc-urged-to-reassess-trade-ties-amid-u-s-trade-tariffs-official/",
            "content": "Xinhua\n\nThe Southern African Development Community (SADC) should reassess its trade partnerships to maximize benefits in the face of rising U.S. trade tariffs and the withdrawal of traditional development support, a senior official said Thursday.\n\nSpeaking at the 34th Meeting of the Committee of Ministers of Trade and the 24th Meeting of the Ministerial Task Force on Regional Economic Integration in Harare, Zimbabwes capital, SADC Executive Secretary Elias Magosi said the changing global tariff landscape had redefined trade dynamics, prompting the region to adopt pragmatic and strategic responses.\n\nWe must shape and determine our destiny going forward and swiftly attain robust negotiation skills that enable us to define trade and related aspects on our terms and for our benefit, Magosi said.\n\nHe noted that most SADC member states that previously benefited from the African Growth and Opportunity Act (AGOA), a U.S. trade program granting duty-free access to African countries, stand to lose significantly following the blanket 10 percent tariff the United States is considering imposing on all imported goods.\n\nFurther, the uncertainty over whether AGOA will be renewed this September compounds the existing challenge. I firmly believe that these recent geopolitical developments should serve as a powerful wake-up call for our region, a call for us to unite, cooperate, and integrate more, he said.\n\nMagosi expressed deep concern over low inter-regional trade within SADC, which stands at 18 percent, despite the establishment of the SADC Free Trade Area (FTA) in 2008.\n\nThe full implementation of the SADC FTA by all SADC member states remains critical in ensuring enhanced market access, leveraging on the gains from trade to grow our economies, Magosi said.\n\nThe SADC is a 16-member regional bloc, comprising Angola, Botswana, the Comoros, the Democratic Republic of the Congo, Eswatini, Lesotho, Madagascar, Malawi, Mauritius, Mozambique, Namibia, Seychelles, South Africa, Tanzania, Zambia, and Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/01065949/Elias-Magosi-SADC-Executive-Secretary.jpg",
            "description": "<p>Xinhua The Southern African Development Community (SADC) should reassess its trade partnerships to maximize benefits in the face of rising U.S. trade tariffs and the withdrawal of traditional development support, a senior official said Thursday. Speaking at the 34th Meeting of the Committee of Ministers of Trade and the 24th Meeting of the Ministerial Task</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-urged-to-reassess-trade-ties-amid-u-s-trade-tariffs-official/\">SADC urged to reassess trade ties amid U.S. trade tariffs: official</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        },
        {
            "title": "False start to a murky deal – Mnangagwa backs controversial Geo Pomona Waste Management as refuse piles up in Harare",
            "url": "https://www.newzimbabwe.com/false-start-to-a-murky-deal-mnangagwa-backs-controversial-geo-pomona-waste-management-as-refuse-piles-up-in-harare/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwa has said the controversial takeover of waste management by Geo Pomona in Harare will enhance the sector, an area in which the City Council had failed.\n\nMnangagwa made the remarks in Harare, Thursday while commissioning the waste sorting plant and refuse collection trucks at the Geo Pomona Waste Management facility.\n\nThe commissioning of the sorting plant, 45 refuse trucks, and 100 skip bins comes amid uproar from residents associations over Geo Pomonas takeover of waste collection, which will cost Harare City Council millions of dollars.\n\nResidents have questioned the opaque tripartite agreement between Geo Pomona, the Harare City Council, and the Ministry of Local Government, arguing that the arrangement was made with no prior consultation.\n\nHowever, Mnangagwa, in his address, insisted that Geo Pomona would improve waste collection in the capital.\n\nTo date, the waste collection crisis, particularly in the capital city of Harare, has had dire consequences, ranging from environmental degradation to public health risks, among other negative impacts. We have seen outbreaks of diseasesa situation that is wholly unacceptable. Such conditions must become a thing of the past.\n\nTherefore, in line with Vision 2030, my Government continues to prioritise the creation of clean, safe, and modern urban environments, which are engines of economic growth. Cleanliness and the efficient management of service delivery are not just indicators of good governance but also essential benchmarks for a nations competitiveness, said Mnangagwa.\n\nGeo Pomona, which was tasked with refuse collection earlier this year in an arrangement spearheaded by the Minister of Local Government, Daniel Garwe, is yet to fully fulfil its mandate.\n\nPiles of uncollected refuse in residential areas remain a sore sight months after the companys takeover.\n\nThis has angered residents, who have cast doubt on the impact of Geo Pomonas operations, despite the governments prior praise for the waste management initiative.\n\nFurther fuelling residents frustration is the US$40 per tonne that the City Council will pay Geo Pomona for waste disposal. The company is expected to collect 650 tonnes daily once operations are in full swing.\n\nPresident Mnangagwa said the Harare model should be replicated in other local authorities.\n\nThrough the purchase of this equipment, we must see the waste management system being capacitated to efficiently and consistently collect waste across all parts of Harare.\n\nI urge sector players in other towns and cities to take a leaf from such initiatives towards improving waste management in our country, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210357/mnangagwa-geo-pomona.jpeg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa has said the controversial takeover of waste management by Geo Pomona in Harare will enhance the sector, an area in which the City Council had failed. Mnangagwa made the remarks in Harare, Thursday while commissioning the waste sorting plant and refuse collection trucks at the Geo Pomona Waste Management</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/false-start-to-a-murky-deal-mnangagwa-backs-controversial-geo-pomona-waste-management-as-refuse-piles-up-in-harare/\">False start to a murky deal – Mnangagwa backs controversial Geo Pomona Waste Management as refuse piles up in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        },
        {
            "title": "It’s not all about winning – Warriors coach unfazed by Burkina Faso friendly",
            "url": "https://www.newzimbabwe.com/its-not-all-about-winning-warriors-coach-unfazed-by-burkina-faso-friendly/",
            "content": "By Sports Reporter\n\nWarriors coach Michael Nees is not focusing on winning Fridays friendly match against Burkina Faso, which is set to be played at Stade El Bachir Mohammdia stadium in Morocco.\n\nFridays match is one of the two friendlies that Zimbabwe is set to play during the ongoing June FIFA international break, the other isa clash against Niger scheduled for next Tuesday.\n\nMichael Nees dropped a number of regular senior players for the two matches, including captain Marvellous Nakamba and his vice, Marshall Munetsi.\n\nThe German tactician is using Burkina Faso and Niger friendlies to asses several players who are enjoying their first national team call up under his tutelage.\n\nThe team is looking good and ready. If you check our team, it has a lot of new players, so there will be new faces on the starting eleven.\n\nIts not all about winning, we must gradually improve our performance, thats the best expectation for a good result, said Nees.\n\nAmong the new players that Nees has called up for the first time are goalkeeper Elvis Chipezeze, who is based in South Africa, forward Bill Antonio, who is playing in Belgium and Tinotenda Kadewere from the French Ligue 1.\n\nWe have to respect the opponent, theyre a little bit higher ranked than us in the FIFA ranking. Its a good side, theyre also qualified for the AFCON, they are in second position in their World Cup group, they have some very good players, added Nees.\n\nBurkina Faso is currently ranked 64th on FIFA standings, while Zimbabwe is sitting on 116.\n\nHead to head, Zimbabwe and Burkina Faso have played four games, the Warriors dominating with two wins, Les Etalons one and the other ended as a draw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/17045132/Michael-Nees.jpg",
            "description": "<p>By Sports Reporter Warriors coach Michael Nees is not focusing on winning Friday’s friendly match against Burkina Faso, which is set to be played at Stade El Bachir Mohammédia stadium in Morocco. Friday’s match is one of the two friendlies that Zimbabwe is set to play during the ongoing June FIFA international break, the other</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-not-all-about-winning-warriors-coach-unfazed-by-burkina-faso-friendly/\">It’s not all about winning – Warriors coach unfazed by Burkina Faso friendly</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        },
        {
            "title": "What migrant care workers from Zimbabwe sacrifice for their children’s futures",
            "url": "https://www.newzimbabwe.com/what-migrant-care-workers-from-zimbabwe-sacrifice-for-their-childrens-futures/",
            "content": "Daily Maverick\n\nRuby is a 30-year-old mother of three, and shes ready to do whatever it takes to give her kids a better life. Even if it means leaving her family in Zimbabwe to become a live-in care worker in the UK.\n\nNow, halfway across the world from everyone she loves, Ruby works round the clock to make enough money to bring her family together again.\n\nBeing a live-in care worker for seniors in the UK is hard work. It involves lifting people in and out of bed all day, feeding them and sometimes changing their diapers. All that while keeping on top of their housework too.\n\nFor Ruby, a 30-year-old mother of three from Zimbabwe, this wasnt her dream job, but that didnt matter. She was determined to give her kids a better life. So she sacrificed her career as a teacher and left her kids back home in Zimbabwe to become a care worker in the UK.\n\nRuby wont let anything stand in the way of getting her kids and husband to England, where they can receive free education and healthcare, things she doesnt have in Zimbabwe. But therealquestion is: Can Ruby sustain the punishing routine long enough to pull it off?\n\nGreener Pastures, a podcast episode byRadio Workshop, captures the highs and lows of Rubys mission: the intimate relationship she built with her client, the joy of her husbands first day of work in the UK and the madness of working opposite shifts. And not least, Rubys momentous trip home to get the kids.\n\nWhen Ruby arrived in the UK in January 2024, she quickly learnt that the real England is far from the romanticised version people have back home.\n\nWhile not exactly the greener pastures she expected, her visa offered her the opportunity to earn pounds. After struggling to support her family on a teachers salary in Zimbabwe, that meant everything to her.\n\nRubys first job involved providing round-the-clock care to a woman in her nineties. She was paid to work eight hours a day, but it was a 24-hour job. She says sometimes shed call her friends just to cry.\n\nBut Ruby says she was lucky. The woman she was caring for was kind and did everything she could to make Ruby feel at home. Not like the horror stories Ruby heard from colleagues about being spat on by racist clients.\n\nBut arguably, the biggest challenge will begin with the start of their family life in the UK. Ruby explained: In a year or two, [the kids are] going to be different people. But, I am there to remind them of their roots.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05084906/DM-HEADERradiolab.webp",
            "description": "<p>Daily Maverick Ruby is a 30-year-old mother of three, and she’s ready to do whatever it takes to give her kids a better life. Even if it means leaving her family in Zimbabwe to become a live-in care worker in the UK. Now, halfway across the world from everyone she loves, Ruby works round the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/what-migrant-care-workers-from-zimbabwe-sacrifice-for-their-childrens-futures/\">What migrant care workers from Zimbabwe sacrifice for their children’s futures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        },
        {
            "title": "Musk says Trump would have lost 2024 election without him as ‘Big, Beautiful Bill’ feud continues",
            "url": "https://www.newzimbabwe.com/musk-says-trump-would-have-lost-2024-election-without-him-as-big-beautiful-bill-feud-continues/",
            "content": "Fox News\n\nElon Musk and President Donald Trumps feud about the Big, Beautiful Bill continued on Thursday when the tech billionaire responded to the presidents criticism in a post on X.\n\nWithout me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate. Such ingratitude, Musk wrote in a post responding to Trumps remarks about him.\n\nWhile speaking with reporters in the Oval Office, Trump said that he was very disappointed by Musks vocal criticisms of the bill. The president claimed that Musk knew what was in the bill and had no problem with it until the EV incentives had to be cut.\n\nIm very disappointed because Elon knew the inner workings of this bill better than almost anybody sitting here, better than you people. He knew everything about it. He had no problem with it, Trump said. All of a sudden, he had a problem. And he only developed the problem when he found out that were going to have to cut the EV mandate.\n\nMusk pushed back on the presidents claim in another post on X and said that this bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\n\nThe Tesla founder has been a vocal critic of the Trump administration and Republicans over the last few days because of the legislation that the president has pushed. Musk has taken to calling it the Big Ugly Bill and at one point advocated for a Slim, Beautiful Bill.\n\nEarlier on Thursday, Musk highlighted Trumps old posts that seemingly align with the tech billionaires current positions and objections to the Big, Beautiful Bill.\n\nTrump turned to social media on Thursday afternoon to criticize Musk, who he appointed to find ways to cut $2 trillion after forming the Department of Government Efficiency (DOGE).\n\nElon was wearing thin, I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went CRAZY! Trump said in one post.\n\nThe easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elons Governmental Subsidies and Contracts. I was always surprised that Biden didnt do it! he wrote in another.\n\nMusk has also faced criticism from House Speaker Mike Johnson, who said on Wednesday that he was surprised by the former DOGE leaders objections to the legislation. The Republican lawmaker said that he and Musk, whom he considers a friend, had a great conversation about the bill on Monday. Johnson told reporters on Wednesday that Musk was flat wrong about the legislation.\n\nMeanwhile, there are several Republicans who have expressed solidarity with Musk, including Rep. Thomas Massie, R-Ky., Sen. Rand Paul, R-Ky., and Sen. Mike Lee, R-Utah. Additionally, Sen. John Kennedy, R-La., said that Musk was right to be concerned that Americans are quickly becoming debt slaves.\n\nNow that the bill has passed the house, its up to the Senate to meet Trumps July 4 deadline.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05210734/musk-trump.webp",
            "description": "<p>Fox News Elon Musk and President Donald Trump’s feud about the “Big, Beautiful Bill” continued on Thursday when the tech billionaire responded to the president’s criticism in a post on X. “Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate. Such ingratitude,”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musk-says-trump-would-have-lost-2024-election-without-him-as-big-beautiful-bill-feud-continues/\">Musk says Trump would have lost 2024 election without him as ‘Big, Beautiful Bill’ feud continues</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        },
        {
            "title": "Former Zambian President Lungu dies aged 68",
            "url": "https://www.newzimbabwe.com/former-zambian-president-lungu-dies-aged-68/",
            "content": "BBC\n\nZambias former President Edgar Lungu has died at the age of 68, his party has said in a statement.\n\nHe had been receiving specialized treatment in South Africa for an undisclosed illness, the Patriotic Front said confirming the news.\n\nLungu led Zambia for six years from 2015, losing the election to the current President Hakainde Hichilema by a large margin.\n\nAfter that defeat he stepped back from politics but later returned to the fray and appeared to have ambitions to run for the presidency again.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/01/01182032/Edgar-Lungu.jpg",
            "description": "<p>BBC Zambia’s former President Edgar Lungu has died at the age of 68, his party has said in a statement. He had “been receiving specialized treatment in South Africa” for an undisclosed illness, the Patriotic Front said confirming the news. Lungu led Zambia for six years from 2015, losing the election to the current President</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-zambian-president-lungu-dies-aged-68/\">Former Zambian President Lungu dies aged 68</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        },
        {
            "title": "Government showers rare praises on America, says it wants to fix relationship with Western power",
            "url": "https://www.newzimbabwe.com/government-showers-rare-praises-on-america-says-it-wants-to-fix-relationship-with-western-power/",
            "content": "By Leopold Munhende\n\nFOREIGN Affairs Minister Amon Murwira has showered rare praises on the United States of America (USA) for its humanitarian work and business investments over Zimbabwes 45 years of Independence.\n\nMurwira, who was speaking as guest of honour at early American Independence celebrations hosted by the US Embassy in Harare, expressed Zimbabwes gratitude for the superpowers contributions in its health, agriculture and education sectors, where hundreds of millions have been poured.\n\nHe said government, in its Zimbabwe is Open for Business approach towards international re-engagement, was specifically concerned with improving relations with America.\n\nZimbabwes relationship with America broke down in the early 2000s following a string of human rights abuses that were sanctioned by late President Robert Mugabe against opposition members, targeted white farmers and other dissenting voices.\n\nWe wish to express the gratitude of the government and people of Zimbabwe for the USAs support over the past 45 years which has contributed to the progress and development of Zimbabwe through collaboration in the implementation of programmes in sectors that include agriculture, education and health sector among others, said Murwira.\n\nWe are grateful for this support.\n\nZimbabwe is open for business, it is open to fair cooperation, it is open to deepen relations with the rest of the world, particularly with America and wish therefore to invite all potential US investors to come and invest in Zimbabwe.\n\nZimbabwe is fully committed to the continued enhancement of our bilateral relations.\n\nOver a million people have been fed by America in the past year. Some 47,000 farmers have accessed US markets while more than 500,000 have received antiretroviral drugs (ARVs) from its arm, the Presidents Emergency Fund for AIDS Relief (PEPFAR).\n\nDespite past attempts to thaw relations with America, Zimbabwe has always been found wanting whenever its human rights record is analysed. Arrest of journalists, the continued use of lengthy pre-trial detention as a weapon against dissenting voices, abductions and torture by the secret service have always been brought up.\n\nGrand corruption within the government, headed by Zanu PF-aligned businessmen and a clear disregard to fix the graft have also been raised as red flags.\n\nThis latest attempt at mending relations between the two countries comes barely a month after President Emmerson Mnangagwa announced the suspension of all tariffs on goods being imported from the US in an attempt to court re-elected President Donald Trump.\n\nAdded Murwira: Zimbabwe looks forward to deepening relations and expansion of bilateral cooperation with the USA we appreciate the participation of the USA through its embassy at the 2025 edition of Zimbabwe International Trade Fair (ZITF). We thank you for that participation.\n\nWe applaud all USA companies that have established businesses in Zimbabwe, we would like to assure all these and foreign companies in Zimbabwe that the Zimbabwean government is willing to assist them to expand their operations.\n\nAmericas Independence Day was commemorated earlier in Harare as a significant number of its embassy staff are being redeployed, according to Ambassador Pamela Tremont. America will be celebrating 249 years of Independence on July 4.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05122143/murwira-tremont.jpeg",
            "description": "<p>By Leopold Munhende FOREIGN Affairs Minister Amon Murwira has showered rare praises on the United States of America (USA) for its humanitarian work and business investments over Zimbabwe’s 45 years of Independence. Murwira, who was speaking as guest of honour at early American Independence celebrations hosted by the US Embassy in Harare, expressed Zimbabwe’s gratitude</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-showers-rare-praises-on-america-says-it-wants-to-fix-relationship-with-western-power/\">Government showers rare praises on America, says it wants to fix relationship with Western power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:15",
            "date": "06 Jun 2025"
        }
    ]
}