{
    "news": [
        {
            "title": "Baccarat Academy: Why to Choose Baccarat.Wiki to Learn More About the Game?",
            "url": "https://www.newzimbabwe.com/baccarat-academy-why-to-choose-baccarat-wiki-to-learn-more-about-the-game/",
            "content": "Baccarat is a classic casino game that attracts millions of players worldwide. Its easy to learn but hard to master. Many enjoy the fast-paced and simple betting options, while others look for deeper strategies and smarter ways to win. Still, despite the games popularity, good learning resources are not always easy to find.\n\nSome websites only explain the rules, while others focus too much on gambling promotions. Players who want to improve their game often feel stuck. Thats why Baccarat.Wiki is worth your attention. Its a platform built for learningoffering clear guides, tools for practice, and a strong community of players who share your goal: to play baccarat better.\n\nBaccarat.Wiki is an educational website that focuses only on baccarat. Its free to use and created for players of all experience levels. If youre just starting, youll find basic tutorials that explain how the game works, what bets you can make, and what the odds are. If youve been playing for a while, there are strategy breakdowns, betting systems, and tools to test your approach.\n\nThe site doesnt ask you to sign up, and it doesnt push online casinos. This makes it different from other sites that often mix in gambling ads or try to sell expensive systems on Baccarat.Wiki, the main focus is knowledge.\n\nThe platform includes:\n\nIts a full academy for baccaratbuilt by people who understand the game and want to help others learn.\n\nThere are several reasons why Baccarat.Wiki is trusted by players. First, the information is presented clearly, without confusing terms or vague promises. Each strategy or tip is logically explained and supported by real math or practical testing.\n\nAlso, the site is kept up to date. Baccarat doesnt change much, but new strategies and betting styles always appear. The site often adds new tools or expands sections based on what players ask for.\n\nMost importantly, many peoplevisit Baccarat Wikibecause its focused only on baccarat. Youre not distracted by slots, roulette, or poker content. This means the site can go deeper into the game and cover topics other places skip.\n\nFor example, one article breaks down banker vs. player bets across thousands of hands, showing exact outcomes and house edges. Another explains why chasing a tie bet is usually bad, with stats and easy-to-read charts.\n\nTrust also comes from the lack of sales tactics. No flashy buttons trying to make you gamble, no secret winning systems. Just clear, honest content that teaches you how to play smarter.\n\nLearning about baccarat isnt enoughyou have actually to practice. Thats why Baccarat.Wiki has several tools that help you train and improve without risk. Here are some of the most useful features:\n\nThedemo baccaratsimulator is especially useful. You can test dozens of hands without spending any money. This way, you can learn how to deal with win/loss streaks, try flat betting, or experiment with patternsall in a safe environment.\n\nLets say youre trying a 1-3-2-4 system. Using the strategy tester, you can see if it holds up during long sessions. Suppose it doesnt adjust, and try again. This is how real improvement happensnot through guesswork but smart practice.\n\nOne of the most valuable things about Baccarat.Wiki is its active and growing community. Learning is faster and easier when youre part of a group of players with similar goals.\n\nTheBaccarat Wiki subredditis a great example. Players post questions, share their results, discuss tools, and help each other learn. Youll often find strategy debates, betting system reviews, or even people sharing their progress week by week.\n\nFor instance, a user recently shared how they avoided going on tilt by following a strict stop-loss rule, something they picked up from the sites bankroll section. Others replied with similar experiences, turning it into a mini-discussion that was both helpful and honest.\n\nBeing part of this community can keep you motivated and give you new ideas to try. You dont feel alone in your journeyand thats important when youre trying to improve a skill.\n\nIts one thing to read a guide. Its another to learn from people who have played hundreds or thousands of baccarat sessions and can explain what works.\n\nTheBaccarat Wiki on Quorais full of user-submitted questions, with answers from experienced players and contributors to the main site. These arent copy-paste responsestheyre detailed, direct, and based on real play.\n\nSample questions youll find:\n\nYou get honest, practical answersoften backed by testing or stats. This adds real-world value you cant always get from general gambling forums.\n\nYou can even ask your questions and get helpful responses in hours or days, depending on the topic. That level of interaction is rare and makes the learning process feel more personal.\n\nThere are other places where people go to learn baccaratYouTube channels, online forums, and paid strategy courses. But most of them have trade-offs. Lets compare:\n\nWhat makes Baccarat.Wiki is better because you dont have to guess. The tools are tested, the content is organized, and the advice comes from players whove already made the mistakes youre trying to avoid. Its like having a full baccarat classroombut youre in charge of how fast or slow you go.\n\nBaccarat.Wiki is a valuable resource for anyone looking to play baccarat with more confidence and understanding. It doesnt pressure you to gamble or sell you empty promisesit simply gives you the tools to learn and improve.\n\nIf youre new to the game, youll find clear explanations and free practice games that let you build skills without risk. If you already have experience, the site helps you go deeper by offering smart strategies, helpful calculators, and detailed analysis of your play. And for those who play regularly, it becomes a place to fine-tune methods, stay sharp, and connect with others who take the game seriously.\n\nNo matter your level, Baccarat.Wiki makes it easier to enjoy the game while learning something new every time you play.\n\n",
            "image_url": null,
            "description": "<p>Baccarat is a classic casino game that attracts millions of players worldwide. It’s easy to learn but hard to master. Many enjoy the fast-paced and simple betting options, while others look for deeper strategies and smarter ways to win. Still, despite the game’s popularity, good learning resources are not always easy to find. Some websites</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/baccarat-academy-why-to-choose-baccarat-wiki-to-learn-more-about-the-game/\">Baccarat Academy: Why to Choose Baccarat.Wiki to Learn More About the Game?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Potential new antibiotic for treating gonorrhoea",
            "url": "https://www.newzimbabwe.com/potential-new-antibiotic-for-treating-gonorrhoea/",
            "content": "BBC\n\nScientists believe they have found a new effective antibiotic for gonorrhoea, which could be one of the most promising in decades.\n\nGepotidacin can treat and clear the sexually transmitted infection just as well as existing antibiotics and appears to be able to tackle some emerging drug-resistant superbug strains too, say researchers inThe Lancet journal.\n\nThe work was funded by pharmaceutical company GSK which makes the new tablets.\n\nGonorrhoea is one of the most common STIs and cases have been rising.\n\nIn 2023, over 85,000 gonorrhoea diagnoses were reported in England alone  the highest number since records began in 1918.\n\nMost of the cases were treatable, but there isgrowing concernthat some strains cant be dealt with so easily.\n\nOver time, the bacterium has developed resistance to most classes of available antibiotics and experts fear it may become untreatable in the future, unless new drugs are found.\n\nUntreated gonorrhoea can lead to serious health issues, including pelvic inflammatory disease and infertility.\n\nGepotidacin works differently to other antibiotics and stops gonorrhoea from replicating by blocking two essential enzymes.\n\nIts already approved in the US for treating urinary tract infections.\n\nThe trial, being presented at the ESCMID conference, involved 628 patients randomly allocated to receive gepotidacin or an existing antibiotic.\n\nThe new pill was equally effective for treating gonorrhoea and worked against strains of the infection that were resistant to current first-line treatments, such as ceftriaxone.\n\nSide-effects were reported more frequently with gepotidacin, but they were generally mild, such as nausea or some stomach discomfort.\n\nGepotidacine is not the only new oral antibiotic for gonorrhoea that researchers are exploring.\n\nAnother, called zoliflodacin, has also shownpromise in phase 3 clinical trials.\n\nMeanwhile, the UK is consideringa vaccineto help stop the spread of gonorrhoea.\n\nIn November 2023, the Joint Committee on Vaccination and Immunisation (JCVI) recommended a targeted roll-out of the MenB vaccine.\n\nPrimarily designed to tackle Meningitis B in children, the JCVI found the treatment was roughly 40% effective at preventing people from contracting and spreading gonorrhoea.\n\nDr Katy Sinka, consultant epidemiologist and head of the STI section at UK Health Security Agency, said it was really promising to see a successful trial for a new antibiotic to treat gonorrhoea.\n\nAs gonorrhoea becomes increasingly resistant to antibiotics, it could become untreatable in future and cause serious problems like pelvic inflammatory disease and infertility. Trials like this are so important to help us discover new treatment options.\n\nShe said the best way to prevent an STI is by using a condom. If someone has had condom-less sex with a new or casual partner, they should get tested.\n\nEarly detection not only protects a persons health but prevents transmission to others. Testing is quick, free and confidential, she said.\n\nSource: NHS\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/15071638/130916164210-drug-resistant-bacteria-gonorrhoeae.webp",
            "description": "<p>BBC Scientists believe they have found a new effective antibiotic for gonorrhoea, which could be one of the most promising in decades. Gepotidacin can treat and clear the sexually transmitted infection just as well as existing antibiotics and appears to be able to tackle some emerging drug-resistant ‘superbug’ strains too, say researchers in The Lancet journal.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/potential-new-antibiotic-for-treating-gonorrhoea/\">Potential new antibiotic for treating gonorrhoea</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Gospel star Benjamin Dube parts ways with Spirit of Praise to focus on his calling",
            "url": "https://www.newzimbabwe.com/gospel-star-benjamin-dube-parts-ways-with-spirit-of-praise-to-focus-on-his-calling/",
            "content": "TshisaLive\n\nBenjamin Dube has parted ways with gospel group Spirit of Praise.\n\nThe singer and reverend, who has been the anchor of the group since its inception in 2008, took to his timeline on Monday to announce the news in an official statement.\n\nBenjamin said the decision was not easy but after prayer, reflection and conversations with key stakeholders he chose to walk away.\n\nThe decision was not made lightly as Spirit of Praise has been an important part of reverend Dubes ministry journey over the years. Through the platform, countless lives have been touched, worship has been elevated and the message of Christ has reached multitudes locally and globally. However, as seasons change, so do assignments, read the statement.\n\nReverend Dube believes the time has come to focus fully on the next phase of his calling, which includes expanding his personal ministry, mentoring the next generation of gospel artists and pursuing projects aligned with the unique mandate God has placed on his life.\n\nHe remains deeply and eternally grateful to Spirit Music Group, the Spirit of Praise team, and the owners of Spirit of Praise, Aubrey Peacock and Matthew Nkabinde, for the years of fruitful partnership, mutual respect and impactful ministry. Reverend Dube departs with nothing but love, honour and profound appreciation in his heart.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/07165700/benjamin-dube-lyrics-songs-video-gospellyricsng.png",
            "description": "<p>TshisaLive Benjamin Dube has parted ways with gospel group Spirit of Praise. The singer and reverend, who has been the anchor of the group since its inception in 2008, took to his timeline on Monday to announce the news in an official statement. Benjamin said the decision was not easy but after prayer, reflection and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gospel-star-benjamin-dube-parts-ways-with-spirit-of-praise-to-focus-on-his-calling/\">Gospel star Benjamin Dube parts ways with Spirit of Praise to focus on his calling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Ghana orders foreigners to exit gold market by April 30",
            "url": "https://www.newzimbabwe.com/ghana-orders-foreigners-to-exit-gold-market-by-april-30/",
            "content": "Reuters\n\nGhana has ordered foreigners to exit its gold trading market by the end of the month, a new government body said on Monday, as the West African country looks to streamline gold purchases from small-scale miners, increase earnings and reduce smuggling.\n\nAfricas leading gold producer is shifting away from a system in which local and foreign companies with export licences can buy and export gold from artisanal or small-scale mining.\n\nUnder the new system, the newly created gold board known as GoldBod is the only entity allowed to buy, sell, assay and export artisanal gold, Mondays statement said, and older licences have ceased to be valid.\n\nForeigners must leave the local gold trading market by April 30 though they can apply to buy or take-off gold directly from the GoldBod, the statement said.\n\nFinance minister Cassiel Ato Forson said in January the creation of GoldBod would allow Ghana to benefit more from gold sales while maintaining the national currencys stability.\n\nGhanas gold exports grew by 53.2% in 2024 to $11.6bn (R218,6bn), of which nearly $5bn (R94.2bn) was from legal small-scale miners.\n\nGold prices vaulted on Friday over the $3,200 (R60,330) per ounce mark for the first time.\n\nThe trade war between the US and China has rattled global markets and driven investors into gold, which is traditionally viewed as a hedge against geopolitical and economic uncertainty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/12155643/Gold-e1622992406237.jpg",
            "description": "<p>Reuters Ghana has ordered foreigners to exit its gold trading market by the end of the month, a new government body said on Monday, as the West African country looks to streamline gold purchases from small-scale miners, increase earnings and reduce smuggling. Africa’s leading gold producer is shifting away from a system in which local</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ghana-orders-foreigners-to-exit-gold-market-by-april-30/\">Ghana orders foreigners to exit gold market by April 30</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "NRZ train catches fire while transporting coal to Zambia",
            "url": "https://www.newzimbabwe.com/nrz-train-catches-fire-while-transporting-coal-to-zambia/",
            "content": "By Staff Reporter\n\nA National Railways of Zimbabwe (NRZ) train caught fire on Monday after its fuel tanks exploded.\n\nThe locomotive was transporting export coal to Zambia when the incident occurred between Kalala and Matetsi sidings in Hwange District.\n\nIn a statement, the NRZ said its crew members escaped unharmed.\n\nInvestigations are underway to ascertain the cause of the fire.\n\nOur crews managed to escape unhurt. The incident took place between Kalala Matetsi sidings when the locomotives fuel tanks exploded. The load was not affected. A rescue train with crews was quickly sent to the site and they managed to extinguish the fire. Investigations are already underway to establish the cause of the fire and the amount of damage to the locomotive, reads NRZs statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/28193158/NRZ.jpg",
            "description": "<p>By Staff Reporter A National Railways of Zimbabwe (NRZ) train caught fire on Monday after its fuel tanks exploded. The locomotive was transporting export coal to Zambia when the incident occurred between Kalala and Matetsi sidings in Hwange District. In a statement, the NRZ said its crew members escaped unharmed. Investigations are underway to ascertain</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nrz-train-catches-fire-while-transporting-coal-to-zambia/\">NRZ train catches fire while transporting coal to Zambia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Triangle United sacks coach Luke Masomere",
            "url": "https://www.newzimbabwe.com/triangle-united-sacks-coach-luke-masomere/",
            "content": "By Sports Reporter\n\nTriangle United have become the first team to fire a coach this season, after axing head coach Luke Masomere on Monday.\n\nMasomere had led the side to a poor start in the ongoing campaign in which he only picked a point in six games, leaving the side bottom of the Premier Soccer League log table.\n\nThe Sugar Boys 2-1 defeat to Bikita Minerals at Gibbo stadium on Sunday marked the teams fifth defeat of the season.\n\nTriangle United is marking its return to the top-flight league after spending the 2024 season playing in the Eastern Region Division One league, where they were eventually crowned champions to win promotion under the guidance of Masomere.\n\nMasomere joined Triangle in July 2024 when the team was plying trade in the lower division, and before that he was with Premier Soccer League side ZPC Kariba.\n\nFormer Ngezi Platinum Stars and Hwange coach Rodwell Dhlakama is among the favorites to replace Masomere at Triangle.\n\nThe team is also reportedly in talks with Kwekwe United coach Saul Chaminuka.\n\nTriangle Results under Masomere\n\nScottland 1-0 Triangle\n\nTel One 4-1 Triangle\n\nTriangle 0-2 CAPS United\n\nNgezi Platinum Stars 1-0 Triangle\n\nTriangle 2-2 Highlanders\n\nBikita Minerals 2-1 Triangle\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/08/05024314/LUKE-MASOMERE.jpg",
            "description": "<p>By Sports Reporter Triangle United have become the first team to fire a coach this season, after axing head coach Luke Masomere on Monday. Masomere had led the side to a poor start in the ongoing campaign in which he only picked a point in six games, leaving the side bottom of the Premier Soccer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/triangle-united-sacks-coach-luke-masomere/\">Triangle United sacks coach Luke Masomere</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "March 31 protests: Over 1,000 suffered rights violations at hands of the State – report",
            "url": "https://www.newzimbabwe.com/march-31-protests-over-1000-suffered-rights-violations-at-hands-of-the-state-report/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Peace Project (ZPP), a human rights watchdog, reports that over 1,000 people experienced violations of their rights to freedom of assembly and association following the March 31stprotests against President Emmerson Mnangagwa.\n\nThe protests were triggered by Blessed Geza, a former Zanu-PF Central Committee member and war veteran. Geza, now on the run, has been using his X page and YouTube channelto mobilise Zimbabweans to protest against Mnangagwa.\n\nGeza accuses Mnangagwa of a litany of issues: corruption, nepotism, tribalism and is demanding his immediate resignation. The war veteran is opposed to the extension of Mnangagwas term beyond 2028, when his constitutionally mandated two five-year terms will expire.\n\nAs a direct consequence of Gezas call to action, over a hundredpeople participated in the March 31st protest. Police responded with force at Freedom Square in Harare. Despite the initial attempts to disperse them, the protesters regrouped repeatedly.\n\nAt one point, protesters barricaded the junction of Rotten Row and Robert Mugabe Roads in the capital, rendering it impassable to motorists. Police responded firing tear gas, ultimately arresting 98 protesters. They are currently detained at Harare Remand Prison after their bail applications were denied.\n\nIn its first-quarter report of 2025, the ZPP raised significant concerns about the number of individuals who suffered human rights violations by the State, before, during, and after the 31st March protests, documenting 14 severe assaultcases and 98 arrests.\n\nThe Zimbabwe Peace Project recorded 24 violations restricting freedom of assembly and association (affecting 740 people, 270 men and 470 women), 15 violations against freedom of expression (affecting 146 people, 72 men and 74 women), and 14 assaults (affecting 68 citizens, 38 men and 30 women), most of which were directly linked to attempts to suppress the protests, reads the report.\n\nThe ZPP argues that these targeted violations reflect a deliberate state-led strategy to violate constitutionally guaranteed rights, especially the rights to demonstrate, express opinions freely, and participate in peaceful political activities.\n\nIn anticipation of the protests, security forces were deployed to pre-emptively intimidate citizens, arrest activists, and surveil communities, while online spaces were policed to silence dissent. The arrest of 98 Zimbabweans in Harare alone, solely for participating in the March 31st protests, exemplifies the criminalisation of protest, the report continues.\n\nThe ZPP further warns that the use of the justice system as a tool of intimidation exerts immense psychological and financial pressure on detainees and their families, and serves as a chilling warning to the broader public, discouraging civic engagement.\n\nThese actions point to an entrenched culture of weaponisation of the judiciary and criminal law to punish human rights defenders. The impact on human rights is a severe dismantling of freedom of expression, eroding public trust in institutions, and deterring peaceful participation in democratic processes.\n\nWithout immediate accountability and structural reforms, Zimbabwe risks institutionalizing a state of fear where dissent is punished, justice is deferred, and democratic freedoms are rendered meaningless, reads part of the report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133512/march-1-e1743441415189.png",
            "description": "<p>By Staff Reporter The Zimbabwe Peace Project (ZPP), a human rights watchdog, reports that over 1,000 people experienced violations of their rights to freedom of assembly and association following the March 31st protests against President Emmerson Mnangagwa. The protests were triggered by Blessed Geza, a former Zanu-PF Central Committee member and war veteran. Geza, now on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protests-over-1000-suffered-rights-violations-at-hands-of-the-state-report/\">March 31 protests: Over 1,000 suffered rights violations at hands of the State – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Baby traffickers denied bail, fresh details emerge",
            "url": "https://www.newzimbabwe.com/baby-traffickers-denied-bail-fresh-details-emerge/",
            "content": "By Staff Reporter\n\nA Harare court on Monday heard that Christabel Muringami, who gave away her newly born baby to another woman, ran away from her parents home in Bulawayo to give birth in Harare.\n\nTabeth Chenyika, whom she gave her son to, had also lied to her boyfriend that she was pregnant.\n\nThe two are accused of contravening the Trafficking in Persons Act.\n\nThey initially appeared in court last week before they were remanded in custody for their bail application.\n\nOn Monday, Harare magistrate Marewanazvo Gofa denied the two bail, ruling that there was overwhelming evidence against them.\n\nMuringami ran away from her parents in Bulawayo to come and give birth in Harare. It is this courts view that she is a flight risk and has a propensity to abscond if granted bail, she ruled.\n\nAccording to the State, sometime in January 2025 accused one (Muringami) hatched a plan to traffic her child soon after birth for an unlawful purpose.\n\nShe then advertised on a Facebook page called Adoption that she was about to deliver and invited anyone who wanted a baby to contact her.\n\nShe linked up with accused two (Chenyika) and the two conspired to traffic the child.\n\nOn 10 February 2025, accused one travelled from Bulawayo to Harare and registered the pregnancy at Mbuya Nehanda Maternity wing, Parirenyatwa Group of Hospitals.\n\nOn 25 February 2025, accused one gave birth to a baby girl at Mbuya Nehanda Maternity, Parirenyatwa Group of Hospitals and was discharged on 28 March 2025.\n\nOn 6 March 2025, the two accused contacted each other and met in Letombo, Msasa, Harare, where accused one unlawfully surrendered the custody of the infant to accused two and effectively facilitated an authorised adoption, the State alleges.\n\nThe court heard that on 29 March 2025, Muringami was arrested following a tip-off that she had delivered and disposed of the child.\n\nShe then allegedly led to the arrest of Chenyika and the recovery of the child in Dzivarasekwa 4, Harare.\n\nThe child was placed in the custody and care of the Department of Social Welfare.\n\nRufaro Chonzi is representing the state.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter A Harare court on Monday heard that Christabel Muringami, who gave away her newly born baby to another woman, ran away from her parents’ home in Bulawayo to give birth in Harare. Tabeth Chenyika, whom she gave her son to, had also lied to her boyfriend that she was pregnant. The two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/baby-traffickers-denied-bail-fresh-details-emerge/\">Baby traffickers denied bail, fresh details emerge</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Man jailed for performing community service on sibling’s behalf",
            "url": "https://www.newzimbabwe.com/man-jailed-for-performing-community-service-on-siblings-behalf/",
            "content": "By Staff Reporter\n\nA 31-year-old Harare man has been slapped with a jail term following his conviction for performing community service on behalf of his brother.\n\nTinashe Kaseva from Dzivarasekwa was found guilty of impersonating his brother.\n\nHe has been sentenced to 15 months in prison for the offence.\n\nIn March 2025, Tinashe showed up at Dzivarasekwa Police Station claiming to be his brother Wilbert Kaseva, who had been ordered by the court to do 210 hours of community service for a separate offence.\n\nTinashe even used Wilberts ID to convince a police officer to let him perform his community service, the state proved.\n\nThe plan fell apart in April when police followed up on a fraud case involving Wilbert.\n\nWhen confronted, Tinashe confessed he was not Wilbert, but was doing the sentence as a favour to his brother.\n\nThe deception led to his arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
            "description": "<p>By Staff Reporter A 31-year-old Harare man has been slapped with a jail term following his conviction for performing community service on behalf of his brother. Tinashe Kaseva from Dzivarasekwa was found guilty of impersonating his brother. He has been sentenced to 15 months in prison for the offence. “In March 2025, Tinashe showed up</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-for-performing-community-service-on-siblings-behalf/\">Man jailed for performing community service on sibling’s behalf</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        },
        {
            "title": "Harmful cultural practices suppress rural women’s autonomy, says UFS sociology PhD Mavis Soko",
            "url": "https://www.newzimbabwe.com/harmful-cultural-practices-suppress-rural-womens-autonomy-says-ufs-sociology-phd-mavis-soko/",
            "content": "TimesLive\n\nMavis Soko, who graduated as a doctor of sociology from the University of the Free State this month, hopes her research on the lack of sexual autonomy for Zimbabwean women can be a foundation for advocacy, education and transformative change.\n\nI hope my research will spark meaningful dialogue and policy shifts that promote the recognition and protection of womens sexual autonomy, especially in rural and culturally marginalised communities, she told TimesLIVE.\n\nSocially, I want it to empower women to understand and claim their sexual autonomy without fear or shame.\n\nCulturally, I hope it will challenge harmful traditional practices and encourage communities to reflect on how these norms affect womens wellbeing.\n\nAcademically, I aim to contribute to the growing body of knowledge on intersectionality, gender and sexuality in African contexts, highlighting the importance of considering ethnic and cultural dynamics in public health and social policy.\n\nThe findings of her PhD thesis, titled Ethnic and Gendered Implications of Sexuality and Sexual Rights: Prospects for an Ethnic-Specific Intervention among Karanga and Zezuru Women in Zimbabwe, show that deeply entrenched patriarchal norms continue to undermine womens control over their sexual autonomy in rural Zimbabwe.\n\nHarmful traditional and cultural practices remain prevalent and are used to regulate and suppress womens autonomy, she said. These include practices such as:\n\nThese practices reflect the intersection of culture, gender and sexuality, and reveal how cultural beliefs continue to restrict womens ability to make autonomous decisions about their sexual and reproductive health, she said.\n\nThis research was strongly influenced by the study she conducted during her MSc in Population Studies at the University of Zimbabwe, titled The Determinants of HIV and Aids among Farm Workers in Goromonzi District.\n\nThrough this research, she became aware of a significant gap in the discourse surrounding womens sexual autonomy, particularly within marginalised rural populations.\n\nDespite international and national efforts to promote gender equality, a critical gap in understanding how ethnicity and gender intersect to shape womens sexual autonomy in rural settings remained, she said.\n\nSoko is especially passionate about supporting the girl child and advocating for the upliftment of the disadvantaged.\n\nWhether through mentorship, community engagement or academic work, I am driven by a deep desire to make a meaningful difference in the lives of others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/15051453/mavis-soko.jpg",
            "description": "<p>TimesLive Mavis Soko, who graduated as a doctor of sociology from the University of the Free State this month, hopes her research on the lack of sexual autonomy for Zimbabwean women can be a foundation for advocacy, education and transformative change. “I hope my research will spark meaningful dialogue and policy shifts that promote the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harmful-cultural-practices-suppress-rural-womens-autonomy-says-ufs-sociology-phd-mavis-soko/\">Harmful cultural practices suppress rural women’s autonomy, says UFS sociology PhD Mavis Soko</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:27",
            "date": "15 Apr 2025"
        }
    ]
}