{
    "news": [
        {
            "title": "Illicit cigarettes: Undocumented Zimbabweans found hiding in SANDF base",
            "url": "https://www.newzimbabwe.com/illicit-cigarettes-undocumented-zimbabweans-found-hiding-in-sandf-base/",
            "content": "IOL\n\nFive members of the South African National Defence Force (SANDF) have been released on bail after they appeared before the Musina Magistrates Court oncharges related to illicit cigarette smuggling.\n\nTheir two co-accused, both undocumented Zimbabwean nationals, were found hiding at the military base where the smuggling operation took place.\n\nLimpopo regional spokesperson for the National Prosecuting Authority (NPA), Mashudu Malabi-Dzhangi, said the five soldiers are Macdonald Tshabadira, 28; Waydon Peterson, 29; Khuliso Tshivhenga, 42; Khodani Abel Maphukhumela, 29; and Evah Mmaphuthi Modisa, 39. Each was granted bail of R5,000.\n\nTheir two co-accused, Livhuwani Mutavhatsindi, 27, and Perfious Chauke, 27, were remanded in custody without bail. The Zimbabwean nationals also face charges under the Immigration Act.\n\nMalabi-Dzhangi said the group faces charges of possession of illicit cigarettes, possession of ammunition, and defeating the ends of justice.\n\nThe arrests on September 16, 2025, followed an incident at the Artonvilla military base, where the SANDF members allegedly intercepted a group of smugglers transporting 24 master boxes of illicit Remington Gold cigarettes, valued at an estimated R300,000.\n\nIt is alleged that the soldiers only declared 18 of the boxes to SA Revenue Service Customs, while the remaining six boxes were later found hidden under their beds.\n\nPolice were alerted to the discrepancy and, upon searching the premises, found six master boxes of Remington Gold cigarettes concealed under the SANDF members beds. Two civilians were also discovered hiding at the base. The accused were immediately arrested, said Malabi-Dzhangi.\n\nOn the other hand, the SANDF has confirmed that the operation was unauthorized and has reiterated its zero-tolerance stance on corruption, with disciplinary processes to run concurrently with the criminal proceedings.\n\nPreliminary reports indicate that, at approximately midnight on 16 September 2025, a group of SANDF members allegedly conducted an unauthorised operation at Artonvilla, Musina (also known as Sediba sa Tlou base). It is alleged that the members, acting in concert with two Zimbabwean nationals, attempted to unlawfully intercept a group of smugglers transporting illicit cigarettes into South Africa, said SANDF spokesperson, Rear Admiral Prince Tshabalala.\n\nDuring the incident, shots were reportedly fired, illicit goods were seized, and some contraband was unlawfully concealed at the base.\n\nFollowing credible intelligence, the SANDF military police, military intelligence, and the SAPS launched a joint operation later that morning.\n\nThe case has been adjourned until November 14, 2025, for further investigation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19074507/sandf-base.png",
            "description": "<p>IOL Five members of the South African National Defence Force (SANDF) have been released on bail after they appeared before the Musina Magistrate’s Court on charges related to illicit cigarette smuggling. Their two co-accused, both undocumented Zimbabwean nationals, were found hiding at the military base where the smuggling operation took place. Limpopo regional spokesperson for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/illicit-cigarettes-undocumented-zimbabweans-found-hiding-in-sandf-base/\">Illicit cigarettes: Undocumented Zimbabweans found hiding in SANDF base</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "19 Sep 2025"
        },
        {
            "title": "Zimbabwe ditches South Africa, chooses Botswana venue for Bafana Bafana clash",
            "url": "https://www.newzimbabwe.com/zimbabwe-ditches-south-africa-chooses-botswana-venue-for-bafana-bafana-clash/",
            "content": "IOL\n\nThe Zimbabwe Football Association (Zifa) have announced a dramatic venue change, in an unexpected twist in the lead-up to the 2026 FIFA World Cup qualifiers next month.\n\nTheir pivotal clash against South Africas Bafana Bafana, originally slated for South African soil, will now take place at the Obed Itani Chilume Stadium in Francistown, Botswana, on October 10, 2025.\n\nThis decision comes about because Zimbabwe have issues with hosting international matches at home due to a FIFA ban stemming from stadium concerns.\n\nZimbabwe have previously held their home qualifiers in South Africa, specifically utilising popular venues such as Orlando Stadium. The transition to Botswana is seen as a move to create a more logistical and fan-friendly environment for their supporters.\n\nLocal sources from the Zimbabwe Football Association (Zifa) report that the decision aims to make the match more accessible for both the Warriors fans. The move is significant as the fixture serves as a milestone in South Africas quest for World Cup qualification.\n\nAs it stands, South Africa leads the standings in Group C with 17 points from eight matches, putting them in pole position for qualification. Meanwhile, Zimbabwe languishes at the bottom with only four points, a stark reflection of their struggleshaving won merely two of their last 27 qualifiers since 2010.\n\nThis latest venue change adds further intrigue to a match that, while less critical for Zimbabwes aspirations, could serve as a defining moment for a Bafana squad looking to solidify their World Cup journey.\n\nThe Obed Itani Chilume Stadium, which boasts a capacity of 26,000, has been recognised as a reliable venue, previously hosting Namibia during their World Cup qualifiers, thus demonstrating its capability to cater to international football standards.\n\nThis choice of location not only provides a neutral ground but also enhances accessibility for Zimbabwean fans, who usually faced no challenges attending matches in South Africa.\n\nDespite Zimbabwes elimination from World Cup contention following a disappointing series of resultsincluding losses to Benin and Rwandathis encounter with the Bafana is unlikely to diminish local interest. Providing a stage to showcase talent, the upcoming match may serve more as a platform for national pride and a precursor to the upcoming 2025 Africa Cup of Nations.\n\nHowever, the venue shift has left many fans puzzled; while the location changes, Zimbabwes hopeless position in the qualifiers is still unchanged. The decision ultimately raises questions about ZIFAs administrative strategy, especially as Zimbabwe prepares to face South Africa, Nigeria, and Lesotho, a task that seems more metaphorical than consequential.\n\nThe president of the Botswana Football Association, Tariq Babitseng, confirmed the hosting arrangement, emphasising the significance of this contest for Bafana as they aim for a win to bolster their World Cup bid.\n\nWith anticipation building, all eyes will be on Francistown this October, regardless of the unpredictable journey Zimbabwes Warriors have faced in their World Cup qualifiers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>IOL The Zimbabwe Football Association (Zifa) have announced a dramatic venue change, in an unexpected twist in the lead-up to the 2026 FIFA World Cup qualifiers next month. Their pivotal clash against South Africa’s Bafana Bafana, originally slated for South African soil, will now take place at the Obed Itani Chilume Stadium in Francistown, Botswana,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ditches-south-africa-chooses-botswana-venue-for-bafana-bafana-clash/\">Zimbabwe ditches South Africa, chooses Botswana venue for Bafana Bafana clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "19 Sep 2025"
        },
        {
            "title": "US deportees sue Ghana over ‘illegal’ detention",
            "url": "https://www.newzimbabwe.com/us-deportees-sue-ghana-over-illegal-detention/",
            "content": "BBC\n\nEleven people detained in Ghana after being deported from the US have sued the West African nations government, their lawyer has told the BBC.\n\nOliver-Barker Vormawor said the deportees had not violated any Ghanaian law, and their detention in a military camp was therefore illegal.\n\nHe wanted the government to produce the group in court, and justify why they were being held against their will, the lawyer added.\n\nThe government has not yet commented on the law suit, but has previously said that it plans to accept another 40 deportees. Opposition MPs are demanding the immediate suspension of the deportation deal until parliament ratifies it, saying this was required under Ghanaian law.\n\nLast week, Ghanas President John Mahama said that 14 deportees of West African origin had arrived in the country following an agreement reached with the US.\n\nHe later said that all of them had been returned to their countries of origin, though Foreign Minister Samuel Okudzeto Ablakwa contradicted him by saying that only most of them had been returned.\n\nMr Vormawors court application contradicts both of them, saying that 11 deportees are still in detention in Ghana.\n\nThe 11 were held in a US detention facility before being shackled and deported in a military cargo aircraft, according to papers filed in court.\n\nThe deportations are part of the US governments hard-line approach towards immigration since President Donald Trump took office in January.\n\nHe has vowed to conduct record-level deportations of migrants in the country illegally.\n\nGhanas foreign minister was quoted on Monday by Reuters news agency as saying the decision to accept the deportees was based on humanitarian principle and pan-African empathy.\n\nThis should not be misconstrued as an endorsement of the immigration policies of the Trump administration, he said.\n\nFive of the detainees, three Nigerians and two Gambians, have also sued the US government, arguing that they were protected by a court order and should not have been deported.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19073933/mahama-president.webp",
            "description": "<p>BBC Eleven people detained in Ghana after being deported from the US have sued the West African nation’s government, their lawyer has told the BBC. Oliver-Barker Vormawor said the deportees had not violated any Ghanaian law, and their detention in a military camp was therefore illegal. He wanted the government to produce the group in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-deportees-sue-ghana-over-illegal-detention/\">US deportees sue Ghana over ‘illegal’ detention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "19 Sep 2025"
        },
        {
            "title": "Mnangagwa shifts focus to 2028 elections, brushing aside party’s ‘2030 Agenda’",
            "url": "https://www.newzimbabwe.com/mnangagwa-shifts-focus-to-2028-elections-brushing-aside-partys-2030-agenda/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has seemingly set aside Zanu PFs long-touted 2030 Agenda, now shifting focus to the 2028 general elections, which he insists the ruling party must resoundingly win.\n\nThis comes as Zanu PF prepares for its 22nd National Peoples Conference, scheduled for Mutare. Mnangagwa is serving his second and final constitutional term, ending in 2028, though his allies have been lobbying for the postponement of elections to 2030.\n\nAt last years National Peoples Conference in Bulawayo, Zanu PF passed a resolution to extend Mnangagwas tenure until 2030 or beyond. The move, however, met resistance from rival factions within the party and war veterans believed to be backing Vice President Constantino Chiwenga, widely tipped as Mnangagwas likely successor.\n\nAddressing the Central Committee this Thursday, Mnangagwa hinted that the upcoming Mutare conference would be crucial in setting the partys direction, with the thorny succession question expected to dominate discussions.\n\nWe gather today, a few weeks before we hold the 22nd National Peoples Conference in the scenic City of Mutare, Manicaland Province.\n\nFurther, this meeting is being convened at a time when we have passed the halfway mark since our last Harmonised General Elections in 2023.\n\nIt is, therefore, of critical importance that we introspect as a Party, not only with regards to our short-term activities, but also in view of the bigger objective of ensuring that our party resoundingly wins the 2028 Harmonised General Elections, said Mnangagwa.\n\nTensions remain high within Zanu PF over the succession race. Business tycoon Kudakwashe Tagwirei, recently co-opted into the Central Committee, is reportedly eyeing the presidency, while Chiwenga is believed to command strong support from within party structures.\n\nMnangagwa urged members to stay grounded in the partys founding ethos while remaining focused on Vision 2030.\n\nLet us, as the leadership, continually align the membership of the Party to the founding ideology, values, principles and the overall provisions of the Party Constitution.\n\nThe wheels of our revolution should be kept moving, our grassroots membership and structures well-organised, mobilised and informed.\n\nAll of us must work harder, with determination and focus across all sectors, as we accelerate the realisation of Vision 2030, he said.\n\nMeanwhile, in Parliament on Wednesday, opposition MPs pressed government to clarify its position on implementing reforms outlined in the 2023 SADC Election Observer Report, recommendations critical ahead of future polls.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19070809/mnangagwa-cc.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has seemingly set aside Zanu PF’s long-touted ‘2030 Agenda’, now shifting focus to the 2028 general elections, which he insists the ruling party “must resoundingly win.” This comes as Zanu PF prepares for its 22nd National People’s Conference, scheduled for Mutare. Mnangagwa is serving his second and final constitutional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-shifts-focus-to-2028-elections-brushing-aside-partys-2030-agenda/\">Mnangagwa shifts focus to 2028 elections, brushing aside party’s ‘2030 Agenda’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "19 Sep 2025"
        },
        {
            "title": "ZIMRA officials in court over US$6.3 million fraud",
            "url": "https://www.newzimbabwe.com/zimra-officials-in-court-over-us6-3-million-fraud/",
            "content": "By Mary Taruvinga\n\nTwo senior employees of the Zimbabwe Revenue Authority (ZIMRA) have appeared in court accused of masterminding a sophisticated cyber fraud that cost the tax authority more than US$6.34 million.\n\nThe accused are Shupikai Mary Nicola Marongwe (52), a database administrator, and Paradzai Mutasa (35), a systems developer.\n\nThe two appeared before Harare magistrate Marewanazvo Gofa, who remanded them in custody to this Friday pending bail finalisation.\n\nBoth were entrusted with managing ZIMRAs critical tax systems, but now stand charged with abusing their positions for personal gain.\n\nAccording to prosecutor Rufaro Chonzi, the pair exploited their roles during the rollout of the Zimbabwe Electronic Single Window (ZESW) project, which was designed to integrate with the ASYCUDA customs system. Instead of creating a limited-access account as requested by a United Nations consultant working on the project, they allegedly built a hidden account with full administrative rights.\n\nUsing this backdoor, they manipulated clearing agents prepayment accounts, inserting fictitious deposits to make it appear as if customs duties had been paid. In reality, no money was received by ZIMRA. \n\nThe agents were then able to clear goods duty-free while the accused allegedly collected cash from them, sharing the proceeds.\n\nThe scam ran undetected for months, with prosecutors telling the court that by abusing their positions, the accused acted contrary to their duties as public officers, showing favour to themselves and prejudice to ZIMRA.\n\nNothing has been recovered from the multi-million-dollar fraud.\n\nThe two were remanded in custody pending finalisation of their bail hearing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga Two senior employees of the Zimbabwe Revenue Authority (ZIMRA) have appeared in court accused of masterminding a sophisticated cyber fraud that cost the tax authority more than US$6.34 million. The accused are Shupikai Mary Nicola Marongwe (52), a database administrator, and Paradzai Mutasa (35), a systems developer. The two appeared before Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimra-officials-in-court-over-us6-3-million-fraud/\">ZIMRA officials in court over US$6.3 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "19 Sep 2025"
        },
        {
            "title": "Road carnage claims 2,000 lives annually, MPs demand tougher action",
            "url": "https://www.newzimbabwe.com/road-carnage-claims-2000-lives-annually-mps-demand-tougher-action/",
            "content": "By Anna Chibamu\n\nParliamentarians have raised alarm over the worsening road carnage in Zimbabwe, urging government to take urgent steps to enforce road safety regulations amid revelations that nearly 2,000 people die annually from traffic accidents.\n\nDuring Wednesdays Question and Answer session, Transport Minister Felix Mhona confirmed the grim statistics, attributing many of the accidents to reckless driving, speeding, impatience, and inexperienced public transport drivers.\n\nHe told MPs that government had already procured speed trap equipment and breathalysers to clamp down on speeding and drivers operating under the influence of alcohol or drugs.\n\nWe realise that there are people who drive under the influence of drugs or intoxicating substances. We work with the Ministry of Home Affairs and Cultural Heritage, as well as the V.I.D., who are supposed to be on the road. Sometimes you find accidents soon after crossing those checkpoints.\n\nI would like to inform the House that the Home Affairs ministry has since procured speed trap equipment as well as breathalysers, said Mhona.\n\nHe added that stricter regulations had been introduced for public transport drivers, particularly those driving buses and haulage trucks.\n\nI know that in the past people were just driving lorries through Class 2. We have since set up a Stationary Instrument but right now, we are saying you start with Class 4 going upwards, you cannot start with Class 2.\n\nFor one to drive public transport, buses or commuter buses, you have to be above 30 years. In the past, people were driving at the ages of 21, 22 or 25, Mhona explained.\n\nZanu PF MP Vairet Nhari had questioned the licensing process for drivers who, immediately after acquiring a Class 1 or Class 2 licence, were already operating public transport vehicles with little to no experience.\n\nConcerns were also raised over unlicensed drivers and unregistered vehicles. CCC legislator Miriam Matinenga pressed the minister on governments enforcement measures.\n\nSome people are driving vehicles without licences. Also, what is government policy with regard to ensuring that all vehicles are registered because we are noticing that some drivers are driving vehicles that have no registration numbers? she asked.\n\nMhona responded that the law requires all vehicles to be registered and insured before being used on public roads.\n\nCCC Marondera Central MP Caston Matewu called for a revamp of the Traffic Safety Council of Zimbabwe (TSCZ), which he described as toothless.\n\nWhen drivers come across the Traffic Safety Council of Zimbabwe, which has a lot of roadblocks across the country, they often laugh because it is meaningless. What is Government policy on ensuring that we give teeth to the Traffic Safety Council of Zimbabwe so they will also be able to give penalties to drivers? Matewu said.\n\nMhona replied that Parliament has the mandate to strengthen the TSCZ through legislation, noting that processes to empower the council as an agency were already underway.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/16192007/Felix-Mhona.jpg",
            "description": "<p>By Anna Chibamu Parliamentarians have raised alarm over the worsening road carnage in Zimbabwe, urging government to take urgent steps to enforce road safety regulations amid revelations that nearly 2,000 people die annually from traffic accidents. During Wednesday’s Question and Answer session, Transport Minister Felix Mhona confirmed the grim statistics, attributing many of the accidents</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/road-carnage-claims-2000-lives-annually-mps-demand-tougher-action/\">Road carnage claims 2,000 lives annually, MPs demand tougher action</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "19 Sep 2025"
        }
    ]
}