{
    "news": [
        {
            "title": "MCAZ warns of fake Cloxacillin on the market, gives ultimatum to quarantine and submit product for disposal",
            "url": "https://www.newzimbabwe.com/mcaz-warns-of-fake-cloxacillin-on-the-market-gives-ultimatum-to-quarantine-and-submit-product-for-disposal/",
            "content": "By Thandiwe Garusa\n\nTHE Medicines Control Authority of Zimbabwe (MCAZ) has issued a warning over the illegal distribution of falsified Cloxacillin capsules, which are being sold on the local market and pose a serious threat to public health.\n\nAccording to MCAZ, the fake capsules have brown, sharp cornered labels, are unmarked, and lack the aluminium foil seal found on the original product, which is labelled V-CLOX 250 and packaged with rounded orange labels.\n\nIn a statement Friday, MCAZ said Gartas Investments is one of the sources of the counterfeit product, which is being passed off as the genuine Cloxacillin 250mg manufactured by Varichem Pharmaceuticals.\n\nMCAZ urged all health facilities to quarantine and submit any falsified stock to the authority for disposal before August.\n\nMCAZ wishes to alert the public, healthcare professionals, wholesalers, pharmacies, and healthcare institutions to the presence of falsified Cloxacillin capsules being illegally distributed on the market.\n\nThe authority would like to draw the attention of all licensed pharmacies, wholesalers, public and private clinics and hospitals that they should quarantine any units of the falsified Cloxacillin 250mg capsules.\n\nThereafter, these quarantined units must be submitted to the authority for disposal by the 1st of August 2025.\n\nMCAZ continues to work closely with law enforcement agencies and supply chain stakeholders to identify and remove counterfeit medicines from the market, the statement reads.\n\nMCAZ has warned that the use of falsified medicines may result in treatment failure, harmful side effects, and a rise in antimicrobial resistance (AMR).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220910/rukwata.jpg",
            "description": "<p>By Thandiwe Garusa THE Medicines Control Authority of Zimbabwe (MCAZ) has issued a warning over the illegal distribution of falsified Cloxacillin capsules, which are being sold on the local market and pose a serious threat to public health. According to MCAZ, the fake capsules have brown, sharp cornered labels, are unmarked, and lack the aluminium</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mcaz-warns-of-fake-cloxacillin-on-the-market-gives-ultimatum-to-quarantine-and-submit-product-for-disposal/\">MCAZ warns of fake Cloxacillin on the market, gives ultimatum to quarantine and submit product for disposal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "26 Jul 2025"
        },
        {
            "title": "Climate change fuelling child marriages in Zimbabwe",
            "url": "https://www.newzimbabwe.com/climate-change-fuelling-child-marriages-in-zimbabwe/",
            "content": "By Thandiwe Garusa\n\nGIRLS in Zimbabwes marginalised communities are increasingly being married off as a desperate survival tactic by families grappling with the impact of climate change.\n\nZimbabwe is one of the countries in Africa hardest hit by the climate change phenomenon, which has resulted in hunger, poverty and displacement.\n\nSpeaking during a recent parliamentary session, Citizens Coalition for Change (CCC) Member of Parliament for Mashonaland West Mutsa Murombedzi said some of these vulnerable girls are being married off for food.\n\nRecently in Mutoko, a bright Form 2 pupil dropped out of school to marry a man twice her age, because the parents could no longer pay school fees.\n\nThe same situation was in Gokwe where a 13-year-old was removed from school after Grade 7 results came out. She was married off for groceries and a few blankets.\n\nThese girls wanted to be teachers, nurses and to be Members of Parliament. Instead, they are burdened by early pregnancies and unpaid work, Murombedzi said.\n\nEvery climate disaster resets families to survival mode, where girls are the first to be sacrificed.\n\nMurombedzi also urged Parliament to find ways to mitigate the climate change crisis as a way to save young girls from child marriages.\n\nWe must also recognise that climate change has become a threat multiplier that fuels child marriages in Zimbabwe and across Africa.\n\nClimate change is not just an environmental crisis, it is a social and gendered crisis.\n\nIn seasons of drought when crops fail and livestock die, many families are pushed deeper into desperation, parents facing hunger and unable to pay school fees and are often seen marrying off their daughter as a coping mechanism to reduce households mouth to feed or to obtain a bride price for survival.\n\nTo break this cycle, we must act on several fronts. We have to strengthen the enforcement of the law.\n\nUnless we tackle the climate crisis and build resilience in our communities, through irrigation schemes, drought-resistant crops and social safety nets, our efforts to end child marriage will be undermined, Murombedzi said.\n\nAccording to the government, last year over 3,400 girls were forced out of school as a result of early marriages and adolescent pregnancies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04025833/Teenage-Pregnancy.png",
            "description": "<p>By Thandiwe Garusa GIRLS in Zimbabwe’s marginalised communities are increasingly being married off as a desperate survival tactic by families grappling with the impact of climate change. Zimbabwe is one of the countries in Africa hardest hit by the climate change phenomenon, which has resulted in hunger, poverty and displacement. Speaking during a recent parliamentary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/climate-change-fuelling-child-marriages-in-zimbabwe/\">Climate change fuelling child marriages in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "26 Jul 2025"
        },
        {
            "title": "‘Don’t dictate to Zanu PF if you are not part of it’ — says Mutsvangwa",
            "url": "https://www.newzimbabwe.com/dont-dictate-to-zanu-pf-if-you-are-not-part-of-it-says-mutsvangwa/",
            "content": "By Anna Chibamu\n\nZANU PF is a membership-driven political formation, which brooks no counsel from non-members bent on dictating who should succeed President Emmerson Mnangagwa, a senior party official has said.\n\nThe partys Information secretary Christopher Mutsvangwa told the media this week that the upcoming party conference, to be held in Manicaland from October 13 to 18, will focus more on the countrys economy than succession issues.\n\nHowever, that is not the biggest thing the party will be interested in. The biggest thing is the economic issues and improving general welfare of Zimbabweans.\n\nThe performance of the economy is important because this creates the bond upon which Zanu PF continues to rule. It promised Zimbabweans of freedom, an army to defend themselves, independence, national consolidation and preservation of that independence, it promised people a modern economy and it is giving them.\n\nIt promised people their own national currency, it has given them. It has promised people more regional integration with our neighbours, it is giving them. This is the record which Zanu PF stands upon and not the cupping by detractors from left, right centre, Mutsvangwa said.\n\nHe explained that Zanu PF wanted to tick every box of the previous year and see how far the government had gone in achieving those benchmarks during the Manicaland indaba.\n\nHe commended the people of Manicaland whom he said, played a big role in terms of training the guerrillas during the liberation war.\n\nHe, however, blasted those outside Zanu PF for trying to bring in trivial succession issues due to their hatred of party First Secretary and President.\n\nHe alluded to party resolutions which were passed in Bulawayo in the previous conference where a resolution for President Mnangagwa to go beyond 2028 up to 2030 was passed amongst several others.\n\nWe are in the season of our conference. The dates are October 13 to 18, 2025. We are hardly two months away from the party conference.\n\nThis is an important event on the calendar of the party. The last one was held in Bulawayo.\n\nResolutions were passed including the one on 2030 and the President being the candidate for 2030. I know the President has said he is a constitutionalist; he is not prepared to go beyond 2028 when his constitutional mandate ends.\n\nSo, this is what will be decided at the party conference, leadership of the party and the future of the party. We are only two years away from the big party conference (Congress) where party leadership issues are going to be resolved, Mutsvangwa said.\n\nFurther, the Zanu PF Information secretary said it was democratic for people in the party to decide for him.\n\nHe casticated those wishing to see him go at the end of his constitutional mandate telling them off.\n\nIf you see a President who is performing so well. Some people are so excited about his performance and are saying the Constitution may say one thing, but the Constitution is a product of the people.\n\nWe would like you to continue and if it means that, we look at our Constitution to so facilitate. It is their democratic dispensation and volution to think like that and there is absolutely nothing wrong for them to think like that, Mutsvangwa highlighted.\n\nHe continued, So for people to continue to make an issue about it to say, should people think somebody whom they like should continue in power. Not its misplaced. You can also have your opinion why he shouldnt continue.\n\nYou keep your opinion but you are not a member of Zanu PF. If you are a member of Zanu PF, you can profer your views at the conference.\n\nIf you have your views and you are not a member of Zanu PF, you are not part of the club, so do not try dictate whilst outside the party, join the party and you can come to the conference with your views as a member and try to canvas your views with membership, added Mutsvangwa.\n\nMusvangwa reminded those joining the party to abide by its Constitution.\n\nMake sure that if you join the club and proffer your views, you will also be ready to accept the outcome of the majority in the party, should your views not carry the day.\n\nZanu PF is a democratic party. People have their views, and they give them in their resolutions and express them. The consummation of those ideas is another issue. It takes two; those who are advocating and those whose advocacy is targeted at, i.e. the President.\n\nThose are the people who matter in this debate. Anybody else, is by and large, irrelevant.\n\nHe revealed that.for a long time, some people did not want President Mnangagwa to be the President of the party.\n\nFor a long time, they did not want him to be the leader of the party. For a long time after he became the President of the country and leader of the party, they wanted to remove him. That is why sanctions were kept, that is why there has been a persistent debate about succession, not to state that the man is too busy running a modern economy.\n\nThat is where the attention should be but, those who are detractors cannot get out of their mindset that he should be out of power. Zanu PF is too busy modernising Zimbabwe and we members are too busy appreciating the leadership which is there.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02203435/marapira-mutsvangwa-e1743740148148.jpeg",
            "description": "<p>By Anna Chibamu ZANU PF is a membership-driven political formation, which brooks no counsel from non-members bent on dictating who should succeed President Emmerson Mnangagwa, a senior party official has said. The party’s Information secretary Christopher Mutsvangwa told the media this week that the upcoming party conference, to be held in Manicaland from October 13</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-dictate-to-zanu-pf-if-you-are-not-part-of-it-says-mutsvangwa/\">‘Don’t dictate to Zanu PF if you are not part of it’ — says Mutsvangwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "26 Jul 2025"
        },
        {
            "title": "Isiah Mupfurutsa elected new PSL boss, Chido Chizondo takes reins at ZWSL",
            "url": "https://www.newzimbabwe.com/isiah-mupfurutsa-elected-new-psl-boss-chido-chizondo-takes-reins-at-zwsl/",
            "content": "By Sports Reporter\n\nSimba Bhora chairman Isiah Mupfurutsa has been elected the new Premier Soccer League (PSL) chairman.\n\nMupfurutsa received 10 votes, defeating Masimba Chihowa who secured 8 votes.\n\nIn the first round, Mupfurutsa had garnered 8 votes, followed by Chihowa with 5, Leonard Musariri of Ngezi Platinum Stars with 3, and Dumisani Sisale of FC Platinum with 2 votes.\n\nMupfurutsa will be deputised by Highlanders chairman Kenneth Mhlope, while Dynamos chairman Moses Maunganidze and TelOnes Oscar Nduwure have been elected as members of the Emergency Committee.\n\nMeanwhile, in the Zimbabwe Womens Super League (ZWSL) election, Platinum Royals Chido Chizondo was elected the new chairperson.\n\nChizondo defeated Ntokoziso Moyo of Black Rhinos Queens in a two-horse race.\n\nShe will be assisted by Lewis Muzhara as vice-chairperson, while Mercy Makuwatsine, James Shamuyarira, Mupfudza Rugwevera, Sibusisiwe Dube, and Talent Chitsaka were elected as board members.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/25124324/Isaiah-Mupfurutsa2.jpg",
            "description": "<p>By Sports Reporter Simba Bhora chairman Isiah Mupfurutsa has been elected the new Premier Soccer League (PSL) chairman. Mupfurutsa received 10 votes, defeating Masimba Chihowa who secured 8 votes. In the first round, Mupfurutsa had garnered 8 votes, followed by Chihowa with 5, Leonard Musariri of Ngezi Platinum Stars with 3, and Dumisani Sisale of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/isiah-mupfurutsa-elected-new-psl-boss-chido-chizondo-takes-reins-at-zwsl/\">Isiah Mupfurutsa elected new PSL boss, Chido Chizondo takes reins at ZWSL</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:48",
            "date": "26 Jul 2025"
        }
    ]
}