{
    "news": [
        {
            "title": "IMF reveals $2 billion gap in Zimbabwe’s debt figures",
            "url": "https://www.newzimbabwe.com/imf-reveals-2-billion-gap-in-zimbabwes-debt-figures/",
            "content": "By Kitsepile Nyathi, The East African\n\nThe International Monetary Fund (IMF) has indicated that Zimbabwes external debt is understated by over $2 billion, a development that casts doubt on the countrys suitability for debt relief.\n\nZimbabwe, burdened with $21 billion debt, according to official figures, has been pushing for an urgent resolution with major Western creditors since the removal of long-time ruler Robert Mugabe in a military coup eight years ago, but without success.\n\nAccording to the IMFs newly released 2025 Article IV Consultation Report, Zimbabwes debt stood at a staggering $23.3 billion at the end of 2024, exposing a major discrepancy with the countrys acknowledged debt figures.\n\nThe Bretton Woods institutions findings echoed earlier observations by the African Export-Import Bank (Afreximbank), which stated in its May country brief that Zimbabwes external debt was much higher than official estimates.\n\nZimbabwe has been accumulating arrears to external creditors for over two decades due to its failure to repay loans.\n\nTotal public and publicly guaranteed debt stood at $23.3 billion (72.9 percent of Gross Domestic Product) at the end of 2024, the IMF report reads.\n\nThe external debt stock was $16.7 billion (52.5 percent of GDP). Zimbabwe has been accumulating external arrears to its official creditors since the early 2000s, estimated at $7.4 billion (23.2 percent of GDP).\n\nMore recently, the government has started accumulating arrears to external commercial creditors, estimated at $47.4 million at the end of 2024 (0.1 percent of GDP), and has suspended servicing some of its domestic debt obligations, amounting to $425 million (0.8 percent of GDP) in 2025.\n\nThe IMF said the governments economic policies did not appear sufficient to extricate the country from the debt crisis.\n\nCurrent policies are insufficient to restore debt sustainability, which will require a balanced mix of fiscal consolidation, strengthened public debt management, growth-promoting structural reforms, and external arrears resolution-paving the way for new financing from multilateral and bilateral creditors, the report added.\n\nLoan defaults\n\nZimbabwe began defaulting on loan repayments to the World Bank, the IMF, and other lenders in 2000 under the regime of the late Robert Mugabe. The defaults escalated during the height of a controversial land reform programme that began around the same time, leading to the countrys international isolation and economic ruin.\n\nThe countrys biggest Paris Club creditors are Germany, France, the United Kingdom, Japan, and the United States, with a combined external debt stock amounting to $2.9 billion-accounting for 74 percent of the total Paris Club external debt.\n\nSince 2019, Zimbabwe has been using the Structured Dialogue Platform (SDP), championed by then African Development Bank (AfDB) president Akinwumi Adesina and former Mozambican President Joaquim Chissano, to push for a debt clearance programme.\n\nThe IMF said the SDP provided a framework for engagement on three pillars: economic reforms, political-governance reforms, and farmers compensation and land tenure reforms.\n\nIt noted that while progress had been made on some sub-components, bilateral Paris Club creditors insisted that re-engagement required advances on all three pillars.\n\nA roadmap to clearing arrears to the international financial institutions including the World Bank, African Development Bank, and European Investment Bank-will be essential to facilitate an eventual debt resolution. But this would likely require support through a bridge loan, the IMF added.\n\nWhile discussions on a potential bridge loan are ongoing, creditors have called for an IMF Staff Monitoring Programme (SMP) to be in place before engaging on such financing.\n\nEarlier this year, Zimbabwe indicated that it was seeking debt relief and bridge financing of $2.6 billion through the SDPs Arrears Clearance and Debt Resolution Process.\n\nStaff indicated that the authorities programme that could be supported by an SMP would need to be broadly aligned with Article IV and recent capacity development advice, the IMF said.\n\nThe authorities have also initiated discussions with key commercial creditors on debt payment moratoria.\n\nIn July, World Bank president Ajay Banga warned that if Zimbabwe tried to go it alone, it would remain in a debt trap for the next five years.\n\nSouth Africa, which held the G20 presidency at the time, said Zimbabwe had sought support for its debt to be revamped under the G20s Common Framework. Such support could restore the countrys access to international markets for the first time in more than 20 years.\n\nThe Common Framework was created in 2020 to help poor countries bring together a diverse set of creditors to restructure debts.\n\nIt is not clear whether Zimbabwe would be eligible for treatment under the G20 Common Framework or the Heavily Indebted Poor Countries (HIPC) Initiative, due to ineligibility from protracted arrears to multilateral creditors, and in HIPCs case, because Zimbabwes income exceeds the required IDA eligibility criteria, the IMF said.\n\nHowever, as shown in other cases such as Sri Lanka and Suriname, official creditors may be willing to provide an ad hoc treatment consistent with restoring debt sustainability.\n\nThe IMF noted that Zimbabwean authorities broadly agree with the unsustainable debt assessment and reiterated their commitment to the re-engagement process.\n\nIn this context, they highlighted recent progress under the SDP, where an initial payment to farmers covered by bilateral investment agreements was welcomed by partners, the report said.\n\nThe authorities also plan to launch a fourth SDP pillar focused on debt resolution, bringing creditors together to provide updates on the governments roadmap to restoring debt sustainability.\n\nThey emphasised the urgency of the process, as financing options have narrowed due to constrained access to concessional financing from official sector creditors, limited access to non-concessional commercial lenders, and challenges in the domestic capital market.\n\nZimbabwes debt stock has risen in recent years because it resorted to seeking cheap infrastructure loans from China. However, it has not been able to repay the money due to an ongoing economic crisis characterised by hyperinflation and instability.\n\nThe country has also been mortgaging its mineral resources, such as platinum, in exchange for financial support from China. Experts warn that this route is unviable and will leave the southern African nation in a serious debt trap.\n\nThis article was originally published inThe East African.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171617/rbz-.jpg",
            "description": "<p>By Kitsepile Nyathi, The East African The International Monetary Fund (IMF) has indicated that Zimbabwe’s external debt is understated by over $2 billion, a development that casts doubt on the country’s suitability for debt relief. Zimbabwe, burdened with $21 billion debt, according to official figures, has been pushing for an urgent resolution with major Western</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-reveals-2-billion-gap-in-zimbabwes-debt-figures/\">IMF reveals $2 billion gap in Zimbabwe’s debt figures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "Crowhill residents’ bid to overturn Borrowdale Gated Community approval flops",
            "url": "https://www.newzimbabwe.com/crowhill-residents-bid-to-overturn-borrowdale-gated-community-approval-flops/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out an application by the Upper Crowhill Residents Association seeking to invalidate Mount Breezes Borrowdale Brooke Estates gated community status and to reclaim access to a contested road cutting through the estate.\n\nJustice Joel Mambara ruled that the application was fatally defective and an abuse of court process, finding that the residents association had no locus standi to approach this Court and had acted with dirty hands by continuing to occupy stands and use an illegal road without compliance certificates.\n\nThe applicants illegal actions are not merely incidental to its claim  they are central to it, Mambara said in a damning judgment. One cannot build an unlawful road through someone elses land and then ask a court to declare that road to be lawful.\n\nAt the heart of the dispute was Crowhill Road, a route Crowhill residents claimed had historically provided them access to Borrowdale Road.\n\nThe City of Harare, however, in 2015 issued a letter stating it had no objection to Mount Breezes establishing a gated community, paving the way for the installation of gates that effectively blocked Crowhill residents from using the road.\n\nThe residents argued that the Citys decision was unlawful and that the servitudes establishing the road had been extinguished when the area was subdivided in 1999. But the court dismissed their claim, stressing that the association was improperly constituted, came into existence only in 2024, and was trying to reopen issues already settled by earlier rulings.\n\nA child born in 2024 cannot retrospectively challenge decisions that its parents made in 2015, the judge said, echoing the respondents argument.\n\nMambara also condemned the association for ignoring a binding 2014 consent order that gave Crowhill Farm (Pvt) Ltd exclusive authority to represent residents in legal matters until the development is fully regularised.\n\nThe court further held that the application was in substance a review of administrative action, disguised as a declaratory application, and was therefore grossly out of time since it sought to overturn a City of Harare decision made nine years ago.\n\nDismissing the application with punitive costs, the judge warned: The courts cannot connive at or condone the applicants open defiance of the law. Citizens are obliged to obey the law of the land and argue afterwards.\n\nThe ruling cements earlier judgments affirming Mount Breezes residents right to enjoy their gated community free from trespass and effectively ends Crowhill residents long-running bid to force open access through the estate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out an application by the Upper Crowhill Residents Association seeking to invalidate Mount Breezes Borrowdale Brooke Estate’s gated community status and to reclaim access to a contested road cutting through the estate. Justice Joel Mambara ruled that the application was “fatally defective” and an abuse of court</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crowhill-residents-bid-to-overturn-borrowdale-gated-community-approval-flops/\">Crowhill residents’ bid to overturn Borrowdale Gated Community approval flops</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "Coach raised his hand and accidentally made contact with me — Ngezi Platinum Player covers for Chiragwi after sideline slap",
            "url": "https://www.newzimbabwe.com/coach-raised-his-hand-and-accidentally-made-contact-with-me-ngezi-platinum-player-covers-for-chiragwi-after-sideline-slap/",
            "content": "By Sports Reporter\n\nNgezi Platinum Stars forward McDonald Makuwe has defended his coach, Takesure Chiragwi, after the gaffer slapped him during a heated match against Dynamos on Saturday.\n\nThe incident, captured on camera, shows Makuwe attempting to calm Chiragwi, who was protesting a red card decision, before the coach struck him across the face.\n\nThe footage sparked outrage online, prompting Chiragwi to issue a public apology and resign as Warriors assistant coach.\n\nBoth the Premier Soccer League (PSL) and the Footballers Union of Zimbabwe (FUZ) condemned the incident and requested detailed reports from the club.\n\nIn a statement, however, Makuwe downplayed the altercation, insisting that the contact was accidental.\n\nCoach had already received a red card, unfortunately. During this exchange, the Head Coach inadvertently raised his hand, and in doing so, he accidentally made contact with me.\n\nI want to emphasise that this incident did not cause me any physical harm, nor did it affect our relationship, Makuwe said.\n\nThe 24-year-old added that Chiragwi had since apologised.\n\nI see Coach Chiragwi as more than just a coach; he has been both a mentor and a father figure to me during my time at the club and even before that.\n\nFollowing the incident, Coach Chiragwi apologised to me in front of the players and Mr Musariri, the club Chairman, he added.\n\nChiragwis conduct has drawn wider attention to discipline within the local league, coming barely a month after the PSL suspended Yadah FC board member Spencer Muvadi for one year after he was found guilty of assaulting the clubs goalkeeper, Godknows Gurure, in August.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter Ngezi Platinum Stars forward McDonald Makuwe has defended his coach, Takesure Chiragwi, after the gaffer slapped him during a heated match against Dynamos on Saturday. The incident, captured on camera, shows Makuwe attempting to calm Chiragwi, who was protesting a red card decision, before the coach struck him across the face. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/coach-raised-his-hand-and-accidentally-made-contact-with-me-ngezi-platinum-player-covers-for-chiragwi-after-sideline-slap/\">Coach raised his hand and accidentally made contact with me — Ngezi Platinum Player covers for Chiragwi after sideline slap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "High Court upholds dismissal of two constables over missing dagga exhibit",
            "url": "https://www.newzimbabwe.com/high-court-upholds-dismissal-of-two-constables-over-missing-dagga-exhibit/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by two police officers, Constables Robert Muganhu and David Hama, who were challenging their dismissal after being found guilty of tampering with dagga exhibits in a case that collapsed under suspicious circumstances.\n\nJustice Siyabona Musithu ruled that the officers conduct was reasonably likely to bring discredit to the police service, rejecting their claim that their acquittal in a criminal court should have protected them from disciplinary conviction.\n\nThis Court noted that the sentence imposed by the Trial Officer is not harsh or induces a sense of shock,Musithu said.\n\nThe sentence passed was appropriate, taking into consideration the gravity and seriousness of the offence committed by the appellants. A non-custodial sentence does not suffice under these circumstances.\n\nThe matter dates back to January 31, 2023, when the two officers arrested Loveness Tsoora and Aaron Muza in Glendale after finding a red plastic container of dagga, allegedly half full. The drugs were taken to Howard Police Base but later mysteriously shrank to only two twists of dagga.\n\nThe internal police tribunal found the officers guilty of disposing of most of the dagga and releasing Tsoora without proper procedure, despite the pair being acquitted of criminal charges on appeal in 2023. The disciplinary body ruled that their actions undermined public trust in the force.\n\nThe officers argued that the disciplinary tribunal erred since the High Court had already cleared them of criminal wrongdoing on the same allegations. They also insisted that no evidence was adduced beyond any reasonable doubt that they had tampered with the drugs.\n\nBut the High Court stressed that an acquittal in criminal proceedings did not bar internal disciplinary action. The present disciplinary proceedings were concerned with the manner in which the applicants had conducted themselves, which it was reckoned was likely to bring discredit to the police service, Justice Musithu wrote.\n\nLawyers for the applicants also argued that their custodial sentences were grossly irregular and too harsh given mitigating factors, suggesting that a reprimand or salary freeze would have sufficed.\n\nThe court rejected this argument. The points raised in mitigation were outweighed by the gravity and the seriousness of the offence committed by the Appellants, Justice Musithu said, siding with the Commissioner-General of Police.\n\nThe officers were also ordered to pay legal costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by two police officers, Constables Robert Muganhu and David Hama, who were challenging their dismissal after being found guilty of tampering with dagga exhibits in a case that collapsed under suspicious circumstances. Justice Siyabona Musithu ruled that the officers’ conduct “was reasonably likely to bring</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-upholds-dismissal-of-two-constables-over-missing-dagga-exhibit/\">High Court upholds dismissal of two constables over missing dagga exhibit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "‘Police are lenient’: Zimbabwe’s disabled black market currency dealers",
            "url": "https://www.newzimbabwe.com/police-are-lenient-zimbabwes-disabled-black-market-currency-dealers/",
            "content": "By Calvin Manika, Al Jazeera\n\nKenias Mutsenha had long ceased using his Zimbabwean local currency bank account, abandoning it for one trading in US dollars, as many in the economically volatile country prefer dealing with more stable foreign currencies.\n\nBut when he took on consultancy work in Harare this year and a client needed to pay him in Zimbabwe Gold, or ZiG, currency, he returned to the bank to reopen his account. There, the teller asked for a reactivation fee in ZiG notes. Again, Mutsenha only had US dollars, which the bank would not accept or exchange.\n\nI had to find cash somewhere, Mutsenha, 46, said, realising there was only one place he could go: The streets.\n\nWhile most Zimbabweans prefer trading in US dollars to avoid the pitfalls of major currency fluctuations  government institutions use local currency. At the same time, banks dont have enough ZiG notes, as the Central Bank  wanting Zimbabwe to move towards a cashless society  has not put enough cash in circulation, experts say.\n\nAs a result, people flock to Harares central business district (CBD), where there is a thriving black marketforeign exchange trading operation.\n\nSince the launch of the ZiG last year, the government has beenclamping downon informal currencydealers. But this has only created a situation where the suppliers find new avenues to explore  as Mutsenha discovered that day.\n\nFinding local currency on the street was a nightmare, he said. I wandered in the CBD until one illegal forex dealer [who said he had no cash] directed me to a certain street. I was told the person [exchanging money] is disabled on a wheelchair.\n\nOn a bustling street corner, Mutsenha found Leonard Mumba*,who used to sell mobile phone airtime at a local bus terminus but now deals in something far more lucrative, secretive, and risky.\n\nEvery day except Sundays, 43-year-old Mumba is wheeled into town by a relative. He works from about 7am to 6pm from the same spot on the corner, and is paid a weekly commission by the black market dealer who hired him.\n\nAs Mutsenha handed over his US dollar note to Mumba, he observed the subtle operations of this trade. A man came from across the road, walking, passing by the street corner. He just dropped a black satchel at this illegal forex dealer and hooked it on the wheelchair. They did not speak to each other, Mutsenha recounted.\n\nAll across the capital city, dealers like Mumba now sit in wheelchairs and on sidewalks with satchels of banknotes. Silent handoffs are not uncommon to witness: A plastic bag tossed casually at a traders feet as a supplier walks by, avoiding eye contact and accountability.\n\nAfter the 2024 introduction of the ZiG and the associated government crackdown on illegal money traders, an increasing number of people with disabilities have taken up the trade in Harare, observers and disability rights groups say.\n\nAlthough there are no clear estimates of how many people with disabilities work as black market dealers, Plaxedes Choto, a disability activist, told Al Jazeera that in the CBD alone, there are more than three dozen disabled people involved in the trade.\n\nWhile some have approached the trade organically, others, like Mumba, were recruited to be proxies for someone else.\n\nI used to sell airtime at Copacabana bus terminus, but when police continued rounding up the money changers, one of the suppliers approached me to work for him, Mumba told Al Jazeera from his street corner.\n\nDue to my condition [being in a wheelchair], police would not easily suspect me, especially in the beginning, he said. And they are lenient on arrest due to our circumstances.\n\nPeople with disabilities may be overlooked or viewed more sympathetically by the police, who are less likely to crack down on them, according to observers. Thabiso Moyo, a Harare-based social justice activist and human rights defender, told Al Jazeera this is because police stations are often not disability friendly, which creates hassles for the officers.\n\nBeing generally spared from police raids then creates a situation which allows wheelchair users to be shields and proxies in a broader system of economic survival and corruption. Real culprits hide behind the disabled.\n\nMoyo notes that the shift to front-lining disabled money traders is a tactic that allows the real suppliers of illicit street currency to stay behind the scenes and be more protected.\n\nDespite their work with sought-after US dollars, observers say there are seldom reports of disabled money traders being robbed by thieves. However, many traders say law enforcement agents approach them for bribes in exchange for allowing their operations to continue.\n\nDespite any risks, for many, including Mumba, the benefits of the job outweigh previous economic ventures. With airtime and fruits it was quite a hustle. And now everyone wants money  cash or online transfers, both in USD and ZiG. Its a lucrative business and I could not deny such a [job] offer.\n\nNot too far away, Clever Gorejena*, another street currency dealer, has been in a wheelchair since an accident a decade ago left him disabled. He dabbles in the trade to make additional income.\n\nLike Mumba, he works for someone else and is paid weekly on commission based on the profits from the transactions he makes.\n\nI took the offer as an opportunity to make money. I deal in both hard currency and online transactions using my phone. In addition to forex exchange,I also sell airtime. Those are my two major activities, he told Al Jazeera.\n\nPeople with disabilities face many hurdles in Zimbabwe, including a high cost of living due to additional care and resources they may require. On the streets of Harare, several told Al Jazeera about the stressful cost of diapers, food for their specific diets, special transport services, and a support person or aids to help them get by.\n\nAlthough Zimbabwes social welfare department gives monthly grants to people with disabilities, representatives of this community say it is a drop in the ocean. Employment prospects also remain a challenge. In 2021, Zimbabwe launched a national disability policy to close the gaps between disabled and able-bodied Zimbabweans. The policy stated the governments intention for inclusion, including employment opportunities, but four years down the line, the community say they are still excluded and often exploited.\n\nFor many, this has led to begging or vending to earn money. According to a 2017 study by the National Association of Social Workers, 57 percent of people begging in Harare have a physical disability.\n\nBeggars with disabilities have a low level of education. Forty-seven percent have no formal education. This has made it difficult for them to get employed, said the report.\n\nAs people attempt to leave begging, many are drawn to the informal sector because of the challenging economic situation, said Samantha Sibanda, the director of Signs of Hope Trust, an organisation for people with disabilities. Some fall into illegal currency dealing, while others sell what they can in the street.\n\nI think the national budget and other economic outlooks have shown that, generally, we have now moved to an informal economy, said Sibanda. But for persons with disabilities, the challenges are unique, she added, including insufficient access to education, as few schools provide accessible infrastructure. This then affects their chances of getting a formal job. And even for the employed, workplace discrimination remains a challenge.\n\nThis is a huge gap in inclusion. Our infrastructure was built without the disabled in mind, Sibanda said. The majority of the disabled find their way to city centres, in the streets or vending due to lack of opportunities.\n\nIn August, the Harare City Council conducted Operation Restore CBD Order, during which officials inspected shops and buildings to ensure their businesses were complying with the law.\n\nThe city council told Al Jazeera that although it was aware that disabled people are working in the illegal money trade in Harare, the current focus of its operation was on unlicensed shops and illegal infrastructure in the greater CBD.\n\nBut anyone operating any business within the CBD without regulation through the City of Harare is illegal, including those in the streets, added Stanley Gama, the citys spokesperson.\n\nOther concerned stakeholders say that despite government efforts to fight illegal forex trade, currency shortages and bureaucracy in the banking system drive the black market operation.\n\nIn Zimbabwe, changing foreign currency to local notes the official way is a long process, involving paperwork and banks asking for detailed information. Meanwhile, changing ZiG to foreign currency requires Central Bank approval and is near impossible, locals say. So many choose to go the black market route.\n\nNgonidzashe Mutsigo, a Harare resident, mentions other challenges for Zimbabweans.\n\nI dont have a bank account; it costs to maintain a bank account in Zimbabwe. It costs to withdraw and transact using the bank account. So I think such things are the ones that make the business of informal money changing blossom, he said.\n\nUnfortunately, even for those with bank accounts, when they want to buy the USD in the bank, they dont get it, and we meet in the streets.\n\nA black-market money supplier who provides currency to disabled traders said that, these days, ZiG notes are scarce. As the ZiG is in demand, the supplier, who requested anonymity for security reasons, told Al Jazeera, black market suppliers often source it from big businesspeople.\n\nThere are people in business and government getting tenders and paid in local currency  this is big money  millions. And the only way for them to get the USD is to come to the streets.\n\nEven though the government pays in local currency, the big shots want US dollars, he said.\n\nWe help them by looking for the greenback  and we work with our guys on the ground, including those with disabilities. We believe in numbers  the more we get these people, the quicker our money is turned into the sought-after USD.\n\nIn June, the Reserve Bank of Zimbabwe (RBZ) reported that it had achieved one year of ZiG stability.\n\nZimbabwes exchange rate has become more stable, with the difference between the official and black market rates now below 20 percent. The country also received more foreign currency  [This has] made it easier for businesses and individuals to access foreign currency for genuine needs, and helped keep the financial sector stable and healthy, said RBZ governor, John Mushayavanhu.\n\nObservers and financial experts, however, say the RBZ is not realistic about the situation on the ground, where US dollars arein demand and widely different exchange rates on the officialand parallel markets have created opportunities for illegal dealers to thrive.\n\nMeanwhile, on the streets, people with disabilities have been drawn in, too  many out of desperation or necessity.\n\nWe are living in tough times, Sign of Hopes Sibanda said. We do also have people who have been exploiting persons with disabilities since time immemorial, using them for begging, using them to run their stores while they keep their money for themselves. Recruitment by money traders wanting to stay in the shadows is the newest iteration of that.\n\nOperating a parallel market of forex or currency exchange is illegal, and we do not condone such activities, Sibanda said. But we do look forward to other opportunities that can give people with disabilities better incomes and a better life.\n\nOn his street corner, Mumba agrees. Despite some financial respite, he says currency trading does not provide real security  neither economic nor social. He hopes the government will roll out initiatives and invest in helping him and others get away fromthe criminal trade and unsafe streets of Harare.\n\nNo one knows about tomorrow. Robbers can target me, here or at home, and it will affect my family, Mumba said. My biggest fear is that the work we do is illegal and does not help in building my countrys economy.\n\n*Name changed for safety reasons\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08173329/forex-dealer.jpg",
            "description": "<p>By Calvin Manika, Al Jazeera Kenias Mutsenha had long ceased using his Zimbabwean local currency bank account, abandoning it for one trading in US dollars, as many in the economically volatile country prefer dealing with more stable foreign currencies. But when he took on consultancy work in Harare this year and a client needed to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-are-lenient-zimbabwes-disabled-black-market-currency-dealers/\">‘Police are lenient’: Zimbabwe’s disabled black market currency dealers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "Mnangagwa’s spokesperson defends Parliament’s dismissal of Mutodi as Committee Chair",
            "url": "https://www.newzimbabwe.com/mnangagwas-spokesperson-defends-parliaments-dismissal-of-mutodi-as-committee-chair/",
            "content": "By Staff Reporter\n\nPresidential Spokesperson George Charamba has defended Parliaments decision to remove Bikita South MP Energy Mutodi as Chairperson of the Parliamentary Portfolio Committee on Budget, Finance, and Economic Development, saying the move upheld both the integrity of Parliament and the doctrine of separation of powers.\n\nMutodi was dismissed from his position this week after publicly accusing Finance Ministry Permanent Secretary George Guvamatanga of soliciting bribes from government contractors.\n\nWriting on his X account under the pseudonym Dhonzamusoro007, Charamba applauded the Speaker of Parliament for acting decisively.\n\nThank you, Speaker, for upholding the integrity of Parliament and the doctrine of separation of powers.\n\nParliaments use hearings to make a case, not bald, defamatory allegations against the Executive, he wrote.\n\nCharamba further criticised what he described as an opposition ethos within certain circles of the ruling party.\n\nIt is this whole opposition ethos and expectation that Zanu PF, Zanu PF personalities and national institutions can advance opposition agenda while the opposition itself wallows in stupidity and internecine conflicts.\n\nThe hope for power as manna from Zanu PF, he added.\n\nLast week, Mutodi took to X alleging that Guvamatanga was demanding kickbacks of between 5% and 10% from ministries and departments to facilitate the release of Treasury funds.\n\nHe also accused Guvamatanga of amassing illicit wealth,including multiple properties and over 5,000 dairy cattle,allegedly valued at more than US$1 billion.\n\nMutodi went on to restate his allegations in Parliament, urging that Guvamatanga be summoned to explain himself. However, he later withdrew the claims and issued a public apology.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/15192357/George-Charamba.jpeg",
            "description": "<p>By Staff Reporter Presidential Spokesperson George Charamba has defended Parliament’s decision to remove Bikita South MP Energy Mutodi as Chairperson of the Parliamentary Portfolio Committee on Budget, Finance, and Economic Development, saying the move upheld both the integrity of Parliament and the doctrine of separation of powers. Mutodi was dismissed from his position this week</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-spokesperson-defends-parliaments-dismissal-of-mutodi-as-committee-chair/\">Mnangagwa’s spokesperson defends Parliament’s dismissal of Mutodi as Committee Chair</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "Zimbabwe embassy takes passports outreach to Scotland, Ireland with Diaspora Insurance support",
            "url": "https://www.newzimbabwe.com/zimbabwe-embassy-takes-passports-outreach-to-scotland-ireland-with-diaspora-insurance-support/",
            "content": "By UK Correspondent\n\nLONDON: The Zimbabwean embassy in United Kingdom (UK) will this month take its consular outreach programme to Scotland and Ireland, relieving many nationals of the long journey to London for services.\n\nThe outreach is again supported byDiaspora Insuranceas the company continues its partnership with embassies of African nationalities it now covers which have since increased to 25.\n\nAccording to a statement released by Zimbabwe House in London, the first stop in Scotland will be Glasgow from 13 to 14 October after which the programme will move to Dundee from October 15 to 16.\n\nApart from passport applications, other services available include, temporary travel documents, birth registrations, name changes through marriage or divorce as well as applications for police clearance.\n\nMeanwhile, from Scotland the outreach will move to Ireland, beginning with Belfast on the 27thand 28thof October, shifting to Dublin from the 29thto the 31stof October.\n\nDiaspora Insurances partnership with the embassy started in July this year when the company hosted the embassy for a week at its Birmingham global headquarters with hundreds of people getting their consular concerns attended to.\n\nCommenting on the development at the time, a company representative said, We are pleased to support the Zimbabwe Embassys consular services outreach programme.\n\nProviding a platform for such essential services not only helps facilitate easier access to consular assistance but also demonstrates our commitment to serving the needs of the Zimbabwean community here.\n\nWe look forward to continuing this collaboration and working together to ensure that our community members receive the support and services they deserve.\n\nManagement said the head office facilities were available not just to the Zimbabwe community but all the 25 African nationalities the company covers across the globe.\n\nEstablished more than 14 years ago,Diaspora Insurancehas grown exponentially over the years with its bespoke funeral cash plan product providing critical financial intervention which ensures Africans in the Diaspora do not endure the indignity of GoFundMe appeals to deal with end-of-life expenses.\n\nWith no medicals asked, African transnational citizens can cover themselves in the Diaspora as well as family back home with a product that removes the double trauma of bereaving a loved one while also begging for financial assistance to help with funeral costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/08192042/Embassy-Outreach-DI.png",
            "description": "<p>By UK Correspondent LONDON: The Zimbabwean embassy in United Kingdom (UK) will this month take its consular outreach programme to Scotland and Ireland, relieving many nationals of the long journey to London for services. The outreach is again supported by Diaspora Insurance as the company continues its partnership with embassies of African nationalities it now</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-embassy-takes-passports-outreach-to-scotland-ireland-with-diaspora-insurance-support/\">Zimbabwe embassy takes passports outreach to Scotland, Ireland with Diaspora Insurance support</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        },
        {
            "title": "Zimbabwe set to implement “very ugly” measures against drug abuse",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-to-implement-very-ugly-measures-against-drug-abuse/",
            "content": "By Staff Reporter\n\nPRESIDENTIALspokesperson George Charamba has warned that the government is preparing to introduce harsh measures to curb drug abuse, cautioning that those involved in selling or using illicit substances should brace for very ugly consequences.\n\nThis comes at a time when Zimbabwe is grappling with an alarming rise in drug and substance abuse cases, particularly among young people.\n\nPosting on one of his X handles under the pseudonym Jamwanda, Charamba wrote, Guys get warned: We are contemplating very ugly measures for those involved in peddling or consuming drugs.\n\nIt is going to be really ugly.\n\nWith the high rates of unemployment among the youth in Zimbabwe, many have turned to harmful drug use, often with minimal chances of full recovery.\n\nSome of the most potent drugs abused by young people are homemade mixtures, including substances like sodium polyacrylate, commonly known as waterlock, which are produced in backyards.\n\nSodium polyacrylate is an absorbent for urine in diapers and is also found in some detergents.\n\nDrug dealers are reportedlytaking advantage of the countrys porous borders to smuggle in drugs such as crystal meth, heroin, cocaine and cough mixtures like Broncleer, fueling the rapidly expanding drug market.\n\nPresident Emmerson Mnangagwa last year launched a multi-sectoral drug and substance abuse plan to fight the scourge.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/15161941/Drug-Use-e1623770429846.jpg",
            "description": "<p>By Staff Reporter PRESIDENTIAL  spokesperson George Charamba has warned that the government is preparing to introduce harsh measures to curb drug abuse, cautioning that those involved in selling or using illicit substances should brace for “very ugly” consequences. This comes at a time when Zimbabwe is grappling with an alarming rise in drug and substance abuse</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-to-implement-very-ugly-measures-against-drug-abuse/\">Zimbabwe set to implement “very ugly” measures against drug abuse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:46",
            "date": "09 Oct 2025"
        }
    ]
}