{
    "news": [
        {
            "title": "Man caged 20 years for raping four-year-old niece",
            "url": "https://www.newzimbabwe.com/man-caged-20-years-for-raping-four-year-old-niece/",
            "content": "By Staff Reporter\n\nA Mutasa man will spend 17 years behind bars after he was found guilty of raping his four-year-old niece.\n\nThe man was convicted after a full trial during which he denied the allegations.\n\nHe was initially slapped with a 20-year jail term.\n\nHowever, three years of his sentence were suspended conditionally leaving him to serve 15 years of effective jail time.\n\nProsecutors proved that the incident occurred on an unknown date this year during the afternoon when the offender lured the child to his bedroom.\n\nIn the bedroom, he undressed himself and the child, lay on his back, placed her on his stomach, and raped her.\n\nThe offence came to light when a neighbour overheard the complainant disclosing the incident to another child during playtime on the 7th of June 2024, and advised her mother, it was proved.\n\nThe complainant was taken to the hospital for a medical examination and penetration was confirmed leading to the perpetrators arrest.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter A Mutasa man will spend 17 years behind bars after he was found guilty of raping his four-year-old niece. The man was convicted after a full trial during which he denied the allegations. He was initially slapped with a 20-year jail term. However, three years of his sentence were suspended conditionally leaving</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-caged-20-years-for-raping-four-year-old-niece/\">Man caged 20 years for raping four-year-old niece</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "OK Zimbabwe says ZWG tight policy choking liquidity",
            "url": "https://www.newzimbabwe.com/ok-zimbabwe-says-zwg-tight-policy-choking-liquidity/",
            "content": "By Business Reporter\n\nLEADING retailer, OK Zimbabwe has criticized the tight policy put in place by monetary authorities for choking market liquidity in the name of preserving exchange rate stability.\n\nPresenting performance for the half years period ended September 30 2024, OK Zimbabwe group chairman, Herbert Nkala said while the move by the central bank to devalue the local unit by 43% triggered positives, some negative impacts also came along.\n\nThe devaluation of the ZWG towards the end of the financial period in September 2024 managed to reset the market, minimizing the differential in exchange rates. However, the measures introduced to preserve the value of the ZWG which include the revision of the standard and statutory reserve requirements tightened liquidity and have adversely impacted access to funding, he said.\n\nNkala said the move to suspend the Foreign Exchange Auction System which was superseded by an interbank foreign exchange market under a willing-buyer-willing-seller (WBWS) trading arrangement did not help matters at hand after the shortage of foreign currency in the formal banking sector persisted with pressure on the exchange rate resulting in an increased insistence on US$ settlement.\n\nDespite the challenges in the trading environment during the half-year period, the Group realised growth in both sales volumes and revenues.\n\nSales volumes went up by 27.69% as compared to the prior period while the gross profit margin improved from 16.83% in the prior period to 19.64% in the current period.\n\nThe growth in volume was bolstered by a successful OK Grand Challenge promotion which included the OK Mart stores for the first time which resulted in growth in the contribution of bulk sales compared to the prior period.\n\nOther expenses went up by 16,29% from US$17,3 million in the prior period to US$20,17 million in the current period largely due to the increased cost of energy supply which went up from US$5 million in the prior year to US$8,2 million.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/01111958/OK-Zim-e1577877625939.jpg",
            "description": "<p>By Business Reporter LEADING retailer, OK Zimbabwe has criticized the tight policy put in place by monetary authorities for choking market liquidity in the name of preserving exchange rate stability. Presenting performance for the half year’s period ended  September 30 2024, OK Zimbabwe group chairman, Herbert Nkala said while the move by the central bank</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ok-zimbabwe-says-zwg-tight-policy-choking-liquidity/\">OK Zimbabwe says ZWG tight policy choking liquidity</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zimbabwe can turn the table against Nigeria – coach",
            "url": "https://www.newzimbabwe.com/zimbabwe-can-turn-the-table-against-nigeria-coach/",
            "content": "TheSunNg\n\nAhead of the 2026 World Cup qualifier, the coach of the Warriors of Zimbabwe, Michael Nees insists they can turn their situation around in the qualifier, BSNSports.com.ng reports.\n\nWhile speaking to FARpost, the coach picked the game against the Super Eagles of Nigeria and the Cheetahs of Benin as the matches to achieve their objectives.\n\nHonestly, its not yet all lost in the World Cup qualifiers. We have to do everything to turn the shape around in our matches against Benin and Nigeria in March.\n\nWe dont know yet when the players are going to be available for us. December has a lot of uncertainty.\n\nWe have three groups of players: those outside of Africa, players in South Africa and players here in Zimbabwe.\n\nWe need to know to plan. When are these players available? But it can only be done if we know. We must all pull in one direction to try and turn the ship around in the World Cup qualification.\n\nWe are in the last position. When we select players, we need players who are match fit. We need them to have played at least three or four league matches, Nees added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/04023533/warriors-2-scaled.jpeg",
            "description": "<p>TheSunNg Ahead of the 2026 World Cup qualifier, the coach of the Warriors of Zimbabwe, Michael Nees insists they can turn their situation around in the qualifier, BSNSports.com.ng reports. While speaking to FARpost, the coach picked the game against the Super Eagles of Nigeria and the Cheetahs of Benin as the matches to achieve their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-can-turn-the-table-against-nigeria-coach/\">Zimbabwe can turn the table against Nigeria – coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "Convergence Of Religions: Connecting with God in Zimbabwe’s mountains",
            "url": "https://www.newzimbabwe.com/convergence-of-religions-connecting-with-god-in-zimbabwes-mountains/",
            "content": "By Calvin Manika | Religion Unplugged\n\nMountains form part of the breathtaking scenery and wildlife sanctuaries of Zimbabwe. They are also historically connected to the lives in nearby communities that call this place home. Pre-independence, most locals used hills and mountains to worship ancestors, believing that the spirit of the departed lives in the cool places of the mountains.\n\nA change in religion and use of places has increased over the past four decades. In fact, mountains have been used by different religions to connect with God.\n\nLocated 30 kilometers (18 miles) outside Harare, the capital of Zimbabwe, is a peri-urban sprawling area known as Domboshava. The settlement is known because of its rocky mountains, a range of granite rocks. Mawanga Mountain in the area is the most popular spot, with its large cave. It serves as a sacred site for worship and pilgrimage, emphasizing the historical and spiritual significance of mountains in various religious practices.\n\nA local theology scholar, Charles Pembe, said some independent African churches are no longer denouncing the use of heritage sites for religious beliefs and practices.\n\nInstead, several Christians now come either individually or in small groups to perform their prayers at the mountains, he said. We have heard a lot of pilgrims saying they have met God on a personal level in these mountains compared to church buildings where they congregate every Sunday and other weekdays. It is subjective though.\n\nChurches across Zimbabwe of various denominations climb mountains to seek God and find spiritual uplifting. Most pilgrims frequently pray for the mountains all night long, or they climb early in the morning and remain until the evening. The Domboshava Mountains see a flurry of activity, mostly from Friday through Sunday. Religious communities travel to these mountains from throughout the African country.\n\nDomboshavas vast rocky mountains have enough room to hold hundreds of pilgrims. Of late each church has informally selected their pace, making it possible for churches to pray separately, Pembe added.\n\nVarious pilgrims use the mountains for prayers and for conducting healing sessions. This reflects a broader trend of associating mountains with miracles and spiritual encounters across many cultures and faiths.\n\nZimbabwe today is shared by a diverse populace exposed to different religions and religious ways during their upbringings such as African Traditional Religion, Christianity and Islam, among several others. Conflicts between Christian religious groups and African traditionalists who claim total authority over the site are not always visible, but they do exist.\n\nIn Zimbabwean society, the two most common religions are Christianity and African traditional religion. Its interesting to see that the management of many Zimbabwean cultural sites has prioritized the resources monumentality over their spiritual significance, said Ratidzo Matarure, a local traditional leader.\n\nDomboshava is a heritage site that both locals and tourists can visit. Those sites are controlled by the National Museums and Monuments of Zimbabwe. Despite that, the organization does not easily grant permission for prayers and other religious activities. In Domboshava, for example, Christians have been left to oversee and organize vigils and other activities.\n\nConservative and traditional churches, like the United Methodist Church, have a rich history of mountain prayer dating back decades.\n\nAlthough mountain climbing is a demanding and painful experience, pilgrims claim that it produces fruitful results. One of the pilgrims who has visited the mountains several times said the visits were not in vain and that her life has been changed since she started the praying in the mountains.\n\nI come here to pray for different issues, Tanaka Chiendambuya said. The visits have greatly changed my life and impacted my faith in God. I have seen a change in my family and obtained many blessings.\n\nAs thousands climb these mountains each year, those with resources have always been known to travel to Egypt, climbing Mount Sinai in Israel and various sites from the Bible located in Turkey.\n\nMost churches base the idea of connecting with God in mountains on the Bible, where Jesus looked for a place to serve and connect with God, Pembe said. From that vantage point, many people pray on mountains.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26043802/gomo-remuchinjikwa.jpg",
            "description": "<p>By Calvin Manika | Religion Unplugged Mountains form part of the breathtaking scenery and wildlife sanctuaries of Zimbabwe. They are also historically connected to the lives in nearby communities that call this place home. Pre-independence, most locals used hills and mountains to worship ancestors, believing that the spirit of the departed lives in the cool</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/convergence-of-religions-connecting-with-god-in-zimbabwes-mountains/\">Convergence Of Religions: Connecting with God in Zimbabwe’s mountains</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "More than 1,500 prisoners escape in Mozambique amid post-election unrest",
            "url": "https://www.newzimbabwe.com/more-than-1500-prisoners-escape-in-mozambique-amid-post-election-unrest/",
            "content": "AFP\n\nMore than 1,500 prisoners escaped from a prison near Maputo on Wednesday, taking advantage of the third day of unrest triggered by the controversial confirmation of the long-ruling Frelimo party as the winner of recent elections.\n\nA total of 1,534 detainees escaped the high-security prison located about 15 kilometers from the capital, national police chief Bernardino Rafael said at a press conference.\n\nAmong those attempting to escape, 33 were killed and 15 were wounded in clashes with prison staff, he added.\n\nA search, backed by the army, led to the arrests of about 150 fugitives, he said.\n\nAround 30 of the prisoners were linked to armed groups that have been behind unrest and attacks in the northern province of Cabo Delgado for the past seven years.\n\nWe are particularly concerned about this situation, Rafael said.\n\nThe Portuguese-speaking African countrys highest court confirmed on Monday that Frelimo, in power since 1975, won the October 9 presidential election, which had already triggered weeks of unrest.\n\nGroups of protesters approached the penitentiary on Wednesday, creating confusion and triggering unrest inside, where inmates ended up knocking down a wall through which they escaped, Rafael said.\n\nBarricades remained in several areas of the capital Wednesday, limiting movements, as acts of vandalism continued.\n\nIn addition to the ransacking of stores and public buildings Monday, ambulances were set ablaze along with a drugstore and other businesses, according to an AFP correspondent.\n\nSome demonstrators also set up tables in the streets to occupy the space while celebrating Christmas with family or neighbors, an AFP journalist witnessed in several working-class districts of Maputo.\n\nMondays confirmation of the election results came despite claims of irregularities from many observers.\n\nFrelimo leader Daniel Chapo won 65.17% of the vote, about 5 percentage points less than the initial results declared by the countrys electoral commission.\n\nChapos main challenger, exiled opposition leader Venancio Mondlane, has claimed the election was rigged, sparking fears of violence between rival party supporters.\n\nThe unrest has led to the deaths of at least 150 people, according to reports from several nongovernmental organizations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26043409/Screenshot-2024-12-26-at-06.32.58-e1735187679886.png",
            "description": "<p>AFP More than 1,500 prisoners escaped from a prison near Maputo on Wednesday, taking advantage of the third day of unrest triggered by the controversial confirmation of the long-ruling Frelimo party as the winner of recent elections. A total of 1,534 detainees escaped the high-security prison located about 15 kilometers from the capital, national police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-than-1500-prisoners-escape-in-mozambique-amid-post-election-unrest/\">More than 1,500 prisoners escape in Mozambique amid post-election unrest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zimbabwe’s Foreign Direct Investment inflow rise to US$588 million but still lag behind in the region, labour blames tax burden",
            "url": "https://www.newzimbabwe.com/zimbabwes-foreign-direct-investment-inflow-rise-to-us588-million-but-still-lag-behind-in-the-region-labour-blames-tax-burden/",
            "content": "By Alois Vinga\n\nFOREIGN Direct Investment (FDI) to Zimbabwe has slightly improved to US$588 million butremains very low when compared to other countries in the region.\n\nA 2025 Post-Budget Analysis Paper prepared by the Zimbabwe Congress of Trade of Unions (ZCTU) says thebusiness environment remains challenging with the cost of doing business relatively high.\n\nAccording to UNCTAD, FDI inflows into Zimbabwe increased from US$250 million in 2021 to US$395 million in 2022 and US$588 million in 2023. However, FDI inflows were US$5.2 billion in South Africa; US$2.5 billion in Mozambique; US$2.3 billion in Namibia; US$208 million in Malawi; US$198 million in Botswana; and US$108 million in Zambia, the analysis said.\n\nThe labour organ blamed the countrys huge tax burden as chief among the causes prompting limited revenue flows.\n\nThe paper argues that no country can prosper with high taxes (Ireland-in 2015 Ireland grew by 26%). It says high taxation results in high informality and low confidence. We need lesser and lower taxes.\n\nAccording to the Chamber of Mines of Zimbabwe (CoMZ), the countrys effective tax rate for miners  69% in 2024  has already surpassed those of Zambia (60%), the Democratic Republic of the Congo (61%), Ghana (56%), and South Africa (44%), placing a significant strain on Zimbabwean firms competitiveness.\n\nThe mining sector faces a complex plethora of 157 separate charges, ranging from US$4,000 to US$15,000, imposed by Rural District Councils, government ministries and agencies.\n\nThiscomes on the back of yet another wave of high taxation measures imposed by Finance Minister Mthuli Ncube in the 2025 National Budget.\n\nOverall, all these challenges have left the local economy with a huge competitiveness gap implying that Zimbabwean businesses and products are not able to effectively and successfully compete with businesses and products from other countries, the report said.\n\nThe labour organ contends that such an economic structure hurts job creation as well as the quality of employment on offer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/27145047/Mthuli-Ncube.png",
            "description": "<p>By Alois Vinga FOREIGN Direct Investment (FDI) to Zimbabwe has slightly improved to US$588 million but remains very low when compared to other countries in the region. A 2025 Post-Budget Analysis Paper prepared by the Zimbabwe Congress of Trade of Unions (ZCTU) says the business environment remains challenging with the cost of doing business relatively high. “According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-foreign-direct-investment-inflow-rise-to-us588-million-but-still-lag-behind-in-the-region-labour-blames-tax-burden/\">Zimbabwe’s Foreign Direct Investment inflow rise to US$588 million but still lag behind in the region, labour blames tax burden</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "SADC chair Mnangagwa endorses Mozambique election results, urges peaceful transition as post-election violence death toll rises to 151",
            "url": "https://www.newzimbabwe.com/sadc-chair-mnangagwa-endorses-mozambique-election-results-urges-peaceful-transition-as-post-election-violence-death-toll-rises-to-151/",
            "content": "By Thandiwe Garusa\n\nSADC chairman President Emmerson Mnangagwa has acknowledged the Constitutional Council of Mozambiques ruling, which upheld FRELIMOs victory in the October 9 general elections and urged peace and stability.\n\nMozambique has witnessed violent protests since late October, when the electoral body declared FRELIMOs Daniel Chapo the winner. Venancio Mondlane of the opposition party, the Optimist Party for the Development of Mozambique (Podemos), rejected the outcome, mounting allegations of electoral irregularities.\n\nAccording to Mozambican authorities, at least 21 people, including two police officers had been killed in the violence which erupted after the Constitutional Council upheld Chapos victory on December 23.\n\nAn electoral watchdog, Plataforma Decide says this has brought the death toll in the country to 151 since the post-election violence erupted on October 21.\n\nIn a statement, Mnangagwa said that the courts decision exhausts all lawful processes and aligns with Mozambiques national laws and SADCs election guidelines.\n\nThe Southern Africa Development Community, SADC, notes and acknowledges the ruling and confirmation on Monday, 23rd December 2024, by the Constitutional Council of Election results held in the Republic Mozambique on 9th October this year.\n\nThe ruling by that countrys top electoral court, which upheld FRELIMO Partys victory, completes and thus exhausts all lawful processes on determining election results, in line with that countrys national laws, and in keeping with SADCs election guidelines and expectations.\n\nSADC thus expects all parties to the electoral process, both individually and collectively, to abide by the decision of the Council which should provide a constitutional way forward for the country, and facilitate the way to greater peace, normalcy and stability in the interest of all Mozambicans.\n\nMnangagwa and his Zanu PF party have been accused of interfering in Mozambiques election and facilitating rigging as videos circulating online show Zimbabwean nationals voting in the Mozambican elections.\n\nHe added that SADC stands ready to assist the incoming government and the people of Mozambique in consolidating their electoral democracy based on the aforesaid court decision, which should be held sacrosanct by all.\n\nFurther, SADC urges the international community to respect the sovereign will of the people and the Republic of Mozambique, exhorting all concerned to constructively support all processes towards peace, law and order which the country and people sorely need and deserve.\n\nMeanwhile, Mondlane has vowed to install himself as president on January 15, the day that Chapo is expected to assume office.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26042227/mnangagwa-sadc.jpg",
            "description": "<p>By Thandiwe Garusa SADC chairman President Emmerson Mnangagwa has acknowledged the Constitutional Council of Mozambique’s ruling, which upheld FRELIMO’s victory in the October 9 general elections and urged peace and stability. Mozambique has witnessed violent protests since late October, when the electoral body declared FRELIMO’s Daniel Chapo the winner. Venancio Mondlane of the opposition party,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-chair-mnangagwa-endorses-mozambique-election-results-urges-peaceful-transition-as-post-election-violence-death-toll-rises-to-151/\">SADC chair Mnangagwa endorses Mozambique election results, urges peaceful transition as post-election violence death toll rises to 151</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "Zimbabwe to give free entry to spectators for country’s first Boxing Day Test in 28 years",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-give-free-entry-to-spectators-for-countrys-first-boxing-day-test-in-28-years/",
            "content": "NDTV\n\nThis is an extraordinary milestone for Zimbabwe Cricket and our fans. By offering free entry, we want to share this historic occasion with as many cricket lovers as possible, creating an electric atmosphere to inspire our players and celebrate the spirit of the game, said Givemore Makoni, ZC Managing Director.\n\nThe last time Zimbabwe played a home Boxing Day Test, it was in 1996, which ended in a rain-affected drawn match against England at Harare Sports Club. Since then, Zimbabwe have only played Boxing Day Tests abroad against New Zealand in 2000 and South Africa in 2017, the latter being a pink-ball day-night fixture in Port Elizabeth.\n\nMeanwhile, Zimbabwe have called up right-arm fast bowler Victor Nyauchi to replace Takudzwa Chataira, who suffered a right-side strain during the teams practice session earlier this week.\n\nChataira was among the seven uncapped players initially selected for the series. His replacement Nyauchi, an experienced bowler with nine Test matches under his belt and 20 wickets to his name, brings additional depth to the hosts bowling attack.\n\nThursdays match, despite a rain threat looming on all five days, will be Zimbabwes second Test of 2024 after playing in a one-off Test against Ireland at Belfast in July, where they lost by four wickets. Zimbabwe lost T20I series to Afghanistan 2-1, and was followed by them losing ODI series to the visitors 2-0.\n\nZimbabwe Test squad:Craig Ervine (captain), Ben Curran, Brian Bennett, Johnathan Campbell, Joylord Gumbie, Trevor Gwandu, Takudzwanashe Kaitano, Tadiwanashe Marumani, Brandon Mavuta, Nyasha Mayavo, Blessing Muzarabani, Dion Myers, Richard Ngarava, Newman Nyamhuri, Victor Nyauchi, Sikandar Raza, Sean Williams\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/07060758/cricket-2.png",
            "description": "<p>NDTV Zimbabwe Cricket (ZC) has announced free entry for spectators to the Queens Sports Club in Bulawayo for the upcoming two-match Test series against Afghanistan, starting with the Boxing Day game on Thursday. In a statement, ZC said the decision comes in the wake of its efforts to celebrate the country’s first Boxing Day Test</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-give-free-entry-to-spectators-for-countrys-first-boxing-day-test-in-28-years/\">Zimbabwe to give free entry to spectators for country’s first Boxing Day Test in 28 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "Bulawayo Shutdown: Winky D’s ultimate showdown",
            "url": "https://www.newzimbabwe.com/bulawayo-shutdown-winky-ds-ultimate-showdown/",
            "content": "By Darlington Gatsi\n\nBULAWAYO is buzzing with anticipation as musical giants Winky D and Jah Prayzah descend on the countrys second-largest city Friday for the shutdown at the Zimbabwe International Trade Fair (ZITF).\n\nThe Bulawayo Shutdown is arguably the last major musical event on the calendar this year as 2024 draws to a close.\n\nThe two maestros will be backed by Freeman, Saintfloew, Feli Nandi, Bulawayos Insimbi Zezhwane, and Mzoe7, among a host of other artists.\n\nThe shutdown caps a memorable early year for Bulawayo on the arts scene.\n\nThis will be the first time Winky D and Jah Prayzah share the stage in Bulawayo, adding a unique twist to the show.\n\nThe event, organised by Harris Entertainment, will be special for Winky Ds die-hard fans as it will be his last performance of the year.\n\nWinky D has been forced to shelve his annual shutdown at the Harare International Conference Centre (HICC) after being elbowed out by gospel musician Everton Mlalazi.\n\nMlalazi will be hosting his end-of-year event at HICC on December 31, creating a dilemma for Winky D and his dedicated fans.\n\nWinky D will be hoping to deliver a scintillating performance, capping a brilliant year that saw his music return to national radio and television after a one-year ban. His music was banned on State media after the release of Eureka Eureka in 2023 which had hard-hitting social commentary songs.\n\nThe dancehall kingpin has been a regular feature at the Bulawayo Shutdown, with Jah Prayzah also making his return to the City of Kings after a long absence.\n\nAdvance tickets for the mega event are being sold for US$10 for ordinary entry, with VIP tickets priced at US$40.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/16133707/winky-5-scaled.jpg",
            "description": "<p>By Darlington Gatsi BULAWAYO is buzzing with anticipation as musical giants Winky D and Jah Prayzah descend on the country’s second-largest city Friday for the shutdown at the Zimbabwe International Trade Fair (ZITF). The Bulawayo Shutdown is arguably the last major musical event on the calendar this year as 2024 draws to a close. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bulawayo-shutdown-winky-ds-ultimate-showdown/\">Bulawayo Shutdown: Winky D’s ultimate showdown </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        },
        {
            "title": "Mozambique’s opposition leader announces to install himself as president on Jan. 15",
            "url": "https://www.newzimbabwe.com/mozambiques-opposition-leader-announces-to-install-himself-as-president-on-jan-15/",
            "content": "Anadolu Agency\n\nDespite a ruling by Mozambiques top court earlier this week declaring Daniel Chapo of the ruling Mozambique Liberation Front (Frelimo) as the winner of the October 9 polls, opposition leader Venancio Mondlane has vowed to install himself as president on January 15, claiming his mandate has been stolen.\n\nOn Monday, the Constitutional Council confirmed that Chapo had won the disputed presidential election on October 9, extending the partys 49-year rule. However, it reduced his victory margin from 71% to 65% of the vote.\n\nMondlane of the Optimist Party for the Development of Mozambique (Podemos) announced to his supporters on social media late Tuesday that he will assume the presidency on January 15, the same day that Chapo is expected to be sworn in.\n\nMozambique has seen violent protests since late October, when the electoral authority declared 47-year-old Chapo the winner with 71% of the vote, defeating Mondlane, who secured 20% of the ballot.\n\nMondlane rejected the results, claiming widespread vote rigging and calling on his supporters to protest. The Constitutional Council was then tasked with handling the case.\n\nFresh protests erupted immediately following the court announcement, and 21 people were confirmed killed over two days of violence, which included attacks on gas stations, police stations, and banks.\n\nA total of 236 acts of serious violence have been reported across the country, which so far has 25 wounded and about 21 losing lives, Interior Minister Pascoal Ronda told journalists.\n\nThe latest fatalities brought the death toll in the country to 151 since Oct. 21, according to Plataforma Decide, an election monitoring group.\n\nProtesters have been accused of vandalizing police stations and other public institutions. While civil society and rights groups accuse Mozambican security officials of using excessive force in quelling protests.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/21024647/venancio-mondlane-moza-scaled.jpg",
            "description": "<p>Anadolu Agency Despite a ruling by Mozambique’s top court earlier this week declaring Daniel Chapo of the ruling Mozambique Liberation Front (Frelimo) as the winner of the October 9 polls, opposition leader Venancio Mondlane has vowed to install himself as president on January 15, claiming his mandate has been stolen. On Monday, the Constitutional Council</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mozambiques-opposition-leader-announces-to-install-himself-as-president-on-jan-15/\">Mozambique’s opposition leader announces to install himself as president on Jan. 15</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "26 Dec 2024"
        }
    ]
}