{
    "news": [
        {
            "title": "One Direction’s Zayn Malik and Louis Tomlinson embark on emotional road trip series",
            "url": "https://www.newzimbabwe.com/one-directions-zayn-malik-and-louis-tomlinson-embark-on-emotional-road-trip-series/",
            "content": "IOL\n\nOne Directions former band members, Louis Tomlinson and Zayn Malik, are getting back together for a fun and heartfelt road trip series.\n\nThe three-part documentary, which is set to premiere on Netflix, will show the two stars as they explore America while reflecting on their lives and the tough times theyve faced.\n\nAround a year ago, tragic news struck the music world with the passing of their friend and bandmate Liam Payne.\n\nDuring an emotional tribute on stage, Malik called Payne his brother, and Tomlinson described him as the most vital part of One Direction.\n\nThis series is said to give them a chance to talk more about their special bond with Payne, making it a truly touching experience for fans.\n\nThe untitled docuseries will be directed by Nicola Marsh, who recently did Demi Lovatos Child Star documentary.\n\nThe series has reportedly already started filming and is expected to show the duo reconnecting and going on an adventure across America, including to Maliks home in Pennsylvania.\n\nA statement read: The series is a rare look inside the world of two of the most famous, and most private, men on the planet opening up about life, loss and fatherhood.\n\nWhile fans might hope to see other former bandmates like Harry Styles and Niall Horan, it appears they wont be part of this documentary.\n\nInstead, the series aims to captivate the many One Direction fans all over the world, making it another great addition to Netflixs collection of celebrity documentaries like Victoria, which features former Spice Girls band member and fashion icon, Victoria Beckham and Eddie Murphys Eddie.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05065641/one-direction.png",
            "description": "<p>IOL One Direction’s former band members, Louis Tomlinson and Zayn Malik, are getting back together for a fun and heartfelt road trip series. The three-part documentary, which is set to premiere on Netflix, will show the two stars as they explore America while reflecting on their lives and the tough times they’ve faced. Around a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-directions-zayn-malik-and-louis-tomlinson-embark-on-emotional-road-trip-series/\">One Direction’s Zayn Malik and Louis Tomlinson embark on emotional road trip series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Sheasham FC pulls out of Central Region Division One, citing lack of fair play",
            "url": "https://www.newzimbabwe.com/sheasham-fc-pulls-out-of-central-region-division-one-citing-lack-of-fair-play/",
            "content": "By Sports Reporter\n\nFormer Premier Soccer League outfit Sheasham FC has pulled out of the ZIFA Central Region Division One League, accusing the competition of lacking fair play.\n\nThe Gweru-based side, which was second on the log with 69 points, just one behind leaders Hardrock FC, announced its withdrawal on Saturday evening after a 3-2 defeat to Midlands State University (MSU).\n\nIn a statement, the club confirmed both its mens and womens teams were withdrawing.\n\nIt is with a heavy heart that we announce the withdrawal of both Sheasham FC and Sheasham Gweru Queens from their respective leagues.\n\nThis decision has been made due to the ongoing issue of an uneven playing field, which compromises the integrity of the competition in the ZIFA Central Region Soccer League (ZCRSL), read part of the statement.\n\nThe club accused the ZCRSL of ignoring repeated concerns over poor officiating and biased treatment.\n\nDespite our repeated concerns regarding poor officiating and other related issues, we have seen these matters ignored by the ZCRSL. Consequently, we believe there is no justification for our continued participation in a competition that appears to be predetermined.\n\nSheasham thanked its fans and partners for their support during what it described as a painful decision.\n\nWe extend our heartfelt gratitude to our beloved supporters, partners, and sponsors for their unwavering support during this time. Your commitment has been invaluable to us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05065328/WhatsApp-Image-2025-10-05-at-07.49.03.jpeg",
            "description": "<p>By Sports Reporter Former Premier Soccer League outfit Sheasham FC has pulled out of the ZIFA Central Region Division One League, accusing the competition of lacking fair play. The Gweru-based side, which was second on the log with 69 points, just one behind leaders Hardrock FC, announced its withdrawal on Saturday evening after a 3-2</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sheasham-fc-pulls-out-of-central-region-division-one-citing-lack-of-fair-play/\">Sheasham FC pulls out of Central Region Division One, citing lack of fair play</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Parirenyatwa, Mpilo Hospitals go without cancer machines as Treasury stalls funding",
            "url": "https://www.newzimbabwe.com/parirenyatwa-mpilo-hospitals-go-without-cancer-machines-as-treasury-stalls-funding/",
            "content": "By Anna Chibamu\n\nTreasury has delayed the release of US$27.5 million earmarked for the purchase of cancer machines, leaving Zimbabwes two largest referral hospitals, Parirenyatwa Group of Hospitals in Harare and Mpilo Central Hospital in Bulawayo, without life-saving equipment for over three years.\n\nHealth and Child Care Minister Douglas Mombeshora told Parliament this week that despite the Health Ministry having completed procurement paperwork and signed contracts with suppliers, Treasury has yet to pay the required deposit.\n\nAs the Health Ministry, we have awarded tenders to two companies for Parirenyatwa and Mpilo hospitals. All in all, we spent US$27.5 million. We submitted to Treasury papers for them to pay the 30% deposit as per the agreement and in accordance with the suppliers instructions. Contracts have since been signed.\n\nIt is now more than two months since we signed the agreements. Therefore, it is now up to the Ministry of Finance, Economic Development and Investment Promotion to pay for the machines so that they can be installed, said Mombeshora.\n\nHe added that suppliers had promised to install the equipment within 36 weeks, raising hopes that the machines would be operational before the end of the year.\n\nZimbabwe has recorded over 3,000 annual cancer deaths since 2014, according to the National Cancer Registry, with cases of colorectal cancer particularly on the rise. Zaka South MP Clemence Chiduwa raised concern over the lack of facilities for diagnosis.\n\nCancer cases are on the increase and one such cancer is colorectal cancer, which affects people who are mainly above the age of 45. What is the government policy on the prevention and early detection of colon cancer? Do we have any public facilities where we can get colonoscopy services (check-up service for diagnosis)? Chiduwa asked.\n\nMombeshora admitted the health system is under strain. Colon cancer is one of the top cancers in the country, maybe in the top four cancers that are affecting our population, he said.\n\nHe also cited shortages of specialists and diagnostic equipment in district hospitals, noting that government has turned to the Sugar Tax for funding.\n\nAs you may be aware, a Sugar Tax has been introduced to help fund cancer-treating and diagnostic equipment. In Phase 1, we have done tenders for the procurement of treatment equipment and in Phase 2, we are now going to procure diagnostic equipment. Every hospital should have a CT scan, an MRI and an ultrasound scan, Mombeshora said.\n\nOpposition MP for Chiredzi Central, Blessing Ropafadzo Makumire, criticised the delays despite government already collecting the Sugar Tax.\n\nThe Sugar Tax which is supposed to be used for the procurement of cancer machines, started being collected last year in January, yet to date, we have not received any machines that have been procured, which suggests that the government lacks urgency in solving this problem. How long will it take for the government to procure this equipment? What is preventing and causing the delay? Makumire said.\n\nMombeshora responded that US$30.3 million was available as of December 2024 and that procurement would begin with Parirenyatwa and Mpilo, where machines have been down for the past three years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/16072343/Parirenyatwa-Cancer-Treatment-Centre-3.png",
            "description": "<p>By Anna Chibamu Treasury has delayed the release of US$27.5 million earmarked for the purchase of cancer machines, leaving Zimbabwe’s two largest referral hospitals, Parirenyatwa Group of Hospitals in Harare and Mpilo Central Hospital in Bulawayo, without life-saving equipment for over three years. Health and Child Care Minister Douglas Mombeshora told Parliament this week that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parirenyatwa-mpilo-hospitals-go-without-cancer-machines-as-treasury-stalls-funding/\">Parirenyatwa, Mpilo Hospitals go without cancer machines as Treasury stalls funding</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Zimbabwean man jailed in Botswana for illegal entry",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-jailed-in-botswana-for-illegal-entry/",
            "content": "The Voice BW\n\nA 32-year-old Zimbabwean national, Brian Mpofu, spent his first night in a Botswana prison after illegally entering the country in 2022.\n\nMpofu was arrested the day before Independence Day at Dumela Industrial by police patrolling the area. When asked to produce travel documents, he was unable to comply.\n\nDuring the arrest, Mpofu attempted to flee but fell, sustaining visible facial injuries.\n\nHe was brought before the Francistown Magistrates Court on Friday on a single count of illegal entry into Botswana.\n\nAs he disembarked from the police van, his scarred face bore a striking resemblance to someone caught in a fire.\n\nAfter the charge was read, Mpofu pleaded guilty, saving the courts time.\n\nI ask for forgiveness. I have children to care for and pay their school fees. I plead with this court to temper justice with mercy when sentencing me, he said, his remorse evident through his scarred expression.\n\nMpofu was fined P3,000 (about US$200), which he must pay by October 24, 2025, or face a two-year prison term.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05053235/brian-mpofu-botswana.png",
            "description": "<p>The Voice BW A 32-year-old Zimbabwean national, Brian Mpofu, spent his first night in a Botswana prison after illegally entering the country in 2022. Mpofu was arrested the day before Independence Day at Dumela Industrial by police patrolling the area. When asked to produce travel documents, he was unable to comply. During the arrest, Mpofu</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-jailed-in-botswana-for-illegal-entry/\">Zimbabwean man jailed in Botswana for illegal entry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Global firms vie with China in Zimbabwe energy, minister says",
            "url": "https://www.newzimbabwe.com/global-firms-vie-with-china-in-zimbabwe-energy-minister-says/",
            "content": "Bloomberg\n\nZimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank.\n\nThe US and other Western nations are considering investing in Zimbabwes energy industry, long-dominated by Chinese investors, Energy and Power Development Minister July Moyo said.\n\nThe American interest adds to Middle Eastern and Russian investors who are already present in the southern African nation, Moyo told Bloombergs Jennifer Zabasajja on the sidelines of the African Energy Week conference in Cape Town on Tuesday.\n\nSome of the Western countries, including America, are now talking about: Hey, you have coal, you have gas, he said. We have plenty in Zimbabwe.\n\nZimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank. That restricts access to cheaper financing, making it difficult for the country to attract investors and get projects off the ground.\n\nZimbabwe generates 56% of its electricity from coal at a plant located in the western town of Hwange. The facility has an installed capacity of 1,500 megawatts, after the addition of 600 megawatts by Chinas Sinohydro in 2023. The country also generates 750 megawatts from Kariba Hydro Power, which was built by Sinohydro, adding 300 megawatts in 2025.\n\nZimbabwean officials last week attended a meeting in Washington DC addressed by US Energy Secretary Chris Wright.\n\nWe didnt talk to him face to face, but we were very buoyant by the fact that the present administration accepts that coal and gas are necessary, while we look for renewable energy as a transition, he said. We have investors who want to look at coal bed methane gas, the minister said, without providing further details.\n\nThe authorities in June unveiled a plan to raise more than $9 billion to boost energy access in a country hit by regular power outages  often lasting most of the day- because of a lack of generation capacity. The plan, which falls under the World Bank and African Development Banks Mission 300 program, envisages a more than doubling of power output from hydro, wind, solar and biomass plants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05052211/july-moyo.jpg",
            "description": "<p>Bloomberg Zimbabwe has been locked out of international capital markets since 1999, after it defaulted on loans from lenders including the World Bank, the Paris Club and the African Development Bank. The US and other Western nations are considering investing in Zimbabwe’s energy industry, long-dominated by Chinese investors, Energy and Power Development Minister July Moyo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/global-firms-vie-with-china-in-zimbabwe-energy-minister-says/\">Global firms vie with China in Zimbabwe energy, minister says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Dynamos escape relegation zone after dramatic draw against Ngezi Platinum",
            "url": "https://www.newzimbabwe.com/dynamos-escape-relegation-zone-after-dramatic-draw-against-ngezi-platinum/",
            "content": "By Sports Reporter\n\nDynamos climbed out of the relegation zone on Saturday after securing a 1-1 draw against Ngezi Platinum Stars in a drama-filled Premier Soccer League clash at Rufaro Stadium.\n\nThe match was marred by chaos as Ngezi Platinum had three players sent off, two red cards for players and one for head coach Takesure Chiragwi. Tensions flared further when Chiragwi, after being shown his marching orders, slapped one of his own players who had attempted to calm him down.\n\nDespite the setbacks, Ngezi managed to hold on for a draw, while the point earned lifted Dynamos to 14thplace on the log with 33 points, just above the relegation cut-off. The result continues Dynamos unbeaten run under coach Kelvin Kaindu, who took charge at the end of July.\n\nElsewhere, Simba Bhoras title hopes suffered a setback after a 1-0 defeat to CAPS United at Wadzanayi Stadium. The Shamva-based side now trails log leaders Scottland by four points.\n\nScottland FC maintained their advantage at the top with a 1-0 victory over Chicken Inn on Friday, moving to 59 points. Simba Bhora, with 55 points and a game in hand, remains in contention but faces increasing pressure in the title race.\n\nPSL matchday 30 results\n\nChicken Inn 0-1 Scottland\n\nDynamos 1-1 Ngezi Platinum Stars\n\nSimba Bhora 0-1 CAPS United\n\nManica Diamonds 0-0 Triangle\n\nTel One 3-1 Kwekwe United\n\nMWOS 1-0 Green Fuel\n\nZPC Kariba 2-0 Bikita Minerals\n\nFC Platinum 0-0 Yadah\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter Dynamos climbed out of the relegation zone on Saturday after securing a 1-1 draw against Ngezi Platinum Stars in a drama-filled Premier Soccer League clash at Rufaro Stadium. The match was marred by chaos as Ngezi Platinum had three players sent off, two red cards for players and one for head coach</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-escape-relegation-zone-after-dramatic-draw-against-ngezi-platinum/\">Dynamos escape relegation zone after dramatic draw against Ngezi Platinum</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Cabinet ministers snub Senate, Question Time abandoned",
            "url": "https://www.newzimbabwe.com/cabinet-ministers-snub-senate-question-time-abandoned/",
            "content": "By Anna Chibamu\n\nSenate business was disrupted Thursday after cabinet ministers failed to turn up for the weekly Question and Answer session, with only one deputy minister present in the chamber.\n\nAccording to Senate Standing Orders, ministers are required to attend the session to respond to questions on government policy. However, Deputy President of the Senate, Retired General Michael Nyambuya, was left with no choice but to cancel the session.\n\nNyambuya ruled that the upper house would proceed with debating motions instead of abandoning the days business altogether.\n\nIt is sad and very unfortunate that this August House is being treated in such a contemptuous manner and yet it is august, it is elected by the people to do our job, but we cannot do our oversight role if we do not have Ministers to question them on policy issues.\n\nThat being the case, I agree that we abandon the Question Time but not go home. Let us debate some of our motions, one or two motions, in lieu of the Question Time.\n\nThe Clerk is going to bring this to the attention of the relevant authorities through a letter, which will be signed by the head of Parliament, again. So, we move away from Questions with Notice and Without Notice, Nyambuya said.\n\nEarlier, he had sought senators views on how to proceed: Hon. Senators, we have one deputy minister. Can I have your proposed way forward? I need not repeat that this is tantamount to treating the Senate with contempt. Any proposed way forward? Do you think we should do away with the question time?\n\nZanu PF Mashonaland East senator Conrad Jericho Gotora expressed frustration, suggesting the sitting be adjourned.\n\nWe have not seen the senior ministers in this august House. Hon. Eng. Makwiranzou and Hon. Phuti are junior Ministers but they do respect this House. They always come in this august House.\n\nMy suggestion is that may we adjourn this House and go home because according to the Order Paper there are questions that date back to many, many days and months. We do not understand why we are sitting here whilst those who are supposed to work with us do not respect us.\n\nYesterday, they were fully present in the National Assembly Chamber but today they are not here. We only have two Deputy Ministers who respect us and always come. May we go and rest like what they are doing? Gotora said.\n\nOpposition senator Nonhlanhla Mlotshwa supported him, while Zanu PFs Irene Zindi fumed: Cabinet ministers are undermining the Senate Chamber because they do not come to the House.\n\nWhen we have questions concerning the development of the country, do not come. We only see Ministers like Hon. Mhona and the deputy ministers.\n\nSo, it is a plea and we are not happy that we cannot go forward. We cannot go on without Ministers in this august House?\n\nChief Ndiweni also urged action to compel ministers to take Senate seriously.\n\nNyambuya later noted that several ministers and deputies had tendered apologies, including Vice Presidents Constantino Chiwenga and Kembo Mohadi, Finance Minister Mthuli Ncube, Defence Minister Oppah Muchinguri-Kashiri, and several others.\n\nThe repeated absence of cabinet ministers from both the National Assembly and Senate has become a growing concern for legislators. Speaker of Parliament Jacob Mudenda has since escalated the matter to the highest office in government.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29152508/new-parliament-2.png",
            "description": "<p>By Anna Chibamu Senate business was disrupted Thursday after cabinet ministers failed to turn up for the weekly Question and Answer session, with only one deputy minister present in the chamber. According to Senate Standing Orders, ministers are required to attend the session to respond to questions on government policy. However, Deputy President of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cabinet-ministers-snub-senate-question-time-abandoned/\">Cabinet ministers snub Senate, Question Time abandoned</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        },
        {
            "title": "Ngezi Platinum Coach slaps player during Dynamos clash",
            "url": "https://www.newzimbabwe.com/ngezi-platinum-coach-slaps-player-during-dynamos-clash/",
            "content": "By Sports Reporter\n\nNgezi Platinum Stars coach, Takesure Chiragwi, has sparked outrage after he slapped one of his players during Saturdays Castle Lager Premier Soccer League clash against Dynamos at Rufaro Stadium.\n\nThe incident occurred after referee Lawrence Zimondi gave him a red card for protesting his decision.\n\nIn a heated moment, midfielder McDonald Makuwe attempted to calm his coach, only to be struck across the face.\n\nFootage of the altercation has since gone viral on social media, drawing widespread condemnation and raising questions over Chiragwis conduct.\n\nThe Premier Soccer League has since requested an incident report from the club.\n\nNgezi Platinums third red card came three minutes before halftime after a defender was given marching orders for disturbing an obvious goal-scoring opportunity when he fouled striker Jairos Kasondo at the edge of the box.\n\nDespite going one man down, Ngezi Platinum Stars fought through the whole match to salvage a point as it ended 1-1.The coachs actions come just a week after the Premier Soccer League handed Yadah FC board member Spencer Muvadi a suspension for assaulting his clubs goalkeeper, Godknows Gurure, in August.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/05054452/takesure-chiragwi.jpeg",
            "description": "<p>By Sports Reporter Ngezi Platinum Stars coach, Takesure Chiragwi, has sparked outrage after he slapped one of his players during Saturday’s Castle Lager Premier Soccer League clash against Dynamos at Rufaro Stadium. The incident occurred after referee Lawrence Zimondi gave him a red card for protesting his decision. In a heated moment, midfielder McDonald Makuwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ngezi-platinum-coach-slaps-player-during-dynamos-clash/\">Ngezi Platinum Coach slaps player during Dynamos clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "05 Oct 2025"
        }
    ]
}