{
    "news": [
        {
            "title": "Zimbabwe Embassy in South Africa begins verification of Stilfontein mine disaster victims",
            "url": "https://www.newzimbabwe.com/zimbabwe-embassy-in-south-africa-begins-verification-of-mine-disaster-victims/",
            "content": "By Staff Reporter\n\nTHE Zimbabwean Embassy in South Africa has reportedly dispatched a team of forensic experts and other professionals to collaborate with the host government to verify the nationality of victims of the Stilfontein mine disaster.\n\nThis follows the death of 87 artisanal miners at Buffelsfontein Mine in Stilfontein, North West Province, while some others were rescued alive.\n\nThe identities of the deceased are yet to be confirmed but there is a strong belief some could be Zimbabwean nationals after some survivors turned out to be Zimbabaweans.\n\nZimbabwes Ambassador to South Africa, David Hamadziripi, told State media that a contingent of verifiers has already started work.\n\nThe Embassy wishes to inform members of the public that it is working closely with the South African government to identify and verify the nationalities of the alleged Zimbabwe nationals retrieved from the Buffelsfontein Mine in Stilfontein, North West Province under the on-going rescue operations, said the Ambassador in a statement.\n\nFurther to screening the 465 alleged undocumented Zimbabwe nationals currently in South African Police Service (SAPS) custody, the Embassy is seeking to establish whether there are any Zimbabwe nationals among 87 deceased individuals retrieved at the shaft, whose identities and nationalities are yet to be established.\n\nThe embassy seeks to identify the deceased individuals through Deoxyribonucleic Acid (DNA) testing of relatives.\n\nHamadziripi called on Zimbabweans who have reason to believe that their relatives might be part of the rescued group of individuals in Stilfontein to urgently contact the Consulate in Johannesburg.\n\nThe Government of Zimbabwe is working on arrangements on how to assist with the repatriation of remains positively identified as Zimbabwe nationals, Hamadziripi was quoted saying.\n\nThe countrys consul-general in Johannesburg, Eria Phiri, said so far, 10 Zimbabweans who were rescued had appeared in court and were fined R15 000 (or six months in jail) wholly suspended sentence for illegal mining.\n\nThe group has since been deported to Zimbabwe.\n\nHe revealed that those rescued will undergo interviews to find out if there are any other Zimbabweans among those who may have died in the mineshaft.\n\nThe illegal miners were recently trapped underground and most of them chose to stay underground fearing arrest when they came out of the mineshaft.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/18092516/unnamed-5.jpg",
            "description": "<p>By Staff Reporter  THE Zimbabwean Embassy in South Africa has reportedly dispatched a team of forensic experts and other professionals to collaborate with the host government to verify the nationality of victims of the Stilfontein mine disaster. This follows the death of 87 artisanal miners at Buffelsfontein Mine in Stilfontein, North West Province, while some</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-embassy-in-south-africa-begins-verification-of-mine-disaster-victims/\">Zimbabwe Embassy in South Africa begins verification of Stilfontein mine disaster victims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Chimombe, Mpofu in another bid for freedom, ruling set for January 23 in US$7 million streetlights tender fraud",
            "url": "https://www.newzimbabwe.com/chimombe-mpofu-in-another-bid-for-freedom-ruling-set-for-january-23-in-us7-million-streetlights-tender-fraud/",
            "content": "By Staff Reporter\n\nHIGH Court judge, Justice Benjamin Chikowero is on January 23 expected to hand down his ruling in a matter business partners, Moses Mpofu and Mike Chimombe, are seeking bail in a case they are accused of defrauding City of Harare (CoH) of US$9 million in a streetlights tender deal.\n\nThe judge heard the appeal Friday at which Whisper Mabhaudhi representing the State submitted that there were no changed circumstances warranting the release of the two now.\n\nMpofu and Chimombe also had their other appeal in a separate charge involving a US$7 million fraud linked to a botched presidential goat scheme turned down on Thursday. Justice Pisirayi Kwenda ruled that the pair was facing a serious offence, which can result in their imprisonment for 20 years if convicted.\n\nOn Friday, Mpofus lawyer Advocate Tapson Dzvetero submitted that the two deserved bail considering that their co-accuseds from the local authority were granted bail.\n\nChimombe and Mpofu argued that this development constituted changed circumstances, considering the courts revised perspective on their prior bail request.\n\nAshiel Mugiya representing Chimombe concurred.\n\nMabhaudhi argued this had no relevance to the bail circumstances for the accused.\n\nThe granting of bail to city council officials has no bearing on the bail of these accused persons, Mabhaudhi said.\n\nAccording to the State, in January, the CoH initiated a project to rehabilitate streetlights in preparation for the SADC summit hosted by Zimbabwe in August.\n\nThe council invited bids, receiving submissions from 11 companies, including Juluka Endo Joint Venture (Pvt) Ltd, co-owned by Moses Mpofu.\n\nThe tender invitation specified that all bidders must provide stamped audited financial statements from the last two years.\n\nAdditionally, proof of payment for special procurement oversight committee and administration fees were required.\n\nOn April 19, an evaluation committee awarded contracts to four companies across eight lots for the street light rehabilitation project.\n\nMpofus company did not meet the requirements as its audited statements lacked an audit opinion, a crucial criterion for eligibility.\n\nNonetheless, the council invited Mpofus company to submit a new bid, which it did, presenting a document that allegedly contained false information. Mpofu is accused of misrepresenting his companys compliance with the regulatory requirements.\n\nMpofu allegedly submitted a bid security obtained on March 26 that had previously been used for an unsuccessful tender.\n\nHe is also accused of submitting audit documents purportedly prepared by three consultancy firms, which the Zimbabwe Anti-Corruption Commission (ZACC) found to be unregistered.\n\nIt is alleged that Mpofus company was awarded the contract, with the State claiming that Chimombe signed as a witness, leading to the duo receiving a partial payment of US$260,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173755/chimombe-3.jpeg",
            "description": "<p>By Staff Reporter  HIGH Court judge, Justice Benjamin Chikowero is on January 23 expected to hand down his ruling in a matter business partners, Moses Mpofu and Mike Chimombe, are seeking bail in a case they are accused of defrauding City of Harare (CoH) of US$9 million in a streetlights tender deal. The judge heard</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chimombe-mpofu-in-another-bid-for-freedom-ruling-set-for-january-23-in-us7-million-streetlights-tender-fraud/\">Chimombe, Mpofu in another bid for freedom, ruling set for January 23 in US$7 million streetlights tender fraud </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Supreme Court backs law banning TikTok if it’s not sold by its Chinese parent company",
            "url": "https://www.newzimbabwe.com/supreme-court-backs-law-banning-tiktok-if-its-not-sold-by-its-chinese-parent-company/",
            "content": "By Associated Press\n\nWASHINGTON  The Supreme Court on Friday unanimously upheld the federal law banning TikTok beginning Sunday unless its sold by its China-based parent company, holding that the risk to national security posed by its ties to China overcomes concerns about limiting speech by the app or its 170 million users in the United States.\n\nA sale does not appear imminent and, although experts have said the app will not disappear from existing users phones once the law takes effect, new users wont be able to download it and updates wont be available. That will eventually render the app unworkable, the Justice Department has said in court filings.\n\nThe decision came against the backdrop of unusual political agitation by President-elect Donald Trump, who vowed that he could negotiate a solution, and the administration of President Joe Biden, which has signaled it wont enforce the law  which was passed with overwhelming bipartisan support  beginning Sunday, his final full day in office.\n\nTikTok should remain available to Americans, but simply under American ownership or other ownership that addresses the national security concerns identified by Congress in developing this law, White House press secretary Karine Jean-Pierre said in a statement, noting that actions to implement the law will fall to the new administration.\n\nTrump, mindful of TikToks popularity, and his own 14.7 million followers on the app, finds himself on the opposite side of the argument from prominent Senate Republicans who fault TikToks Chinese owner for not finding a buyer before now. Trump said in a Truth Social post shortly before the decision was issued that TikTok was among the topics in his conversation Friday with Chinese leader Xi Jinping.\n\nTikTok CEO Shou Zi Chew, who is expected to attend Trumps inauguration, used the app to thank the incoming president for his commitment to work with us to keep TikTok available.\n\nIts unclear what options are open to Trump, a Republican, once he is sworn in as president on Monday. The law allowed for a 90-day pause in the restrictions on the app if there had been progress toward a sale before it took effect. Solicitor General Elizabeth Prelogar, who defended the law at the Supreme Court for the Democratic Biden administration, told the justices last week that its uncertain whether the prospect of a sale once the law is in effect could trigger a 90-day respite for TikTok.\n\nThe decision explores the intersection of the First Amendment and national security concerns in the fast-changing realm of social media, and the justices acknowledged in their opinion that the new terrain has been difficult to navigate given they know relatively little about it.\n\nCongress has determined that divestiture is necessary to address its well-supported national security concerns regarding TikToks data collection practices and relationship with a foreign adversary, the court said in an unsigned opinion, adding that the law does not violate petitioners First Amendment rights.\n\nJustices Sonia Sotomayor and Neil Gorsuch filed short separate opinions noting some reservations about the courts decision but going along with the outcome.\n\nWithout doubt, the remedy Congress and the President chose here is dramatic, Gorsuch wrote. Still, he said he was persuaded by the argument that China could get access to vast troves of personal information about tens of millions of Americans.\n\nSome digital rights groups slammed the courts ruling shortly after it was released.\n\nTodays unprecedented decision upholding the TikTok ban harms the free expression of hundreds of millions of TikTok users in this country and around the world, said Kate Ruane, a director at the Washington-based Center for Democracy & Technology, which has supported TikToks challenge to the federal law.\n\nContent creators who opposed the law also worried about the effect on their business if TikTok shuts down.\n\nIm very, very concerned about whats going to happen over the next couple weeks, said Desiree Hill, owner of Crowns Corner mechanic shop in Conyers, Georgia. And very scared about the decrease that Im going to have in reaching customers and worried Im going to potentially lose my business in the next six months.\n\nAt arguments, the justices were told by a lawyer for TikTok and ByteDance Ltd., the Chinese technology company that is its parent, how difficult it would be to consummate a deal, especially since Chinese law restricts the sale of the proprietary algorithm that has made the social media platform wildly successful.\n\nThe app allows users to watch hundreds of videos in about half an hour because some are only a few seconds long, according to a lawsuit filed last year by Kentucky complaining that TikTok is designed to be addictive and harms kids mental health. Similar suits were filed by more than a dozen states. TikTok has called the claims inaccurate.\n\nThe dispute over TikToks ties to China has come to embody the geopolitical competition between Washington and Beijing.\n\nByteDance and its Chinese Communist masters had nine months to sell TikTok before the Sunday deadline, Sen. Tom Cotton, R-Ark., wrote on X. The very fact that Communist China refuses to permit its sale reveals exactly what TikTok is: a communist spy app. The Supreme Court correctly rejected TikToks lies and propaganda masquerading as legal arguments.\n\nThe U.S. has said its concerned about TikTok collecting vast swaths of user data, including sensitive information on viewing habits, that could fall into the hands of the Chinese government through coercion. Officials have also warned the algorithm that fuels what users see on the app is vulnerable to manipulation by Chinese authorities, who can use it to shape content on the platform in a way thats difficult to detect.\n\nTikTok points out the U.S. has not presented evidence that China has attempted to manipulate content on its U.S. platform or gather American user data through TikTok.\n\nBiden signed the legislation it into law in April. The law was the culmination of a yearslong saga in Washington over TikTok, which the government sees as a national security threat.\n\nTikTok, which sued the government last year over the law, has long denied it could be used as a tool of Beijing. A three-judge panel made up of two Republican appointees and a Democratic appointee unanimously upheld the law in December, prompting TikToks quick appeal to the Supreme Court.\n\nWithout a sale to an approved buyer, the law bars app stores operated by Apple, Google and others from offering TikTok beginning on Sunday. Internet hosting services also will be prohibited from hosting TikTok.\n\nByteDance has said it wont sell. But some investors have been eyeing it, including Trumps former Treasury Secretary Steven Mnuchin and billionaire businessman Frank McCourt. McCourts Project Liberty initiative has said it and its unnamed partners have presented a proposal to ByteDance to acquire TikToks U.S. assets. The consortium, which includes Shark Tank host Kevin OLeary, did not disclose the financial terms of the offer.\n\nMcCourt, in a statement following the ruling, said his group was ready to work with the company and President Trump to complete a deal.Prelogar told the justices last week that having the law take effect might be just the jolt ByteDance needs to reconsider its position.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/09191002/25xp-tiktok-mkwl-mediumSquareAt3X.jpeg",
            "description": "<p>By Associated Press  WASHINGTON — The Supreme Court on Friday unanimously upheld the federal law banning TikTok beginning Sunday unless it’s sold by its China-based parent company, holding that the risk to national security posed by its ties to China overcomes concerns about limiting speech by the app or its 170 million users in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-backs-law-banning-tiktok-if-its-not-sold-by-its-chinese-parent-company/\">Supreme Court backs law banning TikTok if it’s not sold by its Chinese parent company</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Heavy rains damage railway line; NRZ forced to suspend operations along South-East route",
            "url": "https://www.newzimbabwe.com/heavy-rains-damage-railway-line-nrz-forced-to-suspend-operations-along-south-east-route/",
            "content": "By Staff Reporter\n\nTHE National Railways of Zimbabwe (NRZ) has temporarily suspended operations on the South-East railway line due to the track damage caused by incessant rainfall.\n\nThe railway wash away by the rains was witnessed particularly along the Rutenga-Mbizi and Rutenga-Beitbridge sections.\n\nIn a statement, NRZ said its realigning the damaged area, which covers 480 metres combined and is now at 90% complete.\n\nWe are experiencing wash aways on some parts of our lines, particularly on the South-East line. The heavy rainfall has resulted in the water flow overloading existing drainage structures.\n\nAreas that have been adversely affected include the Rutenga-Mbizi section where 360 metres of tracks were washed away and also a section along the Rutenga-Beitbridge line where 120 metres of tracks were washed away, with gullies reaching two metres in some areas, NRZ said.\n\nIt noted that the area experienced wash aways but due to climate change, high rainfall has since made the unexpected severe damage to the rails.\n\nThe area is susceptible to such incidents because of its natural topographic formation. Although we have previously had similar experiences in the same corridor over the past few years, including on the Mozambican side, this has been worse than any wash away we have seen before.\n\nThe NRZ confirmed that there were dispatched wagons carrying ballast and quarry fines from the Nalatale Quarry Mine in Shangani en route to the affected areas.\n\nFortunately, there have been no injuries reported among staff or damage to rolling stock due to the washouts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/18054225/IMG-20250117-WA0050.jpg",
            "description": "<p>By Staff Reporter  THE National Railways of Zimbabwe (NRZ) has temporarily suspended operations on the South-East railway line due to the track damage caused by incessant rainfall. The railway wash away by the rains was witnessed particularly along the Rutenga-Mbizi and Rutenga-Beitbridge sections. In a statement, NRZ said its realigning the damaged area, which covers</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heavy-rains-damage-railway-line-nrz-forced-to-suspend-operations-along-south-east-route/\">Heavy rains damage railway line; NRZ forced to suspend operations along South-East route</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Zanu PF plots crackdown against CCC diaspora activists propping Chamisa",
            "url": "https://www.newzimbabwe.com/zanu-pf-plots-crackdown-against-ccc-diaspora-activists-propping-chamisa/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas loyalists are reportedly plotting a massive crackdown on diaspora activists financially supporting opposition leader, Nelson Chamisa to establish a new political movement to challenge the 82-year-old Zanu PF leader.\n\nChamisa, who has taken a sabbatical from active politics and kept the population guessing on his next move, is arguably the only formidable challenge Mnangagwa fears outside Zanu PF, a party which the octogenarian thinks has pacified to accept his bid for a third but unconstitutional presidential term.\n\nVice President Constantino Chiwenga, who fancies himself Mnangagwas obvious successor, reportedly leads another faction resisting a presidential term extension.\n\nChiwenga and Chamisa are also said to be contemplating a loose alliance to annihilate Mnangagwa.\n\nSources within Citizens Coalition for Change (CCC) diaspora chapters, who spoke to NewZimbabwe.com, said unfolding political developments in Zimbabwe highlight the increasing risks faced by opposition members and human rights activists, both within Zimbabwe and abroad.\n\nIntelligence sources have made us aware of a plot to cause harm, including murder, forced disappearances and torching of properties belonging to known activists supporting and funding Chamisas bid for a political comeback to challenge Mnangagwa.\n\nFor some CCC members and human rights activists who fled Zimbabwe and took refuge in the diaspora, the situation is dire as there is an operation targeting those alleged to be bankrolling what is being termed Blue Movement, said Genius Khatazile Mamwadhu.\n\nMany of the activist in diaspora have since had their houses visited by either Criminal Investigations Department (CID), Central Intelligence Organisation (CIO) or police with some receiving warrants of arrest. The situation has escalated after the announcement of extension of the presidential term of office until 2030 or 2033.\n\nCCC elements residing or working in the United Kingdom, United States of America, South Africa, among other jurisdictions, and believed to be at the forefront of social media onslaughts against Mnangagwas plan to extend his presidency beyond 2028 are also under the radar.\n\nMamwadhu revealed that staunch CCC activists Greatman Makipa, Clive Biggie Nyaketa, Nobukhosi Dube, Brian Chikukwa, Munyaradzi Zengeni, Evelyn Chigaro, Kevin Dube, Memory Kishindo, Xolisani Masuku, Melody Phylis Magejo, and Sibongile Sibanda, who have been labelled as fugitives by the Zimbabwean government have vowed to push for a return of democracy to the southern African nation.\n\nIt is actually shameless to target economic and political refugees. The Government of Zimbabwes actions underscore the deteriorating human rights situation at home.\n\nActivists are branded as threats to national security, and state apparatuses such as the police and judiciary are weaponized to suppress dissent.\n\nBack home, Mwamadhu said the crackdown on locally-based activists such as former Mkoba Member of Parliament (MP), Amos Chibaya, violates Zimbabwes commitments to observing international law while weaponizing local legislation.\n\nMnangagwa and his Zanu PF are using the laws such as the Patriotic Bill, Cyber Security Act and Maintenance of Public Order Act (MOPA) to silence the opposition and human rights activists in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18014149/Zanu-PF-violence.png",
            "description": "<p>By Staff Reporter  PRESIDENT Emmerson Mnangagwa’s loyalists are reportedly plotting a massive crackdown on diaspora activists financially supporting opposition leader, Nelson Chamisa to establish a new political movement to challenge the 82-year-old Zanu PF leader. Chamisa, who has taken a sabbatical from active politics and kept the population guessing on his next move, is arguably</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-plots-crackdown-against-ccc-diaspora-activists-propping-chamisa/\">Zanu PF plots crackdown against CCC diaspora activists propping Chamisa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Scottland FC set for Zambia pre-season tour",
            "url": "https://www.newzimbabwe.com/scottland-fc-set-for-zambia-pre-season-tour/",
            "content": "By Sport Reporter\n\nCASTLE Lager Premier Soccer League (PSL) newcomers, Scottland FC will next month travel to Zambia for a pre-season tour, NewZimbabwe.com has learnt.\n\nThe trip is set for the first two weeks of February and will see Scottland playing different top teams in Zambia, which are yet to be confirmed.\n\nOwned by controversial Mabvuka-Tafara Member of Parliament, Scott Sakupwanya, Scottland is one of the outfits to watch this season in the PSL after their free spending in the ongoing transfer window.\n\nScottland have added quality players like Khama Billiat, 2024 topflight leagues top goalscorer Lynoth Chikuhwa and reigning Soccer Star of the Year Walter Musona.\n\nOther than having top players in its ranks, Scottland also roped in Tonderai Ndiraya, who won the league last year with Simba Bhora as the new team head coach.\n\nThe team is going for a two-week camp in Zambia. Everything has been set.\n\nPart of the executive had suggested South Africa for pre-season tour but it was later changed for various reasons.\n\nSo, in Zambia we will play three topflight league teams as part of preparations and assessment of players.\n\nRemember there is a big pool of players and only 30 will be registered and those that fails to make it will be loaned, said an inside source at Scottland who gave a comment on condition of anonymity.\n\nScottland is the most funded club in the PSL at the moment after receiving US$7.5 million from Sakunda and US$1.5 million from Wicknell Chivayos IMC communications.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/05073552/scottland-fc.jpg",
            "description": "<p>By Sport Reporter  CASTLE Lager Premier Soccer League (PSL) newcomers, Scottland FC will next month travel to Zambia for a pre-season tour, NewZimbabwe.com has learnt. The trip is set for the first two weeks of February and will see Scottland playing different top teams in Zambia, which are yet to be confirmed. Owned by controversial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fc-set-for-zambia-pre-season-tour/\">Scottland FC set for Zambia pre-season tour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "ZIMSEC releases November 2024 ‘O’ Level results",
            "url": "https://www.newzimbabwe.com/zimsec-releases-november-2024-o-level-results/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe School Examinations Council (ZIMSEC) has announced the release of the November 2024 Ordinary Level examinations results.\n\nThe latest results reflect marked improvement in the pass rate, which rose to 33.19% from 29.41% in 2023 and 28.96% in 2022.\n\nAddressing journalists in Harare this Friday, ZIMSEC board chairperson Professor Paul Mapfumo confirmed that the results will be accessible onlinefor the next five days.\n\nThe Zimbabwe School Examinations Council board and management would like to advise the nation of the release of the 2024 November Ordinary Level examination results, Mapfumo said.\n\nExamination centre heads would be able to collect results for their schools or centres from regional offices starting Monday, 20 January 2025, Mapfumo said.\n\nThe timely release of the O Level results followed the announcement of Advanced Level exams results last Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04192721/Zimbabwe-Examination-pupil.jpeg",
            "description": "<p>By Staff Reporter  THE Zimbabwe School Examinations Council (ZIMSEC) has announced the release of the November 2024 Ordinary Level examinations results. The latest results reflect marked improvement in the pass rate, which rose to 33.19% from 29.41% in 2023 and 28.96% in 2022. Addressing journalists in Harare this Friday, ZIMSEC board chairperson Professor Paul Mapfumo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimsec-releases-november-2024-o-level-results/\">ZIMSEC releases November 2024 ‘O’ Level results</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Magaya ZIFA challenge: Judge reserves judgement to Thursday",
            "url": "https://www.newzimbabwe.com/magaya-zifa-challenge-judge-reserves-judgement-to-thursday/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge, Justice Tawanda Chitapi has reserved to Thursday, his judgement in a matter Yadah Stars founder Walter Magaya is challenging his disqualification to contest as Zimbabwe Football Association (ZIFA) president.\n\nThe cleric-cum-sportsman took Zifa to court after he was disqualified arguing that he was illegally removed from the list.\n\nThis Friday, parties met before Chitapi, with Magayas lawyer Advocate Thabani Mpofu arguing that the decision by the ZIFA ethics committee should be reversed.\n\nThe lawyer also said the ethics committee acted in an abnormal manner which bordered on corruption.\n\nMpofu said their case was simple and carried weight.\n\nWhat brings us to court is a simple and very straightforward issue. The requirement set out in the ZIFA Constitution is clear, it says O Level or an equivalent qualification.\n\nIf a qualification issued by a university is even better than O Level, on that, this application ought to succeed, Mpofu said.\n\nMagaya submitted a diploma from the University of South Africa (UNISA).\n\nThe respondents show that they are alive to a fact that they have to give reasons for the disqualification. But what they have not done is to give reasons to say that the documents they received do not amount to a qualification.\n\nWhat the Constitution establishes is a minimum requirement. The tariff in the statute is a minimum qualification.\n\nThe Electoral Code envisages the candidates may fail to meet requirements by failing to produce certain documentsand when they fail, they dont get disqualified, Mpofu submitted.\n\nMpofu also said Magaya failed to produce an O Level certificate, and this does not mean he doesnt have that certificate.\n\nHe said the ZIFA Constitution says a candidate should be given seven days to do so.\n\nIt gives you time within which to comply. Should there be a dispute on what a candidate would have given them, it will be a time to contest that.\n\nMpofu said none of the respondents have the powers to disqualify prospective candidates.\n\nWe challenge the respondents to identify a provision that allow them to disqualify a candidate, he said.\n\nMpofu said his client had a chat with Lincoln Mutasa, ZIFA normalisation committee chairperson who told him that the issue of qualifications was not the reason they disqualified him.\n\nHe said his client will challenge Mutasa to dispute that.\n\nWhere is Mutasas rebuttal. Where is his affidavit to say this was not the reason why they disqualify him..the decision has to be reviewed and set aside, Mpofu said.\n\nProfessor Lovemore Madhuku representing ZIFA argued that Magayas application was not properly before the court.\n\nThe decisions of the respondent are not reviewable by this court. We dont know the basis on which we as ZIFA we are being brought to court, he said.\n\nMadhuku argued that ZIFA is a non-profit organisation and is not an administrative organisation.\n\nIt is nothing else, it is a private organisation and the law is very clear that you can only review disputes of administrative authorities.\n\nYou should simply strike off this application for not meeting the requirements of the court.\n\nDuring the hearing Chitapi said ZIFA was supposed to bring a record of proceedings, which culminated in Magayas disqualification.\n\nIf that record exist it should be brought before the court to ascertain who took that decision. Without the record there is nothing to talk about. The rules say that they have a duty to ensure that the record should be made available.\n\nThe issue is the law says there should be that record, the submissions should speak on the action which was taken, Chitapi said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga  HIGH Court judge, Justice Tawanda Chitapi has reserved to Thursday, his judgement in a matter Yadah Stars founder Walter Magaya is challenging his disqualification to contest as Zimbabwe Football Association (ZIFA) president. The cleric-cum-sportsman took Zifa to court after he was disqualified arguing that he was illegally removed from the list. This</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-zifa-challenge-judge-reserves-judgement-to-thursday/\">Magaya ZIFA challenge: Judge reserves judgement to Thursday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "Man sets hut on fire, strikes wife to death with a hoe",
            "url": "https://www.newzimbabwe.com/man-sets-hut-on-fire-strikes-wife-to-death-with-a-hoe/",
            "content": "By Staff Reporter\n\nPOLICE in Masvingo are investigating a case involving arson, murder and attempted murder after a Mwenezi man set ablaze a hut before striking fleeing occupants with a hoe.\n\nThe assault resulted in the death of the assailants wife while his mother-in-law sustained serious injuries during the attack.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the arrest of 30-year-old Trust Bhonde for the heinous acts.\n\nThe ZRP confirms the arrest of Trust Bhonde (30) in connection with a case of murder and attempted murder which occurred at Sikomo Village, Mwenezi on January 12, 2025 in which his wife, Nollen Rivete (27) died.\n\nThe suspect allegedly set a kitchen hut ablaze in which the victim and his mother-in-law, Manyuke Sasai (50) were sleeping in, said Nyathi.\n\nIn a fit of rage, the suspect armed himself with a hoe and started striking his in-law and wife.\n\nSubsequently, the suspect went on to strike his mother-in-law on the head with a hoe before hitting his wife several times on the head as they escaped from the burning hut.\n\nResultantly, Manyuke Sasai sustained head injuries and became unconscious while Nollen Rivete sustained head injuries and succumbed to the injuries, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/17050156/hut-on-fire.jpg",
            "description": "<p>By Staff Reporter POLICE in Masvingo are investigating a case involving arson, murder and attempted murder after a Mwenezi man set ablaze a hut before striking fleeing occupants with a hoe. The assault resulted in the death of the assailant’s wife while his mother-in-law sustained serious injuries during the attack. Zimbabwe Republic Police (ZRP) national</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-sets-hut-on-fire-strikes-wife-to-death-with-a-hoe/\">Man sets hut on fire, strikes wife to death with a hoe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        },
        {
            "title": "US envoy reflects on late President Jimmy Carter’s role on Zim",
            "url": "https://www.newzimbabwe.com/us-envoy-reflects-on-late-president-jimmy-carters-role-on-zim/",
            "content": "By Alois Vinga\n\nTHE United States ambassador to Zimbabwe, Pamela Tremont on Thursday dedicated the largest conference room at the Harare chancery to late former President Jimmy Carter.\n\nThe gesture is in honour of the late former US leaders hope for a better Zimbabwe hinged on deeper political stability.\n\nCarter is credited for playing a pivotal role in Zimbabwes peace settlement following the decision by his administration to assemble ahigh-powered negotiating team, led bythen UN Ambassador Andrew YoungandSecretary of State CyrusVance, to coordinate with the British and hammer out a settlement.\n\nThese negotiations, spearheaded by the Americans, led to the Lancaster House talks in Britain, the free elections in 1980 and the black majority rule in an independent Zimbabwe.\n\nSpeaking to guests at the honouring ceremony, Tremont said the late iconic leaders role in Zimbabwe must never go unmentioned.\n\nHis commitment to Zimbabwes future was not just a political decision but a deeply personal conviction that all people should have an opportunity to contribute to the future of their nation. It is fitting that this room, used to bring people together, bears the name of a leader who believed in the power of diplomacy and peace-making, she said.\n\nPresident Jimmy Carter meets with Zimbabwe Prime Minister Robert Mugabe in the Oval Office in Washington, on Aug. 27, 1980. (AP Photo/Barry Thumma, File)\n\nForeign Affairs Minister, Prof Amon Murwira who also graced the event expressed gratitude for the noble gesture.\n\nFormer President Jimmy Carters commitment to human rights and justice was instrumental during Zimbabwes journey to independence. We extend our heartfelt gratitude to all who contributed to Zimbabwes independence  those who fought bravely for freedom and those who supported them from afar, including the late President Carter, he said.\n\nThe event concluded with a video message from former U.S. Ambassador to the United Nations Andrew Young, who was Carters lead negotiator in support of Zimbabwes independence.\n\nNow aged 92, Ambassador Young shared a message about his meetings with independent Zimbabwes first leaders.\n\nWere very proud of our relationship to Zimbabwe. Thank you very much for remembering my boss, Jimmy Carter, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/17045129/Jimmy-Carter-naming-event.jpg",
            "description": "<p>By Alois Vinga THE United States ambassador to Zimbabwe, Pamela Tremont on Thursday dedicated the largest conference room at the Harare chancery to late former President Jimmy Carter. The gesture is in honour of the late former US leader’s hope for a better Zimbabwe hinged on deeper political stability. Carter is credited for playing a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-envoy-reflects-on-late-president-jimmy-carters-role-on-zim/\">US envoy reflects on late President Jimmy Carter’s role on Zim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:36",
            "date": "18 Jan 2025"
        }
    ]
}