{
    "news": [
        {
            "title": "Gruesome murders send Norton into panic as MP Tsvangirai calls for immediate investigations",
            "url": "https://www.newzimbabwe.com/gruesome-murders-send-norton-into-panic-as-mp-tsvangirai-calls-for-immediate-investigations/",
            "content": "By Staff Reporter\n\nIN the aftermath of the discovery of mutilated bodies in Norton recently, legislator Richard Tsvangirai has demanded speedy investigations into the gruesome murders.\n\nNorton was shaken to the core when the mutilated body of a man, Patrice Chipaumire, was discovered on Monday, before another, that of Jack Gedion, was found on Tuesday in disturbing circumstances.\n\nThe images of the bodies have since circulated on social media, with widespread speculation that they might be linked to ritual killings.\n\nIn a statement, Tsvangirai called for quick investigations into the murders that have sent Norton into a state of panic.\n\nI share in the deep sorrow and shock these events have caused. My heartfelt condolences go to the families who have lost their loved ones under such painful circumstances.\n\nPlease know that your grief is our grief, and you are not alone during this time. I have visited the bereaved families to offer my support and solidarity, and I will continue to walk with them through this difficult period.\n\nI have also spoken with law enforcement authorities and investigations are currently ongoing. Justice must not only be done; it must be seen to be done. We will not rest until answers are found and those responsible are held accountable, said Tsvangirai.\n\nTsvangirai also urged for an increase in police patrols in Norton to prevent any recurrence of such tragedies.\n\nI further call for intensified police patrols in the area to reassure residents and enhance community safety. To the people of Norton, I urge you to remain vigilant and avoid unnecessary movement during late hours.\n\nI know fear and uncertainty weigh heavily on us, but let us not lose our sense of community. Let us watch over one another, support the grieving, and remain calm as investigations unfold, said Tsvangirai.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/22050655/Richard-Tsvangirai-e1679426553746.jpg",
            "description": "<p>By Staff Reporter IN the aftermath of the discovery of mutilated bodies in Norton recently, legislator Richard Tsvangirai has demanded speedy investigations into the gruesome murders. Norton was shaken to the core when the mutilated body of a man, Patrice Chipaumire, was discovered on Monday, before another, that of Jack Gedion, was found on Tuesday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gruesome-murders-send-norton-into-panic-as-mp-tsvangirai-calls-for-immediate-investigations/\">Gruesome murders send Norton into panic as MP Tsvangirai calls for immediate investigations</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Mnangagwa tells Zanu PF local government dept to work with councils on industrial land allocation",
            "url": "https://www.newzimbabwe.com/mnangagwa-tells-zanu-pf-local-government-dept-to-work-with-councils-on-industrial-land-allocation/",
            "content": "By Anna Chibamu\n\nPRESIDENT Emmerson Mnangagwa says Zanu PFs local government department must work with local authorities to ensure that people get land for industrial and manufacturing hubs.\n\nMnangagwa wasaddressingthe 386th ordinary session of the Politburo at the party headquarters in Harare this Wednesday.\n\nThe government recently imposed a moratorium on private acquisition of State land for commercial or residential purposes to restore order and curb rampant corruption in Zimbabwes land and property sector.\n\nThe announcement, made by Local Government minister Daniel Garwe, stopped all claims by individuals or entities purporting to have discovered State land for allocation.\n\nOur people, including those in the diaspora, must be encouraged to invest in rural areas in our quest to modernise and industrialise every part of our country.\n\nThe department of Local Government within the party should ensure that local authorities come to the table and avail opportunities and land for the development of industries and manufacturing hubs.\n\nAs we carry out the work of our party and government, communities must be kept alive to the centrality of agriculture to broad-based empowerment and national prosperity, Mnangagwa said.\n\nHe added, Under our Government, Zimbabweans are being facilitated to continue developing value chains and create new industries across all the sectors of the economy, riding on innovation, science and technology development.\n\nSpeaking of the recently launched Productivity Booster Kit Programme, in Mashonaland Central Province,Mnangagwa said this project must be rolled out countrywide to allow communities to leverage the countrys comparative advantages, leaving no one behind.\n\nThe Productivity Booster Kit Programme should see us accelerating sustainable development, rural industrialisation and increasing the adoption of smart agriculture practices, to spur agro-processing and boost food security.\n\nHe commended youth and women, saying these must never be trapped in a vicious cycle of dependency.\n\nWe must never allow the youth and young people, as well as the women of our country, to be trapped in a vicious cycle of dependency, the ruling partys First Secretary stated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/03202806/mnangagwa-cc.jpeg",
            "description": "<p>By Anna Chibamu PRESIDENT Emmerson Mnangagwa says Zanu PF’s local government department must work with local authorities to ensure that people get land for industrial and manufacturing hubs. Mnangagwa was addressing the 386th ordinary session of the Politburo at the party headquarters in Harare this Wednesday. The government recently imposed a moratorium on private acquisition of State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-tells-zanu-pf-local-government-dept-to-work-with-councils-on-industrial-land-allocation/\">Mnangagwa tells Zanu PF local government dept to work with councils on industrial land allocation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "Five in court after police intercept truck with dagga, broncleer in Harare",
            "url": "https://www.newzimbabwe.com/five-in-court-after-police-intercept-truck-with-dagga-broncleer-in-harare/",
            "content": "By Staff Reporter\n\nThe National Prosecuting Authority has hauled five suspects before the Mbare Magistrates Court after detectives intercepted a 10-tonne truck loaded with 306kg of dagga and 49 boxes of Broncleer cough syrup in Harare.\n\nAccording to prosecutors, the bust was made in the early hours of 23 August 2025 when CID Drugs Harare detectives, acting on a tip-off, intercepted the truck in Kuwadzana Extension.\n\nA search uncovered 20 sacks of dagga and 49 boxes of Broncleer (each box containing 50 x 100ml bottles).\n\nFour suspects were arrested on the spot before implicating a fifth accomplice, who was later trapped and arrested along Robson Manyika Road after allegedly receiving part of the consignment.\n\nThe accused were named as Paradzai Kamungeremu (43), Givemore Tsavayo (38), Nkosikhona Moyo (35), Tafadzwa Mapika (20), and Faith Matekede (37).\n\nProsecutors are opposing bail, arguing that the offence is serious, prejudicial to society, and carries a high risk of absconding. The matter has been remanded as investigations continue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter The National Prosecuting Authority has hauled five suspects before the Mbare Magistrates’ Court after detectives intercepted a 10-tonne truck loaded with 306kg of dagga and 49 boxes of Broncleer cough syrup in Harare. According to prosecutors, the bust was made in the early hours of 23 August 2025 when CID Drugs Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/five-in-court-after-police-intercept-truck-with-dagga-broncleer-in-harare/\">Five in court after police intercept truck with dagga, broncleer in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "28 Aug 2025"
        },
        {
            "title": "EFF leader Malema found guilty of hate speech",
            "url": "https://www.newzimbabwe.com/eff-leader-malema-found-guilty-of-hate-speech/",
            "content": "BBC\n\nSouth African opposition politician Julius Malema has been convicted of hate speech by the countrys equality court, following remarks he made at a rally in 2022.\n\nMalema, leader of the Economic Freedom Fighters (EFF) party, often sparks controversy in a nation where, 31 years after apartheid ended, racial tensions still linger.\n\nAfter an incident where a white man allegedly assaulted an EFF member, Malema said: No white man is going to beat me up you must never be scared to kill. A revolution demands that at some point there must be killing.\n\nThe equality court ruled that these remarks demonstrated an intent to incite harm, but the EFF said they were taken out of context.\n\nTwo complaints had been made against the 44-year-old MP  one by South Africas Human Rights Commission and another by a person who alleged they had been threatened because of the politicians remarks.\n\nIn its ruling, the court said: Whilst calling out someone who behaves as a racist may be acceptable, calling for them to be killed is not.\n\nAnd calling for someone to be killed because they are a racist who has acted violently, is an act of vigilantism and an incitement of the most extreme form of harm possible.\n\nIn a subsequent statement, the EFF said the ruling is fundamentally flawed and deliberately misreads both the context and the meaning of the speech.\n\nIt assumes that the reasonable listener is incapable of understanding metaphor, revolutionary rhetoric or the history of liberation struggles, the EFF added.\n\nIn June, Malema, whose party came fourth in last years parliamentary election, was denied entry to the UK.\n\nThe Home Office said he had been deemed non-conducive to the public good.\n\nIn a letter released by the EFF at the time, the Home Office cited his vocal support for Hamas, including a speech he made after the 7 October 2003 attack on Israel in which Malema said his party would arm the group if it came to power.\n\nThe Home Office said Malema had also made statements calling for the slaughter of white people [in South Africa] or hinted that it could be an acceptable option in the future.\n\nThe EFF condemned the UKs decision as cowardice and said it would stifle democratic debate.\n\nMalema were also criticised by US President Donald Trump in aconfrontational meeting with South Africas President Cyril Ramaphosain May.\n\nTrump played a video of the EFF leader singing an anti-apartheid song which refers to white farmers.\n\nMalema often chants the song  which includes the lyrics kill the Boer (Afrikaner); kill the farmer  at his political rallies.\n\nAfrikaner lobby groups have tried to get the song banned, but South Africas Supreme Court of Appeal has ruled that a reasonably well-informed person would understand that when protest songs are sung, even by politicians, the words are not meant to be understood literally, nor is the gesture of shooting to be understood as a call to arms or violence.\n\nWhite-minority rule ended in South Africa in 1994, with anti-apartheid icon Nelson Mandelas rise to power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/24191112/Julius-Malema.png",
            "description": "<p>BBC South African opposition politician Julius Malema has been convicted of hate speech by the country’s equality court, following remarks he made at a rally in 2022. Malema, leader of the Economic Freedom Fighters (EFF) party, often sparks controversy in a nation where, 31 years after apartheid ended, racial tensions still linger. After an incident</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eff-leader-malema-found-guilty-of-hate-speech/\">EFF leader Malema found guilty of hate speech</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "28 Aug 2025"
        }
    ]
}