{
    "news": [
        {
            "title": "Council announces umpteenth operation to deal with vendors in CBD, says serious campaign to start Wednesday evening",
            "url": "https://www.newzimbabwe.com/council-announces-umpteenth-operation-to-deal-with-vendors-in-cbd-says-serious-campaign-to-start-wednesday-evening/",
            "content": "By Leopold Munhende\n\nHARARE City Council will on Wednesday evening initiate, for the umpteenth time, an operation to flush out vendors from its central business district (CBD).\n\nThe latest showdown will, as has become the norm, be supported by members of the Zimbabwe Republic Police (ZRP) who have also been part of numerous failed attempts to rid Harare of illegal vendors in the past.\n\nSpeaking atthe launch of a revenue collection blitz on behalf of acting town clerk Phakamile Moyo, housing director Addmore Nhekairo said they had agreed on the operation with the local government ministry.\n\nWe had a meeting with the (local government) ministry on zero vending in the CBD whose operation starts Wednesday night, said Nhekairo.\n\nThis needs to be resourced so that it becomes a success. It is a serious initiative that will be supported by the ZRP.\n\nGovernment efforts to rid the CBD of illegal vendors and dirt, Operation Chenesa Harare, have failed to deal with the problem, compounded by Zimbabwes high unemployment rate.\n\nGraduates are part of those selling food stuffs, clothes, vegetables, fruits and second-hand clothes on the streets of Harare as job opportunities continue to get scarce.\n\nThey are constantly fleeing from marauding council vehicles, which confiscate their wares and arrest them. These vehicles operate with impunity, disobeying all traffic laws to arrest elderly women selling tomatoes and young boys selling sweets.\n\nAttempts to clean up Harare go back as far as Operation Murambatsvina in the early 2000s, with numerous more in between then and 2024.\n\nLast year, health services director Prosper Chonzi confessed that the Harare City Council had failed to deal with illegal vending because of the state of Zimbabwes economy.\n\nThe general economy is playing against us; we have been playing hide and seek after vendors, and it is not working, said Chonzi.\n\nI am not happy with the vending situation in the city. It is plain against what we are trying to achieve.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/27040018/Zimbabwe-vendors.jpeg",
            "description": "<p>By Leopold Munhende HARARE City Council will on Wednesday evening initiate, for the umpteenth time, an operation to flush out vendors from its central business district (CBD). The latest showdown will, as has become the norm, be supported by members of the Zimbabwe Republic Police (ZRP) who have also been part of numerous failed attempts</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/council-announces-umpteenth-operation-to-deal-with-vendors-in-cbd-says-serious-campaign-to-start-wednesday-evening/\">Council announces umpteenth operation to deal with vendors in CBD, says serious campaign to start Wednesday evening</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "SADC schedules another extraordinary summit to discuss DRC security crisis",
            "url": "https://www.newzimbabwe.com/sadc-schedules-another-extraordinary-summit-to-discuss-drc-security-crisis/",
            "content": "By Thandiwe Garusa\n\nThe Southern African Development Community (SADC) is set to hold another extraordinary summit virtually on Thursday to discuss the security situation in the Democratic Republic of the Congo (DRC).\n\nThe summit will be led by SADC Chair, President Emmerson Mnangagwa.This will be the third extraordinary summit convened on the same agenda within three months.\n\nSADC held an extraordinary summit in January and later participated in a joint East and Southern African mediation effort last month, during which regional leaders called for a ceasefire and the withdrawal of uninvited foreign armed forces from Congolese territory.\n\nHowever, tensions remain high despite diplomatic and military efforts to end the hostilities.\n\nSADC will convene an extraordinary summit of Heads of State and Government on March 13, 2025, in a virtual format to discuss the security situation in the DRC.\n\nThe summit will receive updates on the latest security developments in the DRC and deliberate on recommendations from the Extraordinary SADC Organ Troika Summit, which was held on March 6, 2025.\n\nThe SADC Summit is responsible for setting the overall policy direction and overseeing the functions of the Community, making it the primary policy-making institution of SADC, the statement from SADC secretariat said Tuesday.\n\nAccording to the Congolese authorities, over 8,500 people have been killed since the fighting escalated at the beginning of the year.\n\nThe conflict has also resulted in massive population displacements and a worsening humanitarian crisis.\n\nThe conflict between the Democratic Republic of the Congo (DRC) government and the March 23 Movement (M23) dates back to the 1990s but has significantly intensified this year.\n\nThe M23 claims to be fighting for minority rights, while the DRC government accuses the Rwanda-backed rebels of seeking to seize control of the mineral-rich eastern region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/26042227/mnangagwa-sadc.jpg",
            "description": "<p>By Thandiwe Garusa The Southern African Development Community (SADC) is set to hold another extraordinary summit virtually on Thursday to discuss the security situation in the Democratic Republic of the Congo (DRC). The summit will be led by SADC Chair, President Emmerson Mnangagwa. This will be the third extraordinary summit convened on the same agenda within</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-schedules-another-extraordinary-summit-to-discuss-drc-security-crisis/\">SADC schedules another extraordinary summit to discuss DRC security crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Harare water privatisation will only endanger public health, enrich politically connected elites – residents",
            "url": "https://www.newzimbabwe.com/harare-water-privatisation-will-only-endanger-public-health-enrich-politically-connected-elites-residents/",
            "content": "By Thandiwe Garusa\n\nHARARE residents have strongly condemned the governments push to privatise water services, arguing that this move will primarily benefit politically connected elites at the expense of ordinary citizens.\n\nThe Local Government Ministry is pushing for the privatisation of water services in Harare, including the transfer of the council-owned Morton Jaffray Water Treatment Plant to a private company.\n\nIn a statement, the Harare Residents Trust (HRT) and the Combined Harare Residents Association (CHRA) condemned government interference in local governance, warning it would limit citizens water access and undermine local authorities autonomy and revenue control.\n\nWe view this as a well-calculated tactic to transfer key local government responsibilities, such as water service provision, to politically connected elites.\n\nLocal authorities should have the freedom and authority to make decisions, manage their jurisdictions, and generate revenue without interference.\n\nThe central governments push to privatise water services in Harare, including transferring the Morton Jaffray Water Treatment Plant to a private company under the pretext of rehabilitation, amounts to sanctioned theft.\n\nThis move undermines the financial foundation of the local authority, further weakening its ability to serve the community, the statement reads.\n\nThe Local Government Ministry recently stated that the proposal for water privatisation stems from local authorities failure to fulfill their mandate. Under this project, 650,000 prepaid water meters will be installed in major cities.\n\nThe residents associations pointed out that since the initial prepaid water metering project in Harare was unsuccessful, there is growing uncertainty over whether the true aim of privatisation is to improve water services or to benefit politically connected individuals.\n\nThis raises more questions than answers, leaving uncertainty about whether the goal is to create opportunities for politically connected individuals or to genuinely improve water services.\n\nWe emphasize that installing prepaid water meters will not address the root governance issues that have long undermined water service delivery in Harare.\n\nFundamental problems of transparency and accountability within both the City of Harare and the central government must be resolved first.\n\nThis forced privatisation of water services poses significant public health risks and endangers human lives, the statement added.\n\nThe associations also accused Harare Mayor Jacob Mafume of pushing for a water services takeover without citizen input or full council approval.\n\nRegrettably, rather than engaging in a consultative process, the Harare Mayor has taken a leading role in facilitating the takeover of water services without involving citizens or securing full council resolutions.\n\nThe residents associations further warned that water privatisation will ultimately fail, wasting public funds and putting residents health at risk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/23185010/morton-jaffray-03-1080-1200x986.jpg",
            "description": "<p>By Thandiwe Garusa HARARE residents have strongly condemned the government’s push to privatise water services, arguing that this move will primarily benefit politically connected elites at the expense of ordinary citizens. The Local Government Ministry is pushing for the privatisation of water services in Harare, including the transfer of the council-owned Morton Jaffray Water Treatment</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-water-privatisation-will-only-endanger-public-health-enrich-politically-connected-elites-residents/\">Harare water privatisation will only endanger public health, enrich politically connected elites – residents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Ramaphosa calls AfriForum, Solidarity ‘unpatriotic’, but says ‘treason’ charge up to law enforcement",
            "url": "https://www.newzimbabwe.com/ramaphosa-calls-afriforum-solidarity-unpatriotic-but-says-treason-charge-up-to-law-enforcement/",
            "content": "TimesLive\n\nPresident Cyril Ramaphosa has slammed Afrikaner-interest lobby groups AfriForum and Solidarity as unpatriotic for instigating the diplomatic rift between Pretoria and Washington through fearmongering over South Africas expropriation law.\n\nHowever, he said, whether their actions amounted to treason was best left to law enforcement to decide.\n\nRamaphosa was replying to questions from MPs in parliament on Tuesday afternoon.\n\nHis remarks come as the US has taken multiple actions against South Africa including cutting funding from the Presidents Emergency Plan for Aids Relief (Pepfar) and key officials such as US state secretary Marco Rubio snubbing South Africas G20 events.\n\nANC MP Lufefe Mkutu asked Ramaphosa for his views on AfriForum and Solidaritys attempt to hijack South Africas foreign policy and whether he agreed that the meddling by the organisations constituted treason.\n\nI have expressed my concern and my disappointment at what AfriForum and Solidarity have been doing in spreading misinformation about their own country in the US and I regard that as being unpatriotic, Ramaphosa replied. Because when you are a patriot of a country, the best you do is resolve the problems you have in the country rather than begin to damage the sovereignty of your country by running off to other countries and expecting them to take action against your own country.\n\nRamaphosa said he believed that the organisations instigated the action being taken against South Africa by the Trump administration.\n\nHe said this only sought to spread racist statements about South Africa when the country was focused on redressing past inequalities, but did not name it as treason.\n\nThe fact whether that it is treasonous or not is a matter that, obviously, our law enforcement agencies need to look at. The National Prosecuting Authority needs to look at that. But I take a dim view  in fact a very negative view  of what has ensued as they run around the world badmouthing their own country, putting their country into disrepute  by misinformation.\n\nRamaphosa said the US remained a strategic and historic partner to South Africa, which maintained its active engagements with the US through political, diplomatic and economic channels.\n\nAfter the election of President Trump in November last year, I had a telephone call with him to congratulate him and to reaffirm our commitment as SA to strengthening relations between our two countries.\n\nHe said South Africa will continue to engage the US to correct the mischaracterisation by AfriForum and Solidarity and restore ties between the nations through various channels. He expressed confidence that the diplomatic and political efforts at smoothing things over would succeed.\n\nWe have taken note of an executive order and recent statements by the current US administration about SA and aspects of our domestic and foreign policy. We have expressed concern about the mischaracterisation of the situation in our country and certain of our laws and policy positions.\n\nDA MP George Michalakis asked Ramaphosa what he would say to the car workers and farm workers who would lose jobs when Agoa [the African Growth and Opportunity Act] goes and South Africa can no longer participate in the preferential trade act of the US.\n\nRamaphosa replied saying a number of countries in Africa had been given the opportunity to participate in Agoa, had their participation withdrawn and have had to find ways in which they could enhance their exports.\n\nParticipation in Agoa is not at our behest. It is at the behest of the US and what we seek to do, and have done for many years, is to demonstrate that we are a good trading partner to the US and, indeed, to many countries around the world, he said.\n\nThere is going to be a review of the Agoa process and last year you might recall we held the Africa and US Agoa forum here in our own country and we were able  together with other African countries  to demonstrate that we do derive value from Agoa, but we also give value.\n\nWe export, but we also import from the US. So it is a two-way process as it is with many countries around the world. As it is now, we continue, not only in anticipation of an Agoa initiative, but we continue to expand our export market for a variety of goods around the world, Ramaphosa said.\n\nThe president said Deputy President Paul Mashatile was going to Japan with a ministerial delegation to open up more market space for South African goods in the east.\n\nSimilar visits are planned for the Middle East, Europe and China to foster similar ties.\n\nWe do not take the opportunity that we have, as it is called the African Growth Opportunity Act, lightly. But we also want to demonstrate that, yes, we also have value to add. When I spoke to President Trump  I informed him that we value participating in Agoa but I also informed him that we also sell critical minerals to the US and the relationship is fairly balanced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/07042857/ramaphosa-SONA.jpg",
            "description": "<p>TimesLive President Cyril Ramaphosa has slammed Afrikaner-interest lobby groups AfriForum and Solidarity as “unpatriotic” for instigating the diplomatic rift between Pretoria and Washington through fearmongering over South Africa’s expropriation law. However, he said, whether their actions amounted to treason was best left to law enforcement to decide. Ramaphosa was replying to questions from MPs in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-calls-afriforum-solidarity-unpatriotic-but-says-treason-charge-up-to-law-enforcement/\">Ramaphosa calls AfriForum, Solidarity ‘unpatriotic’, but says ‘treason’ charge up to law enforcement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "14-year-old boy sentenced for raping seven year old girl",
            "url": "https://www.newzimbabwe.com/14-year-old-boy-sentenced-for-raping-seven-year-old-girl/",
            "content": "By Staff Reporter\n\nA 14-year-old Mahusekwa boy has been given a five-year suspended jail term following conviction for raping a seven year old girl several times.\n\nThe National Prosecuting Authority proved that the abuse took place between 2023 and September 2024, when the perpetrator was caught red-handed by the girls brother.\n\nOn September 10, 2024, he took her into a bedroom, removed both his and her clothes, before raping her.\n\nThe girls 11-year-old brother heard her crying, looked through the window, and witnessed the sexual assault.\n\nHe tried to enter the room, but the boy pushed him away. The brother then told a neighbor, and both children confirmed the abuse had been ongoing since 2023, the state proved.\n\nA medical examination confirmed the assault.\n\nThe 14-year-old boy was convicted of rape and received a five-year suspended sentence, contingent on him being under the supervision of a probation officer for one year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A 14-year-old Mahusekwa boy has been given a five-year suspended jail term following conviction for raping a seven year old girl several times. The National Prosecuting Authority proved that the abuse took place between 2023 and September 2024, when the perpetrator was caught red-handed by the girl’s brother. “On September 10, 2024,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/14-year-old-boy-sentenced-for-raping-seven-year-old-girl/\">14-year-old boy sentenced for raping seven year old girl</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Zimbabwean man caught smuggling R600,000 in explosives at Beitbridge Border",
            "url": "https://www.newzimbabwe.com/zimbabwean-man-caught-smuggling-r600000-in-explosives-at-beitbridge-border/",
            "content": "IOL\n\nA relatively routine border crossing took a dramatic turn after Limpopo police arrested a 48-year-old Zimbabwean man for alleged unlawful possession of explosives valued at over R600,000 at the Beitbridge Port of Entry.\n\nThe Directorate for Priority Crime Investigation, also known as the Hawks, said the man was arrested on Tuesday after police stopped a trailer truckfrom Zimbabwe to South Africa at theBeitbridge border.\n\nThey asked a driver to open a trailer so that the search can be conducted. The driver informed the police that he does not have keys for the trailers. Police forcibly opened the trailer and conducted a search, and they found bags containing items suspected to be explosives, said provincial Hawks spokesperson, Warrant Officer Lethunya Mmuroa.\n\nAfter the discovery, Mmuroa said police called the Musina-based Bomb Technicians, Hawks Serious Organised Crime Investigation, and Local Criminal Record Central for further assistance.\n\nMmuroa added that when the units arrived, they thoroughly searched the truck for the second time.\n\nAs a result, the team found 16 reels of detonating fuse explosives, 2182 superpowers, and 90 blasting cartridges explosives. The suspect was arrested.\n\nHe is expected to make his first court appearance in the Musina Magistrates Court on Wednesday.\n\nMeanwhile, the provincial head of Hawks in Limpopo, Major General Gopz Govender, commended the team for the arrest.\n\nThis is a clear indication that the law enforcement is winning a fight against transnational criminals, said Govender.\n\nIn another similar case in February,a 37-year-old South African man allegedly attempting to enter Eswatini via the Mananga Border Gate was arrested after he was found with12 Magex Maxam blasting explosives.\n\nThe product is notorious for its application in mining, quarrying, and construction industries due to its high detonation velocity and explosive power.\n\nTimes of Swaziland reported that the arrest was executed by members of the Royal Eswatini Police Service during routine border checks, which prompted an immediate investigation into the matter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11165531/A-Zimbabwean-man-has-been-arrested-by-Limpopo-police-after-he-was-found-with-explosives-worth-R600-000-Photo-Supplied-Hawks.webp",
            "description": "<p>IOL A relatively routine border crossing took a dramatic turn after Limpopo police arrested a 48-year-old Zimbabwean man for alleged unlawful possession of explosives valued at over R600,000 at the Beitbridge Port of Entry. The Directorate for Priority Crime Investigation, also known as the Hawks, said the man was arrested on Tuesday after police stopped</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-man-caught-smuggling-r600000-in-explosives-at-beitbridge-border/\">Zimbabwean man caught smuggling R600,000 in explosives at Beitbridge Border</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "US orders non-emergency staff to leave South Sudan as tensions rise",
            "url": "https://www.newzimbabwe.com/us-orders-non-emergency-staff-to-leave-south-sudan-as-tensions-rise/",
            "content": "BBC\n\nThe United States has ordered all its non-emergency staff in South Sudan to leave, amid rising tensions in the country.\n\nFighting in recent days has threatened an already fragile peace deal between President Salva Kiir and Vice-President Riek Machar.\n\nThe two leaders signed a peace agreement in 2018 to end a five-year civil war that killed hundreds of thousands of people, but their relationship has remained fraught.\n\nOn Sunday, the US State Department said that fighting was ongoing in South Sudan between various political and ethnic groups and that weapons are readily available to the population.\n\nDue to the risks in the country, on March 08, 2025, the Department of State ordered the departure of non-emergency US government employees, it said.\n\nThe UN human rights commission for South Sudan on Saturday warned of an alarming regression that threatened to undo years of progress towards peace.\n\nPresident Kiir has called for calm and made an assurance that the country would not return to war.\n\nIn an escalation of the tensions, a UN helicopter that had been evacuating members of the national army was shot at on Friday, killing several people, including one crew member.\n\nEarlier in the week, the deputy chief of the army and two ministers allied to Machar were arrested by security forces, which an opposition spokesman termed a grave violation of the peace deal.\n\nThe arrests of the Machar-allied officials followed clashes in the countrys Upper Nile state between government forces and a militia known as the White Army, which had fought alongside Machar during the civil war.\n\nSouth Sudan, the worlds newest nation, gained independence in 2011 after seceding from Sudan.\n\nBut just two years later, following a rift between Kiir and Machar, the country descended into a civil war, in which more than 400,000 people were killed.\n\nThe 2018 power-sharing agreement between the two stopped the fighting, but key elements of the deal have not been implemented  including a new constitution, an election, and the reunification of armed groups into a single army.\n\nSporadic violence between ethnic or local groups has continued in parts of the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/26074345/Sudan-War.png",
            "description": "<p>BBC The United States has ordered all its non-emergency staff in South Sudan to leave, amid rising tensions in the country. Fighting in recent days has threatened an already fragile peace deal between President Salva Kiir and Vice-President Riek Machar. The two leaders signed a peace agreement in 2018 to end a five-year civil war</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-orders-non-emergency-staff-to-leave-south-sudan-as-tensions-rise/\">US orders non-emergency staff to leave South Sudan as tensions rise</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "I will not subscribe to mining in national parks – Mudenda slams Sunny Yi Feng’s application to prospect for coal in Hwange National Park",
            "url": "https://www.newzimbabwe.com/i-will-not-subscribe-to-mining-in-national-parks-mudenda-slams-sunny-yi-fengs-application-to-prospect-for-coal-in-hwange-national-park/",
            "content": "By Thandiwe Garusa\n\nThe Speaker of Parliament, Jacob Mudenda, has strongly opposed coal mining in Hwange National Park, citing alternative locations with abundant coal deposits.\n\nThis comes after a Chinese company, Sunny Yi Feng, recently proposed a coal mining project in Sinamatella, a section of Hwange National Park.\n\nThe proposed site is a critical habitat for black rhinos and currently supports a growing population of this endangered species.\n\nSpeaking during a parliamentary session on tourism, Mudenda expressed strong reservations about mining in national parks.\n\nSpeaker of Parliament Jacob Mudenda\n\nI will not subscribe to mining in national parks. The place that has been identified for mining purposes is not the only location where coal can be found.\n\nWe have coal in the southern part of Binga, as well as in the southeast and southwest of Bingastill virgin land with plenty of coal deposits.\n\nWhy disturb the ecology of the animals there? Mudenda said.\n\nMeanwhile, Sunny Yi Fengs proposal has been opposed by environmental rights activists, parliamentarians, and Hwange residents, who have raised alarms over the potential impacts of mining within a national park.\n\nThese include biodiversity loss, wildlife habitat destruction, and increased human- wildlife conflict.\n\nRights activists have warned that allowing mining in a national park will damage Zimbabwes global reputation for sustainable conservation.\n\nThey also fear that mining in Sinamatella will negatively affect both visitors and nature due to air, noise, and land pollution.\n\nAdditionally, Sunny Yi Feng has a history of environmental infractions, including a recent closure order from the Environmental Management Agency (EMA) due to pollution.\n\nThe Ministry of Mines has yet to respond to Sunny Ye Fengs application.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26171635/Hwange-National-Park_11.jpg",
            "description": "<p>By Thandiwe Garusa The Speaker of Parliament, Jacob Mudenda, has strongly opposed coal mining in Hwange National Park, citing alternative locations with abundant coal deposits. This comes after a Chinese company, Sunny Yi Feng, recently proposed a coal mining project in Sinamatella, a section of Hwange National Park. The proposed site is a critical habitat</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-will-not-subscribe-to-mining-in-national-parks-mudenda-slams-sunny-yi-fengs-application-to-prospect-for-coal-in-hwange-national-park/\">I will not subscribe to mining in national parks – Mudenda slams Sunny Yi Feng’s application to prospect for coal in Hwange National Park</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "Dam collapse kills four in Chipinge, two still missing",
            "url": "https://www.newzimbabwe.com/dam-collapse-kills-four-in-chipinge-two-still-missing/",
            "content": "By Staff Reporter\n\nThe death toll in the Bandama dam breach in Chipinge, Manicaland Province, has risen to four, with two others still missing.\n\nThe dam collapsed Sunday, sweeping away livestock, irrigation pumps, and grinding mills on nearby farms.\n\nMinister of State for Provincial affairs and Devolution for Manicaland Province Misheck Mugadza conducted a site visit Monday.\n\nIconducted a site visit to the Bandama dam in Chipinge, which unfortunately burst, resulting in devastating consequences.\n\nIn my capacity, I extended condolences to the families of the victims and engaged in discussions with local leaders to assess the situation and explore avenues for support.\n\nRegrettably, the floods have claimed the lives of at least four individuals, and two persons remain unaccounted for. The disaster has also resulted in significant property damage, including the loss of livestock, destruction of pumps, and grinding mills on adjacent farms, leaving a trail of devastation in its wake, he wrote.\n\nAmong the deceased is a minor who had accompanied his mother to do laundry downstream when the dam breached.\n\nAlthough we are waiting for finer details, we are told that there was a female adult who was washing clothes downstream in the company of her two children. One of them, a four-year-old, was swept away, and the body was later retrieved.\n\nThe other person who died was a 30-year-old man who was on a fishing expedition, Civil Protection UNit chairman for Manicaland, John Misi told state media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11093300/bandama.jpeg",
            "description": "<p>By Staff Reporter The death toll in the Bandama dam breach in Chipinge, Manicaland Province, has risen to four, with two others still missing. The dam collapsed Sunday, sweeping away livestock, irrigation pumps, and grinding mills on nearby farms. Minister of State for Provincial affairs and Devolution for Manicaland Province Misheck Mugadza conducted a site</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dam-collapse-kills-four-in-chipinge-two-still-missing/\">Dam collapse kills four in Chipinge, two still missing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        },
        {
            "title": "1win history & expert betting strategies for success",
            "url": "https://www.newzimbabwe.com/1win-history-expert-betting-strategies-for-success/",
            "content": "The online betting industry has witnessed significant growth over the years, with platforms like 1win establishing themselves as major players in the market. Since its inception, 1win has continuously evolved, expanding its services and improving its platform to provide users with an unparalleled betting experience. From introducing new sports markets to enhancing its casino offerings, the company has made notable strides in becoming a trusted destination for bettors worldwide.\n\nBeyond its history and achievements, success on 1win is not just about placing random betsit requires strategy, discipline, and a solid understanding of the betting landscape. Whether wagering on sports events or exploring casino games, having a well-thought-out approach can significantly improve a players chances of winning. Expert betting strategies, such as bankroll management, value betting, and understanding odds movements, play a crucial role in making informed decisions.\n\nFor both beginners and experienced bettors, learning the right techniques is essential to maximizing profits while minimizing risks. Whether you are looking to place single bets, accumulators, or live wagers, applying smart strategies ensures a more controlled and strategic approach to betting. By combining knowledge with disciplined gameplay, players can enhance their betting experience and make the most out of their time on1win.\n\nWith a rich history of growth and a platform that continues to evolve, 1win remains a top choice for those seeking a reliable and rewarding betting experience. By understanding its journey and applying expert-backed betting strategies, users can confidently navigate the world of online betting and increase their chances of success.\n\nSince its inception, 1win has steadily grown into a major player in the online betting and casino industry. What started as a small bookmaker has expanded into a global platform offering diverse sports markets, live betting, and casino gaming. Over the years, the company has achieved significant milestones, adapting to industry trends and continuously improving user experience.\n\nThe table below highlights the key moments in 1wins history and the accomplishments that have shaped its reputation as a reliable and innovative betting platform:\n\nThrough consistent improvements and innovative solutions, 1win has established itself as a trusted platform for both new and experienced bettors. By continuously evolving, embracing technological advancements, and prioritizing user satisfaction, the company remains a top choice for players looking for a high-quality sports betting and casino experience.\n\nAchieving consistent success in sports betting requires more than just luck. Whether you are a beginner or an experienced bettor, applying the right strategies can significantly improve your chances of making profitable wagers. 1win offers a variety of betting markets, and understanding key tactics can help maximize returns while managing risks effectively. Below are expert-recommended strategies that can enhance your betting experience on 1win:\n\nBy applying these expert-backed strategies, bettors can enhance their overall experience on 1win while improving their chances of making profitable decisions. A combination of research, discipline, and smart wagering tactics will lead to a more rewarding and enjoyable betting journey.\n\n1win has established itself as a dynamic and evolving betting platform, offering a rich history of innovation, expansion, and technological advancements. From its early days as a sportsbook to its growth into a global betting hub, the platform continues to enhance the user experience by introducing new features, competitive odds, and diverse betting markets. Its commitment to providing a seamless, secure, and engaging environment has made it a preferred choice for players worldwide.\n\nBeyond understanding the history and achievements of 1win, bettors must approach wagering with a strategic mindset. Success in sports betting is not solely about luckit requires discipline, research, and a calculated approach. By implementing expert strategies such as bankroll management, value betting, and live wagering techniques, players can maximize their potential winnings while minimizing unnecessary risks. Utilizing available promotions, analyzing statistics, and staying disciplined are key factors in maintaining long-term success on the platform.\n\nWhether you are a new user looking to explore the world of online betting or an experienced bettor refining your strategies, 1win provides the perfect balance of entertainment, innovation, and rewarding opportunities. By leveraging the platforms advanced features and applying smart betting techniques, players can elevate their betting experience and increase their chances of success in an ever-evolving market.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/11071901/Screenshot-2025-03-11-at-09.16.30.png",
            "description": "<p>1win: evolution, achievements, and betting strategies for success The online betting industry has witnessed significant growth over the years, with platforms like 1win establishing themselves as major players in the market. Since its inception, 1win has continuously evolved, expanding its services and improving its platform to provide users with an unparalleled betting experience. From introducing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/1win-history-expert-betting-strategies-for-success/\">1win history & expert betting strategies for success</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "12 Mar 2025"
        }
    ]
}