{
    "news": [
        {
            "title": "NAMA Awards: Winky D rules the roost again, clinches People’s Choice gong",
            "url": "https://www.newzimbabwe.com/nama-awards-winky-d-rules-the-roost-again-clinches-peoples-choice-gong/",
            "content": "By James Muonwa\n\nTHE undisputed king of Zim dancehall, Wallace Chirumiko, popularly known as Winky D, has reaffirmed his position as the doyen after scooping the National Arts Merits Award (NAMA) Peoples Choice gong.\n\nThis is the second consecutive year that Winky D has been adjudged the countrys most loved artist.\n\nThe colourful crowning event was held in Harare Saturday night.\n\nNewZimbabwe.com extends hearty congratulations to NAMA23 conveners for hosting the successful event.\n\nHereunder is a full list of winners.\n\n1. Dance Awards\n\nOutstanding Female Dancer: Celine Madziva in Respect My teamOutstanding Male Dancer: Tichaona Hero Chikara in Into the lightOutstanding Dance Group/Production: Khaya Arts Productions in UniAfricaOutstanding Choreographer: Future Dube  Khaya Arts Productions\n\n2. Visual Arts Awards\n\nOutstanding Male Visual Artist: Moffat TakadiwaOutstanding Female Visual Artist: Portia ZvavaheraOutstanding Upcoming Visual Artist: Kundai NathanOutstanding Exhibition: 6th Venice Biennale by Various Artists curated by Fadzai Veronica Muchemwa\n\n3. Spoken Word Awards\n\nOutstanding Poet: Kudakwashe RiceOutstanding Social Media Skits: Panashe Gurende aka MoojayaOutstanding Stand-Up Comedian: Mukudzei Majoni aka King Kandoro\n\n4. Theatre Awards\n\nOutstanding Actress: Caroline Mashingaidze Zimbizi as Tete Sabina in Family RiotsOutstanding Actor: Michael Kudakwashe as Sidney in Family RiotsOutstanding Theatrical ProductionThe Aftermath by Patsimeredu TrustOutstanding Director: Everson Ndlovu  HaywireOutstanding Playwright: Leonard Matsa  Promise\n\n5. Literary Arts Awards\n\nOutstanding First Published Work: Zagamo the war within by Ray Mawerera, Published by Royalty BooksOutstanding Childrens Book: Chimbira nedzimwe ngano by Primrose Dzenga Published by Torch Bearers Trust BooksOutstanding Fiction Book: Weeping Tomato by Samantha Rumbidzai Vazhure Published by Carnelian Hearts LimitedOutstanding Non-Fiction Book: Entrepreneurial Success: Insights on Growing Business in a Fluid Economy by Divine Simbi-Ndhlukula PhD Published by Divine Simbi-Ndlukula(PhD)\n\n6. Film & Television Awards\n\nOutstanding Actress: Munashe Goromonzi as Tsitsi in The November PromiseOutstanding Actor: Skanyiso Ngwenya as Rise in RiseOutstanding Music Video: Nhemamusasa by Bagga Directed by Leopold Tapiwa Vengesa aka Leoy VOutstanding Screen Production (Television): The DNA Show by Tinashe MugabeOutstanding Screen Production (Short film): Dollar by Tawanda VomboOutstanding Screen Production (Full Length film): Nhoroondo by Vusa Hlatshwayo\n\n7. Music Awards\n\nOutstanding Female Musician: Thamsanqa Moyo aka Tamy MoyoOutstanding Male Musician: Hillary Marufu aka Master HOutstanding Breakthrough Musician: Gift Kudakwashe Hombarume aka Chill MasterOutstanding Music Group: The UnveiledOutstanding Song: Kana Ndanyura by Kelvin Kusikwenyu aka Killer TOutstanding Album: NOP Makoni by Nkosilathi Sibiya aka Voltz JT\n\n8. Special Awards\n\nPromoter of the Year: Event HulksOutstanding Artist in the Diaspora: Masimba Hwati (Visual Artist) based in PolandArts Service Award: Prince Edward SchoolArts Personality Award: Partson ChimbodzaLifetime Achievement Award: Philip SvosvePeoples Choice Award: Wallace Chirumiko aka Winky D\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/05150922/Winky-1.png",
            "description": "<p>By James Muonwa  THE undisputed king of Zim dancehall, Wallace Chirumiko, popularly known as Winky D, has reaffirmed his position as the doyen after scooping the National Arts Merits Award (NAMA) People’s Choice gong. This is the second consecutive year that Winky D has been adjudged the country’s most loved artist. The colourful crowning event</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nama-awards-winky-d-rules-the-roost-again-clinches-peoples-choice-gong/\">NAMA Awards: Winky D rules the roost again, clinches People’s Choice gong</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "‘Sun doesn’t rise before another one sets’— says Zanu PF Women’s League boss taking aim at VP Chiwenga over Mnangagwa succession",
            "url": "https://www.newzimbabwe.com/sun-doesnt-rise-before-another-one-sets-says-zanu-pf-womens-league-boss-taking-aim-at-vp-chiwenga-over-mnangagwa-succession/",
            "content": "By Staff Reporter\n\nZANU PF Womens League national chairperson, Mabel Chinomona has fired salvos, declaring that President Emmerson Mnangagwa is going nowhere despite growing calls for his resignation before expiry of his term.\n\nWar veterans, including some affiliated to the ruling Zanu PF party, have been vociferous urging the 82-year-old Zanu PF leader to step aside for presiding over a ruinous economy while corruption festers under his watch.\n\nThe calls follow attempts by Mnangagwas henchmen to push the 2030 agenda aimed at perpetuating his stay in office beyond his second and final term that expires in 2028. Another faction opposed to the move is positioning Vice President Constantino Chiwenga to take over from the ageing Zanu PF stalwart.\n\nAddressing the national executive of the critical organ of the party in Harare Friday, Chinomona lamented the unrelenting attacks on the person of the President, saying the trend was unprecedented.\n\nShe asserted that social media activists agitating for a change of guard at State House should desist from attacking Mnangagwa, arguing he has ushered in transformative developmental projects since inception of the Second Republic.\n\nPeople are busy giving each other positions on social media, that this is your year, so-and-so will assume leadership. There is no sun that rises before another one sets dont bother us with your nuisances, Chinomona said to wild applause from attendees.\n\nIt is common knowledge that from Mnangagwa, there will come other leaders, it is everywhere, this one comes and goes\n\nbut do we get positions by insulting others? Which country does that? Let us not let this country go down under our watch as women. How does it go down under our watch?\n\nHave you ever lived in a country in which its President is insulted? Have you ever lived in such a country?\n\nChinomona, who doubles as Senate President, is a Mnangagwa loyalist whose utterances were predictable given that she owes her current plum posts to the octogenarian leader.\n\nShe cajoled Mnangagwa, whom she described as too good to reign in dissenting voices.\n\nWe want to appeal to our President that you have let us down (by not punishing detractors). You have been too good, she added.\n\nThe Zanu PF Womens League boss accused some unprincipled party elements of accepting bribes as little as US$10 to denigrate party leadership inspite of them having rolled out myriad empowerment programmes, including, among others, chicken rearing projects.\n\nDuring Fridays event, Chinomona paraded state-of-the-art egg incubators, which will be distributed to all the countrys 10 provinces to boost poultry projects by women.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/01001618/Mabel-Chinomona.png",
            "description": "<p>By Staff Reporter  ZANU PF Women’s League national chairperson, Mabel Chinomona has fired salvos, declaring that President Emmerson Mnangagwa is going nowhere despite growing calls for his resignation before expiry of his term. War veterans, including some affiliated to the ruling Zanu PF party, have been vociferous urging the 82-year-old Zanu PF leader to step</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sun-doesnt-rise-before-another-one-sets-says-zanu-pf-womens-league-boss-taking-aim-at-vp-chiwenga-over-mnangagwa-succession/\">‘Sun doesn’t rise before another one sets’— says Zanu PF Women’s League boss taking aim at VP Chiwenga over Mnangagwa succession </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "299 babies and 54 mothers die in a month as Zimbabweans pay the price for shambolic health system",
            "url": "https://www.newzimbabwe.com/299-babies-and-54-mothers-die-in-a-month-as-zimbabweans-pay-the-price-for-shambolic-health-system/",
            "content": "By Darlington Gatsi\n\nORDINARY citizens are bearing the brunt of a poor healthcare system in Zimbabwe with nearly 300 babies and 54 women dying due to complications while giving birth in January 2025 alone.\n\nDeputy Minister of Health and Childcare, Sleiman Kwidini, recently told Parliament that nearly 300 infants and 54 women died due to complications during childbirth in January 2025.\n\nHarare recorded the highest number of neonatal deaths, with 111 cases, alongside 19 maternal deaths.\n\nKwidini stated that maternal deaths were primarily caused by surgical complications and underlying health issues.\n\nThe maternal deaths as at January 2025 to date is currently set as 54. Moving back to 2024, I will start by Harare Province where we have maternal deaths of 19 and neonatal deaths of 111.\n\nThe leading cause of death was hypertensive disorders and its complications, including renal failure. The other was post-partum hemorrhage post having an abortion, post normal delivery and also post caesarian section. Sexes was also a contributory factor. Some had underlying HIV and Diabetic Mellitus conditions. Other causes were a dilated cardiomyopathy, said Kwidini.\n\nThe deputy minister added that neonatal deaths were mainly caused by respiratory complications.\n\nOn neonatal deaths of 299, the leading cause was respiratory distress as a complication. Secondary was birth asplenium due to challenges with intercultural chair, he said.\n\nZimbabwes healthcare system has come under intense scrutiny, with the government accused of neglecting the critical sector.\n\nCritics have slammed the government for failing to allocate sufficient funding to hospitals and rural health institutions while embarking on profligacy buying luxury top-of-the-range vehicles for bureaucrats, among other hefty perks.\n\nThe situation has been exacerbated by the departure of healthcare workers to European countries due to poor remuneration.\n\nKwidini acknowledged that rural communities are disproportionately affected by the lack of adequate health services.\n\nIt is very true that we are having challenges in rural areas, especially when one changes skills and also the road networks where our people should access medical attention quickly, especially the pregnant women.\n\nHowever, what we have done as the ministry now is, we are retraining because we know our trained midwives have migrated to what is called greener pastures, which gives us a burden as a ministry. So, we have reintroduced a massive retraining of midwives so that we can cater for those people in rural areas.\n\nWe are also upgrading what we call primary care nurses in rural areas to be able to be midwives so that they can also render the services like the ones which were being given by those departed midwives.\n\nWe have gone far further to deploy what we call mobile small scanning machines so that our pregnant women can undergo scanning, which is recommended at the initial stage where the pregnant woman is going to book for antenatal care so that we reduce those complications, especially on maternal and neonatal deaths, Kwidini said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/04161134/Hospital-child-cancer.jpg",
            "description": "<p>By Darlington Gatsi  ORDINARY citizens are bearing the brunt of a poor healthcare system in Zimbabwe with nearly 300 babies and 54 women dying due to complications while giving birth in January 2025 alone. Deputy Minister of Health and Childcare, Sleiman Kwidini, recently told Parliament that nearly 300 infants and 54 women died due to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/299-babies-and-54-mothers-die-in-a-month-as-zimbabweans-pay-the-price-for-shambolic-health-system/\">299 babies and 54 mothers die in a month as Zimbabweans pay the price for shambolic health system </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Woman in soup for facilitating release of armed robbers from prison, harbouring them at her house",
            "url": "https://www.newzimbabwe.com/woman-in-soup-for-facilitating-release-of-armed-robbers-from-prison-harbouring-them-at-her-house/",
            "content": "By Staff Reporter\n\nPOLICE in Zimbabwe are seeking the incarceration of a woman accused of facilitating the release of armed robbers from prison and harbouring them at her house.\n\nTheresa Chenjerai (49) was arrested on Thursday on bribery charges after she allegedly connived with another robbery suspect, Munyaradzi Zakkaria and offered US$150 to a detective to testify in favour of their colleague, who is facing 15 counts of robbery at Norton Magistrates Court.\n\nChenjerai and Zakkaria were not asked to plead to the charges when they appeared before a Norton magistrate on Saturday.\n\nThey were remanded in custody to Monday, March 3 for bail application.\n\nAccording to the police, Theresa Chenjerai is wife to suspected armed robber Andrew Chenjerai, who is currently out on bail, facing two counts of the violent crime and is the one who masterminded her husbands release from prison.\n\nAndrew will be appearing before a Harare magistrate on March 11 for an armed robbery trial.\n\nThe police also allege that Theresa facilitated the release of Zakkaria from prison on two counts of armed robbery and has been harbouring him at her house hence pushing for their further detention pending trial.\n\nIt is their belief Chenjerai is gathering a criminal gang of armed robbers with potential to destabilise the city through organised crime hence they should be locked up.\n\nThe police further say the two have capacity to interfere with investigations and obstructing the course of justice as demonstrated in the US$150 offer to a detective to derail cases of robbery in court.\n\nCircumstances are that on February 27 the two connived and offered US$150 to detective sergeant Kwashira for him to testify in favour of their friend one Nickson Tapuwa Mazaranye so that he would be acquitted on 15 counts of robbery he is facing at Norton Magistrates Court.\n\nReports are that the detective went and advised his Officer-ln-Charge Detective Inspector Ndofirepi, who then set a trap, putting a team on surveillance, monitoring the suspects meeting with the detective.\n\nZakkaria was then arrested at Norton Police Station when he allegedly gave the detective the US$150 and upon interview, he then confessed that Theresa Chenjerai was the one who had sent him with the money to facilitate the release of Mazaranye.\n\nAccording to the State, further investigations showed the two were working together after their call history was checked.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28195641/court-hammer_1.width-800.jpg",
            "description": "<p>By Staff Reporter  POLICE in Zimbabwe are seeking the incarceration of a woman accused of facilitating the release of armed robbers from prison and harbouring them at her house. Theresa Chenjerai (49) was arrested on Thursday on bribery charges after she allegedly connived with another robbery suspect, Munyaradzi Zakkaria and offered US$150 to a detective</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-in-soup-for-facilitating-release-of-armed-robbers-from-prison-harbouring-them-at-her-house/\">Woman in soup for facilitating release of armed robbers from prison, harbouring them at her house </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Zimbabwe faces rolling power blackouts as ZESA switches off Hwange units for maintenance",
            "url": "https://www.newzimbabwe.com/zimbabwe-faces-rolling-power-blackouts-as-zesa-switches-off-hwange-units-for-maintenance/",
            "content": "By Staff Reporter\n\nTHE month of March is set to bring misery to Zimbabweans, who will have to endure incessant power cuts after the countrys electricity utility announced plans to shutdown two units at Hwange Power Station.\n\nThe move is aimed at allowing routine maintenance to be done on Unit 6 and 7 at the thermal power station, which is one of the major sources of energy in the country.\n\nIn a statement at the weekend, Zimbabwe Electricity Supply Authority (ZESA) Holdings announced the impending shutdown for scheduled plant maintenance aimed at ensuring the long-term reliability and efficiency of the countrys ageing power generation infrastructure.\n\nAccording to the notice, Hwanges Unit 7 will be subjected to a Class B maintenance programme from March 2 to March 29, 2025.\n\nThis development comes after the successful completion of a Class C maintenance programme for Hwange Unit 8, which was done in January 2025.\n\nAdditionally, Hwange Unit 6 will be taken offline for statutory maintenance from March 15 to May 14, 2025, a critical step to prepare the unit for increased power generation during the peak winter season.\n\nThe maintenance activities are part of ZESAs proactive approach to ensuring the stability and sustainability of Zimbabwes power supply, reads part of the statement.\n\nWhile the outages may temporarily supress available generation capacity, ZESA has guaranteed the consumers that mitigation measures were being considered to ease the impending blackouts.\n\nZESA has emphasized that Karibas output will be carefully managed to address periods of low supply, with adjustments made as necessary to conserve water resources for future use.\n\nThis balanced approach aims to maintain a sustainable energy mix while minimizing the impact on consumers.\n\nThe power utility emphasised its commitment to delivering reliable and efficient power supply, underscoring the importance of these maintenance activities in safeguarding the nations energy infrastructure.\n\nZimbabwe has been facing electricity generation challenges for decades owing to obsolete infrastructure at its hydroelectricity and thermal power plants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/21021127/Power-Cuts-1.png",
            "description": "<p>By Staff Reporter  THE month of March is set to bring misery to Zimbabweans, who will have to endure incessant power cuts after the country’s electricity utility announced plans to shutdown two units at Hwange Power Station. The move is aimed at allowing routine maintenance to be done on Unit 6 and 7 at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-faces-rolling-power-blackouts-as-zesa-switches-off-hwange-units-for-maintenance/\">Zimbabwe faces rolling power blackouts as ZESA switches off Hwange units for maintenance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Death toll from blasts in eastern DR Congo rises to 16",
            "url": "https://www.newzimbabwe.com/death-toll-from-blasts-in-eastern-dr-congo-rises-to-16/",
            "content": "By Xinhua\n\nKINSHASA The death toll from two explosions in Bukavu in eastern Democratic Republic of the Congo (DRC) has risen to 16, government spokesman Patrick Muyaya said late Friday.\n\nThe explosions occurred Thursday at the heart of Bukavu shortly after a political rally in support of the M23 rebels. The government and M23 accused each other of perpetrating the blasts.\n\nM23 claims control over several territories in eastern DRC, including Bukavu and Goma, the provincial capitals of South Kivu and North Kivu. On Friday, M23 appointed a governor of South Kivu, after establishing a parallel administration in North Kivu in mid-February.\n\nThe ongoing conflict between M23 and the DRC government is deeply rooted in the aftermath of the 1994 Rwandan genocide and longstanding ethnic tensions.\n\nThe DRC accuses Rwanda of supporting M23, while Rwanda claims that the DRC army has allied with the Democratic Forces for the Liberation of Rwanda, a rebel group accused of participating in the genocide against Tutsis.\n\nThe conflict has led to massive population displacements and a worsening humanitarian crisis. Tensions remain high despite diplomatic and military efforts to end the hostilities.\n\nA meeting of foreign ministers from the Southern African Development Community (SADC) and the East African Community (EAC), initially scheduled for Friday in Harare, Zimbabwe, did not take place for unknown reasons.\n\nThe joint SADC-EAC summit in Dar es Salaam, Tanzania, three weeks ago represents the latest peace mechanism to address the crisis in the Great Lakes region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/01192616/06594740-f514-11ef-a276-596f7e6218f8.jpg.jpeg",
            "description": "<p>By Xinhua KINSHASA— The death toll from two explosions in Bukavu in eastern Democratic Republic of the Congo (DRC) has risen to 16, government spokesman Patrick Muyaya said late Friday. The explosions occurred Thursday at the heart of Bukavu shortly after a political rally in support of the M23 rebels. The government and M23 accused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/death-toll-from-blasts-in-eastern-dr-congo-rises-to-16/\">Death toll from blasts in eastern DR Congo rises to 16</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Trump and Zelensky in extraordinary Oval Office shouting match",
            "url": "https://www.newzimbabwe.com/trump-and-zelensky-in-extraordinary-oval-office-shouting-match/",
            "content": "By AFP\n\nUS President Donald Trump cut short a meeting with Volodymyr Zelensky on Friday and said the Ukrainian leader is not ready for peace with Russia in an extraordinary meltdown in the Oval Office that threw question marks over chances for a truce.\n\nZelensky was meant to be making a full White House visit to sign a US-Ukrainian deal for joint exploitation of Ukraines mineral resources, as part of a post-war recovery in a US-brokered peace deal.\n\nInstead, an ugly clash blew up almost immediately in the Oval Office where Trump and Vice President JD Vance shouted at Zelensky, accusing him of not being thankful for US help in the three-year war against Russian invasion.\n\nTrump berated Zelensky, telling him to be more thankful and that without US assistance Ukraine would have been conquered by Russia.\n\nYoure either going to make a deal or were out, Trump added.\n\nAnd if were out, youll fight it out and I dont think its going to be pretty.\n\nZelensky left in his motorcade shortly after, without holding a planned joint press conference. The resources deal was left unsigned, the White House said.\n\nTrump took to his Truth Social platform to castigate Zelensky saying he disrespected the United States of America in its cherished Oval Office.\n\nZelensky is not ready for peace, Trump wrote.\n\nHe can come back when he is ready for peace.\n\nCompromise row\n\nThe extraordinary meltdown came after Trump said Ukraine will have to make compromises in a truce with Russia, which has occupied swaths of Ukraine, destroying entire cities and towns along the way.\n\nYou cant do any deals without compromises. So certainly, hes going to have to make some compromises, but hopefully they wont be as big as some people think, Trump said.\n\nBut showing Trump pictures of war atrocities and referring to Russian President Vladimir Putin, Zelensky said there should be no compromises with a killer on our territory.\n\nCrazy Russians, he said, deported Ukrainian children and committed war crimes during their three-year invasion of his country.\n\nThe dramatic public breakdown in the long-tense relationship between Zelensky and Trump came after their meeting  in front of a large group of journalists  had appeared to get off to a friendlier start.\n\nZelensky had said, I think President Trump is on our side.\n\nTruce talks in doubt\n\nThe clash left in doubt efforts led by Trump to cast himself as mediator in the war.\n\nThe leaders of France and Britain also came to the White House this week, seeking to persuade Trump not to take the Russian line and to bolster US support for Ukraine in a future truce.\n\nAfter the drama in the White House, Polands Prime Minister Donald Tusk told Zelensky: You are not alone.\n\nTrump has alarmed Kyiv and European allies with his abrupt U-turn in US policy, ending what had been full-throated support for Ukraines attempt to defeat the Russian invasion and casting himself as a mediator between Putin and Zelensky.\n\nTrump said in the Oval Office that he had spoken on numerous occasions to Putin  more than has been publicly reported beyond the lengthy call between the two leaders earlier this February.\n\nSpeaking before the shouting match erupted, Trump told Zelensky that a truce is fairly close.\n\nThe US leader also said that the proposed minerals deal would be very fair.\n\nThe proposal was to give Washington financial benefits for helping Ukraine in a truce, even if Trump has repeatedly refused to commit any US military force as a back-up to European troops who might act as peacekeepers.\n\nDictator without elections\n\nThe clash came after Trump has flip-flopped in his tone on Zelensky.\n\nTrump called him a dictator last week and has repeatedly blamed Ukraine for Russias February 2022 invasion and echoed a series of Kremlin talking points about how the war started.\n\nBut on Thursday, Trump said at a joint press conference with British Prime Minister Keir Starmer: I have a lot of respect for him.\n\nWere going to get along really well, he said.\n\nTrump, who has repeatedly expressed admiration for Putin, said this week he trusts Putin to keep his word on any ceasefire.\n\nSenate Democrats accused Trump and Vance of siding with Putin.\n\nThey are doing Putins dirty work. Senate Democrats will never stop fighting for freedom and democracy, Democratic Senate Minority Leader Chuck Schumer posted on social media.\n\nDisgraceful, said Senator Chris Van Hollen.\n\nAs tensions between Moscow and Washington escalated, Russias assault on Ukraine continued.\n\nRussian infantry were on Friday storming the Ukrainian border from the Russian region of Kursk, near areas of the region that were seized last summer by Ukrainian forces, Kyiv said Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/01060813/240120205758-zelensky-trump-split-012024.jpg",
            "description": "<p>By AFP US President Donald Trump cut short a meeting with Volodymyr Zelensky on Friday and said the Ukrainian leader is “not ready” for peace with Russia in an extraordinary meltdown in the Oval Office that threw question marks over chances for a truce. Zelensky was meant to be making a full White House visit</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-and-zelensky-in-extraordinary-oval-office-shouting-match/\">Trump and Zelensky in extraordinary Oval Office shouting match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Woman jailed for facilitating rape of own daughter (6)",
            "url": "https://www.newzimbabwe.com/woman-jailed-for-facilitating-rape-of-own-daughter-6/",
            "content": "By Staff Reporter\n\nA 43-year-old Penhalonga woman has been slapped with a 10-year jail term following conviction for assisting a man rape her minor daughter.\n\nThe woman, whose identity was withheld to protect the victim, was convicted by a Mutare magistrate after a full trial.\n\nProsecutors proved that the incident took place in 2022.\n\nThe woman is the one who undressed her 6-year-old daughter and ordered her to lie down before she was violated by accused person.\n\nShe sat in a chair and watched while her daughter was being abused.\n\nThe offender assisted an adult male unknown to the prosecutor, to rape the child.\n\nThe mother undressed the child while the unknown male was watching sitting on the bed. She then instructed her child to lie on her back on the bed. The unknown male took off his clothes and raped the child once, while the mother was watching, sitting on a chair in the bedroom, the National Prosecuting Authority said.\n\nThe matter eventually came to light in April last year when the child was living with her grandmother.\n\nThe grandmother discovered that the child was suffering from urinary incontinence.\n\nThe girl narrated that it began soon after she was raped.\n\nShe revealed the role that her mother had played in the ordeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter  A 43-year-old Penhalonga woman has been slapped with a 10-year jail term following conviction for assisting a man rape her minor daughter. The woman, whose identity was withheld to protect the victim, was convicted by a Mutare magistrate after a full trial. Prosecutors proved that the incident took place in 2022. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-jailed-for-facilitating-rape-of-own-daughter-6/\">Woman jailed for facilitating rape of own daughter (6)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "AMH owner Trevor Ncube demands a day in court as his journalist is denied bail",
            "url": "https://www.newzimbabwe.com/amh-owner-trevor-ncube-demands-a-day-in-court-as-his-journalist-is-denied-bail/",
            "content": "By Mary Taruvinga\n\nALPHA Media Holdings (AMH) publisher, Trevor Ncube has challenged the police to arrest him arguing that his reporter, Blessed Mhlanga who is currently languishing in jail after he was denied bail by a Harare magistrate is not a publisher.\n\nNcube, who is President Emmerson Mnangagwas former advisor, was responding to questions by journalists at Harare Magistrates Court where he had come in solidarity with Mhlanga.\n\nMhlanga was arrested Monday after handing himself over to the police.\n\nHe is accused of publishing messages which incite violence following his interviews with outspoken war veteran, Blessed Runesu Geza, who demanded that President Mnangagwa should step down.\n\nNcube said Mhlanga is not the owner of AMH television channel, Heart and Soul as such deserved freedom.\n\nBlessed is not AMH. Hes just a journalist practicing his profession, which is constitutionally protected, just like you guys are doing here, broadcasting to the public at home.\n\nYou cant be accused of inciting the public for broadcasting what Im saying right now.\n\nI am the one who should be brought before the courts, not the journalists who transmit the information. So, Im disappointed in that regard, but this is the reality that we are in right now, Ncube said.\n\nThe media entrepreneur said he was disappointed that Mhlanga was denied bail, pointing to selective application of the law and also accused the court of failing to appreciate that there should be freedom of the press.\n\nHe also accused Mnangagwa of controlling the judiciary, noting that the President literally owns the courts.\n\nI think fundamentally important is the fact that there wasnt any indication that the court realises that youre dealing with freedom of expression and press freedom, and that Blessed did not say any of the stuff that he is alleged to have said.\n\nUnfortunately, President Mnangagwa owns the courts. They have said they own the military; they own the police, they will do as they please. We will continue; I mean, Im sure the lawyers will do what is right, but what we saw happening today is not fair; It is not justice, and our Constitution does not support what has just taken place here, Ncube said.\n\nMhlanga was denied bail by Harare Magistrate Farai Gwitima, who ruled that he was likely to interfere with witnesses who are his subordinates.\n\nThe magistrate also said his release will jeopardise peace in Zimbabwe, among other reasons.\n\nHis lawyer Chris Mhike said he will be filing an appeal at the High Court as soon as possible.\n\nMhlanga will be back in court March 14 for routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21101343/Trevor-Ncube.jpeg",
            "description": "<p>By Mary Taruvinga ALPHA Media Holdings (AMH) publisher, Trevor Ncube has challenged the police to arrest him arguing that his reporter, Blessed Mhlanga who is currently languishing in jail after he was denied bail by a Harare magistrate is not a publisher. Ncube, who is President Emmerson Mnangagwa’s former advisor, was responding to questions by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/amh-owner-trevor-ncube-demands-a-day-in-court-as-his-journalist-is-denied-bail/\">AMH owner Trevor Ncube demands a day in court as his journalist is denied bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        },
        {
            "title": "Harare’s Geo-Pomona waste-to-energy deal sparks corruption fears, residents allege it’s a feeding trough",
            "url": "https://www.newzimbabwe.com/harares-geo-pomona-waste-to-energy-deal-sparks-corruption-fears-residents-allege-its-a-feeding-trough/",
            "content": "By Darlington Gatsi\n\nIMPOSING deals from private companies on City of Harare (CoH) without following proper procedures and consultation creates a breeding ground for corruption, residents have said.\n\nThese are the sentiments of the Combined Harare Residents Association (CHRA), who are at loggerheads with council and the Ministry of Local Government over the approval of Geo Pomona to carry out waste management in the capital.\n\nSpeaking at a recent meeting with Harare Mayor Jacob Mafume at Town House, CHRA director Reuben Akili said that the failure to consult and the passing of council resolutions on private partnerships creates channels for corruption.\n\nWhen you read the addendum for the Pomona project, it also speaks to the issues of the local authority transferring equipment and moving workers to Geo Pomona, which is likely an agreement that was not discussed.\n\nWe need to look at the root causes of this corruption. This is very important because when you look at these committees, they play an oversight role.\n\nWhen issues are discussed in a chamber like this, decisions are made at that level. But when decisions do not originate from there, we create room for corruption. We create room for the bleeding of council resources, said Akili.\n\nGeo Pomona was established in 2022 after a Dutch waste management firm, Geogenix BV, secured a US$350 million waste-to-energy deal with the city.\n\nGeo Pomonas operations with Harare have been a source of contention among residents amid new information that the firms local focal person, Delish Nguwaya, and President Emmerson Mnangagwas son, have 50-50 percent shares in the company.\n\nInitially, Town House opposed granting permission for Geo Pomona to take over its dumping sites but has since changed its stance, agreeing to work together to clear the dump sites.\n\nGeo Pomona Waste Management will collect 650 tonnes of refuse daily at a rate of US$40 per tonne.\n\nDespite objections from residents, Geo Pomonas projects have been dubbed a model to emulate in other cities by the government.\n\nMafume, once a vocal critic of Geo Pomona, told residents that private partnerships such as this one will transform the CoH.\n\nLet us be clear, there are certain things that can be done better if we work with the private sector. I do understand that initially, the dump site was an issue of contention, even for me, but if you go there now, the place is clean.\n\nThe place has no smell. The place has been effectively managed. If you remember, we, as the residents or as the city council at that time, said we would not pay, and the payment was done from the central fiscus. They have sorted the place out, and the residents did not have to pay.\n\nThat is a model that seems to work. We might have issues with it, but those are issues that we can address, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/24161628/Pomona-dumpsite-7.png",
            "description": "<p>By Darlington Gatsi IMPOSING deals from private companies on City of Harare (CoH) without following proper procedures and consultation creates a breeding ground for corruption, residents have said. These are the sentiments of the Combined Harare Residents Association (CHRA), who are at loggerheads with council and the Ministry of Local Government over the approval of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harares-geo-pomona-waste-to-energy-deal-sparks-corruption-fears-residents-allege-its-a-feeding-trough/\">Harare’s Geo-Pomona waste-to-energy deal sparks corruption fears, residents allege it’s a feeding trough</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "02 Mar 2025"
        }
    ]
}