{
    "news": [
        {
            "title": "NetOne CEO granted US$500 bail in US$1.2 million fraud case",
            "url": "https://www.newzimbabwe.com/netone-ceo-granted-us500-bail-in-us1-2-million-fraud-case/",
            "content": "By Mary Taruvinga\n\nNetOne Cellular (Pvt) Ltd Chief Executive Officer, Raphael Mushanawani (60) has been granted US$500 bail after he appeared in court facing fraud charges involving more than US$1.2 million.\n\nMushanawani, who is the Group CEO and Accounting Officer of the state-owned mobile operator, appeared before Harare Magistrate Marewanazvo Gofa on Wednesday.\n\nThe state had opposed bail but the magistrate ruled that Mushanawani was not a flight risk.\n\nHe is employed and a man of fixed abode, Gofa said in her ruling.\n\nAs part of his bail conditions, Mushanawani was ordered to surrender his passport to the clerk of court and not to interfere with State witnesses.\n\nThe complainant in the case is NetOne, represented by its Board Chairperson, Engineer Taurayi Maurukira.\n\nAccording to the State, sometime in 2022, NetOne initiated a procurement process to replace its SAGE 1000 system with a new Enterprise Resource Planning (ERP) system. The tender was approved by the NetOne board, with Farevic Systems (Pvt) Ltd awarded the contract worth US$2,422,500 to supply and implement the SAP system.\n\nProsecutors allege that while Farevic was still implementing the project, Mushanawani, acting in connivance with other NetOne managers who are yet to be arrested, devised a scheme to siphon company funds. He allegedly misled the Executive Management Committee and the board into believing that it was necessary to upgrade the old SAGE 1000 system, which was already being phased out.\n\nThrough this misrepresentation, Mushanawani allegedly signed a separate contract with Lunartech Solutions (Pvt) Ltd worth US$257,600 for the so-called SAGE 1000 upgrade. He later signed several addendums, inflating the cost of the project to US$1.2 million.\n\nTo date, NetOne has allegedly paid Lunartech US$654,331.60 without the knowledge or approval of the board.\n\nThe State further alleges that Mushanawani and his accomplices fraudulently committed the company to a separate consultancy contract with Diztech valued at US$79,467.49, even though the same services were already included and paid for under the original Farevic contract.\n\nAs a result, NetOne was allegedly prejudiced of US$654,331.60, with a potential further prejudice of US$625,135.89.\n\nMushanawani is expected back in court on October 22 for his routine remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30061209/NETONE-CEO-Raphael.jpeg",
            "description": "<p>By Mary Taruvinga NetOne Cellular (Pvt) Ltd Chief Executive Officer, Raphael Mushanawani (60) has been granted US$500 bail after he appeared in court facing fraud charges involving more than US$1.2 million. Mushanawani, who is the Group CEO and Accounting Officer of the state-owned mobile operator, appeared before Harare Magistrate Marewanazvo Gofa on Wednesday. The state</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/netone-ceo-granted-us500-bail-in-us1-2-million-fraud-case/\">NetOne CEO granted US$500 bail in US$1.2 million fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "02 Oct 2025"
        },
        {
            "title": "Julius Malema convicted of firing a gun in public",
            "url": "https://www.newzimbabwe.com/julius-malema-convicted-of-firing-a-gun-in-public/",
            "content": "BBC\n\nSouth African opposition politician Julius Malema has been found guilty of discharging a firearm in public seven years ago.\n\nIn 2018, a video emerged showing the Economic Freedom Fighters (EFF) leader firing several shots in the air during his partys fifth anniversary celebrations held in the countrys Eastern Cape province.\n\nHe was charged alongside his former bodyguard Adriaan Snyman, who was acquitted.\n\nThis is Malemas second conviction in less than two months and he could face up to 15 years in prison.\n\nMalema often sparks controversy in a nation where, 31 years after apartheid ended, racial tensions still high. He was recently convicted of hate speech.\n\nMalema was convicted of five offences, including the unlawful possession of a firearm and ammunition, discharging it in a public space and reckless endangerment. The first charge carries a maximum 15-year sentence.\n\nHe was accused of firing between 14 and 15 live rounds on a stage in front of 20,000 EFF supporters, according to South African news site SowetanLIVE.\n\nIn his defence, Malema told the court the firearm was not his and that he had fired the shots to rouse the crowd, the publication added.\n\nIt took three days for magistrate Twanet Olivier to tell Malema you are found guilty as charged. The case was postponed to January 2026 for pre-sentencing.\n\nMalemas prosecution came after Afrikaner lobby group AfriForum, which has a contentious relationship with Malema and the EFF, opened a case against him after the video went viral.\n\nAfriForum was also among those who laid a hate speech complaint against the EFF MP at South Africas Human Rights Commission.\n\nThis resulted in his conviction by the countrys equality court in August this year.\n\nAfter an incident where a white man allegedly assaulted an EFF member, Malema said: No white man is going to beat me up you must never be scared to kill. A revolution demands that at some point there must be killing.\n\nThe equality court ruled that these remarks demonstrated an intent to incite harm, but the EFF said they were taken out of context.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/24191112/Julius-Malema.png",
            "description": "<p>BBC South African opposition politician Julius Malema has been found guilty of discharging a firearm in public seven years ago. In 2018, a video emerged showing the Economic Freedom Fighters (EFF) leader firing several shots in the air during his party’s fifth anniversary celebrations held in the country’s Eastern Cape province. He was charged alongside</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/julius-malema-convicted-of-firing-a-gun-in-public/\">Julius Malema convicted of firing a gun in public</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "02 Oct 2025"
        },
        {
            "title": "Congo’s ex-president Kabila sentenced to death in absentia by military court",
            "url": "https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/",
            "content": "Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/12005230/Joseph-Kabila-e1530910845219.jpg",
            "description": "<p>Reuters Former Democratic Republic of Congo president Joseph Kabila was sentenced to death in absentia on Tuesday by a military court that convicted him of war crimes, treason, and crimes against humanity. The case stems from his alleged role in backing the advance of Rwanda-backed M23 rebels in Congo’s volatile east. Kabila, who led Congo from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congos-ex-president-kabila-sentenced-to-death-in-absentia-by-military-court/\">Congo’s ex-president Kabila sentenced to death in absentia by military court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "02 Oct 2025"
        },
        {
            "title": "Parliament: “Cut off the manhood!” – MP calls for castration of rapists",
            "url": "https://www.newzimbabwe.com/parliament-cut-off-the-manhood-mp-calls-for-castration-of-rapists/",
            "content": "By Anna Chibamu\n\nA femalelegislator has made a bold plea in Parliament, calling for the castration of convicted rapists, particularly repeat offenders.\n\nGoromonzi West MP Beata Nyamupinga made the appeal during Tuesdays National Assembly session, urging lawmakers to take urgent steps to protect women and children from rampant sexual violence.\n\nHer remarks followed two shocking incidents that have sparked national outrage: the rape of a Grade 7 girl by a tout at Harares Rezende bus terminus, and a viral video showing two 16-year-old boys gang-raping a 17-year-old girl who appeared unconscious.\n\nWe are crying over the issue of rape. We are grieving as women of this country. The whole nation is not happy to see a fit gentleman having sexual intercourse with a young child, Nyamupinga said.\n\nShe further urged her female colleagues to lobby President Emmerson Mnangagwa directly, arguing that stiffer penalties were urgently needed.\n\nCan we have something as a matter of urgency to ensure that if somebody is caught having sexual intercourse with a minor, they should be castrated. If he maintains that manhood, he will not have the discipline to stop. As women, we live in fear,where can we safely keep our children when we go to work, to church, or even here in Parliament? she asked, drawing applause across the House.\n\nNyamupinga stressed that prison sentences alone were insufficient, since many offenders re-offend upon release.\n\nIf you decide it is not good to cut off his manhood, then let us castrate them, she insisted.\n\nActing Speaker of Parliament Joseph Tshuma acknowledged the gravity of the issue, condemning the sexual abuse of minors as incomprehensible and appalling.\n\nHe suggested that Nyamupinga consider introducing a Private Members Bill to push for harsher penalties, including possible life sentences for child rapists.\n\nWhile Zimbabwe has abolished the death penalty, certain crimes, particularly the rape of minors, demand severe consequences, the Acting Speaker said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Anna Chibamu A female legislator has made a bold plea in Parliament, calling for the castration of convicted rapists, particularly repeat offenders. Goromonzi West MP Beata Nyamupinga made the appeal during Tuesday’s National Assembly session, urging lawmakers to take urgent steps to protect women and children from rampant sexual violence. Her remarks followed two shocking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-cut-off-the-manhood-mp-calls-for-castration-of-rapists/\">Parliament: “Cut off the manhood!” – MP calls for castration of rapists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "02 Oct 2025"
        },
        {
            "title": "HERD euthanises elephant Limpopo after fatal attack on senior carer",
            "url": "https://www.newzimbabwe.com/herd-euthanises-elephant-limpopo-after-fatal-attack-on-senior-carer/",
            "content": "IOL\n\nTHE elephant involved in a fatal incident with a senior carer at the Hoedspruit Elephant Rehabilitation and Development Trust (HERD) has been euthanised, following a failed attempt to relocate her where she showed aggression to other staff.\n\nHERD senior carer, Israel Shambira, was fatally gored by the 19-year-old female elephant named Limpopo earlier this month.\n\nIn the days following the incident, our dedicated carers remained in a state of heightened stress and concern, particularly regarding the safety of being near Limpopo. After extensive consultation among our senior carers, HERD Elephant Manager Tigere Matipedza, and founder of HERD, Adine Roode, with additional guidance from elephant behaviour expert Brett Mitchell, HERD resolved to move Limpopo along with six of her companions to a secure 35ha enclosure at the Hoedspruit Endangered Species Centre (HESC), located approximately ten kilometres away. The plan was to house the group at HESC under a temporary holding permit while a suitable long-term rewilding site could be identified. The remaining nine elephants were to remain at HERD, the organisation said.\n\n19-year-old female elephant, Limpopo. Image: Hoedspruit Elephant Rehabilitation and Development (HERD)\n\nThe available enclosure allowed for the carers to manage Limpopo and the other elephants under a protected contact type of management.\n\nThis decision was made on ethical and humane grounds to ensure the safety of HERD personnel and the responsible management of the elephants. The selection of elephants to be relocated was based on the best available data and the elephant social bonds.\n\nOn September 19, as the selected elephants started their walk from the HERD boma, within a few hundred metres, the elephants from both groups began vocalising, becoming very excitable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/30150311/israel-shambira.png",
            "description": "<p>IOL THE elephant involved in a fatal incident with a senior carer at the Hoedspruit Elephant Rehabilitation and Development Trust (HERD) has been euthanised, following a failed attempt to relocate her where she showed aggression to other staff. HERD senior carer, Israel Shambira, was fatally gored by the 19-year-old female elephant named Limpopo earlier this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/herd-euthanises-elephant-limpopo-after-fatal-attack-on-senior-carer/\">HERD euthanises elephant Limpopo after fatal attack on senior carer</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "02 Oct 2025"
        },
        {
            "title": "Zimbabwe’s gold coins top $4,000 for first time on Bullion rally",
            "url": "https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/21142401/gold-coins.webp",
            "description": "<p>Bloomberg Zimbabwe’s gold coins topped the $4,000 mark for the first time, lifted by a global rally in the metal that’s up 45% this year. The 22-carat “Mosi-Oa-Tunya” gold coins — named after Victoria Falls, a popular tourist destination, and introduced in 2022 to counter a rapid depreciation of the now-defunct local dollar — were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-gold-coins-top-4000-for-first-time-on-bullion-rally/\">Zimbabwe’s gold coins top $4,000 for first time on Bullion rally</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "02 Oct 2025"
        }
    ]
}