{
    "news": [
        {
            "title": "Opposition abandoned Sikhala during jail time – Hwende",
            "url": "https://www.newzimbabwe.com/opposition-abandoned-sikhala-during-jail-time-hwende/",
            "content": "By Staff Reporter\n\nCitizens Coalition for Change (CCC) Kuwadzana East MP Charlton Hwende has made a startling admission that his party abandoned former St Marys MP Job Sikhala when he was in prison.\n\nSikhala was arrested in June 2022 and spent 595 days in Chikurubi Maximum Prison, accused of inciting public violence following clashes that broke out in Nyatsime during the funeral of Citizens Coalition for Change (CCC) activist Moreblessing Ali, who was murdered.\n\nAli was killed by Zanu PF activist Pius Jamba Mukandi, who was sentenced to 30 years in jail after mutilating Alis body and dumping her remains in a disused well in rural Nyatsime.\n\nWhile Sikhala was in prison, reports emerged that he had been deserted by the opposition.\n\nThe CCC refuted claims of neglecting Sikhala, with the then party deputy spokesperson Gift Ostalos Siziba dismissing the allegations and insisting that Sikhala was not neglected and that his family was being taken care of.\n\nThere was also speculation that Sikhala and his former party leader Nelson Chamisa had fallen out, but Chamisa recently officiated at Sikhalas book launch in Harare, seemingly dispelling rumours of a rift between the two.\n\nHowever, speaking at the second launch of Sikhalas book, Footprints in the Chains  The life Story of Job Sikhala, in Bulawayo recently, Hwende said he attended the event to apologise to Sikhala for the lack of support he received during his imprisonment.\n\nI came here by bus to apologise. We owe it to Job Sikhala. I was the secretary general of the last united CCC and we betrayed him. We didnt offer the solidarity that was expected by our ordinary members. And today I stand here to apologise, he said.\n\nChalton Hwende\n\nHwende also stated that Sikhalas prolonged stay in prison was due to the democratic movement not pushing hard enough for his release.\n\nIf the united democratic movement had offered the same solidarity that was expected by our ordinary members, this man would not have stayed in prison for over 500 days, Hwende said, to applause from the audience, including Sikhala himself and Bulawayo Mayor David Coltart, among others.\n\nHwende, who appears to be warming up to rejoining his former party boss, Nelson Chamisa, in the political project Chamisa is building, has been engaging in spats with staunch Chamisa supporters on X, who are vowing that Hwende should not be allowed anywhere near Chamisa and the new democratic project he is developing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Staff Reporter Citizens Coalition for Change (CCC) Kuwadzana East MP Charlton Hwende has made a startling admission that his party abandoned former St Mary’s MP Job Sikhala when he was in prison. Sikhala was arrested in June 2022 and spent 595 days in Chikurubi Maximum Prison, accused of inciting public violence following clashes that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/opposition-abandoned-sikhala-during-jail-time-hwende/\">Opposition abandoned Sikhala during jail time – Hwende</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "08 Jul 2025"
        },
        {
            "title": "Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures",
            "url": "https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/",
            "content": "By Business Report\n\nAn uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities.\n\nHippo Valley, Tongaat Huletts Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this monthalthough the gross profit for the year to end March rose 2% to$66.87m.\n\nAnother Zimbabwean consumer company, Star Africa Corporation that also trades in sugar, however, raised revenues by 22% over the same period.\n\nNonetheless, analysts at IH Securities on Friday said in the securities and advisory firms latest research note on Zimbabwes consumer sector that they anticipate an uplift to volumes for consumer-facing companies this year owing to a likely recovery in consumer spend.\n\nHowever, this was against the backdrop of general cost structures continuing to be on the rise corresponding to a volatile policy environment and the crystallization of costs in United States dollars.\n\nOn the demand side, private consumption growth, which had slowed down from 4.8% in 2023 to 2.5% in 2024, is expected to have a rosier year with household spending rebounding by 6.6% in 2025, said the report.\n\nAfter an improved rainy season and prices for minerals such as gold firming up, Zimbabwean consumer firms are well placed for stronger consumer spending.\n\nCompanies expected to benefit from this include beer and soft drinks manufacturer, Delta Corporation, which has cited stiffer competition in some beverage categories.\n\nZimbabwean consumer discretionary spend however remains subdued, with data from Zimstats recently showing average earnings of 55% of the employed population at less than $100.\n\nMoreover, Zimbabwean companies have to absorb some of the legislation-linked costs of production, such as sugar taxes and fast-food taxes, to support volumes.\n\nIH Securities is thus skewed towards consumer-facing stocks thatexhibit the ability to generate a significant portion of revenue in US dollar, have good management practices, and are also consistent in paying dividends.\n\nCompanies offering defensive staples such as National Foods  in which Tiger Brands has an interest  were displaying volume growth, said the analysts.National Foods maize division recordeda significant volume growth of 58% in May over the comparative nine-month period, largely attributable to the market dynamics.\n\nDairy company, Dairibord, saw consolidated volume growth of 14% for itsfirst quarter ended 31 March 2025.\n\nOn the retail front, the past two years have been challenging for formal operators on account of several issues. As per leading retailers, a key impediment to viability has been S.I 81A of 2024, an exchange control act that mandated the selling of goods and services at the official exchange rate, noted the report.\n\nIt further though stated that Zimbabwesoperating environment for companiesremained challenging overall, citing key issues such as elevated production costs as well as sporadic operating liquidity squeezes in light of the tightening of monetary conditions.\n\nIt mentioned emerging cost pressures including the governments recent increase of 19.1% to the diesel levy as further worsening costs for companies.\n\nHeadwinds in Zimbabwe had already affected Hippo Valley, which has had to rightsize its workforce with 1 000 workers expected to be let go by August.\n\nOK Zimbabwe, another prominent retailer battling headwinds, is now undertaking a $30m rights issue to stabilize the company. The retailer has also announced further closures of stores, pointing to a 2025 year that remains volatile and fragile, but with a possibility of better performances by consumer companies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>By Business Report An uplift in volumes has been projected for Zimbabwean consumer companies despite rising cost structures, a volatile policy and monetary environment as well as higher taxation, say analysts at IH Securities. Hippo Valley, Tongaat Hulett’s Zimbabwe-listed unit, reported a 44% downturn in revenues to $191.59 million this month although the gross profit for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-consumer-sector-poised-for-improvement-amid-rising-costs-tax-pressures/\">Zimbabwean consumer sector poised for improvement amid rising costs, tax pressures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "08 Jul 2025"
        },
        {
            "title": "Railroad accidents surge, ten hit by trains in six months",
            "url": "https://www.newzimbabwe.com/railroad-accidents-surge-ten-hit-by-trains-in-six-months/",
            "content": "By Staff Reporter\n\nTEN people were hit by trains in the first half of 2025, resulting in four deaths and six injuries, the National Railways of Zimbabwe (NRZ) has revealed.\n\nAccording to NRZ, some of these accidents are caused by pedestrians walking or exercising on railway tracks, motorists and pedestrians ignoring safety regulations at level crossings, and distractions such as mobile phones or headphones near railway lines.\n\nIn a statement Monday, NRZ spokesperson Andrew Kunambura raised concerns over the increase in train accidents, with this years figures already surpassing last years totals and urged motorists and pedestrians to exercise extreme caution on railway tracks.\n\nIn the first half of the year, 13 level crossing accidents were recorded, resulting in 13 injuries, while 10 people were hit by trains walking on tracks or close to the railway line, leading to four deaths and six injuries.\n\nThe whole of last year, 13 level crossing accidents were recorded resulting in one death and 26 injuries while five people were killed and eight injured after being hit by trains.\n\nIf the trend of accidents recorded so far this year continues, it means last years figures would be significantly surpassed, Kunambura said.\n\nKunambura also encouraged parents and schools to teach children about the dangers of playing near railway tracks.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/20022554/Railway-Line.png",
            "description": "<p>By Staff Reporter TEN people were hit by trains in the first half of 2025, resulting in four deaths and six injuries, the National Railways of Zimbabwe (NRZ) has revealed. According to NRZ, some of these accidents are caused by pedestrians walking or exercising on railway tracks, motorists and pedestrians ignoring safety regulations at level</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/railroad-accidents-surge-ten-hit-by-trains-in-six-months/\">Railroad accidents surge, ten hit by trains in six months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "08 Jul 2025"
        },
        {
            "title": "Mai TT slapped with US$100,000 defamation lawsuit",
            "url": "https://www.newzimbabwe.com/mai-tt-slapped-with-us100000-defamation-lawsuit/",
            "content": "By Staff Reporter\n\nCOMEDIENNE Mai TT is facing a US$100,000 defamation lawsuit from businesswoman Shingirayi Ziwange Jere, wife of Murehwa West legislator and CAPS United owner Farai Jere.\n\nThe lawsuit follows Facebook posts in which Mai TT accused Jere of threatening her, sending people to assault her, and manipulating the justice system.\n\nJere represented by lawyer Admire Rubaya of Rubaya and Chatambudza Legal Practitioners, said the statements published on June 9 were unfounded and fabricated and depicted the businesswoman as a criminal queenpin.\n\nShingirayi Ziwange Jere\n\nIn this digital epoch where all and sundry have widespread access to the internet, it is our clients considered view that the statements that you published on your FACEBOOK page are defamatory and were understood by a reasonable reader, follower or Facebook user to carry one or more of the following meanings:\n\nThat our client acts with impunity in that she is a maliciously dangerous person who malevolently hires criminals to commit assault and torture ordinary citizens and non-entities like you.\n\nThat our client, is a criminal queenpin conducting criminal activities of conducting unlawful surveillance on your property without your consent and/or permission and is consistently threatening you with death and harm.\n\nThat our client is a person who manipulates the justice system in Zimbabwe which has led to you losing a case against another socialite Patricia Jack whom you allegedly caused her arrest for alleged uploading your daughters nude pictures yet our client has no connection whatsoever to justice system in Zimbabwe and has no capacity whatsoever to influence any out comes regards cases in Zimbabwe, reads the letter.\n\nJere is also lodging a criminal complaint against Mai TT under Zimbabwes Cyber and Data Protection Act for cyberbullying, harassment, and spreading false information.\n\nThe overall tenor of your ill-founded social media rants is that you are sadfishing at the expense of our client and she will not take this lying low.\n\nIn this vein, please note that our client is in the process of lodging a criminal complaint against you. It is quite ironic and amusing how you must obviously be aware that your actions are clearly criminal, given your history of lodging similar complaints against others. Therefore, this may literally be a charming dose of your own medicine.\n\nWe urge you to consider Section 164B, 164C of the Criminal law Codification and Reform Act [Chapter 9:23] as amended by the Cyber and Data Protection Act [Chapter 12:07.\n\nThese two offences creating provisions relate to cyber-bullying, harassment and transmission of false data messages intending to cause harm, which include economic harm, reads the letter.\n\nFurthermore, Jeres legal team has demanded a full, unconditional and unreserved withdrawal from Mai TT within twelve hours, warning that failure to comply will result in a formal summons for US$100,000 in damages.\n\nIn light of the above, our strict instructions are to demand, as we hereby do, the publication of a full, unconditional and unreserved withdrawal of that defamatory statement, pictures and the related imputations together with an expression of regret on the same within twelve hours of receiving this letter as well as an instruction to your personnel in charge of the content of your Facebook page and/ or other social media pages or handles to delete the posts and comments in question.\n\nIn the event that you fail to retract the defamatory statements as demanded our client shall proceed to issue Summons and claim damages for defamation in the tune of US$100,000 (One Hundred United States Dollars) without any further notice to you, reads the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/07195804/WhatsApp-Image-2025-07-07-at-20.55.21.jpeg",
            "description": "<p>By Staff Reporter COMEDIENNE  Mai TT is facing a US$100,000 defamation lawsuit from businesswoman Shingirayi Ziwange Jere, wife of Murehwa West legislator and CAPS United owner Farai Jere. The lawsuit follows Facebook posts in which Mai TT accused Jere of threatening her, sending people to assault her, and manipulating the justice system. Jere represented by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mai-tt-slapped-with-us100000-defamation-lawsuit/\">Mai TT slapped with US$100,000 defamation lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "08 Jul 2025"
        },
        {
            "title": "Youth Minister Machakaire demands public apology, retraction from Mahere following social media row",
            "url": "https://www.newzimbabwe.com/youth-minister-machakaire-demands-public-apology-retraction-from-mahere-following-social-media-row/",
            "content": "By Staff Reporter\n\nYOUTH Empowerment Minister Tinoda Machakaire has written tolawyer and opposition politician Fadzayi Mahere, demanding a retraction and public apology within 24 hours over what he describes as defamatory allegations.\n\nThe two have been engaged in a heated exchange on X, after Machakaire echoed President Emmerson Mnangagwas denunciation of zvigananda.\n\nThe term zvigananda is a derogatory label for individuals with ill-got wealth.\n\nMahere respondedto Machakaire,questioninghim over allegations that his company, TinMac Motors, was corruptly awarded tenders under the US$3 billion Command Agriculture scheme due to his association with controversial businesstycoonKudakwasheTagwirei.\n\nShe also raised concerns about a vehicle scandal during Machakaires tenure as Deputy Youth Minister, where 17 cars were purchased for the ministry, yet only seven were delivered and just four were officially registered under the ministry.\n\nFadzayi Mahere\n\nMahere further questioned Machakaire about an alleged multi-million-dollar tax evasion case involving vehicle imports, which was reportedly dropped by the Zimbabwe Anti-Corruption Commission following political interference.\n\nIn a letter seen by NewZimbabwe.com Monday, Machakaire, through his lawyers, demanded that Mahere issue a public apology and retraction in both print and digital media.\n\nWe hereby demand, as we are instructed, that you comply with the following within 24 hours of receipt of this letter:\n\nYou shall issue a sincere, profuse, and unconditional public apology to our client, acknowledging the harm caused by your nefarious allegations. The apology must be both in print and digital media.\n\nFor the avoidance of doubt, you shall cause an apology to be published in one of the most widely circulating newspapers in this country and post the same apology on your X handle, @advocatemahere.\n\nYou shall unconditionally retract the posts you made on your X handle, regarding Honourable Machakaire, alleging he is corrupt, dishonest, a liar, and misuses public funds to acquire luxury vehicles, the letter reads.\n\nMeanwhile, Mahere acknowledged receipt of the letter but questionedwhether Machakaire was aware that the Access to Information and Protection of Privacy Act (AIPPA), which he cited in his letter, was repealed five years ago.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/14011139/Machakaire-1.jpg",
            "description": "<p>By Staff Reporter YOUTH Empowerment Minister Tinoda Machakaire has written to lawyer and opposition politician Fadzayi Mahere, demanding a retraction and public apology within 24 hours over what he describes as “defamatory allegations”. The two have been engaged in a heated exchange on X, after Machakaire echoed President Emmerson Mnangagwa’s denunciation of “zvigananda.” The term “zvigananda”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/youth-minister-machakaire-demands-public-apology-retraction-from-mahere-following-social-media-row/\">Youth Minister Machakaire demands public apology, retraction from Mahere following social media row</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "08 Jul 2025"
        }
    ]
}