{
    "news": [
        {
            "title": "Bed bugs appear resistant to insecticides, as fears are raised outbreak will spread to other areas",
            "url": "https://www.newzimbabwe.com/bed-bugs-appear-resistant-to-insecticides-as-fears-are-raised-outbreak-will-spread-to-other-areas/",
            "content": "By Anna Chibamu\n\nHARARE City Council is battling to get rid of bed bugs (tsikidzi) in Mbare high-density suburb following an outbreak which was reported this month.\n\nFumigation of the bed bugs has proved difficultas the parasitic insects appear to have developed a resistance to the chemicals used, the City of Harare health officialshave noted.\n\nIn an interview with NewZimbabwe.com, Monday, Harare City Epidemiologist and Disease Control Officer, Michael Vhere, said getting rid of the bed bugs is difficult because the initial chemical used to control the bug did not work.\n\nThe insecticide we used to control the bed bugs faced some resistance, and we immediately switched to another one.\n\nResults on the new drug effectiveness are expected today (Tuesday), said Vhere.\n\nVhere added that the other challenge the council was facing was residents failure to cooperate with the Harare City health officials.\n\nWe have now reached 64% in terms of our spraying target, but we should have completed fumigation of the 5700 housing units if people had cooperated.\n\nThe main challenge is that people are not taking heed of our call to avail themselves when we fumigate homes.\n\nMost of the residents are not available, and they lock their doors, leaving no one attending our spraying teams in the suburb.\n\nInvestigations are underway to rule out any possible disease caused by the bed bug bites.\n\nHe added that investigations done so far show that the bed bug outbreak might have been caused by the sale of second-hand clothes from abroad, exacerbated by poor hygiene.\n\nCouncil will be fumigating public transport vehicles such as kombis and buses starting next week to stop the bugs from spreading to other areas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07180257/mbare-8.jpeg",
            "description": "<p>By Anna Chibamu HARARE City Council is battling to get rid of bed bugs (tsikidzi) in Mbare high-density suburb following an outbreak which was reported this month. Fumigation of the bed bugs has proved difficult as the parasitic insects appear to have developed a resistance to the chemicals used, the City of Harare health officials have noted.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bed-bugs-appear-resistant-to-insecticides-as-fears-are-raised-outbreak-will-spread-to-other-areas/\">Bed bugs appear resistant to insecticides, as fears are raised outbreak will spread to other areas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Govt under pressure as hospitals turn into death traps",
            "url": "https://www.newzimbabwe.com/govt-under-pressure-as-hospitals-turn-into-death-traps/",
            "content": "By Staff Reporter\n\nPRESSURE is mounting on President Emmerson Mnangagwas government to address the deteriorating public health care system, which has become a death trap for many seeking medical attention.\n\nConcerns are being raised over the state of the countrys public health care system, which is characterised by a lack of basic medical supplies and demotivated workers.\n\nThis has forced general citizens to purchase medicines and equipment such as gloves before being attended to by doctors.\n\nOpposition politician Linda Masarira has initiated a petition to the government to address the dire straits that the public hospitals are in.\n\nWe, the citizens of Zimbabwe, urgently call upon His Excellency, President Emmerson Dambudzo Mnangagwa to use his presidential powers to fix Zimbabwes collapsing healthcare system.\n\nMillions of Zimbabweans are suffering and dying because of unaffordable healthcare, chronic shortages of medicines, unethical conduct by health workers, and deteriorating public hospitals. Over 90% of citizens survive through the informal sector and cannot afford private health insurance, reads the petition.\n\nThe lack of medicines and medical provision has left patients in limbo, with the majority failing to afford private hospitals due to the high costs.\n\nActress Tinopona Katsande recently vented frustration on social media, labelling the health system a genocide.\n\nListen, somethings got to give!! I dare say its like some kind of genocide zvirikuitika muma government hospitals edu. Our family members, colleagues and even foes are dying without a second blink, said Katsande.\n\nIn 2017, when President Mnangagwa replaced then-longtime ruler Robert Mugabe, he promised to revamp the health sector, but it still has deteriorated.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on.jpg",
            "description": "<p>By Staff Reporter PRESSURE is mounting on President Emmerson Mnangagwa’s government to address the deteriorating public health care system, which has become a death trap for many seeking medical attention. Concerns are being raised over the state of the country’s public health care system, which is characterised by a lack of basic medical supplies and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-under-pressure-as-hospitals-turn-into-death-traps/\">Govt under pressure as hospitals turn into death traps </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Ndebele King’s visit to Coltart shocks, angers government – Bulawayo ordered not to recognise him",
            "url": "https://www.newzimbabwe.com/ndebele-kings-visit-to-coltart-shocks-angers-government-bulawayo-ordered-not-to-recognise-him/",
            "content": "By Leopold Munhende\n\nA MEETING between Ndebele King Bulelani Khumalo, a descendent of late King Lobengula, and Bulawayo Mayor David Coltart hasangered government, with the Local Government ministry describing it as unlawful and wrong.\n\nA letter to Coltart on the matter questioned why he had invited him and described King Bulelani as a charlatan, and criminal.\n\nColtart shared images of their April 21 meeting and described it as productive.\n\nIt was my great honour today to hostInkosiuBulelani Lobengula Khumalo for a courtesy meeting at City Hall, said Coltart on X alongside images of Bulelani and his entourage.\n\nIn a highly productive and fruitful meeting we discussed how our city can honour the proud history of King Mzilikazi and his descendants through recognition of important historical days and the development of culturally and historically significant sites, both in Bulawayo and its environs. We discussed how this will help not only respect culture, tradition and history but also boost Bulawayos tourist potential.\n\nIt was my great honour today to host Inkosi u Bulelani Lobengula Khumalo for a courtesy meeting at@CityofBulawayoCity Hall.\n\nIn a highly productive and fruitful meeting we discussed how our City can honour the proud history of King Mzilikazi and his descendants throughpic.twitter.com/Qnw0x3JXhA\n\n David Coltart (@DavidColtart)April 21, 2025\n\nGovernment does not recognise the Ndebele monarch, who was installed King on September 28, 2018 by traditional leaders and members of the Khumalo family but recognises Ndebele chiefs, most of whom have been enjoying benefits from the state.\n\nDespite contestation over the rightful heir to the Ndebele crown, King Bulelani has widely been accepted as the Ndebele King against another one of King Lobengulas heirs, Peter Zwide Khumalo who also claims the throne.\n\nThe Ministry of Local Government and Public Works has learnt with shock and utter disgust of a meeting you reportedly held in your capacity as the Mayor of City of Bulawayo with a pseudo King Bulelani allegedly at your invitation and bidding, read the letter, doing rounds on social media.\n\nIt has been brought to my attention that this unlawful and wrongful meeting was held in the Bulawayo Mayors Parlour on 21 April 2025 whereat a pseudo character known as Bulelani was addressed as King Bulelani at your own behest.\n\nAs you may be aware, the Government of Zimbabwe has over the years incessantly denounced and dissociated itself from a self-proclaimed King Bulelani who illegally claims to be the legitimate heir to the now defunct throne of King Lobengula.\n\nThe Ministry would like to advise you, as the Mayor the City of Bulawayo and any other functionary of City of Bulawayo to desist from entertaining this charlatan self-styled King Bulelani as such behaviour is not only criminal but has the negative effect of misleading the general public.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/29061714/coltart-bulelani.jpeg",
            "description": "<p>By Leopold Munhende A MEETING between Ndebele King Bulelani Khumalo, a descendent of late King Lobengula, and Bulawayo Mayor David Coltart has angered government, with the Local Government ministry describing it as unlawful and wrong. A letter to Coltart on the matter questioned why he had invited him and described King Bulelani as a ‘charlatan,’ and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ndebele-kings-visit-to-coltart-shocks-angers-government-bulawayo-ordered-not-to-recognise-him/\">Ndebele King’s visit to Coltart shocks, angers government – Bulawayo ordered not to recognise him</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Business grinds to a halt at Chirundu Border Post as Zambians, Zimbabweans square off",
            "url": "https://www.newzimbabwe.com/business-grinds-to-a-halt-at-chirundu-border-post-as-zambians-zimbabweans-square-off/",
            "content": "By Staff Reporter\n\nBusiness came to a halt at Chirundu Border Post on Monday following counter-protests by Zambian and Zimbabwean nationals over alleged unfair treatment on either side.\n\nThe potentially explosive situation resulted in hours of a stand-off that saw Zambian nationals protesting and blocking Zimbabweans from entering the neighbouring country.\n\nAlthough efforts to get comments from Immigration officials were futile, media reports say in recent weeks, Zambian authorities have been arresting Zimbabweans crossing the border without permits, while undocumented Zambians have been allowed to enter Zimbabwe freely without facing any consequences.\n\nZimbabwean nationals, who are nabbed for flouting immigration laws, reportedly fork out 24,000 Kwacha (approximately US$800) to secure their freedom.\n\nSources say the rift over the unfair treatment reached fever pitch Monday, as Zimbabweans fought back against what they described as harassment and exploitation at the border.\n\nZambian vendors also reportedly protested after Zimbabwean immigration officers allegedly stopped them from entering the country to sell their wares.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/24071017/chirundu-boarder-post.jpg",
            "description": "<p>By Staff Reporter Business came to a halt at Chirundu Border Post on Monday following counter-protests by Zambian and Zimbabwean nationals over alleged unfair treatment on either side. The potentially explosive situation resulted in hours of a stand-off that saw Zambian nationals protesting and blocking Zimbabweans from entering the neighbouring country. Although efforts to get</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/business-grinds-to-a-halt-at-chirundu-border-post-as-zambians-zimbabweans-square-off/\">Business grinds to a halt at Chirundu Border Post as Zambians, Zimbabweans square off</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Khayah Cement seeks shareholder approval ahead of ZSE delisting",
            "url": "https://www.newzimbabwe.com/khayah-cement-seeks-shareholder-approval-ahead-of-zse-delisting/",
            "content": "By Alois Vinga\n\nTROUBLED cement manufacturer Khaya Cement Limited (KCL) is seeking shareholder approval ahead of plans to delist from the Zimbabwe Stock Exchange (ZSE).\n\nFormerly known as Lafarge before being bought for US$29,7 million in 2022, the new owner Fossilwas hoping to take advantage of strong cement demand from Zimbabwes construction sector.\n\nTwo years after buying the countrys second biggest cement producer, KCL is now deep in crisis and going into voluntary business rescue.\n\nFossil bought the company from Holcim, as part of the French companys global selloff. The entity is embroiled in a series of old debts, plant breakdowns, management inefficiency, and the impact of US sanctions has left the company on the brink.\n\nIn a circular to shareholders issued this week, KCL now seeks shareholders approval as part of the rescue efforts to resuscitate the company.\n\nThe Corporate Rescue Practitioner is proposing terminating the companys listing from the ZSE. The decision comes after the Board of Directors voluntarily placed the Company under corporate rescue on the 24th of December 2024, in accordance with the provisions of the Insolvency Act [Chapter 6:07].\n\nTo this end, Mr. Bulisa Mbano of Grant Thornton (Zimbabwe) was subsequently appointed as the Corporate Rescue Practitioner of the Company. The delisting decision follows careful consideration by the Corporate Rescue Practitioner in consultation with financial advisors and has been determined to be in the best interests of the Company and its stakeholders, says the Circular in part.\n\nThe company said the decision has been taken to facilitate the resuscitation of the company by developing and implementing a rescue plan aimed at restructuring its affairs, business, property, debt, and other liabilities.\n\nThe move is expected to stabilise the company based on the understanding that delisting is a strategic step to ensure long-term recovery, regulatory compliance and allowing the company to focus on critical restructuring tasks without public market scrutiny.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/30170448/khaya.jpeg",
            "description": "<p>By Alois Vinga TROUBLED cement manufacturer Khaya Cement Limited (KCL) is seeking shareholder approval ahead of plans to delist from the Zimbabwe Stock Exchange (ZSE). Formerly known as Lafarge before being bought for US$29,7 million in 2022, the new owner Fossil was hoping to take advantage of strong cement demand from Zimbabwe’s construction sector. Two years</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/khayah-cement-seeks-shareholder-approval-ahead-of-zse-delisting/\">Khayah Cement seeks shareholder approval ahead of ZSE delisting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Likely end in sight for lecturers’ strike – presidential spokesperson says Mnangagwa approved recommendations to resolve impasse",
            "url": "https://www.newzimbabwe.com/likely-end-in-sight-for-lecturers-strike-presidential-spokesperson-says-mnangagwa-approved-recommendations-to-resolve-impasse/",
            "content": "By Leopold Munhende\n\nTHREE days after lecturers gave the government a ten-day ultimatum to increase wages and improve their working conditions, Presidential Spokesperson George Charamba has revealed that an end to the ongoing protests could be in sight.\n\nLecturers announced a strike earlier this month over low wages of as little as US$230 and initiated demonstrations at the University of Zimbabwe (UZ), one of which got a number of them arrested, detained and fined.\n\nPosting on X as Jamwanda, Charamba said President Emmerson Mnangagwa had long approved a proposal to deal with the UZ crisis and blamed unnamed officials for delays.\n\nYou have been heard!!! Government is addressing the welfare of University Lecturers, announced Charamba.\n\nIt turns out the Chancellor, Dr E.D. Mnangagwa, had long approved recommendations which should have put this matter well behind us. Inertia gathered somewhere and the Office of the President and Cabinet (OPC) will cause movement.\n\nCharamba had shared on April 25 that lecturers grievances were genuine.\n\nThey are demanding US$2,250 salaries for junior lecturers as was the case before they were slashed in October 2018.\n\nUZs Association of University Teachers (AUT) legal advisor Munyaradzi Gwisai last week announced the ten-day ultimatum and threatened to ensure lecturers across the countrys 14 state universities also withdrew their labour if grievances were not addressed.\n\nGwisai encouraged lecturers to suspend all their work, including the marking of examinations, until they were assured of a salary hike and improvement of their working conditions.\n\nWe must ensure that not a single examination paper is marked from today onwards. We must ensure that not a single examination board sits from today onwards, said Gwisai.\n\nLecturers, much like most civil servants, are getting some of the lowest wages in Zimbabwe, a fact that has driven some of them either out of higher and tertiary education or to other better-paying countries such as South Africa, Namibia and Botswana.\n\nTheir working conditions have been so bad, some of those working at the Midlands State Universitys (MSU) Zvishavane Campus are reportedlysleeping on their office floors as they cannot afford to pay rent for both their families, most of whom are in Gweru, and then themselves.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24103947/UZ-strike-8-scaled.png",
            "description": "<p>By Leopold Munhende THREE days after lecturers gave the government a ten-day ultimatum to increase wages and improve their working conditions, Presidential Spokesperson George Charamba has revealed that an end to the ongoing protests could be in sight. Lecturers announced a strike earlier this month over low wages of as little as US$230 and initiated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/likely-end-in-sight-for-lecturers-strike-presidential-spokesperson-says-mnangagwa-approved-recommendations-to-resolve-impasse/\">Likely end in sight for lecturers’ strike – presidential spokesperson says Mnangagwa approved recommendations to resolve impasse </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Dallas, USA",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-dallas-usa/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome to Dallas, Mr. Madzima. The Zim Diaspora Property Showcase for the United States and Canada has just ended. How do you rate the attendance and buy-infrom the diaspora here in the United States?\n\nVM: As a presenter and panelist at the showcase, I was impressed and pleasantly surprised by the attendance and buy-in from the diaspora market here in the United States of America. There is a hunger for this one-on-one interface with Zimbabwean businesses, specifically in the property sector, to discuss how best the Zimbabweans living in the diaspora can invest in Zimbabwe.\n\nIt may be limiting to just say it was Zimbabweans who attended, there were a few Americans who also attended to understand the property investment processes in Zimbabwe\n\nSome attendees at the conference were from as far as Washington DC, New York and the United Kingdom, which was a bit surprising because it means that the attendees from the United Kingdom flew over 10 hours to attend the event.\n\nReporter:What were your key takeaways from the event?\n\nVM: The first thing is that the market in the United States of America is hungry to invest at home, buy properties and start a general investment portfolio in Zimbabwe.\n\nThe unsaid reality is that the Zimbabwean community living in the United States is too far from home to consistently visit Zimbabwe, as the diaspora market in England, Europe, and Africa enjoys. The distance and cost of travel are significant.\n\nThe market, therefore, heavily relies on social media feedback for investment. Negative experiences by other diasporas have a significant impact on the investment mentality of all. Correctly so, as protective instincts are at the core of human existence.\n\nThe only issue is that some of these experiences contain half-truths, do not delve into the participation by the diaspora transacting party in the negligence through a failure to employ professionals in Zimbabwe to assist with any due diligence process before transacting.\n\nThis positive is what is mainly lacking from an information uptake by the community that I personally managed to interact with. Long and short, the hunger to invest and transfer ideas to Zimbabwe is there and ripe for harvesting.\n\nReporter: What do you think were the benefits for the diaspora community in the United States of America from the property showcase?\n\nVM: The attendees benefited from real-time, practical presentations from an esteemed panel that included Lawrence Nyazema the Group Chief Executive Officer for CBZ Holdings, Tendai Muzadzi General Manager at Datvest Asset Management, Patience Patongamwoyo the Managing Director for Seeff Zimbabwe, and Broadhaven Chief Executive Officer Munyaradzi Majoni whose presentations were eye-opening, informative and invaluable, even for some co-presenters like me who travelled to the showcase from Zimbabwe\n\nReporter: I thought your presentation was equally good!\n\nVM: Thank you.\n\nWhat was more key and beneficial to the attendee, in my view, was the product offering from the exhibitors. There were top developers from all over Zimbabwe, Borrowdale Valley Estate, West Prop, Velda Estates, Tapsington Estates in Marondera, Fairview Properties, CBZ Northgate Estates, and Kings City in Bulawayo.\n\nYour construction companies were also represented by Masimba Holdings and Broadhaven Construction to address the questions on construction issues. Top tier estate agencies including Seeff, Home Pros, Fine and Country and Remax.\n\nEven the public services commission was represented and offering asset management solutions.\n\nThis allowed the attendees to not only enjoy a full bouquet of services, a one-stop shop in essence, but face-to-face interactions with exhibitors representing all areas of real estate investment.\n\nOther areas of diaspora concern were also covered by various companies, including Nyaradzo and ZAMUSA.\n\nReporter: What do you think were the shortcomings of the event?\n\nVM: I honestly think that the organisers collectively underestimated the extent of the interest and geographical distances between different states in the USA. The showcase barely scratched the surface of the opportunities available for the diaspora market and Zimbabwean businesses in the real estate sector. If the showcase was to be hosted in different strategic states with varying concentrations of the Zimbabwe diaspora and Canada separately, the initiative may assist more people.\n\nReporter: Thank you, Mr. Madzima, we have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/28071749/vengai-dallas-e1745821166103.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome to Dallas, Mr. Madzima. The Zim</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-zim-diaspora-property-showcase-in-dallas-usa/\">Legal Discussions with Vengai Madzima: Zim Diaspora Property Showcase in Dallas, USA   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "City of Harare says bed bugs infestation confined to Mbare, investigating other reported areas",
            "url": "https://www.newzimbabwe.com/city-of-harare-says-bed-bugs-infestation-confined-to-mbare-investigating-other-reported-areas/",
            "content": "By Staff Reporter\n\nCITY of Harare (CoH) has announced that recent reports of bed bugs (tsikidzi) infestations spreading to suburbs such as Mabvuku, Glen View, and Budiriro are pending investigations, confirming that the problem is currently confined to Mbare.\n\nNewZimbabwe.com last visited Mbare on 7 April when the CoH and other agencies provided fumigation chemicals to the residents of Mbare to spray in a bid to contain the outbreak.\n\nIn a statement, the CoH said it deployed a team to investigate claims circulating on social media that bed bugs have spread to various suburbs in Harare.\n\nFollowing the bed bugs infestation at Mbare Flats recently, the City Council has activated its Incident Management System to effectively respond to the bed bugs.\n\nThis includes the appointment of a team to lead the fight against the bed bugs. So far, the infestation is confined to Mbare although our teams have been dispatched to assess other areas reported on social media to have bed bugs.\n\nAn Incident Manager has been appointed and an Incident Action Plan developed. The Operations Section is being led by the Environmental Health Manager Mr Manyara reads the statement.\n\nThe local authority said it is open to collaborations to fight the blood-sucking insects.\n\nSo far, CoH has reported that over 60% of targeted rooms have already been fumigated.\n\nThe bed-bug: There are no known human diseases that are caused by the bed bugs, however they can be a constant nuisance to communities. Its difficult but not impossible to control them. They have a life cycle which includes eggs which are not susceptible to chemicals used thus several fumigation rounds will be conducted to ensure there is adequate control as the eggs subsequently hatch.\n\nCurrent Control Efforts; Integrated Pest Management in Mbare flats [spraying and mass education of the affected community members and their settings]. The Harare city council started round 1 and of the planned 3 rounds of fumigation on 7 April 2025 in Mbare Flats and 64% of 5,450 rooms targeted have been fumigated.\n\nA call has been made to partners and stakeholders to get in touch with the city health department to facilitate mobilisation and collation of response resources.\n\nSustainability: Council is in the process of urgently procuring the services of private fumigation companies to quickly get on the ground and sustain operations, reads the statement\n\nThe council has provided residents with preventive measures to help control and prevent future infestations.\n\nCouncil has been disseminating key messages for bed bugs prevention and control. These tips included urging residents to maintain cleanliness, reduce clutter in rooms and expose household items that can harbour bed bugs to the sunlight regularly for whole afternoon.\n\nRegularly clean/vacuum floors, bed frames, and surrounding areas frequently, especially in cracks and crevices. Apply a recommended pesticide when there is evidence of infestation.\n\nProper laundry practices; wash and dry all bed linens, including sheets, pillowcases, blankets, and mattress protectors, in hot water (at least 50C) and dry them.\n\nRegularly change and wash bedding to prevent bed bug infestations. Avoid or treat second-hand items. Avoid second-hand clothing or fumigate them before use to prevent introducing bed bugs into your living space.\n\nCommunity engagement and cooperation; Participate in fumigation efforts organised by the CoH and are community led; collaborate fumigation teams to ensure comprehensive coverage and prevent the spread of bed bugs between units. Ensure all rooms are open for fumigation teams to access rooms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/07052122/bedbugs-what-to-know-2500x1300-1.jpg",
            "description": "<p>By Staff Reporter CITY of Harare (CoH) has announced that recent reports of bed bugs (tsikidzi) infestations spreading to suburbs such as Mabvuku, Glen View, and Budiriro are pending investigations, confirming that the problem is currently “confined to Mbare.” NewZimbabwe.com last visited Mbare on 7 April when the CoH and other agencies provided fumigation chemicals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-says-bed-bugs-infestation-confined-to-mbare-investigating-other-reported-areas/\">City of Harare says bed bugs infestation confined to Mbare, investigating other reported areas </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Money transfer agency teller in US$4,700 and ZAR600 theft",
            "url": "https://www.newzimbabwe.com/money-transfer-agency-teller-in-us4700-and-zar600-theft/",
            "content": "By Staff Reporter\n\nA TELLER employed by a reputable money transfer agency has been dragged to court for stealing US$4, 705 and ZAR600 from her employer.\n\nAccused person Christwish Machamacha (47), a teller employed by Zimsend trading as Hello Paisa, appeared at Chipinge Magistrates Court for theft or trust property.\n\nShe was sentenced to 24 months imprisonment of which nine months were suspended on condition of good behaviour and full restitution of the stolen cash. The remainder was commuted to 526 hours of community service.\n\nCircumstances were that between March 13 and April 15 this year, Machamacha was stationed at a Zimsend outlet at Gonye and Sons Supermarket in Chipinge. Her role as a teller involved receiving money from the company and disbursing it to local clients, who would have received international remittances.\n\nDuring that period, she was entrusted with a total of US$4,705 and ZAR600, intended strictly for disbursement to recipients. However, instead of processing payments to beneficiaries, Machamacha unlawfully converted the money to her personal use.\n\nOn April 15, 2025, the company carried out an internal audit, which revealed that the money she had been entrusted with was missing.\n\nInvestigations discovered that the offender had sent the funds to various recipients via Ecocash, in apparent personal dealings, including attempts to secure online loans an activity completely outside the scope of her responsibilities.\n\nRealising that the audit had exposed her shenanigans, Machamacha contacted an employee of Mukuru Chipinge, seeking help to cover the shortfall. She was given US$1,400 in cash, which she attempted to use to repay a portion of the stolen money. Despite this, a total of US$3,305 and ZAR600 remained unrecovered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09060426/chipinge-magistrates-1.jpg",
            "description": "<p>By Staff Reporter  A TELLER employed by a reputable money transfer agency has been dragged to court for stealing US$4, 705 and ZAR600 from her employer. Accused person Christwish Machamacha (47), a teller employed by Zimsend trading as Hello Paisa, appeared at Chipinge Magistrates Court for theft or trust property. She was sentenced to 24</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/money-transfer-agency-teller-in-us4700-and-zar600-theft/\">Money transfer agency teller in US$4,700 and ZAR600 theft </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        },
        {
            "title": "Namibia lifts 2025 Barthes Rugby Trophy as Junior Sables fall to Kenya",
            "url": "https://www.newzimbabwe.com/namibia-lifts-2025-barthes-rugby-trophy-as-junior-sables-fall-to-kenya/",
            "content": "By Sports Reporter\n\nNAMIBIA was crowned the 2025 Barthes Rugby Trophy champions after beating Tunisia 81-7 at Old Hararians Sunday.\n\nThe Welwitchias ended their six-year Barthes Trophy drought since 2018 when they defended the inaugural championship which they won in 2017.\n\nNamibia has matched last years champions Kenya to be the only two nations to have won the trophy thrice in history.\n\nWith an unbeaten record throughout the campaign, Namibia opened their campaign with a convincing 22-41 win against hosts Zimbabwe, before beating Kenya 32-22 last Wednesday.\n\nMeanwhile, despite the home advantage, Zimbabwe mens Under 20 on the other end failed to beat rivals Kenya in their bid for a decent finish.\n\nThe Junior Sables lost 20-21in front of a huge home crowd at Old Hararians Sunday afternoon, hence finishing on third position while Kenya settled for second.\n\nThe Shaun De Souza-led side performed below expectations during the just-ended campaign, only managing a single victory against tournament underdogs Tunisia, thrashing them 78-21 last Wednesday.\n\n2025 Barthes Trophy Final Standings\n\n1. Namibia\n\n2. Kenya\n\n3. Zimbabwe\n\n4. Tunisia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27214737/FB_IMG_1745785668171.jpg",
            "description": "<p>By Sports Reporter NAMIBIA was crowned the 2025 Barthes Rugby Trophy champions after beating Tunisia 81-7 at Old Hararians Sunday. The Welwitchias ended their six-year Barthes Trophy drought since 2018 when they defended the inaugural championship which they won in 2017. Namibia has matched last year’s champions Kenya to be the only two nations to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibia-lifts-2025-barthes-rugby-trophy-as-junior-sables-fall-to-kenya/\">Namibia lifts 2025 Barthes Rugby Trophy as Junior Sables fall to Kenya</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "29 Apr 2025"
        }
    ]
}