{
    "news": [
        {
            "title": "33 million women grow food on plots in sub-Saharan Africa. Greener farming can boost their earnings – study",
            "url": "https://www.newzimbabwe.com/33-million-women-grow-food-on-plots-in-sub-saharan-africa-greener-farming-can-boost-their-earnings-study/",
            "content": "Lesley Hope| The Conversation\n\nThere are33 million smallholder farmersin sub-Saharan Africa, making up 80% of the total farmer population. These farmers cultivate small plots of land of less than two hectares and dont make much money, as they generally sell their produce in local markets. They usually lack the funds needed to process their crops into a product that could sell for a higher price, and they struggle to get into supply chains where they could sell for higher prices. Agricultural economist Lesley Hopehas researched what is neededfor women smallholder farmers to switch toagroecology environmentally friendly farming that works with nature  and develop thriving businesses at the same time.\n\nWomen make upover halfof sub-Saharan Africas 33 million smallholder farmers. They dont just grow crops  they also work in agroprocessing (making crops into other products) and marketing. Women farmers generally havedeep-rooted knowledgeof local ecosystems, traditional farming and ways to grow and store seeds. However, theycannot easily accessproductive resources such as land, agricultural equipment or finance.\n\nThis is why a set of farming practices that use natural inputs at a lower cost can help women smallholder farmers to build more productive farms. For example, agroecology involves environmentally friendly practices that include:\n\nAgroecology also supports local markets and a shorter chain for food from the farm to the table. In this way it reduces peoples dependency on buying food at prices that are influenced by the global market. It also means that smallholder farmers do not rely on the global market for purchase of fertilisers and pesticides for their production activities.\n\nAnother advantage of using agroecology is that livestock, fruit trees and several different crops can be farmed at the same time. This means farmers do not need to buy nearly as much as they can often grow enough to feed their families. A diverse food systemalso copes betterwith climate change.\n\nAgroecology also offers women the opportunity to create:\n\nAgroecology already falls in line with women farmers practice of backyard farming. It encourages women to use that expertise to feed their families a wider variety of foods and sell the surplus.\n\nAgroecology is practised all over Africa. In east Africa (Uganda, Tanzania)women-led cooperativesgrow organic coffee.\n\nFor example, organic farming practices based on traditional knowledge are common inKenya and other parts of east Africa. In southern Ethiopia, Burkina Faso, Senegal, Ghana and Niger,agroforestryis widely practised.\n\nSmallholder farmers in Zimbabwe and Zambia practiseconservation agriculture, an environmentally friendly farming approach that improves and maintains soil health and productivity by not disturbing or digging the soil, and by sowing a layer of different permanent cover crops.\n\nIn Cameroon, integrated pest management strategies likebiopesticidesand pest-resistant crop varieties are common. Biopesticides are types of pesticides made from natural extracts. They are environmentally friendly and have no negative impact.\n\nIn Senegal, women agroecologists have become influential and able to attract funding to improve their farms. Women inMali and Ghanaproduce bioenergy and seeds fromJatropha curcas, a plant that treats infections and muscle pain.\n\nAgroecology is also practised in South Africa, where women smallholder farmersplant trees with cropsto reduce water pollution.\n\nDespite this, many women smallholder farmers are stillseen as farmers wives, rather than farmers in their own right, and dont get the support they should.\n\nFirst, as this years president of theGroup of 20 most powerful nations, South Africa could use its position to influence policies that support the transition to agroecology. These include investing in agroecological markets, supporting womens businesses, and protecting womens rights through giving them more access to productive resources.\n\nAgroecology is a must in the current era where climate change makes it difficult to grow enough food for everyone. Given that many African women are already involved in agriculture, it makes sense for them to lead the move to agroecology.\n\nThese steps need to be taken:\n\n(1) Women farmers need to be connected to customers. Dedicated agroecological market infrastructure must be set up where women farmers can sell their crops. This can include markets for cooperatives and digital platforms that are designed around women farmers needs.\n\n(2) Once theyre connected to the market, the women farmers must get support to successfully compete with other businesses. Philanthropies and development agencies can support community-based and gender-sensitive processing hubs such as millers, driers and organic packaging. These are critical to support the women farmers to fully transition to agroecology.\n\n(3) Produce needs to becertified as organicwith an agroecological product label. This increases the markets that women smallholder farmers can sell to, and builds consumer trust. Organic certification projects can be set up by the government, philanthropic organisations, development agencies, non-governmental organisation and other groups interested in empowering women smallholder farmers through agroecology.\n\nLesley Hope\n\nLecturer: Department of Agricultural and Resource Economics, School of Agriculture and Technology, University of Energy and Natural Resources\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13161719/Screenshot-2025-08-13-at-17.16.41.png",
            "description": "<p>Lesley Hope | The Conversation There are 33 million smallholder farmers in sub-Saharan Africa, making up 80% of the total farmer population. These farmers cultivate small plots of land of less than two hectares and don’t make much money, as they generally sell their produce in local markets. They usually lack the funds needed to process their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/33-million-women-grow-food-on-plots-in-sub-saharan-africa-greener-farming-can-boost-their-earnings-study/\">33 million women grow food on plots in sub-Saharan Africa. Greener farming can boost their earnings – study</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        },
        {
            "title": "British soldiers using sex workers in Kenya despite ban, inquiry finds",
            "url": "https://www.newzimbabwe.com/british-soldiers-using-sex-workers-in-kenya-despite-ban-inquiry-finds/",
            "content": "An investigation by the British Army has found some soldiers stationed at a controversial base in Kenya continue to use sex workers despite being banned from doing so.\n\nSoldiers at the British Army Training Unit Kenya (Batuk) used sex workers at a low or moderate level, a report said, adding more work was needed to stamp out the practice.\n\nThe investigation covered a period of more than two years, examining conduct at the base dating back to July 2022.\n\nIt was commissioned in October 2024 following an investigation by ITV into the behaviour of soldiers at Batuk, including allegations some army personnel were paying local women for sex.\n\nThe ITV documentary followed previous concerns raised about Batuk after the death in 2012 of a local woman Agnes Wanjiru, allegedly killed by a British soldier stationed at the base.\n\nSince then a string of allegations have been made about the conduct of troops at the training site, which lies near the town of Nanyuki 200km (125 miles) north of Kenyas capital Nairobi.\n\nIn 2022, the UKs Ministry of Defence banned its forces from using sex workers abroad as part of efforts to curb sexual exploitation and abuse across the military.\n\nUK Chief of General Staff Gen Sir Roly Walker said in a statement that the army was committed to stopping sexual exploitation by those in its ranks.\n\nThe findings of the Service Inquiry I commissioned conclude that transactional sex is still happening in Kenya at a low to moderate level. It should not be happening at all, he said.\n\nThere is absolutely no place for sexual exploitation and abuse by people in the British Army. It is at complete odds with what it means to be a British soldier. It preys on the vulnerable and benefits those who seek to profit from abuse and exploitation, he added.\n\nThe service inquiry investigationwas carried out by a panel of four people, including two serving officers, a civil servant and an independent adviser.\n\nIt investigated the behaviour of troops stationed at Batuk and assessed the armys systems to prevent breaches of its regulation JSP 769 which bans soldiers from paying for sex.\n\nThe report details 35 instances in which Batuk soldiers were suspected to have paid for sex, since guidance for soldiers on the rule was published in July 2022. During that period 7,666 British soldiers served at the base.\n\nIt notes that of those, 26 cases happened before training on the new rule was initiated for all army staff in November of that year, with nine reported cases since then. In the majority of cases, the allegation that soldiers had paid for sex was never proven.\n\nIn addition to those detailed in the report, the Foreign Office told the BBC there was a small number  less than five  cases of alleged use of sex workers currently under investigation. The alleged incidents happened after the inquiry was concluded.\n\nThe report said that despite the training given by the Army and the control measures in place, the reality was that transactional sexual activity by UK personnel in Kenya was still happening, and that the level is somewhere between low and moderate.\n\nIt is not out of control, but the best way for the Army to manage the risk is for the Army to assume it may be at the upper end of that scale between low and moderate, the report added.\n\nThe report noted efforts by the Army to stamp out the practice, including regular training and the use of sharkwatch patrols with a non-commissioned officer of the rank of sergeant or above deployed to monitor the conduct of junior personnel when they left the base for nights out.\n\nThe army said it would implement recommendations from the report, including making it easier to dismiss soldiers found to have used sex workers and the implementation of additional training.\n\nThe report follows years of controversy about the conduct of soldiers at Batuk sparked by an investigation by the Sunday Times in 2021 which revealed the alleged involvement of a British soldier in the murder of Ms Wanjiru, a mother of one whose body was found dumped in a septic tank near a hotel where she had been seen with soldiers on the night she vanished.\n\nSeparately in Kenya, MPs have been conducting an inquiry into wider allegations of mistreatment of local people by soldiers at Batuk and have heard claims at public hearings of injuries allegedly sustained through the behaviour of British troops and of soldiers fathering children to Kenyan mothers and then abandoning them when they returned home.\n\nIn June this year a soldier stationed at the base was sent back to the UK after being accused of rape.\n\nThe Service Inquiry behind the latest report said it had spoken to many local Kenyans and found the vast majority of local residents were happy with the presence of the Batuk camp.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13091322/british-army.webp",
            "description": "<p>BBC An investigation by the British Army has found some soldiers stationed at a controversial base in Kenya continue to use sex workers despite being banned from doing so. Soldiers at the British Army Training Unit Kenya (Batuk) used sex workers “at a low or moderate” level, a report said, adding more work was needed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/british-soldiers-using-sex-workers-in-kenya-despite-ban-inquiry-finds/\">British soldiers using sex workers in Kenya despite ban, inquiry finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        },
        {
            "title": "All-in-One iGaming Easy: Choose DSTGAMING Turnkey Platform",
            "url": "https://www.newzimbabwe.com/all-in-one-igaming-easy-choose-dstgaming-turnkey-platform/",
            "content": "An increasing number of operators are pivoting to turnkey casino and sportsbook services  with good reason. These solutions take care of legal, financial, and technical challenges related to creating a casino outfit from scratch. Plus, the software is easy to manage and offers impressive flexibility. Turnkey refers to being available for use. And DSTGAMING is a preferred choice for operators. This blog post explores why turnkey casino and sportsbook solutions, especially DSTGAMING, are gaining traction.\n\nSeven Reasons Why More Operators Prefer Turnkey Platforms\n\nHere are seven reasons whyturnkey casinos and sportsbooksare becoming popular:\n\nLower Upfront Costs\n\nDeveloping a sportsbook or casino from scratch requires a significant capital investment. Operators would channel resources toward certified software development, website design, legal fees, testing, security, and other essential components before going live. As expected, the total cost can run up to several hundred thousand dollars. In contrast, turnkey solutions are ready-to-use and cost-effective alternatives.\n\nChoosingDSTGAMINGturnkey packages reduces the financial burden and stress of starting from scratch. Operators get a ready-made platform with total control over functionality and customization. Most of the groundwork required has already been done, which helps reduce ownership costs significantly.\n\nFaster Market Entry: Launches in Weeks\n\nWhile building a custom platform could take a year or more, turnkey solutions can be up and running in a couple of weeks. Timing plays a vital role in developing a casino or sportsbook. A considerable benefit of a turnkey platform is the speed at which an operator can get into the market.\n\nFor example, DSTGAMING assembles all essential systems  payments, tech, permits, game collections, and operational tools- in weeks. This momentum gives operators a competitive edge, allowing quick entry and the possibility of market domination early in their launch period.\n\nHigher Level of Customisation\n\nUnlike white-label solutions, turnkey solutions provide a much higher level of customization. You can kickstart with a basic setup to test the market and progressively add more features based on user feedback and receptiveness. This flexibility is a significant factor in why turnkey solutions appeal to more operators. It also gives your brand an edge in a crowded niche where users are always seeking fresh and innovative experiences. You can easily shape your platform appearance, add new games, make UI/UX changes, and expand bonus offerings.\n\nRobust Compliance and Security Tools\n\nTurnkey solution providers are equipped with the expertise to provide robust compliance and security features and tools. These tools and features include:\n\nBefore being launched into the markets, these solutions are backed by KYC/AML requirements, licensing, and secure payment solutions. In jurisdictions like Latin America and Europe, you need the necessary licensing to avoid regulatory issues. DSTGAMING offers aids to help navigate these regions. This way, operators focus on building their brand without worrying about legal hurdles. Hence, a smoother and better entry into multiple markets.Offers Long-term ScalabilityThe tech space leaves no room for chance; experts are being intentional about providing solutions. These solutions get absorbed by iGaming operators, especially with products like AI, blockchain, and microgames. That being the case, operators must evolve or risk falling behind. One of the reasons turnkey software continues gaining traction is its capacity for possible adaptation. These solutions support frequent updates, offer scalable APIs, and can take on new features. Your brand can stay ahead of the curve without any costly redevelopment.Mobile Optimisation & App IntegrationTurnkey solution software is designed with mobile devices in view. Hence, compatibility with iOS and Android platforms is prioritized  a responsive and polished UI/UX design. Focusing on mobile usability offers an edge in the competitive industry as more gambling platforms are becoming mobile-friendly.After-service SupportCasino and sportsbook platforms like DSTGAMING dont only provide a ready-made iGaming platform and walk away  they continue to support you post-launch. Support includes 24/7 tech assistance, onboarding guidelines, and maintenance. The aim is to carry these burdens so you can focus more on running your business. Also, there are built-in tools that track players behavior so operators can stay ahead of customers.Is Choosing Turnkey Casino and Sportsbook Platforms the Right Choice for You?Yes, in todays fast-paced world, a turnkey solution is a smart move. While it offers more authority over functionality, branding, and players data, it is also cost-effective and leans towards long-term scalability. That said, when selecting a provider, DSTGAMING should be your top choice. They help you set up with ease, offering exceptional value through the development process.Key TakeawayThe iGaming space is gradually turning towards turnkey solutions for their flexibility, security measures, and compliance. Without a doubt, choosing a turnkey casino and sportsbook solution is a strategic investment. However, the provider you select is equally important. DSTGAMING stands out for obvious reasons, as it is a renowned brand that offers white-label, turnkey, and crypto solutions. Ready to launch into the iGaming market today? ExploreDSTGAMING websiteto know more and start building your next-gen iGaming brand.\n\nBefore being launched into the markets, these solutions are backed by KYC/AML requirements, licensing, and secure payment solutions. In jurisdictions like Latin America and Europe, you need the necessary licensing to avoid regulatory issues. DSTGAMING offers aids to help navigate these regions. This way, operators focus on building their brand without worrying about legal hurdles. Hence, a smoother and better entry into multiple markets.\n\nOffers Long-term Scalability\n\nThe tech space leaves no room for chance; experts are being intentional about providing solutions. These solutions get absorbed by iGaming operators, especially with products like AI, blockchain, and microgames. That being the case, operators must evolve or risk falling behind. One of the reasons turnkey software continues gaining traction is its capacity for possible adaptation. These solutions support frequent updates, offer scalable APIs, and can take on new features. Your brand can stay ahead of the curve without any costly redevelopment.\n\nMobile Optimisation & App Integration\n\nTurnkey solution software is designed with mobile devices in view. Hence, compatibility with iOS and Android platforms is prioritized  a responsive and polished UI/UX design. Focusing on mobile usability offers an edge in the competitive industry as more gambling platforms are becoming mobile-friendly.\n\nAfter-service Support\n\nCasino and sportsbook platforms like DSTGAMING dont only provide a ready-made iGaming platform and walk away  they continue to support you post-launch. Support includes 24/7 tech assistance, onboarding guidelines, and maintenance. The aim is to carry these burdens so you can focus more on running your business. Also, there are built-in tools that track players behavior so operators can stay ahead of customers.\n\nIs Choosing Turnkey Casino and Sportsbook Platforms the Right Choice for You?\n\nYes, in todays fast-paced world, a turnkey solution is a smart move. While it offers more authority over functionality, branding, and players data, it is also cost-effective and leans towards long-term scalability. That said, when selecting a provider, DSTGAMING should be your top choice. They help you set up with ease, offering exceptional value through the development process.\n\nKey Takeaway\n\nThe iGaming space is gradually turning towards turnkey solutions for their flexibility, security measures, and compliance. Without a doubt, choosing a turnkey casino and sportsbook solution is a strategic investment. However, the provider you select is equally important. DSTGAMING stands out for obvious reasons, as it is a renowned brand that offers white-label, turnkey, and crypto solutions. Ready to launch into the iGaming market today? ExploreDSTGAMING websiteto know more and start building your next-gen iGaming brand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13090641/Screenshot-2025-08-13-at-10.04.54.png",
            "description": "<p>An increasing number of operators are pivoting to turnkey casino and sportsbook services – with good reason. These solutions take care of legal, financial, and technical challenges related to creating a casino outfit from scratch. Plus, the software is easy to manage and offers impressive flexibility. Turnkey refers to being available for use. And DSTGAMING</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/all-in-one-igaming-easy-choose-dstgaming-turnkey-platform/\">All-in-One iGaming Easy: Choose DSTGAMING Turnkey Platform</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        },
        {
            "title": "Zimbabwe continues to bid for non-permanent seat on UN Council",
            "url": "https://www.newzimbabwe.com/zimbabwe-continues-to-bid-for-non-permanent-seat-on-un-council/",
            "content": "SABC\n\nZimbabwe has reaffirmed its commitment to international dialogue and co-operation as the country continues to bid for a non-permanent seat on the United Nations (UN) Security Council for the 2027-2028 term.\n\nAs the outgoing Chairperson of Southern African Development Community (SADC), Zimbabwe has been actively engaged in regional peace and security efforts, particularly in the conflict-ridden eastern Democratic Republic of Congo (DRC).\n\nZimbabwean President Emmerson Mnangagwa and his Kenyan Counterpart William Ruto, co-chaired the Joint East African Community-SADC Summit which resolved to merge their peace efforts with those of the African Union in addressing the DRC crisis.\n\nGuided by the spirit and letter of the UNs charter and our inalienable freedom and right to participate, as equals, on the global stage. Let no-one think that they can engage us as masters. We are sovereign and independent people. Zimbabwe has submitted its bid for a non-permanent seat in the UN Security Council for the period 2027 to 2028.\n\nAdditionally, we have reinforced our countrys commitment to global peace and security by becoming a founding member of the international organisation for mediation. We look forward to sharing our experience in preventive diplomacy, peacekeeping, and conflict resolution, towards a more secure and prosperous world. Later this week, Zimbabwe will be handing over the Chairmanship of SADC to the Republic of Madagascar. This follows our successful term.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>SABC Zimbabwe has reaffirmed its commitment to international dialogue and co-operation as the country continues to bid for a non-permanent seat on the United Nations (UN) Security Council for the 2027-2028 term. As the outgoing Chairperson of Southern African Development Community (SADC), Zimbabwe has been actively engaged in regional peace and security efforts, particularly in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-continues-to-bid-for-non-permanent-seat-on-un-council/\">Zimbabwe continues to bid for non-permanent seat on UN Council</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        },
        {
            "title": "South Africa unperturbed by US visa policies affecting Zimbabwe",
            "url": "https://www.newzimbabwe.com/south-africa-unperturbed-by-us-visa-policies-affecting-zimbabwe/",
            "content": "IOL\n\nThe South African government appears unmoved by the recent visa ban imposed by the US embassy in Harare, Zimbabwe, even as US President Donald Trump continues to disrupt global diplomacy with tariff increases and immigration policies seven months into his second term.\n\nThe US has suspended all routine immigrant and non-immigrant visa services to Zimbabwe due to concerns about misuse and overstays. However, the issuance of other visa types remains unaffected.\n\nAlthough South Africa was exempt from new Trump visa restrictions on SADC countries, a new policy has been implemented for Malawi and Zambia.\n\nCitizens of these nations are now required to pay a bond of $5,000 (R88,656) to $15,000 (R265,967) to travel to the United States.\n\nAdditionally, the citizens are required to use one of three airportsBostons Logan International, New Yorks JFK International, or Dulles International near Washington D.C.for both arrival and departure.\n\nWhen asked whether South African citizens should be worried, Department of International Relations and Cooperation (Dirco) spokesperson Chrispin Phiri gave a brief response: We do not provide commentary on other countries visa regimes, and this is our general position, its not specific to the US.\n\nA senior government official, however, downplayed the likelihood of South Africans being affected by the US visa restrictions.\n\nRemember Trump is only in our case because of the International Court of Justice case against Israel and our involvement in BRICS. Nothing more and nothing less, the official said.\n\nSouth Africans visiting the US are mostly professionals who either go for business or a holiday. We seldom have citizens wanting to immigrate to the USwe should have nothing to worry about, he said.\n\nThe US embassy explained that the reasons for the restrictions was because the administration was working to prevent visa overstay and misuse as part of national security.\n\nThe Trump administration is protecting our nation and citizens by upholding the highest standards of national security and public safety through our visa process, the embassy said.\n\nWe are always working to prevent visa overstay and misuse.\n\nIn June, the US imposed travel bans on citizens from 12 countries, with seven of them located in Africa. Additionally, heightened restrictions were applied to seven other nations, three of which are African.\n\nThe US has issued a demand to 36 countries, predominantly in Africa, to enhance their traveler vetting procedures. Failure to comply could result in a ban on their citizens visiting the US.\n\nInternational Relations analyst Rejoice Ngwenya said it was unfortunate that the US had an obsession with immigration issues.\n\nAll democratic countries must encourage international country movements. However it is incumbent upon citizens that they dont abuse regulations. But one thing to acknowledge in terms of implementation of immigration laws globally is not to interfere and dissuade inter country movements of students because knowledge sharing and education is a universal right, Ngwenya said.\n\nInternational Relations expert Dr Noluthando Phungula said Trump continues to shake global diplomacy as he feels threatened, especially by BRICS countries.\n\nAs a head of stateand a representative of the unipolar super power bloc, Trump was threatened especially by BRICS, which South Africa is a part of.\n\nThe BRICS expansion and growth speaks to a clearer call from the Global South towards multilateralism. This inadvertently challenges Western dominance and calls for a reformation of international power structures. This is certainly an uncomfortable reality for Trump.\n\nWhile the formation may not be directly competing with the US, it directly challenges the unipolar global power dynamic, in which the United States is regarded as the lead superpower. The BRICS are a representation of a significant and needed transition towards a multipolar power setting, in which various countries lead global cooperation efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>IOL The South African government appears unmoved by the recent visa ban imposed by the US embassy in Harare, Zimbabwe, even as US President Donald Trump continues to disrupt global diplomacy with tariff increases and immigration policies seven months into his second term. The US has suspended all routine immigrant and non-immigrant visa services to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-unperturbed-by-us-visa-policies-affecting-zimbabwe/\">South Africa unperturbed by US visa policies affecting Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        },
        {
            "title": "The dollar still rules, but US policy is making it less special",
            "url": "https://www.newzimbabwe.com/the-dollar-still-rules-but-us-policy-is-making-it-less-special/",
            "content": "By Saleha Mohsin l Bloomberg\n\nTHE dollars role as the worlds reserve currency is being challenged due to President Donald Trumps push to redesign the global economic order in favor of the US.\n\nTrust in the dollar is faltering, with the US dollar index tumbling more than 10% in the first six months of the year, its worst first-half performance since 1973, and some of Asias richest families cutting exposure to US assets.According to Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council, the US may have to give up some benefits of the strong-dollar regime, including lower interest rates, as the dollar faces more competition in a multicurrency world.President Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.Its a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTrust in the dollar is faltering, with the US dollar index tumbling more than 10% in the first six months of the year, its worst first-half performance since 1973, and some of Asias richest families cutting exposure to US assets.\n\nAccording to Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council, the US may have to give up some benefits of the strong-dollar regime, including lower interest rates, as the dollar faces more competition in a multicurrency world.President Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.Its a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nAccording to Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council, the US may have to give up some benefits of the strong-dollar regime, including lower interest rates, as the dollar faces more competition in a multicurrency world.\n\nPresident Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.Its a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nPresident Donald Trumps push to redesign the global economic order in favor of the US is shaking one of the foundations of its post-World War II supremacy: the dollars undisputed role as the worlds reserve currency.\n\nIts a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.But trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nIts a status that shows the dollar is used in roughly nine out of 10 foreign exchange transactions and about half of all merchandise trade conducted globally, and is making up almost 60% of reserves held by governments around the world. That dominance helps Washington to run gaping budget deficits and US consumers to spend more than they makeall funded by overseas investors eager to snap up assets denominated in greenbacks adorned with the motto In God We Trust.\n\nBut trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?The Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nBut trust in the dollar is faltering. In 2022 the Biden administrations curbs on Russias access to the currency after the invasion of Ukraine spurred a first round of diversification. If the US could freeze out the worlds 11th-largest economy, so deeply entrenched in global oil markets, is anyone safe?\n\nThe Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.Like an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe Great Inflation, and a rapidly deteriorating fiscal trajectory since then, has added to doubts about American economic exceptionalism. And most recently, the haphazard rollout and rollback of Trumps tariff campaign in April sparked a rare weakening in both the dollars value and that of US Treasuries. The US dollar index tumbled more than 10% in the first six months of the year, its worst first-half performance since 1973.\n\nLike an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.Geopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nLike an uncorked genie, the sell America talk is proving hard to bottle up again. Banks and brokers are seeing rising demand for currency products that bypass the dollar, and some of Asias richest families are cutting exposure to US assets, saying Trumps tariffs have made the country much less predictable.\n\nGeopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.Not everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nGeopolitical rivals within BRICSa loose group of large economies led by Brazil, Russia, India, China and South Africaare continuing their long push for a new cross-border payments system. Even long-term allies such as Europe see an opportunity to erode the dominance of the dollar.\n\nNot everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.Secretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nNot everyone is so dour. JPMorgan Chase & Co.s Jamie Dimon said in May that the US remains the most prosperous, innovative nation on the planet and that he doesnt fret over short-term fluctuations in the dollar.\n\nSecretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.Theres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nSecretary of the Treasury Scott Bessent has tried to convince investors that the strong dollar policy remains intact, and his boss has threatened 100% tariffs against anyone who dares challenge it. Yet for all the tough talk, the reality is that the greenbacks greatest relative strength is actually the lack of any single challenger to its standing atop the global monetary order.\n\nTheres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.Chinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTheres talk of a global euro moment in which the European common currency plays a bigger role, but history has shown that the bloc struggles to move in sync, and its institutions are too fragmented to create the markets deep enough to rival those of the US.\n\nChinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.Central banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nChinas central bank governor is talking up his nations currency as an option for those seeking to shift from the dollar, but its hard to imagine how that will be embraced when capital controls still impede the free flow of assets across Chinese capital borders.\n\nCentral banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.Speculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nCentral banks and investors have piled into the ultimate haven assetgoldbut its cumbersome to hold, offers no yield and cant easily be used in trade or financial transactions the way the dollar can.\n\nSpeculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.Other financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nSpeculation for dollar replacements range as far as Bitcoin and other digital assets, though few outside El Salvador (which in 2021 adopted the cryptocurrency as legal tender) are ready to shift toward anything thats not government-backed.\n\nOther financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.With no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nOther financial innovations such as stablecoinsdigital tokens meant to substitute for traditional cashmay entrench rather than dislodge the dollars primacy as they peg their value to the greenback.\n\nWith no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.Indeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nWith no viable alternative to the US dollar as the worlds currency on the horizon, the more likely change is to a multicurrency world. The dollar would still be dominant, but other currencies would play a larger role. Although this may not be as revolutionary as a complete breakdown in the global monetary order that some dollar doomsayers are foreseeing, the resulting currency competition will still have profound effects on the USs hard and soft geopolitical power.\n\nIndeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.The US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nIndeed, no one is really ready for what a feeding frenzy of currency competition will mean in practiceespecially not Americans.\n\nThe US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.Barry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe US would have to give up some of the benefits of the strong-dollar regime, a key one being lower interest rates as fewer overseas investors buy dollar-denominated bonds.\n\nBarry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.US banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nBarry Eichengreen, an economist at the University of California at Berkeley, whos written extensively on the dollar, has calculated that in a scenario where the US withdraws from the global stage, the dollars share of reserves in countries that rely on its security could decline by about 30 percentage points. Long-term US interest rates could increase by as much as 0.8 of a percentage point, he estimates.\n\nUS banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.And though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nUS banks will need to pay more to raise money and charge more for mortgages as a result. Higher home loan rates tend to slow the economy because they leave less income for consumers to spend on vacations, home improvements and the like.\n\nAnd though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.The federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nAnd though a weaker foreign exchange rate may be good for rebalancing the trade deficitby making American exports cheaper and more competitive and deterring spending on costlier importsthats not great for household wealth.\n\nThe federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.The globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe federal government will also feel the pinch. It finances its annual budget gap, a little less than $2 trillion, through Treasuries. In a world where euro- or yen-denominated assets are more strongly vying for investor attention, borrowing costs for the US government would need to rise. In fact, were already noticing signs of that: Thirty-year Treasury yields have more than doubled since the start of 2022 and exceeded 5% at one point in May. That means America will pay more for new borrowing and more to keep rolling over its existing debt too. Annual payments on US government debt by some measures are now larger than what the country spends on national defense.\n\nThe globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.Meanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe globalized dollar has long shielded lawmakers in Washington from having to decide between guns or butteror tax cuts. And even as doubts in the dollar grow as the budget deficit swells, legislators still arent ready to tighten their belts. Elon Musk promised $1 trillion in savings through the so-called Department of Government Efficiency, or DOGE; the cuts so far have saved less than $200 billion.\n\nMeanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.A less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nMeanwhile, a key legislative win for Trump, the One Big Beautiful Bill, will add as much as $3 trillion to the budget deficit over the next decade, according to estimates from the Congressional Budget Office. But in a world where investors continue moving away from the greenback, markets could eventually force difficult trade-offs to cut the deficitmeaning that social safety nets and public research-and-development spending thats long spurred private-sector innovation in areas including Big Tech and Big Pharma will start to have limits imposed on them.\n\nA less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.We dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nA less hegemonic dollar would affect Americas geopolitical prowess. With a weaker currency, overseas military bases would become more expensive to keep up. With less use of the dollar in global transactions, economic sanctions would have less bite. And policing the financial system for malign activities, such as financing terrorist undertakings or laundering money, would be harder because flows outside of dollar-based networks wont be visible to American policymakers.\n\nWe dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.US Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nWe dont appreciate how good we have it, says Josh Lipsky, senior director of the GeoEconomics Center at the Atlantic Council in Washington and a former adviser at the International Monetary Fund. Ownership of the reserved asset means cheaper credit for Americans and the federal government, it means more transparency of US policymakers in the financial system to carry out economic statecraft that aligns with US foreign policy objectives. That is whats at risk.\n\nUS Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.Trumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nUS Treasury secretaries, the stewards of the dollar and American currency policy, have long said that its up to the nation itself to guard the treasure that the reserve asset is. Whether its Bob Rubin, Hank Paulson or Janet Yellen, these leaders have said that a strong economy bolstered by independent institutions and the rule of law will protect the dollars status. Yet the Trump administration has sent mixed signals. Bessent has stuck largely to the script of predecessors, but Stephen Miran, chair of the White Houses Council of Economic Advisers and Trumps latest pick to serve as governor of the Federal Reserve, has referred to the dollars status as a burden.\n\nTrumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.The world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTrumps efforts to shift executive authority into independent agencies like regulators and even the Federal Reserve, his consistent challenges to the courts, and Washingtons disregard for record-high federal debt are adding to the dollars headwinds. Trust is the cornerstone of the worlds choice of the dollar as king, and Trump is chipping away at that credibility. For the first time, the dollars future status may be determined by how other currencies develop, Lipsky says. And those will develop faster if people are looking for themthats the lesson of capitalism.\n\nThe world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.Previous eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nThe world economy is more financialized and knit together than the last time it saw a tectonic shift in global currency power about 80 years ago, when the dollar eclipsed the British pound. Indeed, the dollars status has faced a reckoning before and persevered. President Richard Nixon unilaterally abandoned the gold peg in 1971 and imposed a 10% import tariff after nations including France sought to swap dollars for bullion, threatening the monetary system agreed at Bretton Woods after World War II. The American-made global financial crisis earlier in the 2000s also triggered questions, particularly in China, about whether the US continued to merit its role as cornerstone of the global monetary order.\n\nPrevious eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.Todays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nPrevious eras have had mixed currency use, but typically those were anchored to either gold or silver. Theres never been a period when multiple fiat currencies competed for dominance. This fact makes some people nervous about what lies ahead. A multicurrency era could provoke instability as investors run from one to another in reaction to financial conditions, compounding the challenge for businesses already grappling with how theyll rewire supply chains in an era of rising tariff walls.\n\nTodays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.Mohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\nTodays steward of US currency policy, Bessent, is pushing back against the dollar doubters: Since World War II, the demise of the dollar as a reserve currency has been predicted, he said on Bloomberg TV on July 3. Once again, the skeptic is going to be wrong. And hes right: The US dollar isnt about to disappear from central bank hoards or as a medium for global finance. But it will face more competition in a multipolar world. And that will have unpredictable repercussions both at home and abroad.\n\nMohsin is the senior Washington correspondent for Bloomberg News and author of Paper Soldiers: How the Weaponization of the Dollar Changed the World Order.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/10/28121757/us-dollar.jpg",
            "description": "<p>By Saleha Mohsin l Bloomberg  THE dollar’s role as the world’s reserve currency is being challenged due to President Donald Trump’s push to redesign the global economic order in favor of the US. Trust in the dollar is faltering, with the US dollar index tumbling more than 10% in the first six months of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-dollar-still-rules-but-us-policy-is-making-it-less-special/\">The dollar still rules, but US policy is making it less special</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        },
        {
            "title": "Ronaldo engaged to long-term partner Georgina Rodríguez",
            "url": "https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/",
            "content": "By BBC News\n\nFOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodrguez.\n\nShe announced the news on social media alongside a picture of a large ring, writing Yes I do. In this and in all my lives in her native Spanish.\n\nNo further details have been shared. Ronaldo, who is the most followed person on Instagram, has not yet made a comment about their engagement.\n\nThe couple have been together for nine years, after they met at a Gucci shop in Madrid where Rodrguez was working. He was playing at the Spanish club Real Madrid at the time.\n\nShe said siu! was one of the top comments, a nod to the footballers famous goal celebration where he shouts yes in Portuguese or Spanish.\n\nThe Portugal and Al-Nassr player has five children in total, two of whom he shares with Rodrguez.\n\nTheir youngest daughter Bella was born in April 2022, alongside a baby boy who was stillborn.\n\nRodrguez has also helped to raise Ronaldos other three children.\n\nThe 31-year-old, who starred in her own Netflix reality show I Am Georgina, previously addressed speculation around her engagement status. On the programme, she said her friends were always joking about the wedding.\n\nSince Jennifer Lopezs song The Ring Or When came out, they started singing it to me. And well, this is not up to me, she added.\n\nFamous faces including Kim Kardashian have liked the engagement announcement on social media. Piers Morgan, who interviewed Ronaldo in 2022, wished them as much success in their marriage as hes had on the football pitch!\n\nCelebrity make-up artist Charlotte Tilbury commented that it was fabulous news. Lauren Sanchez-Bezos, who married Amazon founder Jeff Bezos in June, said she was so happy for the couple.\n\nThe family currently live in the Saudi Arabian capital Riyadh, where Ronaldo plays for Al-Nassr. He joined the club in December 2022 for a reported annual salary of 177m ($238m).\n\nIn June 2025, it was announced that the 40-year-olds contract had been extended until 2027 after speculation that he was preparing to retire.\n\nIn a post on X, Ronaldo wrote: A new chapter begins. Same passion, same dream. Lets make history together.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/13045909/cristiano-ronaldo-wife-1.webp",
            "description": "<p>By BBC News FOOTBALLER Cristiano Ronaldo has got engaged to his long-term partner Georgina Rodríguez. She announced the news on social media alongside a picture of a large ring, writing “Yes I do. In this and in all my lives” in her native Spanish. No further details have been shared. Ronaldo, who is the most</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ronaldo-engaged-to-long-term-partner-georgina-rodriguez/\">Ronaldo engaged to long-term partner Georgina Rodríguez</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "13 Aug 2025"
        }
    ]
}