{
    "news": [
        {
            "title": "FIFA instructor hails Zimbabwean referees’ progress on international stage",
            "url": "https://www.newzimbabwe.com/fifa-instructor-hails-zimbabwean-referees-progress-on-international-stage/",
            "content": "By Sports Reporter\n\nFIFA referees instructor Felix Tangawarima has heaped praise on Zimbabwean match officials.\n\nHe was speaking on the sidelines of a one-week Referees MA Course being held at ZIFA Village in Harare.\n\nNow serving as an instructor, Tangawarima said Zimbabwean referees are doing well in international duty, a sign of how much they have improved.\n\nI can safely say that, as FIFA, we are extremely happy with how these local referees are performing at the international level.\n\nYou can see that there is an increase in the number of referees we are assigning to handle international games, so they are not doing badly, he said.\n\nZimbabwe currently has reigning Referee of the Year Brighton Chimene at the ongoing CHAN tournament as one of the match officials.\n\nOther than Chimene, six local referees are also on the COSAFA panel.\n\nTangawarima is Zimbabwes most successful referee in history. In 2000, he became the first local referee to officiate at AFCON.\n\nCurrently, he is the Head of Referees at COSAFA, leading all referees in the Southern African Region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20072542/felix-tangawarima.jpg",
            "description": "<p>By Sports Reporter FIFA referees instructor Felix Tangawarima has heaped praise on Zimbabwean match officials. He was speaking on the sidelines of a one-week Referees MA Course being held at ZIFA Village in Harare. Now serving as an instructor, Tangawarima said Zimbabwean referees are doing well in international duty, a sign of how much they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fifa-instructor-hails-zimbabwean-referees-progress-on-international-stage/\">FIFA instructor hails Zimbabwean referees’ progress on international stage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Aug 2025"
        },
        {
            "title": "Traffic diversion in Mabvuku from September for interchange construction – Transport Ministry announces",
            "url": "https://www.newzimbabwe.com/traffic-diversion-in-mabvuku-from-september-for-interchange-construction-transport-ministry-announces/",
            "content": "By Staff Reporter\n\nTRAFFIC in the Mabvuku area will be diverted to detour routes from 9 September 2025 to pave way for construction of the Mabvuku Interchange, the Transport Ministry has announced.\n\nIn a statement on Tuesday, the Ministry of Transport and Infrastructural Development said the move is aimed at ensuring the safety of motorists and construction workers while rehabilitation works progress.\n\nThe Ministry of Transport and Infrastructural Development wishes to inform the motoring public and all road users that traffic will be diverted to detour routes for the Mabvuku Interchange construction project.\n\nDetour will be opened to traffic on Tuesday,9 September 2025, to facilitate smooth and safe rehabilitation works.\n\nThis temporary diversion has been necessitated by the commencement of the construction of the Mabvuku Interchange, ensuring the safety of both motorists and construction personnel while allowing progress on the upgrades.\n\nClear signage will be in place to guide motorists through the alternative routes.\n\nThe Ministry regrets any inconvenience caused and appreciates the publics patience and cooperation during this period, the statement reads.\n\nThree months ago, during the commissioning of the Trabablas Interchange, formerly known as Mbudzi Roundabout, President Emmerson Mnangagwa announced that the government would build new multiple interchanges at busy road points across Harare.\n\nThese include Mabvuku Junction, several spots along Harare Drive and at major traffic circles like Westgate and Kuwadzana.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20071441/mabvuku.jpg",
            "description": "<p>By Staff Reporter  TRAFFIC in the Mabvuku area will be diverted to detour routes from 9 September 2025 to pave way for construction of the Mabvuku Interchange, the Transport Ministry has announced. In a statement on Tuesday, the Ministry of Transport and Infrastructural Development said the move is aimed at ensuring the safety of motorists</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/traffic-diversion-in-mabvuku-from-september-for-interchange-construction-transport-ministry-announces/\">Traffic diversion in Mabvuku from September for interchange construction – Transport Ministry announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Aug 2025"
        },
        {
            "title": "Malema’s call for Zimbabweans in SA to seek jobs in their country signals policy shift – analyst",
            "url": "https://www.newzimbabwe.com/malemas-call-for-zimbabweans-in-sa-to-seek-jobs-in-their-country-signals-policy-shift-analyst/",
            "content": "IOL\n\nA Political analyst has said Julius Malemas call for Zimbabweans in South Africa to seek employment in their home country signals a policy shift to align the Economic Freedom Fighters (EFF) with the aspirations and interests of the majority of South Africans.\n\nAddressing supporters at an EFF rally in Seshego, Limpopo, over the weekend, Malemastressed that South Africans must be prioritised for job opportunities, particularly within local municipalities.\n\nMalema emphasised that while Zimbabweans are welcome in South Africa, it is unjust for locals to be sidelined in their communities.\n\nWhen we say we want jobs where we pay for services, we are not saying we dont want Zimbabweans. We are saying we should be given first preference before everyone else to get jobs,Malema said.\n\nWe dont disagree that Zimbabweans should be given jobs, but they should be given jobs in their municipalities in Harare and other areas, so we have opportunities to get jobs in our municipalities.\n\nMalemasremarks come amid ongoing controversy in the Polokwane Municipality, where Mayor John Mpe has been accused of awarding tenders to foreign-owned companies, including one allegedly linked to a Zimbabwean partner of municipal manager Thuso Nemugumoni.\n\nMpe denied the allegations and defended the municipalitys procurement processes, stating that there is nothing unlawful about awarding tenders to foreign-owned companies if they comply with the law.\n\nKenneth Mokgatlhe, a political analyst and commentator, weighed in on the apparent EFF policy shift: Although this is not the first time Malema made similar remarks regarding the Zimbabwean question, this was the most direct address from him to them. In the past, he would tell them to go and vote to fix their situation.\n\nHe and his party had previously claimed that foreigners are not really stealing jobs from South Africans. We now know from [former EFF deputy Floyd] Shivambu that Malema did not engage his fellow executives on the immigration policy, which was responsible for their electoral decline in the past general elections.\n\nMokgatlhe said that there were now more voices which many disgruntled South Africans are associating with against illegal immigration.\n\nFor you to stay relevant and speak to the issues affecting the electorate, you have to tell them what they want to hear. He knows that he fumbled, but his ego wont let him come to the public and acknowledge weakness on his side, Mokgatlhe said.\n\nHe would rather silently make a policy shift to align his party with the aspirations and interests of the majority of South Africans. The EFF will not afford to ignore or speak against its citizens because immigration is one of the immediate global challenges for most countries that are stable in the world.\n\nHowever, Malema insisted that government projects funded by taxpayers must benefit South Africans first.\n\nHis comments take on greater significance against the backdrop of South Africas staggering youth unemployment crisis.\n\nAccording to recent statistics, 62.4% of young people aged 15 to 24 are unemployed, with the broader youth unemployment rate for those aged 15 to 34 sitting at 46.1%. For the 25 to 34 age group, the unemployment rate is 40.4%.\n\nThese figures, which have steadily worsened over the past decade, have raised alarms among economists and labour experts, who warn that the country is facing a generation excluded from economic participation.\n\nMalema said that it is unacceptable for South Africans to remain jobless while foreign nationals receive tenders and employment through municipal structures. He urged communities to resist and question such decisions and to demand accountability from local leaders.\n\nHis latest comments signal a shift from his earlier stance on foreign nationals and open border policy.\n\nIn 2022, Malema had defended the right of Zimbabweans to work in South Africa, while still calling for locals to be prioritised.\n\nWe want Zimbabweans to work in SA. They should make no apologies about hiring Zimbabweans or any other African brother or sister. But they must be considerate that there are locals who must at all times be given preference, he said at the time.\n\nIn previous years, Malema has also spoken out against xenophobia and expressed support for Pan-African unity.\n\nDuring a Heritage Day address in 2022, he urged South Africans not to discriminate against Zimbabweans or other African migrants.\n\nWe must never speak about heritage but refuse to want Zimbabweans or any person from another African country. You will see a Zimbabwean and see an African  this is my brother, this is my sister, he said.\n\nHe also encouraged Zimbabwean nationals in South Africa to participate in their countrys democratic process, even offering buses to transport them home to vote. Malema went as far as urging Zimbabweans to vote out the ruling ZANU-PF party, which he accused of plunging the country into economic ruin.\n\nHowever, another political commentator, Anda Mbikwana, cautioned: While political leaders often express their views within the broader context of national policy and sovereignty, such statements must be approached with both sensitivity and a commitment to regional unity.\n\nMigration across our borders is a complex issue, rooted in economic, social, and historical dynamics that require thoughtful, humane, and collaborative solutions, Mbikwana said.\n\nAny discourse on the matter should avoid fuelling division or xenophobia and instead focus on sustainable development, mutual support, and inclusive growth across the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/05045101/Julius-Malema1.jpg",
            "description": "<p>IOL A Political analyst has said Julius Malema’s call for Zimbabweans in South Africa to seek employment in their home country signals a policy shift to align the Economic Freedom Fighters (EFF) with the aspirations and interests of the majority of South Africans. Addressing supporters at an EFF rally in Seshego, Limpopo, over the weekend,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malemas-call-for-zimbabweans-in-sa-to-seek-jobs-in-their-country-signals-policy-shift-analyst/\">Malema’s call for Zimbabweans in SA to seek jobs in their country signals policy shift – analyst</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Aug 2025"
        },
        {
            "title": "Court strikes blow against tenants in battle with Harare City Council’s Rufaro Marketing",
            "url": "https://www.newzimbabwe.com/court-strikes-blow-against-tenants-in-battle-with-harare-city-councils-rufaro-marketing/",
            "content": "By Mary Taruvinga\n\nThe High Court has struck off the roll a case brought by three bar operators against Rufaro Marketing (Pvt) Ltd, a Harare City Councilowned company, in a ruling that gives the municipal entity the upper hand in an ongoing battle over leases and sub-tenancy rights.\n\nThe applicants, Ilack Moyo, John Musara and Tendayi Mhembere had sought a declaratory order blocking Rufaro Marketing from collecting rentals directly from their subtenants at Zororo II Bar in Dzivarasekwa, Mabvuku Bar and Willowvale Bar in Highfield.\n\nJusticeMaxwell Takuva ruled that the dispute could not be entertained while related proceedings were already pending before the Magistrates Court.\n\nThis court cannot intervene in the proceedings in the Magistrates Court lest it risks the possibility of conflicting judgments, Takuva said.\n\nWhatever decision that the Magistrate reaches will be able to guide the parties as to how to proceed from there onwards.\n\nThe bar operators accused Rufaro Marketings new management of unlawfully diverting rental payments from their subtenants, undermining agreements they had entered into with the companys previous chief executive officer.\n\nThey argued that this move crippled their ability to meet rental obligations.\n\nHowever, Takuva found the tenants case misdirected, stressing that once they had withdrawn a previous High Court application, they could not stop the respondent from pursuing its own legal remedies.\n\nWhen a party decides to withdraw its matter, it cannot therefore stay the other parties from proceeding to pursue their own application to court, the judge ruled.\n\nStriking the matter off the roll, the court ordered the applicants to pay costs.\n\nWith the case now resting in the Magistrates Court, Rufaro Marketing retains control of rental collections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/19182107/rufaro-marketing-.jpg",
            "description": "<p>By Mary Taruvinga The High Court has struck off the roll a case brought by three bar operators against Rufaro Marketing (Pvt) Ltd, a Harare City Council–owned company, in a ruling that gives the municipal entity the upper hand in an ongoing battle over leases and sub-tenancy rights. The applicants, Ilack Moyo, John Musara and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-strikes-blow-against-tenants-in-battle-with-harare-city-councils-rufaro-marketing/\">Court strikes blow against tenants in battle with Harare City Council’s Rufaro Marketing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Aug 2025"
        },
        {
            "title": "Man kills girlfriend before committing suicide",
            "url": "https://www.newzimbabwe.com/man-kills-girlfriend-before-committing-suicide/",
            "content": "By Staff Reporter\n\nPOLICE in Gwanda, Matebeleland South province, have confirmed a gory incident in which a 36-year-old man murdered his lover before taking his own life under unclear circumstances.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy.\n\nPolice in Guyu are investigating circumstances surrounding a tragic incident in which Nqobile Ncube (36) allegedly killed his girlfriend, Untibile Ndlovu (30) for unknown reasons before committing suicide by hanging at Corner Line village, Nhlamba on August 17, 2025, said Nyathi.\n\nMeanwhile, police in Bindura are appealing for information which may lead to the arrest of Lloyd Muungani, who is being sought in connection with a case of murder in which he allegedly struck a yet to be identified man with a shovel on the head on August 18, 2025, at Beacon Hill, Mine 2. The victim died on the spot.\n\nZRP urges anyone with information to report to the nearest police station.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter POLICE in Gwanda, Matebeleland South province, have confirmed a gory incident in which a 36-year-old man murdered his lover before taking his own life under unclear circumstances. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the tragedy. “Police in Guyu are investigating circumstances surrounding a tragic incident in which Nqobile</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-kills-girlfriend-before-committing-suicide/\">Man kills girlfriend before committing suicide </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Aug 2025"
        },
        {
            "title": "Zimbabwe bank payments disrupted by outage that hit Central Bank",
            "url": "https://www.newzimbabwe.com/zimbabwe-bank-payments-disrupted-by-outage-that-hit-central-bank/",
            "content": "Bloomberg\n\nZimbabwean banks reported widespread disruption to a widely-used payment channel, after the central bank experienced a network problem that it is trying to fix.\n\nLenders including theCentral African Building Society Ltd., the nations largest mortgage lender and a unit of South African insurerOld Mutual Ltd., advised clients Tuesday that the real-time gross settlement platform was down.\n\nTheReserve Bank of Zimbabwe, which said on Monday it was experiencing a technical challenge that could delay some banking services, is working to resolve the issue. Its website was offline all Tuesday, with the official dollar exchange-rate for the local currency, the gold-backed ZiG, unavailable.\n\nLarge retailers and local councils are among those which often rely on the central banks website for a guide on official exchange rates to price their goods and services. The Zimbabwe Stock Exchange is also affected as its unable to settle payments.\n\nLawrence Nyazema, president of the Bankers Association of Zimbabwe, said the main system was down which in turn affected payments across the market, while noting the RBZ had been able to restore some services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/07022039/Reserve-Bank.jpg",
            "description": "<p>Bloomberg Zimbabwean banks reported widespread disruption to a widely-used payment channel, after the central bank experienced a network problem that it is trying to fix. Lender’s including the Central African Building Society Ltd., the nation’s largest mortgage lender and a unit of South African insurer Old Mutual Ltd., advised clients Tuesday that the real-time gross settlement platform</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-bank-payments-disrupted-by-outage-that-hit-central-bank/\">Zimbabwe bank payments disrupted by outage that hit Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "20 Aug 2025"
        }
    ]
}