{
    "news": [
        {
            "title": "Zim Diaspora Property Showcase USA: Datvest floats tangible investment opportunities",
            "url": "https://www.newzimbabwe.com/zim-diaspora-property-showcase-usa-datvest-floats-tangible-investment-opportunities/",
            "content": "By Alois Vinga\n\nASSET management firm, Datvest is offering several tangible investment opportunities ahead of theZim Diaspora Property Showcase USA-Canada.\n\nThe top event is slated to take place at The Westin Hotel, Dallas-Fort Worth, from April 24 to 27, 2025.\n\nThe upmarket event will bring togetherpotential homebuyers, investors, and industry professionals to navigate opportunities in Zimbabwes attractive real estate. Reputable developers, property consultants, financial institutions and other key players will also converge to showcase their offerings.\n\nSpeaking ahead of the must-attend event, Datvest Managing Director Tendai Muzadzi said a full range of products will be on offer.\n\nWe are offering a full range of real estate products, mortgages, stands, fully developed housing and also opportunities for partnerships with land owners, contractors and service providers. The key highlights to my presentation are the opportunities for real estate investment in Zimbabwe and the structures that allow the diaspora community to participate in a secure format, allowing for real returns in US$ above those generally achievable elsewhere, he said.\n\nHe implored Zimbabweans based in the US and Canada to appreciate the fact that the Asset Management industry is quite stable and secure given the type of products which have been developed.\n\nAt Datvest, he said, the focus is on alternative investments which not only provides a tangible investment option but also adds to the countrys infrastructure development hence the need for the diaspora community to consider investing back home through Datvest  which offers a secure platform from a well regulated financial services group and access to their investments being well guaranteed on a digitally enabled CBZ platform called CBZ touch.\n\nWe have structures in place to conclude on transactions like purchasing a stand or house in Zimbabwe, obtaining a mortgage facility from our bank and opening a bank or investment account with CBZ, he said.\n\nRELATED:\n\nCBZ Asset Management t/a Datvest began in 1990. The asset management business is wholly owned by CBZH and is the second largest asset management in Zimbabwe managing on average US$350 million.\n\nThe core focus for Datvest is on portfolio management with exposures to Equities, Fixed Income and Alternatives. Under the Alternative investments Datvest has developed housing, commercial, industrial real estate including some hospitals and hotels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/19070751/Tendai-Muzadzi-CBZ-e1745043327480.jpg",
            "description": "<p>By Alois Vinga ASSET management firm, Datvest is offering several tangible investment opportunities ahead of the Zim Diaspora Property Showcase USA-Canada. The top event is slated to take place at The Westin Hotel, Dallas-Fort Worth, from April 24 to 27, 2025. The upmarket event will bring together potential homebuyers, investors, and industry professionals to navigate opportunities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-diaspora-property-showcase-usa-datvest-floats-tangible-investment-opportunities/\">Zim Diaspora Property Showcase USA: Datvest floats tangible investment opportunities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Chinese robots ran against humans in the world’s first humanoid half-marathon. They lost by a mile",
            "url": "https://www.newzimbabwe.com/chinese-robots-ran-against-humans-in-the-worlds-first-humanoid-half-marathon-they-lost-by-a-mile/",
            "content": "By Chris Lau l CNN\n\nIF the idea of robots taking on humans in a road race conjures dystopian images of android athletic supremacy, then fear not, for now at least.\n\nMore than 20 two-legged robots competed in the worlds first humanoid half-marathon in China on Saturday, and  though technologically impressive  they were far from outrunning their human masters over the long distance.\n\nTeams from several companies and universities took part in the race, a showcase of Chinas advances on humanoid technology as it plays catch-up with the US, which still boasts the more sophisticated models.\n\nAnd the chief of the winning team said their robot  though bested by the humans in this particular race  was a match for similar models from the West, at a time when the race to perfect humanoid technology is hotting up.\n\nComing in a variety of shapes and sizes, the robots jogged through Beijings southeastern Yizhuang district, home to many of the capitals tech firms.\n\nOver the past few months, videos of Chinas humanoid robots performing bike rides, roundhouse kicks and side flips have blown up the internet, often amplified by state media as a key potential driver of economic growth.\n\nIn a 2023 policy document, Chinas Ministry of Industry and Information Technology identified the humanoid robotics industry as a new frontier in technological competition, setting a 2025 target for mass production and secure supply chains for core components.\n\nFears have mounted in recent years about how artificial intelligence  and robots  may one day outsmart humans.\n\nAnd while AI models are fast gaining ground, sparking concern for everything from security to the future of work, Saturdays race suggested that humans still at least have the upper hand when it comes to running.\n\nThe robots were pitted against 12,000 human contestants, running side by side with them in a fenced-off lane.\n\nAfter setting off from a country park, participating robots had to overcome slight slopes and a winding 21-kilometer (13-mile) circuit before they could reach the finish line, according to state-run outlet Beijing Daily.\n\nJust as human runners needed to replenish themselves with water, robot contestants were allowed to get new batteries during the race. Companies were also allowed to swap their androids with substitutes when they could no longer compete, though each substitution came with a 10-minute penalty.\n\nThe first robot across the finish line, Tiangong Ultra  created by the Beijing Humanoid Robot Innovation Center  finished the route in two hours and 40 minutes. Thats nearly two hours short of the human world record of 56:42, held by Ugandan runner Jacob Kiplimo. The winner of the mens race on Saturday finished in 1 hour and 2 minutes.\n\nTang Jian, chief technology officer for the robotics innovation center, said Tiangong Ultras performance was aided by long legs and an algorithm allowing it to imitate how humans run a marathon.\n\nI dont want to boast but I think no other robotics firms in the West have matched Tiangongs sporting achievements, Tang said, according to the Reuters news agency, adding that the robot switched batteries just three times during the race.\n\nThe 1.8-meter robot came across a few challenges during the race, which involved the multiple battery changes. It also needed a helper to run alongside it with his hands hovering around his back, in case of a fall.\n\nMost of the robots required this kind of support, with a few tied to a leash. Some were led by a remote control.\n\nAmateur human contestants running in the other lane had no difficulty keeping up, with the curious among them taking out their phones to capture the robotic encounters as they raced along.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/19071046/2025-04-19t025815z-438498506-rc2q0eaifagb-rtrmadp-3-athletics-china-robots.webp",
            "description": "<p>By Chris Lau l CNN IF the idea of robots taking on humans in a road race conjures dystopian images of android athletic supremacy, then fear not, for now at least. More than 20 two-legged robots competed in the world’s first humanoid half-marathon in China on Saturday, and – though technologically impressive – they were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-robots-ran-against-humans-in-the-worlds-first-humanoid-half-marathon-they-lost-by-a-mile/\">Chinese robots ran against humans in the world’s first humanoid half-marathon. They lost by a mile</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Elderly man jailed 15 years for raping girl (10)",
            "url": "https://www.newzimbabwe.com/elderly-man-jailed-15-years-for-raping-girl-10/",
            "content": "AN 82-year-old Nyanga man has been slapped with a 15-year jail term following his conviction for raping a 10-year-old girl from next door.\n\nThe octogenarian, whose identity is being withheld to protect the minor, was convicted after a full trial by a Nyanga magistrate.\n\nProsecutors proved that on an unknown day in September 2024, the victim was walking alone from her home towards a river around midday.\n\nThe elderly offender was walking in the opposite direction on the same path.\n\nThey met on the path in a bushy area and the offender grabbed the victims hand and dragged her off the path into the bush. She resisted and tried to loosen his grip, but she failed.\n\nThe offender continued to drag the victim deeper into the bush whilst holding her dress.\n\nThe victim cried for help, but no one heard her, that was when the offender threatened to kill her with a silver knife that he took from his bag, ordering her to be quiet. He forced her to the ground, held her down, removed her pants, and raped her, the State proved.\n\nAfter the rape, he threatened to kill her if she told anyone.\n\nThe victim disclosed the assault to her aunt in December 2024 before the matter was reported.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter AN 82-year-old Nyanga man has been slapped with a 15-year jail term following his conviction for raping a 10-year-old girl from next door. The octogenarian, whose identity is being withheld to protect the minor, was convicted after a full trial by a Nyanga magistrate. Prosecutors proved that on an unknown day in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elderly-man-jailed-15-years-for-raping-girl-10/\">Elderly man jailed 15 years for raping girl (10)</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Mine hoist accident leaves three miners dead",
            "url": "https://www.newzimbabwe.com/mine-hoist-accident-leaves-three-miners-dead/",
            "content": "By Staff Reporter\n\nTHREE unidentified miners died Friday at Mazowes Jumbo Mine after the rope of an electric hoist snapped, plunging them 45 metres down a shaft.\n\nZimbabwe Republic (ZRP) police spokesperson Paul Nyathi confirmed the incident.\n\nThe ZRP confirms a fatal mine incident which occurred at Starlake Claim, Jumbo Mine, Mazowe on 17 April 2025 in which three people were killed.\n\nThe rope of an electric hoist broke while the victims were coming out of the mine shaft resulting in them falling into the shaft approximately 45 metres deep, Nyathi said.\n\nThe victims are yet to be named.\n\nMeanwhile, last week three people died while six were injured in another mine accident that occurred Boss Mine in Mashava after a shaft collapsed while workers were underground.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/09025242/Illegal-Miners-SA.png",
            "description": "<p>By Staff Reporter  THREE unidentified miners died Friday at Mazowe’s Jumbo Mine after the rope of an electric hoist snapped, plunging them 45 metres down a shaft. Zimbabwe Republic (ZRP) police spokesperson Paul Nyathi confirmed the incident. “The ZRP confirms a fatal mine incident which occurred at Starlake Claim, Jumbo Mine, Mazowe on 17 April</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mine-hoist-accident-leaves-three-miners-dead/\">Mine hoist accident leaves three miners dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Two brothers sentenced to 93 years in prison for stealing oil from ZESA transformers",
            "url": "https://www.newzimbabwe.com/two-brothers-sentenced-to-93-years-in-jail-for-stealing-oil-from-zesa-transformers/",
            "content": "By Mary Taruvinga\n\nTWO Gweru men, who are brothers, will endure a combined 93 year-jail term for stealing transformer oil in and around the Midlands provinces city of Gweru.\n\nThe two are Jacob and Masimba Chibunhe.\n\nJacob was slapped with 45 years imprisonment for 17 counts he was convicted of while his brother was jailed 48 years for 18 counts.\n\nTheir counts were set to run concurrently by the sentencing court, which is the High Court.\n\nThe Chibunhes had approached the Supreme Court challenging their sentencing by the High Court arguing that their counts were supposed to run concurrently.\n\nThe Supreme Court, however, dismissed their appeal ruling that the two were correctly sentenced.\n\nThe whole essence of legislative intervention in providing for a mandatory minimum sentence is to take away the sentencing discretion of the court.\n\nOnce taken away, that sentencing discretion cannot be regained by inventing a structuring process of sentencing which side-steps the legislative command.\n\nI must mention though that the part of the court a quos judgment on this aspect has not been impugned either by the appellants or the respondent. For that reason, this Court has no basis to interfere with it, said Justice Mathonsi, who was sitting with Susan Mavangira and Joseph Musakwa.\n\nThe bench also noted that the court analysed the circumstances under which the offences were committed and noted that the appellants had engaged in a spree of criminal activities by moving around Gweru draining transformer oil and selling it to different individuals.\n\nThe court took note of the fact that the appellants had disadvantaged the Zimbabwe Electricity Supply Authority (ZESA) by stealing a total of 11 530 litres of oil and causing damage to transformers amounting to $96 750.\n\nThe court further noted that the appellants were an organized criminal gang which operated under the cover of darkness and meticulously planned the execution of the crimes.\n\nAlso, their criminal escapades resulted in communities and industries suffering due to non-availability of electricity.\n\nAfter analysing the totality of the above considerations, the court found that a sentence based on purely the mandatory sentence of ten years would be draconian, abnormal and excessive to the extreme and induce an extreme sense of shock.\n\nThe court then exercised its discretion and arrived at a calculation of three years per count with some counts running concurrently.\n\nThis was done in the exercise of sentencing discretion which, as already stated, was improper but cannot be upset because, firstly it was favorable to the appellants and, secondly, none of the parties has challenged it, said the judges before dismissing the appeal.\n\nThe Chibunhes were charged along with two other individuals in the Provincial Magistrates Court in Gweru on 18 counts of violating section 60 A(3) of the Electricity Act [Chapter 13:19], as referenced with section 2 (3)(b) of the Electricity Amendment Act, enacted via Statutory Instrument No. 12 of 2007.\n\nAll counts involved vandalizing, cutting, damaging, destroying, or interfering with equipment used for transmitting, distributing, or supplying electricity.\n\nThe State established that from 11 February to 29 June 2013, the appellants, alongside two accomplices, orchestrated a coordinated criminal operation throughout Gweru that entailed the theft of transformer oil totaling 11,530 liters.\n\nThey caused widespread power outages and significant financial losses to the Zimbabwe Electricity Supply Authority (ZESA), the national electricity supplier, the state asserted.\n\nJacob pleaded not guilty to all charges, while Masimba admitted guilt to just one count but denied the others.\n\nEvidence demonstrated that the two, in collaboration with accomplices James Mahachi and Francis Madziva, used a red Honda Fit with registration number ACW 7466 to commit their crimes in Gweru.\n\nThe State argued that over a span of five months, primarily between 8:00 pm and 8:00 am, the Chibunhes specifically targeted at least 18 transformers, siphoning off a total of 11,530 liters of oil and causing damages estimated at no less than $96,750.\n\nThe stolen oil was then sold to omnibus operators with whom they had established connections.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/15164716/Zesa-Transformer.jpg",
            "description": "<p>By Mary Taruvinga TWO Gweru men, who are brothers, will endure a combined 93 year-jail term for stealing transformer oil in and around the Midlands province’s city of Gweru. The two are Jacob and Masimba Chibunhe. Jacob was slapped with 45 years’ imprisonment for 17 counts he was convicted of while his brother was jailed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-brothers-sentenced-to-93-years-in-jail-for-stealing-oil-from-zesa-transformers/\">Two brothers sentenced to 93 years in prison for stealing oil from ZESA transformers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "University of Zimbabwe lecturers take police to court over protest crackdown",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-lecturers-take-police-to-court-over-protest-crackdown/",
            "content": "By Darlington Gatsi\n\nUNIVERSITY of Zimbabwe (UZ) lecturers have approached the High Court to interdict the Zimbabwe Republic Police (ZRP) from disrupting their industrial action, as they continue to protest against poor renumeration.\n\nThe lecturers are at loggerheads with the university and the Ministry of Higher and Tertiary Education over their meagre US$250 salaries, which they are demanding to be raised tenfold to US$2,500.\n\nLast Wednesday, three lecturers were arrested after picketing at UZ, but were released Thursday after paying US$15 fines.\n\nThe Association of University Teachers (AUT) has now filed an application at the High Court to prevent the ZRP from disrupting their future demos.\n\nIn the court application, the AUT argues that Police Commissioner Stephen Mutamba and the UZ authorities who are cited as the first and third respondents respectively  unlawfully disrupted their protest.\n\nThe applicant and its members stand to suffer irreparable harm if the 1st respondent and 3rd respondents are left to continue to disregard the lawful rights of the applicant and its members to engage in lawful picketing in supporting of a lawful collective job action, reads the application.\n\nThe lecturers are frustrated by the UZ and the governments lack of urgency in addressing their wage demands.\n\nIn a letter to the institution and Ministry of Higher and Tertiary Education they argued that they have resorted to using personal resources to conduct lectures.\n\nIn the application AUT also avers that their peaceful protests will likely be disrupted again.\n\nApplicant and its members do not have any other viable and effective remedy at their disposal than to seek for an interdict in the manner it has done.\n\nBy way of correspondence and personal oral explanation, applicant has fully explained the nature of a lawful picket to officers and officials of 1st respondent and 3rd respondent.\n\nBut same has been disregarded and 1 and 3 respondents have used violent measures to disperse the picketing.\n\nTheir obvious objective is to disrupt and undermine the collective job action despite the right to collective job action being an enshrined right in the Constitution, reads the application further.\n\nAUT is represented by Matika, Gwisai and Partners and the matter will be heard today, Saturday April 19.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/15203310/uz_main_gate-min.jpeg",
            "description": "<p>By Darlington Gatsi  UNIVERSITY of Zimbabwe (UZ) lecturers have approached the High Court to interdict the Zimbabwe Republic Police (ZRP) from disrupting their industrial action, as they continue to protest against poor renumeration. The lecturers are at loggerheads with the university and the Ministry of Higher and Tertiary Education over their meagre US$250 salaries, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-lecturers-take-police-to-court-over-protest-crackdown/\">University of Zimbabwe lecturers take police to court over protest crackdown </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "FC Platinum lift Presidential Uhuru Cup after beating Simba Bhora in 15-minute final played on water clogged pitch",
            "url": "https://www.newzimbabwe.com/fc-platinum-lift-presidential-uhuru-cup-after-beating-simba-bhora-in-15-minute-final-played-on-water-clogged-pitch/",
            "content": "By Sports Reporter\n\nFC Platinum were Friday crowned the 2025 Presidential Uhuru Cup champions after beating Simba Bhora 3-0 in a penalty shootout at Nembudziya Ground in Gokwe.\n\nPlayed for only 15 minutes due to a water-logged pitch, the match was sent straight into penalty shootouts by the organisers since the teams could not go for 90 minutes.\n\nBesides the flooded arena, another big setback for the match was the two teams late arrival for the fixture due to poor travelling logistics to the venue, which saw them arriving at 17:10hrs, two hours late than the scheduled kick off time.\n\nFC Platinum scored its first three penalty kicks through Thubelihle Jubane, Thandolwenkosi Ngwenya and Mischeck Ngwenya, while all of Simbas first three takers missed the spot.\n\nSpeaking after the match FC Platinum gaffer Norman Mapeza said, Zimbabwe has turned 45 that was the most important thing.\n\nIt is also good for the people of Gokwe, it motivates the youngsters who watched us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/19060138/FB_IMG_1745036506723.jpg",
            "description": "<p>By Sports Reporter  FC Platinum were Friday crowned the 2025 Presidential Uhuru Cup champions after beating Simba Bhora 3-0 in a penalty shootout at Nembudziya Ground in Gokwe. Played for only 15 minutes due to a water-logged pitch, the match was sent straight into penalty shootouts by the organisers since the teams could not go</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fc-platinum-lift-presidential-uhuru-cup-after-beating-simba-bhora-in-15-minute-final-played-on-water-clogged-pitch/\">FC Platinum lift Presidential Uhuru Cup after beating Simba Bhora in 15-minute final played on water clogged pitch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Zimbabweans in diaspora demonstrate against ‘stolen lndependence’ as petition heads to UK authorities",
            "url": "https://www.newzimbabwe.com/zimbabweans-in-diaspora-demonstrate-against-stolen-lndependence-as-petition-heads-to-uk-authorities/",
            "content": "By Staff Reporter\n\nA SERIES of demonstrations were staged across the world as Zimbabweans in the diaspora marked the countrys Independence Day with protests condemning what they described as a stolen democracy.\n\nFrom the United Kingdom to South Africa, Ireland, Northern Ireland, and Australia, Zimbabweans took to the streets in a coordinated show of disapproval of Zanu PFs government.\n\nIn London, a crowd gathered outside the Zimbabwean Embassy, led by prominent figures including John Burke, Chief Felix Ndiweni, Karimanzira, Shamiso Moyo and Melody Phylis Magejo.\n\nThe demonstrators, many wearing Zimbabwe Human Rights Organisation (ZHRO) t-shirts, Citizens Coalition for Change (CCC) regalia, and attire from various human rights movements, chanted slogans condemning the current administration and announced they would be submitting a formal petition to UK authorities.\n\nThe protesters accused Zimbabwes ruling elite of betraying the ideals of independence and perpetuating political repression, economic collapse, and widespread human rights violations.\n\nGovernment source inside Zimbabwe, speaking on condition of anonymity, accused foreign entities of orchestrating the global protests.\n\nThese demonstrations are driven by foreign forces attempting to destabilise the Second Republic, which is focused on economic revival and infrastructure development, the source said.\n\nZanu PF officials have reportedly placed several activists under surveillance, claiming they are engaging in cyber activities that threaten national sovereignty.\n\nThose allegedly being monitored include Xoliso Sithole, Munyaradzi Boniface Zengeni, Happiness Ncube, Tendai Christian Mapfumo, Chipo Komboni, Shepherd Yuda, Genius Khatazile Mamwadhu, Pamela Magwizi, Sikhatalele Dladla, Bonisile Nyoni and Petty Zirambaactivists mainly based in Australia, USA, Ireland and Northern Ireland.\n\nIn the UK, the likes of Sandra Sekai Chidemo, Josephine Jenje Mudimu, Theophilas Mkuhlani, Nobukhosi Dube, Diana Machingauta, Dumisani Manyande, Blessing Harry, Dickson Chikwizo, Eness Mapungwana, Patson Muzuwa, Michelle Nokuthaba Mpofu, and Vengai Mutsawu were also named as targets of state surveillance.\n\nAccording to sources within Zimbabwes security apparatus, these individuals have been placed on immigration watchlists and may face questioning or detention if they attempt to re-enter the country.\n\nProtests by exiled Zimbabweans, fleeing economic ruin and political persecution, cast a shadow over the countrys Independence celebrations, whose main celebrations were Friday presided over by President Emmerson Mnangagwa in Gokwe, Midlands province.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/19055536/IMG-20250419-WA0006.jpg",
            "description": "<p>By Staff Reporter  A SERIES of demonstrations were staged across the world as Zimbabweans in the diaspora marked the country’s Independence Day with protests condemning what they described as a “stolen democracy.” From the United Kingdom to South Africa, Ireland, Northern Ireland, and Australia, Zimbabweans took to the streets in a coordinated show of disapproval</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-in-diaspora-demonstrate-against-stolen-lndependence-as-petition-heads-to-uk-authorities/\">Zimbabweans in diaspora demonstrate against ‘stolen lndependence’ as petition heads to UK authorities</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "13 injured after train full of tourists collides with goods locomotive",
            "url": "https://www.newzimbabwe.com/13-injured-after-train-full-of-tourists-collides-with-goods-locomotive/",
            "content": "By Staff Reporter\n\nA PASSENGER train laden with tourists collided head-on with a goods locomotive in Gwanda this Friday leaving 13 people imjured.\n\nThe crash occurred at the 132 kilometre peg along the Bulawayo-Beitbridge rail track.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms a railway line accident which occurred on April 18, 2025, at around 0615 hours at the 132 kilometre peg along Bulawayo-Beitbridge railway line.\n\nThirteen (13) people were injured when a goods train was involved in a head on collision with a passenger train with 47 passengers and 31 staff members on board, said Nyathi.\n\nThe National Railways of Zimbabwe (NRZ) has since distanced itself from the incident, saying that it doesnt ply that route while the trains concerned were privately-owned. The luxury train is owned by Rovos Rail of South Africa, which was heading Victoria Falls and carrying 47 international tourists. The other goods train belongs to Beitbridge Bulawayo Railway (BBR).\n\nWe have been inundated with inquiries concerning the collision of two trains in Gwanda today.\n\nWe inform the nation that NRZ does not operate on that line as it is privately controlled. More so, the two trains are privately operated.\n\nWe, therefore, have no mandate to speak on behalf of the organisations involved. However, we join the nation in wishing those injured a speedy recovery, said the national carrier.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18172545/IMG-20250418-WA0044.jpg",
            "description": "<p>By Staff Reporter  A PASSENGER train laden with tourists collided head-on with a goods locomotive in Gwanda this Friday leaving 13 people imjured. The crash occurred at the 132 kilometre peg along the Bulawayo-Beitbridge rail track. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms a railway line</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/13-injured-after-train-full-of-tourists-collides-with-goods-locomotive/\">13 injured after train full of tourists collides with goods locomotive </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        },
        {
            "title": "Blessed Geza effect: Mnangagwa warns Zimbabweans of social media incitement",
            "url": "https://www.newzimbabwe.com/blessed-geza-effect-mnangagwa-warns-zimbabweans-of-social-media-incitement/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has urged Zimbabweans to be cautious of false information spread on social media, saying it is being used to create confusion and unrest.\n\nMnangagwas remarks, delivered during a national address at the Independence Day celebrations in Gokwe, come at a time when factional battles are simmering within the ruling party, Zanu PF.\n\nMnangagwa is facing mounting pressure from a disgruntled clique of war veterans, fronted by Blessed Bomshell Runesu Geza, calling for his ouster and accusing him of presiding over a corrupt and failing government.\n\nGeza, who is in hiding for a number of crimes including undermining the President, has been using social media to address and mobilise Zimbabweans for an uprising against Mnangagwa.\n\nThe 82-year-old Zanu PF leader said these were efforts to destabilise the country.\n\nAll patriotic Zimbabweans are reminded of the need to guard against the dangers of social media, which is increasingly being used as a tool to cause discord and raise false alarms.\n\nI commend you, my dear fellow compatriots, both at home and abroad, for remaining vigilant, patriotic and steadfast, never allowing ourselves to be misled by shadowy elements with dubious, opportunistic agendas.\n\nLet us remain united while building our nation, Mnangagwa said.\n\nThe President also urged all Zimbabweans to unite in protecting the countrys progress from internal and external threats, while praising the security forces for their loyalty and defence of the nations sovereignty and independence.\n\nEach of us has a duty to protect our nation from elements, both within and outside our borders, who seek to reverse our national development path.\n\nHand-in-hand, with focus and discipline, let us defend and work harder for the benefit of our motherland, Zimbabwe now and in the future.\n\nWe salute our security services for their loyalty, patriotism, and unwavering defence of our country, sovereignty, territorial integrity, and hard-won independence, Mnangagwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18165355/IMG-20250418-WA0049.jpg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has urged Zimbabweans to be cautious of false information spread on social media, saying it is being used to create confusion and unrest. Mnangagwa’s remarks, delivered during a national address at the Independence Day celebrations in Gokwe, come at a time when factional battles are simmering within the ruling</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blessed-geza-effect-mnangagwa-warns-zimbabweans-of-social-media-incitement/\">Blessed Geza effect: Mnangagwa warns Zimbabweans of social media incitement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:27",
            "date": "19 Apr 2025"
        }
    ]
}