{
    "news": [
        {
            "title": "Gold panner jailed 20 years for brutal murder over a monkey",
            "url": "https://www.newzimbabwe.com/gold-panner-jailed-20-years-for-brutal-murder-over-a-monkey/",
            "content": "By Mary Taruvinga\n\nA 21-year-old gold panner has been sentenced to 20 years in prison after the High Court found him guilty of fatally stabbing a colleague during a drunken quarrel over what to do with a monkey they had failed to sell.\n\nJustice Kabasa, sitting with two assessors, ruled that Mlindeli Siziba used a knife to stab the victim multiple times in the back, puncturing his lungs, after the deceased suggested they give the monkey away. His co-accused, Mthulisi Moyo, was acquitted for lack of evidence.\n\nAll the deceased had done was ask that you give away a monkey. He died because of such a flimsy reason, Justice Kabasa said in her ruling. Why would one use a lethal weapon to stab a human being several times and aim at vital organs if the intention is not to kill?\n\nThe court dismissed Sizibas claim of self-defence, pointing out that the victim was fleeing when attacked.\n\nA person fleeing is no danger to anyone. The ones pursuing are the danger to the one fleeing. What self-defence is that when the victim is attacked from the back?\n\nThe judge condemned the growing use of knives in violent disputes among artisanal miners.\n\nThe use of knives is becoming worrisome and gold panners appear to take knives as the weapon of choice. People ought to respect the sanctity of life. Life is a gift which ought not to be taken away at the hands of another.\n\nSiziba, who left the victim to bleed to death by a riverbank and lied that he was alright, showed no remorse, the court said.\n\nHanding down sentence, Justice Kabasa stressed that deterrence was necessary.\n\nAt 21 you are not so young to deserve a reduction of an otherwise appropriate sentence. There was nothing youthful in your conduct. The presumptive penalty is 20 years. We find no reason to depart from that.\n\nSiziba was jailed for 20 years, while Moyo walked free after being given the benefit of the doubt.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/29073017/Monkey.jpg",
            "description": "<p>By Mary Taruvinga A 21-year-old gold panner has been sentenced to 20 years in prison after the High Court found him guilty of fatally stabbing a colleague during a drunken quarrel over what to do with a monkey they had failed to sell. Justice Kabasa, sitting with two assessors, ruled that Mlindeli Siziba used a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-panner-jailed-20-years-for-brutal-murder-over-a-monkey/\">Gold panner jailed 20 years for brutal murder over a monkey</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "23 Sep 2025"
        },
        {
            "title": "Trump to address UN General Assembly after France recognises Palestinian state",
            "url": "https://www.newzimbabwe.com/trump-to-address-un-general-assembly-after-france-recognises-palestinian-state/",
            "content": "BBC\n\nFrance has formally recognised a Palestinian state, becoming the latest in a wave of countries to take the step.\n\nSpeaking at the UN in New York, President Emmanuel Macron said the time for peace has come and that nothing justifies the ongoing war in Gaza.\n\nUS President Donald Trump is due to address the UN General Assembly on Tuesday, as will the leaders of key regional players such as Jordan and Qatar.\n\nOn Monday, the US did not attend a one-day summit hosted by France and Saudi Arabia which focused on plans for a two-state solution to the conflict. Fellow G7 states Germany and Italy were also absent.\n\nBelgium, Luxembourg, Malta, Andorra and San Marino are also due to recognise a Palestinian state, after the UK, Canada, Australia and Portugal announced recognition on Sunday.\n\nInternational pressure is ramping up on Israel over the unfolding humanitarian crisis in Gaza and settlement building in the West Bank.\n\nIsrael has said recognition would reward Hamas for the Palestinian armed groups 7 October 2023 attack on southern Israel in which about 1,200 people were killed and 251 taken hostage.\n\nMore than 65,000 Palestinians have been killed by Israel since, according to Gazas Hamas-run health ministry. Israeli forces are currently carrying out a ground offensive aimed at taking control of Gaza City, where a million people were living and a famine was confirmed last month.\n\nThe French leader told the conference that the time had come to stop the war and free the remaining Israeli hostages held by Hamas. He warned against the peril of endless wars and said right must always prevail over might.\n\nThe international community had failed to build a just and lasting peace in the Middle East, he said, adding that we must do everything in our power to preserve the possibility of a two-state solution that would see Israel and Palestine side by side in peace and security.\n\nSaudi Arabias Foreign Minister Faisal bin Farhan Al Saud also addressed the UN, on behalf of Crown Prince Mohammed bin Salman.\n\nHe reiterated that a two-state solution was the only way to achieve lasting peace in the region.\n\nEuropean Commission President Ursula von der Leyen said the EU would set up a new financial instrument to work on Gazas reconstruction.\n\nWe must all do more, she told the UN General Assembly. This is why we will set up a Palestine Donor Group.\n\nUN secretary general Antonio Guterres referred to the situation in Gaza as morally, legally and politically intolerable and said a two-state solution was the only credible path for peace between Israelis and Palestinians.\n\nPalestinian President Mahmoud Abbas  who was blocked from attending the UN General Assembly in person after the US revoked his and other Palestinian officials visas  addressed the conference via videolink.\n\nHe called for a permanent ceasefire and said Hamas could have no role in governing Gaza, calling for the group to surrender their weapons to the Palestinian Authority (PA).\n\nWhat we want is one unified state without weapons, he said.\n\nAbbas also condemned Hamass 7 October 2023 attack on southern Israel and addressed Israelis, saying: Our future and yours depends on peace. Enough violence and war.\n\nReuters Israel has been bombarding Gaza City as its forces push deeper into the city\n\nMacron said France was ready to contribute to a stabilisation mission in Gaza and called for a transitional administration involving the PA that would oversee the dismantling of Hamas.\n\nHe said France would only open an embassy to a Palestinian state when all the hostages being held by Hamas are released and a ceasefire had been agreed.\n\nIsraels ambassador to the UN, Danny Dannon, spoke to reporters shortly before Macrons announcement.\n\nDannon said a two-state solution was taken off the table after the 7 October attack and called this weeks talks at the UN a charade. He also refused to rule out Israel annexing the occupied West Bank.\n\nPrime Minister Benjamin Netanyahu has insisted there will be no Palestinian state to the west of the River Jordan, and President Isaac Herzog said recognising one would only embolden the forces of darkness.\n\nAhead of Macrons announcement, the Palestinian and Israeli flags were displayed on the Eiffel Tower on Sunday night. A number of town halls in France also flew Palestinian flags on Monday, despite a government order to local prefects to maintain neutrality.\n\nPro-Palestinian protests also took place in some80 towns and cities across Italy, where Giorgia Melonis government said recently it could be counter-productive to recognise a state that did not exist.\n\nIn Germany, the government has said Palestinian statehood is not currently up for debate, and Foreign Minister Johann Wadephul explained as he left for New York on Monday that, For Germany, recognition of a Palestinian state comes more at the end of the process. But this process must begin now.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/09203359/Donald-Trump.png",
            "description": "<p>BBC France has formally recognised a Palestinian state, becoming the latest in a wave of countries to take the step. Speaking at the UN in New York, President Emmanuel Macron said “the time for peace has come” and that “nothing justifies the ongoing war in Gaza”. US President Donald Trump is due to address the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-to-address-un-general-assembly-after-france-recognises-palestinian-state/\">Trump to address UN General Assembly after France recognises Palestinian state</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "23 Sep 2025"
        },
        {
            "title": "Jimmy Kimmel show to return after suspension over Charlie Kirk comments",
            "url": "https://www.newzimbabwe.com/jimmy-kimmel-show-to-return-after-suspension-over-charlie-kirk-comments/",
            "content": "BBC\n\nUS comedian Jimmy Kimmel will return to his late-night talk show on Tuesday after he was suspended for making jokes relating to the death of conservative influencer Charlie Kirk.\n\nDisney, which owns the US broadcast network that airs Jimmy Kimmel Live, said on Monday that it suspended the show because it felt some of the comments were ill-timed and thus insensitive.\n\nWe have spent the last days having thoughtful conversations with Jimmy, and after those conversations, we reached the decision to return the show on Tuesday, Disney said.\n\nThe comics abrupt suspension came after threats by the federal tv regulator to revoke ABCs broadcast licence, sparking nationwide debates over free speech.\n\nUS President Donald Trump had welcomed Kimmels suspension and suggested that some TV networks should havetheir licences taken awayfor negative coverage of the president.\n\nTrump did not address Kimmels reinstatement when a reporter asked about it during a White House event on Monday.\n\nSinclair, the largest ABC affiliate group in the US, said on Monday it will replace Jimmy Kimmel Live! with news programming across its ABC affiliate stations from Tuesday.\n\nDiscussions with ABC are ongoing as we evaluate the shows potential return, it added.\n\nSinclair previously called Kimmels remarks inappropriate and deeply insensitive at a critical moment for our country and said it would not lift the suspension before having formal discussions with ABC.\n\nNexstar Media, one of the biggest owners of TV stations in the US, also said last week it would not air Kimmels show for the foreseeable future. It has not yet commented on Kimmels reinstatement.\n\nCritics and First Amendment advocates railed against ABCs decision last week as censorship and a violation of free speech.\n\nKimmel, who has hosted the late-night programme since 2003 and hosted four Oscars ceremonies, has not yet publicly addressed the suspension or the fallout.\n\nThe row started after Kimmel said in his monologue on 15 September that the Maga gang were desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and trying to score political points from it.\n\nHe also made fun of Trumps reaction to the influencers murder, showing a clip of the president responding to a question about how he was mourning the death by changing the subject to construction of a new White House ballroom.\n\nKimmel compared the response to how a four-year-old mourns a goldfish.\n\nBrendan Carr, the Trump-appointed chair of broadcast regulator theFederal Communications Commission (FCC), threatened to act against ABC and its parent company Disney over Kimmels remarks.\n\nThe spat comes as Vice President JD Vance and other White House allies have been pushing a national campaign to punish anyone who has criticised Kirk in the wake of his death.\n\nHours after Mr Carr made his initial remarks about Kimmels monologue, Nexstar said it would not air Kimmels show for the foreseeable future.\n\nSinclair followed suit and ABC announced that it would indefinitely suspend the programme and demanded an apology from Kimmel, as well as a donation to Kirks non-profit organization Turning Point USA.\n\nMr Carr thanked Nexstar for doing the right thing and said he hoped other broadcasters would follow its lead. Nexstar is currently seeking FCC approval for its planned $6.2bn (4.5bn) merger with Tegna.\n\nAnna Gomez, the sole Democrat on the FCC, said on Monday that she was glad to see Disney find its courage in the face of clear government intimidation.\n\nMs Gomez also thanked Americans across the ideological spectrum who protested this blatant attempt to silence free speech and vowed to combat these efforts to stifle free expression.\n\nABCs decisionto suspend Kimmelwas met with protests in California and lambasted by the writers and actors guilds, lawmakers and the American Civil Liberties Union (ACLU) alike, who argued that the suspension violates free speech rights and spurs a chilling effect.\n\nKimmels late-night colleagues, including Jon Stewart, John Oliver and outgoing CBS host Stephen Colbert, rallied behind him and hundreds of celebrities and Hollywood creativessigned on to a letterbacking Kimmel.\n\nBen Stiller, Jennifer Aniston, Meryl Streep and Robert DeNiro are among those who called Kimmels suspension a dark moment for freedom of speech in our nation.\n\nCritics have also called for the cancellation of Disney+, Hulu and other Disney-owned subscription services to cut into the entertainment conglomerates bottom line over it decision to suspend Kimmel.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/23065414/kimmel.webp",
            "description": "<p>BBC US comedian Jimmy Kimmel will return to his late-night talk show on Tuesday after he was suspended for making jokes relating to the death of conservative influencer Charlie Kirk. Disney, which owns the US broadcast network that airs Jimmy Kimmel Live, said on Monday that it suspended the show because it “felt some of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jimmy-kimmel-show-to-return-after-suspension-over-charlie-kirk-comments/\">Jimmy Kimmel show to return after suspension over Charlie Kirk comments</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "23 Sep 2025"
        },
        {
            "title": "Alabuga Migrant Battalion: In Zimbabwe, mothers left behind narrate ordeal",
            "url": "https://www.newzimbabwe.com/alabuga-migrant-battalion-in-zimbabwe-mothers-left-behind-narrate-ordeal/",
            "content": "In the past six months, a ZAM team in seven African countries has investigated the Russian recruitment exerciseand why so many young Africans take the chance to go, sometimes even after being warned.\n\nLate last year, the world was alerted to the disturbing news that Russia wasrecruitinghundreds of young African women, aged 1822, to manufacture drones in a military-industrial compound called Alabuga, 1,000 km east of Moscow.\n\nReports said that the recruitsfrom at least 15 African countrieswere promised good salaries and skills training, but that once there, they were often trapped, facing tax deductions, dangerous working conditions, strict surveillance, and difficulties returning home.\n\nIn the past six months, a ZAM team in seven African countries has investigated the Russian recruitment exerciseand why so many young Africans take the chance to go, sometimes even after being warned.\n\nHowever, amid the many international reports about recruitment for Alabuga, only one has highlighted the plight of families left behind. Reporting for Deutsche Welle, Garikai Mafirakurevainterviewedworried parents in Zimbabwe in June this year.\n\nAt ZAMs request, he went back to several of them to ask how they are doing now. A senior government official asked me if I wanted my daughter to study in Russia. She is no longer communicating.\n\nRead the three testimonials below.\n\nUlita Semende: We hardly speak these days\n\nI am 47, I live in Harare, and my daughter is 19. She was active in various youth programmes (1), and when she told me she was leaving for Russia, I was not surprised, and I wished her well. My daughter and I are very close, so when she stopped calling, I became very worried about her.\n\nWe hardly speak these days. Whenever she calls via WhatsAppthe last time was in Mayshe sounds like she is in a hurry. I am beginning to believe the stories I hear about the girls manufacturing drones because she is so secretive about her job or her schooling programme.\n\nI received $400 via Western Union in May this year. I dont know where to turn to. I am afraid to approach government officials, because I feel they would say that I am the one who is feeding the media with news.\n\nZimbabwes ruling party, ZANU-PF, organises several workshops and training programmes for loyal youth.\n\nSositina Mukatwa: The government is mum\n\nI am 43 and I live in Chivhu (140 km south of Harare). My girl is 19. When she applied and went to Russia, she never told me about the programme.\n\nThe only thing I remember is that she was running around asking for money from friends and neighbours to process her passport. Thats when I inquired, and she then told me that she wanted to surprise me because she was leaving for Russia.\n\nAt first, I was so happy because I thought this was her opportunity to help me and her two siblings with school fees and the general upkeep.\n\nNow, I am afraid, not knowing if she is fine, because she rarely communicates. She has only called thrice to say she is fine, but I could sense she was not free to talk, as if someone were listening or she had little time on the phone. In fact, we have only talked three times via WhatsApp since she left in 2023.\n\nThe last time we talked, she sounded drunk and hinted to me that she had been laid off and was living with a friend, but when she called me in June, she said she is back at work and sent me $200 via Western Union.\n\nShe doesnt want to talk about her job, her living conditions, or even the school programme. She never said when she is coming back to visit. I am living in fear because the government is mum about the whole programme. I dont know what to do now.\n\nRuzvidzo Masambaasiyana: I feel like I sold my daughter into slavery\n\nI am 55, I live in Harare, and my girl is turning 20 in January next year. I heard of this programme from a friend, a senior government employee, who asked me if I wanted my daughter to study in Russia. So I facilitated the process.\n\nWhen she left for Russia, I felt my connection to those in higher offices had now paid. I was not worried until I read and watched the news saying they are manufacturing drones used in the war against Ukraine.\n\nI tried to talk to her about it when she last called me sometime in April, but she brushed me aside and told me I should not always believe what I watch on TV or read in the newspapers.\n\nI am now worried because she is no longer communicating. She never sent me anything, but I am not worried about her sending me money or not, as long as she is safe.\n\nI approached my friend, the government employee, about the issue, and he joked that I should stop expecting a bridegroom from Russia. He never spoke to me again about the programme, and she is also not talking about it. I no longer trust him. I want my daughter back, but I cant do anything about it. I feel like I sold my daughter into slavery.\n\nAll names have been altered for security purposes.\n\nZAM extends its thanks to Deutsche Welle and Garikai Mafirakureva for their collaboration.\n\nThis article was first published by ZAM Magazinehere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/22173923/Zimbabwe_-_Left_Behind.png",
            "description": "<p>By Garikai Mafirakureva, ZAM Magazine In the past six months, a ZAM team in seven African countries has investigated the Russian recruitment exercise—and why so many young Africans take the chance to go, sometimes even after being warned. Late last year, the world was alerted to the disturbing news that Russia was recruiting hundreds of young African</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/alabuga-migrant-battalion-in-zimbabwe-mothers-left-behind-narrate-ordeal/\">Alabuga Migrant Battalion: In Zimbabwe, mothers left behind narrate ordeal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "23 Sep 2025"
        },
        {
            "title": "EFF files murder case against Operation Dudula, SAPS in Gauteng investigating",
            "url": "https://www.newzimbabwe.com/eff-files-murder-case-against-operation-dudula-saps-in-gauteng-investigating/",
            "content": "IOL\n\nThe Economic Freedom Fighters (EFF) in Gauteng has opened a criminal case against the Operation Dudula movement, accusing the militant group of inciting violence and unlawfully targeting foreign nationals in South Africa.\n\nOn Sunday, Gauteng police spokesperson Lieutenant Colonel Mavela Masondo confirmed to IOL that investigations are underway.\n\nPolice have opened an inquiry docket for investigation. Once the investigation is complete, the docket will be taken to the National Prosecution Authority (NPA) for a decision, said Masondo.\n\nOn Saturday, EFF Gauteng chairperson Nkululeko Dunga led supporters to the Alexandra Police Station, where the case was opened against Operation Dudula. According to the Julius Malema-led party, the case relates to the death of a one-year-old baby who was allegedly denied access to healthcare at a public health facility.\n\nReports indicate that the childs mother, Malawian national Grace Banda, said she and her baby were turned away from the Alexandra Community Health Centre in July. She alleged that members of Operation Dudula blocked her from entering, insisting she could only access the premises after producing a South African identity document. The sick child later died.\n\nDunga told journalists that the childs death amounted to murder. If someone gets sick, and someone dies, and if they could be assisted there and there, it is not only negligence, they knew exactly what they were doing, and they eliminated a life of a one-year-old.\n\nSo, we have opened a case of murder. It is up to the State to pick up and do the necessary investigations. In our minds, someone has passed on and that is a murder case.\n\nEFF Gauteng chairperson Nkululeko Dunga led supporters to the Alexandra Police Station, where the case was opened against Operation Dudula. According to the Julius Malema-led party, the case relates to the death of a one-year-old baby who was allegedly denied access to healthcare at a public health facility. Image: EFF Gauteng/X\n\nThe traumatised childs mother, according to Dunga, is now living in fear. The EFF further claims that several South Africans have also been denied access to healthcare facilities in Gauteng after being presumed to be foreign nationals.\n\nOperation Dudula has frequently clashed with political parties, human rights groups, and foreign governments over its campaigns to remove undocumented migrants from communities, workplaces, and public services. Leaders of the movement argue they are not against all foreign nationals, but specifically undocumented migrants.\n\nZandile Dabula, leader of Operation Dudula Image: Itumeleng English\n\nEarlier this month,IOL reported that Operation Dudula and Zimbabwes ruling party Zanu PF clashed in a war of words after the latter condemned Dudulasstance on foreign nationals accessing healthcare in South Africa.\n\nOperation Dudula leader Zandile Dabula told IOL that South Africa would not be dictated to by outsiders and dismissed Zanu PFs criticism. We will not be dictated to by foreigners on how to run our country. We have the Constitution that is supposed to be guiding us, we have immigration laws that we use as guiding documents, said Dabula.\n\nHer comments were in response to Zanu PFs director of information, Farai Marapira, who told IOL that Operation Dudulas campaign against undocumented migrants was a betrayal of Ubuntu and a continuation of colonial-era tactics of dividing Africans.\n\nNational spokesperson of Zimbabwes ruling party, Zanu PF, Christopher Mutsvangwa (left) with Zanu PF director of information Farai Marapira in Harare. Image: File\n\nBut Dabula fired back, calling his remarks baseless. For Farai (Marapira) to talk about these unfounded allegations, that we are funded by former colonisers, that is definitely not true. How are we going to be funded by the very same people who we are working against? she said.\n\nThey should focus on fixing their country, Zimbabwe. It is the very same former colonisers they chased away in their country, hence they are in problems. They are sitting with land, and they are doing nothing about it. That is why the very same Zimbabweans are fleeing to South Africa, to take up our spaces, not just in South Africa but they are all over the world seeking better life.\n\nDabula further insisted that Zimbabweans were in South Africa in far greater numbers than official estimates suggested, accusing them of placing pressure on jobs, schools, and public services. He also spoke about us having one million Zimbabweans in this country. Thats a lie. There is way more than that. There are millions of Zimbabweans in this country. We are on the ground. We see them, we know where they work, their own businesses, they are in our schools, she said.\n\nMembers of Operation Dudula movement Image: Leon Lestrade\n\nOn the issue of healthcare, Dabula clarified that Operation Dudula was not calling for a blanket denial of treatment to all migrants, but for foreign nationals to pay for the services they use. We are not saying they shouldnt get medical treatment, we are saying they should go to public facilities and pay for it, or rather go to private facilities because these people are working  that is what they always claim, Dabula told IOL.\n\nMarapira had argued earlier that healthcare was a universal human right. Dabula, however, turned her fire on Zanu PFs governance in Zimbabwe and its close ties with the ANC, warning that South Africa risked going down the same path. Zanu-PF is a problem to the people of Zimbabwe. They have been voted out, but they are still continuing to bully people. Their relationship with the ANC is very problematic to us as South Africans because we can see that we are heading to the state where Zimbabwe is at currently, Dabula said.\n\nOperation Dudula, she stressed, is committed to prioritising South Africans, ensuring that foreigners comply with immigration laws and contribute to the services they use.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/22174412/eff-police.webp",
            "description": "<p>IOL The Economic Freedom Fighters (EFF) in Gauteng has opened a criminal case against the Operation Dudula movement, accusing the militant group of inciting violence and unlawfully targeting foreign nationals in South Africa. On Sunday, Gauteng police spokesperson Lieutenant Colonel Mavela Masondo confirmed to IOL that investigations are underway. “Police have opened an inquiry docket</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eff-files-murder-case-against-operation-dudula-saps-in-gauteng-investigating/\">EFF files murder case against Operation Dudula, SAPS in Gauteng investigating</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "23 Sep 2025"
        },
        {
            "title": "Zimbabwe’s plan to host Bafana Bafana clash in Botswana backfires; SA venue back in the frame",
            "url": "https://www.newzimbabwe.com/zimbabwes-plan-to-host-bafana-bafana-clash-in-botswana-backfires-sa-venue-back-in-the-frame/",
            "content": "IOL\n\nZimbabwes plans to stage their 2026 Fifa World Cup qualifier against South Africa in Francistown have been scuppered by the Botswana Football Association (BFA), which confirmed that the Francistown Sports Complex is unavailable.\n\nThe venue will host Botswanas own qualifier against Uganda on 9 October, just a day before the scheduled meeting between the Warriors and Bafana Bafana. That clash of dates contravenes FIFA regulations, which require that visiting teams be given access to match venues the day before a fixture.\n\nThe impasse now points to Zimbabwe relocating their home game to South Africa, with two familiar options in the frame: Orlando Stadium in Johannesburg and Moses Mabhida Stadium in Durban. Both arenas have served as temporary home grounds in previous years when Zimbabwean facilities failed to meet international standards.\n\nReports at the weekend suggested Moses Mabhida was the favoured choice, though no confirmation has come from the South African Football Association, as the final decision rests with the Zimbabwe Football Association (Zifa).\n\nIn the meantime, Zifa has bristled at the BFAs handling of the matter, condemning its public announcement as premature. Spokesperson Mike Madoda said: It is Zifas prerogative to pick a venue that suits our interests. Zimbabwe will always make decisions that are in the interests of the Warriors and Zimbabwean football.\n\nMadoda also rejected speculation that Zifa had been swayed by financial inducements to stage the match in South Africa, dismissing such claims as baseless. He underlined that venue selection remains an internal process, carried out with independence and integrity.\n\nThe dispute underscores the undercurrents of regional rivalry in Southern African football, where off-field logistics often intertwine with long-standing national competition.\n\nFor Zimbabwe, the bigger picture is already clear: their World Cup campaign is over after a torrid run produced only four points from eight matches, leaving them bottom of Group C without a win. The Warriors struggles mark a sobering end to their qualification hopes.\n\nBy contrast, Bafana Bafana are riding high. Coach Hugo Broos has moulded a side that sits atop the group with 17 points, galvanised by cohesion, tactical discipline and growing belief. South Africa are now on the brink of confirming their place at the 2026 finals in the United States, Canada and Mexico.\n\nStill, the fixture between neighbours carries significance beyond mathematics. Zimbabwes captain Knowledge Musona has promised his side will fight for pride: We may not have lived up to our hopes in the tournament, but we want to ensure we leave everything on the pitch against South Africa.\n\nThe clash, whenever and wherever it is finally staged, will serve as both a test of Bafana Bafanas momentum and a chance for Zimbabwe to reassert their footballing pride, ensuring the rivalry burns as fiercely as ever.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10172257/WhatsApp-Image-2024-10-10-at-18.22.36.jpeg",
            "description": "<p>IOL Zimbabwe’s plans to stage their 2026 Fifa World Cup qualifier against South Africa in Francistown have been scuppered by the Botswana Football Association (BFA), which confirmed that the Francistown Sports Complex is unavailable. The venue will host Botswana’s own qualifier against Uganda on 9 October, just a day before the scheduled meeting between the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-plan-to-host-bafana-bafana-clash-in-botswana-backfires-sa-venue-back-in-the-frame/\">Zimbabwe’s plan to host Bafana Bafana clash in Botswana backfires; SA venue back in the frame</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "23 Sep 2025"
        }
    ]
}