{
    "news": [
        {
            "title": "Mugabe’s son Chatunga in court over five assault charges",
            "url": "https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/",
            "content": "By Mary Taruvinga\n\nBellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals.\n\nChatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo.\n\nThe trio were released on US$200 bail each.\n\nThere are five complainants in the case.\n\nIn the first count, the complainant is Ntandoyokuza Nyathi (31).\n\nHe is employed as an external security guard at Ultimate Mine, Mazowe.\n\nAccording to the state, on June 25, at around 1600 hours, the complainant was on duty at Ultimate Mine, Mazowe, where he was guarding the premises with a security dog.\n\nHe was at the boundary of Ultimate Mine and Grace Mugabes Iron Mask farm when the accused persons approached him in pursuit of illegal miners allegedly evading arrest from Iron Mask security guards.\n\nOne of the accused persons fired a shot from an unidentified pistol and the illegal miners escaped. The accused persons charged towards the complainant whom they accused of harbouring illegal miners.\n\nThey altogether assaulted the complainant with open hands and fists before he fell, the court heard.\n\nIt is alleged that the trio stomped on the complainant several times whilst he was lying down.\n\nThey ordered the complainant to carry a sack of gold ore to their premises, where they also took turns to assault him using wooden logs and an iron bar.\n\nThe complainant sustained several injuries and went to report the matter at ZRP Mazowe where he was referred to the hospital for medical treatment and examination.\n\nIn the second count, the complainant in this case is Philip Chipara, employed as an internal security supervisor at Ultimate Mine, Mazowe.\n\nHe was also on duty at Ultimate Mine when he was assaulted.\n\nHe heard a gunshot sound at the boundary of the Ultimate Mine and Iron Mask farm and went to investigate.\n\nUpon arrival, he saw his colleague, Nyathi, who was patrolling with a dog being assaulted with fists, booted feet and a shambock all over the body by the accused persons.\n\nThe complainant enquired as to why they were assaulting their security guard.\n\nThe accused persons charged towards the complainant and started assaulting him with fists and booted feet all over the body, the court heard.\n\nIt is alleged that the three handcuffed Chipara, together with Elvis Bvumbe and later released them.\n\nBvumbe is the other complainant.\n\nChatunga and his bodyguards also assaulted Collen Muchemwa and Waddington Mutadza who were also on duty at the mine.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/17191946/Chatunga.jpeg",
            "description": "<p>By Mary Taruvinga Bellarmine Chatunga Mugabe, son of the late former President Robert Mugabe, appeared before a Concession magistrate facing five counts of assault after he allegedly attacked some security guards, accusing them of harbouring criminals. Chatunga (28) is jointly charged with two other suspects, his bodyguards, Peter Fredson and Tinashe Mupawo. The trio were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabes-son-chatunga-in-court-over-five-assault-charges/\">Mugabe’s son Chatunga in court over five assault charges</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "01 Jul 2025"
        },
        {
            "title": "Zimbabwe pays tribute to Dr Joshua Nkomo as opposition dismisses government’s commemoration as “insincere”",
            "url": "https://www.newzimbabwe.com/zimbabwe-pays-tribute-to-dr-joshua-nkomo-as-opposition-dismisses-governments-commemoration-as-insincere/",
            "content": "By Staff Reporter\n\n1 July remains etched in the hearts of millions of Zimbabweans, 26 years after the passing of Father Zimbabwe and former Vice President Dr Joshua Nkomo. His legacy transcends political divides as the nation unites to honour a man who fought for liberation, only to discover that even freedom did not free his people from the chains of colonialism.\n\nNkomos popularity soared both before and after independence. In the darkest days of the 1980s, he fled the country when then Prime Minister Robert Mugabe deployed North Korean-trained troops known as the Fifth Brigade into parts of Midlands and Matabeleland provinces, killing about 20 000 Ndebele-speaking people and ZAPU supporters.\n\nUnder the pretext of quelling renegades, these forces committed gross atrocities against those seen as aligned with Nkomo. Nkomos statue, erected in Bulawayo, a bronze likeness by North Koreas Mansudae Art Studio, stands at the intersection of Joshua Nkomo Street and 8th Avenue, a testament to his enduring influence.\n\nIn a statement on Tuesday, President Emmerson Mnangagwa, who oversaw those very operations as state security minister then, described Dr Nkomo as a liberator and champion of Pan-Africanism.\n\nMnangagwa praised Nkomo affectionately known as Chibwe Chitedza for enduring imprisonment in places like Gonakudzingwa and for never compromising his spirit.\n\nChibwe Chitedza as Dr Nkomo came to be popularly known, endured imprisonment in notorious camps such as Gonakudzingwa, but the colonial efforts failed to break his spirit. Today, twenty-six years later, Zimbabwe can look back with pride to the life of a liberator, an astute politician, a champion of Pan-Africanism, he said.\n\nMnangagwa lauded Nkomo as a beacon of peace and unity, invoking his commitment to reconciliation and national cohesion.\n\nUmdala wethu and his generation of impeccable revolutionaries always preached peace as the bedrock of nation building. We are using the peace dividend to implement pro-people oriented policies and high impact programmes and projects in our endeavour to deliver decent livelihoods to all citizens in a free democratic Zimbabweans.\n\nZanu-PF politburo member Tendai Chirau echoed this sentiment, acknowledging Nkomos role in the liberation struggle and describing him as a selfless statesman, whose vision remains a benchmark of leadership today.\n\nA visionary who began the fight against colonialism in his youth, Cde Nkomo was a true statesman whose leadership left indelible marks on history. Though he is no longer with us, his legacy endures as a timeless template of selfless leadership, Chirau wrote on his X account on Tuesday.\n\nYet, not all are convinced of Mnangagwas sincerity. Prince Dubekos Sibanda, former MP for Binga North, dismissed the commemoration as hollow.\n\nYour commemoration isnt sincere. You hated him to the bone, he wrote on X.\n\nOther critics described the tribute as crocodile tears, accusing Mnangagwa of hypocrisy in light of past violence against Nkomos supporters.\n\nOne X handle by Mr Matebele wrote: Emmerson and Robert Mugabe tormented this man, funny how today you are remembering him after killing his commanders and people of Matebelelandwhat a disgrace.\n\nOpposition voices, including Gift Ostalos Siziba, former MP for Tshabalala, lauded Nkomo as a revolutionary icon with extraordinary character and unwavering discipline and recalled his enduring words: Zimbabwe will not die, its young people will save it. These, he said, continue to inspire future leaders.\n\nDr Joshua Nkomo was born on 19 June 1917 in Matopo, a coalition builder who co-founded the National Democratic Party in 1960 and later ZAPU.\n\nAfter being jailed by the Rhodesian government in 1964, he returned to lead resistance efforts.\n\nNkomos life remains a symbol of unity and resilience. Zanu PF, in its last annual conference in Bulawayo last year, passed a resolution to pronounce July 1, each year, a public holiday, but it has not been sanctioned by Mnangagwa himself.\n\nDr Nkomo died on 1 July 1999 at Parirenyatwa Hospital in Harare and was interred at the National Heroes Acre in Harare. He was 82.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/29115441/Joshua-Nkomo.jpg",
            "description": "<p>By Staff Reporter 1 July remains etched in the hearts of millions of Zimbabweans, 26 years after the passing of “Father Zimbabwe” and former Vice President Dr Joshua Nkomo. His legacy transcends political divides as the nation unites to honour a man who fought for liberation, only to discover that even freedom did not free</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-pays-tribute-to-dr-joshua-nkomo-as-opposition-dismisses-governments-commemoration-as-insincere/\">Zimbabwe pays tribute to Dr Joshua Nkomo as opposition dismisses government’s commemoration as “insincere”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "01 Jul 2025"
        },
        {
            "title": "Masakadza shines but Zimbabwe face monumental chase",
            "url": "https://www.newzimbabwe.com/masakadza-shines-but-zimbabwe-face-monumental-chase/",
            "content": "Zimbabwe Cricket\n\nWellington Masakadza claimed a career-best four-wicket haul, but Zimbabwe were left clinging to hope after South Africa set a towering fourth-innings target of 537 on day three of the first Test at Queens Sports Club in Bulawayo on Monday.\n\nWiaan Mulders commanding 147 formed the backbone of the visitors second-innings 369, building on their overnight score of 49 for one and a lead of 216.\n\nThe imposing total left Zimbabwe with the daunting task of pulling off the greatest chase in Test history.\n\nWith Blessing Muzarabani unavailable in the morning due to illness, the hosts turned to Tanaka Chivanga and Masakadza to spearhead the attack.\n\nThe day began promisingly for them when Tony de Zorzi, on 22 overnight, edged Chivanga to second slip, where Sean Williams held a sharp, low catch.\n\nMulder, calm and clinical, raced to his fifty with a string of crisp boundaries.\n\nHe then combined with David Bedingham for a brisk 72-run stand that extended South Africas lead beyond 300.\n\nMasakadza broke the partnership, tempting Bedingham, on 35, into a mistimed pull that found Williams at midwicket.\n\nSoon after, debutant Lhuan-dre Pretorius  fortunate to survive several chances in his first-innings hundred  was bowled for four by Vincent Masekesa, ripping one through the gate to clip the top of middle stump.\n\nMasekesa struck again moments later, removing Dewald Brevis for three as the big-hitters wild attempt to clear long-on missed entirely, and the leg-spinner knocked over his stumps to leave South Africa teetering at 155 for five.\n\nBut Mulder stood firm amid the wobble.\n\nHe brought up a well-earned hundred off 149 deliveries with a crisp back-foot drive.\n\nAt lunch, the visitors were 185 for five, leading by 352, with Mulder on 104 and Kyle Verreynne on five.\n\nAfter the break, the pair added 74 before Mulders enterprising stay came to an end.\n\nHe attempted to go aerial against Wessly Madhevere but picked out deep midwicket, where Takudzwanashe Kaitano took a fine catch.\n\nMulders 206-ball innings featured 17 boundaries and two sixes.\n\nMasakadza soon added Verreynne to his tally, drawing an edge off a sharply turning delivery that Ervine pouched at slip, reducing South Africa to 259 for seven.\n\nMaharaj and Corbin Bosch then piled on more frustration for Zimbabwe with a gritty 92-run partnership for the eighth wicket, pushing the lead beyond the 500-run mark.\n\nMuzarabani, now back in action, thought he had Bosch caught behind  only for a no-ball call to spoil the celebration.\n\nBut Bosch didnt last much longer as Masakadza bowled him for 36 after a missed slog-sweep.\n\nMasakadza then removed Maharaj, who danced down the track only to be deceived in flight and turn  the ball crashing into middle stump as South Africa fell to 352 for nine.\n\nMuzarabani wrapped up the innings by bowling Kwena Maphaka for eight, with Codi Yusuf unbeaten on the same score.\n\nMasakadza finished with four for 98, his career-best innings figures in Test cricket, while Masekesa and Chivanga chipped in with two wickets apiece.\n\nSet a colossal 537 for victory, Zimbabwe began cautiously in the final hour.\n\nOpeners Kaitano and Prince Masvaure looked solid  until the very last ball of the day.\n\nJust as the hosts seemed set to survive the session unscathed, Kaitano edged Bosch to second slip, ending a steady 32-run stand.\n\nThey closed on 32 for one, still needing 505 runs with nine wickets in hand.\n\nZimbabwe have passed 500 in an innings six times in Test cricket, most recently in December against Afghanistan at the same venue.\n\nBut their highest fourth-innings total is 331  made in a losing cause against New Zealand in 2001, also in Bulawayo.\n\nTheir most successful chase remains 174, achieved earlier this year against Bangladesh in Sylhet.\n\nThe next best, 162, came back in 1998 against Pakistan.\n\nThe world record fourth-innings chase is 418  set by the West Indies against Australia in 2003.\n\nWith history stacked high against them, Zimbabwe will need to bat with extraordinary discipline, determination and belief to salvage anything from this match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01015801/masakadza.jpg",
            "description": "<p>Zimbabwe Cricket South Africa – 418-9 declared and 369 all out in 82.5 overs (Wiaan Mulder 147, Keshav Maharaj 51, Corbin Bosch 36; Wellington Masakadza 4/98, Tanaka Chivanga 2/76, Vincent Masekesa 2/117) Zimbabwe – 251 and 32-1 in 18.2 overs (Takudzwanashe Kaitano 12, Prince Masvaure 5*; Corbin Bosch 1/1) Wellington Masakadza claimed a career-best four-wicket</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masakadza-shines-but-zimbabwe-face-monumental-chase/\">Masakadza shines but Zimbabwe face monumental chase</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "01 Jul 2025"
        },
        {
            "title": "Ladysmith Black Mambazo honoured with prestigious award",
            "url": "https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/",
            "content": "TshisaLive\n\nLadysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence.\n\nThegroup, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing ofumculo wesintu, South Africas indigenous music.\n\nIn their acceptance speech, the group thanked Ukhozi FM for this recognition.\n\nWe stand humbled and honoured. Ukhozi FM celebrated us for the role weve played in nurturing and growingumculo wesintu our indigenous music. From the hills of Ladysmith to stages around the world, weve carried the sounds of our ancestors with pride,said Sibongiseni Tshabalala, the son of the founder of Ladysmith Black Mambazo,JosephTshabalala.\n\nThank you, Ukhozi FM, for this beautiful recognition.Siyabonga,thank you for walking this journey with us.\n\nThe group were among other notable artists  Nothembi Mkhwebane, Ringo and Makhadzi  who graced the stage with captivating performances.\n\nThis year marks 65 years of Ladysmith Black Mambazo in the music industry and to celebrate the milestone they are undertaking a special tour.\n\nAfter wrapping up their US tour and the first instalment of the national tour in Johannesburg, the group have performances lined up in Durban and Cape Town.\n\nIts such an amazing experience to walk in the footsteps of our father, the founder of the group Joseph Shabalala, and all others who founded the group. I have realised that I have been with the group for more than 30 years now, said Sibongiseni.\n\nThis means the legacy of the group is continuing to grow from glory to glory. In a few years from now we will celebrate 70 years, an incredible milestone in the history of music. We thank South Africans , the continent and the world for supporting us throughout this journey.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01014629/black-mambazo.png",
            "description": "<p>TshisaLive Ladysmith Black Mambazo are beaming with pride after being honoured with a prestigious award by Ukhozi FM at the Ziyakhala Mo Sun City Festival to celebrate 65 years of excellence. The group, known for their distinctive isicathamiya music, were recognised for their contributions to the growth and nurturing of umculo wesintu, South Africa’s indigenous music. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ladysmith-black-mambazo-honoured-with-prestigious-award/\">Ladysmith Black Mambazo honoured with prestigious award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "01 Jul 2025"
        },
        {
            "title": "EJWP backs gender policy to advance equality across Zimbabwe",
            "url": "https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/",
            "content": "By Alois Vinga\n\nTHE Economic Justice for Womens Project (EJWP) says the recently approved gender policy will go a long way inharnessinggender equality nationwide.\n\nCabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and womens empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives.\n\nIt provides a unified structure for monitoring gender equality and addresses systemic inequalities across various sectors of Zimbabwean society.\n\nSpeaking to NewZimbabwe.com this week, EJWP Executive Director, Margaret Mutsamvi, described the enactment of the blueprint as a giant step.\n\nThe recent Cabinets approval of the National Gender Policy (2025) is a significant milestone in Zimbabwes journey toward gender equality and womens empowerment. This development follows EJWPs submission of an urgent petition on 14 March 2025, calling for the renewal of the policy, which had lapsed in 2021  a gap that threatened to reverse hard-earned gains in gender equity, she said.\n\nThe CSO described the new policy as a foundation for a more inclusive, equitable and gender-responsive Zimbabwe, with clearly defined strategies to address systemic barriers across legal, economic, health, education, climate, and digital spheres.\n\nThe new policy, EJWP said, marks a shift from aspiration to action  offering a renewed national mandate to address entrenched gender disparities.\n\nAs EJWP, we remain deeply committed to supporting the full implementation of this policy, particularly around inclusive economic empowerment and accountability in public resource management. We will continue to monitor progress, engage with duty bearers, and amplify the voices of women, especially those in marginalised and economically excluded communities, added Mutsamvi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/27052230/Margaret-Mutsamvi.jpg",
            "description": "<p>By Alois Vinga THE Economic Justice for Women’s Project (EJWP) says the recently approved gender policy will go a long way in harnessing gender equality nationwide. Cabinet recently adopted a new National Gender Policy (2025), which aims to promote gender equality and women’s empowerment by addressing stereotypes and prejudices, institutionalising gender mainstreaming among other positives. It provides</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ejwp-backs-gender-policy-to-advance-equality-across-zimbabwe/\">EJWP backs gender policy to advance equality across Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:46",
            "date": "01 Jul 2025"
        }
    ]
}