{
    "news": [
        {
            "title": "JSC cancels Chitepo Ideology workshop for judges after uproar from lawyers, activists",
            "url": "https://www.newzimbabwe.com/jsc-cancels-chitepo-ideology-workshop-for-judges-after-uproar-from-lawyers-activists/",
            "content": "By Staff Reporter\n\nThe Judicial Service Commission (JSC) has suspended a planned training programme for judges led by Zanu PFs Herbert Chitepo School of Ideology following strong backlash from lawyers and civil society groups, who criticised the move as an attempt to indoctrinate the judiciary.\n\nThe training was being organised by the Presidency and was to feature the principal of Zanu PFs Herbert Chitepo School of Ideology, Ishmael Mada, the CIO director, Fulton Mangwanya, and President Mnangagwas chief secretary, Martin Rushwaya.\n\nIn a memorandum dated 2 July 2025 from the Judiciary Service Commission, Chief Secretary Walter Chikwana announced that the training seminar has been cancelled to allow for the development of content that will ensure the judiciary maintains its independence.\n\nFollowing the initial consultations and continued discussions with OPC on the implementation framework, I wish to inform you that a decision has been taken to cancel the IRBM training with the view of coming up with a programme content administered by the judiciary and suitable to the requirement for Judicial Independence, Chikwana stated.\n\nEarlier, in a statement, the Zimbabwe Catholic Lawyers Guild described the compulsory training of judges on the Chitepo School of Ideology as stripping away the last remaining integrity of the judiciary, after years of it being perceived as a captured institution.\n\nSubjecting judges who must at all times be independent and be seen to be independent to an ideology of one party to the exclusion of others not only compromises the judiciary but attacks its independence and impartiality.\n\nWe note that this is all happening at a time when public confidence in the judiciary is low, given the widely held public perception that the Judiciary is captured by the Executive.\n\nRenowned lawyer Thabani Mpofu has been rallying fellow lawyers and activists to stage a demonstration at the High Court of Zimbabwe tomorrow in protest against the compulsory training of judges.\n\nMpofu on Tuesday posted on his X account, mobilising lawyers and other officers of the court to protest against the erosion of judicial independence, stating that even if Chitepo were alive, he would not have approved the training programme named after him.\n\nAs legal professionals, we must uphold the integrity of the judiciary and ensure its independence. Any attempt to impose partisan ideology on judges through training programmes conducted by the Herbert Chitepo School of Ideology would undermine the rule of law and erode public trust.\n\nI mean, not even Chitepo himself would abase himself to the point of receiving training from this school named after him. We stand in defence of judicial independence, honouring the legacy of those who fought for justice and fairness. In Chitepos name; lets collectively rage against this unnecessary attack on judicial independence, Mpofu said.\n\nThe Chitepo School of Ideology has stirred controversy in the country; last year, there was uproar over Local Government Minister Daniel Garwes invitation to all councillors, including those from the opposition, to attend the workshop in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/04/05165803/Zimbabwe-judges-wigs.jpg",
            "description": "<p>By Staff Reporter The Judicial Service Commission (JSC) has suspended a planned training programme for judges led by Zanu PF’s Herbert Chitepo School of Ideology following strong backlash from lawyers and civil society groups, who criticised the move as an attempt to indoctrinate the judiciary. The training was being organised by the Presidency and was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/jsc-cancels-chitepo-ideology-workshop-for-judges-after-uproar-from-lawyers-activists/\">JSC cancels Chitepo Ideology workshop for judges after uproar from lawyers, activists</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "02 Jul 2025"
        },
        {
            "title": "Chivayo splurges on US$79 million private jet",
            "url": "https://www.newzimbabwe.com/chivayo-splurges-on-us79-million-private-jet/",
            "content": "By Leopold Munhende\n\nCONTROVERSIAL tenderpreneur Wicknell Chivayo has splashed US$79 million on the purchase of one of the worlds most expensive private jets.\n\nPosting on his ever-busy social platforms, which have in the past announced multimillion-dollar donations, vehicle and cash rewards, Chivayo made it a point to highlight that he was not anyones runner.\n\nA runner is a colloquial word used in reference to someone or a businessperson fronting for another. In Chivayos case, he has always been identified as President Emmerson Mnangagwas runner.\n\nChivayos close relations with Mnangagwa, whom he once claimed to have in his palm, have raised suspicions that he gets most of his money via the president.\n\nHis name has been dropped in scandals that involve Zimbabwes elections, procurement of health and other material, plus the sale of gold and other precious minerals across the region.\n\nWonzwa umwe achiti Sir Wicknell ndi Runner. Imikaa makamboona kupi zino rinotenga private jet. Zvishandwa izvii. Zvovengwa ne muroyi chete, said Chivayo.\n\n(You will hear someone say I am a runner. Where have you ever seen a cut that allows you to buy a private jet. This is pure work. Only witches can hate this).\n\nChivayo can be seen stroking a model of the jet, whose price can go as high as US$95 million if it is to be customised.\n\nSpeaking on the video he has shared, Chivayo said he will have WMC 777 printed on its wing and body.\n\nAs of 2024, the base price of the Gulfstream G700 is $79 million, up from the initial $75 million, reads a review of the jet on Simple Flying, a respected aviation publication.\n\nCustomisations can add $5-20 million to the base price, resulting in a final cost between $85-95 million.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08140655/Wicknell-Chivayo.png",
            "description": "<p>By Leopold Munhende CONTROVERSIAL tenderpreneur Wicknell Chivayo has splashed US$79 million on the purchase of one of the world’s most expensive private jets. Posting on his ever-busy social platforms, which have in the past announced multimillion-dollar donations, vehicle and cash rewards, Chivayo made it a point to highlight that he was not anyone’s “runner”. A</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chivayo-splurges-on-us79-million-private-jet/\">Chivayo splurges on US$79 million private jet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "02 Jul 2025"
        },
        {
            "title": "Terrence Dzvukamanja joins Scottland FC",
            "url": "https://www.newzimbabwe.com/terrence-dzvukamanja-joins-scottland-fc/",
            "content": "By Sports Reporter\n\nWarriors forward Terrence Dzvukamanja has become Scottland FCs first mid-season transfer window acquisition.\n\nThe former Orlando Pirates player joins Mabviravira from the defunct SuperSport United which officially sold its top-flight league status.\n\nDzvukamanja has been training with Scottland since last week and is expected to make his debut on Sunday when they play CAPS United at RufaroStadium.\n\nA source told NewZimbabwe.com the 31-year-old striker signed a six-month contract which will see him at the club until December.\n\nThe Warriors forward is marking his return tothe local league since 2018 when he left Ngezi Platinum Stars for Bidvest Wits in South Africa.\n\nHis homecoming marks a reunion with Scottland FC head coach Tonderai Ndiraya whom he once worked with at Ngezi Platinum.\n\nDzvukamanjas addition is part of Ndirayas efforts to solve the goal-scoring crisis at his club.\n\nOf the three strikers that Scottland started the season with, Tymon Machope leads the pack with four goals, while the other two Lynoth Chikuhwa and Sydney Urikhob, have a goal each.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/23170059/Terrence-Dzvukamanja.jpg",
            "description": "<p>By Sports Reporter Warriors forward Terrence Dzvukamanja has become Scottland FC’s first mid-season transfer window acquisition. The former Orlando Pirates player joins Mabviravira from the defunct SuperSport United which officially sold its top-flight league status. Dzvukamanja has been training with Scottland since last week and is expected to make his debut on Sunday when they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/terrence-dzvukamanja-joins-scottland-fc/\">Terrence Dzvukamanja joins Scottland FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "02 Jul 2025"
        },
        {
            "title": "Zimbabwe Independent editor Zaba remanded in custody",
            "url": "https://www.newzimbabwe.com/zimbabwe-independent-editor-zaba-remanded-in-custody/",
            "content": "By Mary Taruvinga\n\nPrivately owned weekly newspaper Zimbabwe Independent editor Faith Zaba has been remanded in custody to this Thursday for her bail hearing.\n\nShe briefly appeared before Harare magistrate Vakayi Chikwekwe, facing charges of undermining the authority of the President.\n\nBail application could not be heard after the State asked for time to verify her medical background.\n\nOn the issue of bail. We request that bail hearing be heard on July 3 at 11.15 am.\n\nThis has been necessitated by the presentation of certain documents which contain the medical history for the accused, which we need to verify before we make our submissions on the application for bail. So we request for the matter to be rolled over to July 3 for bail inquiry, said prosecutor Takudzwa Jambawu.\n\nZabas lawyer, Chris Mhike, said, We are naturally disappointed that the accused must spend another night in custody at a time she is not feeling well.\n\nShe had been on bed rest at the time of her arrest on the orders of her medical doctor. A prison is not the best of places for people who are unwell but your worship you must place on record that the State has not dismissed our submissions on the state of health of the accused.\n\nWe so believe that the request by the State is in the best interests of the accused person.\n\nIt is our hope that such an allowance would enable the state to attend to all the necessary administrative processes.\n\nWe only seek the prosecutions assurance that there will be no further delay on tomorrows proceedings and that the accused will be allowed to receive medical attention while in detention, Mhike said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Mary Taruvinga Privately owned weekly newspaper Zimbabwe Independent editor Faith Zaba has been remanded in custody to this Thursday for her bail hearing. She briefly appeared before Harare magistrate Vakayi Chikwekwe, facing charges of undermining the authority of the President. Bail application could not be heard after the State asked for time to verify</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-independent-editor-zaba-remanded-in-custody/\">Zimbabwe Independent editor Zaba remanded in custody </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "02 Jul 2025"
        },
        {
            "title": "Millions in revenue from billboard advertising, council property rentals diverted for personal use in Chinhoyi, Harare",
            "url": "https://www.newzimbabwe.com/millions-in-revenue-from-billboard-advertising-council-property-rentals-diverted-for-personal-use-in-chinhoyi-harare/",
            "content": "By Anna Chibamu\n\nMillions of US dollars generated from billboard advertising and rentals of council-owned properties are reportedly being siphoned for personal use in Harare and Chinhoyi.\n\nThis was revealed by Public Accounts Parliamentary Portfolio Committee (PAC) chairperson, Charlton Hwende after visiting Makonde RDC in Lions Den on Tuesday.\n\nThe committee is visiting several other local municipalities across the country to discuss a report titled Value for Money for Local Authorities 2023: Management of Revenue Generating Properties by Local Authorities.\n\nThe report, tabled by the Auditor General, examines how local authorities manage revenue collection from properties under local authorities jurisdiction.\n\nSo far, we have visited Harare, yesterday (Monday) we were in Chinhoyi at the local authority.\n\nThere were several issues that were cited in the Value for Money Audit Report for the local authorities by the Auditor General, chief among them was the issue of the revenue leakages in council-rented properties.\n\nWith Chinhoyi, the situation is bad. They are unable to, or even unwilling to collect what is due to council. A number of people are occupying council-rented houses, they are not paying, Hwende said, adding that even though the rentals were as little as $20 for two-bedroom houses, but still, tenants were still not paying.\n\nHe said there was no willingness on the councils part to recover debt.\n\nWe then discovered that most of the council officials are involved in the issuing of leases, and we suspect that most of them are the ones who are actually holding many of the leases.\n\nOn the sample of houses that we visited in Chinhoyi, we went to about five rented commercial properties and discovered that the shops, the licence, the lease that is issued on a tenant, after the lease is issued, there are about five or six other people there that are renting the next one to the next one before you reach the original owner of the lease. And nothing is coming to the council coffers, added Hwende.\n\nOn the billboard issue from Harare to Chinhoyi, it was the same issue, according to the PAC chairperson who revealed that no rentals were being collected from advertisers.\n\nIn the report on billboards, some councils allegedly destroyed or tampered with technology systems to revert to manual work and loot, as a new system installed was no longer allowing them to loot funds.\n\nIt was reported that in one month, US$1 million was collected in one month from billboard rentals of a certain council as the system was still functional but after being vandalised by the council workers, the following month realised not even a dollar.\n\nEvidence also came out that the issue of collusion between councillors and advertising agencies needs to be further investigated.\n\nWe will be recommending the Auditor General to re-look into these issues. Then also, a lack of commercial enterprises that can augment the dwindling revenues from the local authorities.\n\nIts a major concern in Chinhoyi, theres nothing, no initiative, no plans. In Zvimba, the situation was a little bit different, Hwende highlighted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19054327/chinhoyi.jpg",
            "description": "<p>By Anna Chibamu Millions of US dollars generated from billboard advertising and rentals of council-owned properties are reportedly being siphoned for personal use in Harare and Chinhoyi. This was revealed by Public Accounts Parliamentary Portfolio Committee  (PAC) chairperson, Charlton Hwende after visiting Makonde RDC in Lions Den on Tuesday. The committee is visiting several other</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/millions-in-revenue-from-billboard-advertising-council-property-rentals-diverted-for-personal-use-in-chinhoyi-harare/\">Millions in revenue from billboard advertising, council property rentals diverted for personal use in Chinhoyi, Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "02 Jul 2025"
        },
        {
            "title": "Sables Rugby Africa Cup squad named",
            "url": "https://www.newzimbabwe.com/sables-rugby-africa-cup-squad-named/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade has officially announced the Sables squad for the 2025 Rugby Africa Cup, which kicks off in Uganda next week.\n\nThe prestigious continental tournament will run from the 8thto the 19thof July, with all games scheduled to be played at Mandela National Stadiumin Kampala\n\nAs defending champions, Zimbabwe enters the tournament as clear favourites, having lifted the trophy in Kampala last year.\n\nBenade has retained most of the 2024 championship-winning squad while welcoming several influential additions.\n\nSpeedster Matthew McNab, gritty Jason Fraser, and kicking stalwart Lenience Tambwera make their return to the green-and-white hoops, bringing further experience and depth ahead of what could be a history-making campaign.\n\nIf Zimbabwe wins this years Rugby Africa Cup, they will automatically qualify for the 2027 Rugby World Cup, an opportunity which team captain Hilton Mudariki is eyeing.\n\nThis is a golden ticket opportunity for Zimbabwean rugby, but we are not getting ahead of ourselves.\n\nDue to the nature of the Africa Cup, every game is a final.\n\nThe only way to reach the top is by staying grounded, sticking to our systems, and respecting every opponent, said Mudariki.\n\nZimbabwe faces Morocco in their opening match on the 8th of July and the winner will qualify for the semi-final, which will be between the winner of the East African match between hosts Uganda and Kenya.\n\nThe Sables are scheduled to leave the country on Saturday for the tournament and will have two training sessions in Uganda before their opening match.\n\nZIMBABWE SABLES SQUAD  RUGBY AFRICA CUP 2025\n\nHookers\n\nBryan Chiang\n\nSimbarashe Mandioma\n\nLiam Larkan\n\nProps\n\nVictor Mpunga\n\nTyran Fagan\n\nZvikomborero Chimoto\n\nCleopas Kundiona\n\nBrian Makamure\n\nBornwell Gwinji\n\nSecond Row\n\nKudakwashe Nyakufaringwa\n\nSimbarashe Siraha\n\nTadiwanashe Gwashu\n\nBrian Nyaude\n\nBack Row\n\nAiden Burnett\n\nDylan Utete\n\nJason Fraser\n\nGodfrey Muzanargwo\n\nTinotenda Mavesere\n\nHalf Backs\n\nHilton Mudariki (Captain)\n\nKeegan Joubert\n\nIan Prior\n\nLenience Tambwera\n\nTyrone Gombe\n\nCentres\n\nBrandon Mudzekenyedzi\n\nDion Khumalo\n\nKudzai Mashawi\n\nOutside Backs\n\nTrevor Gurwe\n\nMatthew McNab\n\nTapiwa Mafura\n\nTakudzwa Musingwini\n\nEdward Sigauke\n\nTECHNICAL TEAM\n\nHead Coach: Pieter Benade\n\nAssistant Coaches: Ricky Chirengende\n\nConsultant: Gert Smal\n\nDefense Coach: Senna Esterhuizen\n\nForwards & Scrum Coach: Joel Carew\n\nStrength & Conditioning: Ghafoer Luckan\n\nGeneral Manager: Takunda Chifokoyo\n\nTeam Manager: Tichafara Makwanya\n\nTeam Doctor: Dr. Tapfuma Parirenyatwa\n\nTeam Physiotherapists: Shumirai Tererai, Alice Becker\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27175857/rugby-africa.jpg",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s rugby team coach Piet Benade has officially announced the Sables squad for the 2025 Rugby Africa Cup, which kicks off in Uganda next week. The prestigious continental tournament will run from the 8th to the 19th of July, with all games scheduled to be played at Mandela National Stadium in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-rugby-africa-cup-squad-named/\">Sables Rugby Africa Cup squad named</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:35",
            "date": "02 Jul 2025"
        }
    ]
}