{
    "news": [
        {
            "title": "Omnia Holdings increases dividend pay out despite setbacks in agriculture division",
            "url": "https://www.newzimbabwe.com/omnia-holdings-increases-dividend-pay-out-despite-setbacks-in-agriculture-division/",
            "content": "By Business Report\n\nTHE diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends.\n\nOmnia Holdings delivered a resilient performance for the fiscal year ended March 31, 2025 despite set backs in the agriculture division, which was impacted by currency issues in Zimbabwe, drought in Zambia, and the civil unrest in Mozambique.\n\nThe diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends.\n\nThe agri business Zambia, Zimbabwe and Mozambique didnt perform well, Seelan Gobalsamy, CEO of Omnia told Business Report in an interview.\n\nZimbabwe had the usual currency issues and a lot of uncertainty (and) we had some regulatory challenges and in Zambia, we saw a massive drought that impacted revenue.\n\nThe unrest that rocked Mozambique in 2024 and early into this year also affected Omnia. The company had to send products via Namibia into Zambia as routes through Mozambique were disturbed by the unrest, impacting working capital and profits negatively.\n\nWith strong performance from Agriculture RSA and mining segment, Omnias revenues for the year to the end of March grew 2.7% to R22.82 billion. Mining has emerged as Omnias strongest business from an outdoor projective.\n\nThere is still a strong demand for metals, you know, the metals that drive that transition to cleaner energy, you know, the battery metals, uranium. So, we are positively disposed to the mining market, and we are winning new customers, renewing new customers, explained Gobalsamy.\n\nHeadline earnings per share increased by 1% to 704 cents, while operating profit remained unchanged at R1.7bn despite the inclusion of the Chemicals restructuring costs, along with the impact of severe drought conditions and currency depreciation in Agriculture Rest of Africa.\n\nThe Mining segment delivered an improved operating margin of 12.4% from 12.1%, supported by strong performance from Mining RSA and Mining International, as well as higher throughput and efficiencies.\n\nIn the mining sector, sustained demand for critical minerals supporting the global energy transition, underpinned exploration activity and supported positive fundamentals for the explosives market.\n\nHowever, geopolitical tensions and trade policy uncertainty presented ongoing risks.\n\nThe group had a net cash balance of R1.77bn was down from R2.3bn.\n\nThe board declared a total dividend of 675 cents per share for the year. This comprises an increased ordinary dividend of 400 cents, from 375 cents the prior year, and a special dividend of 275 cents per share, returning R1.1bn to shareholders.\n\nDespite persistent macroeconomic headwinds, Omnia delivered sustained profitability and continued to create long-term value for shareholders. This performance reflects the strength, quality, and growing diversity of our portfolio, underpinned by a sharpened focus on manufacturing efficiency, supply chain resilience, and customer-driven innovation, Gobalsamy said\n\nThe increased ordinary dividend payout, and special dividend declared is a clear signal of our confidence in the sustainability of our earnings and the successful execution of our growth and diversification strategy.\n\nLooking ahead, Omnia said the outlook for its Agriculture segment remained positive, driven by expected improvements in agronomic conditions across key regions such as the proprietary Nutriology model.\n\nOmnia said 2026 will be a significant transition year in which non-core assets and business lines will be sold, capital released and returns improved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12055359/omnia_ssb_trucks_.jpeg",
            "description": "<p>By Business Report THE diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends. Omnia Holdings delivered a resilient performance for the fiscal year ended March 31, 2025 despite set backs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/omnia-holdings-increases-dividend-pay-out-despite-setbacks-in-agriculture-division/\">Omnia Holdings increases dividend pay out despite setbacks in agriculture division</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "12 Jun 2025"
        },
        {
            "title": "Passerby bites off builder’s lip for greeting him",
            "url": "https://www.newzimbabwe.com/passerby-bites-off-builders-lip-for-greeting-him/",
            "content": "By Staff Reporter\n\nA MAN from Chirundu in Mashonaland West has appeared in court for biting off another mans lower lip for greeting him.\n\nAccused person, Joel Kwenda was arraigned before the Karoi Magistrates Court facing assault charges.He was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.Prosecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nAccused person, Joel Kwenda was arraigned before the Karoi Magistrates Court facing assault charges.\n\nHe was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.Prosecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nHe was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.\n\nProsecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nProsecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.\n\nThe victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nThe victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.\n\nThe offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nThe offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/12/19043340/Karoi-Mag.jpg",
            "description": "<p>By Staff Reporter  A MAN from Chirundu in Mashonaland West has appeared in court for biting off another man’s lower lip for greeting him. Accused person, Joel Kwenda was arraigned before the Karoi Magistrates’ Court facing assault charges. He was convicted of the crime and sentenced to 18 months imprisonment of which nine months were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/passerby-bites-off-builders-lip-for-greeting-him/\">Passerby bites off builder’s lip for greeting him</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "12 Jun 2025"
        },
        {
            "title": "MPs call for Pit Bull Terrier ban in Zimbabwe, say dog breed has become dangerous to citizens",
            "url": "https://www.newzimbabwe.com/mps-call-for-pit-bull-terrier-ban-in-zimbabwe-say-dog-breed-has-become-dangerous-to-citizens/",
            "content": "By Anna Chibamu\n\nDISTURBED by the deadly Pit Bull Terrier dogs vicious and fatal attack of a Harare resident recently, legislators want the breed banned in Zimbabwe.\n\nThe Pit Bull Terrier, commonly known as Pitbull, is an aggressive type of canine.\n\nMembers of Parliament (MPs) suggested to the Speaker Jacob Mudenda during a Question and Answer session this Wednesday that the dog breed known as Pitbull had become a threat to peoples lives as it is not wired to obey instructions like some of the breeds, hence, it should be banned in the country.\n\nThe call comes barely a fortnight after a man was mauled to death by the terrifying dogs in Bluff Hill, Harare.\n\nZanu PF Goromonzi West MP Biata Beatrice Karimatsenga- Nyamupinga raised concern over the pets-turned-killers.\n\nWhen moving in the bush we fear being killed by wild animals but when we are moving in the residential areas there are dogs such as the Pitbull.\n\nThe Pitbull is killing people. That dog does not listen to instructions from the owner. What is the government policy on the keeping of animals, in particular dogs like the Pitbull?\n\nResponding to the question, Justice Minister Ziyambi Ziyambi, who is also Leader of Government Business in Parliament, said the law, through councils, clearly stated that a dog owner should have a licence.\n\nThat law clearly states the number of dogs which are allowed in each and every household in towns. In other areas there are no dogs which are allowed.\n\nThat is why the individual who kept a Pitbull which killed someone was arrested. The police apprehended him because it was against the law. The Pitbull needs a licence which is different from other types of dogs because it is a very vicious dog, Ziyambi said.\n\nIn her supplementary question, Karimatsenga-Nyamupinga, however, disputed that the licence itself was not enough to stop such deadly attacks seen in the past week.\n\nShe highlighted that the Pitbull loses its memory, hence needs to be outlawed.\n\nYes, the licence can be there but we have that type of dog which loses its memory. What are we trying to say if we are allowing people to keep dogs which lose their memory? What are we trying to say about the lives of people? the MP stated.\n\nZiyambi told Mudenda that her question could only be responded to by the Veterinary Department, adding she should put the question in writing for further investigation from experts.\n\nThe government policy clearly indicates that for someone to keep dogs, they must be given a licence. If we want to go deeper on the types of licence and groups, it really needs to be written down so that we can go and consult the experts.\n\nIt will be easier for each and every individual in this august House and the rest of the country to understand the requirements needed to keep Pitbull dogs, Ziyambi explained.\n\nMudenda ordered the MP to put her question in writing, as it needed further clarification.\n\nChinhoyi MP Leslie Mhangwa added his weight to the conversation.\n\nlf we have somebody who has become a danger to the community, he is put in jail or put somewhere else.\n\nThe Pitbull as a breed has become a danger to the people of Zimbabwe. Is there anything that stops us from banning the breed within the country? I think this is the direction we need to move with.\n\nThe Speaker made a ruling that the question by Karimatsenga-Nyamupinga be put in writing and be dealt with next week.\n\nA Harare man, Samuel Machara was recently killed by Pitbulls owned by Mike Mupinga (40) of Bluff Hill in Harare, who was arrested and charged with culpable homicide.\n\nIn 2022, a Bulawayo man from Selborne suburb was also bitten to death by his own canines.\n\nTwelve countries in Europe, as well as Australia, Canada, some parts of the United States, Ecuador, Malaysia, New Zealand, Puerto Rico, Singapore, and Venezuela, have enacted some form of breed-specific legislation on Pitbull-type dogs, including American Pit Bull Terriers, ranging from outright bans to restrictions and conditions on ownership.\n\nSeveral states in Australia place restrictions on the breed, including mandatory sterilisation. Pitbulls are banned in the United Kingdom, in the Canadian province of Ontario, and in many locations in the United States.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12050529/why-pitbull-dog-is-banned-in-25-countries.png",
            "description": "<p>By Anna Chibamu DISTURBED by the deadly Pit Bull Terrier dogs’ vicious and fatal attack of a Harare resident recently, legislators want the breed banned in Zimbabwe. The Pit Bull Terrier, commonly known as Pitbull, is an aggressive type of canine. Members of Parliament (MPs) suggested to the Speaker Jacob Mudenda during a Question and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mps-call-for-pit-bull-terrier-ban-in-zimbabwe-say-dog-breed-has-become-dangerous-to-citizens/\">MPs call for Pit Bull Terrier ban in Zimbabwe, say dog breed has become dangerous to citizens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "12 Jun 2025"
        },
        {
            "title": "Legislator calls for ministerial statement on UZ lecturers’ strike",
            "url": "https://www.newzimbabwe.com/legislator-calls-for-ministerial-statement-on-uz-lecturers-strike/",
            "content": "By Anna Chibamu\n\nPARLIAMENT has intervened in the ongoing University of Zimbabwe (UZ) lecturers industrial action, which has now clocked its 59thday without a resolution in sight.\n\nA legislator this Tuesday called upon the Higher and Tertiary Education Minister (Fredrick Shava) to urgently deliver a ministerial statement on the strike to the National Assembly.\n\nOn a point of interest, Mpopoma-Mzilikazi MP Charles Moyo requested through the Speaker, Jacob Mudenda, to have the crisis resolved.\n\nStudents and lecturers are not attending lectures. The newly recruited adjunct lecturers drawn from the streets are also not attending lectures. Dissertations are not being supervised, and exams are not being written.\n\nThere were demonstrations from the lecturers, yet other students are to go for work-related learning. It seems this semester is a sheer waste of time to students as well as a loss of parents hard-earned money, Moyo said.\n\nFurther, the MP expressed concern over the chaos at the learning institution.\n\nThere is chaos and uncertainty at our institution. If it pleases you, Hon. Speaker Sir, I request the Hon. Minister of Higher Education, Innovation, Science and Technology Development, to come and give us a ministerial statement on the negotiations, deadlocks, or practical police intervention to bring normalcy to our tertiary institution, Moyo added.\n\nThe Speaker responded, We will advise the Hon. Minister if he can make a Ministerial Statement on the situation.\n\nUZ lecturers are demanding a return to their pre-2018 salaries, where a junior lecturer earned US$2,250 per month. Currently, they earn approximately US$230.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/27161354/UZ-strike-1-scaled.jpg",
            "description": "<p>By Anna Chibamu PARLIAMENT has intervened in the ongoing University of Zimbabwe (UZ) lecturers’ industrial action, which has now clocked its 59th day without a resolution in sight. A legislator this Tuesday called upon the Higher and Tertiary Education Minister (Fredrick Shava) to urgently deliver a ministerial statement on the strike to the National Assembly.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legislator-calls-for-ministerial-statement-on-uz-lecturers-strike/\">Legislator calls for ministerial statement on UZ lecturers’ strike</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:10",
            "date": "12 Jun 2025"
        }
    ]
}