{
    "news": [
        {
            "title": "World Cup Qualifiers: Arubi’s blunder costs Warriors as Zimbabwe draw 2-2 with Benin",
            "url": "https://www.newzimbabwe.com/world-cup-qualifiers-arubis-blunder-costs-warriors-as-zimbabwe-draw-2-2-with-benin/",
            "content": "By Sport Reporter\n\nZimbabwe picked a 2-2 draw against Benin, Thursday, recovering from goalkeeper Washington Arubis mistake, which gifted the Cheetahs an opener.\n\nAt the 12thminute, ageing goalkeeper Arubi failed to control a back pass, losing position to Benin Dokou Dodo, who then assisted the goalscorer Steve Mounie.\n\nBoosted by the opener, Benin gained control of the match and kept on knocking on the back of the net, which they eventually found in the 35thminute through Dokou Dodo, who benefitted from his teams good exchange passes in the box.\n\nThe Warriors fought back, managing to score a consolation goal through captain Marshall Munetsi, who fired in a shot off Jordan Zemuras back-pass in the box.\n\nWith a 2-1 scoreline going into halftime, Warriors coach Michael Nees made a tactical second half substitution with Tawanda Chirewa replacing striker Prince Dube and returning forward Knowledge Musona shifting to play centre forward.\n\nNees move paid off in the 59thminute as Knowledge Musona finished offa Jordan Zemura short pass off a free kick to equalise.\n\nMusona had a chance to put the Warriors upfront 20 minutes after Jordan Zemura delivered another good cross upfront, only to be denied a goal.\n\nNees then made a double substitution in the 83rdminute when Tawanda Maswanhise and Terrence Dzvukamanja came in for Knowledge Musona and Khama Billiat.\n\nAlthough he did not score, Jordan Zemura was the best player on the pitch for Zimbabwe as he completed two assists, which helped Zimbabwe earn the much-valued point.\n\nThursdays result left Zimbabwe sitting bottom of Group C with 3 points, while Benin moved to the top with 8 points.\n\nThe Warriors will be desperate for a win on Tuesday when they face the Super Eagles of Nigeria at Godswill Akpabio stadium in Uyo, Nigeria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sport Reporter Zimbabwe picked a 2-2 draw against Benin, Thursday, recovering from goalkeeper Washington Arubi’s mistake, which gifted the Cheetahs an opener. At the 12th minute, ageing goalkeeper Arubi failed to control a back pass, losing position to Benin Dokou Dodo, who then assisted the goalscorer Steve Mounie. Boosted by the opener, Benin gained</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-cup-qualifiers-arubis-blunder-costs-warriors-as-zimbabwe-draw-2-2-with-benin/\">World Cup Qualifiers: Arubi’s blunder costs Warriors as Zimbabwe draw 2-2 with Benin </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "Kirsty Coventry elected 10th IOC President at 144th IOC Session in Greece",
            "url": "https://www.newzimbabwe.com/kirsty-coventry-elected-10th-ioc-president-at-144th-ioc-session-in-greece/",
            "content": "Kirsty Coventryhas been elected the10th Presidentof theInternational Olympic Committee.\n\nThe 41-year-old Zimbabwean was chosen in asecret ballot of seven candidatesat the 144th IOC Session being held in Costa Navarino, Greece, on Thursday (20 March), for an eight-year term of office.\n\nPresident-elect Coventry replaces outgoing PresidentThomas Bach, who was first elected in 2013 and re-elected in 2021.\n\nShe will be the first woman and the first African to serve as IOC President.\n\nPresident-elect Coventry will assume office after the handover from President Bach on Olympic Day, 23 June. President Bach, who remains in the role until then, will alsoresign as an IOC Memberafter the transfer of power and will then assume therole of Honorary President.\n\nThe President-elect will oversee the Olympic Winter GamesMilano Cortina 2026as her first Olympic Games, with under 11 months to go to the Opening Ceremony.\n\nResults of the election for the 10th IOC President:\n\nHRH Prince Feisal Al Hussein 2David Lappartient 4Johan Eliasch 2Juan Antonio Samaranch 28Kirsty Coventry 49Lord Sebastian Coe 8Morinari Watanabe 4pic.twitter.com/AE3z0vE6r3\n\n IOC MEDIA (@iocmedia)March 20, 2025\n\nPresident-elect Coventry is currently an IOC Member and the Minister of Sport, Art & Recreation in Zimbabwe. She has been the countrys Minister of Sport since 2018. Additionally, she served as a Vice President of the International Surfing Federation from 2017 to 2024.\n\nThe former swimmer was first elected as an IOC Member as a member of the IOC Athletes Commission in 2013 and served in that role until 2021, when she was elected as an individual member.\n\nThe President-elect was elected Chair of the IOC Athletes Commission in 2018, becoming a member of the IOC Executive Board in the process. The 41-year-old was also the IOC Athlete Representative on the World Anti-Doping Agency from 2012-2021 and a member of WADAs Athlete Committee from 2014-2021.\n\nA Harare native, President-elect Coventry competed atfive different Olympic Games. Between her debut at Sydney 2000 and competing for the final time at Rio 2016, she won seven Olympic medals (two gold, four silver, one bronze), taking gold in the 200m backstroke at Athens 2004 and Beijing 2008. No other African athlete has won more Olympic medals.\n\nShe also won three long-course World Championship gold medals and four short-course titles during her career, in addition to a Commonwealth Games gold and 14 African Games golds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>Olympics.com Kirsty Coventry has been elected the 10th President of the International Olympic Committee. The 41-year-old Zimbabwean was chosen in a secret ballot of seven candidates at the 144th IOC Session being held in Costa Navarino, Greece, on Thursday (20 March), for an eight-year term of office. President-elect Coventry replaces outgoing President Thomas Bach, who was first elected in 2013 and re-elected</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kirsty-coventry-elected-10th-ioc-president-at-144th-ioc-session-in-greece/\">Kirsty Coventry elected 10th IOC President at 144th IOC Session in Greece</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "Mama Vee demands retraction from Holy Ten; seeks US$100,000 in damages over homosexuality comments",
            "url": "https://www.newzimbabwe.com/mama-vee-demands-retraction-from-holy-ten-seeks-us100000-in-damages-over-homosexuality-comments/",
            "content": "By Staff Reporter\n\nCOMEDIAN Mama Vee, born Admire Mushambi, has demanded a retraction within 48 hours from Holy Ten and is seeking US$100,000 in damages after the rapper called him a homosexual.\n\nMama Vee, through his legal representative, Sadowera Kuwana said the statements were untrue, malicious and defamatory and had resulted in financial loss.\n\nIn the letter dated March 20, 2025, Kuwana said Holy Ten had on a number of occasions called Mama Vee angochaniwhich translates to homosexual.\n\nOn the 4th of March 2025, on your Instagram page handle @holytenmusic, you published a video where you uttered a statement to the effect that he is a homosexual. To be specific you mentioned in vernacular whilst recording a video that our client is a Ngochani, which translates that our client is a homosexual.\n\nFurthermore, on the 18th of March 2025, you were interviewed by Owen Madondo aka DJ Ollah 7 on the DJ Ollah 7 podcast show.\n\nThe Interview was published to the general public. During the interview, you uttered a statement to the effect that our client is homosexual, had bad influence on young people and for that matter he did not deserve the NAMA awards. You even had the audacity 10 great our client by saying in vernacular (hesi ngochani), when you fortuitously met on a plane on your way to Zimbabwe from South Africa on 10 of March 2025, which encounter, you alluded to during your interview with DJ Ollah 7, reads part of the letter.\n\nMama Vee demanded a retraction issued publicly within 48 hours and US$100,000.00 being damages for defamation.\n\nWe advise that our clients reputation have been damaged pursuant to your false, malicious, reckless and defamatory statements, to the extent that some of the partnerships and brands which he has been working with have since withdrawn their working relationship with him. He has suffered financial loss as a consequence. Our client has also been affected emotionally, if one considers the negative comments that have been passed via several social platforms, added Kuwana.\n\nMeanwhile, musician Mudiwa Hood has also threatened legal action against Holy Ten after he claimed that he brought guns and condoms to Uebert Angels Good News church.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20125651/mama-vee-holy-ten.jpeg",
            "description": "<p>By Staff Reporter COMEDIAN Mama Vee, born Admire Mushambi, has demanded a retraction within 48 hours from Holy Ten and is seeking US$100,000 in damages after the rapper called him a homosexual. Mama Vee, through his legal representative, Sadowera Kuwana said the statements were untrue, malicious and defamatory and had resulted in financial loss. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mama-vee-demands-retraction-from-holy-ten-seeks-us100000-in-damages-over-homosexuality-comments/\">Mama Vee demands retraction from Holy Ten; seeks US$100,000 in damages over homosexuality comments</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "No violent demonstration will ever see the light of day- Govt responds to Geza’s nationwide protest threats",
            "url": "https://www.newzimbabwe.com/no-violent-demonstration-will-ever-see-the-light-of-day-govt-responds-to-gezas-nationwide-protest-threats/",
            "content": "By Thandiwe Garusa\n\nGOVERNMENT has responded to outspoken war veteran Blessed Gezas explosive online address in which he called for a nationwide protest on March 31 and the immediate resignation of President Emmerson Mnangagwa, calling it delusional rumblings and reactionary grandstanding.\n\nGeza, a former Zanu PF Central Committee member and fugitive, reemerged Tuesday night reiterating calls for a protest against Mnangagwa whom he accuses of overseeing and tolerating corruption which has crippled Zimbabwes economy.\n\nInformation Minister Jenfan Muswere on Thursday said law enforcement agents are ready to quash any violent demonstrations and urged Zimbabweans to ignore Gezas calls.\n\nWe would like to assure the nation that no violent demonstration will ever see the light of day. Zimbabweans are encouraged to ignore Gezas delusional rumblings, polemic and reactionary grandstanding is a clear misdirection of ambition, said Muswere.\n\nGeza is a divisionalist and factionalist hell-bent on sowing seeds of division, but all his efforts will not bear fruit.\n\nHe is a fugitive from justice, and it will not be long before his inflammatory statements are dealt with.\n\nThere are currently two distinct factions in the ruling party.\n\nOne loyal to Mnangagwa is advocating for the suspension of the 2028 elections to allow him to remain in power until 2030, and the other, believed to be aligned to Vice President Constantino Chiwenga, is pushing for adherence to the constitutional term limits.\n\nMuswere also dismissed these as speculation, which will not divide the leadership.\n\nLaw enforcement agents are on high alert, ready to deal with anyone attempting to cause despondency within the countrys borders.\n\nNo iota of imagination will create disunity within the leadership, he added.\n\nMeanwhile,Mnangagwa has called himself a constitutionalist who will not remain in power beyond the constitutionally stipulated two terms buthas not publicly rebuked those pushing for his stay.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16100957/Dr-Jenfan-Muswere.png",
            "description": "<p>By Thandiwe Garusa GOVERNMENT has responded to outspoken war veteran Blessed Geza’s explosive online address in which he called for a nationwide protest on March 31 and the immediate resignation of President Emmerson Mnangagwa, calling it “delusional rumblings and reactionary grandstanding”. Geza, a former Zanu PF Central Committee member and fugitive, reemerged Tuesday night reiterating</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-violent-demonstration-will-ever-see-the-light-of-day-govt-responds-to-gezas-nationwide-protest-threats/\">No violent demonstration will ever see the light of day- Govt responds to Geza’s nationwide protest threats</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "World Cup Qualifiers: Mnangagwa dangles US$300k winning bonus to Warriors ahead of Benin, Nigeria matches",
            "url": "https://www.newzimbabwe.com/world-cup-qualifiers-mnangagwa-dangles-us300k-winning-bonus-to-warriors-ahead-of-benin-nigeria-matches/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwa has offered US$300,000 to the Zimbabwe mens football team should they defeat Benin and Nigeria in the FIFA 2026 World Cup Qualifiers.\n\nZimbabwe will face Benin on Thursday at their adopted home in Durban and Nigeria on Tuesday, March 25 in Uyo.\n\nThe two fixtures are crucial for the Warriors as they look to revive their slim chances of qualifying for the World Cup, which will be held in the United States, Canada, and Mexico next year.\n\nIn a statement, the Zimbabwe Football Association (ZIFA) said Mnangagwa has pledged US$150,000 for each victory.\n\nThe Government of Zimbabwe has reaffirmed its commitment to national football by extending significant financial support to the Zimbabwe senior mens national team, the Warriors, ahead of their crucial FIFA World Cup qualifiers.\n\nIn recognition of the teams efforts and as a gesture of encouragement, His Excellency, President Emmerson D. Mnangagwa, has offered a winning bonus of US$150 000 to the players, technical team and support staff, for each victory in their upcoming matches against Benin on March 20 and Nigeria on March 25, the statement reads.\n\nMichael Nees side currently sits at the bottom of the six-team Group C with two points from four matches.\n\nZimbabwe need to win all their remaining matches to secure qualification for the World Cup. The winner of each group qualifies, with the runner-up given another chance in a further qualification round.\n\nZIFA said the winning bonus is a pat on the back from the government and reflects its desire to see the development of football, despite the team playing in a foreign land due to a lack of suitable facilities in the country.\n\nThis support underscores the Governments unwavering commitment to the growth and success of football in Zimbabwe and the aspirations of the Warriors as they strive for World Cup qualification. The nation is urged to rally behind the team, as they carry our hopes and pride onto the field, the statement continued.\n\nMnangagwas pledge comes after the government allocated US$1 million in the 2025 budget for the Africa Cup of Nations (AFCON), which will be held in Morocco in December.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20102500/warriors-training.jpeg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa has offered US$300,000 to the Zimbabwe men’s football team should they defeat Benin and Nigeria in the FIFA 2026 World Cup Qualifiers. Zimbabwe will face Benin on Thursday at their adopted home in Durban and Nigeria on Tuesday, March 25 in Uyo. The two fixtures are crucial for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-cup-qualifiers-mnangagwa-dangles-us300k-winning-bonus-to-warriors-ahead-of-benin-nigeria-matches/\">World Cup Qualifiers: Mnangagwa dangles US$300k winning bonus to Warriors ahead of Benin, Nigeria matches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "Slain police detective’s family give police seven-day ultimatum to explain how she died in shootout",
            "url": "https://www.newzimbabwe.com/slain-police-detectives-family-give-police-seven-day-ultimatum-to-explain-how-she-died-in-shootout/",
            "content": "By Staff Reporter\n\nTHE family of slain police detective Cassandra Hove, who was fatally shot in a shoot-out while pursuing armed robbers in Bulawayo, is demanding an explanation on what transpired on the fateful day.\n\nThe 38-year-old police officer was initially said to have been shot by an armed robber before the script was changed to say she was killed by friendly fire. A colleague has since confessed to accidentally shooting her, and has appeared in court.\n\nHoves family engaged the Zimbabwe Lawyers for Human Rights (ZLHR), who confirmed they are helping the bereaved family get justice for their slain daughter.\n\nWe are assisting the family of Detective Constable Cassandra Hove, a slain ZRP officer, who died recently while reportedly pursuing armed robbers, which is protesting against the clandestine and unprofessional manner in which the death of the police officer is being handled, the ZLHR posted on social media.\n\nCassandras father, Chikauriso Hove, has engaged the services of lawyers from ZLHR, who on Wednesday wrote a letter of complaint to the Officer-In-Charge at ZRP Bulawayo Central Police and gave the law enforcement agency a seven-day ultimatum to furnish him with tangible details of circumstances, which caused and led to the death of his daughter.\n\nThe letter was also served tothe Officer-In-Charge at Pumula Police Station, the Officer Commanding Bulawayo Province, ZRP Commissioner-General Stephen Mutamba and Home Affairs Minister Kazembe Kazembe.\n\nIn the letter, Hove protested the unprofessional manner in which ZRP handled the death of his daughter.\n\nHove said he is aggrieved and pained by the conduct of ZRP, her deceased daughters employer, that she served diligently and dearly with her life, which had a duty to protect her, but was not forthcoming with sharing information to the family surrounding the circumstances which led to Cassandras death, which should help the grieving family to find closure, the lawyers said.\n\nThe family, Hove said, is disturbed by the fact that family members seem to be getting second-hand information and late updates on Cassandras matter through unofficial channels and just recently, it came to their attention that a certain police officer had confessed to killing their daughter.\n\nHove said Cassandras family is greatly concerned about the allegations that she may have met her fate at the hands of one of her colleagues.\n\nIn addition, Hove said Cassandras family is alarmed at the allegations raised about the conduct of one Lethokuhle Sibanda, who later on was known to be a colleague of the deceased law enforcement agent operating in the same unit with the late police officer, and who had reportedly completed some forms authorising the carrying out of a post-mortem on the body of the deceased person without consulting his family.\n\nHove also stated that his family had been advised that sometime after Cassandra had been shot, the same Sibanda had visited the deceased persons residence, where she found the late law enforcement agents children and demanded certain information pertaining to her residential properties and demanded her mobile phones, but her children refused to comply after getting guidance from their relatives.\n\nCassandras father also complained that Sibanda had received R3,000 from the residents of Luveve suburb in Bulawayo as contribution to the deceased law enforcement agents funeral, but the money was never remitted to the family, conduct which the family is concerned about.\n\nHove added that his family had also received information that a suspect, named Fikile Ncube, had been arrested by ZRP officers on the night when Cassandra died in connection with her death, but this information was not officially communicated to the family or his relatives.\n\nOn 8 March 2025, Hove said he attended a meeting together with his relatives with the Officer-In-Charge of CID Homicide in Bulawayo and other ZRP officials, where he was informed that the preliminary findings were that his daughter had been shot by a police issued firearm contrary to what the family had been told before and efforts to get full information as to what could have happened to his daughter were futile as the ZRP officials were not forthcoming.\n\nHove said Cassandras family had, after much deliberation, reluctantly agreed to take her body for burial in Mberengwa, with the hope that ZRP would keep updating them on the progress of investigations surrounding her death.\n\nAfter Cassandras burial, Hove said, the family reported a case of murder at ZRP Pumula Police Station on March 13, 2025, and police went mum.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20075222/Cassandra-Hove-680x380-1.jpg",
            "description": "<p>By Staff Reporter THE family of slain police detective Cassandra Hove, who was fatally shot in a shoot-out while pursuing armed robbers in Bulawayo, is demanding an explanation on what transpired on the fateful day. The 38-year-old police officer was initially said to have been shot by an armed robber before the script was changed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/slain-police-detectives-family-give-police-seven-day-ultimatum-to-explain-how-she-died-in-shootout/\">Slain police detective’s family give police seven-day ultimatum to explain how she died in shootout</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "Supreme Court clears lawyer Rubaya of wrongdoing in gold theft case",
            "url": "https://www.newzimbabwe.com/supreme-court-clears-lawyer-rubaya-of-wrongdoing-in-gold-theft-case/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has acquitted Harare lawyer, Admire Rubaya, who was accused of gold theft, ruling that the lower courts misdirected when they trashed his application excepting to the charges.\n\nRubaya was accused of theft after he successfully represented one Jefat Chaganda before a Plumtree magistrate Timeon Makunde.\n\nChaganda was accused of gold smuggling and after winning the case, the State was ordered to return his gold which they had forfeited.\n\nUnhappy with the victory, the State went on to arrest Rubaya, the magistrate, the prosecutor and the investigating officer in the case.\n\nThe four were charged with theft, a charge which they challenged since the outline did not show that a crime was committed.\n\nThrough his lawyers, Rubaya complained about victimization, stating that it was wrong for the State to prosecute him for doing his job as a legal professional.\n\nHe accused the State of violating the attorney-client privilege.\n\nRubaya was represented by Advocate Thabani Mpofu who was taking instructions from Tymon Tabana and Oliver Marwa.\n\nThe lawyers said, Legal professional privilege is an established principle of our law that goes to the root of a fair trial as entrenched by section 69 of the Constitution.\n\nRubaya was alternatively charged with obstruction of justice.\n\nThe lawyers mounted an application for exception, which the High Court dismissed before they took the decision up for review by the Supreme Court.\n\nThe arguments pushed the State into making concessions.\n\nAs a result Supreme Court accepted Rubayas arguments and cleared him of wrongdoing.\n\nBefore the Supreme Court, the lawyers pointed out that the High Court judge made concessions that the charge against Rubaya was defective but still allowed the matter to proceed which they described as a misdirection.\n\nThere can be no doubt that the court a quo was not satisfied that a valid charge existed. It is that finding which appellant wanted it to make and to pronounce itself on its effect. By our law, an accused person cannot be expected to go through a trial where no valid charge exists. That is an irregularity, he argued.\n\nMpofus argued that the acquittal of Chaganda by the magistrate had nothing to do with his client and whether the decision was correct or not could not be attributed to him.\n\nHe also argued that the decision by the magistrate is still standing, which made it valid and had they had an issue, it would have been overturned.\n\nIn the instant case, what is revealed is that appellant (Rubaya) represented an accused person who was acquitted, and that the court acquitting the appellants client also ordered the release of the gold.\n\nWhether or not it was competent for the Learned Magistrate to make such an order is irrelevant, as the conduct of the Magistrate is not imputable to the appellant and no basis has been alleged for taking that position, Mpofu argued.\n\nA three-panel bench comprising Justices George Chiweshe, Chinembiri Bhunu and Hlekani Mwayera found favour with Rubayas arguments and cleared him of wrongdoing. The judges also acquitted magistrate Makunde.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20080958/rubaya-e1742458217257.jpeg",
            "description": "<p>By Mary Taruvinga The Supreme Court has acquitted Harare lawyer, Admire Rubaya, who was accused of gold theft, ruling that the lower courts misdirected when they trashed his application excepting to the charges. Rubaya was accused of theft after he successfully represented one Jefat Chaganda before a Plumtree magistrate Timeon Makunde. Chaganda was accused of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-clears-lawyer-rubaya-of-wrongdoing-in-gold-theft-case/\">Supreme Court clears lawyer Rubaya of wrongdoing in gold theft case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "City of Harare staffer in court over botched US$120k stand deal",
            "url": "https://www.newzimbabwe.com/city-of-harare-staffer-in-court-over-botched-us120k-stand-deal/",
            "content": "By Staff Reporter\n\nA CITY of Harare staffer has been dragged to court on allegations of swindling a home seeker of US$120,000 in a botched stand deal.\n\nAccused person, Charles Sigauke (51) appeared before Harare Magistrate Marehwanazvo Gofa, who freed him on US$500 bail.\n\nThe State case is that on April 27, 2024, Sigauke and Josphat Chidamoyo connived to sell a stand in Greystone Park, Harare, measuring 4,000 square metres.\n\nAgreed facts are that the complainant, Edelite Muzavazi, expressed her desire to buy the property and on May 9, 2024, she and the accused person went for an inspection.\n\nIt was further heard in court that on May 11, 2024, Sigauke and the complainant signed an agreement of sale for the stand valued at US$150,000.\n\nMuzavazi paid a deposit of US$100,000. The balance was supposed to be paid in instalments over six months.\n\nOn June 26, 2024, the complainant paid US$26,000 and made an attempt to transfer the stands cession from Sigaukes name to hers, but hit a brick wall. She then approached the council over the issue.\n\nComplainant also tried to reach out to Sigauke but he became evasive.\n\nThe complainant then made a police report, and investigations established that Sigauke was issued with an offer letter for the stand in April 2019 but failed to pay for it.\n\nThe complainant was fleeced of US$120,000, and nothing was recovered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25025158/Harare-Town-House.png",
            "description": "<p>By Staff Reporter A CITY of Harare staffer has been dragged to court on allegations of swindling a home seeker of US$120,000 in a botched stand deal. Accused person, Charles Sigauke (51) appeared before Harare Magistrate Marehwanazvo Gofa, who freed him on US$500 bail. The State case is that on April 27, 2024, Sigauke and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/city-of-harare-staffer-in-court-over-botched-us120k-stand-deal/\">City of Harare staffer in court over botched US$120k stand deal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "We will not let you turn Zimbabwe into a shell- Geza warns Tagwirei",
            "url": "https://www.newzimbabwe.com/we-will-not-let-you-turn-zimbabwe-into-a-shell-geza-warns-tagwirei/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas ally, Kudakwashe Tagwirei, has come under fire from war veterans, with Blessed Bombshell Geza accusing him of monopolising key sectors of the economy for corrupt activities.\n\nThe controversial businessman has not been spared in the internal battles within the ruling party, as he faces allegations of using his proximity to Mnangagwa to entrench corruption by acquiring key government projects.\n\nGeza warned Tagwirei that the war veterans are coming for him, accusing him of collaborating with the government to run down the country.\n\nTagwirei, we are warning you, together with your colleagues. We did not go to war so that you could monopolise corrupt contracts. We are going to deal with you decisivelymark my wordsand thoroughly. By the time Mnangagwa leaves power, Zimbabwe will be a shell, and this is totally unacceptable. We cannot accept that, said Geza.\n\nTagwirei, through his proxies, has been securing government contracts. He won a multimillion-dollar deal to construct the Mbudzi Interchange flyover. He has also expanded his business interests into mining and has a near-monopoly in the fuel sector.\n\nAdditionally, Tagwirei has been spearheading the Command Agriculture programme and is currently the chairperson of the Land Tenure Implementation Committee.\n\nThe business moguls company, Sakunda Holdings, was implicated in the disappearance of $3 billion from the Ministry of Agriculture between 2017 and 2018.\n\nAs a result, Tagwirei was sanctioned by the United States of America, which accused him of assisting senior government officials in corruption.\n\nGeza stated that corruption has become rampant under Mnangagwas administration due to cronyism.\n\nCorruption in Mnangagwas government has become a cancer in this country. Mnangagwa has continued to deploy his cronies to milk this country dry.\n\nWe fought for economic emancipation and the equitable distribution of resources. But, on the contrary, Mnangagwa is stopping at nothing to take everything away from the country, said Geza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa’s ally, Kudakwashe Tagwirei, has come under fire from war veterans, with Blessed “Bombshell” Geza accusing him of monopolising key sectors of the economy for corrupt activities. The controversial businessman has not been spared in the internal battles within the ruling party, as he faces allegations of using his proximity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-will-not-let-you-turn-zimbabwe-into-a-shell-geza-warns-tagwirei/\">We will not let you turn Zimbabwe into a shell- Geza warns Tagwirei </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        },
        {
            "title": "AfCFTA-ACX conference to scale up intra-continental trade",
            "url": "https://www.newzimbabwe.com/afcfta-acx-conference-to-scale-up-intra-continental-trade/",
            "content": "By Alois Vinga\n\nPREPARATIONS are underway for the upcoming AfCFTA Association of Commodity Exchanges (A-ACX) Annual Conference, set to take place later this month, with organisers revealing that all is now in place.\n\nThe organiser, Zimbabwe Mercantile Exchange (ZMX), said a high-powered delegation from the AfCFTA, led by the Head of Market Access, Directorate of Trade in Goods and Competition, AfCFTA Secretariat Joyce Letswalo, will grace the prestigious event.\n\nOther key presenters include Ghana Commodity Exchange CEO Tucci Ivowi, global expert in commodity trade and finance Adam Gross, ZIDA CEO Tafadzwa Chinamo, Johannesburg Securities Exchange (JSE) head of commodities in the capital markets division Anelisa Matutu, commodities and derivatives markets expert Dr Bharat Kulkarni and ZMX CEO Collen Tapfumaneyi.\n\nThe theme for this years conference, Scaling Intra-African Trade: Leveraging Commodity Exchanges for Economic Resilience and Growth highlights the role of commodity exchanges in strengthening regional trade and advancing the objectives of the African Continental Free Trade Area (AfCFTA), explained ZMX.\n\nDelegates from all over the continent have already registered to attend, reflecting the growing interest in the discussions surrounding trade harmonization, investment opportunities, supply chain development, and policy frameworks to unlock Africas trade potential.\n\nThe conference will serve as a vital platform for networking, business linkages, and strategic collaborations among policymakers, financial and logistics experts, and international organizations, added ZMX.\n\nThe Minister of Lands, Agriculture, Fisheries, Water and Rural Development, Dr. Anxious J. Masuka, will be the guest speaker at the conference.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/13082417/zmxpost-01.png",
            "description": "<p>By Alois Vinga   PREPARATIONS are underway for the upcoming AfCFTA Association of Commodity Exchanges (A-ACX) Annual Conference, set to take place later this month, with organisers revealing that all is now in place. The organiser, Zimbabwe Mercantile Exchange (ZMX), said a high-powered delegation from the AfCFTA, led by the Head of Market Access, Directorate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afcfta-acx-conference-to-scale-up-intra-continental-trade/\">AfCFTA-ACX conference to scale up intra-continental trade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "20 Mar 2025"
        }
    ]
}