{
    "news": [
        {
            "title": "New twist to Mpofu, Chimombe fraud case as former Agric Perm Sec gives evidence",
            "url": "https://www.newzimbabwe.com/new-twist-to-mpofu-chimombe-fraud-case-as-former-agric-perm-sec-gives-evidence/",
            "content": "By Staff Reporter\n\nThe case in which businessmen Moses Mpofu and Mike Chimombe are accused of defrauding the government of US$7 million in a botched presidential goats scheme Monday took a new twist after former Permanent Secretary in the Ministry of Agriculture John Basera acknowledged that they only partly failed to meet the contractual agreement.\n\nBasera was being cross-examined by Mpofus lawyer, Advocate Tapson Dzvetero, when he confirmed that the duos company, Blackdeck, had managed to meet their first-year target of a five five-year deal.\n\nBasera told High Court judge Justice Pisirayi Kwenda that Blackdeck supplied 3,595 goats against 3,113, which was written in their agreement.\n\nThe former permanent secretary also confirmed that the company had unforeseen challenges in mobilising the goats locally.\n\nWe had green, red and buffer zones because of Foot and Mouth Disease. If I remember well, we had made a recommendation of not transporting goats from one province to another province, but to do intra-province distributions because of Foot and Mouth Disease, he said.\n\nBasera confirmed that when the Agriculture Ministry asked Blackdeck to supply 500 goats for a launch project in Chipinge, the company delivered.\n\nDzvetero also asked him to confirm that there were also other incidents where the company wrote to the company to supply the goats for other launches, and he said this was correct.\n\nThe court heard that the ministry was supposed to call the guarantor or go for arbitration in cases of conflicts as outlined in the agreement but the ministry did not do so.\n\nBasera said wthat when he left the ministry, plans were being made to call the guarantor.\n\nThe court also heard that the ministry instead went on to request the supply of more goats under the presidential goat pass on scheme despite the conflict which arose.\n\nThe state alleges Blackdeck submitted fraudulent documents to win the US$87 million deal.\n\nIt is alleged that the two were given an advance payment of US$7 million, which they failed to account for, and they both deny the charges.\n\nTrial continues Tuesday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03215456/WhatsApp-Image-2024-10-03-at-12.49.46.jpeg",
            "description": "<p>By Staff Reporter The case in which businessmen Moses Mpofu and Mike Chimombe are accused of defrauding the government of US$7 million in a botched presidential goats scheme Monday took a new twist after former Permanent Secretary in the Ministry of Agriculture John Basera acknowledged that they only partly failed to meet the contractual agreement.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-twist-to-mpofu-chimombe-fraud-case-as-former-agric-perm-sec-gives-evidence/\">New twist to Mpofu, Chimombe fraud case as former Agric Perm Sec gives evidence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        },
        {
            "title": "LATEST: UK shock over sudden death of popular DJ and events promoter",
            "url": "https://www.newzimbabwe.com/latest-uk-shock-over-sudden-death-of-popular-dj-and-events-promoter/",
            "content": "By UK Correspondent\n\nTHE Zimbabwean community in the United Kingdom was left in shock Monday following the sudden death of popular entertainer and events promoter, DJ Kay Cie.\n\nThe DJ, real name Kudzaishe Chipadza, was reportedly found dead at a Birmigham hotel on Monday morning.\n\nChipadza had been one of the leading names in the UK-Zimbabwe showbiz industry since 2008.\n\nHe was recently the MC at the annual SAMA Festival which was held in Leicester.\n\nShowbiz colleagues expressed their sadness with DJ Mel saying, Sad day in the music industry. RIP bro#kaycee\n\nAnother colleague King Alfred said, Just woke up to hear this sad news.We have lost one of us in this music industry Rest in bro till meet again.\n\nMC Sebhelebhe was eqally shocked noting that, We spoke on Sunday mwana wamai vangu and you said mukoma Sebhelebhe get well soon ko now whats this bro. Wabirira game bro. Rest in peaceKay Cie. Number 1 Mc.\n\nMore to follow .\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02134531/DJ-Kay-Cie.png",
            "description": "<p>By UK Correspondent THE Zimbabwean community in the United Kingdom was left in shock Monday following the sudden death of popular entertainer and events promoter, DJ Kay Cie. The DJ, real name Kudzaishe Chipadza, was reportedly found dead at a Birmigham hotel on Monday morning. Chipadza had been one of the leading names in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/latest-uk-shock-over-sudden-death-of-popular-dj-and-events-promoter/\">LATEST: UK shock over sudden death of popular DJ and events promoter</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        },
        {
            "title": "SPCA says pitbull’s owner neglected his dogs",
            "url": "https://www.newzimbabwe.com/spca-says-pitbulls-owner-neglected-his-dogs/",
            "content": "By Staff Reporter\n\nThe Zimbabwe National Society for the Prevention of Cruelty to Animals (SPCA), has in its initial assessment of the fatal pitbull attack on Samuel Machara, stated that the owner of the dogs showed negligence and poor management of the dangerous breeds he kept at his property, which was enclosed by a half-length perimeter wall.\n\nThe owner of the dogs, Mike Mupinga, was arrested Sunday and charged with culpable homicide.\n\nIn a statement issued after the incident, the SPCA said that Mupingas failure to properly care for and handle his dogs led them to develop aggressive behaviours, making them dangerous.\n\nThe organisation has since removed all the dogs from the property and confirmed that they were euthanised.\n\nInitial assessment indicates clear evidence of neglect, confinement, and poor socialization of the animals involved. Such conditions are known to severely affect canine behaviour and are especially dangerous when present in certain breeds, particularly those already classified as high risk or dangerous, the SPCA said.\n\nThe SPCA further warned the public against crossbreeding dangerous dog breeds, explaining that such animals require specialised handling skills that many owners may lack, potentially leading to tragic outcomes.\n\nWe strongly caution the public against the ownership, breeding, and cross-breeding of dangerous dog breeds. These animals require specialised handling, socialization and containment responsibilities that, if neglected, can result in tragic consequences such as these, the SPCA added.\n\nThe organisation urgedthe public to approach its offices for assistance with appropriate animal care, advice, or if they wish to surrender their animals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/01174941/pitbull-e1748796599291.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe National Society for the Prevention of Cruelty to Animals (SPCA), has in its initial assessment of the fatal pitbull attack on Samuel Machara, stated that the owner of the dogs showed negligence and poor management of the dangerous breeds he kept at his property, which was enclosed by a half-length</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spca-says-pitbulls-owner-neglected-his-dogs/\">SPCA says pitbull’s owner neglected his dogs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        },
        {
            "title": "More than 700 believed dead in devastating Nigeria floods",
            "url": "https://www.newzimbabwe.com/more-than-700-believed-dead-in-devastating-nigeria-floods/",
            "content": "BBC\n\nThe official death toll after deadly floods hit the Nigerian town of Mokwa on Thursday has risen to more than 200, officials say.\n\nAnother 500 people are still missing in the town in the central Niger State however, local official Musa Kimboku told the BBC that rescue efforts had ceased because authorities no longer believe anyone could still be found alive.\n\nThe floods, said to be worst in the area for 60 years, swept through the Mokwa districts of Tiffin Maza and Anguwan Hausawa after torrential rains.\n\nIn an effort to prevent disease in the area, authorities will soon start to dig out corpses buried underground, Mokwas district head Muhammadu Aliyu said.\n\nRecounting scenes of catastrophe, local residents told the BBC that they saw their homes and family members get washed away.\n\nOne man, Adamu Yusuf, lost his wife and newborn baby.\n\nI watched helplessly as water washed away my family. I survived because I could swim, he told the BBC.\n\nAnother resident, Saliu Sulaiman, said the floods had left him homeless and destroyed some of his cash business profits.\n\nI lost at least $1,500 to the floods. It was the proceeds from the sale of my farm produce the previous day. I contemplated going back into the room to get it, but the pressure of the water scared me.\n\nSome local residents have said that the flooding was so devastating because a nearby dam had burst, however the authorities have not confirmed this.\n\nOn Sunday, the National Emergency Management Agency (Nema) announced it had started the process of providing relief packages to people affected.\n\nThe agencyadded in a post on Facebookthat roads and bridges were also affected by the flood, which has had a knock-on effect on the local economy and traffic.\n\nThe Nigerian Red Cross alsoreleased a statement on Fridaysaying the floods had caused significant loss of life and widespread distress.\n\nFloods are not uncommon during the Nigerian rainy season, which lasts from April until October.\n\nIn 2024, Nigeria experienced flooding from heavy rain which caused deaths and drove people from their homes.\n\nThere was also severe flooding in 2022, when more than 600 people died and 1.3 million were displaced.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02123931/nigeria-floods.webp",
            "description": "<p>BBC The official death toll after deadly floods hit the Nigerian town of Mokwa on Thursday has risen to more than 200, officials say. Another 500 people are still missing in the town in the central Niger State however, local official Musa Kimboku told the BBC that rescue efforts had ceased because authorities no longer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-than-700-believed-dead-in-devastating-nigeria-floods/\">More than 700 believed dead in devastating Nigeria floods</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        },
        {
            "title": "Nonku Williams bids farewell to ‘The Real Housewives of Durban’: no reunion, no return, just peace",
            "url": "https://www.newzimbabwe.com/nonku-williams-bids-farewell-to-the-real-housewives-of-durban-no-reunion-no-return-just-peace/",
            "content": "IOL\n\nNonku Williamshas chosen to break free from the TheReal Housewives Of Durban reality TV show, citing that the series pits women against each other in the pursuit of relentless drama.\n\nWilliams recently issued an official statement where she outlined various reasons for her decision to exit the franchise and not be a part of the season 5 reunion.\n\nWatching myself on screen, I am confronted with a reality thats hard to accept. The woman I see isnt someone I recognised or respect, wrote the shows OG.\n\nWilliams continued to share that although shes played a role in shaping the shows narrative, she believes shes also a product of the shows dynamics.\n\nThe relentlesspursuit of drama, the pitting women against each other, the gossip and the put-downs -its a toxic cycle that wears me down.\n\nShe explained that she wants to be a better role model to her children and uphold her responsibility to herself, her faith, her children, and her community.\n\nI want to make a difference, to leave a positive mark on the world. But this show, with its destructive tendencies, isnt the platform for that. Ive come to realise that I have a responsibility to myself to prioritise my well-being, to protect my mental health, and to surround myself with positivity.\n\nI have a responsibility to the community to be a force for good, to uplift and inspire others, and to make a positive impact  Im choosing to break free from this cycle.\n\nShe aims to now use her platform to spread love, kindness and positivity.\n\nAs I close this chapter, I hope my story can serve as a testament to the power of self-awareness, courage and redemption, she ended.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/02123459/Screenshot-2025-06-02-at-13.34.03.png",
            "description": "<p>IOL Nonku Williams has chosen to “break free” from the “The Real Housewives Of Durban” reality TV show, citing that the series pits women against each other in the pursuit of relentless drama. Williams recently issued an official statement where she outlined various reasons for her decision to exit the franchise and not be a part of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nonku-williams-bids-farewell-to-the-real-housewives-of-durban-no-reunion-no-return-just-peace/\">Nonku Williams bids farewell to ‘The Real Housewives of Durban’: no reunion, no return, just peace</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        },
        {
            "title": "Mom kills toddler, says child’s father failing to support upkeep",
            "url": "https://www.newzimbabwe.com/mom-kills-toddler-says-childs-father-failing-to-support-upkeep/",
            "content": "By Staff Reporter\n\nPOLICE in Matebeleland North have arrested a 29-year-old woman over the alleged murder of her daughter citing the childs fathers neglect.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.On May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred in Seafield Estate village on May 28, 2025.The suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.He added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred in Seafield Estate village on May 28, 2025.The suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.He added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nOn May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred in Seafield Estate village on May 28, 2025.\n\nThe suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.He added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nThe suspect allegedly strangled her one-year-seven-month-old daughter, Shylet Sibanda, citing that the father was not financially supporting the child, said Nyathi.\n\nHe added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.In another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nHe added that the case was initially reported as a sudden death, but the crime came to light after a post-mortem report exposed that the death was due to mechanical asphyxia and strangulation.\n\nIn another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\nIn another case, police in Tshabalala arrested Artwell Ndlovu (32) in connection with a murder case in which he allegedly stabbed his brother, Abbie Ndlovu (40), all over the body with a sharp object on May 28, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12224313/Murder.jpg",
            "description": "<p>By Staff Reporter  POLICE in Matebeleland North have arrested a 29-year-old woman over the alleged murder of her daughter citing the child’s father’s neglect. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “On May 30, 2025, police in Nyamandlovu arrested Simangaliso Dube (29) in connection with a murder case which occurred</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mom-kills-toddler-says-childs-father-failing-to-support-upkeep/\">Mom kills toddler, says child’s father failing to support upkeep </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        },
        {
            "title": "Money heist: Harare man loses US$280,000 in burglary",
            "url": "https://www.newzimbabwe.com/money-heist-harare-man-loses-us280000-in-burglary/",
            "content": "By Staff Reporter\n\nMORE than a quarter of a million United States dollars was stolen Friday in Harares Madokero suburb in a brazen burglary that highlights the high levels of criminality that now afflicts the nation.\n\nThe unidentified victim had US$280,000 cash stashed in his wardrobe instead of the bank.Zimbabwe Republic (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the burglary and theft.The ZRP is investigating a case of unlawful entry into premises and theft that occurred in Madokero, Harare, on May 30, 2025.A 39-year-old man lost US$ 280,000 in cash after an unknown suspect broke into his house and stole a small bag containing the money, which was in the wardrobe in his bedroom, said Nyathi.\n\nThe unidentified victim had US$280,000 cash stashed in his wardrobe instead of the bank.\n\nZimbabwe Republic (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the burglary and theft.The ZRP is investigating a case of unlawful entry into premises and theft that occurred in Madokero, Harare, on May 30, 2025.A 39-year-old man lost US$ 280,000 in cash after an unknown suspect broke into his house and stole a small bag containing the money, which was in the wardrobe in his bedroom, said Nyathi.\n\nZimbabwe Republic (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the burglary and theft.\n\nThe ZRP is investigating a case of unlawful entry into premises and theft that occurred in Madokero, Harare, on May 30, 2025.A 39-year-old man lost US$ 280,000 in cash after an unknown suspect broke into his house and stole a small bag containing the money, which was in the wardrobe in his bedroom, said Nyathi.\n\nThe ZRP is investigating a case of unlawful entry into premises and theft that occurred in Madokero, Harare, on May 30, 2025.\n\nA 39-year-old man lost US$ 280,000 in cash after an unknown suspect broke into his house and stole a small bag containing the money, which was in the wardrobe in his bedroom, said Nyathi.\n\nA 39-year-old man lost US$ 280,000 in cash after an unknown suspect broke into his house and stole a small bag containing the money, which was in the wardrobe in his bedroom, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/13042445/US-Dollars.jpg",
            "description": "<p>By Staff Reporter  MORE than a quarter of a million United States dollars was stolen Friday in Harare’s Madokero suburb in a brazen burglary that highlights the high levels of criminality that now afflicts the nation. The unidentified victim had US$280,000 cash stashed in his wardrobe instead of the bank. Zimbabwe Republic (ZRP) national spokesperson,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/money-heist-harare-man-loses-us280000-in-burglary/\">Money heist: Harare man loses US$280,000 in burglary</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:45",
            "date": "03 Jun 2025"
        }
    ]
}