{
    "news": [
        {
            "title": "UZ students give authorities 24-hour ultimatum to postpone exams, threaten campus shutdown",
            "url": "https://www.newzimbabwe.com/uz-students-give-authorities-24-hour-ultimatum-to-postpone-exams-threaten-campus-shutdown/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe National Students Union (ZINASU) has given a days ultimatum to the University of Zimbabwe (UZ)s administration to postpone all examinations until striking lecturers resume duty.\n\nThe learners have threatened a total shutdown of the institution starting May 12 if their demands are not met.UZ lecturers announced a job action last month and have staged demonstrations at the learning institution over paltry salaries and poor working conditions.The lecturers are demanding a return to their pre-2018 salaries when a junior lecturer earned US$2,250. Currently, they earn US$230.In a statement Friday, ZINASU demanded the postponement of all exams, provision of academic support, and a public commitment by the university to negotiate in good faith with striking lecturers.We demand that these conditions be met and publicly communicated to the student body no later than Saturday 10 May, at 23:59 hours. Failure to comply with these reasonable demands will leave us with no alternative but to initiate a total shutdown of the university beginning Monday 12 May, 08:00AM.This action will continue indefinitely until our demands are met in full. We warn the administration that any attempt to intimidate, victimize, or discipline students for exercising their right to peacefully protest will be met with fierce resistance. We will not be silenced or deterred, the letter reads.Meanwhile, a rival students body, the Zimbabwe Congress of Students Union (ZICOSU) also acknowledged the negative impact of ongoing lecturers strike and said it is engaging the administration to allow prepared students to sit for exams, while supporting postponements for those whose studies have been disrupted.As ZICOSU we recognise the challenges posed by recent disruptions. We have actively engaged with the administration to ensure that students attending lectures and fulfilling coursework requirements can proceed with their exams.We understand that those affected by the strike may require postponements, as exams cannot be undertaken without completed coursework, reads a statement from ZICOSU.Over a week ago, President Emmerson Mnangagwas spokesperson, George Charamba assured the lecturers that government would address their grievances, but the Association of University Teachers (AUT) says there has been no engagement from the UZ authorities or parent ministry.\n\nThe learners have threatened a total shutdown of the institution starting May 12 if their demands are not met.\n\nUZ lecturers announced a job action last month and have staged demonstrations at the learning institution over paltry salaries and poor working conditions.\n\nThe lecturers are demanding a return to their pre-2018 salaries when a junior lecturer earned US$2,250. Currently, they earn US$230.\n\nIn a statement Friday, ZINASU demanded the postponement of all exams, provision of academic support, and a public commitment by the university to negotiate in good faith with striking lecturers.\n\nWe demand that these conditions be met and publicly communicated to the student body no later than Saturday 10 May, at 23:59 hours. Failure to comply with these reasonable demands will leave us with no alternative but to initiate a total shutdown of the university beginning Monday 12 May, 08:00AM.\n\nThis action will continue indefinitely until our demands are met in full. We warn the administration that any attempt to intimidate, victimize, or discipline students for exercising their right to peacefully protest will be met with fierce resistance. We will not be silenced or deterred, the letter reads.\n\nMeanwhile, a rival students body, the Zimbabwe Congress of Students Union (ZICOSU) also acknowledged the negative impact of ongoing lecturers strike and said it is engaging the administration to allow prepared students to sit for exams, while supporting postponements for those whose studies have been disrupted.\n\nAs ZICOSU we recognise the challenges posed by recent disruptions. We have actively engaged with the administration to ensure that students attending lectures and fulfilling coursework requirements can proceed with their exams.\n\nWe understand that those affected by the strike may require postponements, as exams cannot be undertaken without completed coursework, reads a statement from ZICOSU.\n\nOver a week ago, President Emmerson Mnangagwas spokesperson, George Charamba assured the lecturers that government would address their grievances, but the Association of University Teachers (AUT) says there has been no engagement from the UZ authorities or parent ministry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe National Students Union (ZINASU) has given a day’s ultimatum to the University of Zimbabwe (UZ)’s administration to postpone all examinations until striking lecturers resume duty. The learners have threatened a total shutdown of the institution starting May 12 if their demands are not met. UZ lecturers announced a job action</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-students-give-authorities-24-hour-ultimatum-to-postpone-exams-threaten-campus-shutdown/\">UZ students give authorities 24-hour ultimatum to postpone exams, threaten campus shutdown</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "‘We are now here, do not import steel’— DISCO Chief Executive tells Zimbabwean industry",
            "url": "https://www.newzimbabwe.com/we-are-now-here-do-not-import-steel-disco-chief-executive-tells-zimbabwean-industry/",
            "content": "By Leopold Munhende\n\nDINSON Iron and Steel Company (DISCO) Chief Executive Officer (CEO) Takana Xu has urged local industry not to import steel but rather take advantage of their presence.\n\nTanaka, who spoke to journalists during a media tour recently, said the Ministry of Industry and Commerce had shared with them that millions, that could be kept locally, were being used to import steel each year.\n\nDISCO, valued at over US$1.5 billion, is one of Africas biggest steel manufacturing plants, which is being constructed by global industry leader Tsingshan Holding Group of China. Production has already started in earnest with pig iron and steel billets now available.\n\nThe Ministry of Industry gave us a figure that last year and the past few years we had spent so many US dollars to import steel which I think has a very significant impact on import substitution, said Tanaka.\n\nWe are producing quality steel locally. Steel is now available here, do not import. There is no need to import that which is produced locally.\n\nWhat we are producing is proper steel, not recycled stuff from Mbare. It can sustain any mega project or high-rise building.\n\nDISCO, which sits on the site of a proposed smart city in Mvuma, also owns DINSON Colliery in Hwange and a ferrochrome plant in Selous, Afrochine Smelting.\n\nDuring the media tour, Tanaka indicated his willingness to work with small-to-medium chrome miners and suppliers whom he said were key to their operations.\n\nThe miners were represented by officials from Masvingo, Mashonaland East, Mashonaland West, Midlands and Harare provinces of the Zimbabwe Miners Federation (ZMF).\n\nThe Manhize plant has already reached 90% capitalisation and expects to produce five million tonnes at its final stage.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/31043116/manhize.webp",
            "description": "<p>By Leopold Munhende  DINSON Iron and Steel Company (DISCO) Chief Executive Officer (CEO) Takana Xu has urged local industry not to import steel but rather take advantage of their presence. Tanaka, who spoke to journalists during a media tour recently, said the Ministry of Industry and Commerce had shared with them that millions, that could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-are-now-here-do-not-import-steel-disco-chief-executive-tells-zimbabwean-industry/\">‘We are now here, do not import steel’— DISCO Chief Executive tells Zimbabwean industry </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Kwekwe United suspends head coach Saul Chaminuka and his assistant",
            "url": "https://www.newzimbabwe.com/kwekwe-united-suspends-head-coach-saul-chaminuka-and-his-assistant/",
            "content": "By Sports Reporter\n\nKWEKWE United has suspended team head coach Saul Chaminuka citing poor performance.\n\nChaminuka has been suspended together with assistant coach Clemence Zuze.\n\nThe duos suspension was confirmed the club on Friday afternoon via a press statement.\n\nWe confirm the suspension of our head Coach Saul Chaminuka and first assistant Clement Zuze due to issues related to non-performance.\n\nThe team will be led by Beknown Mhlaingena in the interim, read part of the statement.\n\nKwekwe United has been making headlines for the wrong reasons since its promotion to the topflight league early this year.\n\nOn Thursday, the club dragged Chaminuka to the police on allegations of match fixing.\n\nLast month, the team failed to show up for its home match against Herentals at Bata Stadium in Gweru as players were protesting for outstanding salaries and sign-on fees.\n\nThe club has admitted a financial crisis but pledged to find way to remain afloat.\n\nIndeed, like many clubs in the league we have faced financial challenges, but I canassure you that the club is working tirelessly behind the scenes to source funding and attract strategic partners, who can assist in stabilising and strengthening our operations.\n\nWe remain committed to transparency and sustainability. In terms of targets, we are taking it one game at a time.\n\nThe focus is on consistent performance without putting the team under undue pressure, further read the statement.\n\nKwekwe United is currently occupying position 17 on the log with seven points, two ahead of bottom place occupier Triangle United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Sports Reporter KWEKWE United has suspended team head coach Saul Chaminuka citing poor performance. Chaminuka has been suspended together with assistant coach Clemence Zuze. The duo’s suspension was confirmed the club on Friday afternoon via a press statement. “We confirm the suspension of our head Coach Saul Chaminuka and first assistant Clement Zuze due</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwekwe-united-suspends-head-coach-saul-chaminuka-and-his-assistant/\">Kwekwe United suspends head coach Saul Chaminuka and his assistant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Malaria outbreaks hit Zimbabwe, records rise in related deaths in 2025",
            "url": "https://www.newzimbabwe.com/malaria-outbreaks-hit-zimbabwe-records-rise-in-related-deaths-in-2025/",
            "content": "By Staff Reporter\n\nZIMBABWE has recorded a rise in malaria cases and related deaths in the year 2025, the Ministry of Health and Child Care has confirmed.\n\nThe Health ministry has reported an alarming 180% increase in cumulative malaria cases, soaring from 21,309 in 2024 to 59,647 this year, with deaths attributed to malaria having risen sharply 218% from 45 in 2024 to 143 in 2025.\n\nIn a statement, the ministry said the combinations of environmental factors such as high rainfall and temperatures have increased breading spaces for mosquitoes.\n\nThis increase is being driven by a combination of environmental and behavioural factors, Increased rainfall, humidity, and temperatures have created favourable conditions for mosquito breeding.\n\nAt the same time, more people are engaging in outdoor activities such as artisanal mining, farming, tobacco curing, and cross-border trading, particularly during dusk to dawn when mosquitoes are most active.\n\nMany of these activities take place in remote areas where access to health services is limited, leading to delays in treatment and an increase in fatalities, reads the statement.Three provinces with high artisanal mining and agriculture activities have been mostly affected with the ministry only managing to control 23 cases out of 115 this year.The number of reported malaria outbreaks has jumped from just one in 2024 to 115 in 2025. Out of these, only 23 have been brought under control. The majority of outbreaks have been reported in provinces with high levels of artisanal mining and agricultural activities.Mashonaland Central, Manicaland, and Mashonaland West are the most affected provinces, contributing a combined 82.8% of all cases and 72.9% of all deaths. Children under the age of five account for 14% of the total malaria cases, reads the statement.The ministry has put in place several measures to combat the malaria outbreak, including the free distribution of essential malaria prevention tools such as Insecticide Treated Nets (ITNs), larvicides, diagnostic kits, and treatment medications.The Ministry of Health and Child Care has taken a number of steps to address the outbreakprovincial and district health teams have intensified community mobilisation and awareness campaigns to encourage early treatment and the use of mosquito prevention methods.A total of 1,615,000 ITNs are being distributed in 14 high-risk districts, although there is a shortfall of 600,000 nets due to the withdrawal of funding from the United States government.The government remains committed to closing this gap through increased domestic financing. Larvicides are being applied to breeding sites where available, although supply remains limited, the statement further noted.The ministry also indicated that there are enough stocks of medicines and diagnostics kits for malaria, urging the public to get tested when they experience unusual fever conditions within 24 hours.The country currently has adequate stocks of malaria medicines and diagnostic kits. These were prepositioned ahead of the peak transmission period through NatPharm in collaboration with Provincial Medical Directors.All suspected malaria cases are tested and, if positive, treated appropriately. Efforts are also ongoing to work with the Ministry of Mines and Mining Development to better reach artisanal mining populations, who are highly mobile and often difficult to access.Despite these efforts, challenges remain. Climate change continues to expand the mosquito breeding season and increase the vector population. Artisanal mining activities are increasing. and with them, the number of breeding sites and the population exposed during peak mosquito biting hours. Many of these communities remain difficult to reach and are hesitant to engage with health authorities.The Ministry reminds the public that this is the high malaria transmission period. Anyone experiencing malaria symptoms such as fever, chills, sweating, headaches, joint pain, nausea, vomiting, or diarrhoea is urged to seek testing and treatment within 24 hours from their nearest health facility or village health worker, said the ministry.\n\nMany of these activities take place in remote areas where access to health services is limited, leading to delays in treatment and an increase in fatalities, reads the statement.\n\nThree provinces with high artisanal mining and agriculture activities have been mostly affected with the ministry only managing to control 23 cases out of 115 this year.\n\nThe number of reported malaria outbreaks has jumped from just one in 2024 to 115 in 2025. Out of these, only 23 have been brought under control. The majority of outbreaks have been reported in provinces with high levels of artisanal mining and agricultural activities.\n\nMashonaland Central, Manicaland, and Mashonaland West are the most affected provinces, contributing a combined 82.8% of all cases and 72.9% of all deaths. Children under the age of five account for 14% of the total malaria cases, reads the statement.\n\nThe ministry has put in place several measures to combat the malaria outbreak, including the free distribution of essential malaria prevention tools such as Insecticide Treated Nets (ITNs), larvicides, diagnostic kits, and treatment medications.\n\nThe Ministry of Health and Child Care has taken a number of steps to address the outbreakprovincial and district health teams have intensified community mobilisation and awareness campaigns to encourage early treatment and the use of mosquito prevention methods.\n\nA total of 1,615,000 ITNs are being distributed in 14 high-risk districts, although there is a shortfall of 600,000 nets due to the withdrawal of funding from the United States government.\n\nThe government remains committed to closing this gap through increased domestic financing. Larvicides are being applied to breeding sites where available, although supply remains limited, the statement further noted.The ministry also indicated that there are enough stocks of medicines and diagnostics kits for malaria, urging the public to get tested when they experience unusual fever conditions within 24 hours.The country currently has adequate stocks of malaria medicines and diagnostic kits. These were prepositioned ahead of the peak transmission period through NatPharm in collaboration with Provincial Medical Directors.All suspected malaria cases are tested and, if positive, treated appropriately. Efforts are also ongoing to work with the Ministry of Mines and Mining Development to better reach artisanal mining populations, who are highly mobile and often difficult to access.Despite these efforts, challenges remain. Climate change continues to expand the mosquito breeding season and increase the vector population. Artisanal mining activities are increasing. and with them, the number of breeding sites and the population exposed during peak mosquito biting hours. Many of these communities remain difficult to reach and are hesitant to engage with health authorities.The Ministry reminds the public that this is the high malaria transmission period. Anyone experiencing malaria symptoms such as fever, chills, sweating, headaches, joint pain, nausea, vomiting, or diarrhoea is urged to seek testing and treatment within 24 hours from their nearest health facility or village health worker, said the ministry.\n\nThe government remains committed to closing this gap through increased domestic financing. Larvicides are being applied to breeding sites where available, although supply remains limited, the statement further noted.\n\nThe ministry also indicated that there are enough stocks of medicines and diagnostics kits for malaria, urging the public to get tested when they experience unusual fever conditions within 24 hours.\n\nThe country currently has adequate stocks of malaria medicines and diagnostic kits. These were prepositioned ahead of the peak transmission period through NatPharm in collaboration with Provincial Medical Directors.\n\nAll suspected malaria cases are tested and, if positive, treated appropriately. Efforts are also ongoing to work with the Ministry of Mines and Mining Development to better reach artisanal mining populations, who are highly mobile and often difficult to access.Despite these efforts, challenges remain. Climate change continues to expand the mosquito breeding season and increase the vector population. Artisanal mining activities are increasing. and with them, the number of breeding sites and the population exposed during peak mosquito biting hours. Many of these communities remain difficult to reach and are hesitant to engage with health authorities.The Ministry reminds the public that this is the high malaria transmission period. Anyone experiencing malaria symptoms such as fever, chills, sweating, headaches, joint pain, nausea, vomiting, or diarrhoea is urged to seek testing and treatment within 24 hours from their nearest health facility or village health worker, said the ministry.\n\nAll suspected malaria cases are tested and, if positive, treated appropriately. Efforts are also ongoing to work with the Ministry of Mines and Mining Development to better reach artisanal mining populations, who are highly mobile and often difficult to access.\n\nDespite these efforts, challenges remain. Climate change continues to expand the mosquito breeding season and increase the vector population. Artisanal mining activities are increasing. and with them, the number of breeding sites and the population exposed during peak mosquito biting hours. Many of these communities remain difficult to reach and are hesitant to engage with health authorities.\n\nThe Ministry reminds the public that this is the high malaria transmission period. Anyone experiencing malaria symptoms such as fever, chills, sweating, headaches, joint pain, nausea, vomiting, or diarrhoea is urged to seek testing and treatment within 24 hours from their nearest health facility or village health worker, said the ministry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/23184924/Malaria-mosquito.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE has recorded a rise in malaria cases and related deaths in the year 2025, the Ministry of Health and Child Care has confirmed. The Health ministry has reported an alarming 180% increase in cumulative malaria cases, soaring from 21,309 in 2024 to 59,647 this year, with deaths attributed to malaria having</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malaria-outbreaks-hit-zimbabwe-records-rise-in-related-deaths-in-2025/\">Malaria outbreaks hit Zimbabwe, records rise in related deaths in 2025</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Grocery chain OK Zimbabwe’s majority shareholders back $30 million rights issue, CEO says",
            "url": "https://www.newzimbabwe.com/grocery-chain-ok-zimbabwes-majority-shareholders-back-30-million-rights-issue-ceo-says/",
            "content": "By Reuters\n\nGROCERY retailer OK Zimbabwe Ltds (OKZ.ZI), opens new tab majority shareholders have agreed to back a $30 million rights issue to cover a funding gap and stabilise the companys financial position, its chief executive said.\n\nMost of the top five shareholders have indicated interest in following their rights, CEO Willard Zireva told Reuters on Wednesday.Earlier this month, the company announced a capital-raising plan including a rights issue, the private placement of shares, and debt instruments to strengthen its balance sheet, liquidity, and support a strategic turnaround plan.It rehired Zireva as CEO earlier this year to lead the turnaround after he retired more than seven years ago. Previously, also as CEO, he had led the group through Zimbabwes tumultuous hyperinflation era of 2008.OK Zimbabwe has been facing competition from smaller businesses amid their rapid growth. The surge in the informal, or grey, economy in the southern African country has spawned more price-competitive retailers, known as tuck shops, threatening the viability of more established formal retailers.The company said last month it owed $30.34 million to suppliers, which it was struggling to service. It has shut down five of its outlets this year and struggled to stock several others.The companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\nMost of the top five shareholders have indicated interest in following their rights, CEO Willard Zireva told Reuters on Wednesday.\n\nEarlier this month, the company announced a capital-raising plan including a rights issue, the private placement of shares, and debt instruments to strengthen its balance sheet, liquidity, and support a strategic turnaround plan.It rehired Zireva as CEO earlier this year to lead the turnaround after he retired more than seven years ago. Previously, also as CEO, he had led the group through Zimbabwes tumultuous hyperinflation era of 2008.OK Zimbabwe has been facing competition from smaller businesses amid their rapid growth. The surge in the informal, or grey, economy in the southern African country has spawned more price-competitive retailers, known as tuck shops, threatening the viability of more established formal retailers.The company said last month it owed $30.34 million to suppliers, which it was struggling to service. It has shut down five of its outlets this year and struggled to stock several others.The companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\nEarlier this month, the company announced a capital-raising plan including a rights issue, the private placement of shares, and debt instruments to strengthen its balance sheet, liquidity, and support a strategic turnaround plan.\n\nIt rehired Zireva as CEO earlier this year to lead the turnaround after he retired more than seven years ago. Previously, also as CEO, he had led the group through Zimbabwes tumultuous hyperinflation era of 2008.OK Zimbabwe has been facing competition from smaller businesses amid their rapid growth. The surge in the informal, or grey, economy in the southern African country has spawned more price-competitive retailers, known as tuck shops, threatening the viability of more established formal retailers.The company said last month it owed $30.34 million to suppliers, which it was struggling to service. It has shut down five of its outlets this year and struggled to stock several others.The companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\nIt rehired Zireva as CEO earlier this year to lead the turnaround after he retired more than seven years ago. Previously, also as CEO, he had led the group through Zimbabwes tumultuous hyperinflation era of 2008.\n\nOK Zimbabwe has been facing competition from smaller businesses amid their rapid growth. The surge in the informal, or grey, economy in the southern African country has spawned more price-competitive retailers, known as tuck shops, threatening the viability of more established formal retailers.The company said last month it owed $30.34 million to suppliers, which it was struggling to service. It has shut down five of its outlets this year and struggled to stock several others.The companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\nOK Zimbabwe has been facing competition from smaller businesses amid their rapid growth. The surge in the informal, or grey, economy in the southern African country has spawned more price-competitive retailers, known as tuck shops, threatening the viability of more established formal retailers.\n\nThe company said last month it owed $30.34 million to suppliers, which it was struggling to service. It has shut down five of its outlets this year and struggled to stock several others.The companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\nThe company said last month it owed $30.34 million to suppliers, which it was struggling to service. It has shut down five of its outlets this year and struggled to stock several others.\n\nThe companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\nThe companys major shareholders include Datvest Nominees Foreign, National Social Security Authority, Old Mutual Life, and Stanbic Nominees, which hold stakes of 19.99%, 16.09%, 13.36% and 12.9%, respectively.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/22160602/OK-Zimbabwe.jpg",
            "description": "<p>By Reuters GROCERY retailer OK Zimbabwe Ltd’s (OKZ.ZI), opens new tab majority shareholders have agreed to back a $30 million rights issue to cover a “funding gap” and stabilise the company’s financial position, its chief executive said. “Most of the top five shareholders have indicated interest in following their rights,” CEO Willard Zireva told Reuters</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/grocery-chain-ok-zimbabwes-majority-shareholders-back-30-million-rights-issue-ceo-says/\">Grocery chain OK Zimbabwe’s majority shareholders back $30 million rights issue, CEO says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Nearly 50,000 Zimbabwean children dropped out of school in 2024 alone",
            "url": "https://www.newzimbabwe.com/nearly-50000-zimbabwean-children-dropped-out-of-school-in-2024-alone/",
            "content": "By Staff Reporter\n\nCLOSE to 50,000 learners from both primary and secondary schools dropped out in 2024 due to pregnancies and distance related challenges.\n\nThese high numbers of school dropouts were confirmed by the Deputy Minister of Primary and Secondary Education Angeline Gata in Parliament. She said at primary level, there were 15,809, while 33,746 were from secondary school making a tally of 49 555 dropouts.\n\nGata revealed these statistics after Mashonaland West Proportional Representation (PR) Member of Parliament, Mutsa Murombedzi questioned the figures of dropouts in Zimbabwe schools per province and district in 2024.\n\nThe provinces which recorded the highest dropouts both at primary and secondary level were, Midlands 7,746, Mashonaland Central 7,370, Mashonaland West 6,963, Manicaland 6,889, and Masvingo 6,014.\n\nMidlands Province had the highest number of school dropouts with a total of 7,746, 5,138 emerging from secondary and 2,608 from primary. At secondary level in Gokwe North and South districts saw 1,215 and 1,272 respectively dropping out.\n\nMashonaland Central saw 4,318 leaving secondary school while 3,052 also left primary level tallying 7,370 students out of school in Mash Central.\n\nIn Mashonaland West, 4,771 primary level learners and 2,192 from secondary level quit. The total tally was 6,963.\n\nManicaland totalled; 6,889 students, 4842 from secondary and 2047 from primary.\n\nThe Masvingo province total was 6,014, 3,786 from secondary and 2228 from Primary.\n\nMashonaland East had 3,937 students from secondary level while 1,006 from primary level to give a cumulative 4,943 leaving school.\n\nMatabeleland North saw 2,821 and 1,394 from secondary and primary respectively leaving school. The total was 4,215\n\nMatabeleland South totalled, 2,359 students from both primary and secondary.\n\nHarare Province produced 2,105 students out of school, while 1,616 from secondary and 489 from primary.\n\nBulawayo was the only province, which produced the lowest school dropouts with a total of 942 students, with 657 from secondary and 285 from primary level.\n\nGovernment attributed the high school dropout rates to girls getting pregnant and long distances that some learners endured.\n\nGirls are dropping out because of pregnancy, this is a call to all of us, the House and parental involvement that we help each other with the community.\n\nThere are quite a number of reasons of dropping out. Some may be caused by distance to school and schools are being built to adhere to five kilometres for a child to walk to school and some, it is just clear motivation from parents that needed, said Gata\n\nAs the Ministry of Primary and Secondary Education, we have embarked on a programme that is called Early Warning System. This programme will help us with indications on what are the causes of school drop-outs in both primary and secondary school.\n\nSo, we are training our teachers who are helping us to identify communities that will need help. We are doing this partnering with UNICEF and it has been going on so far for six months. It has started already in schools and as we speak, they are on the ground training our staff.\n\nThere are various reasons for school dropouts. Depending on the reasons, some of the reasons could be girls getting pregnant and school fees, which is being catered for by BEAM.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/01182204/School-scaled.jpg",
            "description": "<p>By Staff Reporter CLOSE to 50,000 learners from both primary and secondary schools dropped out in 2024 due to pregnancies and distance related challenges. These high numbers of school dropouts were confirmed by the Deputy Minister of Primary and Secondary Education Angeline Gata in Parliament. She said at primary level, there were 15,809, while 33,746</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nearly-50000-zimbabwean-children-dropped-out-of-school-in-2024-alone/\">Nearly 50,000 Zimbabwean children dropped out of school in 2024 alone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Vast Resources finds additional diamonds in historic parcel released by RBZ after 15 years",
            "url": "https://www.newzimbabwe.com/vast-resources-finds-additional-diamonds-in-historic-parcel-released-by-rbz-after-15-years/",
            "content": "By Alois Vinga\n\nAIM-listed miner, Vast Resources, says it has discovered more stones than anticipated in its parcel, which the Reserve Bank of Zimbabwe (RBZ) had held since 2010.\n\nThe miner recently regained control of a long-awaitedparcelcontaining129,400 carats of diamondsafter a 15-year dispute with theZimbabweangovernment.\n\nThe dispute stemmed from the revocation of Vast Resources mining rights in the Marange diamond fields in 2006.\n\nThe Company is pleased to report that the sorting process has revealed an additional quantity of stones in the sealed historic parcels, the existence of which was previously unknown to the board of directors of Vast.\n\nThis Additional Parcel contains 6,055.35 carats of gem quality stones, which, together with the rest of the consignment, are currently inDubaifor final sorting in preparation for cleaning and further preparation for their sale, said the miner.\n\nThe company said it is now in receipt of the final packing list post the Kimberly Process inspection.\n\nThe total quantity of diamonds included in the Historic Parcel is now estimated to be 135,139.47 carats, of which an aggregate 36,475.26 carats have already been identified to be gem quality, said the company.\n\nThe company is also in the process of selecting the first stones for cleaning and estimates that initial results will be available in the coming weeks. The Board currently anticipates that the selling process will be conducted in a phased manner in order to maximise value for the Company and its shareholders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/04023247/Diamonds.jpg",
            "description": "<p>By Alois Vinga AIM-listed miner, Vast Resources, says it has discovered more stones than anticipated in its parcel, which the  Reserve Bank of Zimbabwe (RBZ) had held since 2010. The miner recently regained control of a long-awaited parcel containing 129,400 carats of diamonds after a 15-year dispute with the Zimbabwean government. The dispute stemmed from the revocation of Vast Resources’ mining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vast-resources-finds-additional-diamonds-in-historic-parcel-released-by-rbz-after-15-years/\">Vast Resources finds additional diamonds in historic parcel released by RBZ after 15 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Trio arrested for torturing suspected vegetable thief to death",
            "url": "https://www.newzimbabwe.com/trio-arrested-for-torturing-suspected-vegetable-thief-to-death/",
            "content": "By Staff Reporter\n\nTHREE Mutare men have been arrested for fatally assaulting a suspected vegetable thief after tying him to a tree.\n\nThe incident occurred on Tuesday in Mutares Dangamvura suburb.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the incident.\n\nPolice in Mutare arrested Brighton Kaisa (27), Oliver Kaisa (28) and Garikai Saungwena (50) in connection with a case of murder which occurred at a house in Dangamvura on May 6, 2025, said Nyathi.\n\nThe suspects allegedly tied the victim, Tarick Mamenomuno (23), with a cable on a mango tree, head down, before taking turns to assault him with a wire and an electric cable several times all over the body.\n\nThe suspects had accused the victim of stealing vegetables from their garden. The victim died on the spot, added Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09071503/VEGETABLE.jpeg",
            "description": "<p>By Staff Reporter THREE Mutare men have been arrested for fatally assaulting a suspected vegetable thief after tying him to a tree. The incident occurred on Tuesday in Mutare’s Dangamvura suburb. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the incident. “Police in Mutare arrested Brighton Kaisa (27), Oliver Kaisa (28) and Garikai</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trio-arrested-for-torturing-suspected-vegetable-thief-to-death/\">Trio arrested for torturing suspected vegetable thief to death</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Govt still struggling to revive ZISCO Steel",
            "url": "https://www.newzimbabwe.com/govt-still-struggling-to-revive-zisco-steel/",
            "content": "By Alois Vinga\n\nYEARS after promising theresuscitation of ZISCO Steel, the government is struggling to proffer a once-off solution to bring back the firm to its hey days.\n\nZISCO Steel was once a major steel producer in Zimbabwe, but it faced financial difficulties, mismanagement, and a lack of investment, leading to its closure in 2008.\n\nSpeaking in Parliament recently, Industry and Commerce Minister, Mangaliso Ndlovu struggled to point outany tangible progress made to revive the entity, tabling sketchy plans.\n\nNdlovu was being quizzed by Mbizo legislator, Corban Madziwanyika.\n\nThe coming on board of Dinson Iron and Steel Company currently presents a unique opportunity to build synergies with the existing ZISCO Company plant and other downstream industries such as Lancashire, hence promoting the revival of the local iron and steel sector, said Ndlovu.\n\nHe said currently, there are three key initiatives being undertaken by the government in resuscitating ZISCO and supporting Lancashire Steel. The first one, he said, is the reviving of the wire mill plant at Lancashire Steel whichwill see the manufacturing of wire rods, drawn wire, weld wire and brick force, barbed wire as well as galvanised wire.\n\nThe Industry Minister said the initiative is expected to create more than 20 jobs and provide wire-related products to both up and downstream industries and generate revenue for the company.\n\nThe second one is the establishment of a limestone beneficiation plant at BIMCO. The plant will manufacture burnt lime, aggregate stones for construction and mill limestone into different products. As the House might be aware, we had Kuvimba which had a management contract that has since been terminated owing to non-performance by the contractor.\n\nThis therefore means that the ZISCO board and management have regained urgency to manage and control its own affairs and we welcome this development at this critical juncture, he said.\n\nNdlovu said the government is now closer to inking an MOU that ensures that companies in the steel sector do not compete in producing the same products but rather, complement each other.\n\nDinson produces pig iron and steel billets for exports and will soon be producing the second stage of hot rolled wires and rolling bars. They have agreed in principle to leave certain types to be produced by ZISCO Steel and these are the shafts, the wire, the beams, the angles and the flat sections.\n\nThe entire sector will leverage the emergence of Dinson Company, which has started production of pig irons and steel billets. I want to submit by concluding that for their part, ZISCO Steel is currently mobilising resources to revive one of their kins for limestone beneficiation into burnt lime or what we call quick lime, which is used to remove impurities in steel making and is also used in construction such as cement manufacturing, added Ndlovu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/01182954/Ziscosteel.jpg",
            "description": "<p>By Alois Vinga YEARS after promising the resuscitation of ZISCO Steel, the government is struggling to proffer a once-off solution to bring back the firm to its hey days. ZISCO Steel was once a major steel producer in Zimbabwe, but it faced financial difficulties, mismanagement, and a lack of investment, leading to its closure in 2008.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-still-struggling-to-revive-zisco-steel/\">Govt still struggling to revive ZISCO Steel</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        },
        {
            "title": "Trump calls election of first American pope a ‘great honour’",
            "url": "https://www.newzimbabwe.com/trump-calls-election-of-first-american-pope-a-great-honour/",
            "content": "BBC\n\nUS President Donald Trump has called the election of the first American pope a great honour for the country and said he looks forward to meeting him.\n\nTrump is among the many American political figures applauding the historic appointment of Robert Francis Prevost, who will be known as Pope Leo XIV, to lead the Catholic Church.\n\nTo have the Pope from America is a great honour, Trump said when asked for reaction to the news.\n\nPope Leo, 69, was born in Chicago and attended university outside Philadelphia, before becoming a missionary in Peru.\n\nThe US has the fourth largest number of Catholics in the world, and congratulations started pouring in soon after the first American popes name was announced.\n\nVice-President JD Vance, who converted to Catholicism in 2019, praised the popes election.\n\nIm sure millions of American Catholics and other Christians will pray for his successful work leading the Church, Vance wrote on X.\n\nFormer President Joe Biden, a devout Catholic who has spoken about his warm relationship with Pope Francis, also offered his congratulations.\n\nHabemus papam  May God bless Pope Leo XIV of Illinois, Biden, the second Catholic president in US history, wrote on social media.\n\nFormer President Barack Obama, who launched his political career in Chicago, wrote on X: Michelle and I send our congratulations to a fellow Chicagoan, His Holiness Pope Leo XIV.\n\nThis is a historic day for the United States, and we will pray for him as he begins the sacred work of leading the Catholic Church and setting an example for so many, regardless of faith.\n\nFormer President George Bush issued a statement, saying that he and his wife Laura were delighted by the news.\n\nThis an historic and hopeful moment for Catholics in America and for the faithful around the world, he said.\n\nWe join those praying for the success of Pope Leo XIV as he prepares to lead the Catholic church, serve the neediest, and share Gods love.\n\nRepublican House Speaker Mike Johnson also congratulated the new pope and wrote on social media: May God bless the first American papacy in these historic days.\n\nSecretary of State Marco Rubio, a Catholic, also extended his congratulations.\n\nThis is a moment of profound significance for the Catholic Church, offering renewed hope and continuity amid the 2025 Jubilee Year to over a billion faithful worldwide, Rubio said.\n\nThe United States looks forward to deepening our enduring relationship with the Holy See with the first American pontiff.\n\nAs cardinal, it appears Prevost did not shy away from occasionally challenging the views of the Trump administration.\n\nAn account under his name reposted a post on social media platform X which was critical of the Trump administrations deportation of a US resident to El Salvador, and shared a critical comment piece written about a TV interview given by Vance to Fox News.\n\nJD Vance is wrong: Jesus doesnt ask us to rank our love for others, read the post, repeating the headline from the commentary on the National Catholic Reporter website.\n\nThe BBC has contacted the Vatican but has not independently confirmed the account, which was created in 2011, belongs to the new pontiff.\n\nMeanwhile, in Prevosts hometown, Chicago Mayor Brandon Johnson offered a note of congratulations.\n\nEverything dope, including the Pope, comes from Chicago! Congratulations to the first American Pope Leo XIV! We hope to welcome you back home soon, he wrote.\n\nIllinois Governor JB Pritzker called the moment historic.\n\nHailing from Chicago, Pope Leo XIV ushers in a new chapter that I join those in our state welcoming in at a time when we need compassion, unity, and peace, he wrote on social media.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/15233156/Donald-Trump.jpg",
            "description": "<p>BBC US President Donald Trump has called the election of the first American pope a “great honour” for the country and said he looks forward to meeting him. Trump is among the many American political figures applauding the historic appointment of Robert Francis Prevost, who will be known as Pope Leo XIV, to lead the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-calls-election-of-first-american-pope-a-great-honour/\">Trump calls election of first American pope a ‘great honour’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:41",
            "date": "10 May 2025"
        }
    ]
}