{
    "news": [
        {
            "title": "‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners",
            "url": "https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/",
            "content": "TimesLive\n\nPA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzis accusations that he has abandoned his cause to fight against illegal immigrants.\n\nLonzi claimed McKenzie has not proposed any legislation on the subject, despite his partys stance on the issue.\n\nThe PA does not care about illegal foreigners, Lonzi said. Never let them lie to you. Its leader McKenzie is now a minister. He has never proposed legislation on the subject, not even a private members bill as an MP. He is just enjoying blue lights.\n\nMcKenzie swiftly responded to Lonzis accusations, asking, Uthini wena Temu Ndlozi? (What are you saying Ndlozi from Temu?). Start by telling us, do you even care?\n\nLonzi, however, was unfazed and accused McKenzie of avoiding parliamentary committee meetings. You must stop running away from parliament committee meetings. I will take you to the cleaners.\n\nThe debate stems from social media users concerns about McKenzies perceived change of attitude towards illegal foreigners.\n\nHowever, McKenzie has always reaffirmed his stance against illegal immigration, saying his partys mission remains unchanged.\n\nI speak up forAbahambe[they must leave] in closed government meetings and PA rallies. I have and will never change my stance regarding the mass deportation of all illegal foreigners but to expect me to only speak about immigration when there is a home affairs minister is wrong.Abahambeis our mission as the PA. We have and will never change. We have taken a decision to fight from within the GNU.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10182059/gayton-eff-lonzi.jpg",
            "description": "<p>TimesLive PA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzi’s accusations that he has abandoned his cause to fight against illegal immigrants. Lonzi claimed McKenzie has not proposed any legislation on the subject, despite his party’s stance on the issue. “The PA does not care</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/\">‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "10 Jun 2025"
        },
        {
            "title": "The work of cybercriminals – Chamisa claims X account hacked after cryptocurrency launch",
            "url": "https://www.newzimbabwe.com/the-work-of-cybercriminals-chamisa-claims-x-account-hacked-after-cryptocurrency-launch/",
            "content": "By Staff Reporter\n\nOPPOSITIONleader Nelson Chamisahas claimed hisX account was hackedafter he appeared to have launched a digital currency called God Is In It($GIT) and promoted it on his page.\n\nThe hackers gained access to Chamisas X account early on Tuesday, posting images and videos of Chamisa in a morning gown, endorsing the God Is In It digital currency.\n\nTo my fellow citizens, I wish to kindly inform you that my X (formerly Twitter) account has been hacked and compromised by cybercriminals, Chamisa posted on his WhatsApp channel moments later.\n\nOur cybersecurity team is working diligently with X support team to fix this problem, regain control and implement remedial measures. We will keep you updated on the status of the account recovery and any actions being taken.\n\nBy midday, Chamisas X account had removed all the unusual posts from his timeline and appeared to have regained control of the account.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter OPPOSITION leader Nelson Chamisa has claimed his X account was hacked after he appeared to have launched a digital currency called “God Is In It ($GIT)” and promoted it on his page. The hackers gained access to Chamisa’s X account early on Tuesday, posting images and videos of Chamisa in a morning gown, endorsing the “God Is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-work-of-cybercriminals-chamisa-claims-x-account-hacked-after-cryptocurrency-launch/\">The work of cybercriminals – Chamisa claims X account hacked after cryptocurrency launch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "10 Jun 2025"
        },
        {
            "title": "‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa",
            "url": "https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/",
            "content": "IOL\n\nThe Supreme Court of Appeal has dismissed with costs the Department of Home Affairs attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protectingnearly 200,000 Zimbabwean Exemption Permit (ZEP) holdersagainst arrest and deportation.\n\nAfter winning Part A of the court wrangle, the federation will be heading back to the court, for Part B, to argue before court that the Department of Home Affairs overreached in 2021, when the then home affairs minister Aaron Motsoaledi announced the termination of the ZEP.\n\nThe special permit dispensation has allowed 180,000 Zimbabwean nationals to live and work in South Africa since 2009.\n\nIn the federations view, the jurisdiction to terminate the ZEP lies with Parliament, not the minister.\n\nIOL had an interview with Vindren Magadzire, director of the Zimbabwe Immigration Federation who said his organisations case revolves around the termination of the ZEP programme by the minister of home affairs.\n\nVindren Magadzire, director of the Zimbabwe Immigration Federation Image:Supplied\n\nThe programme allowed approximately 180,000 Zimbabweans to live and work in South Africa. In 2021, the minister of home affairs announced plans to terminate the ZEP permits, sparking legal actions from the Zimbabwe Immigration Federation, Magadzire told IOL.\n\nThe Zimbabwe Immigration Federation was inspired to go through courts due to the South African minister of home affairs decision to terminate the permits. The decision would have significant implications for approximately 180,000 Zimbabweans living and working in South Africa under the ZEP permit program.\n\nMagadzire said his organisation is requesting the superior court to declare the termination of the ZEP permits unlawful, setting aside the termination decision, and protecting permit holders rights.\n\nIn Magadzires view, a lasting solution would be granting the ZEP holders permanent residence status in South Africa.\n\nThe latest development in the court case is that the Supreme Court of Appeal dismissed the minister of home affairs appeal. This decision upholds a Johannesburg High Court interdict that shields approximately 180,000 ZEP holders from arrest and deportation, said Magadzire.\n\nLast year,IOL reported thatthe High Court in Pretoria heard arguments from the Helen Suzman Foundation to enforce the courts order that the ZEP remains valid, while the minister of home affairs conducts a fair and rational inquiry into the impact of its termination.\n\nThe foundation turned to court in a bid to give ZEP holders a lifeline.\n\nWhen the minister first signalled his intention to appeal the courts June 2023 judgment, the foundation asked him to leave the ZEP in place until he exhausted the appeal process. The minister refused, Nicole Fritz, executive director of the foundation said at the time.\n\nThe court had held earlier that the ministers appeal had no prospects of success. Home Affairs then decided to turn to the Supreme Court of Appeal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>IOL The Supreme Court of Appeal has dismissed with costs the Department of Home Affairs’ attempt to overturn an interim interdict, previously granted in favour of the Zimbabwe Immigration Federation, protecting nearly 200,000 Zimbabwean Exemption Permit (ZEP) holders against arrest and deportation. After winning Part A of the court wrangle, the federation will be heading back</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shielded-from-arrest-what-supreme-court-of-appeal-ruling-means-for-180000-zimbabweans-in-south-africa/\">‘Shielded from arrest’: What Supreme Court of Appeal ruling means for 180,000 Zimbabweans in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "10 Jun 2025"
        },
        {
            "title": "Smith to retire from Kavango Resources",
            "url": "https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/",
            "content": "By Alois Vinga\n\nKAVANGO Resources Plcboard chairman David Smith has indicated the intention to retire at the end of June 2025.\n\nHe steps down after a long and illustrious career, devoting considerable experience which raised the groups flag.\n\nThe company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board. Peter, who is currently the Non-Executive Deputy Chairman, will assume the position when David steps down.\n\nPeter is an experienced lawyer who has focused on financing and managing mining companies. He has raised capital for the development of mining projects since 1990.\n\nSuccessful projects include the development of a gold mine in Zambia, a copper mine in Zimbabwe and the Skorpion zinc mine in Namibia prior to its takeover by Anglo-American. He recently retired from Mexico Resources plc, where he was the founder and executive chairman, the company said in a statement.\n\nKavango also announced the appointment of Gautam Dalal, who will join the Company as a non-executive director, the effective date is expected to be 1 July 2025. The Company welcomes Gautam Dalal to the Board. Gautam Dalal joins the Company as a non-executive director.\n\nGautam is a chartered accountant with over 30 years of experience with KPMG London, where he was a partner from 1990 to 2010. From 1993 to 1997 he was responsible for the commencement of KPMGs business in India where he was based.\n\nGautam returned to India in 2000 as Chairman and Chief Executive Officer of KPMGs Indian operations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09181535/smith-david.jpeg",
            "description": "<p>By Alois Vinga KAVANGO Resources Plc board chairman David Smith has indicated the intention to retire at the end of June 2025.  He steps down after a long and illustrious career, devoting considerable experience which raised the group’s flag.  The company has also announced the appointment of Peter Wynter Bee as Non-Executive Chairman of the Board.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/smith-to-retire-from-kavango-resources/\">Smith to retire from Kavango Resources </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:30",
            "date": "10 Jun 2025"
        }
    ]
}