{
    "news": [
        {
            "title": "ZHRC urges government to strengthen social security for older persons",
            "url": "https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution.\n\nOlder persons human rights have long been overlooked due to perceptions of being non-productive, yet many remain active contributors.\n\nCommemorating the International Day of Older Persons (IDOP), which was celebrated under the theme Older Persons Driving Local and Global Action: Our Aspirations, Our Well-Being and Our Rights, the ZHRC urged the government to prioritise their well-being and rights.\n\nThe ZHRC calls on the government of Zimbabwe to domesticate and implement provisions of the AU Protocols protecting the rights of older persons it is partyto.\n\nIn particular, the commission urges the government to avail resources for the provision of social security for older persons, including meaningful pensions so that retired people do not become destitute, ZHRC said in a statement Thursday.\n\nThe African Union (AU) adopted protocols on the rights of older persons (2016) and on social protection and security (2022), both of which Zimbabwe ratified in 2024.\n\nFurthermore, the government of Zimbabwe enacted progressive laws that protect the rights and entitlements of older persons, which advance the rights of older persons to human dignity, appropriate care facilities, provision of social protection through harmonised cash transfers, food deficit mitigation programmes, assisted treatment orders, prevention of age-based discrimination, and protection from abuse, neglect and exploitation of all forms.\n\nDespite all these legislative steps, older persons in Zimbabwe still encounter obstacles in fully accessing their constitutional rights and benefits.\n\nDespite these positive legislative measures, older persons in Zimbabwe continue to face barriers to the enjoyment of their constitutional rights and entitlements.\n\nChallenges in this regard include discrimination of older persons within their family environments and in public spaces, age-based stereotyping including accusations of witchcraft directed at older women in particular, limited access to health care, inadequate social protection, prolonged isolation and loneliness, neglect and in some instances outright abuse by relatives or caregivers.\n\nThese challenges are compounded by limited or ineffective enforcement of laws that protect older persons from violations of their fundamental rights and entitlements, ZHRC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/04/05055346/Old-woman.jpg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Human Rights Commission (ZHRC) has urged the government to domesticate and implement African Union (AU) protocols on the rights of older persons, calling for increased resources towards social security and meaningful pensions to prevent retirees from falling into destitution. Older persons’ human rights have long been overlooked due to perceptions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zhrc-urges-government-to-strengthen-social-security-for-older-persons/\">ZHRC urges government to strengthen social security for older persons</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "03 Oct 2025"
        },
        {
            "title": "Zim golfers tee off at prestigious MOGOLD tournament in US",
            "url": "https://www.newzimbabwe.com/zim-golfers-tee-off-at-prestigious-mogold-tournament-in-us/",
            "content": "By Alois Vinga\n\nLOCAL golf team, the Sunday Swingers, is set to showcase their talent at the prestigious MOGOLD Global LLC international tournament in the United States, a five-day event that blends golf with business networking on a global scale.\n\nThe tournament, which kicked off Wednesday, has attracted teams and players from Zimbabwe, the UK, South Africa, Kenya, and the US.\n\nAs part of the programme, the Sunday Swingers will embark on a nine-day visit, combining competitive play with opportunities to engage in international business and cultural exchanges.\n\nIn a statement, Golden Makusha, Vice President for Global Strategy and Business Development, said the Zimbabwean golfers would make the most of the platform.\n\nThe event unites a diverse group of golf and business leaders from across the globe, exemplifying a commitment to sport, culture, and sustainable enterprise, Makusha said.\n\nThe initiative is not limited to sport alone. It also aims to foster trade and investment links between the US and Africa.\n\nKey partners include the Dallas Sports Commission, Maryland Sports Commission, Guardian Life Insurance, Seeff Zimbabwe, and World Financial Group. The US Department of Commerce will also support the event through its tourism and international trade divisions, aligning with wider federal efforts to boost exports and international cooperation.\n\nMOGOLD Global has announced plans for an Africa Tour in AprilMay 2026, with scheduled stops in Kenya, Botswana, and Zimbabwe. The company said the expansion reflects its vision to merge sport with economic growth and strengthen global partnerships.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/03053140/MOGOLD-Global-Tourney-LLC.webp",
            "description": "<p>By Alois Vinga LOCAL golf team, the Sunday Swingers, is set to showcase their talent at the prestigious MOGOLD Global LLC international tournament in the United States, a five-day event that blends golf with business networking on a global scale. The tournament, which kicked off Wednesday, has attracted teams and players from Zimbabwe, the UK,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-golfers-tee-off-at-prestigious-mogold-tournament-in-us/\">Zim golfers tee off at prestigious MOGOLD tournament in US</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "03 Oct 2025"
        },
        {
            "title": "“Not a top team” – Bafana Bafana coach dismisses Zimbabwe threat ahead of crucial World Cup Qualifier",
            "url": "https://www.newzimbabwe.com/not-a-top-team-bafana-bafana-coach-dismisses-zimbabwe-threat-ahead-of-crucial-world-cup-qualifier/",
            "content": "By Sports Reporter\n\nBafana Bafana coach Hugo Broos says he is unfazed by Zimbabwe ahead of the crucial FIFA World Cup Qualifier set for October 10.\n\nSouth Africa face the Warriors in what has become a must-win encounter following a setback earlier this week when FIFA docked them three points and three goals for fielding an ineligible player against Lesotho. The sanction has left Broos men under pressure to win their final two qualifiers against Zimbabwe and Rwanda to keep their World Cup hopes alive.\n\nDespite the blow, Broos expressed confidence, dismissing both Zimbabwe and Rwanda as not top teams.\n\nYou start doubting now because of a tricky situation, yet we are facing Zimbabwe and Rwanda, not Nigeria, Cameroon, or Egypt. These are good teams, yes, but not top teams. So why should we doubt? he said.\n\nBafana Bafana go into the clash with an edge, having beaten Zimbabwe 3-1 in the reverse fixture. Confidence is further boosted by the fact that the match will be played at Durbans Moses Mabhida Stadium, which the Warriors have adopted as their temporary home after failing to secure a CAF-approved venue in Zimbabwe.\n\nBenin  14 points\n\nSouth Africa  14 points\n\nNigeria  11 points\n\nRwanda  11 points\n\nLesotho  9 points\n\nZimbabwe  4 points\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/03055459/broos.webp",
            "description": "<p>By Sports Reporter Bafana Bafana coach Hugo Broos says he is unfazed by Zimbabwe ahead of the crucial FIFA World Cup Qualifier set for October 10. South Africa face the Warriors in what has become a must-win encounter following a setback earlier this week when FIFA docked them three points and three goals for fielding</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-a-top-team-bafana-bafana-coach-dismisses-zimbabwe-threat-ahead-of-crucial-world-cup-qualifier/\">“Not a top team” – Bafana Bafana coach dismisses Zimbabwe threat ahead of crucial World Cup Qualifier</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "03 Oct 2025"
        },
        {
            "title": "Government excludes urban-based farmers from the Pfumvudza/Intwasa Presidential Input Scheme",
            "url": "https://www.newzimbabwe.com/government-excludes-urban-based-farmers-from-the-pfumvudza-intwasa-presidential-input-scheme/",
            "content": "By Anna Chibamu\n\nGovernment has announced that this years Presidential Pfumvudza/Intwasa inputs scheme will strictly target rural households, with no provision for the 500 000 urban or peri-urban dwellers who benefited last season.\n\nAgriculture Minister Anxious Masuka told Parliament during a Wednesday Q&A session that only rural communities will be provided with farming inputs under the programme, adding that last years inclusion of urban beneficiaries had been a temporary measure to cushion against the effects of the El Nio-induced drought.\n\nPumula MP Sichelesile Mahlangu had sought the governments position regarding urban constituencies benefiting from the scheme.\n\nThese peri-urban areas are actively participating in thePfumvudza/IntwasaProgramme and are fully prepared.What is the ministers position on these constituencies? Mahlangu.\n\nThe official policy is that urban areas will not receive Presidential input this year. The exception granted last year was due to an extraordinary drought, Masuka said.\n\nThis year, the inputs will be strictly allocated to the three million rural beneficiaries. Anyone residing in an urban area who wishes to benefit must be located in designated agricultural zones, namely, communal lands, A1 resettlement areas, or small-scale farming areas. These are the targeted zones for thePfumvudza/IntwasaProgramme this season.\n\nThe Pfumvudza/Intwasa scheme, a food security programme, has over the years focused on boosting productivity among smallholder and rural farmers through climate-smart agriculture.\n\nMasuka stressed that the programme would not accommodate urban dwellers since it is designed for farming regions.\n\nHowever, it is important to note that agriculture is designated for agricultural zones. Urban areas are primarily residential and do not accommodate farming activities.\n\nIn Zimbabwe, we have established that urban agriculture is not permitted, as farming should take place on land specifically allocated for agricultural purposes, not within urban settlements, Masuka explained.\n\nHe added, I recall that during last years severe drought, the President recognised that rural farmers who typically support urban populations were facing significant challenges. In response, we extended input support to peri-urban farmers to help supplement food production.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/01030702/Anxious-Masuka.png",
            "description": "<p>By Anna Chibamu Government has announced that this year’s Presidential Pfumvudza/Intwasa inputs scheme will strictly target rural households, with no provision for the 500 000 urban or peri-urban dwellers who benefited last season. Agriculture Minister Anxious Masuka told Parliament during a Wednesday Q&A session that only rural communities will be provided with farming inputs under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-excludes-urban-based-farmers-from-the-pfumvudza-intwasa-presidential-input-scheme/\">Government excludes urban-based farmers from the Pfumvudza/Intwasa Presidential Input Scheme</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "03 Oct 2025"
        },
        {
            "title": "Mansions, 5 000 cattle and a weekly US$200,000 kickback! Mutodi claims Guvamatanga making a killing as Finance Ministry permanent secretary",
            "url": "https://www.newzimbabwe.com/mansions-5-000-cattle-and-a-weekly-us200000-kickback-mutodi-claims-guvamatanga-making-a-killing-as-finance-ministry-permanent-secretary/",
            "content": " says Parliament has received reports and proposes lifestyle audit\n\nBy Leopold Munhende\n\nTHE Chairperson of Parliaments Portfolio Committee on Budget, Finance, and Economic Development, Energy Mutodi has made sensational claims that Finance Ministry Permanent Secretary George Guvamatanga is getting kickbacks of as much as US$200,000 from government contractorsso asto facilitate payments.\n\nAccording to Mutodi, Parliament received complaints about how Guvamatanga has been managing affairs, and further alleged that he was demanding kickbacks from other ministries and government departments of between 5% and 10% for every treasury disbursement.\n\nMutodi claims Guvamatangas loot now exceeds US$1 billion and adds onto an empire that includes several mansions and 5,000 dairy cattle.\n\nThe Parliament of Zimbabwehas received agonising reports that Guvamatanga is receiving 5%-10% for every payment done by the Treasury. GG as he is notoriously called has accumulated more thanUS$1 billion becoming the richest civil servant, said Mutodi.\n\nContractors, Ministries and Departments refusing to pay Guvamatanga a kick back of at least 5% after receiving Treasury payments have been denied payments for several months even if the funds are budgeted for.\n\nOver the past six months, Parliament itself has struggled to operate after being denied its budgeted funds by George Guvamatanga. A civil servant earning less than $1000 GG has more than 5000 dairy cattle, dairy equipment and several mansions hence the proposed lifestyle audit.\n\nOnecontractor Bitumen which was contracted to do roads has been asked to pay US$200,000 byGuvamatangafor every $2,000,000 weekly payment he authorises that theyreceive and they have made several complaints tomembers of the Budget Committee at Parliament.\n\nGuvamatanga was earlier this year accused of receiving bribes from shadowy businessman Wicknel Chivayo to approve payments to the controversialRen-Form CC, a South African company that supplied Zimbabwe Electoral Commission (ZEC) with voting material at highly inflated prices.\n\nPresident Emmerson Mnangagwa is said to have fired and forgiven him in June this year before he begged for the job he has kept since 2018.\n\nAZanu PF Member of Parliament (MP) for Bikita South, Mutodiclaimed Guvamatanga had made threats to deal with him if the committee was to ever seek a lifestyle audit or engage the Zimbabwe Anti-Corruption Commission (ZACC).\n\nHe added: Guvamatangahas also made threats to senda terror team to deal with the(me)upon hearing that the Committee was considering carrying out a life audit on him as well as asking for a ZACC probe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>– says Parliament has received reports and proposes lifestyle audit By Leopold Munhende THE Chairperson of Parliament’s Portfolio Committee on Budget, Finance, and Economic Development, Energy Mutodi has made sensational claims that Finance Ministry Permanent Secretary George Guvamatanga is getting kickbacks of as much as US$200,000 from government contractors so as to facilitate payments. According to Mutodi,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mansions-5-000-cattle-and-a-weekly-us200000-kickback-mutodi-claims-guvamatanga-making-a-killing-as-finance-ministry-permanent-secretary/\">Mansions, 5 000 cattle and a weekly US$200,000 kickback! Mutodi claims Guvamatanga making a killing as Finance Ministry permanent secretary</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:31",
            "date": "03 Oct 2025"
        }
    ]
}