{
    "news": [
        {
            "title": "In-house vs External Training in Health and Social Care",
            "url": "https://www.newzimbabwe.com/in-house-vs-external-training-in-health-and-social-care/",
            "content": "By Dr Richard Dune\n\nWhy blended learning strategies are becoming a compliance essential for health, social care and education providers\n\nIn the UKs heavily regulated health and social care environment, training is not a nice-to-have, but a non-negotiable requirement. For organisations operating under the scrutiny of theCare Quality Commission(CQC), local authorities and service commissioners, training forms the foundation of workforce development, governance, and regulatory compliance.\n\nWhether its safeguarding, infection prevention, medication administration, or supervision and appraisal, training must be consistent, compliant, and aligned with both operational needs and legal frameworks. Yet many leaders still face a critical question:\n\nShould training be delivered in-house or outsourced to external providers?\n\nIn this article,Dr Richard Duneexamine the strengths and weaknesses of each approach, explores why blended learning models are becoming the preferred option, and highlights how digital compliance systems such asComplyPlusare helping health, social care, and education providers deliver training that is strategic, efficient, and inspection-ready.\n\nHealth and social care training is not merely a workforce development function. It is a pillar of compliance. Providers are required to deliver training that enables staff to perform safely, ethically, and effectively across diverse settings, be it a residential care home, healthcare clinic, a supported living facility or a domiciliary service.\n\nEffective training programmes must support:\n\nFailure to provide this can result in enforcement action, reputational damage, or poor inspection ratings.\n\nIn-house training strengthens internal capacity by enabling staff to deliver tailored learning. The following outlines what it is, its advantages, and the challenges organisations need to address:\n\nIn-house trainingrefers to learning and development delivered internally by a providers own staff. Typically, trainers hold credentials such asTrain the Traineror the Award in Education and Training (AET) and are responsible for cascading knowledge across the workforce.\n\nIn-house delivery is commonly used for:\n\nThis model enables organisations to create training experiences that reflect their internal processes, service users, and local context.\n\nWhen implemented well, in-house training offers multiple benefits:\n\nBy using internal trainers, organisations can ensure training is deeply embedded in practice and reflective of their governance and compliance structures.\n\nHowever, internal training has its limitations, including:\n\nTo be effective, in-house training requires robust planning, adequate resourcing, and integration with digital compliance systems like LMS and TMS platforms.\n\nExternal training brings accredited expertise and fresh perspectives into organisations. The following outlines what it is, its advantages, and the challenges providers should consider:\n\nExternal training refers to programmes delivered by third-party providers, including independent consultants or established training organisations. These may offer accredited qualifications, CPD courses, or modules for regulatory compliance.\n\nExternal training formats range from:\n\nExternal training is often used for high-risk, regulated, or highly specialised areas.\n\nWhen used strategically, external training offers several high-value benefits that can enhance both compliance and service quality:\n\nExternal training is ideal for topics that require independent verification, specialist accreditation, or knowledge outside the organisations internal capacity.\n\nDespite its benefits, external training also presents practical and strategic challenges that providers must carefully consider:\n\nExternal training is a powerful tool, but must be strategically selected, reviewed, and quality-assured to deliver value and compliance assurance.\n\nThe COVID-19 pandemic transformed how providers approach training. With restrictions on face-to-face interaction, organisations turned to e-learning platforms and digital compliance systems to maintain training obligations.\n\nThe result? A lasting shift in how training is delivered.\n\nAs digital learning becomes more embedded in training strategies, providers are seeing a range of measurable benefits across compliance, efficiency, and accessibility:\n\nDigital training has now become a core component of compliance infrastructure, bridging the gap between in-house and external delivery.\n\nRecognising the benefits and drawbacks of both models, many providers are adopting blended training strategies, combining in-house training, external expertise, and digital integration.\n\nThis model aligns closely with regulatory expectations, supporting cost control, consistency, and quality assurance.\n\nBlended training brings together the strengths of in-house delivery, the expertise of external providers, and the efficiency of digital integration to create a comprehensive, compliant, and sustainable training strategy.\n\nIn-house training is typically used for:\n\nExternal training is usually applied to:\n\nDigital integration enhances both models through:\n\nThis blended approach ensures training is flexible, high-quality, and aligned with governance and compliance requirements, regardless of how its delivered.\n\nA blended training strategy enables organisations to leverage the strengths of both internal and external delivery, supported by digital tools that enhance oversight and accountability. Key benefits include:\n\nTogether, these benefits make blended learning a strategic, scalable, and sustainable approach to workforce development and regulatory compliance.\n\nBefore deciding which training model to adopt, providers should ask:\n\nThese questions should be integrated into your broader governance and compliance strategy.\n\nAt The Mandatory Training Group, we developedComplyPlusto support providers in building compliant, blended training systems.\n\nOur all-in-one platform includes:\n\nWhether you run a care home, a multi-site nursery, a supported living service, or a complex group organisation, ComplyPlus helps you combine in-house capability with external assurance, all within one integrated platform.\n\nThe debate isnt in-house vs external training. Its about knowing when to use each and how to tie them together through smart governance, digital systems, and compliance strategy.\n\nThe most resilient organisations are those that treat training as a strategic compliance function, not just an HR process or a tick box exercise.\n\nDelivering the right training mix is more than a choice. Its a compliance requirement and a mark of great leadership.\n\nComplyPlus helps you:\n\nThis article was originally published onThe Mandatory Training Groupwebsite.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09114510/In-house-vs-External-Training-in-Health-and-Social-Care-ComplyPlus%E2%84%A2-Dr-Richard-Dune--scaled.jpg",
            "description": "<p>By Dr Richard Dune Why blended learning strategies are becoming a compliance essential for health, social care and education providers In the UK’s heavily regulated health and social care environment, training is not a nice-to-have, but a non-negotiable requirement. For organisations operating under the scrutiny of the Care Quality Commission (CQC), local authorities and service</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-house-vs-external-training-in-health-and-social-care/\">In-house vs External Training in Health and Social Care</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "09 Sep 2025"
        },
        {
            "title": "Kadewere faces disciplinary action over heated confrontation with journalist",
            "url": "https://www.newzimbabwe.com/kadewere-faces-disciplinary-action-over-heated-confrontation-with-journalist/",
            "content": "By Sports Reporter\n\nWarriors striker Tinotenda Kadewere will face disciplinary action following his attack on journalist Yvonne Mangunda at Orlando Stadium, South Africa, on Monday.\n\nThe incident happened during the teams training session ahead of Tuesdays clash against Rwanda.\n\nKadewere threatened Mangunda, accusing her of negative coverage.\n\nFollowing interventions by teammates, Kadewere later apologised to Mangunda for his behaviour.\n\nZIFA issued a statement condemning Kadeweres behaviour.\n\nThe Zimbabwe Football Association notes with deep regret the incident that occurred at Orlando Stadium during the Warriors media open training session, involving national team player Tinotenda Kadewere and journalist Yvonne Mangunda.\n\nZIFA strongly condemns any form of abuse towards the media. Journalists are a vital part of the game, and we are committed to ensuring they carry out their duties without fear or intimidation.\n\nThe player has apologised to Ms Mangunda, and an amicable understanding between the two parties has been reached. The matter is being addressed through the appropriate disciplinary processes by both the team management and the Association.\n\nWe take full responsibility for upholding the highest standards of conduct within our teams and reaffirm our commitment to respectful engagement with all stakeholders, read the ZIFA statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/12044628/Tinotenda-Kadewere-aaa-e1757412433932.jpeg",
            "description": "<p>By Sports Reporter Warriors striker Tinotenda Kadewere will face disciplinary action following his attack on journalist Yvonne Mangunda at Orlando Stadium, South Africa, on Monday. The incident happened during the team’s training session ahead of Tuesday’s clash against Rwanda. Kadewere threatened Mangunda, accusing her of negative coverage. Following interventions by teammates, Kadewere later apologised to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kadewere-faces-disciplinary-action-over-heated-confrontation-with-journalist/\">Kadewere faces disciplinary action over heated confrontation with journalist </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "09 Sep 2025"
        },
        {
            "title": "Cassper Nyovest embarks on weight loss journey after social media criticism",
            "url": "https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/",
            "content": "TshisaLive\n\nCassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29.\n\nAfter facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey.\n\nI was doing cardio all week. This time its a bit more fun because Im playing tennis. Next week Ill start weight training. The comments at the weekend were harsh. It hurt my feelings a bit but sometimes thats what you need, a little push, he said.\n\nIt is a projection, about how you feel about yourself. Body shaming and all of that. You dont know what Im going through. Im going to turn the lemons into lemonade.\n\nThis is not the first time Cassper has undergone a weight loss journey before his Fill Up concerts.\n\nIn 2022 Cassper did it before his Fill Up Mmabatho concert in Mahikeng.\n\nI cant explain how proud I am of myself. This was by far the hardest weight loss journey for me because I have done this three times and I now knew what it would take for me to get back in shape. To be honest, mentally I didnt feel like I was as strong as I once was and I was demoralised.\n\nIts supposed to get easier by the day but it got harder and harder. I just kept waking up and going. Lost touch with a lot of relationships and people because I zoned into this goal and I had no time for anyone but myself.\n\nLooking at these pictures now Im in awe of myself. I owe it to myself never to let myself go like that again. Big shout out to my training and nutrition team. Shout out to Fight Club for always having their doors open for me at any time I wanted to train. We four weeks out Boys! Lets put on a show! Im back!\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09051311/nyovest.jpg",
            "description": "<p>TshisaLive Cassper Nyovest is on a mission to shed weight after he faced hurtful comments following his performance at the Scorpion Kings with Friends Live concert on August 29. After facing backlash from trolls, the rapper said for the next three months before his #FillUpToyotaStadium concert he is on a weight loss journey. “I was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cassper-nyovest-embarks-on-weight-loss-journey-after-social-media-criticism/\">Cassper Nyovest embarks on weight loss journey after social media criticism</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "09 Sep 2025"
        },
        {
            "title": "Mount Sinai: One of the world’s most sacred places is being turned into a luxury mega-resort",
            "url": "https://www.newzimbabwe.com/mount-sinai-one-of-the-worlds-most-sacred-places-is-being-turned-into-a-luxury-mega-resort/",
            "content": "BBC\n\nFor years, visitors would venture up Mount Sinai with a Bedouin guide to watch the sunrise over the pristine, rocky landscape or go on other Bedouin-led hikes.\n\nNow one of Egypts most sacred places  revered by Jews, Christians and Muslims  is at the heart of an unholy row over plans to turn it into a new tourism mega-project.\n\nKnown locally as Jabal Musa, Mount Sinai is where Moses is said to have been given the Ten Commandments. Many also believe that this is the place where, according to the Bible and the Quran, God spoke to the prophet from the burning bush.\n\nThe 6th century St Catherines Monastery, run by the Greek Orthodox Church, is also there  and seemingly its monks will stay on now that Egyptian authorities, under Greek pressure, have denied wanting to close it.\n\nHowever, there is still deep concern about how the long-isolated, desert location  a Unesco World Heritage site comprising the monastery, town and mountain  is being transformed. Luxury hotels, villas and shopping bazaars are under construction there.\n\nThe long-isolated desert location is being transformed\n\nIt is also home to a traditional Bedouin community, the Jebeleya tribe. Already the tribe, known as the Guardians of St Catherine, have had their homes and tourist eco-camps demolished with little or no compensation. They have even been forced to take bodies out of their graves in the local cemetery to make way for a new car park.\n\nThe project may have been presented as desperately needed sustainable development which will boost tourism, but it has also been imposed on the Bedouin against their will, says Ben Hoffler, a British travel writer who has worked closely with Sinai tribes.\n\nThis is not development as the Jebeleya see it or asked for it, but how it looks when imposed top-down to serve the interests of outsiders over those of the local community, he told the BBC.\n\nA new urban world is being built around a Bedouin tribe of nomadic heritage, he added. Its a world they have always chosen to remain detached from, to whose construction they did not consent, and one that will change their place in their homeland forever.\n\nLocals, who number about 4,000, are unwilling to speak directly about the changes.\n\nBen Hoffler Construction in the Plain of el-Raha in 2024\n\nSo far, Greece is the foreign power which has been most vocal about the Egyptian plans, because of its connection to the monastery.\n\nTensions between Athens and Cairo flared up after an Egyptian court ruled in May that St Catherines  the worlds oldest continuously used Christian monastery  lies on state land.\n\nAfter a decades-long dispute, judges said that the monastery was only entitled to use the land it sits on and the archaeological religious sites which dot its surroundings.\n\nArchbishop Ieronymos II of Athens, head of the Church of Greece, was quick to denounce the ruling.\n\nThe monasterys property is being seized and expropriated. This spiritual beacon of Orthodoxy and Hellenism is now facing an existential threat, he said in a statement.\n\nIn a rare interview, St Catherines longtime Archbishop Damianos told a Greek newspaper the decision was a grave blow for us and a disgrace. His handling of the affair led to bitter divisions between the monks and his recent decision to step down.\n\nThe Greek Orthodox Patriarchate of Jerusalem pointed out that the holy site  over which it has ecclesiastical jurisdiction  had been granted a letter of protection by the Prophet Muhammad himself.\n\nIt said that the Byzantine monastery  which unusually also houses a small mosque built in the Fatimid era  was an enshrinement of peace between Christians and Muslims and a refuge of hope for a world mired by conflict.\n\nWhile the controversial court ruling remains in place, a flurry of diplomacy ultimately culminated in a joint declaration between Greece and Egypt ensuring the protection of St Catherines Greek Orthodox identity and cultural heritage.\n\nBen Hoffler Mount Sinai, known locally as Jabal Musa, is where Moses is said to have been given the Ten Commandments\n\nEgypt began its state-sponsored Great Transfiguration Project for tourists in 2021. The plan includes opening hotels, eco-lodges and a large visitor centre, as well as expanding the small nearby airport and a cable car to Mount Moses.\n\nThe government is promoting the development as Egypts gift to the entire world and all religions.\n\nThe project will provide all tourism and recreational services for visitors, promote the development of the town [of St Catherine] and its surrounding areas while preserving the environmental, visual, and heritage character of the pristine nature, and provide accommodation for those working on St Catherines projects, Housing Minister Sherif el-Sherbiny said last year.\n\nWhile work does appear to have stalled, at least temporarily, due to funding issues, the Plain of el-Raha  in view of St Catherines Monastery  has already been transformed. Construction is continuing on new roads.\n\nThis is where the followers of Moses, the Israelites, are said to have waited for him during his time on Mount Sinai. And critics say the special natural characteristics of the area are being destroyed.\n\nDetailing the outstanding universal value of the site, Unesco notes how the rugged mountainous landscape around forms a perfect backdrop for the Monastery.\n\nIt says: Its siting demonstrates a deliberate attempt to establish an intimate bond between natural beauty and remoteness on the one hand and human spiritual commitment on the other.\n\nBen Hoffler The area is known for its natural beauty and rugged mountainous landscape\n\nBack in 2023, Unesco highlighted its concerns and called on Egypt to stop developments, check their impact and produce a conservation plan.\n\nThis has not happened.\n\nIn July, World Heritage Watch sent an open letter calling on Unescos World Heritage Committee to place the St Catherines area on the List of World Heritage Sites in Danger.\n\nCampaigners have also approached King Charles as patron of the St Catherine Foundation, which raises funds to help conserve and study the monasterys heritage with its collection of valuable ancient Christian manuscripts. The King has described the site as a great spiritual treasure that should be maintained for future generations.\n\nThe mega-project is not the first in Egypt to draw criticism for a lack of sensitivity to the countrys unique history.\n\nBut the government sees its series of grandiose schemes as key to reinvigorating the flagging economy.\n\nEgypts once-thriving tourism sector had begun to recover from the effects of the Covid-19 pandemic when it was hit by the brutal war in Gaza and a new wave of regional instability. The government has declared an aim of reaching 30 million visitors by 2028.\n\nUnder successive Egyptian governments, commercial development of the Sinai has been carried out without consulting the indigenous Bedouin communities.\n\nThe peninsula was captured by Israel during the 1967 Middle East War and only returned to Egypt after the two countries signed a peace treaty in 1979. The Bedouin have since complained of being treated like second-class citizens.\n\nThe construction of Egypts popular Red Sea destinations, including Sharm el-Sheikh, began in South Sinai in the 1980s. Many see similarities with what is happening at St Catherines now.\n\nThe Bedouin were the people of the region, and they were the guides, the workers, the people to rent from, says Egyptian journalist Mohannad Sabry.\n\nThen industrial tourism came in and they were pushed out  not just pushed out of the business but physically pushed back from the sea into the background.\n\nBen Hoffler A hotel under construction in the Plain of el-Raha in 2024\n\nAs with the Red Sea locations, it is expected that Egyptians from elsewhere in the country will be brought in to work at the new St Catherines development. However, the government says it is also upgrading Bedouin residential areas.\n\nSt Catherines Monastery has endured many upheavals through the past millennium and a half but, when the oldest of the monks at the site originally moved there, it was still a remote retreat.\n\nThat began to change as the expansion of the Red Sea resorts brought thousands of pilgrims on day trips at peak times.\n\nIn recent years, large crowds would often be seen filing past what is said to be the remnants of the burning bush or visiting a museum displaying pages from the Codex Sinaiticus  the worlds oldest surviving, nearly complete, handwritten copy of the New Testament.\n\nNow, even though the monastery and the deep religious significance of the site will remain, its surroundings and centuries-long ways of life look set to be irreversibly changed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09112647/sinai.webp",
            "description": "<p>BBC For years, visitors would venture up Mount Sinai with a Bedouin guide to watch the sunrise over the pristine, rocky landscape or go on other Bedouin-led hikes. Now one of Egypt’s most sacred places – revered by Jews, Christians and Muslims – is at the heart of an unholy row over plans to turn</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mount-sinai-one-of-the-worlds-most-sacred-places-is-being-turned-into-a-luxury-mega-resort/\">Mount Sinai: One of the world’s most sacred places is being turned into a luxury mega-resort</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "09 Sep 2025"
        },
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "09 Sep 2025"
        },
        {
            "title": "Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups",
            "url": "https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/",
            "content": "By Staff Reporter\n\nHIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwas son.\n\nHarare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto Road in Highlands. The potential buyer of the land, believed to be Collins Mnangagwa, is constructing a multi-storey building in the area and intends to close part of the public road.\n\nThe residents have been given a month to lodge objections and reasons with the City Council regarding the land.\n\nThe Highlands Residents Association has, via a petition, objected to the sale of the portion of the road by the City Council.\n\nWe, the undersigned residents and community members of Highlands and surrounding areas, hereby submit our formal objection to the proposed permanent road closure of a portion of Otto Road (i.e. Otto Drive, being the road connecting Willowmead Lane to Collins Avenue hereinafter referred to as Otto Road as per the public notice), Highlands, Harare, as advertised in the Public Notice placed in The Herald on Tuesday 2 September 2025, read the petition.\n\nThe residents lashed out at the City Council for the lack of transparency in the process, arguing that the sale of the land deprives the public of the benefits it carries.\n\nOtto Road is public land. Its permanent closure and subsequent sale would deprive current and future residents of their right to access and benefit from public infrastructure.\n\nOtto Road provides a safe and established route for domestic workers, security guards, gardeners, pedestrians, cyclists, schoolchildren, walkers and joggers. Closing it will force vulnerable users onto busier, more dangerous routes.\n\nMany people who rely on Otto Road do not own cars. Closure would disproportionately harm women, children, and low-income workers who depend on safe non-motorised routes.\n\nThe proposed closure appears to serve private interests at the expense of the broader community. Council has a duty to uphold transparency and protect public assets for collective benefit, read the petition.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/07033353/Emmerson-Mnangagwa.png",
            "description": "<p>By Staff Reporter HIGHLANDS residents are up in arms with the Harare City Council over the planned sale of a public road in the suburb to an individual believed to be President Emmerson Mnangagwa’s son. Harare City Council placed a notice recently in the newspaper regarding the sale of a portion of land on Otto</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-rally-against-councils-sale-of-otto-road-to-mnangagwas-son-warn-of-impact-to-vulnerable-groups/\">Harare residents rally against council’s sale of Otto Road to Mnangagwa’s son – warn of impact to vulnerable groups</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "09 Sep 2025"
        }
    ]
}