{
    "news": [
        {
            "title": "Brain drain continues to haunt Zimbabwe as close to 36,000 are granted work visas to the UK alone in just a year",
            "url": "https://www.newzimbabwe.com/brain-drain-continues-to-haunt-zimbabwe-as-close-to-36000-are-granted-work-visas-to-the-uk-alone-in-just-a-year/",
            "content": "By Anna Chibamu\n\nZIMBABWE continues to lose its skilled manpower to other countries as 35 938 skilled workers, mostly in the Health sectormigrated to the United Kingdom in just a year.\n\nAlthough reasons for emigrating to other countries vary, Home Affairs minister Kazembe Kazembe this week said between June 2023 and June this year, close to 36,000 Zimbabweans had been granted working visas by the UK mostly as health care workers.\n\nLocally, healthcare workers earn an average of US$255 per month while the least experienced stands to take home about US$2,500 in the UK.\n\nThousands more have left en-masse to Ireland, Australia, and New Zealand where the working and living conditions are better.\n\nKazembe said that the country had not been spared from the devastating effects of brain drain as nurses and doctors have emigrated from Zimbabwe en-masse.\n\nStatistics from the United Kingdom revealedthat between June 2023 and June 2024, 35 938 Zimbabweans were granted work visas to the UK, mostly as health care workers.\n\nIt may be a challenge to tame this emigration pattern as reasons for such vary, Kazembe told International Organisation for Migration (IOM) director general Amy Pope, the first IOM DG to visit Zimbabwe in several decades this week.\n\nZimbabwes health sector is mismanaged and this has been worsened by the countrys economic collapse.\n\nZimbabwe is on WHOs red list of countries with dire health service shortages.\n\nHowever, it is equally possible to replenish lost and or required skills through sound policies, added the minister.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/28072448/Nurse-UK.png",
            "description": "<p>By Anna Chibamu ZIMBABWE continues to lose its skilled manpower to other countries as 35 938 skilled workers, mostly in the Health sector migrated to the United Kingdom in just a year. Although reasons for emigrating to other countries vary, Home Affairs minister Kazembe Kazembe this week said between June 2023 and June this year, close</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brain-drain-continues-to-haunt-zimbabwe-as-close-to-36000-are-granted-work-visas-to-the-uk-alone-in-just-a-year/\">Brain drain continues to haunt Zimbabwe as close to 36,000 are granted work visas to the UK alone in just a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "Zimbabwe clamps down on smuggling, counterfeit products to safeguard public safety",
            "url": "https://www.newzimbabwe.com/zimbabwe-clamps-down-on-smuggling-counterfeit-products-to-safeguard-public-safety/",
            "content": "Xinhua\n\nAuthorities in Zimbabwe are intensifying efforts to combat the smuggling of consumer goods into the country and the proliferation of counterfeit and substandard products in the market to safeguard public safety and protect the local industry.\n\nThe rise in smuggled goods is partly driven by public demand for affordable products in informal markets that operate outside regulatory frameworks, authorities said.\n\nTo address the trade in illicit goods, the Ministry of Industry and Commerce is leading a multi-agency task force, including the police and the Zimbabwe Revenue Authority, aimed at curbing smuggling.\n\nStringent anti-smuggling measures have been put in place to protect our domestic industries from unfair competition posed by illegal imports, said Zimbabwes Deputy Minister of Industry and Commerce Rajeshkumar Modi during a dissemination workshop for the Zimbabwe Industrial Reconstruction and Growth Plan (ZIRGP) in the capital of Harare on Tuesday.\n\nThe development of value chains also remains a priority, as the government has put in place measures to promote the procurement of domestically produced goods, he added.\n\nLaunched on Nov. 1, the ZIRGP is a short-term transitional manufacturing policy running through December 2025, focused on enforcing consumer protection and preventing the spread of smuggled, counterfeit, and substandard goods in the country. The plan builds on the recently concluded Zimbabwe National Industrial Development Policy, which ran from 2019 to 2023.\n\nAmong the governments measures to tackle smuggling are the establishment of police roadblocks along highways and inspections of retail outlets across the country.\n\nSmuggling also affects the collection of customs and excise duties and discourages investment, Finance, Economic Development, and Investment Promotion Minister Mthuli Ncube said during his 2025 national budget presentation in Parliament last month.\n\nIn addition, smuggling is a threat to public health and safety as smuggled goods, in particular, food items, medicines, and alcohol are not subject to health and safety controls, said Ncube.\n\nThe Consumer Protection Commission, a national body that safeguards consumer rights, recently reported the presence of counterfeit items in the market, including toothpaste, cooking oil, drinks, and baked beans.\n\nDont fall for fake products. They might be cheaper, but they can cost you your health, your safety, and even your life, warned the commission on X, formerly Twitter.\n\nConsumers have also raised concerns over the proliferation of products in the market.\n\nAuthorities should continue conducting impromptu inspections on retailers and vendors to protect the public especially as people do their end-of-year shopping for the holidays, said Leon Nkhata, a resident in Harare. He expressed concern about substandard goods, including repackaged and underweight products like mealie meal, rice, and sugar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12172952/fake-colgate.webp",
            "description": "<p>Xinhua Authorities in Zimbabwe are intensifying efforts to combat the smuggling of consumer goods into the country and the proliferation of counterfeit and substandard products in the market to safeguard public safety and protect the local industry. The rise in smuggled goods is partly driven by public demand for affordable products in informal markets that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-clamps-down-on-smuggling-counterfeit-products-to-safeguard-public-safety/\">Zimbabwe clamps down on smuggling, counterfeit products to safeguard public safety</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "Electric cable thief’s 10-year jail-term quashed following wrong conviction",
            "url": "https://www.newzimbabwe.com/electric-cable-thiefs-10-year-jail-term-quashed-following-wrong-conviction/",
            "content": "By Mary Taruvinga\n\nThe High Court has set aside a 10-year mandatory sentence against a Chinhoyi man who was convicted for stealing an electric cable from Athenzi farm.\n\nLuckmore Mutsindiko had his sentence quashed and case was referred back for trial before a different magistrate after the upper court ruled that he was wrongly convicted and sentenced.\n\nMutsindikowas convicted after a trial for contravening s60 A (3) (1) of the Electricity Act [Chapter 13:19] the Act for cutting, destroying or interfering with apparatus used to generate, transmit or supply electricity.\n\nHe pleaded guilty to the charge.\n\nThe court found no special circumstances, it then imposed the minimum mandatory sentence of 10 years imprisonment.\n\nDespite preferring a charge under the Electricity Act, the wording of the charge revealed a simple theftbut the trial magistrate failed to pick this.\n\nOn the other hand, the facts on the State Outline showed that an offence under the Electricity Act was committed.\n\nThe trialcourt canvassed the essential elements of theft but convicted the accused on a different chargeand Chinhoyi High Court judge, Justice Philda Muzofa ruled that this was a misdirection.\n\nThe charge was poorly drafted in this case.It is first for the prosecution to make sure that the charge is properly drafted.\n\nHowever the court as the final arbiter has the ultimate duty to make sure that the charge before it is correct.\n\nAn accused must never be convicted on a charge different from the alleged facts as in this case, noted the judge.\n\nThe State alleged that on January 30 2022 Mutsindiko unlawfully took a 30-meter X 50 millimetres core (sic) from Athenzi Farm.\n\nThe charge does not allege the actus reus (actual act) that resonates with contravening s60 A (3) (b).\n\nMuzofa said Mutsindiko allegedly took action that is not synonymous with cutting to interfere with the transmission of power.\n\nThe charge reveals a simple theft of already cut core armoured cables.\n\nHe was then convicted of the serious charge under s60 A (3) (b) of the Act.\n\nThe proceedings before the trial Court show that it did not address its mind to the facts of the case, she said.\n\nMuzofa said that oversight led to the accused being convicted of theft but sentenced for some serious offence.\n\nThe judge also said to alter the charge at this stage would be incompetent since the accused did not plead guilty to contravention of s60 A (3) (b) of the Act.\n\nShe also said quashing the proceedings and releasing the accused may not be in accordance with real and substantial justice.\n\nThe best course is to quash the proceedings and remit the matter for a trial de novo before a different Magistrate, she ruled.\n\nThe judge also said in the event that Mutsindiko is convicted, in sentencing the accused the period already served must be taken into account.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has set aside a 10-year mandatory sentence against a Chinhoyi man who was convicted for stealing an electric cable from Athenzi farm. Luckmore Mutsindiko had his sentence quashed and case was referred back for trial before a different magistrate after the upper court ruled that he was wrongly convicted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/electric-cable-thiefs-10-year-jail-term-quashed-following-wrong-conviction/\">Electric cable thief’s 10-year jail-term quashed following wrong conviction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "CBZ concedes to Competition and Tariffs Commission’s decision; plots regional market penetration",
            "url": "https://www.newzimbabwe.com/cbz-concedes-to-competition-and-tariffs-commissions-decision-plots-regional-market-penetration/",
            "content": "By Alois Vinga\n\nLISTED financial services powerhouse, CBZ Holdings Limited (CBHL) has conceded to the decision taken by the Competition and Tariffs Commission (CTC) but said it remains undeterred to penetrate the regional markets before 2025 year-end.\n\nIn a major climb down this week, CBZHL informed shareholders of the decision to withdraw its proposed mandatory offer to minority shareholders of First Mutual Holdings Limited (FMHL) after the Competition and Tariff Commission (CTC) capped its stake in the insurer at 31.22%.\n\nThe move was inspired by regulatory efforts to maintain market competition and prevent over-consolidation in Zimbabwes financial and insurance sectors.\n\nThe mandatory offer, initially announced on October 31, 2024, was triggered by CBZHLs substantial shareholding in FMHL, in line with Zimbabwe Stock Exchange Listings Requirements and the Companies and Other Business Entities Act.\n\nHowever the CTCs final decision, issued on November 29, 2024, rejected any further acquisition of FMHL shares by CBZHL, effectively blocking the proposed offer.\n\nSpeaking to NewZimbabwe.com on the sidelines of the institutions Media Cocktail event held Wednesday evening, the CBZHL group chief executive officer, Lawrence Nyazema downplayed speculation that CTCs decision had crippled plans to penetrate the regional market.\n\nHe said the CTC decision was well noted and respected duly but would not at all frustrate regional market penetration plans.\n\nYes we would have wanted to go into the region faster and easier through FMHL but we still believe we can go into the region pretty fast. Our target is to be operating in two regional countries by June 30 2025.\n\nRight now my feeling is that we are likely to get into the international markets much faster and quicker using some of our subsidiaries outside the bank because going the route of the bank establishment in a foreign land tends to be over-regulated in a lot of countries and the capital requirements for setting up a bank tend to be higher, he said.\n\nNyazema said CBZHL must not be viewed as just a bank but a group with subsidiaries which can be seized to perform regional tasks.\n\nSo we have businesses that are capital lite which have done so well locally. You look at our Asset Management which trades as Datvest . What will stop us from taking this company to another region and using its success story achieved in Zimbabwe?\n\nHe expressed optimism that by June 30 2025, CBZHL, through its subsidiaries, will be present in two countries in the region.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/25071037/Lawrence-Nyazema.jpeg",
            "description": "<p>By Alois Vinga LISTED financial services powerhouse, CBZ Holdings Limited (CBHL) has conceded to the decision taken by the Competition and Tariffs Commission (CTC) but said it remains undeterred to penetrate the regional markets before 2025 year-end. In a major climb down this week, CBZHL informed shareholders of the decision to withdraw its proposed mandatory</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cbz-concedes-to-competition-and-tariffs-commissions-decision-plots-regional-market-penetration/\">CBZ concedes to Competition and Tariffs Commission’s decision; plots regional market penetration</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "Heart Main Arena takes shape",
            "url": "https://www.newzimbabwe.com/heart-main-arena-takes-shape/",
            "content": "By Staff Reporter\n\nTHE Heart Main Arena being built in Kwekwe is taking shape, with its pitch bow almost done while construction of dressing rooms and terraces is ahead of schedule.\n\nIts construction is set to be complete by the end of January, tentatively two months before the start of the 2025 Castle Lager season.\n\nOwned by Yadah proprietor Prophet Walter Magaya and business partner Richard Chahwanda, the ground is expected to ease pressure on the few pitches approved for top-flight football use in Zimbabwe.\n\nMaterial for the grandstands has arrived, bucket seats will be delivered in two weeks and work on the pitch will be finalised before this month, said Magaya.\n\nThis stadium will be bigger than The Heart Stadium in Harare in terms of seating capacity and parking space.\n\nThe VIP stand will be three stories high, and accommodate a medical clinic and offices for ZIFAs Midlands province.\n\nConstruction is being constantly directed by a CAF-approved expert as there are plans to have it homologated for use in international competitions.\n\nMagaya owns The Heart Stadium, home of his Yadah and has built two more similar facilities in Mozambique and Malawi.\n\nCurrently, Zimbabwe does not have a single stadium approved by CAF to hold international matches, a position that has seen its national team, the Warriors hosting home matches in South Africa and Uganda.\n\nDeputy Sports Minister Emily Jesaya, who toured the facility recently encouraged other private players to also take part in the rehabilitation of old sports facilities in support of government efforts.\n\nI did not expect to see such high standards when I visited this facility. It is what we hope could be replicated by the corporate sector. This will surely go a long way, said Jesaya.\n\nMagaya is expected to run for ZIFA president in January. Reports indicate that he submitted his papers on deadline day, late Wednesday.\n\nHe fancies his chances against former legislator Temba Mliswa, ex-Warriors captain Benjani Mwaruwari and Nqobile Magwizi, who are some of the heavyweights vying for the top post.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12174024/WhatsApp-Image-2024-12-11-at-19.54.05-1.jpeg",
            "description": "<p>By Staff Reporter THE Heart Main Arena being built in Kwekwe is taking shape, with its pitch bow almost done while construction of dressing rooms and terraces is ahead of schedule. Its construction is set to be complete by the end of January, tentatively two months before the start of the 2025 Castle Lager season.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heart-main-arena-takes-shape/\">Heart Main Arena takes shape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "Zim-born actor Luthuli Dlamini rubbishes claims he is homeless",
            "url": "https://www.newzimbabwe.com/zim-born-actor-luthuli-dlamini-rubbishes-claims-he-is-homeless/",
            "content": "By Staff Reporter\n\nZimbabwean-born South African-based actor Luthuli Dlamini has dismissed claims that he is homeless and living in an abandoned house in Randburg.\n\nThis follows reports the actor who has appeared on soapies Generations, Scandal! and Uzalo had fallen on hard times and had been forcefully evicted from his home after failing to pay rent.\n\nDlamini shared a video on his Instagram page debunking the rumours. The actor said while he appreciated the accommodation offers he had received, he was not homeless.\n\nHie, I just want to dispel a few rumours, first of all, l I just wanna say thank you to everyone whos showing support for me, everyone whos offered me a house to live in, someone whos offered me a spare room I really appreciate that.\n\nI just want to dispel all of those concerns about me being homeless, Im not homeless, not at all, he says in the video where he is captured washing clothes in a plastic tub.\n\nOnline publication Zimojahad earlier reported, Failing to pay the salary led to Luthuli occupying Merciers home forcefully after failing to pay his rent. The show never made it to the screens following the incident. Attempts to get a comment from Luthuli proved fruitless as his phone went straight to voicemail.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12055911/6045_Luthuli-Dlamini-tux-zimoja.jpg",
            "description": "<p>By Staff Reporter Zimbabwean-born South African-based actor Luthuli Dlamini has dismissed claims that he is homeless and living in an abandoned house in Randburg. This follows reports the actor who has appeared on soapies Generations, Scandal! and Uzalo had fallen on hard times and had been forcefully evicted from his home after failing to pay</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-born-actor-luthuli-dlamini-rubbishes-claims-he-is-homeless/\">Zim-born actor Luthuli Dlamini rubbishes claims he is homeless</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "Telecoms business leader Masiyiwa receives honorary doctorate in Engineering from Stellenbosch University",
            "url": "https://www.newzimbabwe.com/telecoms-business-leader-masiyiwa-receives-honorary-doctorate-in-engineering-from-stellenbosch-university/",
            "content": "Stellenbosch University\n\nTechnology entrepreneur and investor Strive Masiyiwa, a pioneer of the mobile telecommunications sector in Africa, received an honorary doctorate in Engineering from Stellenbosch University (SU) on 10 December 2024. The visionary leader has over the past four decades helped to cement Africas telecoms industry and business sector, while his philanthropy has improved socioeconomic development to the benefit of the continents people.\n\nThe Faculty is humbled that Mr Masiyiwa accepted this honorary doctorate in Engineering from Stellenbosch University. He is an exemplary example of an African who did well and is now doing good by improving the lives of many Africans. The Faculty looks forward to partnering with him in our endeavour to make an impact to improve the quality of life of people in Africa, says Prof Wikus van Niekerk, Dean of the SU Faculty of Engineering.\n\nMasiyiwa, whose career is rooted in engineering, was born in Zimbabwe in 1961 and now lives in the UK. He obtained a bachelors degree in Electrical and Electronic Engineering from the University of Cardiff in Wales in 1983, after which he returned to Zimbabwe to briefly work as a telecoms engineer before setting up his first business in 1986.\n\nThe business network of this founder and executive chair ofCassava Technologiesspans Africa, Europe, India, Latin America, the Middle East, and the USA. A pan-African and global technology group, Cassava Technology businesses include African Data Centres, cloud and cyber security services (Liquid C2), fibre infrastructure (Liquid Intelligent Technologies), renewable energy, and most recently, a new business unit, Cassava AI. As part of Masiyiwas mission to ensure that no African is left behind in the digital technology revolution, his companies have ensured that more than 110,000 kilometres of fibre provide connectivity across the continent, spanning East to West Africa, and Cape Town to Cairo.\n\nAmong his other prominent start-up companies and investments over the years are Mascom Wireless Botswana, Econet Wireless Zimbabwe, Liquid Telecom, Airtel Nigeria, 2Degrees Mobile, and Trilogy Capital Partners Canada.\n\nMasiyiwa has served as a special envoy to the African Union in terms of its response to Covid-19 and an Ebola outbreak in the mid-2015s and served on various commissions of the United Nations.\n\nHis commitment to promoting education and healthcare in Africa is evident in the endeavours of his family foundations, Higherlife Foundation and Delta Philanthropies, which are led by his wife Tsitsi and eldest daughter Elizabeth Tanya. Signatories of the Giving Pledge, these foundations have supported more than 300 000 scholarships to children in Africa to date, as well as various catalytic social impact investments and initiatives in the fields of public health, the empowerment of women and girls, youth mentorship, rural transformation, sustainable livelihoods, disaster relief and preparedness. He has also been involved in pan-African initiatives that target AIDS, cholera, cervical cancer, Ebola, and most recently, Covid-19.\n\nHe was listed in 2020 as one of Bloombergs 50 most influential people in the world, and one of the ten most powerful men in Africa byForbesmagazine in 2015. In 2014, 2017 and 2021, he was included inFortunemagazines list of the worlds 50 greatest leaders. In 2019, he received the World Food Prize Borlaug Medallion for his role as Chair of the Alliance for a Green Revolution in Africa, which focused on strengthening food systems and supporting Africas smallholder farmers. He was selected in 2023 as an international honorary member of the American Academy of Arts and Sciences, and in October 2024 was awarded the W.E.B. Du Bois Medal by the Hutchins Centre of African and African American Research at Harvard University. Most recently, in November 2024, his revolutionising of telecommunications and mobile money services in Zimbabwe was recognised by the countrys ICT Excellence Award.\n\nMasiyiwa has previously received honorary doctorates from Yale University, Morehouse College in the UK, South Africas Nelson Mandela University, and his alma mater, Cardiff University. He currently serves on the boards of Netflix Inc., Bill & Melinda Gates Foundation and National Geographic Society, as well as on global advisory councils including that of Bank of America, Stanford University and Bloomberg New Economy Forum. Previously, he held board positions at Unilever Plc, The Rockefeller Foundation and Morehouse College, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/30040500/Strive-Masiyiwa.jpg",
            "description": "<p>Stellenbosch University Technology entrepreneur and investor Strive Masiyiwa, a pioneer of the mobile telecommunications sector in Africa, received an honorary doctorate in Engineering from Stellenbosch University (SU) on 10 December 2024. The visionary leader has over the past four decades helped to cement Africa’s telecoms industry and business sector, while his philanthropy has improved socioeconomic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/telecoms-business-leader-masiyiwa-receives-honorary-doctorate-in-engineering-from-stellenbosch-university/\">Telecoms business leader Masiyiwa receives honorary doctorate in Engineering from Stellenbosch University</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "ZIMRA cracks whip on churches, taxes anointing oil, merchandise",
            "url": "https://www.newzimbabwe.com/zimra-cracks-whip-on-churches-taxes-anointing-oil-merchandise/",
            "content": "By Staff Reporter\n\nZIMBABWE Revenue Authority (ZIMRA says churches are compelled to pay taxes on profits generated from the sale of church merchandise.\n\nZIMRA is expecting churches to pay taxes from the sale of goods such as anointingoil, and t-shirts among others which are being produced as part of fundraisingactivities.\n\nHowever, tithes and donations havenotbeen charged by ZIMRA.\n\nZIMRA in a noticepublished Thursday said it will be engaging churches on tax compliance.\n\nThe Zimbabwe Revenue Authority (ZIMRA), wishes to inform all churches of an upcoming Stakeholder Engagement dedicated to addressing tax compliance across all applicable tax categories.\n\nIncome derived from trading activities is subject to income tax. Examples of taxable income include but are not limited to: Proceeds from the sale of church literature, books, or music, revenue from the sale of church-branded merchandise (e.g., apparel, anointing oils, artefacts, etc.), Income from the sale of meals, clothing, or similar items. Additionally, such sales may attract Value Added Tax (VAT) depending on the sales thresholds, read the notice.\n\nReligious organisations have been engaged in fundraising activities and some have been reportedly failing to declare tax.\n\nIn 2019 the State dragged Prophetic, Healing, and Deliverance Ministries leader Walter Magaya to court for failing to declare tax of more than $28 million accrued from 2018 to 2019 contravening the Value Added Tax Act.\n\nThe church generated revenue from regalia, anointing oil and a guest house at Yadah Hotel in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/08/17062813/Churches-e1629178113164.jpg",
            "description": "<p>By Staff Reporter ZIMBABWE Revenue Authority (ZIMRA says churches are compelled to pay taxes on profits generated from the sale of church merchandise. ZIMRA is expecting churches to pay taxes from the sale of goods such as anointing oil, and t-shirts among others which are being produced as part of fundraising activities. However, tithes and donations have not been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimra-cracks-whip-on-churches-taxes-anointing-oil-merchandise/\">ZIMRA cracks whip on churches, taxes anointing oil, merchandise </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "2025 National Budget: Mthuli Ncube’s ‘blood-sucking’ taxes draws fire from Industry",
            "url": "https://www.newzimbabwe.com/2025-national-budget-mthuli-ncubes-blood-sucking-taxes-draws-fire-from-industry/",
            "content": "By Alois Vinga\n\nTHE gruelling tax measures introduced by Finance Minister Mthuli Ncube in his latest 2025 National Budget have spilt over to parliament following concerns raised by Industry hinting the interventions are set to destroy whatever is left of the formal sector.\n\nRattled by the endless piling up of taxes on the industry, which experts warn may diminishthe little gains of what remainsin the delicate formal sector, Business Member Organisations (BMOs) concerns exposedgrave inconsistencies in the National Budget Blueprint requiring urgent redress.\n\nA Non-Adverse Report received by the Parliamentary Legal Committee contains several concerns raised by Industry.\n\nFor instance, the Confederation of Zimbabwe Industries (CZI)says withthe reduction of the degree of export orientation from 100% to 80% for manufacturing companies under SEZ it will be difficult to penetrate the export market due to highproductioncosts.\n\nWe are of the view that the 25% tax on rental income istoo high as there are other costs to be met by rental income collections, like renovations, maintenance costs among others. The proposal is to ensure that the tax is applied on net rental income as opposed to gross revenue from rentals, the industry lobby group said.\n\nCZI further submitted that IMTT taxes the whole value chain resulting in up to 10% additional costs to products leaving local products priced relatively higher than regional products.\n\nThe Confederation of Zimbabwe Retailers (CZR) CZR proposed the removal of tax on fast foods and betting tax which seem to target the poor.\n\nThere are a number of taxes charged on the purchase of food such as VAT, IMTT and the proposed fast-food tax which further burdens the poor. Such taxes need stakeholder consultations before they are introduced, the retailers group said.\n\nThe Chamber of Mines noted that the 2025 National Budget Statement was announced at a time when the mining industry is operating below its potential on the back of a challenging environment characterised by weak commodity prices, foreign currency shortfalls, capital shortages and fragile power supply.\n\nCoupled with a high-cost structure on the backdrop of high royalties and taxes, high electricity tariff, exchange rate losses and high cost of funding mining projects, the viability of mining companies has been severely compromised. These challenges have combined to weigh down on the performance of the mining industry with mineral revenue coming down significantly and mining companies struggling to meet their production targets.\n\nThe proposal to extend the royalty on coal to all types of coal, including coking and industrial coal, will increase production costs in the energy sector. This extension translates into higher operational expenses, impacting various downstream industries. Specifically, the cost of generating thermal power is likely to rise, as this additional cost will be passed down to Zimbabwe Power Company (ZPC), the miners group said.\n\nThe grouping contends that the agriculture industry, particularly the tobacco sector, will be directly affected by the increased cost of industrial coal used for tobacco curing.\n\nMiners also expressed dissatisfaction over Ncubespolicy to the effect that minerals will be deemed sold at the value determined on either the date the sales contract is entered or the date on which the purchaser receives the product, whichever is higher.\n\nThe proposed measure may lead to disputes between ZIMRA and taxpayers, as during periods of price declines, ZIMRA may require miners to pay royalties on unrealised cash proceeds, the Chamber of Mines said.\n\nMiners also contested the 20% Capital Gains Tax as too high and way beyond the regional averages. They were of the view that the tax must not be applied in retrospect and that the rate be maintained at 5% as effected in 2017.\n\nRoyalty for platinum is high at 7%, the Chamber of Mines recommends a commodity price-linked royalty framework for platinum as follows: a base royalty of 3 % for the platinum price of up to US$1,100 / ounce, a royalty rate of 5% for a platinum price between US$1,100 /ounce and US$1,400, a royalty rate of 7% for platinum price between US$1,400/ounce and US$2,000/ounce and a royalty of 10% for platinum price above US$2,000 ounce.\n\nRoyalty for diamonds at 10% is also impacting negatively on the viability of diamond projects. Producers of alluvial diamonds which are predominantly low quality are the most affected as their prices have taken a huge knock, the report reads.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/01093427/mthuli-1.jpg",
            "description": "<p>By Alois Vinga THE gruelling tax measures introduced by Finance Minister Mthuli Ncube in his latest 2025 National Budget have spilt over to parliament following concerns raised by Industry hinting the interventions are set to destroy whatever is left of the formal sector. Rattled by the endless piling up of taxes on the industry, which</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/2025-national-budget-mthuli-ncubes-blood-sucking-taxes-draws-fire-from-industry/\">2025 National Budget: Mthuli Ncube’s ‘blood-sucking’ taxes draws fire from Industry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        },
        {
            "title": "In Tune with the Mind: Happy Hormones",
            "url": "https://www.newzimbabwe.com/in-tune-with-the-mind-happy-hormones/",
            "content": "By Nqoba M Sibenke\n\nOne thing I find fascinating is the mechanism that regulates our mood. Mood refers to a state of the mind at a certain time for example happiness, sadness, gloom, excitement etc.\n\nOur body has mood regulators in the form of hormones which determine our mood at a particular time. Hormones are chemicals that the body produces for specific functions. When we feel unhappy and stressed certain hormones are responsible for unhappiness. Similarly, there are also happy hormones or happy juices. These enhance our happiness and reduce stress. These are Oxytocin, endorphins, serotonin and Dopamine. These four juices work differently from each other. They also have different roles and characteristics.\n\nDOPAMINE\n\nDopamine is also known as the feel good hormone. It is both a neurotransmitter and a hormone. A neurotransmitter is a chemical that relays information between nerve cells in the brain and the rest of the body. As a neuro hormone, it is produced by the hypothalamus in the brain. Dopamine has several functions which include movement, memory, pleasurable reward and motivation, behaviour and cognition, attention, sleep and arousal, mood, and learning.\n\nDopamine has been said to function based on motivation and reward. When we do a pleasurable activity we feel motivated which stimulates the secretion of Dopamine. As Dopamine is released we feel good and motivated to do more of the pleasurable activity. However, this can also lead to addiction.\n\nWhen we have balanced levels of Dopamine we will feel happy, motivated, alert and focused. On the other hand low levels of the hormone result in poor memory, fatigue, sadness, mood swings, and poor concentration among others. There is also a relationship between levels of Dopamine and mental disorders like schizophrenia, Mania, ADHD, Parkinsons and Addictions. To have healthy Dopamine levels we need to engage more in activities that give us pleasure however moderation is essential.\n\nENDORPHINS\n\nEndorphins function as painkillers. They are in actual fact natural pain killers. They get their name from a combination of two words endogenous  and morphine . Most of us are aware of the function of morphine which is to ease pain. When we are hurt or are experiencing pain, nerves communicate with the brain and the brain releases Endorphins.\n\nEndorphins can be naturally stimulated by engaging in activity that rewards like eating, massage, intimacy, dancing and such activities. It should be noted that Endorphins might have similarities with Dopamine however their function is different.\n\nA deficiency of Endorphins can result in a number of negative symptoms such as anxiety, depression, addiction, and sleep disorders among many others.\n\nSEROTONIN\n\nLike Dopamine, Serotonin also doubles as a neurotransmitter. Its key functions include learning, memory, and happiness as well as regulating body temperature, sleep, sexual behaviour and hunger. It is a key hormone which is mostly found in the gut.\n\nSerotonin has been known to be a mood stabilizer. It creates a feeling of calmness and emotional stability. Lack of Serotonin may result in mood disorders, depression, anxiety, sleep disorders, digestive disorders, suicidal behaviour, OCD, phobia and many other issues. It is therefore important to ensure good production of Serotonin, this can be done by exercising and sunbathing moderately.\n\nOXYTOCIN\n\nThe love hormone  as it is commonly known, Oxytocin is responsible for enhancing happiness through bonding. It is produced in the hypothalamus. Oxytocin has been proven to be responsible for smooth labour during childbirth. After childbirth, it helps in lactation which is the production of milk for the baby.\n\nAmong its many functions, Oxytocin helps in regulating sleep and moods. It promotes overall wellness and mental stability. It is enhanced mostly by intimate actions like touch, hugging, cuddling, and sexual activity among many others.\n\nCONCLUSION\n\nHaving discussed briefly about hormones that regulate mood and produce positive emotions, it is apparent that we can be deliberate in determining our mood.\n\nAn exception is in cases where the body is unable to produce the particular hormones. In such cases, medication is usually given for example Selective serotonin reuptake inhibitors which help boost Serotonin levels and control Depression. Similarly, in the case of Dopamine, the doctor can prescribe antidepressants and dopamine reuptake inhibitors.\n\nMood has a huge impact on our total wellness hence the importance of acquiring knowledge on how we can harness the faculties that regulate mood.\n\nAs we approach the festive season, a season of joy, giving and all good things let us make the best of our happy hormones and help others to be happy too.\n\nNqoba Sibenke is a registered intern Counselling Psychologist and can be reached atnqoba.sibenke@icloud.com/ +263715330911\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/12112138/happyhormones.png",
            "description": "<p>By Nqoba M Sibenke One thing I find fascinating is the mechanism that regulates our mood. Mood refers to a state of the mind at a certain time for example happiness, sadness, gloom, excitement etc. Our body has mood regulators in the form of hormones which determine our mood at a particular time. Hormones are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-tune-with-the-mind-happy-hormones/\">In Tune with the Mind: Happy Hormones</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "2024-12-13 06:51:55"
        }
    ]
}