{
    "news": [
        {
            "title": "Zimbabwe agrees $455 million power plant refurbishment deal with Jindal",
            "url": "https://www.newzimbabwe.com/zimbabwe-agrees-455-million-power-plant-refurbishment-deal-with-jindal/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/09033305/Hwange-Power-Station.png",
            "description": "<p>Reuters Zimbabwe has agreed a $455 million, 15-year concession deal with the Africa-focused unit of India’s Jindal Steel (JINT.NS), for the refurbishment of a 920 megawatt coal-fired power plant, the energy minister said. The work on six ageing units at the Hwange thermal power station is expected to take four years, July Moyo said during a post-cabinet</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-agrees-455-million-power-plant-refurbishment-deal-with-jindal/\">Zimbabwe agrees $455 million power plant refurbishment deal with Jindal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Presbytery Church Trust row deepens as High Court refuses bid to dismiss case",
            "url": "https://www.newzimbabwe.com/presbytery-church-trust-row-deepens-as-high-court-refuses-bid-to-dismiss-case/",
            "content": "By Mary Taruvinga\n\nThe High Court has refused to throw out a lawsuit filed by the Presbytery of Zimbabwe of the Uniting Presbyterian Church in Southern Africa in a bitter dispute over the control and management of church-run schools.\n\nJustice Faith Mushure dismissed an application for absolution from the instance lodged by trustees of the Presbytery of Zimbabwe Education Trust, ruling that the matter had to proceed to full trial.\n\nThis is not an appropriate case to decree absolution from the instance, ruled Justice Mushure. I must assume that the evidence placed before me is true. There is evidence upon which a court, directing its mind reasonably to such evidence, could or might find for the plaintiff.\n\nThe church is challenging the validity of the trust that oversees its schools, accusing trustees of fraudulently registering it, mismanagement, and failing to account for funds. It is also seeking the trusts dissolution.\n\nCentral to the row are two deeds of trust allegedly registered under the same number in 2010 but with different founders  Reverends Paul Neshangwe and Wilbert Runyararo Sayimani. Both clergymen denied ever appearing before a notary to establish the trust, with Justice Mushure noting their testimonies raised prima facie irregularities.\n\nThe judge stressed that the trustees could not avoid scrutiny through legal technicalities.\n\nQuoting precedent, she said: A defendant who might be afraid to go into the witness box should not be permitted to shelter behind the procedure of absolution from the instance.\n\nThe case also raised red flags over school governance, with financial statements from 2013 to 2017 accounting for only three out of nine schools under the trust. Evidence was also led of trustees allegedly deriving personal benefits and parents expressing disquiet over mismanagement.\n\nRejecting the trustees argument that the church lacked authority to dissolve the trust, Justice Mushure noted: Under common law, the court has powers both to vary or terminate trusts in certain conditions  if the trust is being run contrary to the interests and objectives of the trust.\n\nThe trial is set to resume on September 25.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17163250/Presbytery-e1758123204645.jpg",
            "description": "<p>By Mary Taruvinga The High Court has refused to throw out a lawsuit filed by the Presbytery of Zimbabwe of the Uniting Presbyterian Church in Southern Africa in a bitter dispute over the control and management of church-run schools. Justice Faith Mushure dismissed an application for absolution from the instance lodged by trustees of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/presbytery-church-trust-row-deepens-as-high-court-refuses-bid-to-dismiss-case/\">Presbytery Church Trust row deepens as High Court refuses bid to dismiss case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Israel has committed genocide in Gaza, UN commission of inquiry says",
            "url": "https://www.newzimbabwe.com/israel-has-committed-genocide-in-gaza-un-commission-of-inquiry-says/",
            "content": "BBC\n\nA United Nations commission of inquiry says Israel has committed genocide against Palestinians in Gaza.\n\nA new report says there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023: killing members of a group, causing them serious bodily and mental harm, deliberately inflicting conditions calculated to destroy the group, and preventing births.\n\nIt cites statements by Israeli leaders, and the pattern of conduct by Israeli forces, as evidence of genocidal intent.\n\nIsraels foreign ministry said it categorically rejected the report, denouncing it as distorted and false.\n\nThe Israeli military launched a campaign in Gaza in response to the unprecedented Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 were taken hostage.\n\nAt least 64,964 people have been killed in Israeli attacks in Gaza since then, according to the territorys Hamas-run health ministry, whose figures are seen as reliable by the UN.\n\nMost of the population has also been repeatedly displaced; more than 90% of homes are estimated to be damaged or destroyed; the healthcare, water, sanitation and hygiene systems have collapsed; and UN-backed food security experts have declared a famine in Gaza City.\n\nReuters The mother of a Palestinian teenager killed by Israeli fire mourns during his funeral at a hospital in Gaza City in August\n\nThe Independent International Commission of Inquiry on the Occupied Palestinian Territory was established by the UN Human Rights Council in 2021 to investigate all alleged violations of international humanitarian and human rights law.\n\nThe three-member expert panel is chaired by Navi Pillay, a South African former UN human rights chief who was president of the international tribunal on Rwandas genocide. The two other members are Chris Sidoti, an Australian human rights lawyer, and Miloon Kothari, an Indian expert on housing and land rights.\n\nThe commission has previously concluded that Hamas and other Palestinian armed groups committed war crimes and other grave violations of international law on 7 October 2023, and that Israeli security forces have committed crimes against humanity and war crimes in Gaza.\n\nThe commission saidits latest reportwas the strongest and most authoritative UN finding to date on the war. However, it does not officially speak for the UN.\n\nThe 72-page document alleges that Israeli authorities and Israeli security forces have committed and are continuing to commit four of the five acts of genocide defined under the 1948 Genocide Convention against a national, ethnic, racial or religious group  in this case, Palestinians in Gaza:\n\nTo fulfil the legal definition of genocide under the Genocide Convention, it must also be established that the perpetrator committed any one of those acts with specific intent to destroy the group in whole or in part.\n\nWe went to the facts first, Pillay told the BBC. So we looked at statements made by the Israeli authorities indicating genocidal intent. And we looked at the pattern of conduct of Israeli authorities and Israeli security forces to show that genocidal intent was the only reasonable inference.\n\nIsraels political and military leaders have consistently said its militarys operations in Gaza are conducted in self-defence, to defeat Hamas and other Palestinian armed groups, and to secure the release of Israeli hostages.\n\nThey have also insisted that Israeli forces operate in accordance with international law and take all feasible measures to mitigate harm to civilians.\n\nHowever, the commissions report concludes that President Isaac Herzog, Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant have incited the commission of genocide in their speeches and statements.\n\nAs early as 7 October 2023, Prime Minister Netanyahu vowed to inflict mighty vengeance on all of the places where Hamas is deployed, hiding and operating in, that wicked city, we will turn them into rubble, Pillay said.\n\nHis use of the phrase wicked city in the same statement implied that he saw the whole city of Gaza [Gaza City] as responsible and a target for vengeance. And he told Palestinians to leave now because we will operate forcefully everywhere.\n\nGallant said days after 7 October 2023 that Israel was fighting human animals, and we act accordingly. Herzog meanwhile stated that its an entire nation out there that is responsible for the Hamas-led attack.\n\nReuters The Israeli military has ordered hundreds of thousands of Palestinians to evacuate Gaza City ahead a ground offensive to conquer it\n\nThe commission also says genocidal intent was the only reasonable inference that could be concluded from the pattern of conduct of Israeli authorities and security forces in Gaza.\n\nThat has allegedly included intentionally killing and seriously harming an unprecedented number of Palestinians using heavy munitions; systematic and widespread attacks on religious, cultural and education sites; imposing a siege on Gaza and starving its population.\n\nPillay added: It took us two years to gather all the actions and make factual findings, verify whether that had happened Its only the facts that will direct you. And you can only bring it under the Genocide Convention if those acts were done with this intention.\n\nThe commission says the acts of Israeli political and military leaders are attributable to the State of Israel, and that the state therefore bears responsibility for the failure to prevent genocide, the commission of genocide and the failure to punish genocide.\n\nIt also warns all other countries have an immediate obligation under the Genocide Convention to prevent and punish the crime of genocide, employing all measures at their disposal. If they do not, it says, they could be complicit.\n\nIn a statement, the Israeli foreign ministry accused the three members of the commission of serving as Hamas proxies.\n\nThe report relies entirely on Hamas falsehoods, laundered and repeated by others. These fabrications have already been thoroughly debunked, it said.\n\nIn stark contrast to the lies in the report, Hamas is the party that attempted genocide in Israel  murdering 1,200 people, raping women, burning families alive, and openly declaring its goal of killing every Jew.\n\nAn Israeli military official dismissed the report as baseless, saying: No other country has operated in these conditions and done so much to prevent harm to civilians on the battlefield.\n\nPresident Herzog also condemned the report, which he said had misinterpreted his words, according to Reuters news agency.\n\nThe Israeli foreign ministry also said that the commissions members should not be replaced when they step down from their roles later this year, and that the commission itself should instead be abolished.\n\nIn July, all three members submitted their resignations to the UN Human Rights Council. Pillay, who is 83, cited her age, medical issues and the weight of several other commitments, while Sidoti said her retirement marked an appropriate time to reconstitute the commission.\n\nA number of international and Israeli human rights organisations, independent UN experts, and scholars have also accused Israel of genocide against Palestinians in Gaza.\n\nThe UN says it cannot make a legal determination as to whether a situation constitutes genocide under international law. It says a situation is referred to as genocide only after a competent national or international court has declared it as such.\n\nWhen asked by journalists on Tuesday if he would consider using the word genocide to describe Israels actions in Gaza, UN human rights chief Volker Trk said: Its for the court to decide whether its genocide or not, and we see the evidence mounting.\n\nA spokesman for the UK government also said the decision was up to a court, but added that this does not take away from our position that Israels actions are appalling.\n\nThe International Court of Justice (ICJ) is currently hearing a case brought by South Africa that accuses Israeli forces of genocide, but it could take years to reach a conclusion. Israel has called the case wholly unfounded and based on biased and false claims.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/29045412/gaza.jpeg",
            "description": "<p>BBC A United Nations commission of inquiry says Israel has committed genocide against Palestinians in Gaza. A new report says there are reasonable grounds to conclude that four of the five genocidal acts defined under international law have been carried out since the start of the war with Hamas in 2023: killing members of a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/israel-has-committed-genocide-in-gaza-un-commission-of-inquiry-says/\">Israel has committed genocide in Gaza, UN commission of inquiry says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Parliament: Justice advocate pushes for mandatory DNA testing in maintenance cases",
            "url": "https://www.newzimbabwe.com/parliament-justice-advocate-pushes-for-mandatory-dna-testing-in-maintenance-cases/",
            "content": "By Anna Chibamu\n\nKadoma-based entrepreneur and litigation expert, Believe Guta, has petitioned Parliament, calling for mandatory DNA testing inmaintenance cases, saying no man should face jail for defaulting on child support before paternity is proven.\n\nAppearing before the Justice and Legal Parliamentary Portfolio Committee, chaired by Masvingo Central MP Edson Zvobgo (Jnr) on Tuesday, Guta urged lawmakers to amend Section 23 of the Maintenance Act [Chapter 5:09] to require confirmation of biological parentage before prosecution.\n\nHe argued that many men in Zimbabwe had been jailed for defaulting on maintenance orders only to later discover through DNA tests that they were not the biological fathers of the children in question.\n\nSection 49(1)(a) of the Constitution guarantees the right to personal liberty, which should not be arbitrarily deprived, Guta said. Yet under the current law, numerous men have been imprisoned in circumstances where paternity was disputed or later disproved.\n\nBelieve Guta\n\nFounder of Big Brains Legal Aid Trust, Guta said the current system had caused irreparable harm, including loss of liberty, reputational damage, and psychological trauma.\n\nThere is no ministry responsible for men, yet we have one for Womens Affairs. The plight of men has been neglected. Many are suffering in silence, he told the committee.\n\nHe proposed the insertion of a new subsection to the Maintenance Act: No proceedings shall be instituted unless the paternity of the child has been established by voluntary acknowledgement, court declaration, or DNA testing where paternity is disputed.\n\nGuta further suggested that Parliament introduce a statutory review mechanism to reassess past cases where men were imprisoned without conclusive proof of paternity.\n\nCiting statistics, he said the African Institute of Bio-Medical Research found that 32% of maintenance-related disputes in 2019 revealed non-biological fathers, while Global DNAs data indicated up to 72% exclusion rates in tested cases\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/19163303/DNA-test.jpg",
            "description": "<p>By Anna Chibamu Kadoma-based entrepreneur and litigation expert, Believe Guta, has petitioned Parliament, calling for mandatory DNA testing in maintenance cases, saying no man should face jail for defaulting on child support before paternity is proven. Appearing before the Justice and Legal Parliamentary Portfolio Committee, chaired by Masvingo Central MP Edson Zvobgo (Jnr) on Tuesday, Guta</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-justice-advocate-pushes-for-mandatory-dna-testing-in-maintenance-cases/\">Parliament: Justice advocate pushes for mandatory DNA testing in maintenance cases</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Mufakose residents forced to vacate homes as raw sewage floods yards",
            "url": "https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/",
            "content": "By Darlington Gatsi\n\nFRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges.\n\nMufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation.\n\nCombined Harare Residents Association (CHRA) blasted the lackadaisical approach by the city fathers in addressing the plight of Mufakose residents.\n\nThe City of Harare has been reluctant to resolve the issue, and the residents continue to be affected since registering their first complaint with the Mufakose District office a month ago.\n\nThe situation is dire to the extent that some residents have since vacated their houses following the flow and flooding of their houses with raw sewerage.\n\nUnfortunately, residents have now resorted to open defecation in bushes as an alternative, since their toilets and bathrooms are no longer accessible due to sewer flooding and gushing from toilets, said CHRA in a statement.\n\nThis comes amid reports that Harare City Council employees are on strike, having declared incapacitation following the deaths of colleagues.\n\nHarare residents have been made to endure the city fathers failure to deliver services to the capitals populace.\n\nThe CHRA said the situation is a ticking time bomb that might cause disease outbreaks in the high-density area of Mufakose.\n\nFormal and informal complaints have been made to the local City of Harare District Officer but have yielded no result in addressing the sewerage bursts/blockages.\n\nWe are of the view that the following rights provided in Chapter 4 of the Constitution of Zimbabwe are being infringed or being violated;\n\nSection 73(1) Right to an environment that is not harmful to health or wellbeing; the magnitude of the sewerage bursts are exposing residents to waterborne diseases, and so far residents who reside in Nondo Street have been complaining of stomach pains and diarrhoea and the epicentre of the diarrhoea cases is Nondo Street.\n\nHouses are no longer habitable and at No 18 and 16 Nondo Street residents have evacuated from their houses, and the houses are no longer occupied due to the flooding of the sewer in the houses and yards. In addition, the stench coming out from the sewer is choking, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16215440/mufakose.jpeg",
            "description": "<p> By Darlington Gatsi FRUSTRATED Mufakose residents have vacated their homes as the City Council fails to address incessant sewer blockages in the suburb, posing serious health challenges. Mufakose residents have endured sewer blockages for over a month, with the Harare City Council showing reluctance to address the dire situation. Combined Harare Residents Association (CHRA) blasted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mufakose-residents-forced-to-vacate-homes-as-raw-sewage-floods-yards/\">Mufakose residents forced to vacate homes as raw sewage floods yards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Blue Ribbon stops operations at Bulawayo plant due to grain shortage",
            "url": "https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/",
            "content": "By Staff Reporter\n\nOne of Zimbabwes largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain.\n\nThe shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of grain in April this year.\n\nGrain Millers Association of Zimbabwe (GMAZ) Southern Region Chairperson David Moyo painted a bleak picture of dwindling local maize supplies.\n\nAt the beginning, we were able to buy from local farmers and the maize was there.\n\nBut now, it is hard to fill a 30-tonne truck. Sometimes you get three or two 50kg bags a day. It takes a week to fill a truck, said Masuka.\n\nIn response to appeals from millers the government recently lifted the ban on maize imports.\n\nHowever, a new statutory instrument introduced to govern imports has created further complications.\n\nThe regulation imposes a levy on the price difference between imported maize (US$300/tonne from South Africa) and the local producer price (US$200/tonne), payable to the Agricultural Marketing Authority (AMA).\n\nMoyo says this measure is making it financially unviable for millers to import the maize they desperately need to keep their plants operational.\n\nThe statutory instrument is unfair and costly. Eventually, the burden will be passed on to the consumer, Moyo said.\n\nWe are simply asking the government to allow millers to import maize freely, without these added levies, as was previously the case.\n\nHe further emphasised that deregulating the maize import framework would allow market forces to determine prices, ultimately lowering the cost of mealie meal for consumers.\n\nThe private sector is here to complement the government. We are partners in ensuring that no Zimbabwean goes hungry in line with the Presidents own promise that no one will be left behind, Moyo said.\n\nThe continued closure of key milling plants like Blue Ribbon in Bulawayo not only threatens food security in urban areas but also risks job losses and rising mealie meal prices at a time when most households are already battling inflation and economic hardship.\n\nMillers are now calling on the Ministry of Lands, Agriculture, Fisheries, Water and Rural Development to urgently review the statutory instrument and allow for flexible, cost-effective maize importation to stabilise the milling industry.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/16221910/blue-ribbon.jpg",
            "description": "<p>By Staff Reporter One of Zimbabwe’s largest milling companies, Blue Ribbon Foods, has halted operations at its Bulawayo plant due to an acute shortage of grain. The shutdown was confirmed on Monday during a tour of the plant with Blue Ribbon Sales Coordinator for Matabeleland North, Nqabutho Mkhize, revealing that the company ran out of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blue-ribbon-stops-operations-at-bulawayo-plant-due-to-grain-shortage/\">Blue Ribbon stops operations at Bulawayo plant due to grain shortage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Young Warriors’ calamitous COSAFA campaign exposes ZIFA’s neglect of junior football",
            "url": "https://www.newzimbabwe.com/young-warriors-calamitous-cosafa-campaign-exposes-zifas-neglect-of-junior-football/",
            "content": "By Darlington Gatsi\n\nZIMBABWE under-17 boys disastrous performance at the ongoing COSAFA tournament has once again exposed the local football mother bodys neglect of the grassroots system.\n\nThe Young Warriors were knocked out of the tournament on Monday by Comoros, suffering a 3-2 defeat, which left them winless in Group A, alongside fellow underperformers Eswatini.\n\nThe defeat at Ngoni Stadium exposed the Zimbabwe Football Associations (ZIFA) lack of investment and clear structures in grassroots football.\n\nWhen Nqobile Magwizi ascended to the presidency of ZIFA earlier this year, he promised sweeping changes at junior level football.\n\nMonths later, ZIFA hastily organised trials to assemble the Young Warriors squad, resulting in the humiliation of bowing out of the COSAFA tournament without a win.\n\nZimbabwe managed to score two goals against Comoros after enduring more than 180 minutes without finding the back of the net against Mozambique and Eswatini.\n\nYoung Warriors coach Thulani Sibanda was blunt in his assessment of the squad that was assembled for the tournament.\n\nYou saw the games. You saw the goals that we conceded. Just look at the three goals that we conceded; even social players can defend those goals.\n\nThe truth of the matter is that we are discovering the quality of these players here; that is a fact I cannot run away from, said Sibanda.\n\nCrashing out of COSAFA is a missed chance for Zimbabwe to qualify for the Africa Cup of Nations to be held in Morocco next year.\n\nZimbabwe also missed a shot to compete for one of the 10 slots for African teams that will qualify for the expanded 48-team Under 17 World Cup to be hosted by Qatar next year.\n\nSibanda further said the lack of sufficient preparation culminated in Zimbabwe performing badly.\n\nThe truth of the matter is, in football there are players that are introverts and there are players that are extroverts; those that quickly express themselves and there are players that will take time to express themselves. If you have a longer time to select players you can see both of those players, he said.\n\nAn assignment is on ZIFA and the newly appointed technical director, Dominique Niyonzima, to conjure a plan and craft a junior football policy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Darlington Gatsi ZIMBABWE under-17 boys’ disastrous performance at the ongoing COSAFA tournament has once again exposed the local football mother body’s neglect of the grassroots system. The Young Warriors were knocked out of the tournament on Monday by Comoros, suffering a 3-2 defeat, which left them winless in Group A, alongside fellow underperformers Eswatini.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-calamitous-cosafa-campaign-exposes-zifas-neglect-of-junior-football/\">Young Warriors’ calamitous COSAFA campaign exposes ZIFA’s neglect of junior football </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        },
        {
            "title": "Zimbabwean households are more food secure, citizens living better lives – government",
            "url": "https://www.newzimbabwe.com/zimbabwean-households-are-more-food-secure-citizens-living-better-lives-government/",
            "content": "By James Muonwa\n\nSTRATEGIC interventions by the government have improved food security and the quality of life for citizens, a survey has established.\n\nAccording to findings of the 2025 Zimbabwe Livelihoods Assessment Committee (ZimLAC) Reports, nutrition has improved both in urban andrural areas.\n\nIn a post-Cabinet media briefing held in Harare this Tuesday, Information, Publicity and Broadcasting Services Minister Jenfan Muswere said Cabinet had considered the reports on Urban Livelihoods, Rural Livelihoods and Rural Nutrition, which were compiled following nationwide assessments conducted between February 19 and March 2 and May 21 to June 9, 2025.\n\nHe said the annual surveys were meant to provide up-to-date information on living conditions across the country, informing policy formulation and strengthening government schemes.\n\nGovernments strong interventions have resulted in improved food security, with the State being the main source of social support in the aftermath of an erratic start to the 2024/2025 summer rainfall season, Muswere said.\n\nHe said the Second Republics milestones are anchored on the framework of national and international strategies such as the National Development Strategy 1 (2021-2025), the Food and Nutrition Security Policy, the Sustainable Development Goals (SDGs), and the Zero Hunger Strategy.\n\nOn nutrition, the proportion of households consuming globally acceptable diets jumped in 2025, signalling an overall improvement in living standards, Muswere noted.\n\nChild health indicators also improved, with Vitamin A supplementation for children aged 6 to 59 months surpassing the 90% national threshold.\n\nHowever, the report raised concern over rising lifestyle-related health challenges, with 35% of adults aged 18 to 59 years classified as overweight or obese.\n\nMuswere pointed out the need to heighten awareness, early disease screening, and implementation of appropriate mitigatory measures.\n\nThe rollout of the Pfumvudza/Intwasa climate-proofing strategy increased from 47% in 2023 to 54% in 2025, reflecting growing resilience in rural households.\n\nMuswere said the government will continue to strengthen social protection programmes targeting vulnerable groups such as widows, child-headed families and persons with disabilities.\n\nThe able-bodied will be encouraged to undertake public works that create community assets while benefiting from Government support schemes, the minister added.\n\nHe further noted that the sustained delivery of social protection, coupled with improved food security and nutrition, had improved social stability, health, education and overall community well-being across Zimbabwe.\n\nIn the education sector, Treasury disbursed ZiG 40 million to cover arrears under the Basic Education Assistance Module (BEAM) dating back to 2023.\n\nGovernment, Muswere added, would continue to prioritise BEAM payments to safeguard access to education for vulnerable learners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09054809/muswere.jpeg",
            "description": "<p>By James Muonwa STRATEGIC interventions by the government have improved food security and the quality of life for citizens, a survey has established. According to findings of the 2025 Zimbabwe Livelihoods Assessment Committee (ZimLAC) Reports, nutrition has improved both in urban and rural areas. In a post-Cabinet media briefing held in Harare this Tuesday, Information, Publicity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-households-are-more-food-secure-citizens-living-better-lives-government/\">Zimbabwean households are more food secure, citizens living better lives – government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "17 Sep 2025"
        }
    ]
}