{
    "news": [
        {
            "title": "Another profit-making scheme! – Harare residents slam government’s prepaid water meters plan amid ongoing crisis",
            "url": "https://www.newzimbabwe.com/another-profit-making-scheme-harare-residents-slam-governments-prepaid-water-meters-plan-amid-ongoing-crisis/",
            "content": "By Thandiwe Garusa\n\nHARARE residents are opposing the governments plan to roll out prepaid water meters, arguing the move will not solve the citys ongoing water shortages, poor water quality and widespread leakages.\n\nThe government announced plans to install prepaid water meters across the country, starting with the capital city, Harare, to improve water management and responsible use.\n\nIn a statement Tuesday, Harare Residents Trust (HRT) accused local authorities of failing to establish a transparent and accountable water management system and argued that this will be another profit-making scheme at the expense of residents.\n\nPrepaid water meters will never help improve the quantity of water delivered to the residents, nor will they address the quality of the water supplied.\n\nGiven the deliberate failure by the local authorities, especially the City of Harare (CoH), to secure a functional, transparent and accountable enterprise resources planning system, it is prudent to initially invest in plugging the leakages and illegal water connections along the water distribution network to reduce non-revenue water.\n\nThe private companies being brought in by the national government to provide the prepaid water meters and be involved in the whole water value chain are interested in profit and not improving service delivery, HRT said.\n\nThe residents trust also accused the government and CoH of quietly signing the deal under a Build-Operate-Transfer model without involving the most affected stakeholders, which are the taxpayers.\n\nThe water infrastructure contract was given to a Hangzhou Liaison Technology Company and Helcraw Electrical Company without going to tender and the contents of the contracts remain unknown to the public.\n\nHelcraw is owned by Zanu PF legislatorfor Murehwa West constituency,Farai Jere.\n\nMeanwhile,HRT urged parliamentary committees to hold public hearings so Zimbabweans can share their views on the water meter policy.\n\nHarare has faced a growing water crisis for years, with daily water supply going downa mix of poor maintenance, pollution and leaking pipes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08222232/prepaidwatermeters-825x510-1.jpg",
            "description": "<p>By Thandiwe Garusa HARARE residents are opposing the government’s plan to roll out prepaid water meters, arguing the move will not solve the city’s ongoing water shortages, poor water quality and widespread leakages. The government announced plans to install prepaid water meters across the country, starting with the capital city, Harare, to improve water management</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-profit-making-scheme-harare-residents-slam-governments-prepaid-water-meters-plan-amid-ongoing-crisis/\">Another profit-making scheme! – Harare residents slam government’s prepaid water meters plan amid ongoing crisis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "09 Jul 2025"
        },
        {
            "title": "UZ suspends students for demonstrating in support of striking lecturers",
            "url": "https://www.newzimbabwe.com/uz-suspends-students-for-demonstrating-in-support-of-striking-lecturers/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe (UZ) administration has suspended six students for holding a demonstration on campus in support of their striking lecturers in May.\n\nThe six students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of Zimbabwe National Students Union (ZINASU), UZ Chapter.\n\nThey staged a flash protest at the UZ campus where they demanded an urgent resolution to the grievances of their lecturers, who have been on strike since April 16.\n\nIn separate letters seen by NewZimbabwe.com which were written to the six students by UZ Vice Chancellor Professor Paul Mapfumo, the suspensions are with immediate effect.\n\nAccordingly and in light o the seriousnes of the allegantions detailed above, i have found it necessary to, interms of section 8(3)(e) of the Univerity of Zimbabwe act [Chapter 25:16,(the Act), suspend you, with immediate effect, from your studies at the University of Zimbabwe indefinitely, pending diciplinary hearing against you.\n\nAccordingly, you are barred, forthwith, from entering the University of Zimbabwe Campus and any other University premises. You are required to surrender your student ID card to the Director, Asset Protection Services, the letters read.\n\nThe suspended students will attend a disciplinary committee hearing to answer to thecharges next week.\n\nTwo weeks ago, the UZ administration also fired four leaders of the ongoing lecturers industrial action after having been initially suspended and undergoing a hearing for using the campus great hall without approval from authorities.\n\nThe lecturers are demanding a salary increase to at least US$2,250 from their current US$250 as well as improved working conditions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/12181302/Zinasu-7.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe (UZ) administration has suspended six students for holding a demonstration on campus in support of their striking lecturers in May. The six students, Narshon Kohlo, Blessing Mtisi, Nodesha Maingehama, Tafadzwa Katsande, Tawana Hove and Tariro Mtukura are members of Zimbabwe National Students Union (ZINASU), UZ Chapter. They staged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uz-suspends-students-for-demonstrating-in-support-of-striking-lecturers/\">UZ suspends students for demonstrating in support of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "09 Jul 2025"
        },
        {
            "title": "Moxon resigns from Meikles Board",
            "url": "https://www.newzimbabwe.com/moxon-resigns-from-meikles-board/",
            "content": "By Alois Vinga\n\nLong-serving Meikles Limited chairman, John Moxon, has resigned from his role but will proceed as director of the property subsidiary.\n\nIn a statement, the groups company secretary, Batanai Peresuh said the resignation came into effect in February 2025.The development follows several months of internal squabbles between Moxon and fellow board members.\n\nLast year, Mashonaland Turf Club, a minority shareholder in Meikles Limited, filed an application with the High Court of Zimbabwes Commercial Division, seeking Moxons ouster from the board.\n\nSome of the shareholders and board members questioned a plan, led by Moxon and CEO Malcom Mycroft to sell the companys 50% stake in the Victoria Falls Hotel business, saying this was being done without the approval of the board, and without the involvement of African Sun, which co-runs the hotel with Meikles.\n\nMarket watchers are now speculating that Moxon could have finally succumbed to pressure and opted out of the management board.\n\nMeanwhile, Fayaz King  a distinguished Zimbabwean business leader with over thirty years of executive experience spanning telecommunications, information technology, the digital economy, and innovation has since been appointed as acting chairman of the Board, effective 3 July 2025.\n\nThroughout his career, he has demonstrated a proven ability to drive operational excellence, spearhead strategic initiatives, and optimise business processes to enhance efficiency and profitability. King has successfully led cross-functional teams, championed innovation, and delivered transformative technology solutions across diverse sectors and regions, Meikles Limited added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/01041859/John-Moxon.jpg",
            "description": "<p>By Alois Vinga Long-serving Meikles Limited chairman, John Moxon, has resigned from his role but will proceed as director of the property subsidiary. In a statement, the group’s company secretary, Batanai Peresuh said the resignation came into effect in February 2025. The development follows several months of internal squabbles between Moxon and fellow board members. Last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/moxon-resigns-from-meikles-board/\">Moxon resigns from Meikles Board </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "09 Jul 2025"
        },
        {
            "title": "Duo to serve 9 years imprisonment each for trafficking a live pangolin",
            "url": "https://www.newzimbabwe.com/duo-to-serve-9-years-imprisonment-each-for-trafficking-a-live-pangolin/",
            "content": "By James Muonwa\n\nTWO men from Beitbridge have been jailed for nine years each for illegal possession and attempting to sell a live pangolin.\n\nThe regional court sitting in the border town meted out the mandatory custodial sentence on Andrew Kahlamezi (53) and Sakhile Ncube (45) for dealing in one of the worlds most endangered and heavily protected animal species.\n\nThe State case was that on July 8 last year, Criminal Investigations Department (CID) detectives embarked on a well-coordinated sting operation after receiving information that the offenders were offering a live pangolin for sale at 150,000 Rands near the ZIMRA dam wall.\n\nUndercover officers proceeded to the place and posed as potential buyers.\n\nIt was heard that Kahlamezi and Ncube arrived at the rendezvous aboard a Toyota Hiace. Upon arrival, they produced the pangolin that was stashed in a black bag inside a crate. Detectives then pounced and the two tried to flee when police revealed their identities, but were swiftly apprehended.\n\nThe pangolin  a female weighing 8.7 kilogrammes was rescued alive and taken to veterinary authorities for medical assessment and care.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said the mandatory nine-year sentence on the two offenders sends a clear message that wildlife crimes are serious offences, and that pangolins are an endangered species.\n\nPangolins are a national treasure, and any attempt to profit from pangolin trafficking will be met with the full force of the law, the NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/13184528/Pangolin.jpg",
            "description": "<p>By James Muonwa  TWO men from Beitbridge have been jailed for nine years each for illegal possession and attempting to sell a live pangolin. The regional court sitting in the border town meted out the mandatory custodial sentence on Andrew Kahlamezi (53) and Sakhile Ncube (45) for dealing in one of the world’s most endangered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/duo-to-serve-9-years-imprisonment-each-for-trafficking-a-live-pangolin/\">Duo to serve 9 years imprisonment each for trafficking a live pangolin </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "09 Jul 2025"
        }
    ]
}