{
    "news": [
        {
            "title": "“How many more lives must we lose?” – Mnangagwa declares Seke Road accident a national disaster, orders tougher traffic enforcement",
            "url": "https://www.newzimbabwe.com/how-many-more-lives-must-we-lose-mnangagwa-declares-seke-road-accident-a-national-disaster-orders-tougher-traffic-enforcement/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has declared the fatal road traffic accident which claimed 17 lives along Seke Road, Harare, on Tuesday a national disaster and pledged to assist bereaved families with funeral expenses.\n\nThe tragic accident occurred at Hunyani Bridge when a Malawi-bound haulage truck collided with a commuter omnibus after it lost control and veered onto the oncoming lane.\n\nThe 30-tonne haulage truck first hit two pedestrians who were walking on the road island before crushing the commuter omnibus and killing 15 passengers.\n\nIn a statement on Wednesday, Mnangagwa called for urgent alignment of institutions and courts to address escalating road fatalities after recent devastating accidents.\n\nMy directive is to get all government institutions concerned with traffic enforcement, and our courts, to be properly aligned on this one matter so this seemingly endless, yet avoidable bloody spiral on our roads is brought to an immediate end.\n\nHow many more lives do we need to lose for our consciences to be aroused?\n\nI have directed that the Manyame Traffic accident be declared a national disaster in order to allow the government to move in and assist with hospital bills for those injured, and funeral arrangements and burials for those we sadly lost in the accident.\n\nAs I console with all the bereaved families, I wish those hospitalised a speedy recovery, Mnangagwa said.\n\nThe accident has sparked public outrage after it took nearly three hours for a crane to arrive and remove the trapped commuter omnibus from beneath the truck, exposing the nations poor disaster preparedness and emergency response.\n\nVictims of the accident could initially be heard crying for help, but they unfortunately died before any assistance reached them.\n\nPolice has identified the deceased as: Tatenda Silia (25), Wishby Nganima (19), Letwin Hwingiri (52), Frederick Jumo (39), Shantel Jere (03) Rainford Jere (29), Prodigas Mugere (37), Tatenda Dhokwani (25), Samantha Taderera (27), Sheilla Nemasango (58), Samantha Nyangani (32), Emma Matate (32), Joshua Gutsa (07), Perpetua Kurwa (35), Anyway Maguduru (26) Talent Hwingiri (18) and Mary Nyambiri (63).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133122/1000794263-scaled.jpg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa has declared the fatal road traffic accident which claimed 17 lives along Seke Road, Harare, on Tuesday a national disaster and pledged to assist bereaved families with funeral expenses. The tragic accident occurred at Hunyani Bridge when a Malawi-bound haulage truck collided with a commuter omnibus after it lost</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-many-more-lives-must-we-lose-mnangagwa-declares-seke-road-accident-a-national-disaster-orders-tougher-traffic-enforcement/\">“How many more lives must we lose?” – Mnangagwa declares Seke Road accident a national disaster, orders tougher traffic enforcement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Mwonzora takes aim at Tagwirei, says his money has failed to get him into Zanu PF Central Committee and will fail to influence Epworth by-election",
            "url": "https://www.newzimbabwe.com/mwonzora-takes-aim-at-tagwirei-says-his-money-has-failed-to-get-him-into-zanu-pf-central-committee-and-will-fail-to-influence-epworth-by-election/",
            "content": "By Leopold Munhende\n\nMDC President Douglas Mwonzora has laid into businessman Kudakwashe Tagwirei, describing him as one of the worst politicians who has unsuccessfully attempted to use money to get his way in Zanu PF.\n\nMwonzora was responding to donations and pledges made by Tagwirei in Epworth, where his party candidate Alice Nyahunzvi is set to battle Zanu PFs Civilised Bushe in a Ward 6 by-election on August 2.\n\nTagwirei, who has had quite a difficult month since being asked to leave a Central Committee meeting by Vice President Constantino Chiwengas allies, donated 15 solar-powered boreholes, two graders to rehabilitate the poor neighbourhoods roads, 100 primary school scholarships and 3,000 family food hampers.\n\nHarare province chairman Godwills Masimirembwa had endorsed Tagwirei to join Zanu PFs central committee, two months after the Seventh Day Adventist (SDA) senior member joined active politics.\n\nSpeaking to journalists on Wednesday, Mwonzora said Tagwireis use of money to lure supporters would fail the same way his cars and donations were failing to land him a seat in Zanu PFs powerful committee.\n\nHe said they had told residents of Epworth to eat his money and vote wisely.\n\nIn Epworth, our fight is no longer against the Zanu PF candidate only; it is a fight against thetenderpreneurs, commonly known aszvigananda, who are trying to use the Epworth election as a launchpad to get senior places in Zanu PF, said Mwonzora.\n\nThey are flaunting ill-gotten wealth, churning out false charity. The people of Epworth and Zimbabwe cannot be bought by trinkets.\n\nWe have said to the people of Epworth, eat their money and vote wisely. We are confident that we are going to defeat these bourgeoisie people who are flaunting their wealth.\n\nDespite being a long-time benefactor of the ruling party, Tagwirei has had his efforts to participate in Zanu PF politics resisted by senior members of the party, such as spokesperson Christopher Mutsvangwa and, reportedly, Chiwenga himself.\n\nTagwirei has been touted as Mnangagwas preferred successor ahead of Chiwenga while Mutsvangwa reportedly harbours presidential aspirations too. He has been referred to as the Prime Minister in circles closer to deals struck amongstzvigananda.\n\nAdded Mwonzora: Why was Tagwirei not doing it before? Why is he trying to promise us now?\n\nTagwirei has shown Zimbabwe that he has very bad political table manners. In fact, he is one of the most incompetent politicians I have ever seen.\n\nHe has tried to use money and cars to get into the central committee of his party and he has failed. He will try to use money and wealth in Epworth and he will equally fail.\n\nAccording to Mutsvangwa, Tagwirei promised Zanu PF politburo and central committee members top-of-the-range vehicles for unspecified reasons.\n\nThis, according to the former presidential advisor, was an attempt to bribe, gain favour and influence the decision on his co-option.\n\nZanu PF is targeting 8,000 votes at the Epworth polls, while the MDC believes it can easily upset its monied rivals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Leopold Munhende MDC President Douglas Mwonzora has laid into businessman Kudakwashe Tagwirei, describing him as one of the worst politicians who has unsuccessfully attempted to use money to get his way in Zanu PF. Mwonzora was responding to donations and pledges made by Tagwirei in Epworth, where his party candidate Alice Nyahunzvi is set</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwonzora-takes-aim-at-tagwirei-says-his-money-has-failed-to-get-him-into-zanu-pf-central-committee-and-will-fail-to-influence-epworth-by-election/\">Mwonzora takes aim at Tagwirei, says his money has failed to get him into Zanu PF Central Committee and will fail to influence Epworth by-election</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Dynamos fined US$5,000, coach Chaminuka fined US$4,000 and barred from next two matches",
            "url": "https://www.newzimbabwe.com/dynamos-fined-us5000-coach-chaminuka-fined-us4000-and-barred-from-next-two-matches/",
            "content": "By Sports Reporter\n\nDynamos Football Club has been slapped with a US$5,000 fine by the Premier Soccer League (PSL) following the controversial abandonment of their league match against FC Platinum at Mandava Stadium last month.\n\nThe incident occurred in the 74th minute when Dynamos walked off the pitch in protest of a penalty awarded to FC Platinum, leading to the premature end of the match.\n\nDynamos FC were found guilty of causing the abandonment of their match against FC Platinum played at Mandava Stadium on 22 June 2025. Consequently, the club has been fined a sum of US$5,000, the PSL said in a statement.\n\nFC Platinum have been awarded three points and three goals from the fixture.\n\nThe league also took disciplinary action against Dynamos head coach Saul Chaminuka, accusing him of inciting the walk-off by instructing his players to leave the field.\n\nDynamos FC Head Coach, Saul Chaminuka was also held responsible for his conduct during the match. He has been fined US$4,000 and banned from occupying the technical bench for the clubs next two matches, the PSL added.\n\nThe league warned all clubs, players, and officials to respect the rules and maintain professionalism in future matches.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Sports Reporter Dynamos Football Club has been slapped with a US$5,000 fine by the Premier Soccer League (PSL) following the controversial abandonment of their league match against FC Platinum at Mandava Stadium last month. The incident occurred in the 74th minute when Dynamos walked off the pitch in protest of a penalty awarded to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-fined-us5000-coach-chaminuka-fined-us4000-and-barred-from-next-two-matches/\">Dynamos fined US$5,000, coach Chaminuka fined US$4,000 and barred from next two matches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Maswanhise’s brace helps Motherwell reach Scottish League Cup Round of 16",
            "url": "https://www.newzimbabwe.com/maswanhises-brace-helps-motherwell-reach-scottish-league-cup-round-of-16/",
            "content": "By Sports Reporter\n\nWarriors forward Tawanda Maswanhise scored a brace on Tuesday evening, helping his side register a 3-0 win over Greenock Morton in the Scottish League Cup.\n\nThe victory saw Motherwell progress to the round of 16 of the knockout tournament, which started early this month.\n\nTuesdays brace marked Maswanhises third goal this season after he scored his first last week.\n\nIt came late to cushion his sides one-nil lead thanks to Apostolos Stamatelopoulos, who had opened the match scoring account.\n\nThe Zimbabwean international scored his first goal in the 83rd minute, before completing his brace ten minutes later in the 93rd minute.\n\nMotherwells next assignment will be in the round of 16 against Hertha on Friday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23090711/maswanhise.jpg",
            "description": "<p>By Sports Reporter Warriors forward Tawanda Maswanhise scored a brace on Tuesday evening, helping his side register a 3-0 win over Greenock Morton in the Scottish League Cup. The victory saw Motherwell progress to the round of 16 of the knockout tournament, which started early this month. Tuesday’s brace marked Maswanhise’s third goal this season</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maswanhises-brace-helps-motherwell-reach-scottish-league-cup-round-of-16/\">Maswanhise’s brace helps Motherwell reach Scottish League Cup Round of 16</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "As University of Zimbabwe strike drags on, pressure mounts on the country’s higher education system",
            "url": "https://www.newzimbabwe.com/as-university-of-zimbabwe-strike-drags-on-pressure-mounts-on-the-countrys-higher-education-system/",
            "content": "By Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal\n\nIts been months since lecturers at the University of Zimbabwe, the countrys oldest and most prestigious university, stepped aside. Their salaries, eroded by inflation and currency devaluation, could no longer cover their basic needs, they said.\n\nThat was in April, and theres no sign yet that theyll return to their lecture halls.\n\nWe have been betrayed and no longer have passion for our work, says J.T., a lecturer who has taught at the university for more than 10 years. He asked to be identified only by his initials for fear of retaliation from the institution.\n\nThe indefinite strike has left thousands of students struggling. Many are trying to study on their own but are uncertain if their lecturers will ever return to work.\n\nThe University of Zimbabwes registrars office did not respond to a Global Press Journal request for comment. But in May, the office issued a statement saying the issues lecturers had raised were legitimate and the university is working with the government to address them.\n\nHowever, Obvious Vengeyi, a professor and spokesperson for the Association of University Teachers, says that in June, the university dismissed him and three other executive members of the association. All had been leading the strike. The university, he says, has also hired adjunct lecturers to fill the gap left by striking lecturers, and some contract lecturers have returned to work.\n\nNarshon Kohlo, chairperson of the Zimbabwe National Students Union at the University of Zimbabwe, says this is only a stopgap measure  one thats failing students.\n\nSome of them are just recent graduates, he says, adding that they lack experience to adequately fill the gap. Students who began the semester with their regular lecturers have been left without continuity, and not all have been assigned replacements.\n\nProblems extend beyond the university. The countrys struggling economy has hollowed out many of its institutions. Hospitals face worryingshortages of medicine and staff.Primary and secondary schoolsstruggle to retain teachers. And that sectors higher education system, once a model on the continent, is now losing its footing.\n\nYears of hyperinflation, currency instability and dwindling government support have stripped the institutions of resources, slashed salaries and driven professionals out of the country. Experts worry about the long-term damage this might cause a country already grappling with economic collapse.\n\nIf you destroy the education system, you have destroyed the foundation for a viable and sustainable economic system, says Eldred Masunungure, a political scientist.\n\nTinotenda Kahenga, left, studies with classmates at the University of Zimbabwe. With lecture halls empty amid a months-long strike, students have turned to group study and self-learning, uncertain when instructors will return. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nA legacy undone\n\nIn the 1980s  the decade after independence  the University of Zimbabwe, the first ever in the country, was rated among the best in Africa. It was heavily subsidized by the government with minor support from donors. Around this time, the government also provided grants to university students.\n\nSoon after independence, the country had the highest-educated workforce and one of the highest literacy rates in southern Africa.\n\nDemand for education grew rapidly. Then-President Robert Mugabes government began implementing an ambitious program in 1996: to build a university in every province in an effort to address colonial inequalities and expand access to higher education.\n\nBut the government lacked resources to fully fund all the universities.\n\nIn the 1990s, supported by the World Bank and other multilateral institutions, Zimbabwe adopted the second part of an economic adjustment program. The government slashed spending on public universities and stopped student grants to state institutions.\n\nBy 2001, the government had introduced fees in post-secondary institutions to help cover costs.\n\nOver time, Zimbabwes economic fortunes have worsened, further weakening the governments ability to support its 13 state universities. In the last decade, the government has slashed the higher education budget, with its share of total government spending falling by more than half, from 6.9% in 2016 to 3.2% in 2025.\n\nOnce a leading academic institution on the continent, the University of Zimbabwe now faces widespread disruption as faculty protest salaries that no longer cover basic living costs. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nA shaky currency\n\nAn unstable currency system and other economic shocks have made it difficult for public institutions that depend on government funding to function effectively, says Godfrey Kanyenze, founding director of the Labour and Economic Development Research Institute of Zimbabwe.\n\nThe country, he says, has been trapped in a loop of economic instability since the Zimbabwean dollar crashed in 1997 and again in 2008.\n\nWhile there was some stability between 2009 and 2013 after the government introduced a multi-currency system, 2018 was a major turning point. That year, the governmentreplaced United States dollars with a new local currency, claiming it was equal in value to the US dollar. However, the local currency quickly collapsed, wiping out peoples savings, driving prices up more than fivefold and shattering public trust in the banking system.\n\nLike many workers in the public sector, lecturers were severely affected, and they say they have never recovered. Vengeyi says that this 2018 move slashed the value of lecturers salaries by nearly 90%, from US$2,250 per month to US$230 per month.\n\nThe country has experienced several currency changes since, but the local currencys value against the US dollar has continued to erode. By end of March 2024, the exchange rate had fallen so far that one US dollar was equivalent to nearly 20,000 Zimbabwean dollars. The next month in an attempt to stabilize the situation, the governmentissued yet another new currency dubbed Zimbabwean gold  which is backed in part by the governments gold reserves. But the value has halved since then,and people mostly use (and prefer) the US dollar.\n\nThe government has tried to help civil servants cushion these economic shocks, but lecturers say the fixes havent helped. In January 2020, the government introduced an allowance to civil servants paid in local currency, ranging from 400 Zimbabwean dollars to 800 Zimbabwean dollars per month.\n\nThen in June that same year, the government introduced a US$75 monthly allowance. By 2023, the allowances reached about US$300 per month.\n\nThese allowances were not subject to tax. However, in 2024, the government folded these allowances into regular salaries, meaning theyd be taxed, further reducing employees income.\n\nA University of Zimbabwe lecturer writes a placard during a protest outside the campus. Experts say deteriorating salaries and working conditions are undermining not just faculty livelihoods but the countrys higher education system. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThe ongoing strike at the University of Zimbabwe is just one example of the accumulated frustrations across the countrys universities over the crumbling economy.\n\nWhat many lecturers earn now can barely sustain a basic life, sapping their motivation, Vengeyi says. This in turn, he says, affects the quality of teaching and research.\n\nAlthough Zimbabwe maintains a high research output in sub-Saharan Africa, after South Africa and Kenya, the quality and impact is low, according to a 2020 World Bank report.\n\nWithout institutional, financial and other support mechanisms, the [educational] product is defective, Vengeyi says. What quality can come from someone whose children cannot afford health care, food, clothes, education?\n\nSome lecturers have turned to side jobs to make ends meet. Some even sell a variety of goods on campus. Women use their handbags as tuckshops, Vengeyi says. Some sell vegetables, tomatoes, perfumes and the like.\n\nJ.T. says the chicken-rearing projects and other small businesses he invested in back when he earned well have been sustaining him.\n\nOthers are leaving, Kanyenze says.\n\nAccurate data is hard to come by, but anecdotal evidence suggests that,much like in the health caresector, professionals in the education sector are leaving for better opportunities abroad.\n\nVengeyi says since 2018, when salaries plummeted, most departments at the University of Zimbabwe have lost at least five senior lecturers. In J.T.s department, 10 out of 18 lecturers have left for opportunities abroad.\n\nIt is a huge loss to the country, Vengeyi says. It is Zimbabwe that spends resources training citizens, but other nations benefit without spending anything.\n\nTo maintain its manpower, policymakers need to budget appropriately for all institutions of higher learning so they do not decay, Masunungure says. The decay of such institutions will inevitably result in the decay of the economy and the whole national ecosystem.\n\nDuring a protest outside the University of Zimbabwe, professor Obvious Vengeyi, spokesperson for the Association of University Teachers, holds a placard reading Aluta continua  Portuguese for The Struggle Continues  a slogan from Mozambiques liberation struggle, now widely used across Africa to signal ongoing resistance. Credit: Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThey have a right\n\nThe prolonged strike has been destabilizing, says Tinotenda Kahenga, a first-year pharmaceutical chemistry student. This is very tough and stressful for me. Like others among thousands of students enrolled at the university, he has spent weeks studying alone or with classmates.\n\nBut Kohlo, the chairperson of the Zimbabwe National Students Union at the University of Zimbabwe, doesnt blame lecturers for leaving students adrift.\n\nThey have a right to fight for fair salaries, not the slave wages they are currently getting, he says, adding that its the university thats responsible for providing students with education in return for the exorbitant amounts of fees that they charge.\n\nMeanwhile, the student body has written to the administration several times about the disruption the strike is causing and has held peaceful protests of their own, Kohlo says. The response? He and six other students were arrested and charged with disorderly conduct, though they were released later that day.\n\nGamuchirai Masiyiwais a Reporter-in-Residence based in Harare, Zimbabwe. An internationally acclaimed economic reporter, her award-winning work includes a Clarion Award for her innovative comic feature on Zimbabwean currency. Gamuchirai holds a bachelors degree in Political Science and a diploma in Journalism and Mass Communication from the University of Zimbabwe. She brings deep expertise and a fresh perspective to reporting on economic issues impacting her community.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/21124328/01_GPJNews_Zim__GM_EconomicCollapse_-195_L_T.JPG_web.jpg",
            "description": "<p>By Gamuchirai Masiyiwa, GPJ Zimbabwe This story was originally published by Global Press Journal It’s been months since lecturers at the University of Zimbabwe, the country’s oldest and most prestigious university, stepped aside. Their salaries, eroded by inflation and currency devaluation, could no longer cover their basic needs, they said. That was in April, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/as-university-of-zimbabwe-strike-drags-on-pressure-mounts-on-the-countrys-higher-education-system/\">As University of Zimbabwe strike drags on, pressure mounts on the country’s higher education system</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "10 Zimbabwean trailblazers redefining success in Canada",
            "url": "https://www.newzimbabwe.com/10-zimbabwean-trailblazers-redefining-success-in-canada/",
            "content": "By Staff Reporter\n\nZimbabwes influence continues to permeate borders, shaping narratives abroad.\n\nZimbabweans in the diaspora continue to shatter the glass ceiling, proving their mettle in foreign lands across various communities and sectors.\n\nNewZimbabwe.com features 10 trailblazing Zimbabweans in Canada who have defied both odds and geographical boundaries.\n\nOtni Chinenere\n\nOtni Chinenere\n\nChinenere wears many hats: entrepreneur, event host, and dynamic communicator. The Zimbabwean-Canadian is the founder of Taura Communications, where she provides communication coaching and helps individuals build self-confidence. She has facilitated impactful dialogue meetings in Canadian communities and hosted high-profile events, including the Zimbabwe Achievers Awards.\n\nOn her website, Chinenere says, My own journeyfrom Zimbabwe to Canadahas been one of resilience, growth, and learning the power of effective communication. Now, Im dedicated to sharing those insights to help others thrive in every area of life.\n\nNatasha Heschelle (Mutungwazi)\n\nNatasha Heschelle\n\nHeschelle is a Zimbabwean-born actress who moved to Canada 11 years ago to pursue her acting career. She has featured in projects such as Zahara, showcasing her acting prowess. Heschelle is also a musician, with her digital metrics proving her success as a songstress. In 2021, she was honoured by the Zimbabwe Business Bureau Canada as one of the 40 most influential Zimbabweans in Canada.\n\nDavid Chinyama\n\nDavid Chinyama\n\nChinyama is a visual artist whose dexterity brings striking artistry to life. His work is inspired by his upbringing in a challenging African environment, and he highlights societal issues through his canvas paintings. A two-time recipient of the National Arts Merit Awards, Chinyama continues to make an impact in the arts.\n\nThabo Chinake\n\nThabo Chinake\n\nKnown in music circles as K The Chosen, Chinakes hip-hop career began unexpectedly. After moving to Canada to pursue a Bachelor of Commerce at the Haskayne School of Business, he stumbled upon letters written by his mother before his birth, sparking his creative flame. Today, he balances a professional accounting career with his hip-hop ambitions.\n\nSekai Musoki\n\nSekai Musoki\n\nHaving grown up in a Zimbabwean mining community, Musoki dreamed of following in her fathers footsteps in the extractive industry. Now, she is an engineer at Canadian mining company BHP Jansen, where she works in construction and analytics.\n\nMunyaradzi Mataruse\n\nMunyaradzi Mataruse\n\nA product of the Pakare Paye Arts Centrefounded by legendary Zimbabwean musician Oliver MtukudziMataruse moved to Canada nine years ago and has established himself in Yellowknife, a city in the subarctic region. With five albums to his name, he has proven his musical pedigree, having toured internationally with Mtukudzi. He now collaborates with renowned manager Trevor Sinclair to break into the Canadian market.\n\nPeter Mapendere\n\nPeter Mapendere\n\nBorn in Masvingo, Mapendere played for Black Rhinos Juniors in Zimbabwe before a knee injury cut his football career short. Now a holder of the UEFA A and Canadian A coaching licences, he coaches Ottawa International Soccer Club in Canada. Despite his success abroad, he still dreams of contributing to junior football development in Zimbabwe.\n\nLiam Middleton\n\nLiam Middleton\n\nBorn and raised in Zimbabwe, Middleton made his mark as a rugby coach, leading the Zimbabwe Sevens team from 2004 to 2010. Under his guidance, the Cheetahs won four out of six games at the 2009 Rugby World Cup Sevens in Dubai, securing a Bowl Final victory against Ireland.\n\nIn 2014, he was appointed Canadas Sevens coach, where he achieved a rare victory over New Zealand. He later led Canada to a gold medal at the 2015 Pan Am Games and coached the team in its inaugural home tournament during the 2016 World Sevens Series in Vancouver.\n\nDr. Nothabo Ncube\n\nDr. Nothabo Ncube\n\nA qualified medical doctor, Ncube is also a TEDx speaker, coach, and mentor. Having lost her mother at 14, she draws from personal experience to empower others. She appeared on Oprah Winfreys Lifeclass discussing You Become What You Believe and won the Peoples Choice Award at the 2019 Zimbabwe Achievers Awards Canada.\n\nLillian Cox\n\nLillian Cox\n\nBorn in Kwekwe, Cox is an entrepreneur who has carved a niche in Canada. In 2018, she founded Tz Kloset, a womens clothing brand, while also venturing into agriculture and entertainment. In 2019, she was named Female Entrepreneur of the Year at the Zimbabwe Achievers Awards Canada.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22193452/otni-chinerere.webp",
            "description": "<p>By Staff Reporter Zimbabwe’s influence continues to permeate borders, shaping narratives abroad. Zimbabweans in the diaspora continue to shatter the glass ceiling, proving their mettle in foreign lands across various communities and sectors. NewZimbabwe.com features 10 trailblazing Zimbabweans in Canada who have defied both odds and geographical boundaries. Otni Chinenere Chinenere wears many hats: entrepreneur,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/10-zimbabwean-trailblazers-redefining-success-in-canada/\">10 Zimbabwean trailblazers redefining success in Canada </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Zimbabwe: Can patriotism be legislated?",
            "url": "https://www.newzimbabwe.com/zimbabwe-can-patriotism-be-legislated/",
            "content": "By Privilege Musvanhiri, DW\n\nLawmakers from the ruling ZANU-PF party inZimbabweare moving a motion to further criminalize government critics.Theyre advocating for acomprehensive strategy to promote patriotism and national identity. Proposedmeasures includeformalizing a national ideology, establishing a national institute of ideology andintegrating patrioticeducation into the curriculum.\n\nThe motion comes on top ofthe contested Patriotic Act of 2023, which was seen toeffectively closed the door on dissent In Zimbabwe. It makes provision forcriticism issues such as provision of health care, basic services and accountability to be judged criminal.\n\nThe government dismissed criticism, saying the legislation was necessary to hold accountable individuals who threaten national interests. It said the legislation was modeled on the Logan Act in the US, which bars citizens from engaging in certain unauthorized communications with foreign governments. In Zimbabwe, violations could result in life imprisonment and death, termination of citizenship, suspension from voting or holding public office.\n\nIn a recent parliamentary debate, ZANU-PF MP Ophious Murambiwa suggested that it should be criminal to speak evilabout Zimbabwe.\n\nThe most important issue is to love our country, let us praise our country in all circumstances, whether in good or bad times, during the night or day, Murambiwa said.\n\nThe motion has prompted opposition lawmakers and human rights groups to pushback harder.\n\nPatriotism is not blind loyalty. It is not empty slogans. True patriots question injustice, challenge corruption and demand systems that serve people not a selected few, Prosper Mutseyami, an opposition MP, said.\n\nOur patriotism must ignite participation, ensuring that every Zimbabwean plays an active role in shaping the future.\n\nHuman rights activists say its another attempt to silence dissent.\n\nYou cannot necessarily legislate patriotism, Nigel Nyamutumbu, the Media Alliance of Zimbabwe programs manager, told DW. It is a concept that can naturally clamp down on the requisite freedoms. Patriotism is not a legal concept but rather a political nationalist ideology.\n\nActivists have in the past been accused of treason and unpatriotic behavior for expressing concerns over human rights abuses, corruption, and governance in Zimbabwe.\n\nCitizens have expressed concern overwhat they fear are attempts to enforce a one-party state. ZANU-PF, with its absolute majority in parliament, is seen to be abusing its authority and violating the constitution.\n\nAs parliamentarians we are supposed to uphold the constitution, Gladys Hlatshwayo an opposition MP told DW. Section 119 of the constitution demands that parliament protects the constitution and democratic governance.\n\nIn June 2025, Zimbabwes High Court struck down sections of the Patriotic Act.The court ruled that the drastic penalties prescribed by the Patriotic Act infringed on various sections of the countrys constitution.\n\nSeveral civic organizations and a private citizens had petitioned the court, arguing thatthe legislation was overly broad and vague and had high potential for abuse and misuse.\n\nThe most patriotic people are those who hold their government to account. A government must not be seen as the most dangerous institution, Eric Chisora, a political analyst, told DW. Whatever they [ZANU-PF lawmakers] are doing is unreasonable and irrational. Citizens rights must be protected.\n\nPolitical and civic rights activistsare calling for the repeal of colonial legacy laws which they say are retrogressive. Laws such as the Criminal Law Codification and Reform Act, with provisions have been used to incriminate government critics, date back toZimbabwes pre-independence erawhen they were used to suppress Black majority rule.\n\nThe activists are concerned over the shrinking of democratic space under Emmerson Mnangagwa, Zimbabwes president since 2018.\n\nWe are now living in a country where there is no freedom of expression due to the number of pieces of legislation being passed by the ZANU-PF regime, Blessing Vava, executive director of the Crisis in Zimbabwe Coalition, told DW.\n\nWhen you see a government passing repressive laws, just know that it is not a popular government. Zimbabweans must fight to defend the constitution.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Privilege Musvanhiri, DW Lawmakers from the ruling ZANU-PF party in Zimbabwe are moving a motion to further criminalize government critics. They’re advocating for a comprehensive strategy to promote patriotism and national identity. Proposed measures include formalizing a national ideology, establishing a national institute of ideology and integrating “patriotic” education into the curriculum.  The motion comes on top of the contested Patriotic Act of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-can-patriotism-be-legislated/\">Zimbabwe: Can patriotism be legislated?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Ever wondered why Chiwenga has to receive Mnangagwa late at night whenever he comes from international trips? Well, his spokesperson has explained",
            "url": "https://www.newzimbabwe.com/ever-wondered-why-chiwenga-has-to-receive-mnangagwa-late-at-night-whenever-he-comes-from-international-trips-well-his-spokesperson-has-explained/",
            "content": "By Leopold Munhende\n\nORAL reports from senior politicians and journalists will tell you that in the 1990s, late liberation war hero Eddison Zvobgo once refused to come out of bed to welcome back late President Robert Mugabe, who was set to arrive in the wee hours of one winter morning at the then Harare International Airport from one of his many international trips.\n\nAlthough Zvobgo was never Mugabes deputy, it was common practice that a select number of Ministers, Vice President(s) would always welcome him back from these trips.\n\nVideos of high-ranking government officials lined up on one side with Mugabe shaking hands with each one of them, fresh from disembarking an Air Zimbabwe plane, are still etched in the memories of many.\n\nThe practice, interpreted as some power flexing opportunity by most Zimbabweans, has been explained by President Emmerson Mnangagwas spokesperson, George Charamba.\n\nMany would have wondered why Mugabe did not just disembark and head straight home, be it to his fancy Blue Roof or State House, when he arrived late or too early.\n\nApparently, it is protocol for an Acting President to send off and receive the President whenever they leave.\n\nWhoever would have been named Acting President has to physically be at the Presidents point of exit and entry for a tradition that had remained unknown, unasked and unexplained up until now.\n\nThe law of the land spells out who acts in place of the Head of State when he is away and out of the country for whatever reason. The Head of State is required by the same law to designate the person who stands in his place, said Charamba on X in response to questions around Chiwengas decision to welcome Mnangagwa late at night on his return from Equatorial Guinea, Japan and Algeria.\n\nThe person so designated is required to be at the point of exit, which is the port at which the extant Head of State leaves the country. So important is this procedure that the person designated has to be physically present, or else the Head of State may not leave the country.\n\nThe port of exit is that point where the sitting Head of State hands over instruments of power to the character chosen to act. This is why the Acting character actually gets saluted by the command, led by the Commander of Defence Forces (CDF), once the incumbent is airborne.\n\nFast forward to the Head of States return. Again, the Acting President must be at the port of re-entry to hand back the instruments of power temporarily given him in an acting capacity.\n\nHe appears together with the command and is the first one to greet the Head of State upon his return. In that welcome and handshake is the symbolic act of handing back power ceded temporarily to its elected owner.\n\nThe tradition, presumably adopted from Britain, has often been blasted as archaic, unnecessary and a waste of taxpayers money.\n\nExpectedly, it is practised in neighbouring Zambia, Malawi and Tanzania, all of which were British colonies.\n\nPresident Hakainde Hichilema of Zambia, his Malawian counterpart Lazarus Chakwera and TanzaniasSamia Suluhu Hassan all participate in the tradition.\n\nDesktop research on whether Britain was still practising it proved inconclusive.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22195843/ED-CHIWENGA-MOHADI.jpeg",
            "description": "<p>By Leopold Munhende ORAL reports from senior politicians and journalists will tell you that in the 1990s, late liberation war hero Eddison Zvobgo once refused to come out of bed to welcome back late President Robert Mugabe, who was set to arrive in the wee hours of one winter morning at the then Harare International</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ever-wondered-why-chiwenga-has-to-receive-mnangagwa-late-at-night-whenever-he-comes-from-international-trips-well-his-spokesperson-has-explained/\">Ever wondered why Chiwenga has to receive Mnangagwa late at night whenever he comes from international trips? Well, his spokesperson has explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Let’s protect wetlands, nature’s superheroes",
            "url": "https://www.newzimbabwe.com/lets-protect-wetlands-natures-superheroes/",
            "content": "By Julia Pierini & Kariuki Ndanganga\n\nIn our world of big names, curiously,our true heroes tend to be anonymous,goes a quote by the American historian Daniel Joseph Boorstin. Like these anonymous true heroes, wetlandsplay vital overlooked roles including provision of essential ecosystem services like flood control and water regulation,carbon sequestration, and climate regulation among others. Although they cover about 6% of the earths land surface area, they are home to about 40% of all plants and animal species, including birds which rely on these sites for breeding, feeding and resting during migration.\n\nFurther, these critical ecosystems support livelihoods of billions across the world. However, wetlands are disappearing at an alarming rate, world over. According to the just-released 2025 Global Wetland Outlook (GWO) Report, the world has lost about 22% of these critical ecosystems, equivalent to more than half a billion football pitches, since the 1970s. Various factors including pollution, agricultural and developments in addition to climate change are driving this loss. In the Sahel region, for example, Lake Chad, bordering Chad, Nigeria, Niger, and Cameroon has shrunk from 26,000 square kilometres in the 1960s, to less than 1500 square kilometres today.\n\nIn Zimbabwe, wetlands cover about 3% of the countrys area or about 11, 717 km2. Some key wetlands include Lake Chivero, Victoria Falls, Mana Pools, Cleveland Dam, and Driefontein Grasslands among others. However, more than 70% of these wetlands are degraded, due to various factors including urbanization. agriculture, mining, and pollution.\n\nProtecting and restoring wetlands andsecuring the livelihoods of communities that depend on these areas is paramount. This is why BirdLife International, the worlds largest Nature Partnership, is working in 27 countries across Africa to protect key habitats including wetlands. This approach is underpinned by identifying and protecting wetlands along key migratory bird flyways. Africa is home to key flyways including the African Eurasian Flyway, East Atlantic Flyway, major migration route for waterbirds, encompassing a network of wetlands across countries, which include Ramsar-listed Wetlands of International Importance. Through collaboration with national BirdLife Partners, efforts are focused on implementing national conservation strategies.\n\nAn example of this is in Asias East Asian Australasian Flyway stretching from Siberia and Alaska to New Zealand and Australia. BirdLife in collaboration with the Asian Development Bank and the East Asian Australasian Flyway Partnership Secretariat launched a $3-billion Regional Flyway Initiative in 2021. This initiative aims at the protection and restoration of more than 50 key wetlands sites along the Flyway which are important sites for millions of migratory birds, in addition to supporting livelihoods of millions of people through fisheries and agriculture, among others. Such models can be replicated across flyways, benefitting nature and people. Closer home, BirdLife Zimbabwe is working with local communities to protect the 201,194 hectares Driefontein Grasslands, home to 85% of Zimbabwes Wattled Crane population in addition to significant populations of the Endangered Grey Crowned Crane.\n\nFinancing is yet another critical component of wetlands conservation. According to the GWO Report, it is estimated that biodiversity conservation funding accounts for just 0.25% of global GDP, which is only approximately one-fifth of funds needed to address biodiversity loss, highlighting significant underinvestment. Consequently, there is need to increase investments in nature protection, including wetlands. Luckily, there are several innovative financing tools that can be leveraged. These include debt for nature swaps where debt relief can be provided in exchange for wetlands conservation commitments, green and blue bonds, carbon finance, Payments for Ecosystem Services (PES) schemes, and biodiversity credits among others.\n\nPartnerships and collaborations with various stakeholders is paramount for protecting these critical ecosystems. Local communities who are custodians of wetlands, should be empowered to identify and implement relevant solutions to conserve wetlands. Equally important, is the need for policies and regulations which protect wetlands. Like migratory birds, wetlands connect countries, and their conservation necessitates, co-operation across boundaries. From 23rd 31stJuly 2025, the world will convene in Zimbabwe for the Conference on Wetlands of International Importance (Ramsar COP 15). This is an opportunity for policymakers to articulate and adopt resolutions to enhance the protection of these delicate ecosystems. Every action counts, and together, let us protect these anonymous heroes for present and future generations.\n\nJulia Pierini is the Chief Executive Officer, BirdLife Zimbabwe. Kariuki Ndangnga is the Regional Director for Africa, BirdLife International.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22200136/WETLANDS.webp",
            "description": "<p>By Julia Pierini & Kariuki Ndang’ang’a In our world of big names, curiously, our true heroes tend to be anonymous, goes a quote by the American historian Daniel Joseph Boorstin. Like these anonymous true heroes, wetlands play vital overlooked roles including provision of essential ecosystem services like flood control and water regulation, carbon sequestration, and climate regulation among</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lets-protect-wetlands-natures-superheroes/\">Let’s protect wetlands, nature’s superheroes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        },
        {
            "title": "Over 1 000 marimba players unite for world record attempt in South Africa",
            "url": "https://www.newzimbabwe.com/over-1-000-marimba-players-unite-for-world-record-attempt-in-south-africa/",
            "content": "IOL\n\nIn a landmark event set for Saturday, August 2, the Grand Arena at GrandWest in Cape Town will resonate with the harmonious sounds of marimbas as over 1 000 players from South Africa and Zimbabwe gather to attempt a Guinness World Records title for the largest marimba ensemble in history.\n\nUnder the theme United in Harmony, this showcase aims not merely to break the current record set by Guatemala at 505 players, but to more than double it, placing South Africa firmly on the global stage for a celebration of cultural pride and musical talent.The visionary behind the initiative is Kiara Ramklass, the founder of Marimba Jam, an organisation dedicated to introducing youth to the joys of marimba music across South Africa.\n\nRamklass, who first discovered her passion for the marimba 18 years ago, expressed her excitement about the event: South African marimbas are tuned in C major  its almost impossible to feel sad when you hear them. They create this magical, happy energy. Thats what were sharing with the world on August 2.\n\nThe ensemble will feature marimba players aged 8 to 62, drawn from over 70 schools and institutions, representing every province in South Africa, alongside two schools from Zimbabwe. Participants are embarking on significant journeys; one team from KwaZulu-Natal is flying in right after their matric dance, while others are transporting their instruments across provincial lines from Durban and Johannesburg.\n\nIn this record-breaking moment, every marimba counts.\n\nThis is not Marimba Jams first attempt at making history. In 2018, the organisation gathered 241 girls on Womens Day to unofficially break Australias record, yet lacked the resources for official certification. Now, with an international adjudicator flying in from London, their aspiration to etch a new title into the record books is firmly in the spotlight.\n\nThis event is more than just breaking a record, Ramklass said. Its about showing whats possible when we come together across socio-economic divides  private schools, township schools, rural schools  all on one stage. Its a loud, joyful message of ubuntu, the African philosophy that promotes community and shared humanity.Participants will perform a vibrant ten-minute medley of celebrated songs Waka Waka and Jerusalema, both of which serve as powerful anthems of South African pride and unity.\n\nAs the grand event unfolds, a celebratory concert featuring local stars will conclude the day, further cementing the spirit of togetherness.\n\nAttendees can look forward to a plethora of activities beyond the record attempt, including performances by Goodluck, live art installations, interactive marimba demonstrations, djembe drumming workshops, photo booths, and virtual reality experiences. Each participant will also receive an official Guinness World Records medallion in a medal ceremony, celebrating their contribution to this historic event.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22185216/Screenshot-2025-07-22-at-19.51.51.png",
            "description": "<p>IOL In a landmark event set for Saturday, August 2, the Grand Arena at GrandWest in Cape Town will resonate with the harmonious sounds of marimbas as over 1 000 players from South Africa and Zimbabwe gather to attempt a Guinness World Records  title for the largest marimba ensemble in history. Under the theme “United</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-1-000-marimba-players-unite-for-world-record-attempt-in-south-africa/\">Over 1 000 marimba players unite for world record attempt in South Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:49",
            "date": "23 Jul 2025"
        }
    ]
}