{
    "news": [
        {
            "title": "Gweru medical doctor busted smoking crystal meth",
            "url": "https://www.newzimbabwe.com/gweru-medical-doctor-busted-smoking-crystal-meth/",
            "content": "By Staff Reporter\n\nA Gweru-based medical doctor, Farikai Manjeya (49), has been arrested alongside three accomplices after being caught smoking methamphetamine, commonly known locally asmutoriro.\n\nManjeya was apprehended at his residence in Gweru while allegedly smoking the illicit substance with Tafara Chigoya (28), Kudakwashe Godknows Mutata (29), and Tariro Pambwa (35).\n\nAccording to a statement by the National Prosecuting Authority of Zimbabwe (NPAZ), police received a tip-off on November 9 about suspected drug activity at the doctors cottages.\n\nWhen detectives raided the premises, they reportedly found the group smoking crystal meth using J-pipes and lighters. The items were seized, and all four suspects were immediately arrested.\n\nThe accused have since appeared in court and were remanded in custody pending a bail hearing.\n\nThe NPAZ reiterated that drug offences will not be tolerated and encouraged the public to report drug use to protect young people and communities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/29054941/Doctor.jpg",
            "description": "<p>By Staff Reporter A Gweru-based medical doctor, Farikai Manjeya (49), has been arrested alongside three accomplices after being caught smoking methamphetamine, commonly known locally as mutoriro. Manjeya was apprehended at his residence in Gweru while allegedly smoking the illicit substance with Tafara Chigoya (28), Kudakwashe Godknows Mutata (29), and Tariro Pambwa (35). According to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gweru-medical-doctor-busted-smoking-crystal-meth/\">Gweru medical doctor busted smoking crystal meth</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Zimbabweans’ fear of politically motivated violence has declined – research by continental body reveals",
            "url": "https://www.newzimbabwe.com/zimbabweans-fear-of-politically-motivated-violence-has-declined-research-by-continental-body-reveals/",
            "content": "By Leopold Munhende\n\nResearch by Afrobarometer has revealed a significant decline in fear of politically motivated violence among Zimbabweans.\n\nAfrobarometer, the continents leading source of high-quality data on public opinion, noted in a recently published report that only about a third of Zimbabweans now fear the possibility of violence during elections,a sharp drop from four-fifthsrecordedin 2009.\n\nThe 2023 general elections were comparatively peaceful, with fewer violent incidents than in previous polls, a factor that could explain the reduction in fear.\n\nIn 2009, four out of five Zimbabweans expressed fear of politically motivated violence following the events of 2008, when a state-sponsored campaign of intimidation involving killings and other forms of brutality was launched to rescue the late President Robert Mugabe after his defeat by the late pro-democracy icon Morgan Tsvangirai.\n\nThousands were reported killed duringOperation Makavhotera Papi?(Where did you put your vote?), which targeted opposition strongholds, particularly in rural areas.\n\nReports of people having their hands chopped off made headlines, prompting Human Rights Watch and other international organisations to condemn the Zimbabwean government.\n\nFear of political intimidation or violence during election campaigns has declined markedly, from roughly four-fifths of the population in 2009 to fewer than one-third in 2024, while a growing share of citizens feel free to choose whom to vote for without pressure, reads the Afrobarometer report.\n\nHowever, the same report notes that only about half of survey participants trust the Zimbabwe Electoral Commission (ZEC).\n\nThe ZEC, which is responsible for managing all election-related processes, has long been accused of manipulating results in favour of the ruling Zanu PF party, which has remained in power since 1980.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04031733/Political-Violence.png",
            "description": "<p>By Leopold Munhende Research by Afrobarometer has revealed a significant decline in fear of politically motivated violence among Zimbabweans. Afrobarometer, the continent’s leading source of high-quality data on public opinion, noted in a recently published report that only about a third of Zimbabweans now fear the possibility of violence during elections, a sharp drop from four-fifths recorded in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-fear-of-politically-motivated-violence-has-declined-research-by-continental-body-reveals/\">Zimbabweans’ fear of politically motivated violence has declined – research by continental body reveals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Mwonzora has destroyed MDC – opposition activist says as youths seize control of party headquarters",
            "url": "https://www.newzimbabwe.com/mwonzora-has-destroyed-mdc-opposition-activist-says-as-youths-seize-control-of-party-headquarters/",
            "content": "By Darlington Gatsi\n\nMovement for Democratic Change (MDC) is in a tense fight for its premises after an activist from the party seized the Morgan Richard Tsvangirai building, popularly known as Harvest House.\n\nThe building, known as Harvest House, was seized by Shakespeare Mukoyi, who serves as the Secretary for Defence, on Wednesday. He claimed to have evicted Douglas Mwonzora, whom he accused of running down the party.\n\nSpeaking after the takeover of the party headquarters, Mukoyi said the once formidable opposition party had fallen under Mwonzoras leadership.\n\nIn the history of the MDC, even in the hostile areas, never had a day it got a zero on a polling station, let alone in a ward. So it gives us a worry as members of the security. Currently, I am holding the position of secretary for defence. It is my obligation and powers invested in my office to make sure that I defend this movement from internal adversaries to external adversaries, said Mukoyi.\n\nThe takeover by Mukoyi is the latest battle for what remains of the MDC, which took a political nosedive after the death of Morgan Tsvangirai in 2018.\n\nSince 2018, the party has been rocked by infighting and splits, weakening a movement that had formidably challenged ZANU PF under Tsvangirai.\n\nThe MDC under Mwonzora took over Harvest House in 2020 from the MDC Alliance, which was then led by Nelson Chamisa, at the height of the partys infighting.\n\nIn a statement, the MDC said the move was an attempt to thwart the partys resistance to ZANU PFs agenda to extend President Emmerson Mnangagwas tenure.\n\nIt has come to the attention of the party leadership that one of our comrades gone rogue, Shaky Mukoyi, has locked the partys head office on the guise of purportedly seeking medical assistance.\n\nIt opened up an opportunity for those who have sold their souls to the regime who are advocating for the 2030 agenda within the party, said MDC.\n\nThe MDC added that it would reclaim the building from the youths.\n\nWe will not give in to extortion and rapacity as the MDC assets belong to bona fide members and under the custodianship of the current leadership under the law.\n\nThuggery and banditry are not an MDC culture and will never be since we have been victims of these since the Mugabe regime.\n\nLastly, let me reassure our members, members of the media, the diaspora, and all those who are concerned that within no time, we are taking our property back.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Darlington Gatsi Movement for Democratic Change (MDC) is in a tense fight for its premises after an activist from the party seized the Morgan Richard Tsvangirai building, popularly known as Harvest House. The building, known as Harvest House, was seized by Shakespeare Mukoyi, who serves as the Secretary for Defence, on Wednesday. He claimed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mwonzora-has-destroyed-mdc-opposition-activist-says-as-youths-seize-control-of-party-headquarters/\">Mwonzora has destroyed MDC – opposition activist says as youths seize control of party headquarters </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Police investigating abduction of two CUT students during SRC election campaigns",
            "url": "https://www.newzimbabwe.com/police-investigating-abduction-of-two-cut-students-during-src-election-campaigns/",
            "content": "By Thandiwe Garusa\n\nThe Zimbabwe Republic Police (ZRP) says investigations are underway following the reported abduction of two Chinhoyi University of Technology (CUT) students, Lindon Zanga and Malvin Madanda.\n\nThe two, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi during Students Representative Council (SRC) election campaigns.\n\nAccording to ZINASU, Zanga and Madanda were seized by unidentified individuals driving an unmarked grey Isuzu vehicle, which had reportedly been seen on campus earlier distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nThe students were found 12 hours later, allegedly tortured and dumped in Shamva.\n\nIn a statement issued Wednesday, ZRP spokesperson Assistant Commissioner Paul Nyathi confirmed that investigations were in progress and appealed to the public for information that could assist in identifying the perpetrators.\n\nZRP confirms that investigations are being conducted in connection with the alleged abduction of Chinhoyi University of Technology students, Lindon Zanga (21) and Malvin Madanda (29), alias Saint, on 10th November 2025.\n\nZRP urges anyone with information on what actually transpired, as well as the possible location or identification of suspects involved in this incident, to contact any nearest police station or the CID Chinhoyi, Nyathi said.\n\nZINASU has accused Zanu PF Youth League Political Commissar Taurai Kandishaya of being involved in the incident, alleging that he was using state resources to suppress dissent and manipulate the outcome of the student elections.\n\nAfter their release, the two students said they were subjected to 12 hours of torture for allegedly chanting slogans against the ruling Zanu PF party during their SRC campaign activities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11111935/CUT-ZINASU.jpeg",
            "description": "<p>By Thandiwe Garusa The Zimbabwe Republic Police (ZRP) says investigations are underway following the reported abduction of two Chinhoyi University of Technology (CUT) students, Lindon Zanga and Malvin Madanda. The two, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi during Students</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-investigating-abduction-of-two-cut-students-during-src-election-campaigns/\">Police investigating abduction of two CUT students during SRC election campaigns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Warriors midfielder Andy Rinomhota back at Reading FC",
            "url": "https://www.newzimbabwe.com/warriors-midfielder-andy-rinomhota-back-at-reading-fc/",
            "content": "By Sports Reporter\n\nAfter spending five months without a club, Warriors midfielder Andy Rinomhota has rejoinedEnglish League One side Reading FC.\n\nRinomhota re-signed for Reading as a free agent following the expiry of his contract with Championship outfit Cardiff City earlier this year.\n\nThe 28-year-old midfielder has agreed to an eight-month deal that will keep him at the club until the end of the current season.\n\nRinomhota is no stranger to the Royals, having come through the clubs development ranks and representing Reading from 2015 to 2022. During that period, he made 138 senior appearances and scored four goals before departing for Cardiff in June 2022.\n\nWelcoming the player back, Reading head coach Leam Richardson said he was confident Rinomhotas experience and commitment would strengthen the squad.\n\nIve worked with Andy before and know exactly what hell bring to the team: energy, honesty, and a real desire to win. He is a great professional who knows this club and what it means to represent Reading. Im delighted to have him back, and Im sure the fans will be too, Richardson said.\n\nRinomhota is expected to make his second debut for Reading on November 22, when club football resumes after the international break.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12192641/andy.jpeg",
            "description": "<p>By Sports Reporter After spending five months without a club, Warriors midfielder Andy Rinomhota has rejoined English League One side Reading FC. Rinomhota re-signed for Reading as a free agent following the expiry of his contract with Championship outfit Cardiff City earlier this year. The 28-year-old midfielder has agreed to an eight-month deal that will keep</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-midfielder-andy-rinomhota-back-at-reading-fc/\">Warriors midfielder Andy Rinomhota back at Reading FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "‘It’s their loss’: South African leader hits back at Trump’s decision to skip G20 summit",
            "url": "https://www.newzimbabwe.com/its-their-loss-south-african-leader-hits-back-at-trumps-decision-to-skip-g20-summit/",
            "content": "BBC\n\nSouth Africas President Cyril Ramaphosa says boycott politics doesnt work as he hit back at US President Donald Trumps decision to skip the G20 leaders summit in Johannesburg later this month.\n\nTrump has said that no US official would attend the gathering over widely discredited claims that white people are being persecuted in South Africa.\n\nSpeaking outside parliament, Ramaphosa said the USs absence is their loss and that the boycott would not prevent the meeting from going ahead, according to the AFP news agency.\n\nHe added that the US was giving up the very important role that they should be playing as the biggest economy in the world.\n\nThe G20 summit is taking place between 22-23 November but in a post on social media, Trump said it was a total disgrace that South Africa was hosting it.\n\nHe had earlier said South Africa should not be in the G20 at all, and that he would send Vice-President JD Vance, instead of attending himself.\n\nThen over the weekend, he doubled down on his claims that Afrikaners [people who are descended from Dutch settlers, and also French and German immigrants] are being killed and slaughtered, and their land and farms are being illegally confiscated.\n\nNo US government official will attend as long as these human rights abuses continue, he added.\n\nTrump has previously said that while he is trying to restrict the number of refugees the US accepts,Afrikaners would be welcome.\n\nRamaphosa said boycotting never achieves anything of great impact, because decisions will be taken that will move the various issues ahead, AFP reports.\n\nSouth Africa is the current chair of the G20 grouping of the worlds largest economies.\n\nThe forthcoming summit will mark the first time it takes place on African soil.\n\nEvery year, a different member state holds the G20 presidency and sets the agenda for the leaders summit, where they discuss the major economic issues of the day  with the US due to take over from South Africa.\n\nTrump is not the only leader set to skip the G20. Hi close ally, Argentinian President Javier Milei, has also indicated he will not attend but will instead send his Foreign Minister Pablo Quirno, AFP reports.\n\nSouth Africas government has said that claims of a white genocide are widely discredited and unsupported by reliable evidence.\n\nIt also says that no white farmers have seen their land confiscated without compensation.\n\n",
            "image_url": "https://www.newzimbabwe.com/wp-content/uploads/2019/01/Cryril-Ramaphosa.jpg",
            "description": "<p>BBC South Africa’s President Cyril Ramaphosa says “boycott politics doesn’t work” as he hit back at US President Donald Trump’s decision to skip the G20 leaders’ summit in Johannesburg later this month. Trump has said that no US official would attend the gathering over widely discredited claims that white people are being persecuted in South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-their-loss-south-african-leader-hits-back-at-trumps-decision-to-skip-g20-summit/\">‘It’s their loss’: South African leader hits back at Trump’s decision to skip G20 summit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Minnesota: At 90, art specialist Rex Mhiripiri is selling the gallery he thinks of as ‘a gift from God’",
            "url": "https://www.newzimbabwe.com/minnesota-at-90-art-specialist-rex-mhiripiri-is-selling-the-gallery-he-thinks-of-as-a-gift-from-god/",
            "content": "Minnesota Star Tribune\n\nWhen gallery owner Rex Mhiripiri saw a gas station at 90th Street and Penn Avenue S. in Bloomington, he didnt see just gasoline. He saw the future home of his huge two-story Mhiripiri Gallery.\n\nThat was nearly 20 years ago. At 90, hes still working six days a week, answering every phone call, whether its local, spam or from his native Zimbabwe. And hes painting. Always painting.\n\nIts a gift from God, Mhiripiri said of his gallery.\n\nBefore the Bloomington spot, he was in Butler Square, two other downtown Minneapolis locations and then in Edina.\n\nMhiripiri is one of a handful of Twin Cities gallerists in business since the 1980s, and the only local dealer specializing in African art and specifically Shona stone sculpture from Zimbabwe. Last month, he put the building and all the artwork in it up for sale.\n\nThe asking price? $4 million.\n\nThe spacious gallery is filled with Zimbabwe stone sculptures made of springstone, serpentine, opal stone and other stones. They depict families, pregnant women, mothers, daughters, sons and many animals.\n\nAfrican masks and Mhiripiris paintings of elephants, other animals and landscapes cover the walls. Prices range from $15 to $150,000.\n\nInternationally acclaimed Zimbabwe artists Colleen Madamombe, Bernard Matemera and Henry Munyaradzi still show their works with him. A stack of catalogs from Matemeras 1997 show in Paris is still in the gallery.\n\nHe keeps photographs of artwork and artists and trips to Zimbabwe in piles and wooden boxes.\n\nMhiripiri, who still works six days a week, always has seen himself as the familys provider.\n\nI work to protect my wife from want [for anything], he said. We had seven children, and she was a stay-at-home mom. Its my job to make sure that she has everything that she needs.\n\nSome years, the gallery grosses more than $1 million. A client just flew in from Washington, D.C., and bought $250,000 worth of work.\n\nRenowned Twin Cities painter and public artist Ta-coumba T. Aiken, 72, met Mhiripiri in the mid-1980s.\n\nHe had a store and he had a gallery and he was working on his paintings there in the gallery, and actually doing the work  not just showing work, Aiken said. Thats rare.\n\nAiken loved Mhiripiris elephant paintings with scenery. He felt they were just amazing, and not like anything that I saw anywhere else, he said. And by that time, I had seen a lot of art.\n\nAt the time, Aiken was studying Black modernist painter Los Mailou Jones, one of the first African American artists to put African art into her work. Aiken began tracking other African American artists who did the same.\n\nBut Rex didnt care about that sort of thing, he was like, Im just painting, Im doing my work, he said.\n\nAiken bought some of Mhiripiris artworks, and Mhiripiri sold some of Aikens paintings, and they gifted works to each other.\n\nUnlike most gallerists who work on commission, Mhiripiri buys everything outright and sells it.\n\nFormer University of Minnesota professor Roderick Ferguson started collecting from Mhiripiri in 2009.\n\nPeople probably dont know how much of a gem Rex is in terms of the art world and the African art world within the U.S., said Ferguson, 53, chair of the Womens, Gender and Sexuality Studies Department at Yale University.\n\nMhiripiri sold him an 18th-century gun used in the slave trade and manacles used in the Congo during King Leopolds era, to name a few. As a scholar, Ferguson finds these artifacts irresistible.\n\nSteve Wadsworth, 59, founder of 4 Seasons Construction Inc., randomly stopped into Mhiripiri Gallery about 12 years ago. He and Rex became fast friends.\n\nAt the end of Wadsworths driveway, theres a statue from Mhiripiri Gallery of an adult holding four kids.\n\nAnybody who comes to our house knows that family comes first, Wadsworth said. Over the years, hes bought about 30 paintings and sculptures from Mhiripiri.\n\nRex and Julie Mhiripiri have helped build wells in Zimbabwe and put four kids that werent their own through college.\n\nWhen Wadsworth buys art from Mhiripiri, Mhiripiri donates a certain percentage of that to help people in Zimbabwe.\n\nThat makes me feel good, Wadsworth said. I dont have a connection to help people like that.\n\nMhiripiris journey to Minnesota wasnt at all linear. Born in 1935, in Wedza, Rhodesia, (now near Harare, Zimbabwe) Mhiripiri felt stifled by life under the white-run British Commonwealth. There were few career opportunities for Black people.\n\nIn 1958, after being told not to come back to teachers college in Rhodesia, he moved to Tanganyika (now Tanzania), then through Uganda to Kenya. He worked as a salesman for Mobil Oil Co. and later the Kenyan government.\n\nIn 1966 he came to the United States on a State Department scholarship, starting at the University of Rochester in upstate New York before transferring to the University of Minnesota. There he met his wife, Julie, of Albert Lea, who is white.\n\nThey eloped to Kenya in the early 1970s. But with Rhodesia at war, they decided to return to Minnesota.\n\nAfter struggles with alcohol, Mhiripiri got sober at a Christian rehab in Montreal. At 40, he became a committed follower of Jesus.\n\nBut it wasnt until the mid-1980s that he met a missionary who had traveled to Zimbabwe. That man introduced him to Shona stone sculpture  and thats when it clicked. He needed to go back to Zimbabwe and buy art.\n\nIn 1995, thanks to the generosity of a few interested collectors, he and Julie traveled to Zimbabwe for five weeks. He shipped back 81 crates of stone sculpture weighing about 24 tons. They returned every few years, building relationships with artists and importing stone sculpture. His last trip was in 2022.\n\nWhen its slow at the gallery, Mhiripiri paints in his studio on the second floor, often crafting his signature elephant.\n\nOn a quiet Tuesday afternoon in October, he wore loose-fitting jeans, a blue polo shirt and a smock with the 1992 Super Bowl XXVI in Minneapolis printed across it.\n\nHe used a palette knife, smoothing chunks of purple paint onto a canvas. A Christian rock radio station blasted over the speakers.\n\nMhiripiri wonders about the future of the gallery.\n\nIf God gave me this thing  and I believe he did  then God will help me to get rid of it, he said.\n\nWhere:9001 Penn Av. S., Bloomington\n\nWhen:10 a.m.-6 p.m. Mon.-Sat.\n\nCost:Free\n\nInfo:952-285-9684 orshonasculpturemhiripir.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12194955/rex-mhiripiri.jpg",
            "description": "<p>Minnesota Star Tribune When gallery owner Rex Mhiripiri saw a gas station at 90th Street and Penn Avenue S. in Bloomington, he didn’t see just gasoline. He saw the future home of his huge two-story Mhiripiri Gallery. That was nearly 20 years ago. At 90, he’s still working six days a week, answering every phone</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minnesota-at-90-art-specialist-rex-mhiripiri-is-selling-the-gallery-he-thinks-of-as-a-gift-from-god/\">Minnesota: At 90, art specialist Rex Mhiripiri is selling the gallery he thinks of as ‘a gift from God’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Zambia’s Hakainde Hichilema to make first official visit to Zimbabwe since taking office",
            "url": "https://www.newzimbabwe.com/zambias-hakainde-hichilema-to-make-first-official-visit-to-zimbabwe-since-taking-office/",
            "content": "By Thandiwe Garusa\n\nZambian President Hakainde Hichilema is scheduled to make his first visit to Zimbabwe this Friday for the inaugural session of the ZambiaZimbabwe Bi-National Commission (BNC), which he will co-chair with President Emmerson Mnangagwa.\n\nThis will be Hichilemas first official visit to Zimbabwe since he took office in 2021.\n\nThe high-level visit marks a new phase in bilateral relations between the two neighbouring countries, focusing on strengthening cooperation in trade, energy, transport, and other key sectors.\n\nIn a statement released Wednesday, Zambias Foreign Affairs Minister Mulambo Haimbe said the establishment of the BNC demonstrates the two Presidents shared commitment to deepening cooperation and advancing joint development efforts.\n\nDuring the visit, President Hichilema and President Mnangagwa will co-chair the inaugural session of the ZambiaZimbabwe Bi-National Commission (BNC), which upgrades the existing Joint Permanent Commission on Cooperation (JPCC) to a higher framework of strategic engagement, Haimbe said.\n\nThe establishment of the BNC underscores the shared vision of the two Heads of State to strengthen bilateral cooperation, accelerate joint infrastructure projects, and deepen economic integration between the two nations.\n\nThe Zambian government also described the visit as a reaffirmation of the deep and enduring bonds of friendship, shared history, and mutual respect that have long defined relations between Harare and Lusaka.\n\nThe meeting, however, comes amid strained diplomatic ties following the August 2023 elections in Zimbabwe, when election observers led by former Zambian Vice President Nevers Mumba said some aspects of the polls fell short of democratic standards.\n\nZimbabwes ruling party, Zanu PF, accused Zambia of interference, while tensions escalated further after President Mnangagwas remarks to Russian President Vladimir Putin, in which he expressed concern over Zambias growing alignment with Western powers.\n\nMnangagwa suggested that the United States was extending its influence in Zambia, potentially threatening regional stability.\n\nIn response, Zambia accused Zimbabwe of undermining its sovereignty and urged SADC and the African Union (AU) to intervene to defuse tensions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/11/07154036/Mnangagwa-Hichilema.jpeg",
            "description": "<p>By Thandiwe Garusa Zambian President Hakainde Hichilema is scheduled to make his first visit to Zimbabwe this Friday for the inaugural session of the Zambia–Zimbabwe Bi-National Commission (BNC), which he will co-chair with President Emmerson Mnangagwa. This will be Hichilema’s first official visit to Zimbabwe since he took office in 2021. The high-level visit marks</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zambias-hakainde-hichilema-to-make-first-official-visit-to-zimbabwe-since-taking-office/\">Zambia’s Hakainde Hichilema to make first official visit to Zimbabwe since taking office</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        },
        {
            "title": "Magaya pursues removal from remand at the High Court",
            "url": "https://www.newzimbabwe.com/magaya-pursues-removal-from-remand-at-the-high-court/",
            "content": "By Mary Taruvinga\n\nProphetic Healing and Deliverance (PHD) Ministries founder Walter Magaya has approached the High Court seeking a review of a magistrates decision to place him on remand, arguing that his detention was unconstitutional and a grave miscarriage of justice.\n\nIn his application filed through Rubaya and Chatambudza Legal Practitioners, Magaya cited Harare regional magistrate Marewanazvo Gofa and the Prosecutor-General of Zimbabwe as respondents, accusing the lower court of acting without jurisdiction after he was detained beyond the 48-hour constitutional limit before being brought to court.\n\nThe 1st Respondents decision to entertain an application for placement of Applicant on remand is so manifestly irrational and grossly outrageous in its defiance of logic that no sensible court would arrive at it, Magaya said in his founding affidavit.\n\nHe argued that under Section 50(3) of the Constitution, any person detained beyond 48 hours must be released immediately and not subjected to further remand proceedings. Must means must, he stressed. The phrase must be released immediately is not merely directory but peremptory, creating a constitutional obligation that admits of no judicial discretion.\n\nMagaya is facing five counts of rape and 13 counts of fraud.\n\nHe said the State had conceded in court that he was detained beyond the lawful time limit, yet Magistrate Gofa still proceeded to place him on remand. This breach is not a matter of conjecture, he said. It is factual and borne out by the express and unequivocal concession of the State Counsel for the 2nd Respondent.\n\nHe described his arrest on November 1 as deeply troubling, claiming that a large contingent of heavily armed police officers descended upon me while I was engaged in prayer.\n\nMagaya accused the magistrate of brazenly subverting the Constitution by ruling that his remedy lay in suing for damages rather than being released, warning that such reasoning takes the criminal justice system back to the Lancaster House Constitution.\n\nBy transforming this clear constitutional command into a mere precursor to civil litigation, the 1st Respondent effectively rewrote the peoples will as expressed in the Constitution, he said. If unchecked, this arbitrary erosion of liberty will metastasise emboldening law enforcement agents to regard themselves as a law unto their own.\n\nThe cleric also attacked the magistrates reliance on the Agripa Mloyi v The State precedent, arguing it was wholly inapposite and that she ignored the more relevant Panganai Davison Madondo v The State judgment.\n\nMagaya further accused the Zimbabwe Gender Commission of manufacturing allegations against him through a public advert that solicited rape complaints. The subsequently complainants only emerged after this public invitation, he claimed.\n\nIn his draft order, Magaya seeks to have the magistrates ruling of November 4, 2025, set aside and for him to be removed from remand on all charges of rape and fraud.\n\nHe argues that the High Courts intervention is necessary to prevent continuing violations of his constitutional rights. The principle that you cannot put something on nothing, it will collapse, applies with equal force here, Magaya submitted.\n\nHe is represented by Admire Rubaya, Everson Chatambudza and Advocate Sylvester Hashiti.\n\nThe matter is yet to be heard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Prophetic Healing and Deliverance (PHD) Ministries founder Walter Magaya has approached the High Court seeking a review of a magistrate’s decision to place him on remand, arguing that his detention was unconstitutional and “a grave miscarriage of justice.” In his application filed through Rubaya and Chatambudza Legal Practitioners, Magaya cited Harare regional</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-pursues-removal-from-remand-at-the-high-court/\">Magaya pursues removal from remand at the High Court </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "13 Nov 2025"
        }
    ]
}