{
    "news": [
        {
            "title": "ZIFA writes to PSL requesting an increase in number of participating teams",
            "url": "https://www.newzimbabwe.com/zifa-writes-to-psl-requesting-an-increase-in-number-of-participating-teams/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association has officially written to the Premier Soccer League proposing that the number of participating clubs be increased starting next year.\n\nCurrently, 18 teams compete in the Zimbabwe Premier Soccer League, and ZIFA is requesting that this number be increased to 20 teams starting next season.\n\nZIFA Secretary General Yvonne Manwa, in a letter addressed to PSL CEO Rodwell Thabe, says the move is part of its effort to organise, regulate, and develop the countrys football.\n\nThe Association acknowledges the Leagues consistent efforts in upholding high standards of administration, competition, and commercial engagement.\n\nPursuant to our mandate to develop, organise, and regulate football across all levels in the country, ZIFA wishes to formally propose the increase in the number of teams participating in the Premier Soccer League from eighteen (18) to twenty (20), effective from the 2026 season, readspart ofthe letter.\n\nZIFA also proposed to have a National First Division League, which will merge the four Division One soccer leagues that are currently feeding into the PSL.\n\nZIFA will engage all key stakeholders, including the PSL, Regional Leagues, and club representatives, in the coming months to ensure an inclusive and well-structured implementation plan.\n\nWe kindly request the PSLs consideration, input, and support towards these initiatives,which we believe are critical to the progressive transformation of Zimbabwean football.\n\nPlease accept our highest regards and assurances of continued collaboration in advancing the game we all serve, read the letter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association has officially written to the Premier Soccer League proposing that the number of participating clubs be increased starting next year. Currently, 18 teams compete in the Zimbabwe Premier Soccer League, and ZIFA is requesting that this number be increased to 20 teams starting next season. ZIFA Secretary General</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-writes-to-psl-requesting-an-increase-in-number-of-participating-teams/\">ZIFA writes to PSL requesting an increase in number of participating teams</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "11 Nov 2025"
        },
        {
            "title": "Trio busted with trophies of specially protected vultures",
            "url": "https://www.newzimbabwe.com/trio-busted-with-trophies-of-specially-protected-vultures/",
            "content": "By Staff Reporter\n\nTHREE men found in possession of trophies of endangered vulture species have appeared in court following their recent arrest.\n\nThe trio of Emmanuel Genius Mombe (36) of Domboshava, Benjamin Sarewa (26) of Epworth and Shadreck Gukutu (31) of Waterfalls were arraigned before the Harare Magistrates Court on charges of unlawful possession of specially protected wildlife trophies.\n\nAccused persons were remanded in custody to November 21, 2025.\n\nThe State case is that on November 5, police received information that the suspects were seeking buyers for vulture heads.\n\nActing on the tip-off, detectives set up a meeting purporting to be prospective buyers of the trophies.\n\nThey agreed to meet at the Kopje bus terminus in Harare, where the transaction was supposed to take place. While at the scene, Gukutu produced a black plastic bag from a small cross-bag containing four dried heads of vultures. The officers immediately identified themselves and arrested the suspect.\n\nSubsequent investigations led to the arrest of the other two suspects, who were waiting nearby for the transaction to be concluded.\n\nIn a statement following the trios court appearance, the National Prosecuting Authority of Zimbabwe (NPAZ) reiterated that the illegal trade in wildlife trophies poses a serious threat to biodiversity.\n\nThe public is urged to report anyone trading or in possession of wildlife trophies without a permit, the NPAZ said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter THREE men found in possession of trophies of endangered vulture species have appeared in court following their recent arrest. The trio of Emmanuel Genius Mombe (36) of Domboshava, Benjamin Sarewa (26) of Epworth and Shadreck Gukutu (31) of Waterfalls were arraigned before the Harare Magistrates Court on charges of unlawful possession of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trio-busted-with-trophies-of-specially-protected-vultures/\">Trio busted with trophies of specially protected vultures</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "11 Nov 2025"
        },
        {
            "title": "Congolese businessman alleges abduction by CIOs over downtown tuckshops turf war, pleads for intervention of Independent Complaints Commission",
            "url": "https://www.newzimbabwe.com/congolese-businessman-alleges-abduction-by-cios-over-downtown-tuckshops-turf-war-pleads-for-intervention-of-independent-complaints-commission/",
            "content": "By Staff Reporter\n\nCongolese refugee and businessman Desire Nsengimana has lodged a formal complaint with the Zimbabwe Independent Complaints Commission (ZICC), accusing State security and immigration officials of harassment and unlawful detention amid intensifying tuckshop wars in downtown Harare.\n\nIn a letter by his lawyers, Rubaya and Chatambudza Legal Practitioners, gleaned by NewZimbabwe.com, Nsengimana alleges that members of the security sector are working with rival foreign traders who are weaponising gossip to eliminate competition through deportations and arrests.\n\nAccording to the complaint, Nsengimana has been held at Harare Remand Prison since June after he was allegedly kidnapped by men claiming to be Central Intelligence Organisation (CIO) agents.\n\nHe says the agents branded him an enemy of the State and falsely accused him of being part of Rwandas National Intelligence and Security Service (NISS).\n\nOn or about the 10th of June 2025, our client was kidnapped by a contingent of individuals who he claims presented themselves as members of the Central Intelligence Organisation, whom, if given the chance, he is capable of identifying, reads part of the letter dated November 7 and addressed to the ZICC Executive Secretary.\n\nHis captors communicated the spurious allegations against him. They threatened and ordered him to leave Zimbabwe, having been falsely branded an enemy of the State.\n\nThe letter adds: This designation was based on the unsubstantiated claim that he is an operative of Rwandas National Intelligence and Security Service (NISS), allegedly deployed to target Rwandan refugees who settled in Zimbabwe post 1994.\n\nNsengimana insists he is a legitimate refugee from the Democratic Republic of Congo, lawfully residing in Zimbabwe since 2014, and has no links to Rwandan intelligence.\n\nHe alleges that he told the alleged CIO agents that certain Rwandan refugees who settled in Zimbabwe just after the 1994 Rwandan genocide were the ones who were just seeing shadows and were on a frolic of their own, giving the security agents in Zimbabwe false information for purposes of weeding out of Zimbabwe other refugees like Desire Nsengimana who they regarded as threats in business circles, the letter states.\n\nHis lawyers further argue that there was nothing to the allegations as it was a simple case of jealousy and rivalry wherein his detractors sought and still seek to equate his business acumen with state sponsorship.\n\nFollowing the alleged abduction, Nsengimana was reportedly handed over to Immigration Compliance Officer Machona, who ordered him to report to the Immigration Department the following day.\n\nSubsequent to his kidnapping, he was then handed over to one Immigration Compliance Officer Machona who then instructed him to visit the Immigration Department Offices the next day, the 11th of June 2025. He was then advised by Machona that he was going to be detained at Harare Remand Prison as a prohibited person for deportation to Rwanda, the lawyers said.\n\nThe letter further claims that Machona advised him that his arrest and subsequent detention was not up to the Immigration Department, but some powerful members of the Central Intelligence Organisation connected to a clique of refugees from Rwanda. Mr. Nsengimana was perplexed by such abuse of State apparatus in the name of State Security, yet he is not even a danger to the Republic of Zimbabwe.\n\nNsengimana is now appealing to the ZICC to investigate the alleged abuse of authority by State and immigration officials, which he believes is being driven by jealousy and commercial rivalry among refugee business operators in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26164728/tuckshop.gif",
            "description": "<p>By Staff Reporter Congolese refugee and businessman Desire Nsengimana has lodged a formal complaint with the Zimbabwe Independent Complaints Commission (ZICC), accusing State security and immigration officials of harassment and unlawful detention amid intensifying tuckshop wars in downtown Harare. In a letter by his lawyers, Rubaya and Chatambudza Legal Practitioners, gleaned by NewZimbabwe.com, Nsengimana alleges</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/congolese-businessman-alleges-abduction-by-cios-over-downtown-tuckshops-turf-war-pleads-for-intervention-of-independent-complaints-commission/\">Congolese businessman alleges abduction by CIOs over downtown tuckshops turf war, pleads for intervention of Independent Complaints Commission</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "11 Nov 2025"
        },
        {
            "title": "Pursue a proper career! – Hwende slammed over US$150,000 MPs loan demand",
            "url": "https://www.newzimbabwe.com/pursue-a-proper-career-hwende-slammed-over-us150000-mps-loan-demand/",
            "content": "By Staff Reporter\n\nOpposition legislator Chalton Hwende has come under fire for demanding US$150,000 loans for Members of Parliament (MPs) as part of their welfare packages.\n\nHwende made the proposal during the pre-budget seminar held in Bulawayo, arguing that legislators deserve improved conditions of service.\n\nThe Kuwadzana East MPs remarks have, however, drawn widespread criticism, particularly given the ongoing plight of civil servants who continue to decry poor salaries and working conditions in the public sector.\n\nFormer legislator Fadzayi Mahere chided Hwende for demanding the loan facility for MPs.\n\nIn my humble view, being an MP should not be viewed as a career but as a vocation and opportunity to serve. Its not the place to seek financial reward or make a living if thats what youre after.\n\nIf you want a well-paid job or to make sensible money, then pursue a proper career wholeheartedly. What youll find is that if you have a solid career, youll make what you earn monthly from being in Parliament in less than an hour, said Mahere.\n\nThis is not the first time that the MPs have raised eyebrows over loan facilities.\n\nIn 2023, MPs received US$40,000 loans from the government as part of their benefits, a move that was widely condemned by civic groups.\n\nCritics have also questioned the timing of Hwendes remarks, coming as Zanu PF pushes for constitutional amendments to extend President Emmerson Mnangagwas tenure, a process that will require parliamentary approval.\n\nIn response to the backlash, Hwende defended his comments, insisting that he was merely pointing out an existing precedent.\n\nThe uncomfortable truth is that everyone who has been an MP since 2000 for the opposition and ruling party has received cars, stands, loans, medical aid, salaries, bonuses and some even got cars from (former RBZ governor) Gono outside parliament, but they are your favourites you will pretend like you dont know, said Hwende.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/26033121/Chalton-Hwende.jpeg",
            "description": "<p>By Staff Reporter Opposition legislator Chalton Hwende has come under fire for demanding US$150,000 loans for Members of Parliament (MPs) as part of their welfare packages. Hwende made the proposal during the pre-budget seminar held in Bulawayo, arguing that legislators deserve improved conditions of service. The Kuwadzana East MP’s remarks have, however, drawn widespread criticism,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pursue-a-proper-career-hwende-slammed-over-us150000-mps-loan-demand/\">Pursue a proper career! – Hwende slammed over US$150,000 MPs loan demand</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "11 Nov 2025"
        },
        {
            "title": "‘No free lunch’: Mashaba vows for productive prisons under ActionSA rule",
            "url": "https://www.newzimbabwe.com/no-free-lunch-mashaba-vows-for-productive-prisons-under-actionsa-rule/",
            "content": "IOL\n\nActionSA leader has vowed that once his party comes to power, it will dismantle the correctional services system, integrating them with labour detention centres for hardened criminals.\n\nMashaba said prisoners in South Africa had it too easy, vowing that he would push for a system whereby the prisoners would work for themselves, rather than enjoying free access to television and meals from the State.\n\nHe said only those held for minor criminal offenders would be subject to the corrective practises, while he also said he would want to scrap the parole system.\n\nMashaba also South Africa continues to bear the brunt of illegal migration due to porous borders.\n\nIllegal immigration and border-related crimes are rife throughout the year, particularly during holidays.\n\nThe Department of Home Affairs recently introduced advanced technology at the countrys borders ahead of the Easter weekend.\n\nThe department has previously unveiled a fleet of drones and 40 body-worn cameras to be deployed by the Border Management Authority to improve border security and curb corruption.\n\nHowever,porous bordersremain a major challenge.\n\nSouth Africa shares borders with Lesotho, Botswana, Eswatini, Mozambique, Namibia, and Zimbabwe.\n\nThese borders have long faced issues such as illegal migration, cross-border crime, and delays at ports of entry  exacerbated by corruption, ageing infrastructure, and inadequate security.\n\nIn a sit-down interview with IOL News in Johannesburg this week,Mashabasaid undocumented immigration is a global issue, not one confined to Africa.\n\nWell, they are flying in as well  from Pakistan, Bangladesh, China, everywhere else, he said.\n\nYou see, the mistake South Africans make when we talk about illegal foreigners is that, for some reason, we think they only come from the continent. Yes, because of our proximity to Zimbabwe and Zambia, we will have more of them, but we are sitting with a massive challenge from Pakistanis, Bangladeshis, Chinese, Europeans, and even people from the United States.\n\nMashaba said the country must adopt a tougher stance.\n\nWhen people come into our country illegally, there must be serious consequences, he said.\n\nActionSA, which was founded in 2020, has been vocal about illegal immigration, calling for mass deportations.\n\nOther parties such as the Patriotic Alliance and the IFP have also supported deportation of undocumented migrants.\n\nMashaba said that under an ActionSA government, there would be more prisons to deal with hardened immigrant prisoners.\n\nIm a strong believer that under ActionSA, when you get arrested, dont tell me about correctional services, he said.\n\nWe will have the Department of Correctional Services for the madam who steals bread, but for hardened criminals bringing drugs into our country or counterfeit goods, or who murder and rape, we will have prisons for them  hard life, hard knocks.\n\nHe said such inmates would work to atone for their crimes through farming, food production and furniture making, rather than receiving free meals and entertainment.\n\nYou will produce food, build bridges and houses, and well show the nation the productivity of those prisoners as their payback to society, Mashaba said.\n\nThose who think they can bypass the system will work seven days a week.\n\nProfessor Loren Landau of Wits University cautioned that Herman Mashabas proposed prisons for undocumented immigrants risk promoting scapegoating and undermining the Constitution. Image:Bheki Radebe\n\nHowever, speaking with IOL News immigration expert Professor Loren Landau from Wits University criticised Mashabas comments, warning that they promote dangerous scapegoating.\n\nWhat Mashaba is outlining are parallel systems of membership in society and justice. Immigrants are human. Some commit crimes, but data continually demonstrates that they do so at a lower rate than the South Africans they live among, Landau said.\n\nHe added that creating separate justice systems for immigrants would be unconstitutional and expensive.\n\nOur problems are not about immigration but about effective policing and accountable institutions. Creating any justice system outside the normal constitutional system is illegal and undermines the rule of law, he said.\n\nLast month, KwaZulu-Natal Police Commissioner Lieutenant General Nhlanhla Mkhwanazi told the Parliaments Ad Hoc Committee probing the allegations of corruption and interference in the justice system that prisoners live better than many ordinary South Africans.\n\nHe said it costs the state about R500 a day to care for each prisoner, while poor citizens outside survive on a R350 monthly social grant.\n\nCorrectional Services Minister Pieter Groenewald said in June 2025 that the department has allocated R1.2 billion for prisoner food in the 2025 and 2026 financial year, compared with R1.4 billion in 2023 and 2024 and R1.5 billion in 2024 and 2025.\n\nIn its 20252030 strategic plan, the department lists food provision as one of its top four cost drivers, after staff compensation, property payments and public-private partnerships.\n\nGroenewald said prisoners would increasingly produce food for themselves to help redirect funds to other essential programmes.\n\nAs of May 4, there were 13,181 sentenced foreign nationals in South African prisons, costing the state about R6 million per day.\n\nGroenewald said foreign nationals are not held separately and that no bilateral agreements exist for their transfer to serve sentences in their home countries.\n\nMeanwhile,Mashabasaid ActionSA would make prisons more productive and self-sustaining.\n\nUnder ActionSA, we will make money out of you as a prisoner, he said.\n\nThere wont be any free accommodation or free lunch. Youll work on farms to feed the nation  and yourself. The bed you sleep on will come from the proceeds of your labour.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12041618/Herman-Mashaba-jpg.webp",
            "description": "<p>IOL ActionSA leader has vowed that once his party comes to power, it will dismantle the correctional services system, integrating them with labour detention centres for hardened criminals. Mashaba said prisoners in South Africa had it too easy, vowing that he would push for a system whereby the prisoners would work for themselves, rather than</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-free-lunch-mashaba-vows-for-productive-prisons-under-actionsa-rule/\">‘No free lunch’: Mashaba vows for productive prisons under ActionSA rule</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "11 Nov 2025"
        }
    ]
}