{
    "news": [
        {
            "title": "March 31 protest: 98 in court for demonstrating in Harare",
            "url": "https://www.newzimbabwe.com/march-31-protest-98-in-court-for-demonstrating-in-harare/",
            "content": "By Staff Reporter\n\nA total of 98 people who were arrested on allegations of staging a demonstration against President Emmerson Mnangagwas continued stay in office appeared in court Tuesday, charged with participating in an unlawful gathering with an intent to incite violence.\n\nThe 98 will remain in jail until April 10 when the court will decide their fate on bail.\n\nProsecutors opposed bail but will make written submissions before the lawyers representing the suspects respond.\n\nOf the group, 95 appeared before provincial magistrate Isheunesu Matova.\n\nThe other three appeared before provincial magistrate Ruth Moyo.\n\nMarch 31 protest: 95 have been arrested following a demonstration at Robert Mugabe Square. The group is currently at the Harare Magistrates Court.\n\nFollow the NewZimbabwe channel on WhatsApphttps://t.co/4EHrosKaUfpic.twitter.com/wQC1LKMCDY\n\n NewZimbabwe.com (@NewZimbabweCom)April 1, 2025\n\nThe three who appeared separately are Moreblessing Nkomo, Jenifer Chimange and Sthabile Maduve, who were arrested at the CoppaCabana bus terminus.\n\nThe rest were arrested at Robert Mugabe Square.\n\nAccording to the National Prosecuting Authority on 31 March 2025 at around 0920am, the accused gathered at Robert Mugabe Square, commonly known as the Freedom Square, Harare, intending to march in the streets of Harare, thereafter proceed to the State House of Zimbabwe and forcibly remove the Constitutionally elected President Emmerson Mnangagwa.\n\nThe accused were making their vows of removing the President, saying, enough is enough, Mnangagwa must go, ED must go nezvigananda zvake. Madzibaba veshanduko huyai mutitungamirire, comrade Geza huyai mutitungamirire and whistled.\n\nPolice officers who were deployed for maintenance of order observed about two hundred 200 people gathered and approached the group.\n\nThe accused piled stones, bricks and tyres along Robert Mugabe road.\n\nThey threw stones towards the police officers whilst singing Hatidi zvekupihwa order nemasasikamu.\n\nThey also took pictures and videos which they posted on various social media platforms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31103159/IMG-20250331-WA0018.jpg",
            "description": "<p>By Staff Reporter A total of 98 people who were arrested on allegations of staging a demonstration against President Emmerson Mnangagwa’s continued stay in office appeared in court Tuesday, charged with participating in an unlawful gathering with an intent to incite violence. The 98 will remain in jail until April 10 when the court will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protest-98-in-court-for-demonstrating-in-harare/\">March 31 protest: 98 in court for demonstrating in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "High Court blocks Manase from presenting self as ZIMASCO Corporate Rescue Practitioner",
            "url": "https://www.newzimbabwe.com/high-court-blocks-manase-from-presenting-self-as-zimasco-corporate-rescue-practitioner/",
            "content": "By Staff Reporter\n\nHIGH Court judge Justice Faith Mushure has blocked lawyer Wilson Manase, from presenting himself as ferro-chrome producer ZIMASCOs Corporate Rescue Practitioner.\n\nMushure granted ZIMASCO the interdict following attempts to take over operations at the company, including its premises and bank accounts, by Manase and two other businessmen.\n\nZIMASCO management alleged that Kwekwe-based businessmen Shepard Tundiya and Denny Marandure had tried to use a High Court order approving the takeover of Sinosteel Zimasco to take over their own company by taking advantage of the name similarity.\n\nAnother corporate rescue order granted to the three is being questioned and handled by the Judicial Services Commission (JSC), which is expected to investigate Justice Joel Mambara for having actively worked with Manase, Tundiya, and Manase to illegally take over ZIMASCO.\n\nThe High Court, in a matter presided over by Mushure, granted Zimasco (Pvt) Ltd an interdict barring Manase from holding himself out as the companys corporate rescue practitioner.\n\nThis decision marks a major victory for Zimasco (Pvt) Ltd, whose management expressed surprise over how Manase attempted to position himself as the corporate rescue practitioner for Zimasco (Pvt) Ltd while using a court order against Sinosteel Zimasco (Pvt) Ltd, a company with no ties or relationship to Zimasco (Pvt) Ltd, said the company in a statement.\n\nThe High Court granted the interdict pending the return day where ZIMASCOs application for a declaration that it is not Zimasco Sinosteel (Pvt) Ltd or in the alternative rescission of the court order on the basis that it was never served on it and it has a sustainable defence on the merits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/13010214/ZIMASCO.png",
            "description": "<p>By Staff Reporter HIGH Court judge Justice Faith Mushure has blocked lawyer Wilson Manase, from presenting himself as ferro-chrome producer ZIMASCO’s Corporate Rescue Practitioner. Mushure granted ZIMASCO the interdict following attempts to take over operations at the company, including its premises and bank accounts, by Manase and two other businessmen. ZIMASCO management alleged that Kwekwe-based</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-blocks-manase-from-presenting-self-as-zimasco-corporate-rescue-practitioner/\">High Court blocks Manase from presenting self as ZIMASCO Corporate Rescue Practitioner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "Mngangagwa ally Tagwirei worms way into ZANU PF’s Central Committee",
            "url": "https://www.newzimbabwe.com/mngangagwa-ally-tagwirei-worms-way-into-zanu-pfs-central-committee/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwas close ally and controversial businessman Kudakwashe Tagwirei has been endorsed by Zanu PFs Harare provincial coordinating committee to join the ruling partys Central Committee.\n\nThe co-option now awaits the approval of Zanu PF Secretary General Obert Mpofu.\n\nThe Central Committee is ZANU PFs most powerful body between congresses, and Tagwireis appointment would mark a significant political manoeuvre by the businessman.\n\nSpeaking at a meeting in Harare on Monday, provincial chairperson Godwills Masimirembwa lavished praise on Tagwirei, describing him as a strategist who should be co-opted into the partys influential structures.\n\nMembers of the Central Committee in Harare have proposed that Cde Tagwirei be recommended for co-option into the Central Committee of ZANU PF. Cde Tagwirei is a party member in Harare Metropolitan Province. He is a strategist in business. He is a visionary business leader.\n\nSo, the proposal was put forward by members of the Central Committee, and the PCC unanimously agreed to recommend him for co-option into the Central Committee of ZANU PF. We are going to submit this recommendation to the partys Secretary-General, Dr Obert Mpofu, as the official position from Harare Province, said Masimirembwa.\n\nTagwirei has been accused of benefiting from his close ties to Mnangagwa through lucrative government contracts.\n\nHe secured a multimillion-dollar deal to construct the Mbudzi Interchange flyover and has expanded his business empire into mining while maintaining a near-monopoly in the fuel sector.\n\nTagwirei has been leading the Command Agriculture programme and currently chairs the Land Tenure Implementation Committee.\n\nMasimirembwa added that Tagwirei has been a staunch supporter of the ruling party.\n\nCde Tagwirei has been supporting the party, and this is the time for him to participate from within, particularly in championing economic empowerment, he said.\n\nTagwirei has also been at the centre of threats from militant war veteran Blessed Geza, who has accused him of being an oligarch.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa’s close ally and controversial businessman Kudakwashe Tagwirei has been endorsed by Zanu PF’s Harare provincial coordinating committee to join the ruling party’s Central Committee. The co-option now awaits the approval of Zanu PF Secretary General Obert Mpofu. The Central Committee is ZANU PF’s most powerful body between congresses, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mngangagwa-ally-tagwirei-worms-way-into-zanu-pfs-central-committee/\">Mngangagwa ally Tagwirei worms way into ZANU PF’s Central Committee </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "Rufaro Stadium still needs US$ 2 million for renovations despite Scottland lease deal – Harare Mayor",
            "url": "https://www.newzimbabwe.com/rufaro-stadium-still-needs-us-2-million-for-renovations-despite-scottland-lease-deal-harare-mayor/",
            "content": "By Sports Reporter\n\nHarare Mayor Jacob Mafume saysclose to US$ 2 million is needed to complete ongoing renovations at Rufaro stadiumdespite a lease deal with Scottland.\n\nRufaro Stadium, the ceremonial home of football, was opened last year for local Premier Soccer League games after being inactive for five years.\n\nHowever, despite the touch-ups, the venue still does not meet international standards to host CAF-approved games.\n\nThe stadium is yet to have bucket seats fitted around throughout all terraces, electronic turnstiles are yet to be installed and a standard media room is yet to be set up, among other things.\n\nWhat we have used to renovate Rufaro stadium to get to where it is, close to US$ 1 million, but of course its not the exact figure.\n\nFor us to complete renovations and meet international standards, it will be close to US$ 2 million needed.\n\nWe have to build a B arena, expand the car park, we needed to put flood lights, electronic turnstiles and fitting bucket seats on all the seating terraces, said Mafume in an interview.\n\nLast week, after Harare City Council revealed it had entered a new leasing deal with gold dealer Scott Sakupwanyas Scottland FC.\n\nMafume claimed the lease deal has nothing much to do with money, rather its an agreement which will see the Mabvuku-based side assisting with one or two needs on the ongoing renovations.\n\nHe highlighted that the Scottland lease deal is a new model the council is taking with all Premier Soccer League clubs which use the venue as a home ground, including CAPS United and Dynamos.\n\nRufaro stadium is leased to four teams, Dynamos,CAPS United, Herentals and Scottland.\n\nWhat we have done is that this lease should be something which benefits both sides, he said.\n\nMafume added, For instance Dynamos has a long lease signed many years ago, which doesnt benefit the facility.\n\nSo what we agreed on as council is that all teams using the facility must tell us what they can do for the improvement and maintenance of the stadium.\n\nHence, we are putting all this on paper, Scottland being the first team, we will do the same with Dynamos, CAPS United and Herentals.\n\nSigning a lease deal with Scottland does not give them 100 % power on the facility like it is said on social media, but it was just a formal lease agreement, which is more formal as compared to the running ones we have with these other three teams.\n\nScottland is going to assist us with one or two needs for ongoing renovations, and these other teams must also do the same.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/05120417/rufaro-1.jpg",
            "description": "<p>By Sports Reporter Harare Mayor Jacob Mafume says close to US$ 2 million is needed to complete ongoing renovations at Rufaro stadium despite a lease deal with Scottland. Rufaro Stadium, the ceremonial home of football, was opened last year for local Premier Soccer League games after being inactive for five years. However, despite the touch-ups, the venue</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rufaro-stadium-still-needs-us-2-million-for-renovations-despite-scottland-lease-deal-harare-mayor/\">Rufaro Stadium still needs US$ 2 million for renovations despite Scottland lease deal – Harare Mayor</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "One goal in four matches – Luphahla’s rocky start at Simba Bhora",
            "url": "https://www.newzimbabwe.com/one-goal-in-four-matches-luphahlas-rocky-start-at-simba-bhora/",
            "content": "By Darlington Gatsi\n\nSIMBA Bhora coach, Joel Luphahla, put on a brave face on Sunday after his side was stunned for the second time this year by fading giants Dynamos.\n\nHowever, the defeat adds a layer of pressure on Luphahla, who was appointed last year following the departure of championship-winning coach Tonderai Ndiraya from the Shamva-based side.\n\nHaving lost influential players who were key to clinching their maiden championship, such as Walter Musona, Mthokozisi Msebe, Tymon Machope, and Tichaona Chipunza, Simba Bhora plugged the gap with quality talent.\n\nBlessed Ndereki, Donald Mudadi, Never Tigere, Liberty Chakoroma, and Malawian import William Thole were brought in by the Shamva side, adding depth to the squad.\n\nDespite boasting quality in his ranks, Luphahla is yet to make a mark on Simba Bhoras ambitions this season.\n\nWith one win, two draws, and one lossscoring just one goalLuphahlas record in the Castle Lager Premier Soccer League season has been underwhelming.\n\nNevertheless, Luphahla refused to press the panic button over his teams performances thus far.\n\nI am confident in the team that we have. We are still trying to find ways to finish off matches. We have played four games.\n\nIt is a worry, it is a concern that we have scored only one goal. But overall, the boys are trying; they are doing their best. The management is also trying and doing their best to support the club, said Luphahla.\n\nPerhaps tellingly, Luphahla has been exposed as a relatively inexperienced coach tasked with steering the defending champions.\n\nHe has never held a head coaching position in the top flight, having been denied the chance to lead TelOne in their maiden season in 2019.\n\nThe Simba Bhora stint is somewhat of a learning curve for the former Zimbabwe national team player.\n\nLuphahla said his team needs ample time to gel to get their season going and possibly mount a serious challenge to retain the league championship.\n\nIt is just a matter of time, but we had said maybe by game number six, that is when we will be at our best, because some of the boys joined us after we returned from South Africa. We are still trying to integrate them with the rest of the squad, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/01041533/Lupahla.jpg",
            "description": "<p>By Darlington Gatsi SIMBA Bhora coach, Joel Luphahla, put on a brave face on Sunday after his side was stunned for the second time this year by fading giants Dynamos. However, the defeat adds a layer of pressure on Luphahla, who was appointed last year following the departure of championship-winning coach Tonderai Ndiraya from the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/one-goal-in-four-matches-luphahlas-rocky-start-at-simba-bhora/\">One goal in four matches – Luphahla’s rocky start at Simba Bhora </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "Dairibord bemoans economic policy challenges",
            "url": "https://www.newzimbabwe.com/dairibord-bemoans-economic-policy-challenges/",
            "content": "By Alois Vinga\n\nDAIRIBORD Holdings Limited has bemoaned the impact of economic policies on trading on the back of plans to optimize operations while enhancing capacity to ease the tremors.\n\nPresenting the companys performance for the period ended December 31 2024 chairman Josephat Sachikonye described the just concluded financial period as presenting significant challenges. He said the introduction of new tax regulations, a restrictive monetary policy framework, and exchange rate volatility choked the smooth flow of operations.\n\nThe introduction of the Zimbabwe Gold currency in April initially stabilized both the exchange rates and inflation. However, by September 2024, rapid depreciation led to substantial devaluation, causing pricing distortions within formal trade that stifled performance, he said.\n\nHe said the introduction of the sugar content surtax fiscal policy adjustments, including the VAT reclassification of milk products, and the increased Intermediated Money Transfer Tax (IMTT) on US$ transactions, resulted in significant cost increases.\n\nThis necessitated price increases, particularly across the beverages portfolio, that negatively impacted competitiveness and consumer demand. Consequently, a price rollback to pre-surtax pr pricing was implemented, leading to margin erosion.\n\nOperational inefficiencies stemming from inconsistent availability of utilities increased production costs and disrupted output while supply chain challenges hindered material procurement, he said.\n\nMeanwhile, during the period, the group achieved a consolidated volume growth of 10% driven by a strong performance in the Liquid Milks and Foods categories, though constrained by a marginal 1% growth in Beverages.\n\nThe liquid milks 20% significant year-over-year growth was due to an increased raw milk supply, with notable market share gains across Chimombe, Steri and Lacto. Food sales volumes rose 47%, led by Yummy yoghurt and ice cream, while improved product availability bolstered Rabroy Tomato Sauce sales.\n\nBeverages realized only 1 % growth, impacted by subdued Pfuko Maheu performance due to pricing challenges from sugar tax and VAT adjustments. US$ sales volume rose to 83% of total volume, up from 79% in the corresponding prior year period.\n\nThe group continues to navigate a complex and volatile environment characterized by evolving regulatory policies and currency fluctuations. High input costs, an onerous tax burden and pricing pressures remain key challenges, added Sachikonye.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/22172046/Dairibord.jpg",
            "description": "<p>By Alois Vinga DAIRIBORD Holdings Limited has bemoaned the impact of economic policies on trading on the back of plans to optimize operations while enhancing capacity to ease the tremors. Presenting the company’s performance for the period ended December 31 2024 chairman Josephat Sachikonye described the just concluded financial period as ‘presenting significant challenges’. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dairibord-bemoans-economic-policy-challenges/\">Dairibord bemoans economic policy challenges </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "Police officer jailed for soliciting US$800 bribe",
            "url": "https://www.newzimbabwe.com/police-officer-jailed-for-soliciting-us800-bribe/",
            "content": "By James Muonwa\n\nA ZIMBABWE Republic Police (ZRP) officer has been convicted of criminal abuse of duty as a public officer for demanding US$800 bribe.\n\nConstable Peter Loverage Mombe (36) appeared at the Harare Magistrates Court facing a bribery charge.\n\nHe was convicted after a full trial and sentenced to 10 months imprisonment.\n\nThe State case is that on August 2, 2023, and at Engen Service Station, opposite the Vehicle Inspection Department (VID) Eastlea in Harare, Mombe solicited a bribe from truck owner Francis Nembire, whose vehicle had been seized for allegedly transporting lithium ore without a removal permit.\n\nNembire then promised to facilitate the payment for Mombe later on.\n\nFollowing incessant phone calls demanding the kick-back, the complainant reported the matter to ZRP Internal Investigations Unit, leading to a sting operation being set up using trap money.\n\nCourt heard that the complainant met the offender at the service station, where he received the trap money.\n\nAs the transaction was happening, police detectives closed in. Mombe noticed he was under the police radar and attempted to flee, throwing away the cash. He was, however, apprehended on the spot.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By James Muonwa A ZIMBABWE Republic Police (ZRP) officer has been convicted of criminal abuse of duty as a public officer for demanding US$800 bribe. Constable Peter Loverage Mombe (36) appeared at the Harare Magistrates Court facing a bribery charge. He was convicted after a full trial and sentenced to 10 months’ imprisonment. The State</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-officer-jailed-for-soliciting-us800-bribe/\">Police officer jailed for soliciting US$800 bribe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "Regé-Jean Page and Halle Bailey to star in ‘Italianna’",
            "url": "https://www.newzimbabwe.com/rege-jean-page-and-halle-bailey-to-star-in-italianna/",
            "content": "Deadline\n\nHalle Baileyand Reg-Jean Page will star inItaliannafor Universal Pictures, with Kat Coiro set to direct. Ryan Engle wrote the screenplay for the film based on an original idea by Ryan Engle and Kristin Engle. Plot details are being kept under wraps. Will Packer and Johanna Byer will produce the film through Will Packer Productions first look deal with Universal Pictures.\n\nSenior EVP Erik Baiers and Director of Development Jacqueline Garell will oversee the project for the studio. Alvie Hurtado will oversee for Will Packer Productions.\n\nCoiro and Universal have strong ties going back to the 2022 rom-comMarry Me,starring Jennifer Lopez and Owen Wilson. Following that production, the two sides worked hard to find their next project together, landing onItalianna.They soon landed on two coveted actors to star in the pic, and before long they were off to the races to get this into production.\n\nCoiro and Universal have strong ties going back to the 2022 rom-comMarry Me,starring Jennifer Lopez and Owen Wilson. Following that production, the two sides worked hard to find their next project together, landing onItalianna.They soon landed on two coveted actors to star in the pic, and before long they were off to the races to get this into production.\n\nBailey is best known as a half of the five-time Grammy-nominated duo Chloe x Halle but launched her film career starring as Ariel in Disneys live-actionThe Little Mermaidpic in 2023. She followed that up by joining Warner Bros reimagining ofThe Color Purple.\n\nNominated for an Emmy and two SAG Awards for his lead role in the smash first season ofBridgerton, Page stars alongside Michael Fassbender and Cate Blanchett in Steven Soderberghs filmBlack Bag,which Focus and Universal Picturesopened March.\n\nCoiro recently directed the pilot and half of the first season of CBSMatlock, starring Kathy Bates. She also recently received DGA Award and Childrens & Family Emmy noms for her work on Rokus seriesThe Spiderwick Chronicles.\n\nEngle has been a screenwriter for the past 15 years, known forNon-Stop,The Commuter,Breaking In,RampageandBeast.\n\nPackers films have earned more than $1 billion, with nine opening at No. 1 at the box office and 2017sGirls Tripbreaking box office records for an R-rated comedy.\n\nBailey is represented by CAA. Page is represented by UTA, Brillstein Entertainment Partners, Shelter PR and Johnson Shapiro Slewett & Kole. Coiro is represented by CAA, 3 Arts Entertainment and Sloane Offer Weber & Dern. Engle is represented by CAA, Michael Lasker at Mosaic and Jeff Frankel at McKuin Frankel Whitehead LLP. Packer is represented by CAA and Johnson Shapiro Slewett & Kole.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/01035242/rege-halle.jpeg",
            "description": "<p>Deadline Halle Bailey and Regé-Jean Page will star in Italianna for Universal Pictures, with Kat Coiro set to direct. Ryan Engle wrote the screenplay for the film based on an original idea by Ryan Engle and Kristin Engle. Plot details are being kept under wraps. Will Packer and Johanna Byer will produce the film through Will Packer Productions’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rege-jean-page-and-halle-bailey-to-star-in-italianna/\">Regé-Jean Page and Halle Bailey to star in ‘Italianna’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "University of Johannesburg rejects claims by ‘lecturer’ who favoured Zimbabwean students",
            "url": "https://www.newzimbabwe.com/university-of-johannesburg-rejects-claims-by-lecturer-who-favoured-zimbabwean-students/",
            "content": "IOL\n\nTheUniversity of Johannesburg(UJ) has distanced itself from Joel Sangweni, who claimed to be a lecturer at the institution after a post on social media that he intentionally fails South African students while ensuring Zimbabwean students pass with distinctions.\n\nIn a comment that has since sparked widespread outrage, Sangweni wrote on Facebook: We dont make money here, mina (loosely translated as me) Im a lecturer, I will make your kids suffer and fail, those from Zimbabwe will pass with distinctions.\n\nThe comment led to intense backlash, with many social media users interpreting it as direct attack on South African students.\n\nFollowing the uproar on social media, in which many people have been tagging UJ on social media and demanded action, the university has since clarified the situation.\n\nIn a statement, UJ said itis aware of social media posts by Joel Sangweni, who falsely claims to be a lecturer at the institution.\n\nThe university denied that Sangweni is employed as a lecturer by UJ, stating:Mr. Sangweni is not employed by the university in any capacity. He briefly served as a tutor in 2024,UJ said in a statement.\n\nWhile Sangweni later claimed that his Facebook account was hacked, UJ said it is investigating the matter.\n\nThe university takes academic integrity seriously and will take strong steps, including legal action, against any person who, by omission or commission, undermines its commitment to academic integrity, the university stated.\n\nUJ said it distances itself from his remarks and is considering legal action.\n\nThe University remains committed to academic integrity and does not tolerate conduct that undermines its values.\n\nMeanwhile, social media has been abuzz with people demanding the deportation of foreign nationals and the prioritisation of employment for South Africans.\n\nGuys this are the kind of people University of Johannesburg hires @go2uj @mediauj your lecturer Joel Sangweni is threatening the future of our kids & we are expected to be quiet because we will be called xenophobic? we will not tolerate such, Abahambee#abahambe #putSAfirs (Sic), wrote @Ms_MoloGady on X (formerly known as Twitter)\n\n@sdu_mpembe added: We have a problem, how was he hired, apparently this Joel Sangweni, a Zimbabwean lecturer who fails South African students and gives his citizens distinctions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/01044546/university-of-joburg.jpg",
            "description": "<p>IOL The University of Johannesburg (UJ) has distanced itself from Joel Sangweni, who claimed to be a lecturer at the institution after a post on social media that he intentionally fails South African students while ensuring Zimbabwean students pass with distinctions. In a comment that has since sparked widespread outrage, Sangweni wrote on Facebook: “We don’t</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-johannesburg-rejects-claims-by-lecturer-who-favoured-zimbabwean-students/\">University of Johannesburg rejects claims by ‘lecturer’ who favoured Zimbabwean students</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        },
        {
            "title": "March 31 protest: Zimbabweans in South Africa demonstrate at embassy; beg for Ramaphosa’s intervention",
            "url": "https://www.newzimbabwe.com/march-31-protest-zimbabweans-in-south-africa-demonstrate-at-embassy-beg-for-ramaphosas-intervention/",
            "content": "By Staff Reporter\n\nPretoria  Zimbabweans took to the streets, Monday, protesting against President Emmerson Mnangagwas government and the extension of his term in office.\n\nThis follows calls for demonstrations against Mnangagwa by expelled Zanu-PF Central Committee member and war veteran Blessed Geza.\n\nThe protesters first gathered at the Union Buildings in Pretoria, where they pleaded with South African President Cyril Ramaphosa to intervene, DW Africa reported.\n\nThey then marched to the Zimbabwean embassy, demanding the immediate resignation of Mnangagwa and his administration.\n\nMnangagwa must go with his cabinetwe are suffering, said one protester.\n\nI am saying to Mnangagwa,can you please step down? another protester added.\n\nThe leader of the protest, Silwangani Ncube, also weighed in, saying, Please, Mnangagwa, the honorable thing you can do now is step down.\n\nIn an interview with SABC News, Ambassador of Zimbabwe to South Africa David Hamadziripi dismissed any tensions in the country, saying it was just social media.\n\nEverything is normal, and what is on social media is not reality, there is nothing happening in Zimbabwe, everything is normal, he said.\n\nMeanwhile, in Harare, dozens of people held a protest at Robert Mugabe Square, where they weredispersed by police.\n\nThe group later reappeared along Rotten Row, barricading the road and chanting songs rejecting Mnangagwas 2030 agenda.\n\nThey were again dispersed by police using water cannons and teargas.\n\nIn major cities like Bulawayo and Harare, police set up checkpoints on roads leading to central business districts, searching vehicles for dangerous weapons.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/01050929/pretoria.jpeg",
            "description": "<p>By Staff Reporter Pretoria – Zimbabweans took to the streets, Monday, protesting against President Emmerson Mnangagwa’s government and the extension of his term in office. This follows calls for demonstrations against Mnangagwa by expelled Zanu-PF Central Committee member and war veteran Blessed Geza. The protesters first gathered at the Union Buildings in Pretoria, where they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protest-zimbabweans-in-south-africa-demonstrate-at-embassy-beg-for-ramaphosas-intervention/\">March 31 protest: Zimbabweans in South Africa demonstrate at embassy; beg for Ramaphosa’s intervention</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "01 Apr 2025"
        }
    ]
}