{
    "news": [
        {
            "title": "Miscommunication from unauthorised office! – presidential spokesperson dismisses ban on tinted vehicle windows",
            "url": "https://www.newzimbabwe.com/miscommunication-from-unauthorised-office-presidential-spokesperson-dismisses-ban-on-tinted-vehicle-windows/",
            "content": "By Leopold Munhende\n\nPRESIDENTIAL Spokesperson George Charamba has dismissed Provincial Affairs and Devolution Secretary Tafadzwa Mugutis decision to ban the tinting of windows on private and public vehicles.\n\nThe ban, announced on Tuesday this week, was said to be a response to drug use and transportation by vehicles that had tinted windows and also a rape that occurred at Harares Rezende Rank where a grade seven pupil was locked and violated inside a tinted commuter omnibus.\n\nPosting on Twitter, formerly X, using his Dhonzamusoro account, Charamba said Mugutis office did not have the authority he sought to imply it had.\n\nKINDLY NOTE: There is no basis in fact or law to the accompanying announcement attributed to Muguti. Kindly ignore this miscommunication from an unauthorised office and officer! said Charamba in a tweet that was accompanied by a video of Muguti passing his declaration.\n\nKINDLY NOTE: There is no basis in fact or law to the accompanying announcement attributed to Secretary Muguti. Kindly ignore this mis-communication from an unauthorized office and Officer!pic.twitter.com/78O2P5Lw2t\n\n dhonzamusoro007 (@dhonzamusoro007)September 3, 2025\n\nThe confusion was not explained, while Charamba maintained that he was correcting an anomaly and fixing the negative.\n\nAll provinces will enforce a complete ban on private vehicles and public transporters having tinted windows on their vehicles, except for government VIP, security vehicles and all those manufactured with standard shades of tint, Muguti had announced.\n\nThis follows an increase in crime in transportation vehicles, especially Mushikashika, armed robbers and other criminals and also the recent rape of a grade seven girl in an omnibus.\n\nSo we will not be allowing any commuter omnibus to have tint.\n\nMuguti had gone to the extent of ordering police officers to rip it off dissenting drivers vehicles or have them impounded for failure to comply.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/15192357/George-Charamba.jpeg",
            "description": "<p>By Leopold Munhende PRESIDENTIAL Spokesperson George Charamba has dismissed Provincial Affairs and Devolution Secretary Tafadzwa Muguti’s decision to ban the tinting of windows on private and public vehicles. The ban, announced on Tuesday this week, was said to be a response to drug use and transportation by vehicles that had tinted windows and also a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miscommunication-from-unauthorised-office-presidential-spokesperson-dismisses-ban-on-tinted-vehicle-windows/\">Miscommunication from unauthorised office! – presidential spokesperson dismisses ban on tinted vehicle windows</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        },
        {
            "title": "Chimedza settling in well at Portugal’s AC Marinhense",
            "url": "https://www.newzimbabwe.com/chimedza-settling-in-well-at-portugals-ac-marinhense/",
            "content": "By Sports Reporter\n\nZimbabwe international Colbert Junior Chimedza says he is settling in well at his new club, AC Marinhense, in Portugals lower division.\n\nThe 20-year-old midfielder joined Marinhense last month on a one-year loan deal from Portuguese top-flight side Gil Vicente. Since his arrival, he has featured in every match his new team has played.\n\nHis latest outing came over the weekend when he helped Marinhense advance to the second round of the Taa de Portugal knockout tournament.\n\nIts always difficult to adapt to a new environment, but Im happy with how Im settling in here. My teammates and coaches have welcomed me warmly, Chimedza said.\n\nIve played at least four competitive games so far, and in our last cup match, I was pleased to contribute to the teams progress to the next stage.\n\nChimedza signed for Gil Vicente earlier this year but was unable to feature due to delays in the clearance of his international papers. As a result, he was loaned out to gain game time and experience.\n\nThe former MK Dons player hopes his spell at Marinhense will prepare him for a return to his parent club.\n\nMy focus is on working hard and contributing to Marinhenses success. At the end of the season, my target is to return to Gil Vicente and cement my place in the team, he added.\n\nBorn in Harare, Chimedza moved to England at the age of 14 after being scouted by English League Two side MK Dons, where he developed before moving to Portugal this year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03050419/14445524_cobert_chimedza_20250409121725.jpg",
            "description": "<p>By Sports Reporter Zimbabwe international Colbert Junior Chimedza says he is settling in well at his new club, AC Marinhense, in Portugal’s lower division. The 20-year-old midfielder joined Marinhense last month on a one-year loan deal from Portuguese top-flight side Gil Vicente. Since his arrival, he has featured in every match his new team has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chimedza-settling-in-well-at-portugals-ac-marinhense/\">Chimedza settling in well at Portugal’s AC Marinhense</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        },
        {
            "title": "NMBZ fees and commission income almost doubles",
            "url": "https://www.newzimbabwe.com/nmbz-fees-and-commission-income-almost-doubles/",
            "content": "By Alois Vinga\n\nLISTED financial services provider, NMBZs fees and commission income reached ZWG623, 3 million during the first half of 2025, almost double the amount generated in the same period last year.\n\nIn banking terms, fee and commission income refers to the revenue a bank generates from charging for its products and services, rather than from lending interest. This income stream is generated by fees for transactions such as withdrawals, transfers, currency exchanges, and card issuance, as well as commissions.\n\nPresenting the groups half-years performance this week, NMBZ CEO, Gerald Gore, said a total ZWG623,3 million was generated compared to ZWG383,6 million generated last year under the same revenue category.\n\nThis indicator confirms the earlier complaints by the banking public on the need for monetary authorities to prevent banks from charging high commission fees.\n\nHigh charges have been singled out for discouraging Zimbabweans from using formal banking services in favour of risky informal systems.\n\nA recent study by the National Economic Competitiveness Forum (NECF) also revealed that the cost of banking in Zimbabwe is a bit on the high side when compared to best practices.\n\nMeanwhile, during the period under review,the group operated profitably for the period under review, generating a comprehensive income of ZWG 98.9 million for the period compared to ZWG56,1 million for the prior comparative period.\n\nRestructuring expenses of ZWG138,5 million were incurred during the year, primarily related to a change in strategic focus towards a digital and more efficient operation. These costs include severance payments and other termination costs.\n\nTotal assets closed the period at ZWG7.8 billion, up 6% from ZWG7.4 billion as at 31 December 2024. The growth was largely funded by an increase in customer deposits. Loans and advances stood at ZWG3.4 billion as at 30 June 2025, up from ZWG2.9 billion as at 31 December 2024.\n\nThe growth was driven by the deployment of foreign lines of credit, largely to exporting companies. The groups focus remains on maintaining a robust credit risk management framework to ensure a sustainable quality portfolio.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/10024509/NMB-Bank-Zimbabwe.png",
            "description": "<p>By Alois Vinga LISTED financial services provider, NMBZ’s fees and commission income reached ZWG623, 3 million during the first half of 2025, almost double the amount generated in the same period last year. In banking terms, fee and commission income refers to the revenue a bank generates from charging for its products and services, rather</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-fees-and-commission-income-almost-doubles/\">NMBZ fees and commission income almost doubles</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        },
        {
            "title": "Bombing of Job Sikhala’s house raises fears of renewed attacks targeting Zanu PF critics",
            "url": "https://www.newzimbabwe.com/bombing-of-job-sikhalas-house-raises-fears-of-renewed-attacks-targeting-zanu-pf-critics/",
            "content": "By Staff Reporter\n\nHUMAN rights defenders have criticised the recent bombing of opposition leader Job Sikhalas Chitungwiza home, amid fears of a renewed wave of raids on properties linked to exiled Zimbabweans.\n\nThe alleged bombing of Sikhalas house while he was away in South Africa raises the spectre of a fresh campaign of political persecution, says human rights activist Munacho Humbasha.\n\nHe says the attack on Sikhalas house is a chilling message to critics of Zanu PF, both at home and abroad.\n\nSikhala, a former legislator and long-time government critic, has been frequenting South Africa for medical and political engagements.\n\nHumbasha told NewZimbabwe.com that Zanu PF functionaries and State security agents have openly declared war on activists in the diaspora, with families back home being deliberately targeted.\n\nThose with houses visited in the widening campaign and searches include that of Petty Ziramba, Panganayi Mauzinyu, Ralph Dube, Fransisca Chiduku, and Shepherd Yuda, said Humbasha.\n\nIn Mabvuku, unknown men believed to be State agents raided the home of the late opposition activist Tonderai Ndira. The assailants took household property and left the house empty, promising to return and destroy their livelihoods. The family is still in shock.\n\nIn Harare, suspected operatives broke into Blessing Makeyis house and again into his family home, allegedly searching for incriminating material. Makevi has been active in diaspora protests against President Emmerson Mnangagwas government, Humbasha told NewZimbabwe.com in an interview.\n\nAlso, another dissenter, Ralph Dubes family, is living in uncertainty after receiving threatening messages, says Humbasha.\n\nBack home, he further claimed, several homes in Seke, Chitungwiza, having been visited by suspicious individuals in recent days, thereby sparking fears in the community.\n\nDespite repeated reports of break-ins and intimidation, police have not arrested anyone in connection with the incidents. Efforts to get a comment from police national spokesman, Commissioner Paul Nyathi, were fruitless by the time of publishing.\n\nVictims and their families say the inaction points to the States complicity.\n\nThis is meant to punish those of us who are in the UK and elsewhere. Our families are being harassed everyday because we speak out, said UK-based activist, Melody Magejo, who spoke to NewZimbabwe.com in a telephone interview.\n\nA human rights lawyer, who preferred anonymity, said as Mnangagwa gravitates towards entrenching his rule through his 2030 agenda, the political environment is set to worsen.\n\nThe use of Patriotic Act and Cyber Security Act 2023 will lead to many arrests of those who are actively participating in campaigns on social media.\n\nIt is without a doubt that Mnangagwas government does not want the outside world to know what is happening in the country, said the lawyer.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Staff Reporter HUMAN rights defenders have criticised the recent bombing of opposition leader Job Sikhala’s Chitungwiza home, amid fears of a renewed wave of raids on properties linked to exiled Zimbabweans. The alleged bombing of Sikhala’s house while he was away in South Africa raises the spectre of a fresh campaign of political persecution,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bombing-of-job-sikhalas-house-raises-fears-of-renewed-attacks-targeting-zanu-pf-critics/\">Bombing of Job Sikhala’s house raises fears of renewed attacks targeting Zanu PF critics</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        },
        {
            "title": "Ipswich man Blessing Mudzinge jailed for defrauding Barclays, Lloyds £500,000",
            "url": "https://www.newzimbabwe.com/ipswich-man-blessing-mudzinge-jailed-for-defrauding-barclays-lloyds-500000/",
            "content": "Ipswich Star\n\nA fraudster who was involved in a sophisticated 500,000 scam during which bank customers details were used to transfer money out of their accounts has been jailed.\n\nSentencing 41-year-old Ipswich man Blessing Mudzinge, Judge Martyn Levettsaid he was a leading figure in conspiracies to defraud Barclays of 475,918 and Lloyds of 15,000 through account takeover frauds over a period of 26 months.\n\nThe judge told Mudzinge atIpswich Crown Courton Monday: You provided scripts to be used when speaking on line or phone to banking staff and you provided guidance to others.\n\nTo conceal proceeds, you arranged for them to be laundered through mule accounts you persuaded others to allow you to use and through those accounts you either withdrew cash or wanted accounts linked to cryptocurrency accounts for quick and easy dissipation.\n\nJudge Levett said data breaches of personal identity information were increasing in prevalence and the court had heard that there was a growing number of similar types of fraud cases where the offender, usually from an organised crime group, is able to open false bank accounts using collected and harvested personal information gathered from multiple sources such as utility bills, intercepted mail, unsolicited invitations to buy goods on-line with credit cards and open source information about companies on the internet or from CompaniesHouse, and other accessible sources.\n\nHe added: In this digital age where more information is being requested by call handlers to ensure verification of customer bank account details to confirm that an account exists and that it belongs to the right customer, a fraudster with a plausible charming personality is able to engage with a call handler to get as much information from them as they would need to make up a profile for a false bank account purporting to be notionally a genuine customer.\n\nThese false bank accounts have become colourfully known Frankenstein accountsbecause, like the legendary monster, the account is composed from parts of other identities which have been stitched together into a fraudulent composite, making and giving the outward appearance of a genuine account.\n\nAndrew Herd, prosecuting at Ipswich Crown Court, saidthe losses were covered by the banksand not individual account holders, which included a number of businesses.\n\nThe court heard that Mudzinge had made multiple calls to the banks pretending to be a company director and asking for personal details on accounts to be changed so he could access them and transfer money out of them.\n\nThere were a number of unexplained deposits of more than 100,000 into Mudzinges personal accounts but these were now empty.\n\nMudzinge, of Skylark Lane, Ipswich, admitted two offences of conspiracy to commit fraud by false representation between October 2022 and December last year, entering into a money laundering arrangement and possession of articles for use in fraud.\n\nHe was jailed for 57 months and two weeks.\n\nSteven Ball, for Mudzinge, who has 67 previous convictions, said his client was concerned that he had been left to carry the can for unknown people who had benefited from the fraud in much more of a way than he had.\n\nThe prosecution dont suggest he was the beneficiary of all the money, said Mr Ball.\n\nHe had become involved in the fraud after amassing debts of 12,500 and since being remanded in custody hed been a model prisoner.\n\nA hearing under the Proceeds of Crime Act will take place in February.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/03043721/mudzinge-b.png",
            "description": "<p>Ipswich Star A fraudster who was involved in a “sophisticated” £500,000 scam during which bank customers’ details were used to transfer money out of their accounts has been jailed. Sentencing 41-year-old Ipswich man Blessing Mudzinge, Judge Martyn Levett said he was a leading figure in conspiracies to defraud Barclays of £475,918 and Lloyds of £15,000 through</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ipswich-man-blessing-mudzinge-jailed-for-defrauding-barclays-lloyds-500000/\">Ipswich man Blessing Mudzinge jailed for defrauding Barclays, Lloyds £500,000</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        },
        {
            "title": "Zanu PF, Tshabangu share US$3.6 million in political parties finances",
            "url": "https://www.newzimbabwe.com/zanu-pf-tshabangu-share-us3-6-million-in-political-parties-finances/",
            "content": "By Leopold Munhende\n\nZANU PF will get ZW$102,343,972.50 of this years ZW$147,682,500 political parties financing purse, Justice Minister Ziyambi Ziyambi has said.\n\nThe ruling partys opposite number, the Citizens Coalition for Change (CCC), headed by controversial politician Sengezo Tshabangu, will get ZW$45,338,527, which is about US$1,133,463 on the informal market.\n\nZanu PF claimed 69.3% of the 2023 vote against CCCs 30.7%.\n\nThe percentage is what is used as per the Political Parties (Finance) Act to determine how much parties that exceed the 5% threshold are paid by the state.\n\nWith firebrand politician Nelson Chamisa having been forced out of the CCC, Tshabangu and other senior members will, as has become the norm, determine the fate of the millions.\n\nTshabangus role as leader of opposition in Parliament has been questioned since taking over the party.\n\nWords of support to President Emmerson Mnangagwa after a visit to his Precabe Farm in Kwekwe were used by analysts as evidence that he had either been bought or was a willing participant in the demise of the promising opposition party.\n\nLeft with very few loyalists in Parliament after many were recalled by Tshabangu, CCC opposition figures backing Chamisa have been left powerless.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14142859/Tshabangu-ED-e1736865004886.webp",
            "description": "<p>By Leopold Munhende ZANU PF will get ZW$102,343,972.50 of this year’s ZW$147,682,500 political parties financing purse, Justice Minister Ziyambi Ziyambi has said. The ruling party’s “opposite number,” the Citizens Coalition for Change (CCC), headed by controversial politician Sengezo Tshabangu, will get ZW$45,338,527, which is about US$1,133,463 on the informal market. Zanu PF claimed 69.3% of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-tshabangu-share-us3-6-million-in-political-parties-finances/\">Zanu PF, Tshabangu share US$3.6 million in political parties finances</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        },
        {
            "title": "South Africa: Civil society pushes for urgent clarity on Zimbabwean permits",
            "url": "https://www.newzimbabwe.com/south-africa-civil-society-pushes-for-urgent-clarity-on-zimbabwean-permits/",
            "content": "The South African\n\nThe Helen Suzman Foundation (HSF) and the Consortium for Refugees and Migrants in South Africa (CoRMSA) have called on the government to urgently clarify the future of the Zimbabwean Exemption Permit (ZEP), which is due to expire in November 2025.\n\nIn a joint statement, the two organisations said thousands of Zimbabwean permit holders remain in the dark about how the court-ordered consultation process will unfold, or whether theMinister of Home Affairs plansto extend the permit.\n\nThey warned that last years last-minute extension had already left families in limbo, and that this years silence is making matters worse. The lack of clarity is creating devastating consequences, they said.\n\nAccording to HSF and CoRMSA, many Zimbabweans on the permit have already lost jobs, struggled to enrol their children for the 2026 school year, and faced difficulties accessing basic healthcare. They argue that these hardships show why the government must act well before the November deadline.\n\nHSF and CoRMSA call on the Minister of Home Affairs to urgently provide clarity on the status of the consultation process, theorganisations insisted.\n\nIf the process cannot be implemented in time, government must extend the ZEP well before the November deadline. Such action is necessary to prevent further hardship and to uphold fairness and the rule of law.\n\nThe ZEP, first introduced in 2009 to regularise the stay of Zimbabweans in South Africa, has faced years of uncertainty.\n\nA June 2023 High Court ruling ordered the Department of Home Affairs to ensure a fair process before terminating the programme, a decision later confirmed by the Constitutional Court.\n\nAs a result, the permit remains valid until late November 2025.\n\nBut with only months left before that deadline, rights groups warn that the clock is ticking and that delay is once again throwing thousands of lives into chaos.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/30214201/zep.webp",
            "description": "<p>The South African The Helen Suzman Foundation (HSF) and the Consortium for Refugees and Migrants in South Africa (CoRMSA) have called on the government to urgently clarify the future of the Zimbabwean Exemption Permit (ZEP), which is due to expire in November 2025. ZEP holders left in the dark In a joint statement, the two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-civil-society-pushes-for-urgent-clarity-on-zimbabwean-permits/\">South Africa: Civil society pushes for urgent clarity on Zimbabwean permits</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "03 Sep 2025"
        }
    ]
}