{
    "news": [
        {
            "title": "New Zealand crushes Zimbabwe by 60 runs to keep perfect record at T20 tri-series",
            "url": "https://www.newzimbabwe.com/new-zealand-crushes-zimbabwe-by-60-runs-to-keep-perfect-record-at-t20-tri-series/",
            "content": "AP\n\nNew Zealand stayed perfect at the T20 tri-series with a crushing 60-run win over host Zimbabwe on Thursday.\n\nTim Seifert (75) smashed his second successive half century and Rachin Ravindra made an entertaining 63 runs off 39 balls as New Zealand posted the tournaments highest total of 190-6 with its fourth straight win of the league stage.\n\nNew Zealand and South Africa had already secured their places in Saturdays final.\n\nLeg-spinner Ish Sodhi, one of four changes for New Zealand, grabbed a career-best 4-12 in four overs as Zimbabwe was dismissed for 130 in 18.5 overs.\n\nZimbabwe lost all four games.\n\nMitchell Santner became the first captain in the tournament to choose to bat first on a tricky wicket after winning the toss.\n\nTim Robinson (10) couldnt capitalize on Ryan Burls dropped catch in the slips before he had scored and was out to Zimbabwes best bowler, Richard Ngarava (4-34).\n\nZimbabwe was scrappy in the field when Seifert got a lucky escape on 13 as Tony Munyonga missed a catching opportunity at deep backward square leg.\n\nTogether with Ravindra, Seifert raised 108 runs for the second wicket before Zimbabwe hit back.\n\nFast bowler Tinotenda Maposa had both Ravindra and Mark Chapman caught in the outfield in the space of three balls and Ngarava chipped in with three wickets in his return spell.\n\nSeifert feathered a catch to wicketkeeper Clive Madande after Ngarava outfoxed him with a slower ball while Bevon Jacobs was spectacularly caught by Munyonga at backward point.\n\nMichael Bracewell made a 16-ball 26 and Trevor Gwandu (0-51) went for 21 runs off his final over.\n\nDifferent guys stepping up at different times is a good thing, although it can be a selection headache at times, Santner said. We know we have a massive game in a couple of days time.\n\nZimbabwe opener Dion Myers (22) smashed four boundaries in a brisk start before Sodhi struck three times inside the batting powerplay and the hosts were reduced to 37-4.\n\nSodhi clean bowled Myers and Madande after Brian Bennett was caught when he failed to clear Jacobs at extra cover as he tried to show early aggression against the leg-spinner.\n\nOff-spinner Bracewell made it 44-5 when he took a well judged caught-and-bowled off Burls miscued hit before Munyonga (40 in 30) and Tashinga Musekiwa (21) resisted with a 51-run partnership.\n\nSodhi returned in the 14th over and picked up his 150th T20 wicket when Munyonga holed out at long-off.\n\nNew Zealands pace then finished off the tail in quick succession with Matt Henry taking 2-34.\n\nWe keep digging ourselves a hole and when we try to climb out of it, we dont, Zimbabwe captain Sikandar Raza said.\n\nThe catches we dropped hurt us. As much as we wanted to be upbeat, it took us a bit of time to get into the game. One of the things I will speak (to players) is that it is never a dead rubber for Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/24174619/New-Zealand-beat-Zimbabwe-by-60-runs-2025-07-bc44d44ba5b5c501fb174f5db6ea2d06-16x9-1.webp",
            "description": "<p>AP New Zealand stayed perfect at the T20 tri-series with a crushing 60-run win over host Zimbabwe on Thursday. Tim Seifert (75) smashed his second successive half century and Rachin Ravindra made an entertaining 63 runs off 39 balls as New Zealand posted the tournament’s highest total of 190-6 with its fourth straight win of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-zealand-crushes-zimbabwe-by-60-runs-to-keep-perfect-record-at-t20-tri-series/\">New Zealand crushes Zimbabwe by 60 runs to keep perfect record at T20 tri-series</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        },
        {
            "title": "Ukrainian political analyst suggests Zimbabwe, South Africa play mediatory role to end war with Russia",
            "url": "https://www.newzimbabwe.com/ukrainian-political-analyst-suggests-zimbabwe-south-africa-play-mediatory-role-to-end-war-with-russia/",
            "content": "By Leopold Munhende\n\nUKRAINIAN political analyst and journalist Peter Zalmayev has suggested that Zimbabwe and neighbouring South Africa present themselves as mediators to end the war between his country and superpower Russia.\n\nZalmayev, who is on a global tour to highlight implications of the war on Ukraine and other smaller countries, was recently in Zimbabwe, having already visited South Africa, eSwatini, Lesotho and some Pacific states.\n\nNamed the Russo-Ukrainian War, the ongoing crisis began in February 2014 when Russia annexed Crimea from Ukraine.\n\nThe war escalated in 2022 when Russia launched a full-scale invasion of its smaller neighbouring country, leading to hundreds of thousands of deaths and a massive refugee crisis.\n\nSpeaking to this publication in an exclusive interview, Zalmayev said the fact that Russia and Zimbabwe shared a lot of history and that President Emmerson Mnangagwa is assured of an ear in Moscow puts the country in an important position to help end the war.\n\nRussia actively took part in the training, clothing and arming of liberation movements in Zimbabwes fight for independence.\n\nSouth Africa, according to Zalmayev, offers another angle to potential mediation by virtue of being part of the BRICS union. BRICS, an acronym for Brazil, Russia, India, China and South Africa, is an amalgamation of emerging markets.\n\nIt is these ties which make Zimbabwe and South Africa, which is in BRICS with Russia, very important interlocutors, said Zalmayev.\n\nHarare is on speaking terms with Moscow and my position is that it is best placed to reach out to Ukraine as well and suggest itself as a potential platform for negotiations to end the war.\n\nZimbabwe had been purchasing grain in Ukraine before the war broke out. Zimbabweans are also, in a way, feeling the effects of this war.\n\nIn 2022, South African President Cyril Ramaphosa led a nine-member Africa Union (AU) delegation to Moscow and Kyiv to understand and help mediate. Although they were received by both Russian President Vladimir Putin and Ukraines Volodymyr Zelenskyy, the war continued.\n\nA study by the World Bank, United Nations (UN) and European Union (EU) earlier this year predicted that US$542 billion is needed to reconstruct Ukraine in the next ten years following Russias intensive bombardments in the past three years.\n\nAdded Zalmayev: No one wins in this war. It violates the basic UN principle of sovereignty and infallibility of borders. It is in the interest of smaller countries that Ukraine is allowed to continue existing as an independent state.\n\nIf it falls, it will create a huge precedent wherein bigger countries can walk over and take over the smaller ones.\n\nBefore the escalation of the conflict, Ukraine was one of Zimbabwe and other countries in the regions main sources of wheat and alternative grain imports.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/26191653/Zimbabwe-President-Emmerson-Mnangagwa-with-the-Russian-President-Vladimir-Putin.jpg",
            "description": "<p>By Leopold Munhende UKRAINIAN political analyst and journalist Peter Zalmayev has suggested that Zimbabwe and neighbouring South Africa present themselves as mediators to end the war between his country and superpower Russia. Zalmayev, who is on a global tour to highlight implications of the war on Ukraine and other smaller countries, was recently in Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ukrainian-political-analyst-suggests-zimbabwe-south-africa-play-mediatory-role-to-end-war-with-russia/\">Ukrainian political analyst suggests Zimbabwe, South Africa play mediatory role to end war with Russia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        },
        {
            "title": "Zimbabwe says informal sector dominates 76% of the economy",
            "url": "https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/",
            "content": "Bloomberg\n\nZimbabweestimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census.\n\nWhile the high level of informalization has increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance with the formal tax system, the Zimbabwe National Statistics Agency said in a report released in the capital, Harare, on Wednesday.\n\nGrowing informalization is a critical risk to the economy as less than one quarter of formal businesses carry the tax burden, according to the Confederation of Zimbabwe Industries, the nations largest industry body.\n\nFormal businesses are being squeezed, MacDonald Mutengo, CZIs lead research officer, said at the event. Companies are not making profits, they are highly regulated.\n\nThe informal sector has flourished as formal jobs evaporated due to decades of economic mismanagement that led to repeated currency collapses and bouts of hyperinflation.\n\nThe census surveyed 204,798 businesses across a range of sectors, including financial services and construction. The wholesale and retail trade sector accounted for most economic activity, contributing 73%, followed by manufacturing at 8%.\n\nBulawayo province had the highest concentration of formal businesses at 40%, compared with less than 30% in other regions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181244/Vendors-4.jpg",
            "description": "<p>Bloomberg Zimbabwe estimates that more than three-quarters of economic activity takes place in the informal sector, depriving the government of much-needed tax revenue, according to the findings of its first economic census. While the high level of informalization has “increasingly become a significant source of livelihoods, its contribution to government revenue remains minimal due to non-compliance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-says-informal-sector-dominates-76-of-the-economy/\">Zimbabwe says informal sector dominates 76% of the economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        },
        {
            "title": "Zimbabwe hosts COP15 as leaders eye Victoria Falls wetlands pact",
            "url": "https://www.newzimbabwe.com/zimbabwe-hosts-cop15-as-leaders-eye-victoria-falls-wetlands-pact/",
            "content": "APA News\n\nThe 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands kicked off in Zimbabwes Victoria Falls resort town on Wednesday, drawing delegates from 172 countries.\n\nRunning from 2331 July, COP15 is themed Protecting Wetlands for Our Common Future and is expected to culminate in the adoption of the Victoria Falls Declaration  a landmark commitment to scale up wetland restoration and establish a Global Wetland Restoration Fund.\n\nSpeaking ahead of the meeting on Tuesday night, Zimbabwes Minister of Environment, Climate and Wildlife Evelyn Ndlovu underscored the urgency of action.\n\nWetland conservation is not just an environmental concern, it is a climate imperative, a hydrological necessity and a development obligation, Ndlovu said.\n\nShe said key initiatives to be launched at COP15 include the Global Wetland Watch platform for real-time monitoring and the African Wetland Observatory Network to support grassroots solutions, as well as the integration of wetlands into national climate and biodiversity frameworks, including Wetland City Accreditation.\n\nConvention on Wetlands Secretary General Musonda Mumba described the moment as historic, marking the second time that the meeting has been hosted on African soil.\n\nThis is not just a meeting of governments  its a platform for science, diplomacy, and community to come together around a common goal: protecting wetlands for our common future, she said.\n\nThe Ramsar Convention, signed in 1971 in Iran, is the worlds only international treaty focused exclusively on wetlands.\n\nIt promotes the wise use of wetlands and has designated over 2,500 Ramsar sites globally.\n\nZimbabwe ratified the convention in 2012 and currently hosts seven Ramsar sites, including Lake Chivero, Mana Pools and Monavale Vlei.\n\nAccording to the Convention Secretariat, the world has lost over 411 million hectares of natural wetlands since 1970, with a financing gap of up to $550 billion threatening restoration efforts.\n\nPresident Emmerson Mnangagwa is expected to formally open the summit later this week.\n\nDelegates will also tour the Kasibo Wetland in Hwange, showcasing Zimbabwes nature-based restoration efforts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201538/Wetlands-COP15-meeting-in-Zimbabwe.jpeg",
            "description": "<p>APA News The 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands kicked off in Zimbabwe’s Victoria Falls resort town on Wednesday, drawing delegates from 172 countries. Running from 23–31 July, COP15 is themed “Protecting Wetlands for Our Common Future” and is expected to culminate in the adoption</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hosts-cop15-as-leaders-eye-victoria-falls-wetlands-pact/\">Zimbabwe hosts COP15 as leaders eye Victoria Falls wetlands pact</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        },
        {
            "title": "Supreme court enforces UK divorce order in case involving former Anglican bishop",
            "url": "https://www.newzimbabwe.com/supreme-court-enforces-uk-divorce-order-in-case-involving-former-anglican-bishop/",
            "content": "Anglican Ink\n\nZimbabwes Supreme Court has upheld the enforcement of a United Kingdom divorce order involving the former Bishop of Manicaland, the Rt. Rev. Julius Makoniaffirming the authority of English court rulings over matrimonial property under Zimbabwean law.\n\nBishop Makoni, a former investment banker who became a leading figure in Zimbabwes Anglican hierarchy, resigned his post in 2015 to take a position with the International Monetary Fund. A decade later, he has found himself embroiled in a transnational legal dispute with his ex-wife, Pauline Mutsa Makoni, over matrimonial property in London and Harare.\n\nBishop Makoni, who served as the Diocesan bishop of Manicaland from 2009 to 2015, was one of the key figures in the restoration of the Anglican Diocese in the wake of the contentious Nolbert Kunonga schism. His years as bishop were marked by efforts to rebuild the spiritual and administrative health of a diocese ravaged by ecclesiastical division and state interference.\n\nBut his personal life made headlines after he and his wife divorced in the UK, where they had legal residency. The English High Court finalized their divorce in December 2014 and awarded Mrs. Makoni substantial financial compensation, including the couples marital home in Harare.\n\nWhen Mrs. Makoni sought to have the English orders recognized and enforced in Zimbabwe, Bishop Makoni objectedarguing that the UK ruling was inconsistent with Zimbabwes laws and public policy, particularly when it came to property distribution. He contended that Zimbabwean courts should not recognize foreign judgments that conferred domestic property to a foreign-domiciled spouse.\n\nBut in a landmark decision handed down last week, Zimbabwes Supreme Court dismissed Bishop Makonis objections. The bench held that foreign divorce judgmentsespecially those issued by superior courts in jurisdictions such as the UKare enforceable in Zimbabwe, provided due process was followed and the ruling does not offend local public policy.\n\nThe ruling clarified that even where Zimbabwean courts may have ruled differently in terms of asset division, they are bound by the principle of international comity and legal reciprocity to acknowledge the authority of foreign courtsparticularly where both parties were properly represented.\n\nThis decision sets a precedent in Zimbabwean jurisprudence, specifically regarding cross-border matrimonial disputes, at a time when an increasing number of Zimbabweans reside or hold assets abroad but maintain ties to their home country.\n\nThe case carries allegorical weight for the Zimbabwean church. Just as provinces throughout the Global South have historically resisted directives from England on matters of doctrine, the question posed before Zimbabwes courts was whether English authority could shape realities on Zimbabwean soil.\n\nIronically, the courts decision stands in contrast with the ecclesiastical trend: while Zimbabwean bishops and church bodies have increasingly asserted independence from Canterbury in matters of theology and liturgy, here the state court has chosen deference to English legal authority.\n\nThe case also raises difficult questions for Church leaders involved in civil litigationparticularly when it relates to personal conduct and stewardship of property. While clergy and bishops are often held to high standards within the Churchs pastoral framework, many also own assets or reside across multiple jurisdictions. More importantly, it sends a message to Church leaders, lay or ordained, that positions of ecclesiastical authority do not confer immunity in the courts of law.\n\nThe juxtaposition of Bishop Makonis spiritual authority and his civil defeat may be uncomfortable for some within the Anglican establishment. For others, it demonstrates the maturing of Zimbabwes judiciaryholding sacred and secular spheres in check while respecting the rule of law across borders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23201402/Julius-Makoni-2015.jpeg",
            "description": "<p>Anglican Ink Zimbabwe’s Supreme Court has upheld the enforcement of a United Kingdom divorce order involving the former Bishop of Manicaland, the Rt. Rev. Julius Makoni—affirming the authority of English court rulings over matrimonial property under Zimbabwean law. Bishop Makoni, a former investment banker who became a leading figure in Zimbabwe’s Anglican hierarchy, resigned his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/supreme-court-enforces-uk-divorce-order-in-case-involving-former-anglican-bishop/\">Supreme court enforces UK divorce order in case involving former Anglican bishop</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        },
        {
            "title": "Tel One beats log leaders Simba Bhora, as FC Platinum close gap",
            "url": "https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/",
            "content": "By Sports Reporter\n\nSimba Bhoras ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium.\n\nThe Wifi Boys two goals came in the second half through Milton Chimedza and Washington Navaya.\n\nSo important was the win for Tel One that it reduced the gap between them and Simba Bhora to 6 points.\n\nTel One is now sitting in position 5 on the log with 37 points, the same as third and fourth place occupiers FC Platinum and Scottland, respectively.\n\nSimba Bhora, however, maintained top spot as second-place occupiers MWOS played a 1-1 at Nyamhunga against ZPC Kariba.\n\nMWOS is now two points behind Simba with 41 points, with 13 games to go.\n\nElsewhere at Mandava Stadium, FC Platinum maintained its unbeaten run with a 2-1 win over bottom-placed Kwekwe United.\n\nThe win was a big boost for FC Platinum, who leapfrogged two teams to go to number 3 with 37 points.\n\nPure Platinum Play remains the only team yet to be beaten this season; at the same time, they have a game in hand against Manica Diamonds.\n\nPSL Wednesday Results\n\nFull-time:\n\nNgezi Platinum 1-0 CAPS United\n\nTelOne 2-0 Simba Bhora\n\nZPC Kariba 1-1 MWOS\n\nFC Platinum 2-1 Kwekwe United\n\nYadah 1-1 Greenfuel\n\nHerentals 1-0 Chicken Inn\n\nThursday Fixture\n\nDynamos vs Manica Diamonds (Rufaro)\n\nBikita Minerals 7 (Gibbo Stadium)\n\nHighlanders vs. Triangle (Barbourfields)\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23195657/telone-fc.jpg",
            "description": "<p>By Sports Reporter Simba Bhora’s ten-match unbeaten run came to an end on Wednesday after they were handed a 2-0 defeat by Tel One at Ascot Stadium. The Wifi Boys’ two goals came in the second half through Milton Chimedza and Washington Navaya. So important was the win for Tel One that it reduced the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tel-one-beats-log-leaders-simba-bhora-as-fc-platinum-close-gap/\">Tel One beats log leaders Simba Bhora, as FC Platinum close gap</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        },
        {
            "title": "This celebrity lifestyle kills you – Andy Muridzo announces retirement from music",
            "url": "https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/",
            "content": "By Tapiwa Svondo\n\nCONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album Chakanyuka, citing that the pressures of being a celebrity were taking a toll on him.\n\nChakanyuka will mark the end of Muridzos music career, which has spanned just over a decade and seen him become a household name with hits like Dherira and Chidhafudhunda.\n\nMuridzo took to Facebook, revealing that he felt music was not his true purpose.\n\nIm writing to inform you the family of Muridzo that CHAKANYUKA will be my last album. I never wanted to take music as my career, but one person I believe in most gave me the courage to move forward with my God given talent.\n\nI will forever love my fans and family, but after this forthcoming album, I will no longer take music as my career again: rather as using my talent and fame to journey into my true purpose, which is healing people spiritually.\n\nIm tired of this celebrity lifestyle; It kills you within. I tried being brave while being insulted by everyone, including people you call your own, he wrote.\n\nBaba Keketso who is not new to controversy, has once in a while, found himself receiving backlash for his love scandals.\n\nI sing from the bottom of my heart just to make you happy and well entertained, but when I try Im insulted and given names which dont suit me.\n\nI know a lot of my fans will not be happy to hear this, but I am tired of trying to prove myself to a nation that never appreciates.\n\nI love music with my life, but here I have become small. I will sing for my kids at home after this album. I think this is not what I was born to do. God help me locate my true purpose, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/23185732/andy.jpg",
            "description": "<p>By Tapiwa Svondo CONTEMPORARY musician Andy Muridzo has announced he will step away from the music scene after the release of his forthcoming album ‘Chakanyuka’, citing that the pressures of being a “celebrity” were taking a toll on him. ‘Chakanyuka’ will mark the end of Muridzo’s music career, which has spanned just over a decade</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/this-celebrity-lifestyle-kills-you-andy-muridzo-announces-retirement-from-music/\">This celebrity lifestyle kills you – Andy Muridzo announces retirement from music </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:48",
            "date": "24 Jul 2025"
        }
    ]
}