{
    "news": [
        {
            "title": "Zim Diaspora Property Showcase USA-Canada: CBZ to unpack Zimbabwe’s economic message",
            "url": "https://www.newzimbabwe.com/zim-diaspora-property-showcase-usa-canada-cbz-to-unpack-zimbabwes-economic-message/",
            "content": "By Alois Vinga\n\nCBZ Holdings Limited CEO Lawrence Nyazema will speak on Zimbabwes low-hanging opportunities at the Zim Diaspora Property Showcase USA-Canada.\n\nThe renowned banker is scheduled to address the prestigious property showcase organised by Seeff Zimbabwe. The event will run from the 25thto the 27thof April at The Westin Hotel, Dallas-Fort Worth.\n\nSpeaking to NewZimbabwe.com ahead of the event, Nyazema said it is important for the diaspora community to appreciate that the multi-currency system will be maintained until 2030.\n\nThis approach provides clarity and fosters favourable investment decisions. Notably, the tight Monetary Policy stance by the Reserve Bank of Zimbabwe (RBZ) contains interventions aimed at establishing price stability and improving the efficiency of foreign exchange markets. This includes the launch of the new currency, ZWG, in April 2025 leading to a strategic reduction in money supply growth, and a focus on strengthening foreign currency reserves, he said.\n\nNyazema said property-wise, CBZH is providing services throughout the real estate value chain under the Public Private Partnerships (PPPs), where they are directly participating in the creation of housing stock for sale.\n\nThe institution is currently implementing projects like the Northgate in Harare, Athelney in Ruwa and Gateway City in Mutare, currently on sale, backed by US$ denominated mortgages for property purchase, building finance and property.\n\nThe top banker added that CBZ Holdings has since established a dedicated unit within our organization focused exclusively on serving the diaspora market, staffed with a committed team of relationship managers ready to extend support round the clock.\n\nIndeed, our journey commenced last year in the UK, serving as a significant eye-opener and unlocking numerous opportunities. The USA trip represents a strategic initiative in our efforts to expand our presence and engage with the global market.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27051258/lawrence-cbz.jpg",
            "description": "<p>By Alois Vinga CBZ Holdings Limited CEO Lawrence Nyazema will speak on Zimbabwe’s low-hanging opportunities at the Zim Diaspora Property Showcase USA-Canada. The renowned banker is scheduled to address the prestigious property showcase organised by Seeff Zimbabwe. The event will run from the 25th to the 27th of April at The Westin Hotel, Dallas-Fort Worth. Speaking</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-diaspora-property-showcase-usa-canada-cbz-to-unpack-zimbabwes-economic-message/\">Zim Diaspora Property Showcase USA-Canada: CBZ to unpack Zimbabwe’s economic message</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Elderly couple jailed for stealing US$34,000 wrongly deposited by Stanbic Bank",
            "url": "https://www.newzimbabwe.com/elderly-couple-jailed-for-stealing-us34000-wrongly-deposited-by-stanbic-bank/",
            "content": "By Staff Reporter\n\nAN elderly Bulawayo couple has been convicted of stealing US$34,000 from Stanbic Bank.\n\nThe pair of Francisca and Frank Sibanda, both aged 65, appeared at Tregold Regional Magistrates Court facing theft charges.\n\nThe offence emanated from an erroneous deposit by the bank made into Franciscas account following a failed Point of Sale (POS) transaction.\n\nThe court heard that after realising that there was manna from heaven in the bank account, Francisca and her husband connived to withdraw various amounts of cash and made purchases both in Zimbabwe and South Africa, knowing they were not entitled to the money.\n\nAfter a full trial, the elderly duo was found guilty of theft.\n\nThe presiding magistrate handed down a seven-year jail term, with four years suspended on condition of good behaviour. The remaining three years will also be set aside on condition that the convicts restitute the bank the full amount of US$34,000 they stole by June 30, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/01083946/stanbic-2-e1630481998544.jpg",
            "description": "<p>By Staff Reporter AN elderly Bulawayo couple has been convicted of stealing US$34,000 from Stanbic Bank. The pair of Francisca and Frank Sibanda, both aged 65, appeared at Tregold Regional Magistrates Court facing theft charges. The offence emanated from an erroneous deposit by the bank made into Francisca’s account following a failed Point of Sale</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elderly-couple-jailed-for-stealing-us34000-wrongly-deposited-by-stanbic-bank/\">Elderly couple jailed for stealing US$34,000 wrongly deposited by Stanbic Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Nigerian fan’s epic meltdown as Super Eagles drop crucial World Cup qualifying points in match against Zimbabwe",
            "url": "https://www.newzimbabwe.com/nigerian-fans-epic-meltdown-as-super-eagles-drop-crucial-world-cup-qualifying-points-in-match-against-zimbabwe/",
            "content": "IOL\n\nA Nigerian fan has ripped into the Super Eagles after they were held 1-1 by Zimbabwe in Tuesday nightsWorld Cup qualifierin Uyo.\n\nNigeria went into the game hoping to keep up withGroup C leaders South Africa, and looked like they were on their way to bagging the three points when star striker Victor Osimhen put them 1-0 up with 15 minutes left on the clock.\n\nHowever, Tawanda Chirewa of Wolverhampton Wanderers popped up with a stoppage time equaliser to strike a blow to the home teams World Cup hopes, breaking the hearts of Nigerians everywhere.\n\nTo make matters worse,South Africa beat Benin 2-0in Abidjan to extend their lead at the top of Group C to five points.\n\nThe result was not taken well by one irate Nigerian fan, who tore into his team for what he perceived as a for their lack of effort against a Zimbabwe side that has very little to play for during the qualifiers.\n\nThis stadium was packed. This stadium was singing. This stadium was full to the brim, and all they asked from the players was 90 minutes of passion and dedication. 90 minutes of being locked in. 90 minutes of fighting for the badge, and they did it for only 80 minutes, the angry supporter said on the Football Fans Tribe YouTube page.\n\nIt was a loss of concentration. They lost concentration and the motivation to attack. You praise the coach when the tactics work, and you have to blame him when they dont work, he carried on, taking issue with new coach Eric Chelle selecting players out of position.\n\nWATCH | An angry Nigerian man claims that Zimbabwes Warriors have nothing to play for. He made this remark after Zimbabwes draw with Nigeria in the FIFA World Cup qualifiers.pic.twitter.com/Gp2bQWkhAo\n\nWhy dont you play the fullbacks in their natural positions so they can give the strikers the crosses that they need, not forcing [Ola] Aina to cross with his left foot. The left side was the only side that we could have used, but out wingers let us down.\n\nHe carried on: I feel bad for Osimhen. I feel bad for [Calvin] Bassey. I feel back for [Wilfred] Ndidi. I feel bad for [William] Troost-Ekong. I feel bad for [Stanley] Nwabali because they dont deserve this result.\n\nThey worked their a** off. They put the passion, blood, sweat and tears into this team, but yet, some other people just have to get onto their private jets go to their individual clubs and collect their money If they dont qualify for the World Cup, who will pay more? Is it the fans or it it them because the fans are doing their part and the players are not.\n\nWe asked the fans to come fill up the stadium and they did. We asked them to shout and sing, and they did. All we asked [from them] is a win. And were not asking for it against hard competition. This is frikkin Zimbabwe. They are not qualifying for the World Cup. They are not playing for anything. You are paying for everything. Where was that spirit?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27045346/Striker-Victor-Osimhen-and-head-ccoach-Eric-Chelle-embrace-after-their-World-Cup-qualifier-against-Zimbabwe-ended-in-a-1-1-draw-on-Tuesday-evening-Photo-Justin-Aniefiok-BackpagePix.webp",
            "description": "<p>IOL A Nigerian fan has ripped into the Super Eagles after they were held 1-1 by Zimbabwe in Tuesday night’s World Cup qualifier in Uyo. Nigeria went into the game hoping to keep up with Group C leaders South Africa, and looked like they were on their way to bagging the three points when star striker Victor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nigerian-fans-epic-meltdown-as-super-eagles-drop-crucial-world-cup-qualifying-points-in-match-against-zimbabwe/\">Nigerian fan’s epic meltdown as Super Eagles drop crucial World Cup qualifying points in match against Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Harare police issue two-month-long prohibition order on carrying weapons into CBD ahead of planned protests",
            "url": "https://www.newzimbabwe.com/harare-police-issue-two-month-long-prohibition-order-on-carrying-weapons-into-cbd-ahead-of-planned-protests/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Republic Polices (ZRP) Officer Commanding Harare district, Chief Superintendent Michael Masvivi, has from today, imposed a two-month prohibition order against the carrying of any possible weapons, just three days before planned national protests.\n\nLed by war veteran Blessed Bombshell Geza, the protests have been set for March 31.\n\nTheir primary purpose is to force the ouster of President Emmerson Mnangagwa, who is being accused of engaging with and harbouring a string of corrupt individuals who have not only captured the state but also been milking it dry.\n\nMasvivi specifically highlights that any items capable of use as weapons, catapults, machetes, knobkerries, axes, swords, knives or daggers can no longer be carried, whether publicly or concealed, and they can also not be displayed.\n\nAny traditional weapons whatsoever likely to occasion public disorder or a breach of the peace, (I) hereby issue an order prohibiting the carrying of such weapons in Harare District or any part thereof for a period not exceeding two months, that is from March 27, to May 31, reads Masvivis statement.\n\nMasvivi claims his decision is based on Section 13 of the Maintenance of Peace and Order Act (MOPA) which he further asserts sets six months  imprisonment or a fine as punishment for breaching the order, which it does not.\n\nState security forces, including the police and Central Intelligence Organisation (CIO) have been put on high alert ahead of the planned demonstrations.\n\nDespite the absence of any sure sign that Zimbabweans will heed Gezas call to cut short Mnangagwas presidential term, the countrys poverty levels, uncontrolled corruption, little to no investment in the poor masses health sector and extravagance by those close to the President are all factors that are fast angering millions.\n\nFactional fights between Mnangagwa and his deputy Constantino Chiwenga have also unsettled Zanu PF ahead of the protest, considering the two led an almost similar exercise to topple then President Robert Mugabe in 2017.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/26025851/Man-holding-machete.jpg",
            "description": "<p>By Staff Reporter THE Zimbabwe Republic Police’s (ZRP) Officer Commanding Harare district, Chief Superintendent Michael Masvivi, has from today, imposed a two-month prohibition order against the carrying of any possible weapons, just three days before planned national protests. Led by war veteran Blessed ‘Bombshell’ Geza, the protests have been set for March 31. Their primary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-police-issue-two-month-long-prohibition-order-on-carrying-weapons-into-cbd-ahead-of-planned-protests/\">Harare police issue two-month-long prohibition order on carrying weapons into CBD ahead of planned protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Onismor Bhasera reunites with SuperSport",
            "url": "https://www.newzimbabwe.com/onismor-bhasera-reunites-with-supersport/",
            "content": "By Sports Reporter\n\nFormer Warriors defender Onismor Bhasera has bounced back at SuperSport United as a coach.\n\nBhasera joins Andre Arendse and Grant Johnsons technical team, which is going to lead the side on an interim basis.\n\nThe new technical team replaces outgoing coach Gavin Hunt, who parted ways with the club last week.\n\nOnismor Bhasera returns to help guide the team forward as part of Andre Arendse and Grant Johnsons technical team.\n\nWelcome back, Bash! Your experience and passion for the game will be key for the road ahead, SuperSport United announced Bhaseras return.\n\nAged 39, Bhasera had a nine-year stint at SuperSport from 2016 before he retired last year.\n\nSuperSport United is currently second from bottom in the Betway Premiership, and they face serious relegation threats.\n\nThe new interim teamstask is to help the side survive the relegation chop this season.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/30025457/Onismor-Bhasera.png",
            "description": "<p>By Sports Reporter Former Warriors defender Onismor Bhasera has bounced back at SuperSport United as a coach. Bhasera joins Andre Arendse and Grant Johnson’s technical team, which is going to lead the side on an interim basis. The new technical team replaces outgoing coach Gavin Hunt, who parted ways with the club last week. “Onismor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/onismor-bhasera-reunites-with-supersport/\">Onismor Bhasera reunites with SuperSport </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Councillors fume over City of Harare’s decision to lease Rufaro Stadium to Scottland FC",
            "url": "https://www.newzimbabwe.com/councillors-fume-over-city-of-harares-decision-to-lease-rufaro-stadium-to-scottland-fc/",
            "content": "By Sports Reporter\n\nCouncillors have opposed the City of Harares plans to enter into a lease agreement with Scottland FC over Rufaro stadium, citing that a similar arrangement with the same club at Mabvuku ground had yielded no results.\n\nThe deal was a topical issue on Tuesday during the Ordinary Council meeting held at the Town House.\n\nScottland Football Club has pledged to further improve the state of Rufaro Stadium and will enter into a lease agreement with the City of Harare Mayor Jacob Mafume.\n\nScottland says together with their partners, they will make sure Rufaro Stadium is upgraded to international standards before the end of the year.\n\nHowever, this was not welcomed by several councillors who challenged City of Harare on why they wanted to have a lease agreement with Scottland ahead of other cooperates who have knocked on the door for the same deal.\n\nAlready, the City of Harare has loaned the Number 1 ground in Mabvuku to Scottland who agreed to renovate it, but nothing much has been done on the dilapidated facility.\n\nCouncillors questioned why Scottland is being given another deal despite failing to deliver in Mabvuku.\n\nYou leased Mabvuku ground to Scottland, but till today nothing has happened at the facility as we are yet to have a league match being played at the facility.\n\nSo I suggest that we should not give Rufaro stadium to the same partner which has failed a small number 1 ground in Mabvuku, said Ward 16 councillor Denford Ngadziore.\n\nRufaro Stadiums renovations are yet to meet international standards.\n\nCouncillor Costa Mhande said Scottland FC should be leased one of the other dilapidated stadiums in Harare, not Rufaro Stadium.\n\nAs for Rufaro stadium case, I advise that the council should come up with what it wants the stadium to be like, then advertise a tender on who can partner openly.\n\nWe cant just wake up and have Scottland as the only partner, if that is the case they can go and work on other stadiums like Dzivarasekwa and Gwanzura. Why do they want to partner on this facility, which is almost complete? he said.\n\nIn 2022, giant energy company Sakunda Holdings approached council with an offer to have a lease agreement on the facility, but was turned down.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/18055321/Mafume-Mayor.jpeg",
            "description": "<p>By Sports Reporter Councillors have opposed the City of Harare’s plans to enter into a lease agreement with Scottland FC over Rufaro stadium, citing that a similar arrangement with the same club at Mabvuku ground had yielded no results. The deal was a topical issue on Tuesday during the Ordinary Council meeting held at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/councillors-fume-over-city-of-harares-decision-to-lease-rufaro-stadium-to-scottland-fc/\">Councillors fume over City of Harare’s decision to lease Rufaro Stadium to Scottland FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Mnangagwa sweats over March 31 protests amid internal ZANU PF revolt",
            "url": "https://www.newzimbabwe.com/mnangagwa-sweats-over-march-31-protests-amid-internal-zanu-pf-revolt/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa is under pressure over the planned 31 March protests amid fresh challenges to his rule, which has been marred by accusations of corruption and cronyism.\n\nZANU-PF is heading for an internal implosion, with disgruntled war veterans leading calls for Mnangagwas resignation.\n\nAxed ZANU-PF Central Committee member Blessed Geza, who is reportedly fronting a bid for the countrys leadership to be taken over by Mnangagwas deputy, Constantino Chiwenga, has publicly called for nationwide protests on 31 March.\n\nAddressing the Politburo Wednesday, Mnangagwa pleaded with Zimbabweans not to heed the calls for protests.\n\nI applaud all my fellow citizens from across the country, for their clarity, national consciousness and patriotism that continue to squash efforts by malcontents and rogue delusional elements bent on disturbing our peace, unity and harmony.\n\nOur motherland, Zimbabwe, will forever be a Constitutional democratic and sovereign nation, with all of us living in unity, peace and harmony. Vano ukura, vanoramba vachiukura, nyika ichienda mberi. ZANU PF is an unstoppable train. ZANU PF chitima chirikufamba. MuZANU PF tinotevera gwara remusangano, nguva dzose, mangwanani, masikati nemanheru, said Mnangagwa.\n\nZANU-PF is reportedly divided between a faction supporting President Mnangagwas bid to retain power beyond the constitutionally stipulated two terms and another faction backing Chiwenga.\n\nGeza, who is in hiding, last week acknowledged Chiwengas leadership as the Commander, revealing the war veterans preferred candidate to replace Mnangagwa should the plot to oust him succeed.\n\nPresident Mnangagwa further asserted that ZANU-PF remains strong, urging the partys leadership to remain vigilant.\n\nOur Party Constitution is sacred, it is like roots and the trunk of a tree, and we, the members, are its branches. As with any other revolution, those who do not toe the correct line of the revolution must fall by the wayside.\n\nZANU PF must be first responders to the challenges facing our people and communities. I challenge all Party members to walk alongside our people and always seek to respond to their needs.\n\nIn seamless coordination, structures of our Party, right from the Cell level, District, Province up to the Central Committee and Politburo, must provide honest leadership and guidance, with refocus on matters that affect the livelihoods of our people, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/15180901/ED.jpg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa is under pressure over the planned 31 March protests amid fresh challenges to his rule, which has been marred by accusations of corruption and cronyism. ZANU-PF is heading for an internal implosion, with disgruntled war veterans leading calls for Mnangagwa’s resignation. Axed ZANU-PF Central Committee member Blessed Geza, who</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-sweats-over-march-31-protests-amid-internal-zanu-pf-revolt/\">Mnangagwa sweats over March 31 protests amid internal ZANU PF revolt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Govt denies ordering mandatory civic days to fund Independence celebrations, says action will be taken against official who issued directive",
            "url": "https://www.newzimbabwe.com/govt-denies-ordering-mandatory-civic-days-to-fund-independence-celebrations-says-action-will-be-taken-against-official-who-issued-directive/",
            "content": "By Staff Reporter\n\nTHE government has distanced itself from a directive orderingschools in Gweru district to observe mandatory civic days to raise funds for Independence Day celebrations.\n\nThis follows a letter that went viral on Tuesday, instructing all schools in Gweru district to hold civic days to raise funds for purchasing regalia, food, fuel, and covering other unforeseen costs atthe Independence commemorations in Gokwe, Nembudziya, next month.\n\nThe letter was addressed to the Provincial Education Director from the Ministry of Primary and Secondary Education Gweru District Schools InspectorMahlokozera.\n\nIn a statement Wednesday, the Ministry of Primary and Secondary Education denied issuing the directive addingthat it had launched an immediate inquiry into the matter, pledging disciplinary action against those responsible for the unauthorized instruction.\n\nThe Ministry has initiated an immediate inquiry into the matter.\n\nThe official responsible for the directive will be required to provide a full explanation for their actions, which contravene established protocols.\n\nDisciplinary measures will be taken as appropriate, the statement read.\n\nThe Ministry also said that the government has already allocated sufficient funds for the celebrations and that no financial contributions are required from schools or parents.\n\nAdditionally, it urged teachers and school heads to ignore the directive.\n\nThe Ministry has already secured adequate funding through the national budget for all Independence Day commemorations, including planned activities in Gokwe.\n\nThere is no requirement for schools, learners, parents, or community members to contribute financially to these events, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/13122654/torerai-moyo.jpg",
            "description": "<p>By Staff Reporter THE government has distanced itself from a directive ordering schools in Gweru district to observe mandatory civic days to raise funds for Independence Day celebrations. This follows a letter that went viral on Tuesday, instructing all schools in Gweru district to hold civic days to raise funds for purchasing regalia, food, fuel, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-denies-ordering-mandatory-civic-days-to-fund-independence-celebrations-says-action-will-be-taken-against-official-who-issued-directive/\">Govt denies ordering mandatory civic days to fund Independence celebrations, says action will be taken against official who issued directive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "Alluvial gold panner killed in crocodile attack",
            "url": "https://www.newzimbabwe.com/alluvial-gold-panner-killed-in-crocodile-attack/",
            "content": "By Staff Reporter\n\nAN artisanal miner was on Monday attacked by a crocodile while he was scavenging for gold along a riverbed.\n\nThe now deceased 22-year-old Enock Rukowa was severely injured by the giant reptile as his wife watched, and later died from injuries sustained in the attack.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera confirmed the incident.\n\nI confirm a sad and disturbing death of a 22-year-old man who was attacked by a crocodile along Musengi River, Chinhoyi on 24 March 2025 at around 1200 hours, said Kohwera.\n\nEnock Rukowa of Musengi farm was panning for gold along Musengi River with his wife Charity Tembo (19) when he was suddenly attacked by a crocodile.\n\nHe was dragged into the river and his wife called for help. Other villagers who were close by rushed to the scene and started attacking the crocodile with stones.\n\nThe crocodile later released the now deceased at the river bank alive. He had sustained several injuries on the right side of his chest and a broken left knee. Unfortunately, he passed on due to the injuries when villagers were trying to take him to the hospital.\n\nPolice urged the public living near water bodies infested with dangerous animals such as crocodiles to always take precautionary measures when conducting their day-to-day activities.\n\nSuch animals attack people unaware hence must be vigilant always, the police spokesman said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/13165408/crocodile.jpg",
            "description": "<p>By Staff Reporter AN artisanal miner was on Monday attacked by a crocodile while he was scavenging for gold along a riverbed. The now deceased 22-year-old Enock Rukowa was severely injured by the giant reptile as his wife watched, and later died from injuries sustained in the attack. Zimbabwe Republic Police (ZRP) Mashonaland West provincial</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/alluvial-gold-panner-killed-in-crocodile-attack/\">Alluvial gold panner killed in crocodile attack </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        },
        {
            "title": "DA’s Zille implores Zim opposition to unite against Zanu-PF",
            "url": "https://www.newzimbabwe.com/das-zille-implores-zim-opposition-to-unite-against-zanu-pf/",
            "content": "By Alois Vinga\n\nHELEN Zille, the federal chairperson of the Democratic Alliance (DA) in South Africa, has called on opposition leaders in Zimbabwe to unite and take advantage of the internal divisions in the ruling Zanu-PF party.\n\nShe made the remarks following a meeting with Zimbabwe People First chairperson, Stephen Mazanza, last week.\n\nShe reiterated that the current political landscape in Zimbabwe is toxic and does not reflect what the people voted for in terms of economic and political stability.\n\nZimbabwes political giants have failed the masses, and sooner rather than later, Zimbabweans need to put enough or necessary pressure on the government, either in the form of petitions, meetings, or demonstrations, so that the Zanu PF government yields to the peoples demands.\n\nThe central bank (Zimbabwe Reserve Bank) has failed to come up with sound policies to stabilise the economy and there might be a need to abandon both the US dollar, and the ZiG currencies and adopt the South African Rand whilst the RBZ is put under administration by the South African Federal Reserve until it can stand on its own, she said.\n\nZille said opposition leaders, including Nelson Chamisa, Elisabeth Valerio and Tendai Biti, among others must immediately sit down and form a grand coalition that will challenge the ruling party and set itself in motion to take over the power vacuum in case the infighting within Zanu PF self-destructs as widely predicted.\n\nShe underscored that there has been widespread and loud noises of a unity government from within diehard Zanu PF ranks, which again is a signal of instability within, but immediately urged the opposition parties to be very cautious.\n\nOn his part, Mazanza said the meeting with Zille was pivotal and driven by the urgent need to address the catastrophic situation facing Zimbabweans.\n\nHe said the engagement was not merely a discussion but aplea for solidarity against the systematic destructionofthe nation which he described as suffocating under the weight of suppression of freedom of expression, the silencing of dissenting voices is a hallmark of this regime, and rampant corruption and nepotism.\n\nState resources are being plundered for personal gain, enriching a select few while the masses suffer. Police brutality and political purges targeting opposition members and concerned citizens are rampant. Vital institutions are being hijacked by individuals to serve their interests, and undermining the foundations of our society, he said.\n\nThe opposition leader accused the governments policies of creating a stark divide, leaving the majority impoverished and the economy on a freefall, which has escalated citizens hardship.\n\nWe also discussed the internal instability in Zanu PF and its potential to further destabilise the country. We are preparing for all possible outcomes, and we are determined to ensure that any power vacuum is filled by a government that represents the will of the people, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/05055622/HELEN-ZILLE.jpeg",
            "description": "<p>By Alois Vinga HELEN Zille, the federal chairperson of the Democratic Alliance (DA) in South Africa, has called on opposition leaders in Zimbabwe to unite and take advantage of the internal divisions in the ruling Zanu-PF party. She made the remarks following a meeting with Zimbabwe People First chairperson, Stephen Mazanza, last week. She reiterated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/das-zille-implores-zim-opposition-to-unite-against-zanu-pf/\">DA’s Zille implores Zim opposition to unite against Zanu-PF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:42",
            "date": "27 Mar 2025"
        }
    ]
}