{
    "news": [
        {
            "title": "It would take a miracle for Chiwenga to stage a comeback – analyst says",
            "url": "https://www.newzimbabwe.com/it-would-take-a-miracle-for-chiwenga-to-stage-a-comeback-analyst-says/",
            "content": "By Darlington Gatsi\n\nA faction backing Vice President Constantino Chiwenga to succeed President Emmerson Mnangagwa when his constitutional term ends in 2028 has emerged from the just-ended Zanu PF National Peoples Conference nursing deep political wounds.\n\nThe conference opened with a tense Politburo meeting at the ruling partys headquarters, which marked the start of an intensified onslaught by Mnangagwas loyalists against Chiwengas camp.\n\nZanu PFs Secretary for Legal Affairs, Ziyambi Ziyambi, delivered a strongly worded response to Chiwenga, who had earlier expressed discontent over the alleged capture of the party by a clique of influential figures.\n\nZiyambis statement effectively drew battle lines within the ruling party, setting the tone for the Mutare conference, where delegates resolved to amend the constitution to extend Mnangagwas tenure, a major setback for Chiwengas succession ambitions.\n\nPolitical analyst Rejoice Ngwenya says it will take an extraordinary strategy for Chiwenga to recover from the political setback suffered at the just-ended Zanu PF conference.\n\nThe tragedy is that Chiwenga himself has not said he has any interest in succeeding Emmerson Mnangagwa. There are people talking on his behalf, the Bombshell Gezas, but Chiwenga has not publicly expressed interest in higher office.\n\nHowever, from experience, we know that during the turbulence at the end of Robert Mugabes rule, Mnangagwa never openly declared his ambitions to succeed Mugabe. He kept quiet and did most of his machinations behind the scenes.\n\nSo we might be hearing a lot of noise about the Chiwenga faction, but we do not know what is happening in the background. His silence says a lot because it would be unwise for him to speak openly about it now, whatever plans he may have. But from where I stand, given the mandate and legitimacy Mnangagwa enjoys within Zanu PF, it would take a miracle for Chiwenga to recover from this, said Ngwenya.\n\nZanu PF is reportedly preparing a constitutional amendment in Parliament to allow President Mnangagwa to remain in power beyond the 2028 elections.\n\nHowever, the ruling party faces major legal hurdles, including Section 91(2), which bars a president from seeking a third term, and Section 328(7), which prohibits an incumbent from benefiting from a constitutional amendment enacted during their tenure.\n\nA leaked dossier, allegedly authored by Chiwenga, claims that Zanu PF intends to smuggle a document titled Breaking Barriers Initiative (BBI) into Parliament to suspend elections and extend both the presidents and the legislatures terms.\n\nNgwenya, however, dismissed the documents credibility, which is said to be linked to self-imposed CCC Secretary General, Sengezo Tshabangu.\n\nBBI is moribund because it tinkers with the illusion that you can simply change the constitution to achieve anything. My assumption is that not everyone within Zanu PF supports this agenda.\n\nThey might not say it publicly, but its nave to assume that if this matter goes to Parliament, it would automatically pass. BBI is just an academic document, Ngwenya said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/26072826/Chiwenga-scaled.webp",
            "description": "<p>By Darlington Gatsi A faction backing Vice President Constantino Chiwenga to succeed President Emmerson Mnangagwa when his constitutional term ends in 2028 has emerged from the just-ended Zanu PF National People’s Conference nursing deep political wounds. The conference opened with a tense Politburo meeting at the ruling party’s headquarters, which marked the start of an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-would-take-a-miracle-for-chiwenga-to-stage-a-comeback-analyst-says/\">It would take a miracle for Chiwenga to stage a comeback – analyst says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "21 Oct 2025"
        },
        {
            "title": "Harare woman ordered to pay ex-husband US$600k divorce settlement",
            "url": "https://www.newzimbabwe.com/harare-woman-ordered-to-pay-ex-husband-us600k-divorce-settlement/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed an application by Abigail Makono seeking to stop the execution of a US$600,000 divorce settlement owed to her ex-husband, Charles Makono, ruling that her challenge was manifestly groundless and an abuse of court process.\n\nJustice Regis Dembure, in the October 16 judgment, ordered Abigail to pay legal costs on a higher practitionerclient scale, warning that the court will not tolerate anyone attempting to evade compliance with its orders.\n\nThe dispute arose after a consent order in April 2025 required Abigail to pay Charles US$600,000 in exchange for properties awarded to her in their divorce settlement. Instead of paying, she sought to have the writ of execution declared invalid, alleging that Charles had failed to sign property transfer documents.\n\nDembure rejected the claim, saying, A party that has failed to fulfil its own obligations in terms of the consent order cannot seek to enforce the obligations of the other party.\n\nThe court found that Charles had already complied by signing and delivering the necessary documents.\n\nAbigails lawyer, Chivhenge, later abandoned some arguments, conceding that claims about improper mixing of movable and immovable property were untenable.\n\nThere should be no debate at all, said the judge.\n\nA litigant who has defied an order of court cannot, in the same breath, seek the courts assistance to avoid paying.\n\nThe ruling reinforces the binding nature of court orders and signals a strong judicial stance against attempts to sidestep financial obligations in divorce settlements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/12181629/Divorce-image.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed an application by Abigail Makono seeking to stop the execution of a US$600,000 divorce settlement owed to her ex-husband, Charles Makono, ruling that her challenge was “manifestly groundless” and an abuse of court process. Justice Regis Dembure, in the October 16 judgment, ordered Abigail to pay legal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-woman-ordered-to-pay-ex-husband-us600k-divorce-settlement/\">Harare woman ordered to pay ex-husband US$600k divorce settlement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "21 Oct 2025"
        },
        {
            "title": "Namibia declares Mpox outbreak following confirmed case in Swakopmund",
            "url": "https://www.newzimbabwe.com/namibia-declares-mpox-outbreak-following-confirmed-case-in-swakopmund/",
            "content": "IOL\n\nThe Ministry of Health and Social Services (MoHSS) of Namibia has declared an outbreak of Mpox following the confirmation of the first case in Swakopmund, Erongo Region, on 18 October 2025.\n\nThe patient, who is being treated at the Swakopmund District Hospital, is stable and currently isolated, undergoing comprehensive medical care.\n\nThe preliminary investigation into the outbreak has indicated that this transmission may be linked to cross-border travel within the Southern African Development Community (SADC) region. In accordance with World Health Organisation (WHO) protocols, the detection of even a single confirmed case necessitates the declaration of an outbreak, prompting health authorities to launch an immediate response.\n\nThe MoHSS has assured the Namibian public that the countrys robust surveillance system is primed to identify and monitor individuals exhibiting signs of mpox. Additional cases are being actively sought, while health authorities in the Erongo region are closely monitoring the patients immediate contacts to prevent further spread of the virus.\n\nMpox is a zoonotic disease caused by an orthopox virus, resulting in smallpox-like symptoms in humans. This outbreak follows a concerning trend, as multiple countries within Africa, including the Democratic Republic of the Congo (DRC), Zambia, Malawi, and Tanzania, are reporting active mpox cases.\n\nMpox symptoms typically manifest after an incubation period ranging from 5 to 21 days and can include:\n\nThe rash often appears on the face, palms, and soles of the feet, and can also affect the mouth, genitals, and eyes. Symptoms generally last from two to four weeks, during which the infected individuals are capable of transmitting the virus to others.\n\nHuman-to-human transmission occurs primarily through direct contact with respiratory secretions, bodily fluids, or skin lesions of an infected person. The MoHSS outlines several potential avenues for transmission, including:\n\nAs mpox can affect anyone regardless of demographic, the MoHSS urges the public to take preventive measures. These include:\n\nIn light of this outbreak, the MoHSS has mobilised necessary resources to respond effectively, emphasising the importance of public cooperation. Citizens are encouraged to remain calm and to refrain from spreading unverified information, which could instigate unnecessary panic or stigma towards affected individuals and their families.\n\nAs Namibian health officials continue to monitor the situation closely, ongoing updates will be provided to keep the public informed. The health and well-being of all citizens remain a top priority for the government and health authorities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14052550/mpox.jpg",
            "description": "<p>IOL The Ministry of Health and Social Services (MoHSS) of Namibia has declared an outbreak of Mpox following the confirmation of the first case in Swakopmund, Erongo Region, on 18 October 2025. The patient, who is being treated at the Swakopmund District Hospital, is stable and currently isolated, undergoing comprehensive medical care. The preliminary investigation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namibia-declares-mpox-outbreak-following-confirmed-case-in-swakopmund/\">Namibia declares Mpox outbreak following confirmed case in Swakopmund</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "21 Oct 2025"
        },
        {
            "title": "Kavango Resources in lucrative gold discovery",
            "url": "https://www.newzimbabwe.com/kavango-resources-in-lucrative-gold-discovery/",
            "content": "By Alois Vinga\n\nSouthern Africa-focused miner Kavango Resources has announced the discovery of a lucrative gold deposit at its Hillside Gold Project in Bulawayo, marking what the company describes as a breakthrough in its Zimbabwe operations.\n\nThe miner said its Nightshift Prospect has been confirmed as a gold deposit with significant upside potential, expected to deliver high ore and ounce yields per vertical metre. The company said the find aligns with its strategy to maximise gold production through modern, mechanised mining and processing methods.\n\nA preliminary JORC-compliant Mineral Resource Estimation has exceeded expectations, prompting Kavango to consider constructing an upgraded 300-tonne-per-day gold processing plant at the Bills Luck Gold Mine, up from the originally planned 200 tpd capacity.\n\nKavango Resources CEO Ben Turney described the discovery as a landmark achievement for the company.\n\nThis maiden JORC resource at Nightshift is a defining moment for Kavango. It proves that our gold development strategy in Zimbabwe is working and that our decision to focus on near-surface, fast-track production targets is delivering results, he said.\n\nTurney added that when the company began exploration at Hillside in mid-2023, its goal was to identify deposits that could fast-track gold production using advanced mining and processing methods.\n\nThis is a fantastic accomplishment by our team, who deserve all the praise for the hard work they have put into making this happen. Our initial drilling covered only about 15% of the known 700-metre strike, and just 50m vertical depth, because we were focused on defining a starter resource to underpin early cash flow and prove the concept.\n\nThe fact that the results have exceeded expectations at this stage gives us strong confidence in the greater potential of Nightshift. Given we encountered gold-bearing structures >200m vertical below surface during exploration, we are particularly excited for the underground mining possibilities here, added Turney.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga Southern Africa-focused miner Kavango Resources has announced the discovery of a lucrative gold deposit at its Hillside Gold Project in Bulawayo, marking what the company describes as a breakthrough in its Zimbabwe operations. The miner said its Nightshift Prospect has been confirmed as a gold deposit with significant upside potential, expected to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-in-lucrative-gold-discovery/\">Kavango Resources in lucrative gold discovery</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "21 Oct 2025"
        },
        {
            "title": "Zimbabwe dominate on rain-marred opening day",
            "url": "https://www.newzimbabwe.com/zimbabwe-dominate-on-rain-marred-opening-day/",
            "content": "Cricbuzz\n\nOn a rain-marred opening day of the second Test, Zimbabwe took the honors against Afghanistan in Bulawayo. Sikandar Raza (3-30), Newman Nyamhuri (3-42) and Blessing Muzarabani (2-56) were the major stars with the ball as Afghanistan folded for a paltry total of 157. In reply, Zimbabwes opening pair of Ben Curran and Joylord Gumbie negotiated three overs before bad light forced slightly early stumps with Zimbabwe at 6/0. It capped a strong start to the game for the hosts who won a good toss earlier in the morning.\n\nIncessant rains and then wet outfield meant that the first session was entirely lost and Zimbabwes captain Craig Ervine had no hesitation to bowl on winning the toss. After a slightly erratic start with the new ball, the Zimbabwe pacers got their radar right on a pitch that had life in it. Extra bounce was on offer and some seam movement as well, although not as extravagant as generally seen at this venue. Abdul Malik and debutant Riaz Hassan weathered the early storm but both fell in quick succession once Zimbabwes new-ball pairing hit their straps.\n\nIt was, however, a run out that gave Zimbabwe the first breakthrough as Hassan fell to a direct hit from Brian Bennett. It was just the tonic the home side needed and Nyamhuri then got Malik caught behind to give Zimbabwe further momentum in the afternoon session. Rahmat Shah and Hashmatullah Shahidi prevented further damage in the session but Zimbabwe continued to make inroads after tea. The impressive Nyamhuri broke the partnership between last games heroes Rahmat and Shahidi but getting the skipper LBW. Raza then got into the act to castle Rahmat as Afghanistan continued to slip away.\n\nOnce Rahmat fell, it was a procession for the visitors as Raza and Muzarabani sliced through the lower order. If not for comeback man Rashid Khans 20-ball 25, the total would have been much lesser. Even with the tricky nature of the pitch, the Afghanistan were easily about 50-60 runs short although the pitch cannot be judged till both sides bat on it.\n\nBrief scores:Afghanistan 157 (Sikandar Raza 3-30, Newman Nyamhuri 3-30) vs Zimbabwe 6/0\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/20205729/sikandar-raza-returned-3-for-3.webp",
            "description": "<p>Cricbuzz On a rain-marred opening day of the second Test, Zimbabwe took the honors against Afghanistan in Bulawayo. Sikandar Raza (3-30), Newman Nyamhuri (3-42) and Blessing Muzarabani (2-56) were the major stars with the ball as Afghanistan folded for a paltry total of 157. In reply, Zimbabwe’s opening pair of Ben Curran and Joylord Gumbie</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-dominate-on-rain-marred-opening-day/\">Zimbabwe dominate on rain-marred opening day</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "21 Oct 2025"
        }
    ]
}