{
    "news": [
        {
            "title": "DNC bus horror: 42 Zimbabweans and Malawians dead, Limpopo premier Phophi Ramathuba visits scene",
            "url": "https://www.newzimbabwe.com/dnc-bus-horror-42-zimbabweans-and-malawians-dead-limpopo-premier-phophi-ramathuba-visits-scene/",
            "content": "IOL\n\nThe death toll fromSundays horrific bus crash on the N1 north near Makhado(formerly Louis Trichardt) has risen to 42, Limpopo Premier Dr Phophi Ramathuba confirmed.\n\nMost of the victims were Zimbabwean and Malawian nationals travelling home from Gqeberha (Port Elizabeth) in the Eastern Cape.\n\nThe DNC bus reportedly veered off a mountainous section of the N1 and plunged down an embankment. Emergency services, including paramedics, transport officers, and law enforcement officials, responded swiftly, recovering the deceased and transporting injured passengers to nearby hospitals.\n\nPremier Ramathuba is scheduled to visit the crash site at 11 am on Monday to meet the multi-disciplinary emergency team for updates. She will later address the media and visit hospitals where the injured are receiving care.\n\nThis is a heartbreaking tragedy. Losing so many lives in one incident is painful beyond words. On behalf of the Limpopo Provincial Government, we extend our deepest condolences to the affected families, including those in Zimbabwe and Malawi. We wish a full and speedy recovery to all survivors. Our thoughts and prayers are with them during this difficult time, Ramathuba said.\n\nEarlier, Limpopo Transport MEC Violet Mathye confirmed that the deceased included a 10-month-old baby. She said driver fatigue or a possible mechanical fault could have caused the bus to lose control, though investigations are ongoing.\n\nThe N1 freeway was temporarily closed following the crash. Motorists were advised to use alternative routes: from Makhado to Musina via the Witvlag turnoff, and from Musina to Makhado via the Williespoort turnoff.\n\nThe tragedy follows reports that the bus carried passengers from Zimbabwe and Malawi who were returning home for personal reasons. Rescue operations continued late into Sunday evening, with law enforcement and transport officials coordinating efforts alongside disaster management teams.\n\nThe Limpopo government is also providing psychosocial support to survivors and working with consular services from Zimbabwe and Malawi to assist affected families. Traffic authorities and the South African Police Service continue to investigate the cause of the crash.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13122907/DNC-Bus.png",
            "description": "<p>IOL The death toll from Sunday’s horrific bus crash on the N1 north near Makhado (formerly Louis Trichardt) has risen to 42, Limpopo Premier Dr Phophi Ramathuba confirmed. Most of the victims were Zimbabwean and Malawian nationals travelling home from Gqeberha (Port Elizabeth) in the Eastern Cape. The DNC bus reportedly veered off a mountainous section</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dnc-bus-horror-42-zimbabweans-and-malawians-dead-limpopo-premier-phophi-ramathuba-visits-scene/\">DNC bus horror: 42 Zimbabweans and Malawians dead, Limpopo premier Phophi Ramathuba visits scene</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "Walter Musanhu sues Dynamos legend Murape Murape for defamation",
            "url": "https://www.newzimbabwe.com/walter-musanhu-sues-dynamos-legend-murape-murape-for-defamation/",
            "content": "By Leopold Munhende\n\nFORMER Motor Action defender and Zimbabwe Youth International Walter Ringers Musanhu has sued Dynamos legend Murape Murape for defamation of character.\n\nMurape, a former Dynamos captain and one of the clubs most capped players, accused Musanhu of incest and homosexuality.\n\nAccording to a letter sent to Murape by Musanhus lawyers, James Majatame Attorneys, he uttered the statements on a WhatsApp group named Former Footballers.\n\nMusanhu is demanding that Murape retract his statements on the same platform, publish apologies in publicly owned papers, The Herald and The Sunday Mail, for five consecutive weeks and refrain from making contact with him.\n\nThese allegations are false, malicious, and wholly unsubstantiated, reads the letter.\n\nYour statements are factually incorrect in their entirety and were clearly intended to tarnish our clients reputation.\n\nTo aggravate the matter, you subsequently sent our client direct messages via WhatsApp, again referring to him as mainini.\n\nSuch conduct constitutes cyberbullying and harassment and is a criminal offence under section 164B of the Cyber and Data Protection Act.\n\nMusanhu owns JADEL FA, a Beijing, China-based academy with branches in Zimbabwe. Over the past few years, it has taken junior footballers from the country to China and other parts of the world for tournaments.\n\nMurape works at Real Viedo Academy, a well-funded junior football initiative that is partnered with Spanish La Liga side Real Viedo.\n\nThe two are products of Dynamos once vibrant junior policy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/23121813/Murape-Murape-e1674476400929.png",
            "description": "<p>By Leopold Munhende FORMER Motor Action defender and Zimbabwe Youth International Walter “Ringers” Musanhu has sued Dynamos legend Murape Murape for defamation of character. Murape, a former Dynamos captain and one of the club’s most capped players, accused Musanhu of incest and homosexuality. According to a letter sent to Murape by Musanhu’s lawyers, James Majatame</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/walter-musanhu-sues-dynamos-legend-murape-murape-for-defamation/\">Walter Musanhu sues Dynamos legend Murape Murape for defamation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "Zanu PF annual ‘feast’ to gobble US$4 million, party to donate leftover food to hospitals, orphanages",
            "url": "https://www.newzimbabwe.com/zanu-pf-conference-to-gobble-us4-million-party-to-donate-leftover-food-to-hospitals-orphanages/",
            "content": "By Staff Reporter\n\nTHE 22nd Zanu PF Annual National Peoples Conference, which kicks off tomorrow, 14 October, and runs until the 18th, is set to gobble a staggering US$4 million at a time ordinary citizens are wallowing in poverty.\n\nThe yearly feast, characterised by pomp and fanfare, is a display of extravagance at which the partys top leaders flaunt their wealth, dressed in designer suits and driving fuel-guzzling vehicles while sipping on expensive champagne.\n\nZanu PF National Chairperson Oppah Muchinguri-Kashiri told State media that all is set for the indaba in Mutare, which will chew millions to transport and host delegates.\n\nShe confirmed that nearly US$4 million had been mobilised for the successful hosting of the National Peoples Conference, with US$2 million having been provided by the ruling partys elite.\n\nI would like to report that we have raised adequate resources. As we speak, as the Zanu PF leadership and well-wishers, we have raised almost US$4 million, with US$2 million coming from the leadership, Muchinguri-Kashiri was quoted saying.\n\nThey have surpassed all our expectations, so thank you to Zanu PF Manicaland. Last week, I reported that we only had 5 percent (of preparations) to attend to, to make sure that we are 100 percent ready.\n\nI can safely say we are good to go. Everything is 100 percent ready. We are all ready to go. The first is the well-furnished main hall. The offices were also not quite ready, but now they are ready, well-furnished, and we are very happy, said Muchinguri-Kashiri.\n\nShe hinted that the Zimbabwe Electricity Supply Authority (ZESA) had been ordered to ensure uninterrupted power supplies throughout the conference. All roads leading to the venue have been rehabilitated, while enough food has also been made available.\n\nThe party national chairperson added that leftovers after feeding 5,000 delegates will be donated to hospitals, orphanages and other institutions that require assistance, as is tradition.\n\nAll the food; in fact, we can feed 10,000 people from the donations that were made, she said.\n\nThe traditional Zanu PF indaba brings together the nations top leaders and thousands of provincial leaders to discuss and endorse decisions. This time around, expectations are high that a faction behind President Emmerson Mnangagwas term extension will use the event to rubber-stamp the position.\n\nMnangagwa, now aged 83, is Zanu PFs First Secretary giving him the mandate to lead all meetings during the National Peoples Conference at Mutare Polytechnic College this week.\n\nThis weeks Zanu PF itinerary at the annual showcase begins with a Politburo meeting tomorrow, Tuesday, followed by a Central Committee sitting on Wednesday, with both being held in Harare.\n\nOther highlights during the conference will include commissioning of the Mega Market Milling Plant by Mnangagwa as well as opening of the Ministry of Health and Child Care-constructed National Pharmaceutical Warehouse situated at Victoria Chitepo Provincial Hospital.\n\nThe octogenarian leader will also launch the national tree-planting initiative by leading the exercise at the site where the new Zanu PF Provincial offices will be built, adjacent to the conference venue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/19063012/mnangagwa-zanu-e1760326655896.jpeg",
            "description": "<p>By Staff Reporter  THE 22nd Zanu PF Annual National People’s Conference, which kicks off tomorrow, 14 October, and runs until the 18th, is set to gobble a staggering US$4 million at a time ordinary citizens are wallowing in poverty. The yearly feast, characterised by pomp and fanfare, is a display of extravagance at which the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-conference-to-gobble-us4-million-party-to-donate-leftover-food-to-hospitals-orphanages/\">Zanu PF annual ‘feast’ to gobble US$4 million, party to donate leftover food to hospitals, orphanages </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "‘An enemy is trying to hurt me’— says content creator Ritzmacleish responding to leaked nude video",
            "url": "https://www.newzimbabwe.com/an-enemy-is-trying-to-hurt-me-says-content-creator-ritzmacleish-responding-to-leaked-nude-video/",
            "content": "By Staff Reporter\n\nPOPULAR Zimbabwean content creator, Michelle Moyo, known online as Ritzmacleish, has issued a defence after her nude video, reportedly dating back to 2021, was recently leaked and went viral across social media platforms.\n\nMoyo, a mother of two, confirmed the videos age on her Facebook page and claimed the leak is a deliberate act of sabotage intended to ruin her budding career.Moyo, who is actively building her brand, insisted that the malicious timing is clear, noting the video was initially posted years ago without gaining traction.People in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.The video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nMoyo, a mother of two, confirmed the videos age on her Facebook page and claimed the leak is a deliberate act of sabotage intended to ruin her budding career.\n\nMoyo, who is actively building her brand, insisted that the malicious timing is clear, noting the video was initially posted years ago without gaining traction.People in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.The video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nMoyo, who is actively building her brand, insisted that the malicious timing is clear, noting the video was initially posted years ago without gaining traction.\n\nPeople in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.The video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nPeople in Zimbabwe rejoice when you are failing, the moment you try to rise up thats when they do their best to bring you down. Im trying very hard to build my brand, a brand that everyone will want to work with, yet my enemy is doing everything they can to destroy me.\n\nThe video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said MoyoThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nThe video that is currently circulating on the internet is from around 2021. The enemy had posted it before, but it didnt circulate because I wasnt famous back then. Those who have been following me for a long time know that it was posted a long time ago, said Moyo\n\nThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.She indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nThe content creator revealed that she tried contacting the source who posted the now leaked video on Telegram but was met with demands for unaffordable amounts of money.\n\nShe indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.I am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nShe indicated that she doesnt share explicit content for fame, differentiating herself from other content creators.\n\nI am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.I dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nI am not a person who looks for fame by trending in that way. I see a lot of people making over $5000 USD on a monthly basis posting those kinds of videos. If I were a person who wanted that, I would just do it and make money, not try to hide and deny things.\n\nI dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said MoyoMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nI dont share pictures without clothes. I value my morals greatly. I am a mother of two beautiful kids; I try by all means to be a mother with dignity, said Moyo\n\nMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.The way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nMoyo pleaded with the public to show support for the positive work she does, rather than participating in her destruction.\n\nThe way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.Let us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nThe way you are pushing this is destroying me. I wish you would try to push the good things I do instead. I have a lot of movies and dramas on YouTube, but I never see you sharing the links so that my work can be successful.\n\nLet us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\nLet us be people who enjoy doing good in the community; lets not have a bad spirit of destruction. I am not a sex worker (pfambi), but I am a woman who believed in marriage, tried to enter into a union, but it failed, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/13032709/1019101-e1760322465699.jpg",
            "description": "<p>By Staff Reporter  POPULAR Zimbabwean content creator, Michelle Moyo, known online as Ritzmacleish, has issued a defence after her nude video, reportedly dating back to 2021, was recently leaked and went viral across social media platforms. Moyo, a mother of two, confirmed the video’s age on her Facebook page and claimed the leak is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/an-enemy-is-trying-to-hurt-me-says-content-creator-ritzmacleish-responding-to-leaked-nude-video/\">‘An enemy is trying to hurt me’— says content creator Ritzmacleish responding to leaked nude video</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "13 Oct 2025"
        },
        {
            "title": "Blessed ‘Bombshell’ Geza plots October 17 street protests against Mnangagwa and his cronies",
            "url": "https://www.newzimbabwe.com/blessed-bombshell-geza-plots-october-17-street-protests-against-mnangagwa-and-his-cronies/",
            "content": "By Staff Reporter\n\nFUGITIVE war veteran, Blessed Runesu Geza, also known as Cde Bombshell has called on Zimbabweans to rise against alleged State capture and plunder of natural resources by President Emmerson Mnangagwa and his henchmen.\n\nGeza said citizens must come out and join forces on the streets of Harare to express their anger against the 83-year-old Zanu PF leader, who will be in Mutare attending the partys annual conference where a resolution to extend his incumbency beyond his second and final term in 2028 is expected to be tabled.\n\nIn a video posted on YouTube this weekend, Geza who is dressed in military fatigues at an undisclosed location, declared that the time for silence is over.\n\nThe former Sanyati legislator, who is wanted by authorities on sedition charges, claimed to speak for a faction of disillusioned liberation war fighters frustrated by what he described as economic decay and political betrayal.\n\nFellow Zimbabweans, l come to you when the situation can nolonger be ignored. The situation has now reached a defining moment tasvika kumagumo (we have reached the end), Geza said.\n\nEmmerson has chosen to betray the people of Zimbabwe, aligning himself with his criminal cartels, the Zviganandas. He has opted for corruption, looting and open normalisation of thievery within our very government.\n\nEmmerson has chosen to brutally mutilate our Constitution, massacring the rights of Zimbabweans to the dignity of life through his corrupt machinations. He is the Godfather of corrupt elements, the outspoken ex-guerrilla fighter said.\n\nWe want an uprising from Plumtree to Mutare, from Zambezi to Limpopo. Everyone must flood the streets  Mnangagwa must go, Geza said in the video.\n\nThe call comes as Zimbabwe faces growing political uncertainty, with reports of internal divisions in the ruling Zanu PF party and rising frustration over economic hardships.\n\nGeza noted that the time was ripe for masses to act decisively and end Mnangagwas tyranny and plunder of national coffers put at a staggering US$7 billion.\n\nThe time for our suffering has ended. Today marks the final steps to dismantle this madness. We will nolonger standby and let Emmerson and his Zviganandas rob our people of the future and sacred right to vote in 2028. We will nolonger tolerate the resolution seeking to postpone elections, somehow said to represent the will of the people. This is the gravest insult to the dignity of Zimbabweans.\n\nGeza urged Zimbabweans from all walks of life to participate in streets demonstrations set for next Friday coinciding with the climax of the Zanu PF Annual National Peoples Conference set for Mutare Polytechnic, from 13 to 18, 2025.\n\nOn Friday, 17 October, fellow Zimbabweans, lets say no to State capture by (Kuda) Tagwirei, (Wicknell) Chivayo and their fellow Zviganandas.\n\nLets say no to the looting of our State resources, when civil servants are poorly paid, lets say no to the looting of billions when our people die in hospitals without medication, when our women give birth in open spaces.\n\nThis country doesnt belong to Emmerson, his wife and criminal cartels, declared Geza, who is largely viewed to be bidding for Vice President Constantino Chiwenga to take over the presidency come 2028.\n\nThe struggle must continue until every Zimbabwean is free from tyranny, Geza said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/12055423/geza_vid_2.jpg",
            "description": "<p>By Staff Reporter  FUGITIVE war veteran, Blessed Runesu Geza, also known as “Cde Bombshell” has called on Zimbabweans to rise against alleged State capture and plunder of natural resources by President Emmerson Mnangagwa and his henchmen. Geza said citizens must come out and join forces on the streets of Harare to express their anger against</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blessed-bombshell-geza-plots-october-17-street-protests-against-mnangagwa-and-his-cronies/\">Blessed ‘Bombshell’ Geza plots October 17 street protests against Mnangagwa and his cronies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "13 Oct 2025"
        }
    ]
}