{
    "news": [
        {
            "title": "Zimbabwe left with only one qualified forensic pathologist – Health Minister",
            "url": "https://www.newzimbabwe.com/zimbabwe-left-with-only-one-qualified-forensic-pathologist-health-minister/",
            "content": "By Anna Chibamu\n\nZimbabwe is grappling with a critical shortage of forensic pathologists, a situation driven by brain drain and a lack of interest among doctors to specialise in the field, Health Minister Douglas Mombeshora told Parliament on Wednesday.\n\nResponding to questions during a Q&A session, Mombeshora revealed that the country currently has only one qualified forensic pathologist, creating major challenges in conducting post-mortems, particularly in murder cases.\n\nHis remarks came after Citizens Coalition for Change (CCC) MP Lynett Karenyi asked about government policy regarding medico-legal post-mortem examinations and the requirement for bodies to be transported from across Zimbabwe to Harare for assessment.\n\nOf late, there have been challenges with postmortems, especially forensic. These specialised procedures are indeed conducted by forensic pathologists who possess distinct training and expertise beyond that of general pathologists.\n\nApparently, we do not have enough forensic pathologists in the country. We have only one qualified forensic pathologist at the moment. We have relied on recruiting from outside the country, Mombeshora said.\n\nThe Health Minister added that the shortage of specialists has left the government struggling to meet demand, stressing that addressing the skills gap remains urgent hence government has recruited three forensic pathologists from Cuba.\n\nWe are all aware that we have had a challenge of brain drain. At some stage, we had more than three in the country who were trained.\n\nAlso, it is a department or a speciality where we have not really seen interest in our own doctors to specialise in. As a result, we have not had enough pathologists, Mombeshora added.\n\nThe minister said the just-recruited Cuban forensic pathologists started work on Wednesday, October 1.\n\nThese will actually help us in terms of carrying out forensic postmortems.\n\nAs a result, it was very difficult for one forensic pathologist to move around the country and in other hospitals, especially our district hospitals, Mombeshora added.\n\nHe told the august house that the mortuaries were not equipped with the requisite equipment needed to carry out forensic pathology.\n\nAs a result, dead bodies have to be moved either to Sally Mugabe, Parirenyatwa or Chitungwiza in Harare and the same in Bulawayo, Mpilo Hospital or United Bulawayo Hospitals (UBH).\n\nThe pathologists will then give days to go to Bulawayo or do pathology examinations here in Harare. We hope that the incoming of the three new forensic pathologists will make their job much easier and enable them to go to other provincial hospitals where the equipment is available and carry out those pathology examinations.\n\nAsked by another legislator what government would do to stop the exodus of healthcare professionals, Mombeshora responded, We now have the Health Service Commission in place and they are working on incentives for various sectors in the medical field to see if we can come up with incentives including improved salaries, incentives of those who are working outside metropolitan areas so that we can stop the brain drain and have our own people working here instead of relying on foreign experts.\n\nHe added, We hope that by next year, we will be training more and then in the coming four years, that is when we may see more forensic pathologists coming out.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Anna Chibamu Zimbabwe is grappling with a critical shortage of forensic pathologists, a situation driven by brain drain and a lack of interest among doctors to specialise in the field, Health Minister Douglas Mombeshora told Parliament on Wednesday. Responding to questions during a Q&A session, Mombeshora revealed that the country currently has only one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-left-with-only-one-qualified-forensic-pathologist-health-minister/\">Zimbabwe left with only one qualified forensic pathologist – Health Minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "03 Oct 2025"
        },
        {
            "title": "Government excludes urban-based farmers from the Pfumvudza/Intwasa Presidential Input Scheme",
            "url": "https://www.newzimbabwe.com/government-excludes-urban-based-farmers-from-the-pfumvudza-intwasa-presidential-input-scheme/",
            "content": "By Anna Chibamu\n\nGovernment has announced that this years Presidential Pfumvudza/Intwasa inputs scheme will strictly target rural households, with no provision for the 500 000 urban or peri-urban dwellers who benefited last season.\n\nAgriculture Minister Anxious Masuka told Parliament during a Wednesday Q&A session that only rural communities will be provided with farming inputs under the programme, adding that last years inclusion of urban beneficiaries had been a temporary measure to cushion against the effects of the El Nio-induced drought.\n\nPumula MP Sichelesile Mahlangu had sought the governments position regarding urban constituencies benefiting from the scheme.\n\nThese peri-urban areas are actively participating in thePfumvudza/IntwasaProgramme and are fully prepared.What is the ministers position on these constituencies? Mahlangu.\n\nThe official policy is that urban areas will not receive Presidential input this year. The exception granted last year was due to an extraordinary drought, Masuka said.\n\nThis year, the inputs will be strictly allocated to the three million rural beneficiaries. Anyone residing in an urban area who wishes to benefit must be located in designated agricultural zones, namely, communal lands, A1 resettlement areas, or small-scale farming areas. These are the targeted zones for thePfumvudza/IntwasaProgramme this season.\n\nThe Pfumvudza/Intwasa scheme, a food security programme, has over the years focused on boosting productivity among smallholder and rural farmers through climate-smart agriculture.\n\nMasuka stressed that the programme would not accommodate urban dwellers since it is designed for farming regions.\n\nHowever, it is important to note that agriculture is designated for agricultural zones. Urban areas are primarily residential and do not accommodate farming activities.\n\nIn Zimbabwe, we have established that urban agriculture is not permitted, as farming should take place on land specifically allocated for agricultural purposes, not within urban settlements, Masuka explained.\n\nHe added, I recall that during last years severe drought, the President recognised that rural farmers who typically support urban populations were facing significant challenges. In response, we extended input support to peri-urban farmers to help supplement food production.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/01030702/Anxious-Masuka.png",
            "description": "<p>By Anna Chibamu Government has announced that this year’s Presidential Pfumvudza/Intwasa inputs scheme will strictly target rural households, with no provision for the 500 000 urban or peri-urban dwellers who benefited last season. Agriculture Minister Anxious Masuka told Parliament during a Wednesday Q&A session that only rural communities will be provided with farming inputs under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-excludes-urban-based-farmers-from-the-pfumvudza-intwasa-presidential-input-scheme/\">Government excludes urban-based farmers from the Pfumvudza/Intwasa Presidential Input Scheme</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "03 Oct 2025"
        },
        {
            "title": "Gold rally fuels 45% stocks rise on Zimbabwe’s dollar bourse",
            "url": "https://www.newzimbabwe.com/gold-rally-fuels-45-stocks-rise-on-zimbabwes-dollar-bourse/",
            "content": "Bloomberg\n\nZimbabwes dollar-only stock market is riding a wave of gains, powered by gold miners cashing in on a 48% jump in the precious metal this year.\n\nThe Victoria Falls Stock Exchanges benchmark index has surged 45%, lifting its market value to $1.8 billion at the end of September.\n\nThe VFEX was set up in late 2020 to raise capital, specifically for mining companies, and has 17 listed firms. Chief Executive OfficerJustin Bgoniexpects it to add five more by the end of the year, in sectors ranging from mining to property, he said Thursday by phone.\n\nThe exchange has performed well with valuations now approaching their regional peers, he said.\n\nVFEX All-Share Indexs 45% Rise\n\nUK-basedKavango Resources, with mining interests in Filabusi in south-eastern Zimbabwe, became the third gold miner to list on the bourse last month. Others includeCaledonia Mining Corp.andPadenga Holdings Ltd., which also has interests in crocodile skins.\n\nTheir stocks have become a proxy for gold, saidIH Securitiesresearch head,Lloyd Mlotshwa. These companies invested well in time to catch the gold rush and have also ramped up production when the timing is right.\n\nAlso boosting the VFEX is a shortage of ZiGs, the local currency, which has shifted investor sentiment away from the main exchange in Harare to the dollar-only bourse, Mlotshwa said. ZiG liquidity is weak, he added Investors resort instead to using their dollars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>Bloomberg Zimbabwe’s dollar-only stock market is riding a wave of gains, powered by gold miners cashing in on a 48% jump in the precious metal this year. The Victoria Falls Stock Exchange’s benchmark index has surged 45%, lifting its market value to $1.8 billion at the end of September. The VFEX was set up in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-rally-fuels-45-stocks-rise-on-zimbabwes-dollar-bourse/\">Gold rally fuels 45% stocks rise on Zimbabwe’s dollar bourse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "03 Oct 2025"
        },
        {
            "title": "In Pictures: City of Harare’s blitz leaves small business owners stranded",
            "url": "https://www.newzimbabwe.com/in-pictures-city-of-harares-blitz-leaves-small-business-owners-stranded/",
            "content": "Scores of small business owners in Harare were left stranded after the City Council shut down shops and trading spaces in a blitz enforcing municipal bylaws. Authorities say the operation is aimed at restoring order in the capital.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02162525/Tuckshops-3.png",
            "description": "<p>Scores of small business owners in Harare were left stranded after the City Council shut down shops and trading spaces in a blitz enforcing municipal bylaws. Authorities say the operation is aimed at restoring order in the capital. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-city-of-harares-blitz-leaves-small-business-owners-stranded/\">In Pictures: City of Harare’s blitz leaves small business owners stranded</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "03 Oct 2025"
        },
        {
            "title": "Chevrons qualify for 2026 T20 World Cup",
            "url": "https://www.newzimbabwe.com/chevrons-qualify-for-2026-t20-world-cup/",
            "content": "By Sports Reporter\n\nThe Zimbabwe senior mens cricket team sealed qualification for the 2026 ICC T20 World Cup on Thursday after defeating Kenya by seven wickets in the semi-finals of the Africa Qualifiers at Harare Sports Club.\n\nThe Chevrons join Namibia, who booked their ticket with a 63-run win over Tanzania in the other semi-final clash.\n\nZimbabwes qualification marks their return to the prestigious global tournament after missing out on last years edition.\n\nWith the pressure of qualification lifted, Zimbabwes batting line-up delivered with ease, chasing down Kenyas target of 122 runs in comfortable fashion.\n\nTournament standout Brian Bennett was once again the star performer, smashing 51 runs off just 25 balls, the fastest innings by a Zimbabwean batsman this year.\n\nZimbabwe and Namibia will now meet in the Africa Qualifiers final on Saturday at Harare Sports Club.\n\nThe 2026 T20 World Cup will be co-hosted by Sri Lanka and India. Seventeen of the 20 slots have already been filled, with the remaining three to be decided at the Asia-Pacific Qualifiers in Oman next week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02164146/chevrons.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe senior men’s cricket team sealed qualification for the 2026 ICC T20 World Cup on Thursday after defeating Kenya by seven wickets in the semi-finals of the Africa Qualifiers at Harare Sports Club. The Chevrons join Namibia, who booked their ticket with a 63-run win over Tanzania in the other semi-final</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-qualify-for-2026-t20-world-cup/\">Chevrons qualify for 2026 T20 World Cup</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "03 Oct 2025"
        },
        {
            "title": "Tagwirei to takeover from Mnangagwa – says Mliswa in leaked audio, adds that Chiwenga is being misled by wife to think he has influence in army",
            "url": "https://www.newzimbabwe.com/tagwirei-to-takeover-from-mnangagwa-says-mliswa-in-leaked-audio-adds-that-chiwenga-is-being-misled-by-wife-to-think-he-has-influence-in-army/",
            "content": "By Leopold Munhende\n\nOutspoken former legislator Temba Mliswa has sensationally declared businessman Kudakwashe Tagwirei as President Emmerson Mnangagwas natural successor, dismissing Vice President Constantino Chiwengas chances of ever taking over.\n\nIn a leaked audio of a phone conversation between Mliswa and controversial businessman Agrippa Bopela Masiyakurima, secretly recorded by the latter, Mliswa argued that Chiwenga is being misled by his wife, Miniyothabo Baloyi, into believing he still commands enough military influence to claim the presidency.\n\nMliswa, once a fierce critic of Tagwirei, defended his change of stance by insisting he has no permanent enemies but only permanent interests.\n\nThe person who is going to take over from Mnangagwa is someone he trusts, who will protect his interests, Tagwirei, said Mliswa.\n\nSocial media does not install a leader. To tell you the truth, I know how you feel about Mnangagwa but we cannot have permanent enemies, we should have permanent interests. Who does not eat, everyone is doing so.\n\nWalk with the father who is there, not a step-father. Chiwenga is a stepfather. We will lose deals because of things that do not matter, you are business people, you must look at things that make you money.\n\nBoth Masiyakurima and Mliswa appeared to agree on Tagwireis succession prospects, with Masiyakurima adding that he could never support Mnangagwa because of a failed US$5 million business deal between them.\n\nMliswa accused Chiwenga of corruption and pursuing personal vendettas, even over trivial issues such as unreceived wedding gifts.\n\nOnce considered the most powerful man in Zimbabwe after leading the November 2017 military intervention that toppled the late Robert Mugabe and ushered in Mnangagwa, Chiwenga is now widely viewed as having lost influence since retiring from the army to assume the role of deputy president.\n\nDespite perceptions that the military has shifted allegiance to the MnangagwaTagwirei faction within Zanu PF, Chiwenga reportedly still believes he retains significant sway.\n\nAdded Mliswa: There is no longer any opposition in Zanu PF, they are headed to a conference with Mnangagwa tightly holding onto power, there is no coup that will ever happen in Zimbabwe.\n\nThe cars that were given to the military came from Tagwirei with Zimbabwe Defence Forces (ZDF) Commander Phillip Valerio Sibanda saluting, remember Valerio is from ZIPRA, not ZANLA.\n\nChiwenga will never direct operations for the army, that will never happen. He removed his uniform. That man is being misled by his wife, he should remember that he no longer wears a uniform.\n\nBaloyi, a serving Colonel, has in recent months stepped up her public presence, which analysts view as part of both her own rebranding and that of the Chiwenga family. This comes as the Mnangagwa administration continues to face criticism over alleged corruption, ruthless tactics, and an expanding grip on key economic sectors such as mining.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Leopold Munhende Outspoken former legislator Temba Mliswa has sensationally declared businessman Kudakwashe Tagwirei as President Emmerson Mnangagwa’s natural successor, dismissing Vice President Constantino Chiwenga’s chances of ever taking over. In a leaked audio of a phone conversation between Mliswa and controversial businessman Agrippa “Bopela” Masiyakurima, secretly recorded by the latter, Mliswa argued that Chiwenga</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-to-takeover-from-mnangagwa-says-mliswa-in-leaked-audio-adds-that-chiwenga-is-being-misled-by-wife-to-think-he-has-influence-in-army/\">Tagwirei to takeover from Mnangagwa – says Mliswa in leaked audio, adds that Chiwenga is being misled by wife to think he has influence in army</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "03 Oct 2025"
        }
    ]
}