{
    "news": [
        {
            "title": "Harare Mayor Mafume fears temporary ban on Rufaro Stadium as facility deteriorates",
            "url": "https://www.newzimbabwe.com/harare-mayor-mafume-fears-temporary-ban-on-rufaro-stadium-as-facility-deteriorates/",
            "content": "By Darlington Gatsi\n\nRUFARO STADIUM could be on the brink of condemnation as the iconic venue continuesto show visible signs of deterioration just one year after reopening to host top-flight matches.\n\nThe imposing Mbare facility is struggling to withstand the demands of hosting elite fixtures, with the pitch visibly damaged, posing a danger to players.\n\nRufaro Stadium is home to Dynamos, CAPS United, Herentals, and Scottland FC. The ground is also used by Division One clubs, further straining its capacity.\n\nWith midweek Castle Lager Premier Soccer League matches scheduled, Rufaro would have hosted six encounters in 11 days, excluding Northern Region Division One games.\n\nSpeaking at a recent council meeting at Town House, Harare Mayor Jacob Mafume expressed concerns that the stadium could be barred from hosting top-tier matches.\n\nTwo weeks is too long. The renovations must be done because the stadium is about to be condemned again, Mafume told councillors.\n\nShould Rufaro be condemned, Premier Soccer League (PSL) teams in Harare could be left in limbo unless the City Council acts swiftly to upgrade the facility.\n\nEarlier this year, the council announced a partnership with Scottland FC, owned by Mabvuku Member of Parliament Pedzai Scott Sakupwanya, to renovate the stadium.\n\nHowever, no notable improvements have been made since, dashing Mafumes hopes of the venue hosting international matches.\n\nThe installation of bucket seats, which Mafume had promised would be completed by mid-year, remains far behind schedule.\n\nInstallation of electronic turnstiles is yet to be completed. Rufaro stadium is still using an archaic scoreboard, another task on the hands of Mafume-led Council.\n\nRufaro Stadium reflects the broader decline of sports facilities under the Harare City Council (HCC), many of which are in deplorable condition.\n\nMafume told councillors he was tired of apologising for the state of council-owned facilities.\n\nThe state of City Sportslet us look at them. Every time, I have to apologise when I arrive at any council facility. It is not nice. The place does not look good, but there are simple things we should fix, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/05120417/rufaro-1.jpg",
            "description": "<p>By Darlington Gatsi RUFARO STADIUM could be on the brink of condemnation as the iconic venue continues to show visible signs of deterioration just one year after reopening to host top-flight matches. The imposing Mbare facility is struggling to withstand the demands of hosting elite fixtures, with the pitch visibly damaged, posing a danger to players.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-mayor-mafume-fears-temporary-ban-on-rufaro-stadium-as-facility-deteriorates/\">Harare Mayor Mafume fears temporary ban on Rufaro Stadium as facility deteriorates </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "17 Jun 2025"
        },
        {
            "title": "CCTV footage gives away US$300 ATM thief",
            "url": "https://www.newzimbabwe.com/cctv-footage-gives-away-us300-atm-thief/",
            "content": "By Staff Reporter\n\nA VICTORIA Falls man has been convicted and jailed for stealing US$300 from a faulty automated teller machine (ATM) at a ZB Bank in Hwange.\n\nKaleb Murahwa (48) was slapped with a 12-month imprisonment, of which three months were suspended on condition he restitutes US$300 to the complainant by July 11, 2025. He will, therefore, effectively serve nine months behind bars.\n\nThe prosecutor proved that on May 24, 2024, the complainant, a 29-year-old teacher at a school in Binga, attempted to withdraw US$300 from an ATM. After inserting her card and completing the transaction, the machine failed to dispense the cash.\n\nAs a result of the malfunctioning ATM, the complainant went inside the bank to enquire. While doing that, the ATM dispensed cash, and the offender seized the opportunity and took the lucky money.\n\nThe court further heard that bank staff, unaware of the incident, helped serve the client and facilitated the withdrawal of US$300 manually.\n\nOn July 2 last year, the bank, during routine reconciliations, discovered that the complainant had double benefited and debited the US$300 from her account.\n\nIt was heard that during investigations, closed-circuit television (CCTV) footage from the day of the withdrawals revealed the offender walking away from the ATM with the lucky cash after the complainant had gone inside the premises.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/17083347/zb-atm.jpg",
            "description": "<p>By Staff Reporter A VICTORIA Falls man has been convicted and jailed for stealing US$300 from a faulty automated teller machine (ATM) at a ZB Bank in Hwange. Kaleb Murahwa (48) was slapped with a 12-month imprisonment, of which three months were suspended on condition he restitutes US$300 to the complainant by July 11, 2025.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cctv-footage-gives-away-us300-atm-thief/\">CCTV footage gives away US$300 ATM thief </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "17 Jun 2025"
        },
        {
            "title": "How Zimbabwe’s Health System Profits From the Dead",
            "url": "https://www.newzimbabwe.com/how-zimbabwes-health-system-profits-from-the-dead/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Blessing Mucharambeis uncle was just having lunch when he stood up, then collapsed. [He] started bleeding from the nose, she says, and died on the spot.\n\nAs far as his family knew, he had no health problems. As they struggled to make sense of the news, Chitungwiza Hospital  where his body had been taken to a mortuary  told them that a forensic postmortem would be required.\n\nZimbabwean law mandates postmortems for sudden or unexplained deaths, and public hospitals offer them for free. But there are only five qualified pathologists in Zimbabwe serving a population of close to 17 million people. The wait could stretch for days. And each day the funeral was delayed would add to the cost of hosting mourners, as some traditions require.\n\nA police officer stationed at the hospital offered them a workaround. Instead of a forensic postmortem, they could do a general one  an option when no foul play is suspected, and quicker since it doesnt require a specialist. But even that, he warned, could take days. He offered to fast-track the process for a US$30 fee. Desperate to bury their loved one, they paid.\n\nWe couldnt afford the time, Mucharambei says. We did it because we had no choice.\n\nPostmortem bribes are just one element of a health system  and state  in freefall.Hospitals across the country are plaguedby chronic underfunding, obsolete infrastructure and the mass emigration of medical professionals seeking better pay abroad. The government estimates that the country needs more than US$1.6 billion for its health sector to recover.\n\nUnderpaid and overstretched health workers have come to rely on informal payments as a means of survival, says Dr. Norman Matara, secretary general of the Zimbabwe Hospital Doctors Association. People are trying to survive. But over time, corruption becomes part of the culture.\n\nHe says its a common problem across hospital services, from the moment a patient is admitted.New mothers, for example, face extortionfor birth cards meant to be free. A 2021 study from Transparency International Zimbabwe surveyed over 1,000 people in Zimbabwe and found that 74% had been asked to pay a bribe while trying to access health care services.\n\nIn March, a nurses protest at Sally Mugabe Central Hospital  the largest referral hospital in the country  exposed how dire the situation is. It was the latest in a long history of strikes by health workers, who have repeatedly protested poor pay and deteriorating working conditions. But their actions are often met with intimidation. In June 2022, the government responded to a strike by passing a law banning health care workers from striking longer than 72 hours, with penalties of up to six months in jail for participants and organizers.\n\nA hospital corridor leads to the mortuary at Parirenyatwa Hospital. Zimbabwes public health system faces a severe shortage of pathologists, leading to postmortem delays and widespread bribery. Families say theyre often pressured to pay unofficial fees to expedite the process or obtain basic information about their loved ones.Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nPathology services are particularly strained, Matara says. The few available specialists are clustered in major hospitals, which creates opportunities for exploitation.\n\nFew medical students choose the career, and those who do face an uphill battle. Training programs are underfunded, mentorship is scarce and working conditions at public hospitals are dismal.\n\nBut this is partly a manufactured problem, says Memory, a nurse at Sally Mugabe Central Hospital, who asked to use her middle name for fear of losing her job. Memory has worked at the hospitals mortuary close to 20 years.\n\nThere isnt really a backlog but a fake one is created by police officers, the doctors and mortuary staff to pressure families into paying, she says.\n\nThese services are supposed to be easily available, she adds. A Cuban doctor performs the forensic postmortems on Mondays, Wednesdays and Fridays, while the general ones are done daily. But families are often told there are delays. At times, they are asked to pay US$50 to skip it entirely, even when its required by law, or US$100 to expedite the process, Memory says.\n\nIts a moneymaking scheme at the expense of grieving people, she says.\n\nGlobal Press Journal reached out to Sally Mugabe Central Hospital for a response to these allegations. They declined to comment.\n\nTendai Terrence Mautsi, the public relations officer at Parirenyatwa Hospital, the largest public hospital in Zimbabwe, says there are occasional delays with forensic postmortem cases, mostly due to demand. The hospital, he says, has responded by increasing forensic postmortem days from two to three. Theyve also cut the average waiting time from up to two weeks to just three days. To address the national shortage, Mautsi says, the hospital has partnered with Cuban doctors to fill the skills gap.\n\nHe acknowledges that corruption has plagued the process. But, he says, its part of a much bigger unravelling, and everyone has become complicit.\n\nAt times you cant find evidence, he says. When you want to investigate it, the patient is complicit. The service provider is also complicit.\n\nIn the end, corruption harms people in need, says Tafadzwa Chikumbu, the executive director of Transparency International Zimbabwe. For those who cant afford to pay [a bribe], it means being left unattended, he says, which erodes the integrity of public institutions.\n\nThe solution, he says, is to make ethical conduct  including fair hiring and honest service delivery  the standard.\n\nEmily Muchabaiwa, in hat, Antonette Chisango and Keldon Muchabaiwa sit at their home in Harare. The sudden death of Emily Muchabaiwas brother  Chisangos husband  was marred by irregularities, including the absence of a written report and the lack of a clear explanation from medical staff.Photo credit: Linda Mujuru, GPJ Zimbabwe\n\nPostmortem corruption means some families never find out what happened to their loved one. When Emily Muchabaiwas brother was found dead in Harares industrial area, his family was desperate for answers. The circumstances of his death werent clear, and the family hoped a postmortem at Parirenyatwa Hospital would offer closure.\n\nPer standard procedure, a medical doctor or the pathologist should explain the results to the family, Matara says. There should also be a written report. But it was a police officer who delivered the results, verbally, to Muchabaiwas family. There was no official report.\n\n[He] told us my brother had died from tuberculosis and a cold in the lungs, but he struggled to explain the medical terms. Prior to all this, my brother had no signs of sickness, she says.\n\nThe family was suspicious. Muchabaiwa says they believe the death involved foul play and the process was compromised. It would cost the family money to delay the funeral, so they buried her brother, who left behind a young son.\n\nWe had no choice, she says, voice trembling. The postmortem failed us. Corruption failed us.\n\nLinda Mujuruis a Reporter-in-Residence for Global Press Journal in Zimbabwe, where she covers foreign direct investment and its effects on local communities. She holds an MBA from Midlands State University and Masters and Bachelors degrees in Journalism and Media Studies from the National University of Science and Technology. Linda is one of Global Press most widely read and syndicated journalists and won the Community Champions Award from the Nonprofit News Awards for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/16183122/01_GPJNews_Zimbabwe_LM_PostMortem_71_L_T.JPG_web.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal. HARARE, ZIMBABWE — Blessing Mucharambei’s uncle was just having lunch when he stood up, then collapsed. “[He] started bleeding from the nose,” she says, “and died on the spot.” As far as his family knew, he had no health problems. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/how-zimbabwes-health-system-profits-from-the-dead/\">How Zimbabwe’s Health System Profits From the Dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "17 Jun 2025"
        },
        {
            "title": "Former cabinet minister Mzembi requests court to cancel arrest warrants, says he was grounded by poor health",
            "url": "https://www.newzimbabwe.com/former-cabinet-minister-mzembi-requests-court-to-cancel-arrest-warrants-says-he-was-grounded-by-poor-health/",
            "content": "By Mary Taruvinga\n\nFORMER Foreign Affairs Minister, Walter Mzembi, has urged the court to cancel his arrest warrant, adding that he was not in wilful default over the past seven years he has been out of the country.\n\nMzembi was arrested when he touched down at Robert Mugabe International Airport over the weekend, accused of skipping court.\n\nWhen he left the country in 2018, Mzembi was on remand following his arrest on allegations of theft of trust property.\n\nIn his application filed before Harare Magistrate Donald Ndirowei on Monday, Mzembi said he has always wanted to have his case finalised, the reason he returned home after a long time, using the proper channels.\n\nHe also said he is battling an ailment which has seen him hospitalised on several occasions, hence he could not return.\n\nOn numerous occasions, he has relapsed and needed alterations and been admitted and reassessed to an extent that this condition remains a life-threatening long-term illness.\n\nDue to travel document requirements, the same accused could not continue to get treatment in South Africa, and the only next medical facility that was capable of properly managing his condition was in Zambia.\n\nIt remains his humble submission that he could not get the necessary treatment locally.\n\nUpon relocation to the same in early 2024, the accuseds condition had seriously deteriorated as he arrived only to be admitted and placed on oxygen for over 10 days. In support of this, I have tendered a detailed report from his current medical team as well as the bill for the duration of his stay as well as pictures of his stay in hospital.\n\nThe accused again remains under the constant care of his medical practitioners of this critical condition I refer to the June report currently attached hereto.\n\nThe accused, feeling much better, then travelled to Zimbabwe to manage these issues and was then arrested at the airport before being awarded an opportunity to submit himself freely to the court.\n\nHe came of his own free will and without coercion or enticement.\n\nHad he been given a chance to, he freely would have come to court to address the warrants of arrest and deal with the matters in their entirety, said his lawyer, Killian Mandiki.\n\nNdirowei is expected to hand down his ruling on Mzembis application this Tuesday.\n\nBefore he left the country, Mzembi told a Harare magistrate, Milton Serima, that he was battling stomach cancer and would be undergoing treatment in South Africa for at least a year.\n\nThe magistrate approved his application for further release of his passport to allow for the frequent trips to South Africa for a check-up.\n\nThe ex-minister produced a supporting letter from a South African medical specialist who indicated that he will be required to return for post-operative reviews.\n\nHe told the court that he was hospitalised in an intensive care unit on the day he was supposed to attend court. The warrant was cancelled.\n\nMzembi was then represented by his lawyer, Job Sikhala.\n\nBack then, the lawyer tried to keep Mzembis medical condition under wraps by requesting that the case be held in camera, but the application was turned down.\n\nMzembi is accused of stealing US$1,6 million, among other charges, when he was still the Tourism and Hospitality Minister.\n\nHe was being charged together with Tourism and Hospitality ministry consultant Aaron Dzingira Mushoriwa(62)and the ex-permanent secretary Margret Sangarwe(59).\n\nProsecutors allege that when he stole US$1,6 million in donations from Mbada Diamonds and Zimplats, Mzembi and his accomplices bought themselves top-of-the-range vehicles.\n\nThe ex-minister is facing theft of trust property as well as fraud charges.\n\nMzembi is also facing separate charges of criminal abuse of office relating to a donation of television sets to three churches  the Prophetic Healing and Deliverance (PHD), United Family International (UFI) and the Zimbabwe Christian Church (ZCC).\n\nIt is his argument that he did this in line with a government policy of religious tourism. The televisions were bought by the ministry for the outside showing of the 2010 World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/10034227/Walter-Mzembi.jpg",
            "description": "<p>By Mary Taruvinga FORMER Foreign Affairs Minister, Walter Mzembi, has urged the court to cancel his arrest warrant, adding that he was not in wilful default over the past seven years he has been out of the country. Mzembi was arrested when he touched down at Robert Mugabe International Airport over the weekend, accused of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-cabinet-minister-mzembi-requests-court-to-cancel-arrest-warrants-says-he-was-grounded-by-poor-health/\">Former cabinet minister Mzembi requests court to cancel arrest warrants, says he was grounded by poor health</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:35",
            "date": "17 Jun 2025"
        }
    ]
}