{
    "news": [
        {
            "title": "Tshabangu refiles Supreme Court appeal after clerical error",
            "url": "https://www.newzimbabwe.com/tshabangu-refiles-supreme-court-appeal-after-clerical-error/",
            "content": "By Mary Taruvinga\n\nSengezo Tshabangu, a self-styled former secretary general of the Citizens Coalition for Change (CCC) party has refiled his Supreme Court appeal against a High Court ruling blocking him from recalling members of the faction.\n\nHis move has cut short celebrations by leaders of the party who were victims of his parliamentary position reshuffle.\n\nThe party on Monday said his withdrawal meant that the High Court ruling was now operational, further noting that the reassigned members would assume their original positions in parliament.\n\nA notice of appeal under case number 25 of the Supreme Court has been filed with Tshabangu challenging High Court judge Justice Neville Wamambos ruling.\n\nTake notice that the appellants hereby appeal against the whole final and definitive judgement of the High Court of Zimbabwe sitting at Harare handed down per Wamambo J on the 8thof January 2025 under case number HCH 5606/24 delivered under judgement number HH 11-25, reads the notice.\n\nSenator Nonhlanhla Mlotshwa is the second appellant in the appeal.\n\nThe two said their withdrawal on Monday was due to an error in the service address.\n\nLast year CCC leaders including the interim party leader, Welshman Ncube and his deputy, Lynette Karenyi Kore, Sesel Zvidzai and Edwin Mushoriwa filed an application citing their party as the first applicant.\n\nTshabangu had dismissed the leaders from their parliamentary roles and appointed his selections in their place.\n\nAs a result ,they sued Tshabangu and Mlotshwa, seeking a court declaration that Tshabangus decisions to oust them from the Standing Rules and Orders Committee (SROC) were unlawful and exceeded his constitutional authority,\n\nThey also challenged Mlotshwas appointment as the CCC chief whip, claiming that such a position is not recognised under Section 151 (2) of the Constitution.\n\nThey also said the reshuffling of various CCC members across different parliamentary committees to which they were originally assigned.\n\nThey sought an order to prevent the Speaker from announcing these changes in the National Assembly.\n\nTheir challenge was upheld by Wamambo prompting Tshabangu to approach the Supreme Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Mary Taruvinga Sengezo Tshabangu, a self-styled former secretary general of the Citizens Coalition for Change (CCC) party has refiled his Supreme Court appeal against a High Court ruling blocking him from recalling members of the faction. His move has cut short celebrations by leaders of the party who were victims of his parliamentary position</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tshabangu-refiles-supreme-court-appeal-after-clerical-error/\">Tshabangu refiles Supreme Court appeal after clerical error</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Nurses’ union backs healthcare worker in viral video incident at Midrand clinic",
            "url": "https://www.newzimbabwe.com/nurses-union-backs-healthcare-worker-in-viral-video-incident-at-midrand-clinic/",
            "content": "The Citizen\n\nThe Young Nurses Indaba Trade Union (YNITU) hasexpressedits supportfora nurse who appeared in a controversial viral videorecordedby a Zimbabwean patient at Halfway House Clinic in Midrand on Thursday, 16 January.\n\nAccording to YNITUs media statement released on Friday, the widely shared video was carefully cropped to show only a portion of an hour-long confrontation.\n\nThe union emphasised that despite the heated exchange, the patients constitutional right to healthcare services was not denied.\n\nThe Nurses in South Africa through their vigorous training understands that section 27 of the Constitution provides that everyone has the right to have access to health care services, the unions statement read.\n\nAccording to the statement, the nurse reacted the way she did because she was provoked by the patient.\n\nShe reported this incident to her superior with no assistance and had no choice but to stand firm and defend herself.\n\nWatch the video below:\n\nAccording to YNITUs statement, the incident unfolded around 1 PM when the nurse, who had just completed her morning patient roster, was called back from lunch by her line manager to attend to additional patients.\n\nAmong them was a reportedly impatient individual demanding priority treatment.\n\nThe situation escalated when the Zimbabwean patient, described as a regular clinic user with a history of targeting the same nurse, entered the consulting room while filming.\n\nWitness statements gathered by the union said the patient demanded immediate attention and a referral to see a doctor at another facility, disrupting an ongoing consultation.\n\nYNITU said its investigation revealed that the confrontation turned physical, with the patient allegedly preventing the nurse from leaving the room to seek assistance.\n\nHowever, the viral video begins only after the nurse had managed to exit the room and was speaking with her line manager on the phone.\n\nWe understand and accept the presumption of innocence as the legal principle. However, in this instance, we are standing firmly behind the officer as a moral principle, YNITU secretary-general Lerato Mthunzi toldThe Citizen.\n\nMthunzi highlighted broader systemic issues, explaining: The South African health system is strained and the strain that the health system is experiencing is based on lack of human resources, material resources, and either a plethora of factors.\n\nIm highlighting the two because this is the main thing that causes the frustration of the community we serve and all the frustrations that are experienced by the community using public facilities.\n\nShe further pointed out that nurses, as frontline workers, often bear the brunt of public frustration.\n\nThe first line of attendance or the people in the front line are always nurses. Anger and those outbursts are projected on them. Incorrectly so, because all this frustration of lack of resources, you know, bad infrastructure and lack of material resources. Its the responsibility of the Department of Health that is not able to provide so that the healthcare system has got steady and sound processes and systems.\n\nDiscussing the impact on healthcare quality, Mthunzi noted that nurses often have to deal with a lot of patients with limited resources and capacity.\n\nWhen ratios are supposed to be maybe one is to 13 a day, a nurse would see more than 100 patients a day. And that compromises the quality of care that is given to them, to the patients.\n\nAnd I mean, then the treatment that is giving is that of substandard because its more on quantity rather than quality.\n\nAccording to the YNITU SG, the nurse has since pressed charges against the patient for assault.\n\nMthunzi also revealed that the patient also faces additional charges filed by another patient who was forced out of the consulting room during the incident.\n\nShe explained that demanding specific care and priority treatment is a common challenge: The issue of patients demanding that their care rendered to them is done the way they want, demanding referrals and wanting to be prioritised is a daily occurrence.\n\nLooking at solutions, Mthunzi concluded: Yes, I think on paper, we are a country that is very good at writing policies and systems, but implementation is the problem. Look, putting policies to prevent similar occurrences, that is, is there and it can still be proved or can be done.\n\nThe issue here is that our clinics need security. We need Management that is present, that is responsive when help is required.\n\nThe union emphasised that the incident highlights the need for a zero-tolerance policy against threats and assaults on healthcare workers, while also calling for improved security measures and management support in healthcare facilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/19200045/Screenshot_20250119-215559_1.jpg",
            "description": "<p>The Citizen The Young Nurses Indaba Trade Union (YNITU) has expressed its support for a nurse who appeared in a controversial viral video recorded by a Zimbabwean patient at Halfway House Clinic in Midrand on Thursday, 16 January. According to YNITU’s media statement released on Friday, the widely shared video was carefully cropped to show only a portion of an hour-long</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nurses-union-backs-healthcare-worker-in-viral-video-incident-at-midrand-clinic/\">Nurses’ union backs healthcare worker in viral video incident at Midrand clinic</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Mathe, Gidiza to beef up Dynamos technical team",
            "url": "https://www.newzimbabwe.com/mathe-gidiza-to-beef-up-dynamos-technical-team/",
            "content": "By Sport Reporter\n\nCastle Lager Premier Soccer League giants Dynamos have added Mark Mathe and Ronald Gidiza Sibanda to its technical team ahead of the 2025 season.\n\nMathe is coming in as an assistant coach, replacing Joel Lupahla who left the club for reigning league champions Simba Bhora where he has assumed the head coach role.\n\nSibanda is joining the side as the new team manager, taking over from Harry Lusengo, son of club owner Bernard Marriot.\n\nDembare is currently on a rebuilding exercise after a mass exodus which saw most senior players leaving including captain Frank Makarati.\n\nAs part of the rebuilding process Dembare has appointed Lloyd Mablanyo Chigowe as the substantive coach for the 2025 season, after he, as an interim coach, successfully guided the side to win the Chibuku Super Cup.\n\nMarthes appointment was a recommendation from Mablanyo and he joined the side coming from UD Songo FC in Mozambique where he was serving as an assistant coach.\n\nChigowe has roped in Mathe to be his first assistant coach.\n\nIt is the Clubs ambition to see the Glamour Boys challenge for every title we compete for and having faith in Mathes experience will help us achieve our goals.\n\nThe 49-year-old has valuable expertise having previously coached Chicken Inn, Bulawayo Chiefs, Highlanders, Harare City,CAPS United and Golden Eagles, read part of Dynamos statement.\n\nDembare had a chaotic 2024 season campaign which was manned by players strikes in protest of unpaid winning bonuses and sign-on fees.\n\nSibandas appointment as team manager saw him marking his return to the club since 1999 when he served as a player.\n\nDembare is basing on Gidizas experience in the football trenches for results in his new role at the club.\n\nDynamos Football Club is delighted to announce the appointment of our former midfielder Ronald Gidiza Sibanda as the Glamour Boys new Team Manager for the 2025 season.\n\nAs an accomplished former professionalfootballer with wealth of experience, the Club believes Gidizasappointment will help shore up our technical team, read Dynamos statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/21130535/giziza.jpg",
            "description": "<p>By Sport Reporter Castle Lager Premier Soccer League giants Dynamos have added Mark Mathe and Ronald Gidiza Sibanda to its technical team ahead of the 2025 season. Mathe is coming in as an assistant coach, replacing Joel Lupahla who left the club for reigning league champions Simba Bhora where he has assumed the head coach</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mathe-gidiza-to-beef-up-dynamos-technical-team/\">Mathe, Gidiza to beef up Dynamos technical team</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Zimbabwe cholera outbreak spreads to eight districts",
            "url": "https://www.newzimbabwe.com/zimbabwe-cholera-outbreak-spreads-to-eight-districts/",
            "content": "DW News\n\nZimbabwes ministry of health and child care has announceD that the currentcholeraoutbreak in the country has affected the districts of Bikita, Bindura, Chiredzi, Chipinge, Kariba, Goromonzi, Mazowe and Shamva.\n\nThe farming town Glendale in the Mazowe district, located about 70 kilometers north of Harare, is one of the epicentres of the outbreak.Residents there are appealing to the government to take urgent action to end the spread of the disease.\n\nGlendale residents are being forced to navigate pools of sludge after the government left burst pipes neglected for months. Human waste carrying disease agents have apparently been contaminating freshwater sources in Glendale and beyond.\n\nOn December 26, 2024, 10 members of one family in Glendale had to be rushed to the Tsungubvi Cholera Treatment Centre after they showed symptoms of the waterborne disease.\n\nThe Nyirongo family had been relying for years on their shallow well as their main source of water, but sewage had lately been seeping into the underground water supply as rains persisted across the country.\n\nIt rained heavily for two consecutive days on December 24 and 25 () leading to the contamination of our well with sewage, even before that, possibly, 71-year-old Erecta Nyirongo told media.\n\nWe hope they will supply us with clean water going forward to avoid these diseases.\n\nThroughout Zimbabwe  including the capital Harare, there are no reliable water sources at the moment, as raw sewage has been flowing into water sources amid the overall state of disrepair of the water system.\n\nSleiman Timios Kwidini, Zimbabwes deputy minister of health and child care, recently visited the Mazowe district to assess the extent of the cholera outbreak after one life was claimed there by the illness.\n\nKwidini says that the government has partnered with other organisations to drill two boreholes in Glendale.\n\nKwidini believes that some local wells can remain in use as the government is planning to provide tablets which are going to assist killing the bacteria, which is found in water.\n\nAlso, we are encouraging our community to boil water, even if its coming from a clean or protected water source () so that we reduce chances of getting cholera.\n\nThe deputy minister further highlighted that after inspecting toilets in communal ablution blocks, she found that the facilities are not properly sited.\n\nSo we have agreed that we are going to site them where it is proper, so that they do not mixwhere they get water and the toilets.\n\nIt is unclear, however, how long it might take to roll out these improvement plans.\n\nHygiene practices\n\nKudzai Masunda, a public health specialist at the private voluntary health organisation JF Kapnek Zimbabwe, is also calling for an improvement of hygienic practices in households and at the community level as part of overall efforts to contain cholera.\n\nCholera is mainly a waterborne disease and also afeco-orally communicable disease,meaning people get infected from what they consume. Thus, hygienic practices are important, said Masunda, who also serves as the secretary general of the Zimbabwe College of Public Health Physicians think tank.\n\nIf we want to eliminate cholera, we need to improve on water and sanitation within our suburbs and rural areas since the previous cholera outbreaks have also happened in the rural areas, he added.\n\nOne of the short-term measures that have already taken place to eliminate cholera is theuse of vaccinesto ensure we reduce incidences of cholera for at least three to four years while we embark on water and sanitation improvements that need to be done.\n\nMasunda added that thewhole of Africa has been hit bythe disease, with cholera cases reported in Burundi, Cameroon, Comoros, the Democratic Republic of the Congo, Ethiopia, Kenya, Malawi, Mozambique,Nigeria, South Africa, Tanzania, Uganda, Zambia and Zimbabwe, according to theWorld Health Organisation (WHO).\n\nZimbabwes last cholera outbreak according to the WHO was in 2023, with all the countrys 10 provinces reporting instances affecting a total of 62 districts.\n\nDuring that outbreak, the country recorded 34,549 suspected cases, 4,217 confirmed cases and 33,831 recoveries.\n\nThe countrys worst recorded cholera epidemic was in 2008 and 2009, which resultedin nearly 100,000 confirmed cases and 4,288 deaths, according to theWHO.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/24110127/cholera.webp",
            "description": "<p>DW News Zimbabwe’s ministry of health and child care has announceD that the current cholera outbreak in the country has affected the districts of Bikita, Bindura, Chiredzi, Chipinge, Kariba, Goromonzi, Mazowe and Shamva. The farming town Glendale in the Mazowe district, located about 70 kilometers north of Harare, is one of the epicentres of the outbreak. Residents</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-cholera-outbreak-spreads-to-eight-districts/\">Zimbabwe cholera outbreak spreads to eight districts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Zimbabwe gold shaft collapse kills seven people",
            "url": "https://www.newzimbabwe.com/zimbabwe-gold-shaft-collapse-kills-seven-people/",
            "content": "AFP\n\nPolice in Zimbabwe said on Monday that seven artisanal miners were killed in a disused gold shaft when it collapsed at the weekend.\n\nFew details were given on the circumstances of the collapse on Saturday in Bindura, about 85 kilometres (53 miles) north of the capital Harare.\n\nHowever police issued a warning against illegal mining activities.\n\nThe Southern African nation has vast reserves of platinum, diamonds, gold, coal and copper.\n\nIllegal mining\n\nDue to the floundering economy, illegal mining is rife and often takes place under dangerous conditions.\n\nPeople should refrain from conducting mining activities at illegal shafts and disused mine sites, police said on Monday.\n\nRecent heavy rains have saturated the ground making mines prone to collapse, police added.\n\nFive of the seven men have been identified, and are from 20 to 34 years of age, while next of kin were still being sought for two of the victims, police said.\n\nThere could be more victims\n\nPolice did not specify how many people were in the mine at the time of the collapse or whether others were missing, but other miners at the site told a local broadcaster that 15 people had been trapped.\n\nAccidents at illegal mines are common.\n\nAt least nine people were killed in September 2023 following a collapse in a mine in Chegutu, about 120 kilometres west of Harare.\n\nSaturdays deadly collapse comes after 87 bodies wereretrievedat an illegal mining operation in the neighbouring South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/21044051/mine.jpeg",
            "description": "<p>AFP Police in Zimbabwe said on Monday that seven artisanal miners were killed in a disused gold shaft when it collapsed at the weekend. Few details were given on the circumstances of the collapse on Saturday in Bindura, about 85 kilometres (53 miles) north of the capital Harare. However police issued a warning against illegal</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-gold-shaft-collapse-kills-seven-people/\">Zimbabwe gold shaft collapse kills seven people</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Trump orders US to leave World Health Organization",
            "url": "https://www.newzimbabwe.com/trump-orders-us-to-leave-world-health-organization/",
            "content": "BBC\n\nUS President Donald Trump has signed an executive order to begin the process of withdrawing the US from the World Health Organization (WHO).\n\nOooh, thats a big one, the newly inaugurated US president said as he approved the document after arriving back at the White House. It was one of dozens of executive actions he put his signature to on day one in office.\n\nThis marks the second time Trump has ordered the US be pulled out of the WHO.\n\nTrump was critical of how the international body handled Covid-19 and began the process of pulling out from the Geneva-based institution during the pandemic. President Joe Biden later reversed that decision.\n\nCarrying out this executive action on day one makes it more likely the US will formally leave the global agency.\n\nThey wanted us back so badly so well see what happens, Trump said in the Oval Office, referring to the WHO, perhaps hinting the US might return eventually.\n\nThe order said the US was withdrawing due to the organizations mishandling of the Covid-19 pandemic that arose out of Wuhan, China, and other global health crises, its failure to adopt urgently needed reforms, and its inability to demonstrate independence from the inappropriate political influence of WHO member states.\n\nThe executive order also said the withdrawal was the result of unfairly onerous payments the US made to the WHO, which is part of the United Nations.\n\nWhen Trump was still in office the first time around he was critical of the organization for being too China-centric in its tackling of the Covid-19 pandemic.\n\nTrump accused the WHO of being biased towards China in how it issued guidance during the outbreak.\n\nUnder the Biden administration the US continued to be the largest funder of the WHO and in 2023 it contributed almost one-fifth of the agencys budget.\n\nThe organizations annual budget is $6.8 billion (5.5 billion).\n\nPublic health experts have been critical of Trumps decision to leave the WHO, warning there could be consequences for Americans health.\n\nSome have suggested the move could reverse progress made on fighting infectious diseases such as malaria, tuberculosis and Hiv & Aids.\n\nAshish Jha, who formerly worked as Covid-19 response co-ordinator under President Biden, previously warned leaving would harm not only the health of people around the world, but also US leadership and scientific prowess.\n\nIts a cataclysmic presidential decision. Withdrawal is a grievous wound to world health, but a still deeper wound to the US, Lawrence Gostin, a global public health expert and Georgetown University professor said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/21043654/us-trump.webp",
            "description": "<p>BBC US President Donald Trump has signed an executive order to begin the process of withdrawing the US from the World Health Organization (WHO). “Oooh, that’s a big one,” the newly inaugurated US president said as he approved the document after arriving back at the White House. It was one of dozens of executive actions</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/trump-orders-us-to-leave-world-health-organization/\">Trump orders US to leave World Health Organization</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Hawks arrest man with explosives in his luggage at South Africa-Zimbabwe border",
            "url": "https://www.newzimbabwe.com/hawks-arrest-man-with-explosives-in-his-luggage-at-south-africa-zimbabwe-border/",
            "content": "IOL\n\nA 53-year-old foreign national is expected to appear in the Musina Magistrates Court in connection with alleged possession of explosives.\n\nThe Directorate for Priority Crimes Investigation (known as Hawks) said the man was arrested at the Beitbridge Port of Entry on January 17, 2025.\n\nIt is alleged that police stopped and searched a bus that was driven from Zimbabwe to South Africa, said Hawks spokesperson Warrant Officer Lethunya Mmuroa.\n\nDuring the search, the police found a piece of luggage on top of the fuel tank. When inspecting thoroughly, they noticed that the bag carried explosives.\n\nMmuroa the Musina-based bomb technicians from the Hawks Serious Organised Crime Investigation and Local Criminal Record Central was summoned to the scene.\n\nThe luggage was removed from the bus. They found three reels of detonating fuse of 350 meters each inside, valued at over R105,000, and a passport.\n\nThe police managed to identify the suspect through his passport and placed him under arrest.\n\nThe Provincial Head of the Directorate for Priority Crime Investigation in Limpopo Province Major General (Adv) Gopz Govender commended the team. This is a clear indication that law enforcement is winning a fight against transnational criminals, said Major General Govender.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/21043417/A-53-year-old-foreign-national-is-expected-to-appear-in-the-Musina-Magistrate-s-Court-for-alleged-possession-of-explosives-Picture-Hawks.webp",
            "description": "<p>IOL A 53-year-old foreign national is expected to appear in the Musina Magistrate’s Court in connection with alleged possession of explosives. The Directorate for Priority Crimes Investigation (known as Hawks) said the man was arrested at the Beitbridge Port of Entry on January 17, 2025. “It is alleged that police stopped and searched a bus</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hawks-arrest-man-with-explosives-in-his-luggage-at-south-africa-zimbabwe-border/\">Hawks arrest man with explosives in his luggage at South Africa-Zimbabwe border</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Navigating Visa Denials and Appeals",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-navigating-visa-denials-and-appeals/",
            "content": "NewZimbabwe.comhas invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, we want to continue with our discussion from last week on Immigration Law, our readers were asking for further understanding on foreign Visa applications specifically as they relate to reasons for denials and the appeal processes in various countries\n\nLet me start by asking what are the common reasons for visa being denied?\n\nVM: Thank you.\n\nWe touched on the issue briefly in my last interview with you.\n\nEach country has its own benchmark that has to be satisfied with visa applications. Further to the general benchmark set by the country of interest, each visa type, for example, visitors, working or asylum visa, has specific conditions that have to be met and the requirements are likely to be different from other visa types within the same country. It is essential that the applicant is able to discern the must-haves in the application and ensures that all the requirements of the must haves are included with supporting evidence or thoroughly explained.\n\nIn general terms, visa applications are denied because applicants have failed to satisfy the immigration officer reviewing the application that they qualify for the visa under the application. This could be as a result of failing to supply sufficient supporting information for the type of visa or where the country receiving the application utilizes a score point approach, a failure to score enough points for the visa. Incorrect or false information may also disqualify a person from securing a visa.\n\nPast activities like a criminal record or history of overstaying in the host country may hinder or reduce the chances of securing a visa as this portrays an applicant as an undesirable person.\n\nRELATED:Legal Discussions With Vengai Madzima: Foreign Visa Applications\n\nReporter: Can a person be denied a visa or entry into a country because of HIV status?\n\nVM: Each country will have its own requirements on the different visa categories on who can enter the country and can list the reasons and requirements for qualification.\n\nGenerally, international human rights laws discourage discrimination on the basis of HIV status. Countries that are signatories of human rights protocols are under obligation to treat all applicants equally and without discrimination. Should an applicant feel aggrieved by a decision based on their status, subject to the laws that land, I would encourage them to seek a review of that decision.\n\nReporter:In what circumstances should a person consider reapplying for a visa instead of appealing?\n\nVM: After having read and understood the reason for the visa denial and seeing that it will be impossible to gather sufficient information to satisfy the immigration officer in the period afforded to submit an appeal by the particular country, the applicant can opt to reapply as it affords them sufficient time to gather evidence and deal with the areas where the previous application fell short.\n\nThis also applies in situations where the initial application had insufficient supporting evidence. A reapplication affords the applicant the opportunity to submit an improved application with better chances of success. Reapplication however does not necessarily guarantee success, it improves the chances. Most countries have sections within their application forms which allow you to explain why the previous visa was declined.\n\nIn circumstances where a person was banned from reapplication, an appeal process may be the only option available where the country offers appeals against bans.\n\nReporter: In what circumstances will an appeal be the best option to take?\n\nVM: In cases where the applicant has been banned and the country offers an option to appeal the decision. In such a case, the appeal process will be the best option to address the banning where the applicant considers the decision to be unjustified.\n\nFurther, where the Applicant understands or fully comprehends the reasons the visa application was declined and is capable of getting the supporting information within the period afforded to submit an appeal, then an appeal may be the best route. It is important that the Applicant avoids mistakes in the appeal process and addresses all areas of concern,\n\nReporter: Can I appeal again if my visa application was refused on appeal?\n\nVM: Generally, most countries allow for one appeal. However, rules differ per country under application. Unless the visa denial also bans reapplication, the applicant has the option of reapplying and addressing in the fresh application all issues they neglected to address in the initial application and the appeal\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans living in the diaspora. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, we want to continue with our</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-navigating-visa-denials-and-appeals/\">Legal Discussions with Vengai Madzima: Navigating Visa Denials and Appeals   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Minister to pay US$100,000 for legal services provided during divorce 13 years ago",
            "url": "https://www.newzimbabwe.com/minister-to-pay-us100000-for-legal-services-provided-during-divorce-13-years-ago/",
            "content": "By Mary Taruvinga\n\nMINISTER of State for Mashonaland West Provincial Affairs and Devolution, Marian Chombo will pay US$100,000 to top lawyer Beatrice Mtetwas firm being legal fees for services rendered during her divorce 13 years ago.\n\nThis follows a High Court ruling by Justice Joel Mambara which compelled her to pay the fees despite her protestations.\n\nThe judge said Mtetwa and Nyambirai Law Firm had proven its case beyond reasonable doubt.\n\nThe law firm through top lawyer Beatrice Mtetwa successfully represented Marian during her divorce from former minister Ignatius Chombo back in 2011.\n\nThe court heard Marian engaged Mtetwa to represent her during acrimonious divorce proceedings that spanned several years.\n\nDespite receiving extensive legal services, the defendant failed to settle the agreed legal fees, leading to this action.\n\nThe defendants defences lacked merit and were inconsistent with her own admissions and actions.\n\nThe acknowledgement of debt remains binding, and the court disregards the belatedly raised defences, said the judge.\n\nCosts were claimed on the legal practitioner and client scale.\n\nThe judge also noted that Chombo was very honest and remorseful that she failed to pay for the services rendered.\n\nDespite the spurious defences raised in her papers, she made an undertaking to pay for the excellent legal services rendered by the defendant once she was in a position to pay.\n\nIn the result, the defendant is ordered to pay the plaintiff the sum of US$100,000 or its equivalent in Zimbabwean dollars at the prevailing exchange rate on the date of payment.\n\nThe defendant is ordered to pay interest at the prescribed rate from the date of summons to the date of full payment. The defendant shall pay the costs of suit, the judge ruled.\n\nMarian had acknowledged that the plaintiff had represented her diligently and that she had benefited from the legal services provided.\n\nShe, however, insisted that the fee claimed was unreasonable and suggested a reduced amount of US$50,000 as fair compensation.\n\nThe defendant testified that she made efforts to settle the debt by offering stands received from the divorce settlement.\n\nHowever, when the plaintiff attempted to verify the existence and value of the stands, it was discovered that the stand numbers provided did not correspond to any existing stands.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/28050901/WhatsApp-Image-2023-11-28-at-07.01.46-e1701148160606.jpeg",
            "description": "<p>By Mary Taruvinga MINISTER of State for Mashonaland West Provincial Affairs and Devolution, Marian Chombo will pay US$100,000 to top lawyer Beatrice Mtetwa’s firm being legal fees for services rendered during her divorce 13 years ago. This follows a High Court ruling by Justice Joel Mambara which compelled her to pay the fees despite her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-to-pay-us100000-for-legal-services-provided-during-divorce-13-years-ago/\">Minister to pay US$100,000 for legal services provided during divorce 13 years ago</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        },
        {
            "title": "Harare residents riled by council’s extravagance",
            "url": "https://www.newzimbabwe.com/harare-residents-riled-by-councils-extravagance/",
            "content": "By Darlington Gatsi\n\nHARARE residents feel the recent revelations of extravagance by top City Council officials is a slap in the face of ratepayers enduring poor service delivery.\n\nHarare City (HCC) council was embroiled in controversy after it emerged that its official, Mathew Marara is earning US$12 000, which includes allowances and other benefits.\n\nMarara, who rose to the position of ExecutiveAssistant to the Town Clerk under mysterious circumstances, disclosedhis salary at the ongoing Commission of Inquiry, which is probing HCCs operations.\n\nWith this new position, Marara was upgradedto grade 1b for salary earnings at the City Council.\n\nRELATED:Harare Town Clerks assistant rakes in US$12,000 per month while cash-strapped council fails to procure workers uniforms\n\nCombined Harare Resident Association (CHRA) director Ruben Akili said the revelations are a sign of failure in governanceandcalledfor widespreadreforms at the Town House.\n\nAs CHRA, the issue of Mr Marara is an indicator of a failing local government system. The local government system structures have not been performing up to standards, said Akili.\n\nResidents in Harare have been made to bear the brunt of maladministration and corruption of the City fathers enduring days with access to clean water.\n\nHeaps of uncollected garbage in residential areas which have become a common sight are a stern reminder of how the local authority has been failing to carry out its mandate.\n\nAkili said reforms in the laws that govern the local authorities will transform the cities.\n\nWe have been calling for local government reform for more than 3 decades as CHRA but again it has been facing resistance from those who are supposed then to ensure that there is good local governance and we end up setting up structures such as Commission of Inquiry.\n\nThere is a need to reform our local government system. Our local government system promotes corruption and does not promote the participation of citizens. Our local government system does not promote transparency and accountability in its format at the moment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/08041101/town-house1.jpg",
            "description": "<p>By Darlington Gatsi HARARE residents feel the recent revelations of extravagance by top City Council officials is a slap in the face of ratepayers enduring poor service delivery. Harare City (HCC) council was embroiled in controversy after it emerged that its official, Mathew Marara is earning US$12 000, which includes allowances and other benefits. Marara,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-riled-by-councils-extravagance/\">Harare residents riled by council’s extravagance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "22 Jan 2025"
        }
    ]
}