{
    "news": [
        {
            "title": "NMBZ draws down Afreximbank’s US$50 million loan facility",
            "url": "https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/",
            "content": "By Alois Vinga\n\nNMBZ Bank has begun drawing down Afreximbanks US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds.\n\nPresenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key economic sectors through improved access to offshore credit lines.\n\nNMBZ company secretary Violet Mutandwa\n\nDuring the quarter under review, the bank started drawing down on the US$50 million Afreximbank line with over US$25 million already disbursed to the mining and construction sectors. The Bank finalised a US$15 million Agrobond which was privately placed with a European Fund and will go towards supporting the agriculture sector, she said.\n\nDuring the period under review, the Group generated operating income of ZWG1.3 billion for the nine months to September 30, 2025.\n\nIn terms of the Groups core business, net interest income rose by 63% compared to the same period in 2024, driven by increased loans and advances to productive sectors and support for consumer needs. Core income streams remain resilient, supported by strong growth in loans and deposits, while management continues to prioritise revenue diversification and cost optimisation.\n\nThe Group incurred operating expenditure of ZWG1.1 billion, a 70% increase from the prior year. This variance primarily reflects the impact of strategic business reengineering initiatives undertaken during the year, including restructuring and staff rationalisation to align operations with the Groups strategic vision.\n\nTotal assets increased to ZWG9.2 billion, up 27% from ZWG7.3 billion recorded on December 31, 2024. The growth was anchored by an expansion in loans and advances, which stood at ZWG4.2 billion at the end of the quarter.\n\nThe domestic economy is projected to grow by 6.6% in 2025 in line with earlier projections in light of the sustained macroeconomic stability, record-high gold prices, growing remittances and a 12.8% rebound in agriculture following the 2024 El Nino.\n\nIn light of the above, the Group will continue to focus on supporting key sectors of the economy through its core business, Mutandwa added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/03034559/NMB-Bank.png",
            "description": "<p>By Alois Vinga NMBZ Bank has begun drawing down Afreximbank’s US$50 million loan facility, with the mining and construction sectors emerging as the biggest beneficiaries after absorbing 50% of the funds. Presenting a trading update for the third quarter ended September 30, 2025, NMBZ company secretary Violet Mutandwa said the facility has significantly supported key</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nmbz-draws-down-afreximbanks-us50-million-loan-facility/\">NMBZ draws down Afreximbank’s US$50 million loan facility</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "South Africa to lead global PGM supply rebound next year after dragged output",
            "url": "https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/",
            "content": "IOL\n\nLower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the worlds biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year.\n\nThe World Platinum Investment Council said on Wednesday that global PGM supplywas flatin the third quarter year on year weighed on by lower South African mineproduction.\n\nThis was after refined volumes fromValterra(formerly Anglo American Platinum) fell inSouth Africa.\n\nThis was reflective of a significant destocking of semi-finished inventory in Q324.\n\nImplats own refined production was, however, little changed year-on-year, although scheduled processing maintenance led to a further build in already elevated work-in-progress stocks.\n\nSouth African production contracted 2% year-on-year to 1 028 koz, said WIPC in a quarterly report.\n\nNonetheless, following the unusually high rainfall and flooding that disrupted South African mining operations earlier this year, as well as theprocessing constraints that curtailed refined volumes,PGMsupply is expected to recover over the latter half of the year.\n\nThe completionof maintenance at Implats South African smelters should allow some destocking of excess inventory that had been deferredearlier in the year, partly due to disruptions to water, power and hydrogen supply to the refineries, further noted WIPC.\n\nAlthough South African mine production is forecast to contract 5% to 3,945 koz, mine supply for PGM from the country is projected to rise by 2% year-on-year in 2026, with gains from South Africa and Zimbabwe partially offset by a modest decline from North America and Russia.\n\nOutput from major South African producers is expected to rise, with improved processing availability anticipated to support a modestincrease in output from Implats, aided by the drawdown of excess semi-finished inventory.\n\nInvestor sentiment in South African platinum miners and future pricing prospects has brightened with the commoditys recent good run in prices providing favourable momentum among fund managers.\n\nLong dogged by suppressed investor sentiment due to low prices and uncertainty that demand could be subdued due to popularity and uptake of electric vehicles, platinum group metals have been on a rebound in the past few weeks.\n\nThis is despite the World Platinum Investment Council saying earlier this year that full-year output will still be 6% lower than last year, since South African producers will not benefit from the large drawdown of work-in-process inventory that occurred last year.\n\nBesides the inclination towards platinum, the South African fund managers have exhibited lowpositioninginhealthcare,offshore,telecomandcash. Thebiggest fallswere recorded forheavyindustrialsand cash, according to Bank of America analysts.\n\nZimbabweanPGMproduction slipped 10% to 119 koz, largely reflecting significant destocking of semi-processed material at Unki, owned by Valterra.\n\nOutput from Zimplats,Zimbabweslargest producer, edged lower owing to furnace repairs.\n\nThus, PGM supply from Zimbabwe is expected to contract by 4% year-on-year to 493 koz, retreating from the record level achieved in 2024.\n\nThe decline primarily reflects the absence of a drawdown of semi-finished stock that boosted last years volumes, said WIPC.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/20044527/gold-platinum.jpg",
            "description": "<p>IOL Lower production from platinum group metals mines in South Africa muzzled global PGM supply in the third quarter although gains from the world’s biggest producers of the metal, including Zimbabwe, where Valterra, Impala Platinum and Sibanye-Stillwater operate, are expected to lift up supply by 2% next year. The World Platinum Investment Council said on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africa-to-lead-global-pgm-supply-rebound-next-year-after-dragged-output/\">South Africa to lead global PGM supply rebound next year after dragged output</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Nakamba relishing AFCON after captaining Zimbabwe to first win in over a year",
            "url": "https://www.newzimbabwe.com/nakamba-relishing-afcon-after-captaining-zimbabwe-to-first-win-in-over-a-year/",
            "content": "Luton Town\n\nLutonmidfielder Marvelous Nakamba captainedZimbabweto their first win in over 12 months as they defeatedQatar2-1 in a friendly in Doha on Monday night.\n\nThe Warriors, who currently sit 129th in the FIFA rankings, went into the contest against their 52nd-placed hosts, having not triumphed in their 11 previous matches, as they suffered three defeats in their World Cup qualifiers to Benin, Rwanda and Lesotho, drawing the other three group stage fixtures against Benin, Nigeria and South Africa as they finished bottom in the table.\n\nZimbabwe also lost two out of three friendlies to Burkina Faso and Algeria, with a 1-1 draw against Nigeria, as last year, they were beaten by Cameroon and drew with Kenya in the Africa Cup of Nations qualifying matches, meaning their last victory was a 3-1 success over Namibia on October 14, a match in which Nakamba was an unused substitute.\n\nThe former Aston Villa midfielder played five games in that time, as having been overlooked for the 3-1 friendly defeat against Algeria on Thursday, returned to the starting line-up against Qatar to win his 32nd cap. The hosts, under recently appointed manager Romanian Marian Marinica, who replaced Michael Nees a few weeks ago, fell behind when Mohamed Gouda scored on just nine minutes.\n\nHowever, Munashe Garananga equalised midway through the first half, with Belgian Pro League club Mechelen winger Bill Antonio grabbing a winner on 74 minutes to seal a long-awaited triumph. Writing on Instagram, then looking ahead to the Africa Cup of Nations which sees Zimbabwe take on Angola, Egypt and South Africa in Group B, the competition starting on December 21, with the first game against Egypt on Saturday, December 22, Nakamba believes the victory was a huge momentum going into the tournament.\n\nHe said: A BIG THANK YOU to all Zimbabweans who were rallying behind us back from home, all over the world and those in Qatar, Saudi Arabia who came out in numbers to support us during the international friendly matches. Without you, we feel incomplete. Thank you to the ZIFA leadership, led by the Zifa president Nqobile Magwizi for organising such kind of international friendlies matches. Thank you to the Minister of Tourism, Honourable Barbara Rwodzi, who took time to visit the team in camp and to watch us play against Algeria in Saudi Arabia on Thursday, even though we disappointingly lost that match 3-1.\n\nLastly, I want to thank the corporate world and all football stakeholders, we dearly need your support in everything we do, kindly chip in, help and support us. The victory against Qatar brings confidence and renewed zeal within the squad, especially with just a few weeks left before the prestigious AFCON tournament. As players, we always play with our hearts out, I believe with your support and if we all pull in one direction, we will get it right. This is the moment we need your support the most. Thank you, Zimbabweans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/04153736/nAKAMBA.jpg",
            "description": "<p>Luton Town Luton midfielder Marvelous Nakamba captained Zimbabwe to their first win in over 12 months as they defeated Qatar 2-1 in a friendly in Doha on Monday night. The Warriors, who currently sit 129th in the FIFA rankings, went into the contest against their 52nd-placed hosts, having not triumphed in their 11 previous matches, as they suffered three defeats</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nakamba-relishing-afcon-after-captaining-zimbabwe-to-first-win-in-over-a-year/\">Nakamba relishing AFCON after captaining Zimbabwe to first win in over a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Leaked letter to ZACC accuses High Court judge, top lawyer Thabani Mpofu of conflict of interest",
            "url": "https://www.newzimbabwe.com/leaked-letter-to-zacc-accuses-high-court-judge-top-lawyer-thabani-mpofu-of-conflict-of-interest/",
            "content": "By Staff Reporter\n\nHigh Court judge Priscilla Munangati-Manongwa and prominent lawyer Advocate Thabani Mpofu have been drawn into controversy after an anonymous whistle-blower accused them of a conflict of interest in a leaked letter seen by NewZimbabwe.com.\n\nThe letter, addressed to the Zimbabwe Anti-Corruption Commission (ZACC) and copied to the Judicial Service Commission, claims the alleged personal and professional links of the two compromise judicial impartiality.\n\nThe author, who says they are writing anonymously for fear of victimisation, alleges that Advocate Mpofu continues to take instructions from Munangati and Associates, a law firm they say still bears the judges name.\n\nI write to raise my concern over a serious conflict of interest between the above-mentioned court officials.\n\nDespite having a brother who works at Munangati and Associates, where I believe the Honourable Judge still has interests as her name still appears at the law firm, Advocate Mpofu takes instructions from the law firm and appears before Justice Munangati in those matters.\n\nThe whistle-blower argues that this arrangement is highly undesirable and grossly unfair to other litigants who will be in the dark about the relationship between the Honourable Judge and Advocate Mpofu.\n\nThe letter goes on to list several cases the author believes demonstrate the alleged conflict. Among them is HC 2312/24  Collin Zondai Makoni vs The State, which the writer says came [before] Justice Munangati despite the fact that it was from her law firm, involving lawyers Skumbuzo Mpofu and Skyvaine Vongai Tendere. This matter is pending decision pronouncement, the letter notes.\n\nThe whistle-blower also cites Thelma Chimbanga vs L Gono Enterprises (HC 1518/24), which they say was heard by the same judge despite originating from the same law firm, and is still awaiting a set down.\n\nAnother flagged case is Blue Star Logistics vs Harare Motorways (HC 8108/24), where Thabani Mpofu is representing the Applicant, with the author adding: I believe this anomaly is being overlooked since Thabani Mpofu and Webster Chiikwanha are the best of friends.\n\nThe author insists that Justice Munangati Manongwa should not hear any matters instructed to Advocate Mpofu by Munangati and Associates legal practitioners, urging ZACC to intervene because these allegations, which are very serious in nature be investigated so as to avoid prejudice to other litigants.\n\nThe writer further notes that this is not their first complaint to ZACC: Kindly note that I once wrote to your good office again on the 24th of June 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/27222834/Thabani-Mpofu1.jpg",
            "description": "<p>By Staff Reporter High Court judge Priscilla Munangati-Manongwa and prominent lawyer Advocate Thabani Mpofu have been drawn into controversy after an anonymous whistle-blower accused them of a conflict of interest in a leaked letter seen by NewZimbabwe.com. The letter, addressed to the Zimbabwe Anti-Corruption Commission (ZACC) and copied to the Judicial Service Commission, claims the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/leaked-letter-to-zacc-accuses-high-court-judge-top-lawyer-thabani-mpofu-of-conflict-of-interest/\">Leaked letter to ZACC accuses High Court judge, top lawyer Thabani Mpofu of conflict of interest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank",
            "url": "https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/",
            "content": "Channel Africa\n\nZimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the countrys monetary authorities.\n\nSpeaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the Zimbabwe Gold (ZiG) to operate as the countrys sole currency.\n\nThe present reserve level provides more than four times cover for reserve money, far above the minimum one-to-one backing required, but still insufficient for a mono-currency environment.\n\nOfficials stressed thatZimbabwes domestic currency must be fully backed by foreign currency reserves and precious mineralsto ensure stability and convertibility.\n\nWe need reserves that provide between three and six months of import cover for a mono-currency regime.To achieve that, Zimbabwe would require between 5 and 6 billiondollars.At the pace we are accumulating reserves, we are confident we can reach those levels, Gwanyanya said.\n\nMonetary authorities emphasised that while reserves are essential, macroeconomic stability is the decisive factor.\n\nWe need durable stability, price stability, and exchange-ratestabilityto restore trust in the currency. Stability for beyond one year is crucial for the market to accept a mono-currency arrangement,  he said.\n\nThe Reserve Bank attributes the increase to several factors, including:\n\nGold reserves currently stand at around 3.5 tonnes, and the authorities say the country has benefited from the global gold price rally.\n\nZimbabwe also continues to accumulate reserves through the foreign-currency surrender system, in which exporters convert part of their earnings into local currency.\n\nAt the rate we are accumulating these reserves, it is quite encouraging. Our exports are increasing, and this is what funds reserve accumulation.\n\nHowever, they cautioned that beyond building reserves, confidence in the ZiG and broader economic performance will determine the success of the 2030 single-currency target.\n\nOur economy has been performing to expectations, and in some cases exceeding expectations, despite external shocks. But stability remains the foundation for trust in the currency, Gwanyanya said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/23165932/Reserve-Bank-of-Zimbabwe.jpeg",
            "description": "<p>Channel Africa Zimbabwe will need up to $6 billion in reserves to fully transition to a mono-currency system by 2030, according to the country’s monetary authorities. Speaking in an interview with Channel Africa on Tuesday, Persistence Gwanyanya explained that although current reserves stand at $980 million, this remains far below what is required for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-needs-5-6-billion-in-reserves-to-shift-to-single-currency-regime-central-bank/\">Zimbabwe needs $5–6 billion in reserves to shift to single-currency regime: Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe strengthens integrated cancer services to improve women’s health",
            "url": "https://www.newzimbabwe.com/zimbabwe-strengthens-integrated-cancer-services-to-improve-womens-health/",
            "content": "WHO\n\nZimbabwe is intensifying efforts to improve the prevention, early detection and treatment of breast and cervical cancers by integrating cancer and chronic disease services into primary health care. This approach aims to bring essential health services closer to communities and ensure women have equitable access to quality care.\n\nCervical cancer accounts for almost 41% of all cancers among women in the country, followed by breast cancer at 13%, according to Zimbabwes National Cancer Registry. To address the burden, the Ministry of Health and Child Care (MoHCC), with support from the World Health Organisation (WHO) and partners, is implementing measures to strengthen integrated cancer services across the health system.\n\nIn July 2025, WHO handed over medical equipment worth US$20,000 to the MoHCC to support service delivery at the primary health level. The specialised equipment can be used to screen for noncommunicable diseases, including diabetes and hypertension.\n\nBuilding on this support, the MoHCC and WHO held training-of-trainers sessions in August 2025 for health professionals from Mashonaland West and Matabeleland South provinces.\n\nMany cancers are preventable. Let us spread the word and let all women know about it, says Esther Ngaru, one of the trainees and reproductive health officers at MOHCC.\n\nTwenty-five health professionals were trained on integrating the management of breast and cervical cancers, mental health and chronic diseases, as well as coordinated provision of prevention, screening, diagnosis, treatment and care services.\n\nThe trainers are disseminating this knowledge to frontline health workers to strengthen prevention, screening, and treatment at the community level.\n\nThanks to this training, our screening will be more effective than ever, says Audrey Musorowembudzi, a nurse at Hurungwe Rural Health Centre. At my facility, I will share this knowledge with my colleagues so that no woman is left behind.\n\nIn Karoi, a town in Mashonaland West Province, seven primary health care nurses and village health workers have already benefited from these trainings.\n\nVillage health worker Angeline Mukusa from Chigumbura Village says she will use the lessons learned to raise awareness in her community. Cancer is a major concern where I live, she says. I will encourage early detection and HPV vaccination for girls. Cancer is treatable if detected early and this will save many lives.\n\nAccording to the districts medical officer Dr Munyaradzi Chidaushe this approach is already improving service delivery. This work is transformative. Village health workers can identify and refer women suspected of breast or cervical cancer more easily. Prevention is key to protecting communities, he says.\n\nThese activities are part of the Womens Integrated Care for Cancer Services (WICS) project, led by the WHO Regional Office for Africa with support from Roche. Implemented in Cte dIvoire, Kenya and Zimbabwe, the project aims to strengthen integrated breast and cervical cancer services within primary health care. Zimbabwe was selected because its established cervical cancer programme provides a foundation for integrating additional services for cancer and chronic diseases.\n\nThrough the commitment of health workers, the leadership of MOHCC, and the support of WHO and partners, Zimbabwe is taking a decisive step towards reducing the burden of breast and cervical cancer, says Dr Desta Tiruneh WHO Representative in Zimbabwe. These efforts bring the country closer to a future where no woman dies from a preventable or treatable cancer and where health systems truly serve communities with equity and compassion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19142432/cancer-screening-zim.jpg",
            "description": "<p>WHO Zimbabwe is intensifying efforts to improve the prevention, early detection and treatment of breast and cervical cancers by integrating cancer and chronic disease services into primary health care. This approach aims to bring essential health services closer to communities and ensure women have equitable access to quality care. Cervical cancer accounts for almost 41%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-strengthens-integrated-cancer-services-to-improve-womens-health/\">Zimbabwe strengthens integrated cancer services to improve women’s health</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        },
        {
            "title": "Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander",
            "url": "https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda.\n\nMatatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO), Asher Walter Tapfumaneyi.\n\nTapfumaneyi had been named ZNA Chief of Staff in May.\n\nHis Excellency, the President of the Republic of Zimbabwe and Commander-in-Chief of the Zimbabwe Defence Forces, Cde Dr Emmerson Dambudzo Mnangagwa, acting in terms of section 216(2 of the Constitution of Zimbabwe as read with sections 7(1) and 8(2 of the Defence Act [Chapter 11:02], promoted Lieutenant Genera Emmanuel Matatu to the rank of General and appointed him Commander of the Zimbabwe Defence Forces with effect from 21 November 2025.\n\nThe appointment follows the retirement of outgoing Commander of the Zimbabwe Defence Forces, General Philip Valerio Sibanda, Rushwaya said\n\nSibanda is expected to take up a role in the ruling Zanu PF politburo.\n\nIn 2023, Mnangagwa briefly appointed him to the partys politburo before reversing the decision following a backlash from civil society. His appointment was scheduled for review at the end of his army tenure.\n\nWith tensions reportedly deepening over Mnangagwas succession, analysts view the elevation of his close allies to key military positions as a move to consolidate and secure his political interests.\n\nThe military played a pivotal role in the 2017 coup that propelled Mnangagwa to power, making control of the security sector crucial in maintaining his hold on the state.\n\nTapfumaneyi was placed under US sanctions in 2024 for his alleged role in disrupting the 2023 general elections through the Forever Association of Zimbabwe (FAZ), which was accused of intimidating voters at polling stations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/27184152/matatu.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has appointed Lt. General Emmanuel Matatu as the new Zimbabwe Defence Forces (ZDF) Commander following the retirement of General Philip Valerio Sibanda. Matatu, who was appointed Zimbabwe National Army (ZNA) Commander in March this year, will be replaced by former Deputy Director General of the Central Intelligence Organisation (CIO),</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-cio-boss-tapfumaneyi-takes-over-as-army-commander-as-matatu-is-named-new-zdf-commander/\">Ex-CIO boss Tapfumaneyi takes over as Army Commander as Matatu is named new ZDF Commander</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "20 Nov 2025"
        }
    ]
}