{
    "news": [
        {
            "title": "Wicknell Chivayo’s in-laws robber jailed 60 years",
            "url": "https://www.newzimbabwe.com/wicknell-chivayos-in-laws-robber-jailed-60-years/",
            "content": "By Staff Reporter\n\nBigboy Nampungo (27), who was part of an armed gang that robbed controversial businessman Wicknel Chivayos in-laws of US$74,000 has been jailed for 60 years by a Harare magistrate.\n\nNampungo was sentenced by magistrate Jesse Kufa after pleading guilty to the charges.\n\nHe was charged with six armed robbery counts and was given 10 years for each count.\n\nHe will, however, serve 30 years effectively as the sentencing for the counts will be running concurrently.\n\nNampungos suspected accomplices are Garikai Shangwa, Temptation Dinhidza, Arnold Tafirei, Tawanda Mushayatu and Mike Mhaka, Maramba Vhiya and Takudzwa Maisvoreva.\n\nThey are all denying the allegations and are currently at Harare remand prison awaiting finalisation of their case.\n\nProsecutor Shambidzeni Fungura said Nampugorobbed six people at the same house in Marondera.\n\nThe State, however, split each of the complainants ordeals into a charge, bringing the counts to six.\n\nThose who were robbed at Alpha and Omega farm are Zex Mutasha Rusike, Petros Mabhunu, Medic Zhakata, Tinotenda Shonhiwa, Gerald Muteke and Vimbai Muteke.\n\nIt is the States case that on March 18, 2025 at around 0100 hours, the accused persons and their accomplices who are still at large, hatched a plan to rob the complainants.\n\nIn pursuit of their plan, they proceeded to Alpha and Omega Farm in Marondera armed with three rifles, two pistols, two bolt cutters, machetes and iron bars.\n\nUpon their arrival, they confronted Mabunhu, the security guard, grabbed him and assaulted him with iron bars and booted feet all over the body, demanding to know the whereabouts of the other guards on duty, Mutsokoti said.\n\nThey tied his hands from behind and legs with cable ties. They marched him into the yard where they confronted Rusike who is employed at the farm as the internal security guard and they disarmed him of his CBC shotgun, force-marched him to the front guardroom.\n\nThey also confronted Zhakata who is a security guard, they struck him several times on the head with iron bars before they tied both his hands and legs with cable tiers, the State alleges.\n\nThe court heard that two of the security guards were left under the guard of two of the accused persons, armed with a pistol and an iron bar as the rest force-marched the other security guard to the main house.\n\nOn approaching the main entry, the accused allegedly cut the key on the burglar screen with a bolt cutter, forced open the main door and entered the house.\n\nThey allegedly went on to force open the kitchen door and force-marched the guard to Geralds bedroom where they met him in the passage and demanded cash.\n\nFearing for his life, he surrendered cash, US$18,000, a Sarsilmaz pistol loaded with eight rounds and two phones.\n\nThe accused persons then demanded to be shown the safe and on their way, they passed through Vimbais bedroom where they demanded cash and safe keys and she surrendered cash, US$1,100, a Chubb safe key and a Samsung Galaxy A35 without a SIM card.\n\nThey took her to the main bedroom where she opened the safe and surrendered cash US$55,000.\n\nWhilst the accused persons were still in the bedroom, Elphas Maruta, who was armed with a rifle loaded with four rounds, got information of the robbery and advanced towards the house and fired two shots towards the accused persons who also fired back three shots before they fled from the scene with the stolen property, Mutsokoti further told the court.\n\nAccording to the State, the stolen goods and properties amounted to US$74,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/25122450/chivayo-lulu.webp",
            "description": "<p>By Staff Reporter Bigboy Nampungo (27), who was part of an armed gang that robbed controversial businessman Wicknel Chivayo’s in-laws of US$74,000 has been jailed for 60 years by a Harare magistrate. Nampungo was sentenced by magistrate Jesse Kufa after pleading guilty to the charges. He was charged with six armed robbery counts and was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wicknell-chivayos-in-laws-robber-jailed-60-years/\">Wicknell Chivayo’s in-laws robber jailed 60 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Two killed in shootout with police, three arrested for murder of Bulawayo sergeant",
            "url": "https://www.newzimbabwe.com/two-killed-in-shootout-with-police-three-arrested-for-murder-of-bulawayo-sergeant/",
            "content": "By Tapiwa Svondo\n\nTwo suspects were killed in a gunfire exchange with police, and three have been arrested in connection with the murder of Sergeant Abel Masava and a series of armed robberies in Bulawayo.\n\nThe suspects, in an attempt to flee arrest, opened fire along Harrow Street, Saucetown and Sipho Ncube (24) and Dumisani Ndlovu (32) died in the shootout.\n\nMandlenkosi Albert Munangati (26), Clifford Desmond Nare (33), and Thabo Dube (24) were apprehended.\n\nMasava, a police officer, was gunned down in Sizinda on March 28 after confronting a group of five suspicious men.\n\nIn a statement, the ZRP Commissioner Paul Nyathi said they recovered the firearm which was used to kill Masava and other pistols used for other crimes.\n\nThe firearm used to kill the police officer has been recovered from the robbers.\n\nThe suspects are also linked to a spate of armed robbery cases in Bulawayo which occurred between 22nd April 2024 and 28th March 2025. On 30th March 2025 detectives received information which linked a Honda Fit vehicle, registration number AGG 8380 to the murder case and a spate of armed robbery cases in Bulawayo.\n\nThe detectives tracked the vehicle leading to the arrest of Mandlenkosi Albert Munangati. The suspect implicated the other suspects leading to their arrest and recovery of five firearms, National Browning pistol, Blow F92 Blank pellet gun, Long Rifle 12GA 76/3 inch long, Vizor Pistol, shot gun and a sword, said Nyathi.\n\nThe suspects are being linked to 25 cases of armed robbery including a case which occurred at a supermarket in New Luveve on 28th December 2024, where cash and three cellphones were stolen and another robbery case which occurred at a funeral parlour in Kelvin North, Bulawayo on 10th February 2025 where USD 3 608.00 and ZAR 21 130.00 cash and a cell phone were stolen.\n\nThe suspects are also clearing a case of robbery which occurred at a service station at the corner of Nketa Drive and Rangemore Road on 02nd March 2025 where a shotgun and a cellphone were stolen.\n\nInvestigations have revealed that the suspects were targeting service stations (fuel), liquor outlets, supermarkets, funeral parlours and gas operators.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02210058/masava.jpg",
            "description": "<p>By Tapiwa Svondo Two suspects were killed in a gunfire exchange with police, and three have been arrested in connection with the murder of Sergeant Abel Masava and a series of armed robberies in Bulawayo. The suspects, in an attempt to flee arrest, opened fire along Harrow Street, Saucetown and Sipho Ncube (24) and Dumisani</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-killed-in-shootout-with-police-three-arrested-for-murder-of-bulawayo-sergeant/\">Two killed in shootout with police, three arrested for murder of Bulawayo sergeant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Political and religious organisations want justice for Cwecwe",
            "url": "https://www.newzimbabwe.com/political-and-religious-organisations-want-justice-for-cwecwe/",
            "content": "eNCA\n\nSouth Africa  ANC Secretary General Fikile Mbalula has condemned the rape of Cwecwe, at her school in the Eastern Cape.\n\nThe seven-year-old girl was attacked on school premises while waiting for her scholar transport.\n\nThe Polices Head of Family Violence, Child Protection and Sexual Investigations Unit has been deployed to Matatiele to help with Cwecwes case.\n\nSAPS spokesperson Brigadier Athlenda Matheconfirmed this, saying the National Police Department has taken over the investigation.\n\nProtest marches against gender based violence and femicide, took place nationwide.\n\nThe South African Council of Churches in the Eastern Cape, has joined in and condemned the alleged violation of the little girl.\n\nThe country has grappled with pervasive rape and gender based violence for many years,that seems impossible to eliminate once and for all.\n\nIts a problem that has been acknowledged by those in power, but its clear the proposed interventions are not working.\n\nReverend Zukile Makula, chairperson of the South African Council of Churches in the Eastern Cape spoke to eNCA about this sensitive case that has the whole country in uproar.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02103609/Uyinene-Mrwetyana-Foundation-demands-urgent-action-for-Cwecwe-s-case.webp",
            "description": "<p>eNCA South Africa – ANC Secretary General Fikile Mbalula has condemned the rape of Cwecwe, at her school in the Eastern Cape. The seven-year-old girl was attacked on school premises while waiting for her scholar transport. The Police’s Head of Family Violence, Child Protection and Sexual Investigations Unit has been deployed to Matatiele to help</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/political-and-religious-organisations-want-justice-for-cwecwe/\">Political and religious organisations want justice for Cwecwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mutsvangwa says recent demotion of army commander meant to weaken Chiwenga – as factionalism threatens to rip Zanu PF apart",
            "url": "https://www.newzimbabwe.com/mutsvangwa-says-recent-demotion-of-army-commander-meant-to-weaken-chiwenga-as-factionalism-threatens-to-rip-zanu-pf-apart/",
            "content": "By Kingston Ndabatei\n\nZANU PF spokesperson Christopher Mutsvangwa has confirmed widely held assumptions that President Emmerson Mnangagwas recent redeployment of army commander Anselem Sanyatwe was meant to neutralise his deputy Constantino Chiwengas influence in the military.\n\nSanyatwe was the Zimbabwe National Army (ZNA) commander before being appointed as Sports Minister, replacing International Olympic Committee (IOC) president-elect Kirsty Coventry in cabinet.\n\nHe was replaced by Lieutenant General Emmanuel Matatu, who is believed to be Mnangagwas homeboy and a close associate of his ally Zimbabwe Defence Forces (ZDF) Commander Valerio Sibanda.\n\nAlthough government communication has insinuated that his was a promotion, power struggles within the ruling party indicate Mnangagwa has considerably weakened his deputy and rival Chiwengas influence in the army.\n\nMutsvangwa, who spoke to journalists on Tuesday, described last weeks announcement that Sanyatwe had been immediately retired, appointed minister and quickly sworn in as dramatic.\n\nHe said that was meant to ensure loyalty as protests that had been announced by war veteran Blessed Geza on March 31 approached.\n\nThe unwritten fear had been that the army would listen to Gezas calls and participate in the ouster of President Emmerson Mnangagwa as is being demanded.\n\nTo make sure that the state apparatus was in safe hands, he (Mnangagwa) made dramatic changes in its (army) structure, said Mutsvangwa.\n\nI want to congratulate the new leaders who were put in place as we approached the 31st of March.\n\nThey have proved their mettle by making sure that they are loyal to the people of Zimbabwe, they defend the interests of the people of Zimbabwe and that they keep the professional traditions of our state apparatus.\n\nMutsvangwa is not only on Mnangagwas side of the fight, but also harbours presidential aspirations.\n\nHe was recently recorded by a UK based investigative publication laying into Chiwenga, calling him daft, unelectable and evil.\n\nAnalysts have pointed to the possibility of another coup as factionalism within the party heats up. Pride Mkono described Mnangagwas appointments as simple coup-proofing.\n\nGeza, widely believed to be under the protection of Chiwenga, has been in hiding for over three weeks and riling up the masses through social media to rise up and depose Mnangagwa even before he finishes his second term.\n\nThe argument being put forward by Geza is that Mnangagwa has been corrupted by elements he keeps around him. The outspoken former Central Committee member in Zanu PF who has been publishing videos periodically, is campaigning for Chiwenga to take over power.\n\nMondays protest turned into a stay away, after people excused themselves from the fight and chose to watch and follow online. Only about 98 were arrested for participating in a gathering with the intent to promote violence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Kingston Ndabatei ZANU PF spokesperson Christopher Mutsvangwa has confirmed widely held assumptions that President Emmerson Mnangagwa’s recent ‘redeployment’ of army commander Anselem Sanyatwe was meant to neutralise his deputy Constantino Chiwenga’s influence in the military. Sanyatwe was the Zimbabwe National Army (ZNA) commander before being appointed as Sports Minister, replacing International Olympic Committee (IOC)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutsvangwa-says-recent-demotion-of-army-commander-meant-to-weaken-chiwenga-as-factionalism-threatens-to-rip-zanu-pf-apart/\">Mutsvangwa says recent demotion of army commander meant to weaken Chiwenga – as factionalism threatens to rip Zanu PF apart</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Former City of Harare bosses up for US$465,000 fraud in failed Mbare bio-digester project",
            "url": "https://www.newzimbabwe.com/former-city-of-harare-bosses-up-for-us465000-fraud-in-failed-mbare-bio-digester-project/",
            "content": "By James Muonwa\n\nTWO former top officials at City of Harare (CoH) have been dragged to court for allegedly awarding a US$465,290 tender to an undeserving company.\n\nThe contract was for the establishment of a biodigester in Mbare, Harare after the municipality secured 350,000 from the European Union (EU)\n\nAccused persons, former Director of Works Phillip Mabingo Pfukwa (75) and ex-Chamber Secretary Josephine Ncube (62) appeared at the Harare Regional Anti-Corruption Magistrates Court.\n\nThe court heard that sometime in 2013, CoH got a grant from the EU for the design and construction of biogas digesters and the installation of a 100KVA biogas generator for the Mbare Biogas Project.\n\nThe procurement process, which was expected to be transparent, was overseen by the Town Clerk and the procurement committee.\n\nHowever, in March 2015 after receiving four bids, then Director of Works and Chamber Secretary by-passed procurement procedures and unlawfully awarded the tender to Synlak (Private) Limited, a company owned by Moses Mpofu. This was despite that the applicant failed to meet standard requirements.\n\nPfukwa and Ncube are also accused of falsifying internal memos and misrepresenting Synlaks eligibility, thereby ensuring the undeserving firm won the contract.\n\nState further alleges that in December 2015, Ncube fraudulently signed off the contract, allowing Synlak (Pvt) Ltd to receive full payment of US$465,290 despite the company failing to deliver on the project.\n\nThe duo was remanded to May 14 pending indictment at the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25025158/Harare-Town-House.png",
            "description": "<p>By James Muonwa TWO former top officials at City of Harare (CoH) have been dragged to court for allegedly awarding a US$465,290 tender to an undeserving company. The contract was for the establishment of a biodigester in Mbare, Harare after the municipality secured €350,000 from the European Union (EU) Accused persons, former Director of Works</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-city-of-harare-bosses-up-for-us465000-fraud-in-failed-mbare-bio-digester-project/\">Former City of Harare bosses up for US$465,000 fraud in failed Mbare bio-digester project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "ZEC appoints new Chief Elections Officer",
            "url": "https://www.newzimbabwe.com/zec-appoints-new-chief-elections-officer/",
            "content": "By James Muonwa\n\nTHE Zimbabwe Electoral Commission (ZEC) has appointed Simbarashe Tongayi as the new substantive Chief Elections Officer.\n\nTongayi replaces Utoile Silaigwana, who was retired last year and appointed Commissioner in the Zimbabwe Prisons and Correctional Service (ZPCS) Commission.\n\nZEC announced the latest development at the elections management body in a statement on Tuesday.\n\nThe Zimbabwe Electoral Commission (ZEC) is pleased to announce the appointment of Mr Simbarashe Tongayi as its new substantive Chief Elections Officer (CEO) with effect from 1 April 2025.\n\nMr Tongayi has been the ZEC Acting CEO since December 2024. He also served as the Deputy CEO responsible for Administration, where he played a pivotal role in streamlining administrative processes and enhancing organisational efficiency, ZEC said.\n\nTongayi is a seasoned public administration and election management expert with experience in both regional and international elections.\n\nHis wealth of experience positions him to lead ZEC in achieving its long-term goals.\n\nBefore joining the Commission, Mr Tongayi was the General Manager Human Resources and Administration for the National Peace and Reconciliation Commission (NPRC). He spent over a decade within the Public Service Commission (PSC) secretariat, where he served as a Deputy Manager and District Human Resources Manager, further reads the statement.\n\nTongayi is a final year Doctorate student in Strategic Management with the Chinhoyi University of Technology. He is a holder of a Masters Degree in Human Resources as well as another Masters Degree in Peace, Leadership and Conflict Resolution. He recently completed a Masters of Science Degree in Defence and Security Studies.\n\nHe is also a holder of a Bachelor of Science Degree in Social Work as well as being a Building Resources in Democracy, Governance and Elections (BRIDGE) accredited facilitator.\n\nZEC is excited to embark on this new phase under Mr Tongayis leadership and is confident in his ability to lead the organization to new heights.\n\nThe Chairperson, Deputy Chairperson, Commissioners and the whole Secretariat congratulate Mr Tongayi on his new appointment, said the electoral body.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/02052426/simba-tongayi.jpeg",
            "description": "<p>By James Muonwa THE Zimbabwe Electoral Commission (ZEC) has appointed Simbarashe Tongayi as the new substantive Chief Elections Officer. Tongayi replaces Utoile Silaigwana, who was retired last year and appointed Commissioner in the Zimbabwe Prisons and Correctional Service (ZPCS) Commission. ZEC announced the latest development at the elections management body in a statement on Tuesday.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zec-appoints-new-chief-elections-officer/\">ZEC appoints new Chief Elections Officer </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Zim Diaspora Property Showcase: Seeff Properties floats lucrative deals for diasporans in US, Canada",
            "url": "https://www.newzimbabwe.com/seeff-properties-floats-lucrative-deals-for-diasporans-in-us-canada/",
            "content": "By Alois Vinga\n\nSeeff Properties says Zimbabweans in the United States and Canada must take advantage of lucrative property management products and other services, easing burdensome responsibilities on their part.\n\nSpeaking ahead of the Zim Diaspora Property Showcase scheduled to take place at The Westin Hotel, Dallas Fort Worth, Texas, USA, from the 25thto the 27thof April 2025, Seeff Properties Managing Director, Patience Patongamwoyo encouraged the diaspora community to seize the available opportunities.\n\nWe offer property management services which involve agency management of rental properties on behalf of landlords, whether they are present or absent. This includes: placing suitable tenants, collecting rent, and overseeing repairs and maintenance.\n\nWe represent the landlords interests while adhering to Zimbabwean law. Essentially, we handle all aspects of property administration, providing peace of mind to landlords, she said.\n\nPatongamwoyo said over and above the services, Seeff Properties specializes in property management, purchases and sales, valuations, Real Estate Advisory, property development and project management.\n\nSeeff Properties has a traceable reputation of acting as a reliable partner and addressing the challenges diasporans face in managing their property affairsback home.\n\nAs a real estate agency, we connect buyers with sellers. Many of our listed developments offer flexible payment terms. We guide buyers through the available options, helping them find arrangements that align with their financial situations.\n\nWe understand the importance of your investments back home. Trust Seeff Properties to be your reliable partner, ensuring your property goals are achieved with professionalism and integrity. We are looking forward to the Zim Diaspora Property showcase, and to meeting you, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23073043/SEEFFUK-24143of205-scaled.jpg",
            "description": "<p>By Alois Vinga Seeff Properties says Zimbabweans in the United States and Canada must take advantage of lucrative property management products and other services, easing burdensome responsibilities on their part. Speaking ahead of the Zim Diaspora Property Showcase scheduled to take place at The Westin Hotel, Dallas Fort Worth, Texas, USA, from the 25th to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seeff-properties-floats-lucrative-deals-for-diasporans-in-us-canada/\">Zim Diaspora Property Showcase: Seeff Properties floats lucrative deals for diasporans in US, Canada</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "UN Rights experts slam Zimbabwe’s prolonged pretrial detentions; judicial interference",
            "url": "https://www.newzimbabwe.com/un-rights-experts-slam-zimbabwes-prolonged-pretrial-detentions-judicial-interference/",
            "content": "By Alois Vinga\n\nTHE United Nations (UN) Human Rights Committee has urged authorities to align pretrial detentions with international best practices, an end to judicial interference, among other rights-related recommendations.\n\nIn a report published Tuesday, the Committee on Civil and Political Rights (CCPR), also known as the UN Human Rights Committee, established a number of gaps after analyzing progress made by Zimbabwe in the implementation of the International Covenant on Civil and Political Rights (ICCPR) by its State Parties.\n\nThe recommendations coincide with a series of complaints raised by a number of arrested rights activists who believe they were placed in unfair pretrial detentions.\n\nThere is a need to ensure that pretrial detention is reviewed in a prompt, thorough and impartial manner by the relevant judicial authorities, including through the effective implementation of the right to habeas corpus, and that anyone detained arbitrarily is released without conditions and is adequately compensated, the report reads.\n\nThe Committee expressed concerns about reports of threats, intimidation, and dismissal of judges who issue rulings that are unfavorable to the government. It raised concerns about the persistent shortage of judges, which contributes to significant delays in the administration of justice, particularly in high-profile cases related to human rights violations and corruption.\n\nThe State Party must take immediate steps to prevent and eradicate all threats, intimidations and other forms of undue influence on the judiciary by the executive branches of government and to ensure in law and in practice the full independence and impartiality of judges, including by adopting procedures for the selection, appointment, promotion, sanction and removal of judges that are transparent and impartial, the report added.\n\nWhile commending the measures taken by the State party to enhance judicial efficiency and reduce case backlogs through the rollout of the Integrated Electronic Case Management System and the decentralisation of the High Court, the Committee noted the barriers to accessing this system due to low smartphone and internet coverage, high data costs and digital literacy gaps, particularly in rural communities.\n\nThe report also challenged the Statepartyto elucidate all cases of enforced disappearances and conduct impartial and thorough investigations without delay, ensuring that the victims and their relatives are informed of the progress and results of the investigation.\n\nIt called for the identification of those responsible and ensuring that they are prosecuted and, if convicted, punished with appropriate penalties that are commensurate with the gravity of their crimes and that victims of enforced disappearance and their families are provided with full reparation.\n\nThe experts said the government should allocate sufficient human and financial resources to the Zimbabwe Human Rights Commission to enable it to discharge its mandate effectively and independently, including plans to enhance its field presence in full compliance with the principles relating to the status of national institutions for the promotion and protection of human rights (the Paris Principles).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/25092442/prisoners-.png",
            "description": "<p>By Alois Vinga THE United Nations (UN) Human Rights Committee has urged authorities to align pretrial detentions with international best practices, an end to judicial interference, among other rights-related recommendations. In a report published Tuesday, the Committee on Civil and Political Rights (CCPR), also known as the UN Human Rights Committee, established a number of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-rights-experts-slam-zimbabwes-prolonged-pretrial-detentions-judicial-interference/\">UN Rights experts slam Zimbabwe’s prolonged pretrial detentions; judicial interference</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mnangagwa grooming Tagwirei for Presidency – Geza",
            "url": "https://www.newzimbabwe.com/mnangagwa-grooming-tagwirei-for-presidency-geza/",
            "content": "By Darlington Gatsi\n\nAFTER being recommended for a Central Committee post by ZANU PFs Harare Province, war veteran Blessed Geza has claimed that Kudakwashe Tagwirei is being clandestinely groomed to take over the presidency by President Emmerson Mnangagwa, thwarting his deputy Constantino Chiwengas leadership ambitions.\n\nTagwirei is manoeuvring into the structures of the ruling party after his name was put forward by the provincial leadership to assume a role in the Central Committee, one of the partys most powerful organs.\n\nHowever, the move has not gone down well with the militant Geza, who has lashed out at Tagwirei.\n\nThe last time I mentioned that you (Tagwirei) have monopolised government contracts. We know all about this corruption.\n\nWhere you are now goinginto politicsdo not undermine me. You are conniving with Mnangagwa to become president  now you want to lead the country through the back door, said Geza.\n\nZANU PF is at loggerheads, with one faction pushing for Mnangagwa to retain the presidency beyond 2030, while another supports Chiwenga to succeed the octogenarian leader.\n\nTagwirei has been accused of benefiting from his close ties to Mnangagwa through lucrative government contracts.\n\nHe secured a multimillion-dollar deal to construct the Mbudzi Interchange flyover and has expanded his business empire into mining while maintaining a near-monopoly in the fuel sector.\n\nAdditionally, Tagwirei has been leading the Command Agriculture programme and currently chairs the Land Tenure Implementation Committee.\n\nGeza accused Tagwirei of seeking to reverse the land reform programme.\n\nWhere have you ever seen a genuine programme being overseen by two banks? This issue of trying to reverse the land reform programmeleave it, added Geza.\n\nEfforts to get a comment from Tagwirei were futile as he had not responded to questions sent to him by the time of publishing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/03/17054811/Kuda-Tagwirei.jpg",
            "description": "<p>By Darlington Gatsi AFTER being recommended for a Central Committee post by ZANU PF’s Harare Province, war veteran Blessed Geza has claimed that Kudakwashe Tagwirei is being clandestinely groomed to take over the presidency by President Emmerson Mnangagwa, thwarting his deputy Constantino Chiwenga’s leadership ambitions. Tagwirei is manoeuvring into the structures of the ruling party</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-grooming-tagwirei-for-presidency-geza/\">Mnangagwa grooming Tagwirei for Presidency – Geza </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        },
        {
            "title": "Mnangagwa’s regime panics – forces police officers to sign loyalty forms",
            "url": "https://www.newzimbabwe.com/mnangagwas-regime-panics-forces-police-officers-to-sign-loyalty-forms/",
            "content": "By Kingston Ndabatei\n\nZIMBABWE Republic Police (ZRP) officers have been forced to sign loyalty forms that declare that they will not go against any order given by Commissioner General Stephen Mutamba, NewZimbabwe.com has learnt.\n\nThe forms, one of which was seen by NewZimbabwe.com, were being circulated across police stations and posts across the country before and after Mondays stay away.\n\nPresented as an Oath of Service, the form follows a US$50 unexplained allowance to all ZRP officers, which was deposited days before war veteran Blessed Gezas March 31stdemonstration.\n\nI will faithfully, truly and to the best of my judgment, skill and ability, execute and perform the duties required of me as a member of the ZRP, reads part of the oath.\n\nI will not, without due authority, disclose or make known any matter that comes to my knowledge by reason of such employment.\n\nOn Monday, police officers patrolled virtually empty streets in most of Zimbabwes towns as citizens chose to stay away from a demonstration organised by war veterans protesting President Emmerson Mnangagwas proposed illegal stay in power till 2030.\n\nAdds the oath of service: As a police officer, I shall be deemed to be available for duty at all times and may at any time be assigned by the Commissioner General of Police to any post, department, section or station within any part of Zimbabwe to perform any function conferred upon or assigned to me.\n\nPolitical Analyst Pride Mkono said these forms were not a surprise as Mnangagwas regime was fast realising that its exit was now closer.\n\nThis is part of a cocktail of strategies employed by authoritarian regimes. In Zimbabwe, they come ahead of possible uprising given how unpopular the Zanu PF regime has become, said Mkono.\n\nYou will probably see a lot of other deployments in other state security agencies. This is not shocking; Mnangagwa knows that his exit is closer.\n\nIt is a sign that his regime is panicking. This regime consolidation is coming at a time when factionalism has ripped apart the ruling party.\n\nGeza had, in publicly shared addresses, called on state security agents to stand with the people in unseating Mnangagwa, who wants to stay in power beyond his constitutionally mandated two terms.\n\nHe promised better working conditions and improved wages, comparing his promises to the US$50 allowance given to the officers.\n\nDespite his promises, truckloads of button-stick-wielding anti-riot officers could be seen crisscrossing Harare, Masvingo and Bulawayo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/14031149/Riot-Police.png",
            "description": "<p>By Kingston Ndabatei ZIMBABWE Republic Police (ZRP) officers have been forced to sign loyalty forms that declare that they will not go against any order given by Commissioner General Stephen Mutamba, NewZimbabwe.com has learnt. The forms, one of which was seen by NewZimbabwe.com, were being circulated across police stations and posts across the country before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-regime-panics-forces-police-officers-to-sign-loyalty-forms/\">Mnangagwa’s regime panics – forces police officers to sign loyalty forms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "03 Apr 2025"
        }
    ]
}