{
    "news": [
        {
            "title": "Sables Rugby Africa Cup squad named",
            "url": "https://www.newzimbabwe.com/sables-rugby-africa-cup-squad-named/",
            "content": "By Sports Reporter\n\nZimbabwe senior mens rugby team coach Piet Benade has officially announced the Sables squad for the 2025 Rugby Africa Cup, which kicks off in Uganda next week.\n\nThe prestigious continental tournament will run from the 8thto the 19thof July, with all games scheduled to be played at Mandela National Stadiumin Kampala\n\nAs defending champions, Zimbabwe enters the tournament as clear favourites, having lifted the trophy in Kampala last year.\n\nBenade has retained most of the 2024 championship-winning squad while welcoming several influential additions.\n\nSpeedster Matthew McNab, gritty Jason Fraser, and kicking stalwart Lenience Tambwera make their return to the green-and-white hoops, bringing further experience and depth ahead of what could be a history-making campaign.\n\nIf Zimbabwe wins this years Rugby Africa Cup, they will automatically qualify for the 2027 Rugby World Cup, an opportunity which team captain Hilton Mudariki is eyeing.\n\nThis is a golden ticket opportunity for Zimbabwean rugby, but we are not getting ahead of ourselves.\n\nDue to the nature of the Africa Cup, every game is a final.\n\nThe only way to reach the top is by staying grounded, sticking to our systems, and respecting every opponent, said Mudariki.\n\nZimbabwe faces Morocco in their opening match on the 8th of July and the winner will qualify for the semi-final, which will be between the winner of the East African match between hosts Uganda and Kenya.\n\nThe Sables are scheduled to leave the country on Saturday for the tournament and will have two training sessions in Uganda before their opening match.\n\nZIMBABWE SABLES SQUAD  RUGBY AFRICA CUP 2025\n\nHookers\n\nBryan Chiang\n\nSimbarashe Mandioma\n\nLiam Larkan\n\nProps\n\nVictor Mpunga\n\nTyran Fagan\n\nZvikomborero Chimoto\n\nCleopas Kundiona\n\nBrian Makamure\n\nBornwell Gwinji\n\nSecond Row\n\nKudakwashe Nyakufaringwa\n\nSimbarashe Siraha\n\nTadiwanashe Gwashu\n\nBrian Nyaude\n\nBack Row\n\nAiden Burnett\n\nDylan Utete\n\nJason Fraser\n\nGodfrey Muzanargwo\n\nTinotenda Mavesere\n\nHalf Backs\n\nHilton Mudariki (Captain)\n\nKeegan Joubert\n\nIan Prior\n\nLenience Tambwera\n\nTyrone Gombe\n\nCentres\n\nBrandon Mudzekenyedzi\n\nDion Khumalo\n\nKudzai Mashawi\n\nOutside Backs\n\nTrevor Gurwe\n\nMatthew McNab\n\nTapiwa Mafura\n\nTakudzwa Musingwini\n\nEdward Sigauke\n\nTECHNICAL TEAM\n\nHead Coach: Pieter Benade\n\nAssistant Coaches: Ricky Chirengende\n\nConsultant: Gert Smal\n\nDefense Coach: Senna Esterhuizen\n\nForwards & Scrum Coach: Joel Carew\n\nStrength & Conditioning: Ghafoer Luckan\n\nGeneral Manager: Takunda Chifokoyo\n\nTeam Manager: Tichafara Makwanya\n\nTeam Doctor: Dr. Tapfuma Parirenyatwa\n\nTeam Physiotherapists: Shumirai Tererai, Alice Becker\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27175857/rugby-africa.jpg",
            "description": "<p>By Sports Reporter Zimbabwe senior men’s rugby team coach Piet Benade has officially announced the Sables squad for the 2025 Rugby Africa Cup, which kicks off in Uganda next week. The prestigious continental tournament will run from the 8th to the 19th of July, with all games scheduled to be played at Mandela National Stadium in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-rugby-africa-cup-squad-named/\">Sables Rugby Africa Cup squad named</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "Not even Chitepo would go there – says Mpofu, as details emerge Zanu PF School of Ideology is set to be part of High Court judges’ training",
            "url": "https://www.newzimbabwe.com/not-even-chitepo-would-go-there-says-mpofu-as-details-emerge-zanu-pf-school-of-ideology-is-set-to-be-part-of-high-court-judges-training/",
            "content": "By Leopold Munhende\n\nZANU PF, through its Herbert Chitepo School of Ideology, is set to train High Court judges, with seasoned lawyer Thabani Mpofu declaring that the late war hero, after whom the institution is named, would not even attend it.\n\nThe much-feared Central Intelligence Organisation (CIO) is also set to take part in what has been termed an induction at the Harare International Conference Centre between 4 and 5 July this year.\n\nIshmael Mada, the Chitepo School of Ideology principal, will speak on the 4th of July after lunch.\n\nAny attempt to impose partisan ideology on judges through training programmes conducted by the Herbert Chitepo School of ideology would undermine the rule of law and erode public trust, said Mpofu.\n\nI mean not even Chitepo himself would abase himself to the point of receiving training from this school named after him.\n\nMpofus comments come as Zimbabwes judiciary fails to shrug off claims that it is captured by Zanu PF and operates at its whim or demand.\n\nFurther inviting the partys school of ideology to a public function meant for the training of judicial officers worsens their standing.\n\nLawyers have planned a protest march to the High Court on Thursday.\n\nAdded Mpofu: As legal professionals, we must uphold the integrity of the judiciary and ensure its independence.\n\nWe stand in defense of judicial independence, honouring the legacy of those who fought for justice and fairness.\n\nIn Chitepos name, lets collectively rage against this unnecessary attack on judicial independence.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02062020/chitepo-school.jpg",
            "description": "<p>By Leopold Munhende ZANU PF, through its Herbert Chitepo School of Ideology, is set to train High Court judges, with seasoned lawyer Thabani Mpofu declaring that the late war hero, after whom the institution is named, would not even attend it. The much-feared Central Intelligence Organisation (CIO) is also set to take part in what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-even-chitepo-would-go-there-says-mpofu-as-details-emerge-zanu-pf-school-of-ideology-is-set-to-be-part-of-high-court-judges-training/\">Not even Chitepo would go there – says Mpofu, as details emerge Zanu PF School of Ideology is set to be part of High Court judges’ training</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "Company executives arrested for manufacturing illicit ethanol-laced brews",
            "url": "https://www.newzimbabwe.com/company-executives-arrested-for-manufacturing-illicit-ethanol-laced-brews/",
            "content": "By Staff Reporter\n\nPolice have arrested seven executives whose companies were manufacturing illicit ethanol-laced brews.\n\nIn a brief statement Tuesday, the Zimbabwe Republic Police (ZRP) confirmed the arrests, without giving further details.\n\nThe ZRP has arrested seven company executives for manufacturing illicit brews using ethanol, water, flavours and supplying them to the public and shops in the country. More details to be released in due course, ZRP national spokesperson, Commissioner Paul Nyathi said.\n\nMeanwhile, ZRP reports that Runesu Emmanuel (37) and Tinashe Chivende (27) were arrested for unlawful dealing in dangerous drugs on June 28, 2025.\n\nPolice in Beitbridge acted on received information and intercepted a Toyota Wish registration number AEQ 3565 at a security checkpoint along Mazunga-Muranda dust road.\n\nA search was conducted by the police, leading to the recovery of 307,568 kg of dagga with a street value of US$30,756.80.\n\nIn another case, Tarusarira Tauya (35) was arrested on June 29, 2025 for possession of unregistered medicines.\n\nThe previous day, detectives from CID Drugs and Narcotics who were conducting an operation no to cross-border crimes at Beitbridge Border Post intercepted and searched Rimbi Bus Tours, leading to the recovery of 742 X 100mls Broncleer cough syrup, which was meant to be delivered to its owner in Harare.\n\nDetectives from CID Drugs and Narcotics, Harare, were alerted and they managed to intercept the suspect at a garage along Simon Mazorodze Road, Harare, after receiving the contraband and loading it in a Silver Toyota Wish vehicle registration number AFY 3876.\n\nThe contraband has a street value of US$3,700.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02061024/IMG-20250701-WA0076.jpg",
            "description": "<p>By Staff Reporter Police have arrested seven executives whose companies were manufacturing illicit ethanol-laced brews. In a brief statement Tuesday, the Zimbabwe Republic Police (ZRP) confirmed the arrests, without giving further details. “The ZRP has arrested seven company executives for manufacturing illicit brews using ethanol, water, flavours and supplying them to the public and shops</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/company-executives-arrested-for-manufacturing-illicit-ethanol-laced-brews/\">Company executives arrested for manufacturing illicit ethanol-laced brews</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "ZWG proving difficult to utilise – Hippo Valley",
            "url": "https://www.newzimbabwe.com/zwg-proving-difficult-to-utilise-hippo-valley/",
            "content": "By Alois Vinga\n\nHIPPO Valley Estates Limited (HVEL) says most suppliers are demanding US$ for payment of raw materials, creating a situation where ZWG stocks continue to pile up in the coffers.\n\nPresenting the groups performance for the period ended March 31 2025, the company said the reporting period remained constrained throughout the year, with persistent inflationary pressures and exchange rate volatility driven by unresolved structural challenges in the economy.\n\nHVEL said the introduction of the ZWG currency initially brought about a modicum of stability but began weakening from late September 2024, ultimately closing the financial year at ZWG28.1: US$1.\n\nWhile the tight monetary policy supported a degree of exchange rate stability in the second half of the year, liquidity in the formal sector of the economy deteriorated. Dual currency trading created imbalances, with significant ZWG cash holdings proving difficult to utilise, as most suppliers required settlement in US$, the company said.\n\nThe sugar processor said, given the obtaining circumstances, the company was unable to generate sufficient quantities through normal trade.\n\nThe reduction in the foreign currency retention threshold from 75% to 70% towards the year-end is expected to further reduce the companys US$ export inflows in the year ahead, constraining funding for essential raw material imports and capital expenditure, HVEL said.\n\nDuring the period, operating profit improved significantly to US$7,9 million, reflecting the reversal of prior year CPI and currency effects embedded in cost of sales and the movement in the fair value of biological assets and administration expenses.\n\nProfit for the year declined by 45% to US$13.4 million, mainly due to the inclusion of a non-monetary gain in the prior year relating to the hyperinflationary restatement process.\n\nThe Company remains focused on advancing its strategic growth plans, with priorities centred on increasing sugar production, expanding the revenue portfolio, containing costs and generating positive cash flows.\n\nHowever, significant challenges persist in the form of water availability, electricity supply interruptions, and a complex operating environment, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/06044805/Hippo-Valley-Sugar-Estates.png",
            "description": "<p>By Alois Vinga HIPPO Valley Estates Limited (HVEL) says most suppliers are demanding US$ for payment of raw materials, creating a situation where ZWG stocks continue to pile up in the coffers. Presenting the group’s performance for the period ended March 31 2025, the company said the reporting period remained constrained throughout the year, with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-proving-difficult-to-utilise-hippo-valley/\">ZWG proving difficult to utilise – Hippo Valley</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "Zimbabwe Independent editor arrested over satirical article; ZUJ questions government’s sincerity on media reforms",
            "url": "https://www.newzimbabwe.com/zimbabwe-independent-editor-arrested-over-satirical-article-zuj-questions-governments-sincerity-on-media-reforms/",
            "content": "By Staff Reporter\n\nFaith Zaba, the editor of the privately owned weekly newspaper Zimbabwe Independent, has been arrested over a satirical article published by her publication last week.\n\nAccording to authorities, the article in question, titled When you become mafia state, undermined the authority of President Emmerson Mnangagwa.\n\nZaba was arrested in Harare after presenting herself at a police station following repeated visits to her publisher, Alpha Media Holdings (AMH)s offices by State agents. She was detained and spent Tuesday night in police holding cells awaiting court appearance this Wednesday.\n\nIn a statement, the Zimbabwe Union of Journalists (ZUJ) condemned the arrest, describing it as the criminalisation of journalism.\n\nThe Zimbabwe Union of Journalists (ZUJ) condemns strongly the arrest and detention of Faith Zaba, Zimbabwe Independent Editor by the Zimbabwe Republic Police.\n\nZaba was arrested over a satirical Muckraker column published last Friday in the Zimbabwe Independent, which authorities claim undermined the authority of the President.\n\nAs a Union, we are deeply disturbed by the criminalisation of journalism over editorial content that falls squarely within the boundaries of journalistic expression and satire. Satirical commentary, whether critical or humorous, is protected speech and should not be criminalised, said ZUJ.\n\nWhat makes this incident more concerning is that it comes in the wake of the recently launched Media Policy by His Excellency President Emmerson Mnangagwa, a policy which pledges to promote an open, tolerant, and free media environment.\n\nZabas arrest and treatment runs counter to the spirit and commitments of this policy, and risk undermining confidence in the governments professed reform agenda.\n\nZUJ is also alarmed by reports that Zaba, who is suffering from a serious illness, was detained overnight despite medical confirmation of her condition.This raises grave concerns about her health, safety, and the proportionality of the actions taken by law enforcement.\n\nZUJ called for the immediate and unconditional release of Zaba.\n\nWe therefore demand the immediate and unconditional release of Faith Zaba. As ZUJ, we reaffirm our unwavering commitment to defending media freedom and protecting the rights of journalists.\n\nWe stand with Zaba and with every journalist in Zimbabwe who works fearlessly to inform the public and uphold the principles of truth, justice, and objectivity, ZUJ added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02060039/zaba.png",
            "description": "<p>By Staff Reporter Faith Zaba, the editor of the privately owned weekly newspaper Zimbabwe Independent, has been arrested over a satirical article published by her publication last week. According to authorities, the article in question, titled “When you become mafia state”, undermined the authority of President Emmerson Mnangagwa. Zaba was arrested in Harare after presenting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-independent-editor-arrested-over-satirical-article-zuj-questions-governments-sincerity-on-media-reforms/\">Zimbabwe Independent editor arrested over satirical article; ZUJ questions government’s sincerity on media reforms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "High Court dismisses ZAPU application challenging Gukurahundi public hearings",
            "url": "https://www.newzimbabwe.com/high-court-dismisses-zapu-application-challenging-gukurahundi-public-hearings/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Munamato Mutevedzi has dismissed an application by the Zimbabwe African Peoples Union (ZAPU) which sought to stop the chiefs-led Gukurahundi community outreach hearings.\n\nZAPU had filed an urgent chamber application complaining that the hearings set to begin Tuesday were unlawful and unconstitutional.\n\nEarlier this year, ZAPU encouraged survivors to avoid exposing themselves to possible retribution by the state through certain utterances during the hearings.\n\nIn the present application, ZAPU said the National Council of Chiefs was unlikely to be impartial.\n\nZAPU sought an interim interdict to halt the hearings pending a final court ruling.\n\nZAPU also proposed an alternative process involving an independent commission.\n\nIt argued that the current initiative protects perpetrators and fails to deliver justice.\n\nIn dismissing the application, Justice Mutevedzi said, ZAPU did not act when they initially felt agrieved but waited for the day of the hearings to start and then bring their case to court.\n\nPresident Emmerson Mnangagwa, the Local Government and Public Works minister and the National Council of Chiefs were cited as respondents in the application.\n\nOver 20,000 civilians were killed by a crack military unit known as the Fifth Brigade, deployed by Mugabe between 1980 and 1987 under the guise of putting down an insurrection in the western parts of the country.\n\nHowever, some argue the campaign was aimed at hunting down the opposition Zapu leader Joshua Nkomos supporters.\n\nFour decades later, victims have not been compensated and perpetrators walk scot free.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10153513/Gukurahundi.jpg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Munamato Mutevedzi has dismissed an application by the Zimbabwe African Peoples Union (ZAPU) which sought to stop the chiefs-led Gukurahundi community outreach hearings. ZAPU had filed an urgent chamber application complaining that the hearings set to begin Tuesday were unlawful and unconstitutional. Earlier this year, ZAPU encouraged survivors</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-dismisses-zapu-application-challenging-gukurahundi-public-hearings/\">High Court dismisses ZAPU application challenging Gukurahundi public hearings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "SADC Ministers convene in Zimbabwe to boost regional energy, water co-operation",
            "url": "https://www.newzimbabwe.com/sadc-ministers-convene-in-zimbabwe-to-boost-regional-energy-water-co-operation/",
            "content": "Channel Africa\n\nMinisters from the Southern African Development Community (SADC) responsible for energy and water have gathered in Harare this week for a joint meeting.\n\nThe meeting aims to strengthen regional co-operation and review progress on key projects in both sectors.\n\nThe meeting, which began on Monday and will continue for four days, brings together senior officials from member states to discuss pressing challenges and opportunities.\n\nThis session marks the 30th anniversary of the Southern African Power Pool, established by SADCs Council of Ministers in August 1995 to promote regional power sharing and integration.\n\nThe meeting comes at a time when climate change is having a serious impact on energy production across Southern Africa. Zambia and Zimbabwe are among the hardest hit countries, facing frequent power outages due to reduced water levels in Lake Kariba, which have caused a 25% drop in hydroelectric output.\n\nParticipants are expected to review the progress of the Mission 300 initiative, a project backed by the World Bank and African Development Bank that aims to expand energy access to 600 million people in the region by 2030, with the first target being 300 million.\n\nThe agenda also includes discussions on developing the petroleum and gas sectors, as well as adopting emerging technologies such as green hydrogen and smart grids. The Ministers will consider recommendations from a recent regional dialogue on ensuring a just transition to sustainable energy in Southern Africa.\n\nOn the water front, the meeting will evaluate advances in transboundary water management projects, led by River Basin Organisations and other shared institutions, including groundwater and livelihood support programmes.\n\nProfessor Obert Jiri, Permanent Secretary in Zimbabwes Ministry of Lands, Agriculture and Water Development and Chair of the water officials committee, highlighted the critical link between energy and water resources.\n\nSolar power and energy recovered from landfill gases demonstrate the close relationship between water and energy, he said. Managing water resources effectively is vital, not just for energy generation but also as a response to climate change. A small rise in temperature can significantly reduce water availability in our region, affecting agriculture and livelihoods.\n\nHe added that this meeting is crucial for exploring ways to improve water access for irrigation and energy production, both of which are essential for the regions development.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/12122242/Screenshot-2024-11-12-at-14.20.53.png",
            "description": "<p>Channel Africa Ministers from the Southern African Development Community (SADC) responsible for energy and water have gathered in Harare this week for a joint meeting. The meeting aims to strengthen regional co-operation and review progress on key projects in both sectors. The meeting, which began on Monday and will continue for four days, brings together</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sadc-ministers-convene-in-zimbabwe-to-boost-regional-energy-water-co-operation/\">SADC Ministers convene in Zimbabwe to boost regional energy, water co-operation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        },
        {
            "title": "Televangelist Jimmy Swaggart, whose ministry was toppled by prostitution scandals, dies at 90",
            "url": "https://www.newzimbabwe.com/televangelist-jimmy-swaggart-whose-ministry-was-toppled-by-prostitution-scandals-dies-at-90/",
            "content": "CNN\n\nTelevangelist Jimmy Swaggart, who became a household name amassing an enormous following and multimillion-dollar ministry only to be undone by his penchant for prostitutes, has died.\n\nSwaggart died decades after his once vast audience dwindled and his name became a punchline on late night television. His death was announced Tuesday on his public Facebook page. A cause wasnt immediately given, though at 90 he had been in poor health.\n\nThe Louisiana native was best known for being a captivating Pentecostal preacher with a massive following before being caught on camera with a prostitute in New Orleans in 1988, one of a string of successful TV preachers brought down in the 1980s and 90s by sex scandals. He continued preaching for decades, but with a reduced audience.\n\nSwaggart encapsulated his downfall in a tearful 1988 sermon, in which he wept and apologized but made no reference to his connection to a prostitute.\n\nI have sinned against you, Swaggart told parishioners nationwide. I beg you to forgive me.\n\nHe announced his resignation from the Assemblies of God later that year, shortly after the church said it was defrocking him for rejecting punishment it had ordered for moral failure. The church had wanted him to undergo a two-year rehabilitation program, including not preaching for a full year.\n\nSwaggart said at the time that he knew dismissal was inevitable but insisted he had no choice but to separate from the church to save his ministry and Bible college.\n\nSwaggart grew up poor, the son of a preacher, in a music-rich family. He excelled at piano and gospel music, playing and singing with talented cousins who took different paths: rock-n-rollerJerry Lee Lewisand country singerMickey Gilley.\n\nIn his hometown of Ferriday, Louisiana, Swaggart said he first heard the call of God at age 8. The voice gave him goose bumps and made his hair tingle, he said.\n\nEverything seemed different after that day in front of the Arcade Theater, he said in a 1985 interview with the Jacksonville Journal-Courier in Illinois. I felt better inside. Almost like taking a bath.\n\nHe preached and worked part time in oil fields until he was 23. He then moved entirely into his ministry: preaching, playing piano and singing gospel songs with the barrelhouse fervor of cousin Lewis at Assemblies of God revivals and camp meetings.\n\nSwaggart started a radio show, a magazine, and then moved into television, with outspoken views.\n\nHe called Roman Catholicism a false religion. It is not the Christian way, and claimed that Jews suffered for thousands of years because of their rejection of Christ.\n\nIf you dont like what I say, talk to my boss, he once shouted as he strode in front of his congregation at his Family Worship Center in Baton Rouge, where his sermons moved listeners to speak in tongues and stand up as if possessed by the Holy Spirit.\n\nSwaggarts messages stirred thousands of congregants and millions of TV viewers, making him a household name by the late 1980s. Contributors built Jimmy Swaggart Ministries into a business that made an estimated $142 million in 1986.\n\nHis Baton Rouge complex still includes a worship center and broadcasting and recording facilities.\n\nSwaggarts downfall came in the late 1980s as other prominent preachers faced similar scandals. Swaggart said publicly that his earnings were hurt in 1987 by the sex scandal surroundingrival televangelist Jim Bakkerand a former church secretary at Bakkers PTL ministry organization.\n\nJimmy Swaggart Ministry/WBRZ-TV/Bettmann/Getty Images\n\nThe following year, Swaggart was photographed at a hotel with Debra Murphree, an admitted prostitute who told reporters that the two did not have sex but that the preacher had paid her to pose nude.\n\nShe later repeated the claim  and posed nude  for Penthouse magazine.\n\nThe surveillance photos that crippled Swaggarts career apparently stemmed from his rivalry with preacher Marvin Gorman, whom Swaggart had accused of sexual misdeeds. Gorman hired the photographer who captured Swaggart and Murphree on film. Swaggart later paid Gorman $1.8 million to settle a lawsuit over the sexual allegations against Gorman.\n\nMore trouble came in 1991, when police in California detained Swaggart with another prostitute. The evangelist was charged with driving on the wrong side of the road and driving an unregistered Jaguar. His companion, Rosemary Garcia, said Swaggart became nervous when he saw the police car and weaved when he tried to stuff pornographic magazines under a car seat.\n\nSwaggart was later mocked by the late TV comic Phil Hartman, who impersonated him on NBCs Saturday Night Live.\n\nThe evangelist largely stayed out of the news in later years but remained in the pulpit at Jimmy Swaggart Ministries, often joined by his son, Donnie, a fellow preacher. His radio station broadcast church services and gospel music to 21 states, and Swaggarts ministry boasted a worldwide audience on the internet.\n\nTheres been no greater example of a good and faithful servant than my father. No ifs, ands and buts about it. A man who lived his life for the cause of Christ, Donnie Swaggart said in avideo message sharedon social media Sunday about his dads final days.\n\nThe preacher caused another brief stir in 2004 with remarks about being looked at amorously by a gay man.\n\nAnd Im going to be blunt and plain: If one ever looks at me like that, Im going to kill him and tell God he died, Jimmy Swaggart said, to laughter from the congregation. He later apologized.\n\nSwaggart made few public appearances outside his church, save for singing Amazing Grace at the 2005 funeral of Louisiana Secretary of State Fox McKeithen, a prominent name in state politics for decades.\n\nIn 2022, he shared memories at thememorial servicefor Lewis, his cousin and rock n roll pioneer. The pair had released The Boys From Ferriday, a gospel album, earlier that year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/01194346/Screenshot-2025-07-01-at-20.43.32.png",
            "description": "<p>CNN Televangelist Jimmy Swaggart, who became a household name amassing an enormous following and multimillion-dollar ministry only to be undone by his penchant for prostitutes, has died. Swaggart died decades after his once vast audience dwindled and his name became a punchline on late night television. His death was announced Tuesday on his public Facebook</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/televangelist-jimmy-swaggart-whose-ministry-was-toppled-by-prostitution-scandals-dies-at-90/\">Televangelist Jimmy Swaggart, whose ministry was toppled by prostitution scandals, dies at 90</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "02 Jul 2025"
        }
    ]
}