{
    "news": [
        {
            "title": "Zimbabwe hopes to service external debt",
            "url": "https://www.newzimbabwe.com/zimbabwe-hopes-to-service-external-debt/",
            "content": "Bloomberg\n\nZimbabwe, locked out of international capital markets since defaulting in 1999, expects its stronger economy to help it pay back external creditors, without saying when this would begin.\n\nFinance Minister Mthuli Ncube told reporters in the capital, Harare, on Tuesday that the countrys debt as a percentage of gross domestic product has declined to 46% from around 60% thanks to better growth.\n\nYou can be assured that given this larger GDP base this creates more opportunity and capacity for us to start servicing our external debt, he said, without providing a time-frame.\n\nThe economy has grown to a point where it can allow us to begin servicing our debts sustainably.\n\nZimbabwe wants to restructure its $21 billion debt, of which around $12.3 billion is owed to external creditors including the World Bank, African Development Bank and the European Investment Bank.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Bloomberg Zimbabwe, locked out of international capital markets since defaulting in 1999, expects its stronger economy to help it pay back external creditors, without saying when this would begin. Finance Minister Mthuli Ncube told reporters in the capital, Harare, on Tuesday that the country’s debt as a percentage of gross domestic product has declined to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-hopes-to-service-external-debt/\">Zimbabwe hopes to service external debt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:23",
            "date": "09 Jul 2025"
        },
        {
            "title": "Moxon resigns from Meikles Board",
            "url": "https://www.newzimbabwe.com/moxon-resigns-from-meikles-board/",
            "content": "By Alois Vinga\n\nLong-serving Meikles Limited chairman, John Moxon, has resigned from his role but will proceed as director of the property subsidiary.\n\nIn a statement, the groups company secretary, Batanai Peresuh said the resignation came into effect in February 2025.The development follows several months of internal squabbles between Moxon and fellow board members.\n\nLast year, Mashonaland Turf Club, a minority shareholder in Meikles Limited, filed an application with the High Court of Zimbabwes Commercial Division, seeking Moxons ouster from the board.\n\nSome of the shareholders and board members questioned a plan, led by Moxon and CEO Malcom Mycroft to sell the companys 50% stake in the Victoria Falls Hotel business, saying this was being done without the approval of the board, and without the involvement of African Sun, which co-runs the hotel with Meikles.\n\nMarket watchers are now speculating that Moxon could have finally succumbed to pressure and opted out of the management board.\n\nMeanwhile, Fayaz King  a distinguished Zimbabwean business leader with over thirty years of executive experience spanning telecommunications, information technology, the digital economy, and innovation has since been appointed as acting chairman of the Board, effective 3 July 2025.\n\nThroughout his career, he has demonstrated a proven ability to drive operational excellence, spearhead strategic initiatives, and optimise business processes to enhance efficiency and profitability. King has successfully led cross-functional teams, championed innovation, and delivered transformative technology solutions across diverse sectors and regions, Meikles Limited added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/01041859/John-Moxon.jpg",
            "description": "<p>By Alois Vinga Long-serving Meikles Limited chairman, John Moxon, has resigned from his role but will proceed as director of the property subsidiary. In a statement, the group’s company secretary, Batanai Peresuh said the resignation came into effect in February 2025. The development follows several months of internal squabbles between Moxon and fellow board members. Last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/moxon-resigns-from-meikles-board/\">Moxon resigns from Meikles Board </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:23",
            "date": "09 Jul 2025"
        },
        {
            "title": "Premier Ltd stocks surge as Zulu Lithium Mine restarts production",
            "url": "https://www.newzimbabwe.com/premier-ltd-stocks-surge-as-zulu-lithium-mine-restarts-production/",
            "content": "By Alois Vinga\n\nAIM-listed Premier African Minerals Limited stocks surged by 18% shortly after restarting production at its Zulu Mine.\n\nAccording to the company, operations at Zulu Plant resumed early this week following the completion of upgrades designed to reduce the retention time of concentrates in the cleaner section of the original float plant.\n\nThe works were aimed at improving the grade and recovery of lithium.\n\nThe company raised 4.7 million early this year through share placements to advance operations at the Zulu lithium and tantalum project inZimbabwe.\n\nThe funding, which includes 1.2 million announced on January 17 and 3.5 million on January 16, is expected to support the full restart of operations at the Zulu Mine. The funds will be used for a 3-5-day test run of the Zulu Mine, the acquisition of a flotation plant and the settlement of outstanding creditor and staff payments.\n\nThe miner said current stock price reached 0.014 pence, up 18% on Monday afternoon in London.\n\nThe Premier African Minerals Ltd CEO George Roach expressed gratitude to raw materials suppliers for enabling production restart.\n\nThanks to the outstanding support we have received from each of the original equipment manufacturer suppliers associated with all the plant components from the mill to final flotation, we have been able to restart the plant late afternoon on 6 July 2025, he said.\n\nHe said the plant has run with limited feed to allow for checks on the operation of each of the plant components and process integration up to the spodumene cleaner cell inserts that will be brought into the process today once sealants have hardened.\n\nAll being well, ore from the run-of-mine pad will be fed from today and commissioning and optimisation of the primary spodumene flotation plant will follow, added Roach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/30115938/Premier-CEO-George-Roach.png",
            "description": "<p>By Alois Vinga AIM-listed Premier African Minerals Limited stocks surged by 18% shortly after restarting production at its Zulu Mine. According to the company, operations at Zulu Plant resumed early this week following the completion of upgrades designed to reduce the retention time of concentrates in the cleaner section of the original float plant. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/premier-ltd-stocks-surge-as-zulu-lithium-mine-restarts-production/\">Premier Ltd stocks surge as Zulu Lithium Mine restarts production</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:23",
            "date": "09 Jul 2025"
        },
        {
            "title": "Questionable alliance as Mnangagwa’s ally Tungwarara takes over City Sports Centre",
            "url": "https://www.newzimbabwe.com/questionable-alliance-as-mnangagwas-ally-tungwarara-takes-over-city-sports-centre/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwas special advisor, Paul Tungwarara, will oversee the renovations of the Harare City Council-owned City Sports Centre following years of deterioration and neglect by the municipality.\n\nTungwarara, through his company, Prevail Group, has been awarded the contract to refurbish the council-owned facility, though details of the deal remain unclear.\n\nAddressing the media recently, Harare Mayor Jacob Mafume revealed that the deal was endorsed by President Mnangagwa, with Prevail Group selected to lead the renovations of the City Sports Centre.\n\nWe are going to be assisted in renewing the City Sports Centre which was being turned into the City Church Centre. It is not the City Church Centre. It is the City Sports Centre and it is going to remain that. The City Sports Centre will remain a quintessentially sports facility where people play indoor games and we are going to make it better.\n\nWhen we went to the meeting, the President directed that Prevail Group of Companies assist the Council to renew and modernise that facility and we are going to do exactly that.\n\nThese are the kind of partnerships that we require so that we develop modern facilities that are in keeping with modern day standards and that will make our children grow and live in Harare, said Mafume.\n\nThe deal to revamp the City Sports Centre by Tungwararas company follows a similarly controversial agreement between the council and Geo Pomona, which has taken over refuse collection in the capital.\n\nHarare City Council is also partnering with ZANU PF Member of Parliament Pedzai Scott Sakupwanya for a sports ground he is constructing in Mabvuku and has proposed a lease agreement for Rufaro Stadium.\n\nDespite previously opposing partnerships with private entities, Mafume appears to have softened his stance by endorsing the Geo Pomona and Prevail Group deals.\n\nMafume said partnerships with private players are crucial for the development of the Citys facilities.\n\nA city is build by the Citizens in it. Citizens in it are the cooperates, churches, individuals, NGOs and everybody. We want to encourage people to come and work with us and be in partnership. When we partner with someone there is no way they can put the land in their pocket, said Mafume.\n\nThe City Sports Centre reflects the dire state of council-owned facilities, which have deteriorated due to municipal neglect.\n\nIn 2022, Mafume blocked a proposed deal by businessman Kudakwashe Tagwirei to renovate Rufaro Stadium but has since failed to revive the iconic Mbare structure.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08215221/tungwarar.jpeg",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa’s special advisor, Paul Tungwarara, will oversee the renovations of the Harare City Council-owned City Sports Centre following years of deterioration and neglect by the municipality. Tungwarara, through his company, Prevail Group, has been awarded the contract to refurbish the council-owned facility, though details of the deal remain unclear. Addressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/questionable-alliance-as-mnangagwas-ally-tungwarara-takes-over-city-sports-centre/\">Questionable alliance as Mnangagwa’s ally Tungwarara takes over City Sports Centre </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:23",
            "date": "09 Jul 2025"
        },
        {
            "title": "Pair to serve 9 years imprisonment each for trafficking a live pangolin",
            "url": "https://www.newzimbabwe.com/pair-to-serve-9-years-imprisonment-each-for-trafficking-a-live-pangolin/",
            "content": "By James Muonwa\n\nTWO men from Beitbridge have been jailed for nine years each for illegal possession and attempting to sell a live pangolin.\n\nThe regional court sitting in the border town meted out the mandatory custodial sentence on Andrew Kahlamezi (53) and Sakhile Ncube (45) for dealing in one of the worlds most endangered and heavily protected animal species.\n\nThe State case was that on July 8 last year, Criminal Investigations Department (CID) detectives embarked on a well-coordinated sting operation after receiving information that the offenders were offering a live pangolin for sale at 150,000 Rands near the ZIMRA dam wall.\n\nUndercover officers proceeded to the place and posed as potential buyers.\n\nIt was heard that Kahlamezi and Ncube arrived at the rendezvous aboard a Toyota Hiace. Upon arrival, they produced the pangolin that was stashed in a black bag inside a crate. Detectives then pounced and the two tried to flee when police revealed their identities, but were swiftly apprehended.\n\nThe pangolin  a female weighing 8.7 kilogrammes was rescued alive and taken to veterinary authorities for medical assessment and care.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said the mandatory nine-year sentence on the two offenders sends a clear message that wildlife crimes are serious offences, and that pangolins are an endangered species.\n\nPangolins are a national treasure, and any attempt to profit from pangolin trafficking will be met with the full force of the law, the NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/13184528/Pangolin.jpg",
            "description": "<p>By James Muonwa  TWO men from Beitbridge have been jailed for nine years each for illegal possession and attempting to sell a live pangolin. The regional court sitting in the border town meted out the mandatory custodial sentence on Andrew Kahlamezi (53) and Sakhile Ncube (45) for dealing in one of the world’s most endangered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pair-to-serve-9-years-imprisonment-each-for-trafficking-a-live-pangolin/\">Pair to serve 9 years imprisonment each for trafficking a live pangolin </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:23",
            "date": "09 Jul 2025"
        },
        {
            "title": "Minister urges men to adopt stress management techniques",
            "url": "https://www.newzimbabwe.com/minister-urges-men-to-adopt-stress-management-techniques/",
            "content": "By Anna Chibamu\n\nPublic Service Deputy Minister Mercy Dinha has called on men to seek medical care and adopt stress management techniques.\n\nDinha was addressing public sector employees at the Harare Gardens during a belated Fathers Day commemoration.\n\nMen often face challenges which include financial stress, societal expectations, and balancing work and family life, leading to stress-related problems.\n\nWe gather to celebrate the contributions and achievements of men in the public sector.\n\nAs we celebrate men today, we recognise the important roles you play in your families, in your communities, and the nation.\n\nWe acknowledge your hard work, dedication to the countrys development, and your resilience. As a government, we also recognise the various roles you play, the different hats you wear, the responsibilities you carry, and the sacrifices you make, Dinha said.\n\nThe deputy minister stated that her ministry recognised the vital role played by men in shaping their families.\n\nWe acknowledge your never-ending love, your guidance, and your support. You are the pillars of strength that provide stability and security for your families and the nation at large, added the deputy minister.\n\nHowever, because of their roles nature as fathers and employees of the public service, Dinha pointed out that financial stability was crucial for mens well-being.\n\nMens health is a critical issue that contributes to productivity in the organisation.\n\nStress can have devastating effects on mens mental health.\n\nI encourage you to practice stress management techniques such as exercise, being mindful and social support.\n\nI also encourage you to always prioritise your health, seek medical care when needed, and adopt healthy habits despite your busy schedules.\n\nAdded Dinha, To the nation, I call upon us to support men in their roles. Let us celebrate the selfless love, dedication of men and continue to build a society that values and supports men at the workplace and in our homes, she said, urging all men to prioritise their well-being and seek support when needed.\n\nDue to the economic hardships in Zimbabwe, most men are struggling to cope with the day-to-day provision of family needs and many of them have been affected.\n\nSpeaking at the same occasion, Mens Clinic International Marketing manager Philip Jonhera said research had shown that men have poor health-seeking behaviour, hence they should focus on medical check-ups focusing especially prostate cancer which is affecting young men in their thirties.\n\nThere is your spiritual health, there is your physical health, and there is your mental health, if you do not balance all three sections, I wont balance the diet, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08220526/mercy-dinha.gif",
            "description": "<p>By Anna Chibamu Public Service Deputy Minister Mercy Dinha has called on men to seek medical care and adopt stress management techniques. Dinha was addressing public sector employees at the Harare Gardens during a belated Father’s Day commemoration. Men often face challenges which include financial stress, societal expectations, and balancing work and family life, leading</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-urges-men-to-adopt-stress-management-techniques/\">Minister urges men to adopt stress management techniques</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:23",
            "date": "09 Jul 2025"
        }
    ]
}