{
    "news": [
        {
            "title": "Pair mutilates elderly man (89) before burning his corpse",
            "url": "https://www.newzimbabwe.com/pair-mutilates-elderly-man-89-before-burning-his-corpse/",
            "content": "By Staff Reporter\n\nIN a morbid act only fit for a horror movie, two Hwange men waylaid an elderly man, killed him and ferried his body to his homestead before torching the lifeless body inside a hut.\n\nThe High Court circuit sitting at Hwange found the pair of Events Ncube (31) and Keylop Ncube (22) guilty of murder and sentenced them to 25 years imprisonment each.\n\nCircumstances were that on April 1, 2024 at around 7 pm, the now deceased Sibusisiwe Dube (89) and Tapson Munsaka were drinking beer at Maphosa business centre. The two accused persons were also at the same joint but imbibing separately.\n\nThe court heard that at around 7 pm, Dube left the bar and started walking home.\n\nThe two accused persons trailed the elderly man and caught up with him at a secluded spot, where they struck him on the head using an axe for unknown reasons. They then ferried his lifeless body using a scotch cart and placed the deceaseds body in his kitchen hut before setting it on fire.\n\nThe remains, which were burnt beyond recognition, were discovered the following day.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/17050156/hut-on-fire.jpg",
            "description": "<p>By Staff Reporter IN a morbid act only fit for a horror movie, two Hwange men waylaid an elderly man, killed him and ferried his body to his homestead before torching the lifeless body inside a hut. The High Court circuit sitting at Hwange found the pair of Events Ncube (31) and Keylop Ncube (22)</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pair-mutilates-elderly-man-89-before-burning-his-corpse/\">Pair mutilates elderly man (89) before burning his corpse </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Man spared jail after killing brother in row over US$5",
            "url": "https://www.newzimbabwe.com/man-spared-jail-after-killing-brother-in-row-over-us5/",
            "content": "By Staff Reporter\n\nA CHIMANIMANI man has been convicted of killing his brother during a fight over how to share US$5 they got after completing amenial job.\n\nThe High Court at Mutare sentenced James Mwafunda to a wholly suspended sentence after downgrading the offence from murder to culpable homicide.\n\nThe accused person was dragged to court following the death of his sibling, Tawanda Mwafunda, last year.\n\nThe court heard that the accused person and the now deceased completed a piece job and were paid US$5.\n\nWhile drinking beer at Masori tuck shop, the brothers started arguing over how to share the money.\n\nThe heated exchange escalated into a physical fight, resulting in James grabbing a stone, which he used to strike his brother on the head. Tawanda sustained serious injury following the attack and bled profusely while lying on the ground.\n\nAfter noticing that he had inflicted harm on his brother, James rushed to look for help and eventually police ferried the now deceased to hospital, where he was pronounced dead.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19055619/mutare.png",
            "description": "<p>By Staff Reporter A CHIMANIMANI man has been convicted of killing his brother during a fight over how to share US$5 they got after completing a menial job. The High Court at Mutare sentenced James Mwafunda to a wholly suspended sentence after downgrading the offence from murder to culpable homicide. The accused person was dragged to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-spared-jail-after-killing-brother-in-row-over-us5/\">Man spared jail after killing brother in row over US$5</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Musona hopes to contribute to team’s development after return to Warriors fold",
            "url": "https://www.newzimbabwe.com/musona-hopes-to-contribute-to-teams-development-after-return-to-warriors-fold/",
            "content": "By Sport Reporter\n\nFormer Warriors captain Knowledge Musona says he hopes to help develop his younger teammates after coming out of international retirement.\n\nThe 34-year-old forward was lured back by Warriors coach Michael Nees, who believes his experience can add value to the squad.\n\nMusona joined the Warriors squad on Tuesday morning and had his first training in the afternoon ahead of the Benin clash at Moses Mabhidha Stadium in Durban on Thursday.\n\nI am feeling good, Im feeling great and looking forward to the upcoming games.\n\nThe training was good and Isaw a lot of quality, which makes me to think that the future of the Warriors is bright\n\nI justhopethat Iwill help these youngsters and contribute to their development, said Musona afterTuesday afternoons training session.\n\nThe Saudi Arabia based forward retired from international football in 2022 after leading the Warriors as captain at two AFCON editions in Egypt 2019 and Cameroon 2021.\n\nCommenting on the upcoming two World Cup Qualifiers against Benin and Nigeria, Musona says there is hope for Zimbabwe to pick positive results.\n\nIn football, everything is possible, and I think it starts with this game that is coming.\n\nThe most important thing is to collect maximum points in this coming game and try to go and collect some points in Nigeria.\n\nBut for now, I think the focus has to be on Benin, which I believe with this quality we will be able to collect maximum points, added Musona.\n\nZimbabwe is currently sitting bottom of Group C of the 2026 World Cup Qualifiers with two points from the four games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/12095834/Zimbabwe_captain_Knowledge_Musona_during_the_2021_Africa_Cup_of_Nations.JPG.webp",
            "description": "<p>By Sport Reporter Former Warriors captain Knowledge Musona says he hopes to help develop his younger teammates after coming out of international retirement. The 34-year-old forward was lured back by Warriors coach Michael Nees, who believes his experience can add value to the squad. Musona joined the Warriors squad on Tuesday morning and had his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musona-hopes-to-contribute-to-teams-development-after-return-to-warriors-fold/\">Musona hopes to contribute to team’s development after return to Warriors fold</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Zanu PF’s 2030 agenda fuels political violence; over 7000 affected by human rights violations in February alone",
            "url": "https://www.newzimbabwe.com/zanu-pfs-2030-agenda-fuels-political-violence-over-7000-affected-by-human-rights-violations-in-february-alone/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEis grappling with a surge in political violence, driven by the ruling Zanu PF partys efforts to extend President Emmerson Mnangagwas term beyond 2028, with 117 human rights violations nationwide, affecting 7,292 peoplerecorded in February alone.\n\nAccording to the latest Zimbabwe Peace Project (ZPP) report, incidents included threats of violence, politically motivated assaults, unfair distribution of food aid, and restrictions on freedom of assembly, association, and expression.\n\nThe perpetrators are primarily linked to the ruling party, local authorities, and traditional leaders.\n\nZimbabwe is witnessing a surge in political violence and threats, fueled by the ruling partys agenda to extend President Mnangagwas term beyond 2028.\n\nIn February, the Zimbabwe Peace Project (ZPP) documented 117 human rights violations nationwide, affecting 7,292 people. The victims included 4,064 women, 94 of whom have disabilities, and 3,228 men, including 77 with disabilities, the report reads.\n\nZPP also reported that community members are being forced to attend ruling party meetings disguised as public gatherings for food aid distribution, as part of efforts to advance the 2030 agenda.\n\nIntra-party violence is also rising within ZANU PF, with clashes erupting at meetings and community gatherings.\n\nA stark example is the physical altercation in Ward 2, Kadoma, where two groups of supporters fought over the 2030 agenda. Similarly, in Epworth, two CCC members were brutally assaulted by ZANU PF supporters for opposing the presidential term extension, the report added.\n\nVictims were assaulted with metal rods, sustaining injuries to the face, mouth, and head, and had their phones confiscated by the assailants.\n\nTo address the escalating violence, ZPP has urged the government and judiciary to uphold the rule of law and protect human rights.\n\nIt also called on the Zimbabwe Human Rights Commission to establish effective mechanisms for investigating and prosecuting human rights violations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18014149/Zanu-PF-violence.png",
            "description": "<p>By Thandiwe Garusa ZIMBABWE is grappling with a surge in political violence, driven by the ruling Zanu PF party’s efforts to extend President Emmerson Mnangagwa’s term beyond 2028, with 117 human rights violations nationwide, affecting 7,292 people recorded in February alone. According to the latest Zimbabwe Peace Project (ZPP) report, incidents included threats of violence, politically motivated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pfs-2030-agenda-fuels-political-violence-over-7000-affected-by-human-rights-violations-in-february-alone/\">Zanu PF’s 2030 agenda fuels political violence; over 7000 affected by human rights violations in February alone</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Kavango Resources Plc shares soar by 23%",
            "url": "https://www.newzimbabwe.com/kavango-resources-plc-shares-soar-by-23/",
            "content": "By Alois Vinga\n\nKAVANGO Resources Plc stocks went up by 23% this week following revelations of larger underground gold prospects in Zimbabwe.\n\nThe miner is a metal exploration company listed on the London Stock Exchange, focused on discovering world-class base and precious metal deposits in Zimbabwe and Botswana.\n\nTheir main objective is to investigate the bulk-mining potential of historic high-grade gold mines in Zimbabwe, with a focus on the Matabeleland region\n\nThe companys stocks surged this week after reporting a significant upgrade to the underground mining potential of a gold prospect in Zimbabwe. The precious metals exploration company said it intersected a reef containing quartz and sulphide-bearing veins in a previously inaccessible level of the main shaft at prospect 1 in the Hillside Project in Matabeleland, Zimbabwe.\n\nShares in Kavango Resources were up 23% to 0.77 pence in London.\n\nKavango CEO Ben Turney said the results produced so far were very impressive and looked forward to a good season ahead.\n\nWe are extremely pleased with the latest results from prospect 1. The new reefs identified add to the growing number of opportunities for near-term, significant gold production at Hillside.\n\nWe look forward to bringing the drill rig back to prospect 1 as soon as we can. The new reefs are open on strike, with grades appearing to increase with depth. After establishing the reefs extent, we hope to move into defining a resource we can bring into production as quickly as possible.\n\nThe company said mapping and sampling on the reef, alongside the discovery of further mineralisation, indicates previously unknown potential for both lateral and vertical continuity on the back of plans to test the extent of the reefs with both surface and underground drilling.\n\nKavango intends to establish prospect 1 as a third area of near-term gold production at Hillside, alongside prospects 3 and 4.\n\nIt said the results will inform further drilling to define a larger, longer-term underground mine than previously anticipated.\n\nThe miner added that it is also proposing to increase processing capacity at prospect 1 to provide flexibility for greater production in future.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/27102047/Kavango-Resources.webp",
            "description": "<p>By Alois Vinga KAVANGO Resources Plc stocks went up by 23% this week following revelations of larger underground gold prospects in Zimbabwe. The miner is a metal exploration company listed on the London Stock Exchange, focused on discovering world-class base and precious metal deposits in Zimbabwe and Botswana. Their main objective is to investigate the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kavango-resources-plc-shares-soar-by-23/\">Kavango Resources Plc shares soar by 23%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Zimbabwe calls for development focus to end DRC conflict",
            "url": "https://www.newzimbabwe.com/zimbabwe-calls-for-development-focus-to-end-drc-conflict/",
            "content": "Channel Africa\n\nForeign Affairs Minister Amon Murwira has called for a shift in Africas approach to conflict resolution, urging the continent to focus on combating poverty and deprivation rather than simply engaging in physical battles.\n\nSpeaking at the opening of the Southern African Development Community and East African Community Foreign Affairs Ministerial meeting in Harare, Murwira said that we should never confuse winning physical armed battles with winning the war. The real war is against poverty and deprivation.\n\nHe added, Poverty and deprivation are exacerbated by physical armed battles, which should stop for the progress of all African peoples. Poverty and deprivation are fought using knowledge, skills, and understanding amongst peoples. This is the war that Africa should be fighting.\n\nThe Minister underscored the need for African nations to unite in addressing these root causes of instability, particularly the socio-economic factors that fuel violence.\n\nAccording to Murwira, the Democratic Republic of Congos (DRC) crisis is not merely a result of armed conflict but a symptom of deeper issues of poverty and underdevelopment. He called for a collective effort to promote peace through education, skill-building, and regional co-operation, noting that such efforts would provide the foundation for lasting peace and stability across the continent.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19052259/amon-murwira-scaled.jpeg",
            "description": "<p>Channel Africa Foreign Affairs Minister Amon Murwira has called for a shift in Africa’s approach to conflict resolution, urging the continent to focus on combating poverty and deprivation rather than simply engaging in physical battles. Speaking at the opening of the Southern African Development Community and East African Community  Foreign Affairs Ministerial meeting in Harare,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-calls-for-development-focus-to-end-drc-conflict/\">Zimbabwe calls for development focus to end DRC conflict</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Vendors attack Chinhoyi municipal police, vandalize truck as they resist removal from the streets",
            "url": "https://www.newzimbabwe.com/vendors-attack-chinhoyi-municipal-police-vandalize-truck-as-they-resist-removal-from-the-streets/",
            "content": "By James Muonwa\n\nA MUNICIPALITY of Chinhoyi pick-up truck had its rear windshield shattered while a security officer was injured during skirmishes with vendors as the latter resisted removal from the streets.\n\nThe violent confrontations that broke out in the central business district (CBD), at a vending spot popularly known as Magaba Tuesday afternoon, left a council vehicle, a Nissan NP300, damaged. A municipal police officer identified as Virginia Mlambo sustained injuries during the attack.\n\nMlambo was part of a contingent deployed to drive off illegal vendors from undesignated vending sites, taking heed of Local Government Minister Daniel Garwes recent directive to clamp down on such unlawful activities blamed for rising criminal cases, including the sale of counterfeit products.\n\nMunicipality of Chinhoyi public relations officer, Tichaona Mlauzi, confirmed the violent clashes.\n\nThere were some skirmishes, which occurred at Magaba complex. Our municipal police officers were busy enforcing bylaws that do not allow vendors to operate from undesignated areas, asking vendors to start operating from designated areas.\n\nHowever, the vendors got rowdy after some instigation from one of them, and in the process they happened to be throwing stones which apparently shattered the rear screen of the municipal vehicle and also injured Constable Virginia Mlambo, Mlauzi told NewZimbabwe.com.\n\nFollowing the attack, the driver ferried his injured counterpart to Chinhoyi Central Police Station, where she lodged a formal report. Her condition could not be immediately ascertained at the time of publishing.\n\nPolice have opened a case of malicious damage to property and taken some suspects into custody in relation to the violence.\n\nPolice have since taken over the matter after the driver also reported damage to the Nissan NP300 registration number AAE 6675 under RRB 6344592, said the council spokesperson.\n\nVendors allege authorities use excessive force to drive them off the pavements, and confiscate their wares, which they later share amongst themselves for personal use.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19054327/chinhoyi.jpg",
            "description": "<p>By James Muonwa A MUNICIPALITY of Chinhoyi pick-up truck had its rear windshield shattered while a security officer was injured during skirmishes with vendors as the latter resisted removal from the streets. The violent confrontations that broke out in the central business district (CBD), at a vending spot popularly known as Magaba Tuesday afternoon, left</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vendors-attack-chinhoyi-municipal-police-vandalize-truck-as-they-resist-removal-from-the-streets/\">Vendors attack Chinhoyi municipal police, vandalize truck as they resist removal from the streets </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Don’t forget that Chiwenga supported you in 2017 – Geza resurfaces with message for Mnangagwa",
            "url": "https://www.newzimbabwe.com/dont-forget-that-chiwenga-supported-you-in-2017-geza-resurfaces-with-message-for-mnangagwa/",
            "content": "By Staff Reporter\n\nExpelled Zanu PF Central Committee member and militant war veteran Blessed Geza has resurfaced, reminding President Emmerson Mnangagwa of the support he received from his deputy, Vice President Constantino Chiwenga, during the 2017 military coup that ousted former and late President Robert Mugabe from power.\n\nGezas address comes on the heels of a thinly veiled attack on Chiwenga by Zanu PF spokesperson Christopher Mutsvangwa, who labelled the former military boss uneducated and cruel, particularly towards women, branding him unfit to succeed Mnangagwa as President.\n\nGeza, who disappeared after previous explosive press briefings aired via Heart and Soul Television (HSTV)  resulting in the arrest of its head and Alpha Media Holdings (AMH) journalist Blessed Mhlanga  re-emerged clad in visibly new military garb, warning Mnangagwa that his time in office is up.\n\nGeza took time to remind Mnangagwa of the support he got from Chiwenga when he fled the country hours after his dismissal as Vice President on November 6, 2017.\n\nMnangagwas expulsion was the spark that lit the tinderbox, setting in motion Operation Restore Legacy led by General Chiwenga in 2017, the historic period referred to as the Two Weeks in November.\n\nYou poisoned General Chiwenga, who assisted you when you had run away. Mugabe wanted to give power to Chiwenga, but he refused. But today you are going after Chiwenga. Are you sure? What exactly did you do during the liberation struggle? fumed Geza.\n\nGeza laid into Mnangagwa, alleging that the Zanu PF figurehead was involved in the poisoning of Chiwenga, referring to when the latter was flown to China for medical attention in 2020.\n\nMnangagwa was 100 per cent involved in the poisoning of General Chiwenga. I have the evidence from his brother, called Joseph Rera. When Mnangagwa was asked by Rera how General Chiwenga was coping with his health while in China, Mnangagwa, you said Chiwenga was a goner, and that he would return to Zimbabwe in a coffin, Geza claimed.\n\nHe further alleged that Mnangagwa had a hand in the deaths of scores of military generals, especially during the Covid-19 era.\n\nGeza further challenged Mnangagwa to arrest him, saying that the Zanu PF figurehead knows his whereabouts.\n\nI am very safe and in buzzing good health. Mnangagwa knows where I am.\n\nRelentless Geza also laid into Christopher Mutsvangwa, warning that he should zip up, otherwise, he will open a can of worms, revealing secrets that would expose him as an anti-revolutionary during the liberation struggle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter Expelled Zanu PF Central Committee member and militant war veteran Blessed Geza has resurfaced, reminding President Emmerson Mnangagwa of the support he received from his deputy, Vice President Constantino Chiwenga, during the 2017 military coup that ousted former and late President Robert Mugabe from power. Geza’s address comes on the heels of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dont-forget-that-chiwenga-supported-you-in-2017-geza-resurfaces-with-message-for-mnangagwa/\">Don’t forget that Chiwenga supported you in 2017 – Geza resurfaces with message for Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Six armed robbery suspects killed in shootout with police",
            "url": "https://www.newzimbabwe.com/six-armed-robbery-suspects-killed-in-shootout-with-police/",
            "content": "By James Muonwa\n\nTHE Zimbabwe Republic Police (ZRP) has confirmed a dramatic shoot-out that resulted in the death of six armed robbery suspects.\n\nThe incident occurred in the early hours of Tuesday, near the tollgate along the Bulawayo-Victoria Falls highway at Insuza.\n\nNational police spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nZRP confirms a shoot-out incident with six armed robbery suspects along the Bulawayo-Victoria Falls tollgate on the 18th of March 2025, between 2am and 4am, said Nyathi.\n\nHe said the suspects had spent the day at Young Money General Dealer Shop at Insuza, drinking and monitoring their target, before pouncing.\n\nThey later pounced on the two complainants while armed with pistols, knives and axes. The suspects went on to tie the hands of the complainants with electric cables before covering their faces with blankets.\n\nThey demanded for gold and cash. The suspects ransacked the whole shop and took away unknown amount of cash, groceries, 48 volts lithium battery, inverter, 9kg gas tank and cellphones, added Nyathi.\n\nThe gang them fled the scene in their getaway vehicle, a silver Honda Fit registration number AEY4843.\n\nOne of the complainants untied themself and called the employer, who quickly alerted police who made a follow up.\n\nDetectives tracked the getaway vehicle and spotted it along the highway as it approached the tollgate.\n\nNyathi said the suspects defied police orders to stop before the dramatic exchange of gunfire ensued.\n\nDetectives ordered the suspects to stop. Instead, the suspects fired shots towards the police officers leading to a shoot-out.\n\nThe suspects went on to hit a boom gate at the tollgate. They were arrested and taken to United Bulawayo Hospital (UBH) where they all unfortunately passed on, he said.\n\nAt the scene, police recovered property stolen from the shop as well as ammunition used in commotion of the crime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By James Muonwa THE Zimbabwe Republic Police (ZRP) has confirmed a dramatic shoot-out that resulted in the death of six armed robbery suspects. The incident occurred in the early hours of Tuesday, near the tollgate along the Bulawayo-Victoria Falls highway at Insuza. National police spokesperson, Commissioner Paul Nyathi confirmed the incident. “ZRP confirms a shoot-out</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/six-armed-robbery-suspects-killed-in-shootout-with-police/\">Six armed robbery suspects killed in shootout with police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        },
        {
            "title": "Guns, Condoms, and a Crisis of Faith: Holy Ten slams Uebert Angel and Mudiwa",
            "url": "https://www.newzimbabwe.com/guns-condoms-and-a-crisis-of-faith-holy-ten-slams-uebert-angel-and-mudiwa/",
            "content": "By Costa Nkomo\n\nOutspoken hip-hop artist Holy Ten has launched a blistering attack on Zimbabwes Ambassador-at-Large to Europe and the Americas Uebert Angel and musician Mudiwa Hood.\n\nHoly Ten alleges the duo bring guns and condoms into the church, a claim thats thrown a Molotov cocktail into the already turbulent waters of faith and celebrity. He vows never to return to what he sees as a den of iniquity, run by charlatans preying on unsuspecting congregants.\n\nHoly Ten unleashed these reputation-damaging details during a recent appearance on DJ Ollahs Podcast, claiming Angel routinely propositioned him to find young women for the man of the cloth to bed.\n\nI was first inspired to pray by Uebert Angel. I didnt have to meet him then, I would just watch his sermons. For him to become the gentleman who asks me to find chicks  slay queens  was the worst thing ever. I went to their church where I performed. Mudiwa was showing me guns. From there, I began to doubt their faith, he said.\n\nHoly Ten said it was a source of deep embarrassment that Angel, given his supposed holy standing, would make such requests.\n\nNot only guns, but Mudiwa then opened his bag and showed me condoms. I swear, and Im ready to be taken to court for this, I swear that I will never return to their church again. You can ask my crew. Those people are spinning a yarn, he said.\n\nAngel presides over the Good News Church\n\nTwo years ago, he was embroiled in controversy after being exposed in the four-part Al Jazeera documentary, The Gold Mafia, which detailed undercover operations across three continents and revealed a trove of incriminating documents capturing gold smuggling.\n\nAngel was secretly filmed boasting that he could move over US$1 billion of dirty cash with ease, leveraging his diplomatic immunity to facilitate a scheme where unaccounted funds could be exchanged for Zimbabwes gold.\n\nAngel and his business partner, Rikki Doolan, further claimed their laundering operations had the blessing of President Emmerson Mnangagwa.\n\nMudiwa Hood, on the other hand, is the Chief Executive Officer (CEO) and founder of several companies, including Sky Angel Private Jet Charter, Fundmass, Optima Construction, Disrupt Media, and Bisep Security.\n\nHe fancies himself a serial entrepreneur, author, and fashion mogul.\n\nHoly Tens accusations have struck a chord, laying bare the hypocrisy he perceives within these circles.\n\nThese revelations, if true, paint a portrait of men drunk on power, flaunting wealth, and abusing their positions with impunity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/01113945/Holy-Ten-1.png",
            "description": "<p>By Costa Nkomo Outspoken hip-hop artist Holy Ten has launched a blistering attack on Zimbabwe’s Ambassador-at-Large to Europe and the Americas Uebert Angel and musician Mudiwa Hood. Holy Ten alleges the duo bring guns and condoms into the church, a claim that’s thrown a Molotov cocktail into the already turbulent waters of faith and celebrity.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/guns-condoms-and-a-crisis-of-faith-holy-ten-slams-uebert-angel-and-mudiwa/\">Guns, Condoms, and a Crisis of Faith: Holy Ten slams Uebert Angel and Mudiwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Mar 2025"
        }
    ]
}