{
    "news": [
        {
            "title": "State charges AMH’s Heart and Soul TV in journalist Mhlanga’s case",
            "url": "https://www.newzimbabwe.com/state-charges-amhs-heart-and-soul-tv-in-journalist-mhlangas-case/",
            "content": "By Staff Reporter\n\nIn a fresh turn of events, the state has announced that it will be going after Alpha Media Holdings (AMH)s subsidiary, Heart and Soul TV.\n\nHSTV will be jointly charged with journalist Blessed Mhlanga for allegedly publishing messages that incite public violence.\n\nThis emerged when Mhlanga, who has been in jail since February this year, challenged his further remand before magistrate Ruth Moyo.\n\nHis trial is expected to commence on May 14, and according to his lawyer, HSTV will have been charged by then.\n\nThe state was supposed to give a trial date and allocate the matter to a trial court.\n\nInitially, the state had indicated that they needed one more postponement, but the state has now decided to rope in HSTV.\n\nThe state has pronounced that HSTV, the organisation that employs Blessed Mhlanga, will be a co-accused.\n\nCharges are going to be levelled against this media house called HSTV in respect of the charges that Blessed is facing, Mhike told journalists at court on Wednesday.\n\nMhlangas lawyer had challenged the postponement of the matter because they had been promised that a trial date was going to be set on Wednesday.\n\nHowever, after the lunch break, the state announced that it was ready for trial.\n\nThey suddenly changed their position to say they are suddenly ready to go to trial and allocatedMay 14 as the trial date, Mhike said.\n\nHe said, despite their indication that his lawyer of choice will be out of the country, prosecutors insisted that they will stick to the 14th.\n\nMhlanga is accused of publishing a press conference by war veteran Blessed Geza, who is on the run.\n\nDuring the press conference, Geza demanded that President Emmerson Mnangagwa resign and challenged calls for him to remain in power until 2030.\n\nMhlanga has been denied bail on three occasions by both magistrates and the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter In a fresh turn of events, the state has announced that it will be going after Alpha Media Holdings (AMH)’s subsidiary, Heart and Soul TV. HSTV will be jointly charged with journalist Blessed Mhlanga for allegedly publishing messages that incite public violence. This emerged when Mhlanga, who has been in jail since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/state-charges-amhs-heart-and-soul-tv-in-journalist-mhlangas-case/\">State charges AMH’s Heart and Soul TV in journalist Mhlanga’s case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "Govt backtracks on Bulawayo-Vic Falls road rehabilitation claims as concerns are raised over corruption in tender awards",
            "url": "https://www.newzimbabwe.com/govt-backtracks-on-bulawayo-vic-falls-road-rehabilitation-claims-as-concerns-are-raised-over-corruption-in-tender-awards/",
            "content": "By Staff Reporter\n\nThe Ministry of Transport and Infrastructural Development has backtracked on its statement that contractors are now on site and rehabilitation of the dilapidated Bulawayo-Victoria Falls Road will soon start, claiming wrong information was posted.\n\nA state-run newspaper on Monday published an article stating that eight contractors involved in the rehabilitation of the Bulawayo-Vic Falls road were now on site, which was shared on the Transport Ministrys X page.\n\nThis was despite an advert inviting contractors to bid for the upgrade of the road, stating that the tender process only closes on April 29, raising concerns that the contracts had been corruptly awarded.\n\nFor those who found it hard to believe that Emmerson Mnangagwa is the most corrupt politician Zimbabwe has ever had, here is your answer.\n\nThey floated a tender for the repair of the BulawayoVictoria Falls Road, and the closing date for this tender process is today, 29 Aprilhttps://t.co/ptkcv55ziKpic.twitter.com/5pkcogUJuC\n\n Hopewell Chinono (@daddyhope)April 29, 2025\n\nIn a statement, the Permanent Secretary for Transport and Infrastructural Development, Eng. Joy Makumbe said no contractor has been awarded the tender for the 440.4 kilometre project.\n\nThe Ministry of Transport and Infrastructural Development wishes to unreservedly apologise to members of the public and all its stakeholders for posting a Twitter message containing incorrect information on April 29, 2025, at 09:18 hours.\n\nThe Twitter message tagged a story published on April 28, 2025, by The Herald Online, which was headlined: Victoria Falls contractors on site. The Ministry acknowledges that no contractor is on site, as the tender process is still ongoing, the statement reads.\n\nThe permanent secretary said the error was due to a breach of internal protocol caused by their social media officer, who failed to verify the information.\n\nAdded Makumbe, One of the officers assigned the duty to manage the Ministrys Twitter handle conceded and acknowledged that she breached the internal Standard Operating Procedures for information verification by not verifying the authenticity of the facts with the technical officials in the Department of Roads before posting.\n\nThe Ministry stated that an evaluation committee will now review the bids before submitting its recommendations to the Special Procurement Oversight Committee.\n\nThe Ministry wishes to set the record straight on the matter as follows: the tender which was issued on April 17, 2025, closed on April 29, 2025, at 11:00 hours.\n\nAfter the closure of the bidding period, an evaluation committee will convene, whereupon the outcome will be sent to the Special Procurement Oversight Committee for oversight of the tender process before awarding the same to successful bidders, said Makumbe.\n\nThe reconstruction of the entire road is set to take 36 months, according to the Minister of Transport, Felix Mhona. The Bulawayo-Victoria Falls road is of major concern as it leads to Zimbabwes main tourist attraction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/16192007/Felix-Mhona.jpg",
            "description": "<p>By Staff Reporter The Ministry of Transport and Infrastructural Development has backtracked on its statement that contractors are now on site and rehabilitation of the dilapidated Bulawayo-Victoria Falls Road will soon start, claiming “wrong information was posted”. A state-run newspaper on Monday published an article stating that eight contractors involved in the rehabilitation of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-backtracks-on-bulawayo-vic-falls-road-rehabilitation-claims-as-concerns-are-raised-over-corruption-in-tender-awards/\">Govt backtracks on Bulawayo-Vic Falls road rehabilitation claims as concerns are raised over corruption in tender awards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "Geza declares war on Tagwirei, vows to block business tycoon’s rise to power",
            "url": "https://www.newzimbabwe.com/geza-declares-war-on-tagwirei-vows-to-block-business-tycoons-rise-to-power/",
            "content": "By Staff Reporter\n\nWAR veteran Blessed Geza has vowed to stop ZANU PF business tycoon Kudakwashe Tagwirei from ascending to the countrys presidency.\n\nGeza, who has made Tagwirei a target of criticism, is claiming that the controversial businessman has set his sights on replacing President Emmerson Mnangagwa.\n\nHis claims stem from Tagwireis proximity to Mnangagwa and recent endorsement by the partys Harare Province into the Central Committee.\n\nHe is not stopping there. He is now in the Central Committee, whose position he got through the back door. He is not stopping there, he wants to become the President of the country. That is unacceptable. We will not accept this, said Geza.\n\nBusinessman Kudakwashe Tagwirei(Photo credit JEKESAI NJIKIZANA/AFP/Getty Images)\n\nTagwirei, through his proxies, has been securing government contracts. He won a multimillion-dollar deal to construct the Mbudzi Interchange flyover.\n\nHe has also expanded his business interests into mining and has a near-monopoly in the fuel sector.\n\nAdditionally, Tagwirei has been spearheading the Command Agriculture programme and is currently the chairperson of the Land Tenure Implementation Committee.\n\nThe business moguls company, Sakunda Holdings, was implicated in the disappearance of $3 billion from the Ministry of Agriculture between 2017 and 2018.\n\nAs a result, Tagwirei was sanctioned by the United States of America, which accused him of assisting senior government officials in corruption.\n\nGeza blasted Tagwirei and tenderpreneur Wicknell Chivayo, accusing them of corruption, which is bleeding the country.\n\nLook at the effects of this corruption. Our civil servants are getting peanuts. University lecturers are on strike protesting poor salaries. Even students have joined their lecturers.\n\nWhen you see University lecturers demonstrating, know the situation has deteriorated. It is a mockery when Chivayo, a grade seven, is being given millions just because they are close to Mnangagwa, said Geza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter WAR veteran Blessed Geza has vowed to stop ZANU PF business tycoon Kudakwashe Tagwirei from ascending to the country’s presidency. Geza, who has made Tagwirei a target of criticism, is claiming that the controversial businessman has set his sights on replacing President Emmerson Mnangagwa. His claims stem from Tagwirei’s proximity to Mnangagwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geza-declares-war-on-tagwirei-vows-to-block-business-tycoons-rise-to-power/\">Geza declares war on Tagwirei, vows to block business tycoon’s rise to power </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "March 31 protest: Bail hearing of 94 protesters postponed again as prosecutors ask for more time",
            "url": "https://www.newzimbabwe.com/march-31-protest-bail-hearing-of-94-protesters-postponed-again-as-prosecutors-ask-for-more-time/",
            "content": "By Staff Reporter\n\nHigh Court judge, Justice Philipa Philips was on Wednesday forced to postpone the hearing of a bail appeal application by 94 individuals who were locked up on allegations of staging protests on March 31.\n\nOnly one of the 95, Munyaradzi Mazhiririwas granted bail.\n\nThe case could not be heard last week as state papers were not in order.\n\nOn Wednesday, the state stalled progress after prosecutors requested to call the investigating officer to testify against the suspects.\n\nThe hearing was then moved to next Monday.\n\nThe 94 are accusedof participating in a gathering with theintentionto promote public violence.\n\nThe state alleges the group took heed of calls by war veteran, Blessed Geza, currently in hiding, to protest against President Emmerson Mnangagwa.\n\nAccording to the State, on 31 March 2025 at around 0920 hours, the accused gathered at Robert Mugabe Square commonly known as the Freedom Square intending to march in the streets of Harare.\n\nProsecutors allege the group also wanted to proceed to the State House of Zimbabwe and forcibly remove the Constitutionally elected President Emmerson Mnangagwa.\n\nThe accused were making their vows of removing the President saying enough is enough, Mnangagwa must go, ED must go nezvigananda zvake.mMadzibaba veshanduko huyai mutitungamirire, comrade Geza huyai mutitungamirire and whistled.\n\nPolice officers who were deployed for maintenance of order observed about two hundred 200 people gathered and approached the group.\n\nThe accused piled stones, bricks and tyres along Robert Mugabe road. They threw stones towards the police officers whilst singing Hatidi zvekupihwa order nemasasikamu. They also took themselves pictures and videos which they posted on various social media platforms, reads court papers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133846/march-7.png",
            "description": "<p>By Staff Reporter High Court judge, Justice Philipa Philips was on Wednesday forced to postpone the hearing of a bail appeal application by 94 individuals who were locked up on allegations of staging protests on March 31. Only one of the 95, Munyaradzi Mazhiriri was granted bail. The case could not be heard last week as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protest-bail-hearing-of-94-protesters-postponed-again-as-prosecutors-ask-for-more-time/\">March 31 protest: Bail hearing of 94 protesters postponed again as prosecutors ask for more time   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "‘It is a damaging reinforcement of gender-based disrespect’ — Moja Love condemns MacG’s derogatory language",
            "url": "https://www.newzimbabwe.com/it-is-a-damaging-reinforcement-of-gender-based-disrespect-moja-love-condemns-macgs-derogatory-language/",
            "content": "TshisaLive\n\nIn a surprise turn of events, Moja Love has made a bold statement against misogyny and derogatory language on air.\n\nIn a recent episode ofPodcast and Chill, while discussing Minnie Dlaminis break-up from plastic surgeon Dr Brian Monaisa, MacG questioned why the media personality cannot keep a man and suggested her private parts could have an unpleasant smell.\n\nMoja Love released a statement on social media condemning the behaviour of MacG for using offensive language towards women.\n\nMacGs persistent use of derogatory language towards women, reducing them to vulgar slurs and objectifying their bodies, is not only offensive, it is a damaging reinforcement of gender-based disrespect. Such behaviour has no place in society and media specifically, where voices should uplift, not degrade. Moja Love (DStv 157) as a platform is committed to fostering a respectful and inclusive environment. We refuse to stay silent.\n\nMisogyny on air doesnt only harm the individuals targeted, it perpetuates a toxic culture that normalises the dehumanisation of women. Yesterday we took a firm stance against this conduct, and we will continue to challenge such rhetoric whenever it arises. Media is designed to shape societal norms, and with that influence comes responsibility. To MacG and others who use their platforms carelessly: accountability is not optional. We urge audiences and broadcasters alike to reject sexist vitriol and demand better. Respect isnt a privilege, its a right.\n\nThe channel has also received flack for airing a recent episode of the reality showIsencane Lengane.\n\nThe show, in its seventh season, which follows the lives of Siyacela Dlamuka and Thando Msomi, who married when they were teenagers,sparked outrage among viewers, with many raising concerns about the couples toxicity.\n\nAccording to Moja Love,Isencane Lenganeis designed to contribute to the discourse on gender-based violence and societal ills, with the aim of raising awareness and promoting positive change.\n\nMoja Love said they are committed to providing psychological support to affected members, including Thando, who was affected by events depicted in the show, and would continue to offer support.\n\nIt is important to note the show is a reality show which reflects, explores and raises awareness and contributes to the discourse on gender-based violence and societal ills. The channel has through many of its social justice programmes played a pivotal role in shaping discourse and contributing positively in society, read thestatement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/30072806/macg.png",
            "description": "<p>TshisaLive In a surprise turn of events, Moja Love has made a bold statement against misogyny and derogatory language on air. In a recent episode of Podcast and Chill, while discussing Minnie Dlamini’s break-up from plastic surgeon Dr Brian Monaisa, MacG questioned why the media personality cannot “keep a man” and suggested her private parts could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-is-a-damaging-reinforcement-of-gender-based-disrespect-moja-love-condemns-macgs-derogatory-language/\">‘It is a damaging reinforcement of gender-based disrespect’ — Moja Love condemns MacG’s derogatory language</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "Men and boys reluctant to report sexual exploitation – Adult Rape Clinic",
            "url": "https://www.newzimbabwe.com/men-and-boys-reluctant-to-report-sexual-exploitation-adult-rape-clinic/",
            "content": "By Thandiwe Garusa\n\nMEN and boys are still falling victim to sexual exploitation, often in silence, statistics from Adult Rape Clinic (ARC) have revealed.\n\nSpeaking at a press conference Tuesday, Maceline Makwamba, Director for ARC, said this was due to cultural norms which discourage men from speaking out about their experiences.\n\nAccording to the ARC, only 1% of victims are courageous enough to come forward.\n\nShe said many more cases likely go unreported due to stigma.\n\nLooking at our cultural context, men are usually discouraged from even stating that they have been sexually exploited.\n\nIt is only recently that we have been hearing in the media about the exploitation of young boys, especially in schools, but this does not happen only in schools, but within the communities.\n\nMen have been cultured not to state how they feel and their experiences, especially when it comes to intimate sexual relationships, they usually keep quiet.\n\nAccording to our statistics at Adult Rape Clinic, it is only 1% of the boys and men that are brave enough to come through and say yes I need to be supported but we believe that there are also more men out there that are being sexually exploited, Makwamba said.\n\nShe also urged men to come forward for support if they are violated, assuring them of their privacy, confidentiality and anti-stigmatisation.\n\nShe also said ARC has virtual services for those who are uncomfortable with visiting the clinic physically.\n\nThere has been a rise in reported cases involving older men sexually abusing young boys, particularly in school settings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/30054022/WhatsApp-Image-2025-04-29-at-19.17.18.jpeg",
            "description": "<p>By Thandiwe Garusa MEN and boys are still falling victim to sexual exploitation, often in silence, statistics from Adult Rape Clinic (ARC) have revealed. Speaking at a press conference Tuesday, Maceline Makwamba, Director for ARC, said this was due to cultural norms which discourage men from speaking out about their experiences. According to the ARC,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/men-and-boys-reluctant-to-report-sexual-exploitation-adult-rape-clinic/\">Men and boys reluctant to report sexual exploitation – Adult Rape Clinic</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "Mnangagwa banks on UN Security Council seat to save faltering international re-engagement",
            "url": "https://www.newzimbabwe.com/mnangagwa-banks-on-un-security-council-seat-to-save-faltering-international-re-engagement/",
            "content": "By Staff Reporter\n\nIF successfully voted into the United Nations Security Council, President Emmerson Mnangagwa will use the non-permanent seat to attract and win over the West, cabinet has been told.\n\nThis follows hurdles faced by his regime in re-engaging with countries such as America, the United Kingdom (UK), Australia and Canada, who have all continuously raised red flags on unattended issues such as human rights abuses and corruption.\n\nA seat on the UN Security Council means Zimbabwe will have an opportunity to thaw relations with the five permanent members: China, France, Russia, UK, and America.\n\nElections will be held at this years UN General Assembly in September, in New York, with Zimbabwe getting backing from regional body SADC members, the African Union (AU), Russia and Belarus.\n\nMnangagwa is expected to launch Zimbabwes campaign there.\n\nIf successful, this will be the third time Zimbabwe has had a non-permanent seat on the UN Security Council, having sat in 1983-1984 and 1991-1992.\n\nThe outcome will be the reaffirmation of the countrys commitment to upholding international peace and security as well as the generation of international goodwill towards the country, said Information Minister Jenfan Muswere at Tuesdays post-Cabinet media briefing.\n\nOnly Russia and China, amongst the permanent members, have cordial relations with Zimbabwe.\n\nMnangagwa recently suspended tariffs on goods from America so as to build what he said was a positive relationship with the superpower and its President Donald Trump.\n\nHe has been trying to court America and other financial powers since his ascension to President via a November 2017 coup.\n\nDespite this, a history mired in bloody and fatal clampdowns on dissent such as the August 1 shootings of protestors, the January 2019 internet shutdown, killings of opposition supporters such as Mboneni Ncube, arrests and abduction of human rights activists and allegations of rigged elections, have all maintained Zimbabwes image as a rogue state and Mnangagwas as one of the worlds bad boys.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/21195348/mnangagwa-at-unga.webp",
            "description": "<p>By Staff Reporter IF successfully voted into the United Nations Security Council, President Emmerson Mnangagwa will use the non-permanent seat to attract and win over the West, cabinet has been told. This follows hurdles faced by his regime in re-engaging with countries such as America, the United Kingdom (UK), Australia and Canada, who have all</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-banks-on-un-security-council-seat-to-save-faltering-international-re-engagement/\">Mnangagwa banks on UN Security Council seat to save faltering international re-engagement</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "CBZ hails Zim’s less volatile economy; profits hit ZWG537,5 million",
            "url": "https://www.newzimbabwe.com/cbz-hails-zims-less-volatile-economy-profits-hit-zwg5375-million/",
            "content": "By Alois Vinga\n\nCBZ Holdings Limited has hailed the countrys easing inflationary pressures, which have partly contributed towards the groups attainment of ZWG537,5 million profits during the first quarter of the year.\n\nThe remarks come at a time when the local ZWG currency has maintained stability for over six months, though on the back of a tight policy stance, which has triggered concerns from some economic players.\n\nJust recently, the central bank took a very bold decision which saw the liberalisation of the exchange rates for traders in yet another move believed to wield stability potential.\n\nPresenting a trading update for the first quarter period ended March 31 2025, CBZs Group Chief Governance Officer, Rumbidzayi Jakanani, described the periods environment as stable.\n\nDespite the negative global economic sentiments, Zimbabwes operating environment was less volatile, with relative stability in the goods and foreign exchange markets, supported by a disciplined monetary policy environment. In the foreign exchange markets, the local currency marginally lost 3.75% year-to-date against the US dollar to close March 2025 at a rate of ZWG26.77 to the Dollar, she said.\n\nDuring the period under review, the Group delivered strong financial results, reflected in a profit after tax of ZWG537.53 million, from a total income of ZWG1.41 billion, a testament to its financial position strength and capitalisation, reinforced by a substantial market presence in deposit mobilisation and transactional volumes.\n\nThe groups top-line performance was underpinned by a solid contribution from funded income at ZWG486.24 million, while non-funded income at ZWG938.03 million delivered particularly strong results for the quarter.\n\nCBZs asset base closed the quarter at ZWG 38.75 billion, supported by a deposit base of ZWG26.79 billion, with a performance which provides a foundation and sets the tone for the remainder of the financial year, highlighting our commitment to delivering sustainable value to all stakeholders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/05/07065801/CBZ-Bank.jpg",
            "description": "<p>By Alois Vinga CBZ Holdings Limited has hailed the country’s easing inflationary pressures, which have partly contributed towards the group’s attainment of ZWG537,5 million profits during the first quarter of the year. The remarks come at a time when the local ZWG currency has maintained stability for over six months, though on the back of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cbz-hails-zims-less-volatile-economy-profits-hit-zwg5375-million/\">CBZ hails Zim’s less volatile economy; profits hit ZWG537,5 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "Chipinge woman jailed 12 years for defrauding job seekers",
            "url": "https://www.newzimbabwe.com/chipinge-woman-jailed-12-years-for-defrauding-job-seekers/",
            "content": "By Staff Reporter\n\nA CHIPINGE woman has been sentenced to 12 years imprisonment for defrauding desperate job seekers of money amounting to US$40,020.\n\nPatricia Muyambo Magazini was convicted by the Chipinge Magistrate Court on 9 counts of fraud after she had promised nurse training vacancies to the job seekers at Mashoko Hospital.\n\nThe National Prosecuting Authority said, Magazini would contact potential job seekers and request money for training, accommodation and uniforms.\n\nThe accused falsely presented herself as an employee of the Ministry of Health stationed at Mashoko Hospital. She would contact potential victims, sometimes through intermediaries, offering the opportunity for enrollment in training programs.\n\nIn one instance, she contacted a prophetess claiming to be grateful for past prayers and used this connection to offer the fraudulent training opportunity. The offender would then request money from the victims, purportedly for training expenses, accommodation, and uniforms.\n\nThese payments were made through various money transfer methods such as Mojomula, Innbucks, Mukuru, and Ecocash, said the prosecution.\n\nFurthermore, Magazini would promise the victims that their names would be published in state-run newspapers for confirmation of enrollment.\n\nThe offender received the money from the complainants. In some cases, intermediaries were used to collect and consolidate payments from multiple individuals. To maintain the deception, the accused would make false promises, such as claiming that the victims names would be published in official publications like the Herald and Sunday Mail.\n\nWhen victims began to question the legitimacy of the scheme, the offender would make excuses and provide false reassurances. The scheme was carried out over a period of time, with different counts relating to different groups of victims and timeframes.\n\nMagazini got a 10-year suspension on the condition of good behaviour and restitution, and will only serve 2 years in prison.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Staff Reporter A CHIPINGE woman has been sentenced to 12 years imprisonment for defrauding desperate job seekers of money amounting to US$40,020. Patricia Muyambo Magazini was convicted by the Chipinge Magistrate Court on 9 counts of fraud after she had promised nurse training vacancies to the job seekers at Mashoko Hospital. The National Prosecuting</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chipinge-woman-jailed-12-years-for-defrauding-job-seekers/\">Chipinge woman jailed 12 years for defrauding job seekers </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        },
        {
            "title": "Police say Gweru constable to face criminal and disciplinary action after high-speed chase leaves two dead",
            "url": "https://www.newzimbabwe.com/police-say-gweru-constable-to-face-criminal-and-disciplinary-action-after-high-speed-chase-leaves-two-dead/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Republic Police (ZRP) has said investigations are underway after a high-speed chase left two dead in Gweru.\n\nThis follows a viral video online showing a Toyota Aqua vehicle crashed into a tree along Bristol Road, Gweru and the two car occupants dead.\n\nEyewitnesses at the scene alleged the car was being pursued by police when the accident happened, and the officer, Constable Sakala had fled.\n\nIn a statement, ZRP spokesperson Commissioner Paul Nyathi said Sakala of ZRP Mkoba will face criminal and disciplinary action.\n\nThe Zimbabwe Republic Police confirms that investigations are being conducted in connection with a fatal road traffic accident which occurred along Bristol Road on April 28, 2025, at around 2230 hours where two Toyota Aqua occupants died on the spot when their vehicle hit a tree in a speed chase with Constable Sakala of ZRP Mkoba.\n\nThe police have taken note of the videos circulating on social media platforms in relation to the accident.\n\nThe Zimbabwe Republic Police reiterates that both criminal and disciplinary action will be taken against Constable Sakala for his conduct, said Nyathi.\n\nThe ZRP has expressed its condolences to the families of the victims.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Republic Police (ZRP) has said investigations are underway after a high-speed chase left two dead in Gweru. This follows a viral video online showing a Toyota Aqua vehicle crashed into a tree along Bristol Road, Gweru and the two car occupants dead. Eyewitnesses at the scene alleged the car was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-say-gweru-constable-to-face-criminal-and-disciplinary-action-after-high-speed-chase-leaves-two-dead/\">Police say Gweru constable to face criminal and disciplinary action after high-speed chase leaves two dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:40",
            "date": "30 Apr 2025"
        }
    ]
}