{
    "news": [
        {
            "title": "Dangote returns to Zimbabwe after a decade, says he sees transparency now – pledges US$1 billion investment",
            "url": "https://www.newzimbabwe.com/dangote-returns-to-zimbabwe-after-a-decade-says-he-sees-transparency-now-pledges-us1-billion-investment/",
            "content": "By Alois Vinga\n\nAfricas richest man, Aliko Dangote, has announced plans to invest over US$1 billion in Zimbabwe, saying he is confident in the countrys renewed transparency and improved business climate,a sharp contrast to his first experience in 2015 when proposed deals collapsed amid bureaucracy and corruption.\n\nDuring his 2015 visit, the Dangote Group founder and CEO met then-President Robert Mugabe and expressed interest in developing the Sengwa coal fields and constructing a 2,800MW coal-fired power plant. However, the projects failed to take off after frustrations over red tape and alleged demands for kickbacks from officials.\n\nAt the time, investors were not allowed to charge for electricity in foreign currency, and Dangotes proposal hinged on cost-reflective tariffs in U.S. dollars. The situation has since changed, with the government now permitting independent power producers to set tariffs and repatriate profits.\n\nFollowing a meeting with President Emmerson Mnangagwa on Wednesday, Dangote announced that his conglomerate would roll out new projects in cement production, power generation, and a fuel pipeline.\n\nThe government views the planned investment as part of its broader effort to industrialise the economy, add value to local resources and create employment.\n\nDangote Industries Limited, one of Africas largest conglomerates, operates across multiple sectors, including cement, sugar, oil refining, and fertilizer production. Its expansion into southern Africa could position Zimbabwe as a strategic link in a regional oil and fertilizer supply network connected through Namibias Walvis Bay.\n\nAsked why he decided to return after nearly a decade, Dangote said:There is a lot of change between that time when we came and right now,its solid. There is a lot of transparency. When you look at what His Excellency President Emmerson Mnangagwa has done in terms of turning the economy around, that is what gave us the confidence to say, This is the right time to come and invest. Its like someone has passed an exam,people have to give him a good mark.\n\nHe confirmed that an agreement had been signed between Zimbabwe and the Dangote Group covering several sectors:\n\nSome of our investments will be in cement manufacturing, power generation, and the supply of petroleum products. We are also in the business of producing petroleum; we have one of the largest refineries in the world, he said.\n\nDangote added that while the investment package is broad, further details on specific figures and timelines would be shared as implementation progresses.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12152026/dangote_mthuli.jpg",
            "description": "<p>By Alois Vinga Africa’s richest man, Aliko Dangote, has announced plans to invest over US$1 billion in Zimbabwe, saying he is confident in the country’s renewed transparency and improved business climate, a sharp contrast to his first experience in 2015 when proposed deals collapsed amid bureaucracy and corruption. During his 2015 visit, the Dangote Group founder</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dangote-returns-to-zimbabwe-after-a-decade-says-he-sees-transparency-now-pledges-us1-billion-investment/\">Dangote returns to Zimbabwe after a decade, says he sees transparency now – pledges US$1 billion investment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Diaspora Insurance launches 2025 Charity Campaign",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-launches-2025-charity-campaign/",
            "content": "By Chipo Sabeta\n\nDiaspora Insurancehas launched its 2025 Charity Campaign, a major initiative aimed at supporting underprivileged communities across Africa.\n\nOperating in 25 African countries, Diaspora Insurance plans to use its broad network to make a tangible difference where it matters most among the less privileged.\n\nAt the launch event held at theDiaspora Insuranceheadquarters in Birmingham, Miss Ruvarashe Madzingo, the Head of Charity Events, shared details of how the campaign will unfold.\n\nWe will be reaching out to clients across all 25 countries, inviting them to nominate a charity of their choice. After collecting all nominations, well be selecting 10 charities from the list. Each of these will receive a 1,000 donation from Diaspora Insurance to go towards celebrating the festive season. A total of 10,000 will be given out through this initiative, said Madzingo.\n\nA live draw will take place on November 28, where one of the selected charities will also become the main beneficiary of Diaspora Insurances 2025 charity mission, receiving full support throughout the year.\n\nThis inclusive approach allows clients to take part directly in shaping the campaign, reflecting the shared spirit of compassion and unity that defines Diaspora Insurances diverse community.\n\nAdded Madzingo, Since Diaspora Insurances inception, community service has been central to who we are. Even in our early days, when resources were limited, we made it a point to support the elderly, children, and persons with disabilities. We are a community-oriented company, and this campaign is simply a continuation of that journey.\n\nThrough the 2025 Charity Campaign,Diaspora Insurancehopes not only to touch lives but also to inspire others to give.\n\nDiaspora Insurance is widely recognised for its work within African and other diaspora communities across the UK, Europe, North America, and beyond. Beyond providing financial security through products such as the Diaspora Funeral Cash Plan, the company is also active in various Corporate Social Responsibility (CSR) initiatives and charities that support community welfare, cultural development, and empowerment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/21085608/Diaspora-Insurance-House.png",
            "description": "<p>By Chipo Sabeta Diaspora Insurance has launched its 2025 Charity Campaign, a major initiative aimed at supporting underprivileged communities across Africa. Operating in 25 African countries, Diaspora Insurance plans to use its broad network to make a tangible difference where it matters most among the less privileged. At the launch event held at the Diaspora</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-launches-2025-charity-campaign/\">Diaspora Insurance launches 2025 Charity Campaign</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "‘Mugabe was bad, this is worse’ – Chamisa condemns abduction, torture of CUT students as Amnesty International demands investigation",
            "url": "https://www.newzimbabwe.com/mugabe-was-bad-this-is-worse-chamisa-condemns-abduction-torture-of-cut-students-as-amnesty-international-demands-investigation/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has condemned the abduction and torture of two Chinhoyi University of Technology (CUT) students during Students Representative Council (SRC) election campaigns, describing the brutality as barbaric and pure evil.\n\nThe students, Marlvin Saint Madanda and Lindon Zanga, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi.\n\nAccording to ZINASU, the two were taken by unidentified individuals driving an unmarked grey Isuzu, a vehicle that had previously been seen on the CUT campus distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nMadanda and Zanga were later found in Shamva, about 120 kilometres from where they were abducted, visibly injured, shaken, and unable to sit or walk properly.\n\nNarrating their ordeal, Zanga said they were tortured for more than 12 hours for allegedly chanting slogans deemed to be against the ruling ZANU PF party during their SRC campaign.\n\nThe abductors took us to a forest and accused us of campaigning and chanting slogans against ZANU PF, Zanga said. We clearly told them we were simply conducting ZINASU campaigns, which had nothing to do with ZANU PF.\n\nDear Mr MnangagwaThis is why this evil must be fought for as long as is necessary, . even for the rest of our lives or with our own lives. This is wrong in all material respects!pic.twitter.com/Kau1kuozeZ\n\n nelson chamisa (@nelsonchamisa)November 11, 2025\n\nChamisa compared the attack to atrocities committed under the late former president Robert Mugabe, saying the current wave of repression was even worse.\n\nDuring Mugabes long tenure, opposition activists were routinely abducted, tortured and killed for being critical of his administration and ruling party.\n\nWriting on X, Chamisa said: Dear @PoliceZimbabwe, why should this terrorism and primitive brutality on harmless students and innocent citizens be allowed to continue? Mr Mnangagwa, why should this not worry or concern you? Mugabe was bad. This is worse. So barbaric. This is pure evil!\n\nMeanwhile, human rights organisation Amnesty International has called for a thorough investigation into the attack and urged authorities to protect students rights to peaceful assembly and association.\n\nThese attacks threaten not just freedoms of assembly, expression, and association, but also the rights to education, non-discrimination, academic freedom, and participation in university public life.\n\nWe urge the authorities to thoroughly investigate these attacks and ensure that students can exercise their freedom of expression and peaceful assembly without fear of reprisals, intimidation, or torture, Amnesty International said in a statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has condemned the abduction and torture of two Chinhoyi University of Technology (CUT) students during Students Representative Council (SRC) election campaigns, describing the brutality as “barbaric and pure evil.” The students, Marlvin Saint Madanda and Lindon Zanga, who are members of the Zimbabwe National Students Union (ZINASU), were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabe-was-bad-this-is-worse-chamisa-condemns-abduction-torture-of-cut-students-as-amnesty-international-demands-investigation/\">‘Mugabe was bad, this is worse’ – Chamisa condemns abduction, torture of CUT students as Amnesty International demands investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Legacy Protection Through Enduring Wealth and Businesses",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-legacy-protection-through-enduring-wealth-and-businesses/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This mens month, we want to discuss a topical issue among men, which is, how do you ensure that your business or wealth is grown from one generation to the next and not wasted?\n\nVM: It is a great question, I believe it is one that vexes the minds of a lot of men.\n\nHaving worked so hard to grow personal wealth, in some instances in classic rags-to-riches fashion, how does one ensure that the wealth is not dissipated by the next generation? Zimbabwe is rife with stories of men who achieved unimaginable wealth within their lifetimes, which is lost completely by the first generation of beneficiaries.\n\nThis is deeply disconcerting.\n\nOne can only mitigate against this eventuality and it cannot be through legal protections only, although they are quite useful. There is a need for training or a meeting of minds between the benefactor and potential beneficiary; otherwise, leaving money or wealth without the wisdom to maintain and grow it is similar to throwing it in a deep dark hole.\n\nSome families go to the extent of having a family constitution that guides issues to do with succession, how people are cared for by the business of the familyetc,outside of the other protective mechanisms available in law.\n\nAlthough such protective mechanisms are noble, they are supposed to be implemented while considering existing and future disruptive technologies and the evolving nature of businesses. It is therefore my considered view that at the cornerstone of whatever protective mechanism in law is put in place, the family must have a common vision that guides it, which vision is bigger than individual avarices.\n\nThis, when achieved, may retain and even grow the family wealth.\n\nIf I were to use a local example, the rural home kumusha does not belong to anyone through title; each custodian has a duty to maintain and improve it for the benefit of the next generation. That must be, in my view, how generational wealth is created, through compounding.\n\nReporter:I am convinced by your proposition. What legal protections would complement this?\n\nVM: Having addressed the soft laws within the family, being the family visionet cetera, the next question is how the benefactor codifies this vision so that it becomes binding. The first step is to ensure that the companies holding the businesses have articles of association and shareholder agreements that speak to some of the protective clauses required for the envisioned continuity.\n\nYou will be surprised by the number of people who have generic articles of association or shareholder agreements that do not speak specifically to their intended posterity. The omission is staggering as these documents define types of shares, voting rights, how shares are transferred and to whom, decision-making protocols, dispute resolution mechanisms and even governing structures.\n\nReporter: I had not imagined the importance of personalising these company documents!\n\nVM: Indeed, you are one of many.\n\nThe company documents are the first layer of protection. Although they may be protective from a legacy perspective, they must be fluid enough to evolve.\n\nThe next layer will be to create a family trust which is tailored to the familys specific goals and idiosyncrasies. Trusts are flexible and should be customised. The shares of the business, properties and other family investments may be housed in the trust, which ultimately becomes the family constitution prescribing how the family assets should be protected, whether through either majority votes when disposing assets or unanimous votes.\n\nIn some jurisdictions, life policies are housed in trusts and loans are taken out against them for daily business.\n\nThere are other benefits that come with setting up the trust, such as easier succession, as it is dealt with within the document, resulting in cheaper probate or estate duties.\n\nReporter: I think that is very clear. Are there any other protections available to safeguard the businesses and wealth?\n\nVM: Well, I think the role of intellectual property protections is understated in Zimbabwe. It is my belief that more businesses should register their trademarks to protect them from eleventh-hour businesses that want to benefit from the established goodwill.\n\nLastly, keeping records is key even to understanding the intentions of the benefactors or proprietors. I think an unnecessary number of businesses fail to keep a proper record of their statutory and operational documents, for example, their standard operating procedures. These documents are useful in understanding how the business navigated certain situations.\n\nReporter: Thank you, Mr. Madzima we have to end here, because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12033353/Newzimbabwe.com-Artwork-750x500_20251111_222229_0000.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This ‘men’s month’, we want to discuss</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-legacy-protection-through-enduring-wealth-and-businesses/\">Legal Discussions with Vengai Madzima: Legacy Protection Through Enduring Wealth and Businesses   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Man blows money mistakenly deposited into his bank accounts",
            "url": "https://www.newzimbabwe.com/man-blows-money-mistakenly-deposited-into-his-bank-accounts/",
            "content": "By Staff Reporter\n\nA RUSAPE man has appeared in court for squandering money mistakenly deposited into his bank account.\n\nGarikai Mtangandebvu (30) of Vengere, Rusape, was convicted of theft when he was arraigned before the Rusape Magistrates Court.\n\nHe unlawfully converted to his personal use US$1,885.45 and ZWL238,638.90, funds, which were intended for another individual with the same name.\n\nCourt heard that, sometime in July 2025, the offender, who works for a wholesale shop, got suspicious deposits into his bank accounts. Instead of notifying the bank or the rightful owner, Mtangandebvu withdrew the money and used it for personal benefit.\n\nIt was further heard that, when the legitimate recipient made a claim, the company discovered the error and reported the matter to the police.\n\nNothing was recovered from the offender.\n\nMtangandebvu was slapped with 36 months imprisonment, of which six months were suspended on condition of good behaviour. A further 15 months were set aside on condition of full restitution to the complainant. The remaining 15 months were suspended on condition that he perform 525 hours of community service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>By Staff Reporter  A RUSAPE man has appeared in court for squandering money mistakenly deposited into his bank account. Garikai Mtangandebvu (30) of Vengere, Rusape, was convicted of theft when he was arraigned before the Rusape Magistrates Court. He unlawfully converted to his personal use US$1,885.45 and ZWL238,638.90, funds, which were intended for another individual</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-blows-money-mistakenly-deposited-into-his-bank-accounts/\">Man blows money mistakenly deposited into his bank accounts </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Parliament commits to push for increased roads infrastructure funding",
            "url": "https://www.newzimbabwe.com/parliament-commits-to-push-for-increased-roads-infrastructure-funding/",
            "content": "By Alois Vinga\n\nParliament has pledged to advocate for a reasonable budget allocation towards road infrastructure development amid growing calls for contractors to complete their assigned projects within set timeframes.\n\nIn recent years, Zimbabwe has invested significantly in major road infrastructure projects, including the rehabilitation and upgrading of the BeitbridgeBulawayoVictoria Falls Road, the HarareChirundu Highway, the Trabablas Interchange and the planned dualisation of the HarareNyamapanda Road. Other projects, such as the Mabvuku Interchange in Harare, are also underway.\n\nSpeaking at a recent media engagement, Goromonzi West legislator Biatah Nyamupinga, who sits on the Parliamentary Portfolio Committee on Transport and Infrastructure Development, said her committee is committed to advocating for increased allocations to the Transport Ministry as the country prepares for the 2026 National Budget.\n\nAs we approach the budget process, our committee commits to pushing for a reasonable allocation to the Transport Ministry. They need adequate resources to complete the ongoing road projects. The Ministry is doing a commendable job, and we are seeing progress across the country. Lets ensure these roads are completed, she said.\n\nNyamupinga urged the Transport Ministry to openly communicate any challenges it faces so Parliament can channel them to the relevant authorities for redress.\n\nShe also called on contractors to adhere to agreed timelines.\n\nIn some of the areas we have visited, contractors promised to complete their projects by March next year. Lets ensure those targets are met. Delivering on time will strengthen our case when we lobby for bigger allocations. We can then proudly say contractors are delivering the work they were paid for, she added.\n\nDue to high infrastructure demands, the Transport Ministry reportedly exceeded its 2024 national budget allocation by 245% within six months, prompting fresh calls for supplementary funding to sustain projects until year-end.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/20050128/Road-project.jpeg",
            "description": "<p>By Alois Vinga Parliament has pledged to advocate for a reasonable budget allocation towards road infrastructure development amid growing calls for contractors to complete their assigned projects within set timeframes. In recent years, Zimbabwe has invested significantly in major road infrastructure projects, including the rehabilitation and upgrading of the Beitbridge–Bulawayo–Victoria Falls Road, the Harare–Chirundu Highway,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-commits-to-push-for-increased-roads-infrastructure-funding/\">Parliament commits to push for increased roads infrastructure funding </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        },
        {
            "title": "Zimbabwean art finds global resonance in two new exhibitions",
            "url": "https://www.newzimbabwe.com/zimbabwean-art-finds-global-resonance-in-two-new-exhibitions/",
            "content": "Artgal.Online\n\nIn recent years, both market and institutional interest in contemporary African art has surged, and a new landscape of artists from the continent is quickly rising. Founded by Dennis Ruf, who is also the co-founder of Swiss-Zim Heritage Gallery,Artgal.Onlinechampions Zimbabwean art and artists, offering insight into both the rich creative traditions of the country, and the dialogues that arise when juxtaposed with other international contexts. Two upcoming exhibitions facilitated by Artgal.Online present an opportunity to explore Zimbabwean and other contemporary African art.\n\nDebuting November 28, 2025, is Heritage & Horizons, which can be viewed both online and in-person in Berlin, with exact venue details forthcoming. Exhibiting Zimbabwean artists within the milieu of Berlins own robust art scene invites dialogue around how history, heritage, and material exploration influence and inform artmaking today across countries and cultures.\n\nKeith Zenda,From Seeds to Strength(2025). Courtesy of Artgal.Online.\n\nBerlin marks both an end and a beginning said Ruf, Heritage & Horizons closes our 2025 season by bridging continents through artaffirming that heritage is living, transforming, and shared. It leads directly into our next chapter as we deepen our roots and widen our horizons.\n\nHeritage & Horizons includes both figurative and abstract works, ranging from mixed-media compositions from Flatter Zenda to a painting by Barry Lungu, whose compositions elevate everyday moments to near mythos.\n\nFlatter Zenda,The Ties that Bind Us(2025). Courtesy of Artgal.Online.\n\nOur artists carry stories that travelthrough color, texture, and symbol, Ruf added, in Berlin we celebrate that journey, and with the Artgal Zim Center we create a home for it: a place to learn, mentor, archive and dream, so the next generation can stand taller.\n\nLater in the year, Artgal.Online and Swiss-Zim Heritage will jointly stage Roots & Horizons  Christmas Edition, a seasonal show that platforms artists whose work reflects the diverse facets of heritage, identity, and spiritual renewal. Viewable online as well as at the Art84 Gallery in Zimbabwes capital city of Harare, the exhibition promises visitors a sweeping look at how Zimbabwean artistsboth established and emergingengage with their ancestral roots to find new pathways forward into the future.\n\nRoots & Horizons  Christmas Edition is more than an exhibition, said Ruf, its a reflection of gratitude. As the year closes, we celebrate the artists who remind us of where we come from and the possibilities ahead. This season, we wanted to bring art closer to everyoneonline and in personbecause art unites us. It transcends borders and, like the holidays, invites warmth and shared humanity.\n\nFrom realistic canvases by Nokuthula Mpofu and otherworldly portraits by Florah Maphosa to photorealistic drawings by Willard Mujuru and fantastical scenes painted by Keith Zenda, the exhibition traverses subject and medium to bring to life a comprehensive artistic world of possibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11173133/barry-lungu-joyful-leap-2024-1536x1097-1.webp",
            "description": "<p>Artgal.Online In recent years, both market and institutional interest in contemporary African art has surged, and a new landscape of artists from the continent is quickly rising. Founded by Dennis Ruf, who is also the co-founder of Swiss-Zim Heritage Gallery, Artgal.Online champions Zimbabwean art and artists, offering insight into both the rich creative traditions of the country,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-art-finds-global-resonance-in-two-new-exhibitions/\">Zimbabwean art finds global resonance in two new exhibitions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:47",
            "date": "12 Nov 2025"
        }
    ]
}