{
    "news": [
        {
            "title": "Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces",
            "url": "https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced.\n\nLast month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare.\n\nThe embassy later extended the validity of visas for Zimbabwean applicants working as crew members on ships or airlines to 24 months with multiple entry, with an option of applying outside Zimbabwe due to the pause on immigrant and non-immigrant visa services.\n\nIn a statement Monday, the U.S embassy said the pause remains in effect and Zimbabweans seeking non-immigrant visas can only apply in Johannesburg, while non-residents must use embassies in their countries of habitual residence.\n\nThe pause on visa services in Zimbabwe remains in effect.\n\nZimbabwean residents applying for non-immigrant visas may only apply at the U.S. Consulate General in Johannesburg.\n\nIf you are not a resident of Zimbabwe, you must apply at a U.S. embassy or consulate in your country of habitual residence, the statement reads.\n\nThe authorities also warned of possible long wait times, stricter qualification hurdles for applicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality.\n\nApplicants who schedule non-immigrant visa interviews at a U.S. embassy or consulate outside their country of nationality or residence may face greater difficulty qualifying for the visa. Visa application fees are nonrefundable.\n\nMeanwhile, those applying for visas were recently directed to adjust the privacy settings of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS seeking non-immigrant visas can now apply only in South Africa, the United States Embassy in Harare has announced. Last month, the U.S Embassy announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas in Harare. The embassy later extended the validity of visas for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-seeking-non-immigrant-visas-to-apply-in-south-africa-as-suspension-continues-u-s-embassy-announces/\">Zimbabweans seeking  non-immigrant visas to apply in South Africa as suspension continues – U.S Embassy announces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe",
            "url": "https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhalas home, describing it as a barbaric act of violence and urged authorities to thoroughly investigate and arrest perpetrators.\n\nThe incidentreportedlyoccurredon August 30while Sikhala was in South Africa launching his book,Footprints in the Chains: The Life Story of Job Sikhala.\n\nThe bomb attack came after Sikhalas book launch in Masvingo was violently disrupted by suspected Zanu PF activists who confiscated and tore some books, broke furniture and also physically assaulted some panelists at the launch.\n\nIn a statement Monday, ZHRC voiced grave concern over the safety of Sikhalas family, noting that children were reportedly inside the house when the incident occurred.\n\nThe ZHRC is concerned about this dangerous explosion, which, if it is an attack, it strongly condemns as a barbaric act of violence which threatens the enjoyment of a number of constitutionally guaranteed human rights, particularly the right to life.\n\nThe ZHRC is deeply concerned about the safety and well-being of Mr. Sikhalas family, especially the children who were reportedly present when the explosion took place.\n\nChildren must be shielded from all forms of violence, abuse, and neglect. Exposure of children to such traumatic events can have enduring psychological and emotional consequences, ZHRC said.\n\nThe human rights commission also urged law enforcement authorities to investigate the matter and bring the perpetrators to book.\n\nThe ZHRC acknowledges the swift response by thepoliceand otherstate agencies in attending to the scene and initiating investigations.\n\nIt commends these efforts and urges the authorities to pursue a timely,thoroughand impartial investigation toidentify andprosecute those responsible so that they are punished in a deterrent manner, the statement added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/02001450/Job-Sikhala.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned a reported bomb attack on opposition politician Job Sikhala’s home, describing it as a “barbaric act of violence” and urged authorities to thoroughly investigate and arrest perpetrators. The incident reportedly occurred on August 30 while Sikhala was in South Africa launching his book, “Footprints in the Chains: The Life</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/barbaric-act-of-violence-rights-commission-condemns-bomb-attack-on-sikhalas-home-calls-for-impartial-probe/\">Barbaric act of violence – Rights commission condemns bomb attack on Sikhala’s home, calls for impartial probe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Judge rejects father’s bid to reclaim house from son",
            "url": "https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/",
            "content": "By Mary Taruvinga\n\nThe High Court has dismissed a fathers attempt to revoke a property registered in his sons name, saying the case reflected evidence of a broken family.\n\nOnias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had purchased and donated to him.\n\nJustice Philda Muzofa, sitting in Chinhoyi, noted the unusual family feud: It is never easy for a father to drag his son to courts; this is just evidence of a broken family. Something must have gone seriously wrong.\n\nOnias argued the property was a donation that could be revoked because Pride had become disrespectful and violent towards him, and had even tried to sell it against his wishes.\n\nBut the court ruled there was never a valid donation. There was never an intention to gratuitously and without obligation give the 1st respondent the property, Justice Muzofa said. There were strings attached. The applicant intended to continue to derive a benefit from the property.\n\nThe judge stressed that while Onias funded the purchase, the house was always registered in Prides name. The evidence before the Court strongly shows that the applicant purchased the property for the 1st respondent and he had strings attached, the judge said.\n\nDismissing the claim with costs, the judge concluded: Revocation can only be made where there is a valid donation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court has dismissed a father’s attempt to revoke a property registered in his son’s name, saying the case reflected “evidence of a broken family.” Onias Gotore dragged his son, Pride Gotore, to court in a bitter property dispute, seeking to reclaim a house in Chegutu that he said he had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-rejects-fathers-bid-to-reclaim-house-from-son/\">Judge rejects father’s bid to reclaim house from son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Motorist loses US$10,000 and pistol to attendant at Harare car wash",
            "url": "https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/",
            "content": "By Staff Reporter\n\nA HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle.\n\nThe offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his clients car at a Mabelreign washing bay in March.\n\nChimukuyu was slapped with 13 months imprisonment, of which five months were conditionally suspended. He will, therefore, serve an effective eight months behind bars.\n\nCourt heard that on March 21, 2025, the complainant left the money and firearm inside his Mercedes-Benz before handing it over to the offender for cleaning.\n\nInstead of performing his duties, Chimukuyu fled with the bag containing the valuables.\n\nIt was further heard that following a tip-off, police detectives arrested the offender at Pamuzinda Lodge, Claudia in Harare and recovered US$1,850 in his trousers pocket. The stolen pistol and bag were later recovered during a follow-up search.\n\nOf the stolen cash, only US$3,450 was recovered.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) urged motorists to avoid leaving large sums of money and firearms unattended in vehicles, even when dealing with trusted service providers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09045858/Car-wash_.png",
            "description": "<p>By Staff Reporter A HARARE motorist was left counting his losses after a car wash attendant stole a bag containing US$10,000 cash and a pistol from his vehicle. The offender, 20-year-old Albert Chimukuyu appeared at the Harare Magistrates Court, where he was convicted of theft from his client’s car at a Mabelreign washing bay in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/motorist-loses-us10000-and-pistol-to-attendant-at-harare-car-wash/\">Motorist loses US$10,000 and pistol to attendant at Harare car wash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Teen jailed for attempted murder after stabbing passerby who refused to share cigarette",
            "url": "https://www.newzimbabwe.com/teen-jailed-for-attempted-murder-after-stabbing-passerby-who-refused-to-share-cigarette/",
            "content": "By Staff Reporter\n\nA GWERU magistrate has sentenced a 19-year-old man for stabbing a passerby who refused to share a cigarette.\n\nNation Muyashu, who was facing an attempted murder charge, was arraigned before the Gweru Magistrates Court in Midlands province this Monday for sentencing.\n\nMuyashu was sentenced to nine years imprisonment, with three years suspended for five years on condition of good behaviour. He will, therefore, serve an effective six-year jail term.\n\nThe States case was that on July 16, 2025, the offender was walking alongside his unnamed girlfriend in the Mahamara area of Lalapanzi. It is said he encountered victim, Simon Ngazimbi, and asked him for a cigarette, but he refused.\n\nCourt heard that as Ngazimbi walked away, an argument ensued and in a fit of rage, the teenager drew out a knife and stabbed the victim once in the abdomen, causing his intestines to protrude from the wound. The victim fell to the ground and lost consciousness.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) encouraged members of the public to desist from physical abuse and senseless assaults.\n\nIts a sobering fact that a significant number of murder cases originate from seemingly meaningless altercations. We advise individuals to seek third-party mediation as a constructive alternative to violence, the NPAZ said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/09050538/cigarette-.jpg",
            "description": "<p>By Staff Reporter A GWERU magistrate has sentenced a 19-year-old man for stabbing a passerby who refused to share a cigarette. Nation Muyashu, who was facing an attempted murder charge, was arraigned before the Gweru Magistrates Court in Midlands province this Monday for sentencing. Muyashu was sentenced to nine years imprisonment, with three years suspended</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-jailed-for-attempted-murder-after-stabbing-passerby-who-refused-to-share-cigarette/\">Teen jailed for attempted murder after stabbing passerby who refused to share cigarette</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "09 Sep 2025"
        },
        {
            "title": "Sending your people to deal with me only confirms your father runs a terrorist organisation – dazed Holy Ten tells Mnangagwa’s son",
            "url": "https://www.newzimbabwe.com/sending-your-people-to-deal-with-me-only-confirms-your-father-runs-a-terrorist-organisation-dazed-holy-ten-tells-mnangagwas-son/",
            "content": "By Leopold Munhende\n\nHOLY Ten, an eccentric character on Zimbabwes Hip Hop scene by any margin, has told President Emmerson Mnangagwas son Collins not to entertain thoughts of sending people after him, as that will only confirm that his father runs a terrorist organisation, Zanu PF.\n\nHoly Ten, born Mukudzei Chitsama, broke the internet over the weekend when he went on an online rant, laying into Collins and his twin brother Sean for sending Central Intelligence Organisation (CIO) and army officers to his home.\n\nIn other posts, shared on Facebook and Instagram, he sent coded messages that they had been showering him with expensive gifts such as a house and cars, which he said they could now take back.\n\nHe went as far as declaring that he was bigger than the ruling Zanu PF party and could take the whole institution down, in what many have interpreted as a message passed in drunken stupor.\n\nHis last post on X, formerly Twitter, took aim at Collins, whose brother Sean is also an Army Major.\n\nDear Collins Mnangagwa, you cant touch me and the moment you try, youre really proving to all of us that you and your father run a terrorist organisation. Leave me alone, said Holy Ten.\n\nOnce the fastest rising talent in Zimbabwes music industry, Holy Tens career took a nasty nose dive after he laid into popular Zim Dance Hall chanter Winky D.\n\nHis tirade against Winky D, which came after the release of a red hot collaboration,Ibotso, was blamed on unidentified drugs and alcohol, a challenge he has accepted to have been dealing with for over two years. Ibotso, which he disputed, highlighted how the high and mighty were taking all that was supposed to benefit the downtrodden.\n\nHis tweet, however, comes a day after he apologised for his online tirade, captured live on Instagram.\n\nI joined Zanu PF because I was trying to clean the reputation, the image of Zanu PF. What you did, boys, I can finish all of you off. I can end the Zanu PF today. Im bigger than the Zanu PF, he said\n\nHoly Ten has in the past posted images of himself clad in army regalia, brandishing the Zanu PF clenched fist and openly campaigned for Mnangagwa.\n\nAccording to sources closer to his circle of friends, he was gifted, by the Mnangagwa twins, a fully furnished house and numerous cars, one of which he presented to his wife, Kimberly Richards, before repossessing it to pay a debt.\n\nUnconfirmed reports from Zimbabwean socialites indicate that Richards could have been in an extramarital affair with one of Mnangagwas sons, something that could be leading to his constant meltdowns.\n\nRichards, the Mnangagwa twins, Zanu PF, government and Mnangagwa himself are yet to comment on the matter that has raised questions on abuse of CIO and military personnel for personal benefits.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/08202033/holy-ten-.jpg",
            "description": "<p>By Leopold Munhende HOLY Ten, an eccentric character on Zimbabwe’s Hip Hop scene by any margin, has told President Emmerson Mnangagwa’s son Collins not to entertain thoughts of sending “people” after him, as that will only confirm that his father runs a terrorist organisation, Zanu PF. Holy Ten, born Mukudzei Chitsama, broke the internet over</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sending-your-people-to-deal-with-me-only-confirms-your-father-runs-a-terrorist-organisation-dazed-holy-ten-tells-mnangagwas-son/\">Sending your people to deal with me only confirms your father runs a terrorist organisation – dazed Holy Ten tells Mnangagwa’s son</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "09 Sep 2025"
        }
    ]
}