{
    "news": [
        {
            "title": "Pomona Flats construction takes shape",
            "url": "https://www.newzimbabwe.com/pomona-flats-construction-takes-shape/",
            "content": "By Staff Reporter\n\nBUILDING of the Pomona flats is progressing well with the first block now under construction and indications that two more blocks will be out of the ground by year-end.\n\nTwo blocks are already sold out while blocks three and four are on the market and selling equally fast.\n\nWestProp Holdings is renowned for its signature developments, including Millennium Heights and Pokugara. Its latest project, The Hills Luxury Golf Estate, is set to redefine the live, work, shop, and play lifestyle that underpins all WestProp communities  offering a bold new standard in integrated urban living.\n\nWith the introduction of apartments at Pomona City, Westprop chief executive Ken Sharpe is making a bold statement and declaring confidence in Harares urban evolution.\n\nWith three blocks already sold out, the project is capturing the attention of homebuyers and investors alike  a testament to its strategic location, modern design, and flexible ownership models.\n\nIn response to growing demand for quicker delivery timelines, WestProp has introduced a dedicated block tailored for buyers seeking occupancy within six months. This block comes with a synchronised payment plan, allowing purchasers to align their financial commitments with the construction schedule  a move designed to ease pressure on buyers while maintaining WestProps hallmark quality.\n\nThe Pomona Flats project is part of WestProps broader vision to redefine urban living in Zimbabwe through sustainable, secure, and stylish communities. With construction now underway and momentum building, prospective buyers are encouraged to act swiftly to secure units in the remaining blocks.\n\nPomona, dubbed a City within a City, borders with one of Harares premier 18-hole golf clubs  Wingate and is within striking distance of Harares growing commercial hubs  the Green Zone.\n\nA total of 22 blocks consisting of 16-unit apartments on three floors each will decorate the Pomona landscape, creating a new vibrant community and business opportunities.\n\nThis means in phase 1, there will be 352 apartment units  translating to housing 352 families. Phase 2 will have the same number of units. The architects created a spacious parking space of 530 bays for residents and 178 for visitors.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Staff Reporter BUILDING of the Pomona flats is progressing well with the first block now under construction and indications that two more blocks will be out of the ground by year-end. Two blocks are already sold out while blocks three and four are on the market and selling equally fast. WestProp Holdings is renowned</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pomona-flats-construction-takes-shape/\">Pomona Flats construction takes shape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "Zimbabwe set for normal to above-normal rainfall",
            "url": "https://www.newzimbabwe.com/zimbabwe-set-for-normal-to-above-normal-rainfall/",
            "content": "By Anna Chibamu\n\nThe Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season across most parts of Zimbabwe for the 20252026 farming period.\n\nMSD director Rebecca Manzou announced the first seasonal forecast for November, December, and January during a stakeholder briefing in Harare on Tuesday. She said collaborative work between the MSD and its regional partners indicated generally favourable rainfall patterns across the country.\n\nIn general, from November to January, the northern part of the country is normal to above normal rainfall, said Manzou.\n\nThe bulk of the country,which includes Manicaland, Masvingo, most of Mashonaland East, Harare Metropolitan, much of Midlands, the southern parts of Mashonaland Central and West, the south-eastern part of Mashonaland North, Bulawayo Metropolitan, and the bulk of Matabeleland South,has an increased chance of above normal rainfall.\n\nShe added, Also, from November to January, in the northern and western parts of the country, there is an increased chance of normal to above normal rainfall. So, we are at a good place as a country.\n\nFor the period December 2025 to February 2026, Manzou said rainfall is expected to remain within the normal to above-normal range, with the same trend likely to continue from January to March.\n\nHowever, she cautioned that rainfall patterns may vary from month to month, with nearer forecasts being more accurate.\n\nNovember will have normal to below normal rainfall. So, we are already in November and, in general, we are not talking of site-specific forecasts.\n\nFor December, rainfall distribution in the southern parts of the country will be higher compared to the northern parts.\n\nJanuary is expected to have a normal to above normal; February, normal to above normal it is a cumulative rainfall pattern, she explained.\n\nManzou urged farmers to seek advice from Agritex officers in their respective areas and avoid planting before the onset of effective rains.\n\nThe MSD is also monitoring temperature trends for the season. Despite recent hot weather, the conditions donot qualify as a heatwave.\n\nAccording to the MSD, temperatures for November to December are expected to be warmer than normal, while December will likely experience cooler-than-normal conditions.\n\nIt is now cooler, except in the extreme north, where it is still very uncomfortable (hot), Manzou said.\n\nFrom January to February 2026, temperatures are projected to remain cooler than normal across the country.\n\nManzou reminded stakeholders that the forecast issued was for total cumulative rainfall amounts, expressed relative to long-term averages, and that the MSD also issues daily, three-day, and 10-day forecasts for more precise weather guidance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05061210/rain.jpg",
            "description": "<p>By Anna Chibamu The Meteorological Services Department (MSD) has forecast a normal to above-normal rainfall season across most parts of Zimbabwe for the 2025–2026 farming period. MSD director Rebecca Manzou announced the first seasonal forecast for November, December, and January during a stakeholder briefing in Harare on Tuesday. She said collaborative work between the MSD</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-set-for-normal-to-above-normal-rainfall/\">Zimbabwe set for normal to above-normal rainfall</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This week we want to discuss the law of succession as it relates to agricultural land in Zimbabwe. What are the main considerations?\n\nVM:Thank you\n\nBefore delving into the laws of succession in agricultural land, it is necessary that I first address how agricultural is held in Zimbabwe. Agricultural land is held either through title deeds, 99-year leases, leases with an option to purchase, offer letters, permits or customarily as rural land under Rural District Councils.\n\nThese forms of holding confer personal rights to the holder except in title deeds, where the holder has real rights to the land. The personal rights titles emanating from Land Reform, being mainly permits, offer letters and 99-year leases, are a result of potentially one of the most significant wealth transfer events in post-colonial Africa.\n\nThe land itself is owned by the state and occupiers have usufructs on the land to use, enjoy and earn from it.\n\nThis background or understanding is necessary as it has a direct effect on succession.\n\nSuccession itself has become topical as farming by its very nature is a generational business.\n\nIf land reform started around 2000, it means the process is now 25 years old and cases of succession by heirs are now commonplace.\n\nReporter: You highlight land reform beneficiaries, that is A1 and A2. What is the process when the initial beneficiary dies?\n\nVM:It is important that we first differentiate the A1, being a small holder farm held under a permit from the government and an A2 farm being a large-scale commercial farm held under an offer letter or a 99-year lease.\n\nI understand that the current government policy is aimed at issuing deeds for these holders. I will discuss on succession for deeds later on. For now, I will restrict myself to permit, offer letter and lease holders.\n\nFirst thing to understand is that the land under these models belongs to the State and not individuals, therefore, succession in its strictest sense, which is through the Master of the High Court, is only for improvements and movable property.\n\nIf its for land, then the succession or reallocation of land to an heir has to be approved by the government who is the landowner. When the estate of the late holder is being administered, the value of the land is not included in the process as it does not belong to the estate but the government.\n\nMaking the process twotier\n\nFor A1 farms, the surviving spouse and dependants may succeed although the successor has to be approved by the Minister of Lands. The process is done through the District Lands office within 3  6 months after the death of the land owner, depending on whether or not there are disputes. In situations of disputes, spousal rights are protected and consideration is also given to potential successors who developed the farm.\n\nThe process is similar for A2 offer letters; there is a need for an application to the Ministry of Lands district office with the required documents, which is dealt with by the Valuation and Estate Management section. As part of its consideration, it will assess, among other things, the capacity to farm, whether or not the potential heir has other farms et cetera.\n\nAs for lease holders, it is governed by general inheritance laws; the executor, upon completing the beneficiary identification process, will still be required to make an application to the Minister for approval of allocation.\n\nReporter:What issues may inhibit or stop the A1 or A2 farms being re-allocated or distributed to the selected beneficiary?\n\nVM:I am forced to start by reiterating that the rights conferred by offer letters and or leases are personal in nature. This makes it necessary for the beneficiary or potential heir to prove the rights to the Ministry of Lands.\n\nSuch proof is through the offer letter, permit or lease granted to the deceased. A failure to prove implies that the late occupier may potentially have been an unlawful occupier.\n\nIn the absence of proof, the Ministry of Lands has no obligation to re-allocate the land to the selected heir. As there may be back and forth between the offices, it is important that copies of correspondence with the Ministry are kept judiciously in the event there is a need for them to be reproduced\n\nReporter: What is the inheritance position for rural kumusha land when it comes to inheritance and farms having a title deed?\n\nVM:Communal land is vested in the President and administered by the Rural district Councils through traditional leaders being chiefs and headmen. Their inheritance for use is normally through family lines.\n\nAs for farms having title deeds, they fall under our normal inheritance laws under the purview of the Master of the High Court. The Ministry of Lands does not have jurisdiction over these types of farms.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04171724/mcm-legal.jpg",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This week we want to discuss the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-succession-of-agricultural-land-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Succession of Agricultural Land in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "Brick by Brick, Zimbabwe companies fall to foreign competitors",
            "url": "https://www.newzimbabwe.com/brick-by-brick-zimbabwe-companies-fall-to-foreign-competitors/",
            "content": "By Linda Mujuru, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nNational laws aimed at redressing colonial imbalances reserve retail sectors, like that of brickmaking, for locals. But companies with outside investment, particularly from China, routinely flout the rules.\n\nHARARE, ZIMBABWE  For nearly a decade, Stanley has made a living laying out bricks for drying at Willdale Bricks, one of Zimbabwes oldest brick manufacturers. That work paid his rent and kept his three children in school. But orders at the company have slowed and, like many other colleagues, he hasnt seen a salary in two months.\n\nWe used to be self-sufficient through our salaries, says Stanley, who asked to use his middle name for fear of losing his job. That stability is gone.\n\nCompanies in Zimbabwes brickmaking sector are feeling the pressure from growing competition by foreign-backed companies expanding into the retail end of the industry.\n\nBy law, this shouldnt be happening. The countrys Indigenization and Economic Empowerment Act reserves the retail sector and others  including wholesale trade, employment agencies and advertising  for its citizens. Foreign nationals require permission from the Ministry of Industry and Commerce to operate in these sectors.\n\nThe law, passed in 2007, is among policies pursued by the former President Robert Mugabes government to redress colonial imbalances that excluded Zimbabwes black majority from owning or meaningfully participating in key sectors of the economy.\n\nBut like the land reforms, which also meant to address these imbalances, the policy has long been controversial. Some say it has mostly created regulatory uncertainty, benefited those with close links to the state, and driven away much-needed foreign direct investment, among other concerns.\n\nSince its introduction, the policy has undergone some changes under President Emmerson Mnangagwas administration to open up the economy for more investment. Through a 2018 Finance Act, the government revised the language and reserved these sectors to Zimbabwean citizens rather than indigenous Zimbabweans as the original policy stated. It also limited a 51% local ownership requirement to businesses that extract diamonds and platinum.\n\nCritics say while well-intentioned, the policy is inconsistently applied. Some foreign firms sidestep the requirements with relative ease.\n\nIn the brickmaking sector, companies like Willdale Bricks  which once dominated the industry and employs hundreds  are being edged out by foreign-backed manufacturers that are extending into retail.\n\nGlobal Press Journal directly contacted several companies registered with Zimbabwe Investment and Development Agency as brick manufacturers  including Tiger Bricks, Preedon Bricks and Obrim Bricks  all registered as foreign investments. Each confirmed they sell directly to customers.\n\nWhen asked if the companies had the permission required, the Ministry of Industry and Commerce did not respond. Global Press Journal also requested information on special licenses issued in recent years but did not get any response by the time of publication.\n\nHowever, an official in the department of economic empowerment at the ministry familiar with the matter, who did not want to be named for fear of losing his job, says that since he joined the ministry in 2019 it has not allowed any foreign companies to sell bricks. If [foreign] companies are selling bricks either through retail or wholesale without such permission, its unlawful, he says.\n\nSuch licenses usually last five years, he says, and if there are any companies that had these licenses before his arrival at the ministry, they would have lapsed by now.\n\nEven if they have licenses, its still a problem, says Godfrey Kanyenze, founding director of the Labour and Economic Development Research Institute of Zimbabwe. Brickmaking, he says, is one of the clear areas that should be reserved for locals.\n\nThere is no real point in having people come from far away to do what locals can do. Brickmaking is not a complicated economic activity that should require foreign direct investment, Kanyenze says, adding that the country should seek foreign investment in more complex capital- and skill-intensive areas.Our locals, even in the villages, make bricks.\n\nBricks move along the production line at Obrim Bricks. Despite laws reserving the retail sector for citizens, foreign companies continue to sell directly to customers, raising concerns among local producers. Photo: Linda Mujuru, GPJ Zimbabwe\n\nThe indigenization policy is increasingly tested as Zimbabwe, like many other countries in Africa, embraces Chinese investment. In 2023, the government issued about 369 new licenses to Chinese investors, accounting for 60% of all foreign investment that year and representing about 154% more investors than 2022.\n\nWhile the capital that comes from foreign direct investment can be beneficial to the country, the cost is steep. Its a double-edged sword, says Joe Muzurura, a political analyst who has written extensively about this issue in Zimbabwe. Its eroding local industries, he says, citing the example of Willdale Bricks, which is no longer the giant it used to be.\n\nIf well regulated, foreign direct investment could support local players and help grow domestic industry, Muzurura says. Instead, he says, its stifling [them].\n\nAlready, local brick companies are under strain from the countrys worsening economic conditions. Willdale Bricks 2024 annual report shows that the company was struggling with liquidity constraints and high production costs. And a 15% value-added tax introduced in 2024 on the supply of bricks has pushed customers to cheaper, often non-compliant alternatives.\n\nBeta Bricks, also a local brick manufacturing company and part of the Beta Holdings group, entered corporate rescue proceedings in January after defaulting on loans.\n\nBoth companies did not respond to Global Press Journal requests for interviews.\n\nObrim Brick Manufacturers is an investment company registered as a manufacturer and majority-owned by Chinese shareholders. Anesu Kondo, an accountant at Obrim, says their operations are fully compliant.\n\nWhile Kondo says they do not have a special license from the ministry that would allow them to operate in retail, he says selling their product directly to customers should not be mistaken as retail trade. We are not acting as middlemen. We are selling what we produce, he says.\n\nForeign companies are only filling a gap left by struggling local companies, Kondo adds. When we entered the market, the major players werent meeting demand. Local companies werent recapitalizing, and many still rely on outdated brickmaking technologies.\n\nSuch interpretation is simply stretching the law, says Nyasha Brighton Munyuru, a managing partner at Muvingi and Mugadza Legal Practitioners, adding that the law is clear: Such a company needs permission from the ministry to operate in retail.\n\nWorkers stack bricks for delivery at Obrim Bricks. Analysts warn that foreign-backed firms with greater production capacity are edging out Zimbabwean companies already struggling with rising costs and economic instability. Photo: Linda Mujuru, GPJ Zimbabwe\n\nThe government has failed to implement the law, says Henry, a senior employee at Willdale Bricks who has worked at the company for nearly 25 years. He requested the use of his first name only, for fear of losing his job.\n\nBefore a foreign business sets up its operations, there should be strict rules in place and enforcement to match. But that rarely happens, he says, adding that some foreign companies operating in the country arent formally registered with authorities.\n\nGenerally, there is a double standard in how authorities implement regulations, he says. They allow foreign investors to evade taxes and regulations, while local businesses face intense scrutiny. Were expected to comply fully, bank all our earnings, and accept local currency that constantly loses value, he says.\n\nForeign companies bypass the requirements that weigh down local producers, making it hard for locals to compete, Stanley says.\n\nOn top of that, the foreign companies have the added advantage of superior technology and greater production capacity, says Muzurura, the analyst.\n\nZimbabwe isnt the only one grappling with the ripple effects of foreign investment on local businesses.\n\nIn Zambia, Chinese-owned enterprises dominate sectors such as mining and retail, often undercutting local entrepreneurs with lower prices, according to 2018 research by the International Institute for Environment and Development.\n\nIn Sri Lanka, according to a 2023 report by the International Collective in Support for Fishworkers, the Hambantota Port project, largely funded by Chinese investment, has strained local livelihoods. The projects large-scale fishing operations have encroached on traditional fishing grounds, making access difficult for local fishermen.\n\nAnd in Vietnam, while Chinese manufacturing companies in the textiles and electronics sectors have created jobs, they also have displaced small Vietnamese producers who struggle to compete with the Chinese firms lower prices and greater production capabilities, according to a 2017 report from the Harbin Engineering Universitys School of Economics and Management.\n\nIn Zimbabwe, this shift happens at a time when the economy is fragile and unemployment is high  a dangerous mix.\n\nAs their salaries havent been guaranteed, both Stanley and Henry have had to find other means to subsist.\n\nHenry takes on side jobs to make ends meet.\n\nIn the past, working at Willdale was something to be proud of. Now, even informal vendors seem better off, Henry says. We are in a dire state.\n\nLinda Mujuruis a Global Press Journal reporter-in-residence based in Harare, Zimbabwe.\n\nGlobal Press Journal delivers bold, investigative and in-depth explanatory reporting on the worlds most urgent issues.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04165809/Obim-bricks-GPJ-Zimbabwe.jpg",
            "description": "<p>By Linda Mujuru, GPJ Zimbabwe This story was originally published by Global Press Journal. National laws aimed at redressing colonial imbalances reserve retail sectors, like that of brickmaking, for locals. But companies with outside investment, particularly from China, routinely flout the rules. HARARE, ZIMBABWE — For nearly a decade, Stanley has made a living laying out</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brick-by-brick-zimbabwe-companies-fall-to-foreign-competitors/\">Brick by Brick, Zimbabwe companies fall to foreign competitors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "ZIFA appoints Marian Marinica new Warriors head coach",
            "url": "https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/",
            "content": "By Sports Reporter\n\nZIFA has appointed Marian MarioMarinica as the new head coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nMarinica is a Romanian national who has previously managed Malawi and Liberia.\n\nThe 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in the game.\n\nIn a statement, ZIFA said Marinica was given a one-year contract andwill becommencing duty this month.\n\nZimbabwe Football Association (ZIFA) is pleased to announce the appointment of Marian (Mario) Marinica as the new Head Coach of the Zimbabwe Senior Mens National Football Team, the Warriors, on a one-year contract.\n\nThroughout his distinguished career, Marinica has worked with several prestigious clubs and national teams, including Arsenal FC, Chelsea FC, Internazionale Milano, AS Monaco, Liverpool FC, and Tottenham Hotspur, as well as the national teams of Paraguay, Mauritius, Malawi, and Liberia.\n\nUnder his leadership, Malawi reached the Round of 16 at the 2022 Africa Cup of Nations, their best-ever finish, while Liberia became the highest climber in the FIFA Rankings in June 2024, reads thestatementon Marinicas appointment.\n\nHe comes in toreplaceMichael Nees, who was fired last month following a string ofpoor results.\n\nMarinicas first assignment will be the upcoming friendly matches against Qatar and Algeria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05043256/marion-coach.jpeg",
            "description": "<p>By Sports Reporter ZIFA has appointed Marian ‘Mario’ Marinica as the new head coach of the Zimbabwe Senior Men’s National Football Team, the Warriors, on a one-year contract. Marinica is a Romanian national who has previously managed Malawi and Liberia. The 60-year-old gaffer is a UEFA Pro License holder with over 25 years of experience in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-appoints-marian-marinica-new-warriors-head-coach/\">ZIFA appoints Marian Marinica new Warriors head coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "Improve our welfare or we leave – nurses tell government",
            "url": "https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/",
            "content": "By Staff Reporter\n\nNURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad.\n\nMedical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health institutions.\n\nAddressing the annual general meeting in Masvingo recently, Zimbabwe Nurses Association (ZINA) president Enock Dongo told Deputy Minister of Health and Child Welfare Sleiman Kwidini that government shouldtake care of the workforce to avoid strikes.\n\nOur covenant is that we do not engage in strike. Strike is the last resort. We should not be pushed to that limit. So when you hear us complaining it would be so that nurses receive meaningful salaries. If they get enough salaries they forget about going on strike, said Dongo.\n\nHealth professionalshave been leavingthe countryin droves, in the process affecting service delivery in public hospitals.\n\nDongo said 4 000 nurses have applied to government for verification as they attempt to leave the country.\n\nWe have a very topical issue of verification which was supposed to be given by the Nurses Council, is not being given right now. Power has been taken by the Ministry. Legally Ministry does not have the power to withhold a letter of good standing, but it is still doing that.\n\nLetter of good standing is supposed to be given so that one can go wherever he wants. If I have done anything wrong just write rather than withholding it. We have more than 4 000 verification applications by nurses is because of poor working conditions and salaries.\n\nWe do not even aim to go outside the country. All the nurses here are very patriotic, added Dongo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/05015541/Nursees-on-Strike.png",
            "description": "<p>By Staff Reporter NURSES have bluntly told government to improve their welfare to avoid growing discontent and a mass exodus of medical practitioners seeking better opportunities abroad. Medical practitioners have been at loggerheads with the government, bemoaning low salaries, which are coupled with poor working conditions that have driven the majority out of public health</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/improve-our-welfare-or-we-leave-nurses-tell-government/\">Improve our welfare or we leave – nurses tell government </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "5 minutes with the creator of Bad Influencer and Zimbabwean visionary Kudi Maradzika",
            "url": "https://www.newzimbabwe.com/5-minutes-with-the-creator-of-bad-influencer-and-zimbabwean-visionary-kudi-maradzika/",
            "content": "The Drum\n\nWho knew the illicit handbag trade was a dog-eat-dog world?\n\nYou either eat or get eaten.\n\nAll for the statement of a Birkin, Chanel or a Louis Vuitton handbag.\n\nTo an ordinary person, the frenzy is unnecessary, but in the influencer world, the handbag carries your worth and status in circles of power.\n\nIn the Bad Influencer series, we see how a single mother capitalises on the staged detoxification of this high life as she navigates climbing the ladder of the illicit trades under the microscope of a police officer she falls in love with.\n\nWith this intriguing story, the creator, Kudi Maradzika, wanted to capture the intersection of two worlds that she is intrigued by.\n\nInfluencer culture and the world of crime. The original concept always had influencers, crime and counterfeit bags at its core, although the story did evolve in development. Bad Influencer allowed me to explore these worlds with humour, social tension and emotional depth, while still having fun with the wildness of internet culture.\n\nShe tells Drum that she also wanted to interrogate how we measure value in a world where women dont have power or financial freedom.\n\nInfluence, beauty, wealth and success are often curated illusions, and chasing them without grounding can feel exhilarating but can be dangerous. That said, I also want audiences to laugh, reflect, and question the ladders we climb to attain power and social currency.\n\nLed by Jo-Anne Reyneke, Cindy Mahlangu and Thapelo Mokoena, the cast brings to life the female-driven crime story rooted in the belly of Johannesburg streets.\n\nArt plays in the hands of reality as the Zimbabwean producer also leads in various male-dominated creative spaces.Im redefining power on my own terms. Im taking up space, building ecosystems instead of waiting for permission, and creating opportunities for others as I climb. My responsibility is not just to tell stories, but to help create platforms and initiatives where African women can own, build and lead their creative futures.\n\nShe explains how she bridges storytelling across TV, comics and gaming.\n\nI build worlds first. The medium becomes an extension of the universe. Each platform deepens the audience experience and longevity of the intellectual property (IP). Africa doesnt yet have the full transmedia infrastructure, but thats also the opportunity. The goal is not just to make content from one IP, but also to build entire story universes with unique offerings at each product vertical, from video games to merchandise, to animation and film.\n\nIP is legacy. Its economic freedom. Its how we build generational wealth in storytelling, she adds.\n\nFrom as far back as she can remember, her imaginative mind has always bred stories itching to be told.\n\nAs a child, I would write my own version of Peter Rabbit stories, and later, Id write plays in high school. That instinct followed me into journalism, and eventually into film production and screenwriting. For me, storytelling has always been a way of making sense of human behaviour, power, identity, and possibility.\n\nHer upbringing between different cultures, countries and identities also turned her perspective into a muscle she could exercise from an early stage in her life.\n\nWith a background in journalism, I also learned to observe and question narratives early in my career. Id like to believe that my upbringing shaped my hunger, resilience, and belief in creating things that outlive me, whether thats a story world, a book, a platform, or a shift in how we imagine African stories.\n\nOver the years, the creative in her late 30s has been part of international fellowships and labs in which shes championed feminine power and ownership.\n\nNow with Bad Influencer out on Netflix, shes already on to the next project. Her new project is Artemis Elixa; she shares with Drum what its all about.\n\nArtemis Elixa is a pan-African sci-fi franchise about a brilliant engineer from the future who time-travels back to stop a rogue super-intelligence from taking over humanity. Each mission sends her across the continent, from Congos mineral frontlines to Nairobis tech corridors.\n\nWith each mission, she confronts power, exploitation, and the ethics of progress. Its an African answer to Lara Croft meets The Terminator, with a touch of Black Panther, grounded in our real-world trajectory of technology, geopolitics, and African innovation. Its part graphic novel, part game, part cinematic world. The comic will be launching in 2026, she concludes the conversation with Drum.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04164958/kudi-maradzika.jpg",
            "description": "<p>The Drum Who knew the illicit handbag trade was a dog-eat-dog world? You either eat or get eaten. All for the statement of a Birkin, Chanel or a Louis Vuitton handbag. To an ordinary person, the frenzy is unnecessary, but in the influencer world, the handbag carries your worth and status in circles of power.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/5-minutes-with-the-creator-of-bad-influencer-and-zimbabwean-visionary-kudi-maradzika/\">5 minutes with the creator of Bad Influencer and Zimbabwean visionary Kudi Maradzika</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        },
        {
            "title": "Gold boom, stronger currency fuel hope for lower inflation in Zimbabwe",
            "url": "https://www.newzimbabwe.com/gold-boom-stronger-currency-fuel-hope-for-lower-inflation-in-zimbabwe/",
            "content": "Business Insider Africa\n\nZimbabwes annual inflation rate could fall by half by the end of 2025, helped by a steadier local currency and strong gold prices, according to a new report from the Confederation of Zimbabwe Industries (CZI).\n\nThe CZI said annual inflation, measured in the Zimbabwe Gold (ZiG) currency, dropped sharply to 32.7% in October from 82.7% in September. The group now expects inflation to ease further, possibly reaching 15% to 20% by December 2025.\n\nThe decline follows two consecutive months of negative month-on-month inflation and a relatively stable ZiG, which rising global bullion prices have supported, according toReuters.\n\nThe policy target is for an annual ZiG inflation of about 30%. The negative month-on-month inflation for the past two months has helped increase chances of this happening, the CZI said in its October 2025 Inflation and Currency Developments Update.\n\nAs Zimbabwes main business lobby for manufacturers and industrial firms, the CZIs reports are closely watched by investors as early indicators of inflation and currency trends.\n\nThe ZiG, partly backed by gold, has remained stable in official markets, with a parallel-market premium of about 20%, according to analysts at Oxford Economics.\n\nGold production is also expected to surpass the record 38.4 tonnes achieved in 2024, driven by sustained high prices.\n\nAfter more than two decades of currency turmoil and runaway inflation, Zimbabwes recent progress marks a tentative return to stability. A continued slowdown in prices, analysts say, would be a crucial step toward rebuilding confidence in local money and supporting a broader economic recovery.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171609/mushayavanhu-zig-4.jpg",
            "description": "<p>Business Insider Africa Zimbabwe’s annual inflation rate could fall by half by the end of 2025, helped by a steadier local currency and strong gold prices, according to a new report from the Confederation of Zimbabwe Industries (CZI). The CZI said annual inflation, measured in the Zimbabwe Gold (ZiG) currency, dropped sharply to 32.7% in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gold-boom-stronger-currency-fuel-hope-for-lower-inflation-in-zimbabwe/\">Gold boom, stronger currency fuel hope for lower inflation in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "05 Nov 2025"
        }
    ]
}