{
    "news": [
        {
            "title": "‘Mugabe was bad, this is worse’ – Chamisa condemns abduction, torture of CUT students as Amnesty International demands investigation",
            "url": "https://www.newzimbabwe.com/mugabe-was-bad-this-is-worse-chamisa-condemns-abduction-torture-of-cut-students-as-amnesty-international-demands-investigation/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has condemned the abduction and torture of two Chinhoyi University of Technology (CUT) students during Students Representative Council (SRC) election campaigns, describing the brutality as barbaric and pure evil.\n\nThe students, Marlvin Saint Madanda and Lindon Zanga, who are members of the Zimbabwe National Students Union (ZINASU), were allegedly abducted on Monday night at Mzimba Shopping Centre in Chinhoyi.\n\nAccording to ZINASU, the two were taken by unidentified individuals driving an unmarked grey Isuzu, a vehicle that had previously been seen on the CUT campus distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nMadanda and Zanga were later found in Shamva, about 120 kilometres from where they were abducted, visibly injured, shaken, and unable to sit or walk properly.\n\nNarrating their ordeal, Zanga said they were tortured for more than 12 hours for allegedly chanting slogans deemed to be against the ruling ZANU PF party during their SRC campaign.\n\nThe abductors took us to a forest and accused us of campaigning and chanting slogans against ZANU PF, Zanga said. We clearly told them we were simply conducting ZINASU campaigns, which had nothing to do with ZANU PF.\n\nDear Mr MnangagwaThis is why this evil must be fought for as long as is necessary, . even for the rest of our lives or with our own lives. This is wrong in all material respects!pic.twitter.com/Kau1kuozeZ\n\n nelson chamisa (@nelsonchamisa)November 11, 2025\n\nChamisa compared the attack to atrocities committed under the late former president Robert Mugabe, saying the current wave of repression was even worse.\n\nDuring Mugabes long tenure, opposition activists were routinely abducted, tortured and killed for being critical of his administration and ruling party.\n\nWriting on X, Chamisa said: Dear @PoliceZimbabwe, why should this terrorism and primitive brutality on harmless students and innocent citizens be allowed to continue? Mr Mnangagwa, why should this not worry or concern you? Mugabe was bad. This is worse. So barbaric. This is pure evil!\n\nMeanwhile, human rights organisation Amnesty International has called for a thorough investigation into the attack and urged authorities to protect students rights to peaceful assembly and association.\n\nThese attacks threaten not just freedoms of assembly, expression, and association, but also the rights to education, non-discrimination, academic freedom, and participation in university public life.\n\nWe urge the authorities to thoroughly investigate these attacks and ensure that students can exercise their freedom of expression and peaceful assembly without fear of reprisals, intimidation, or torture, Amnesty International said in a statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has condemned the abduction and torture of two Chinhoyi University of Technology (CUT) students during Students Representative Council (SRC) election campaigns, describing the brutality as “barbaric and pure evil.” The students, Marlvin Saint Madanda and Lindon Zanga, who are members of the Zimbabwe National Students Union (ZINASU), were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabe-was-bad-this-is-worse-chamisa-condemns-abduction-torture-of-cut-students-as-amnesty-international-demands-investigation/\">‘Mugabe was bad, this is worse’ – Chamisa condemns abduction, torture of CUT students as Amnesty International demands investigation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Legacy Protection Through Enduring Wealth and Businesses",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-legacy-protection-through-enduring-wealth-and-businesses/",
            "content": "NewZimbabwe.com hasinvited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima. This mens month, we want to discuss a topical issue among men, which is, how do you ensure that your business or wealth is grown from one generation to the next and not wasted?\n\nVM: It is a great question, I believe it is one that vexes the minds of a lot of men.\n\nHaving worked so hard to grow personal wealth, in some instances in classic rags-to-riches fashion, how does one ensure that the wealth is not dissipated by the next generation? Zimbabwe is rife with stories of men who achieved unimaginable wealth within their lifetimes, which is lost completely by the first generation of beneficiaries.\n\nThis is deeply disconcerting.\n\nOne can only mitigate against this eventuality and it cannot be through legal protections only, although they are quite useful. There is a need for training or a meeting of minds between the benefactor and potential beneficiary; otherwise, leaving money or wealth without the wisdom to maintain and grow it is similar to throwing it in a deep dark hole.\n\nSome families go to the extent of having a family constitution that guides issues to do with succession, how people are cared for by the business of the familyetc,outside of the other protective mechanisms available in law.\n\nAlthough such protective mechanisms are noble, they are supposed to be implemented while considering existing and future disruptive technologies and the evolving nature of businesses. It is therefore my considered view that at the cornerstone of whatever protective mechanism in law is put in place, the family must have a common vision that guides it, which vision is bigger than individual avarices.\n\nThis, when achieved, may retain and even grow the family wealth.\n\nIf I were to use a local example, the rural home kumusha does not belong to anyone through title; each custodian has a duty to maintain and improve it for the benefit of the next generation. That must be, in my view, how generational wealth is created, through compounding.\n\nReporter:I am convinced by your proposition. What legal protections would complement this?\n\nVM: Having addressed the soft laws within the family, being the family visionet cetera, the next question is how the benefactor codifies this vision so that it becomes binding. The first step is to ensure that the companies holding the businesses have articles of association and shareholder agreements that speak to some of the protective clauses required for the envisioned continuity.\n\nYou will be surprised by the number of people who have generic articles of association or shareholder agreements that do not speak specifically to their intended posterity. The omission is staggering as these documents define types of shares, voting rights, how shares are transferred and to whom, decision-making protocols, dispute resolution mechanisms and even governing structures.\n\nReporter: I had not imagined the importance of personalising these company documents!\n\nVM: Indeed, you are one of many.\n\nThe company documents are the first layer of protection. Although they may be protective from a legacy perspective, they must be fluid enough to evolve.\n\nThe next layer will be to create a family trust which is tailored to the familys specific goals and idiosyncrasies. Trusts are flexible and should be customised. The shares of the business, properties and other family investments may be housed in the trust, which ultimately becomes the family constitution prescribing how the family assets should be protected, whether through either majority votes when disposing assets or unanimous votes.\n\nIn some jurisdictions, life policies are housed in trusts and loans are taken out against them for daily business.\n\nThere are other benefits that come with setting up the trust, such as easier succession, as it is dealt with within the document, resulting in cheaper probate or estate duties.\n\nReporter: I think that is very clear. Are there any other protections available to safeguard the businesses and wealth?\n\nVM: Well, I think the role of intellectual property protections is understated in Zimbabwe. It is my belief that more businesses should register their trademarks to protect them from eleventh-hour businesses that want to benefit from the established goodwill.\n\nLastly, keeping records is key even to understanding the intentions of the benefactors or proprietors. I think an unnecessary number of businesses fail to keep a proper record of their statutory and operational documents, for example, their standard operating procedures. These documents are useful in understanding how the business navigated certain situations.\n\nReporter: Thank you, Mr. Madzima we have to end here, because of our time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/12033353/Newzimbabwe.com-Artwork-750x500_20251111_222229_0000.png",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima. This ‘men’s month’, we want to discuss</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-legacy-protection-through-enduring-wealth-and-businesses/\">Legal Discussions with Vengai Madzima: Legacy Protection Through Enduring Wealth and Businesses   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        },
        {
            "title": "Man blows money mistakenly deposited into his bank accounts",
            "url": "https://www.newzimbabwe.com/man-blows-money-mistakenly-deposited-into-his-bank-accounts/",
            "content": "By Staff Reporter\n\nA RUSAPE man has appeared in court for squandering money mistakenly deposited into his bank account.\n\nGarikai Mtangandebvu (30) of Vengere, Rusape, was convicted of theft when he was arraigned before the Rusape Magistrates Court.\n\nHe unlawfully converted to his personal use US$1,885.45 and ZWL238,638.90, funds, which were intended for another individual with the same name.\n\nCourt heard that, sometime in July 2025, the offender, who works for a wholesale shop, got suspicious deposits into his bank accounts. Instead of notifying the bank or the rightful owner, Mtangandebvu withdrew the money and used it for personal benefit.\n\nIt was further heard that, when the legitimate recipient made a claim, the company discovered the error and reported the matter to the police.\n\nNothing was recovered from the offender.\n\nMtangandebvu was slapped with 36 months imprisonment, of which six months were suspended on condition of good behaviour. A further 15 months were set aside on condition of full restitution to the complainant. The remaining 15 months were suspended on condition that he perform 525 hours of community service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/23052419/us-dollar.jpg",
            "description": "<p>By Staff Reporter  A RUSAPE man has appeared in court for squandering money mistakenly deposited into his bank account. Garikai Mtangandebvu (30) of Vengere, Rusape, was convicted of theft when he was arraigned before the Rusape Magistrates Court. He unlawfully converted to his personal use US$1,885.45 and ZWL238,638.90, funds, which were intended for another individual</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-blows-money-mistakenly-deposited-into-his-bank-accounts/\">Man blows money mistakenly deposited into his bank accounts </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        },
        {
            "title": "Parliament commits to push for increased roads infrastructure funding",
            "url": "https://www.newzimbabwe.com/parliament-commits-to-push-for-increased-roads-infrastructure-funding/",
            "content": "By Alois Vinga\n\nParliament has pledged to advocate for a reasonable budget allocation towards road infrastructure development amid growing calls for contractors to complete their assigned projects within set timeframes.\n\nIn recent years, Zimbabwe has invested significantly in major road infrastructure projects, including the rehabilitation and upgrading of the BeitbridgeBulawayoVictoria Falls Road, the HarareChirundu Highway, the Trabablas Interchange and the planned dualisation of the HarareNyamapanda Road. Other projects, such as the Mabvuku Interchange in Harare, are also underway.\n\nSpeaking at a recent media engagement, Goromonzi West legislator Biatah Nyamupinga, who sits on the Parliamentary Portfolio Committee on Transport and Infrastructure Development, said her committee is committed to advocating for increased allocations to the Transport Ministry as the country prepares for the 2026 National Budget.\n\nAs we approach the budget process, our committee commits to pushing for a reasonable allocation to the Transport Ministry. They need adequate resources to complete the ongoing road projects. The Ministry is doing a commendable job, and we are seeing progress across the country. Lets ensure these roads are completed, she said.\n\nNyamupinga urged the Transport Ministry to openly communicate any challenges it faces so Parliament can channel them to the relevant authorities for redress.\n\nShe also called on contractors to adhere to agreed timelines.\n\nIn some of the areas we have visited, contractors promised to complete their projects by March next year. Lets ensure those targets are met. Delivering on time will strengthen our case when we lobby for bigger allocations. We can then proudly say contractors are delivering the work they were paid for, she added.\n\nDue to high infrastructure demands, the Transport Ministry reportedly exceeded its 2024 national budget allocation by 245% within six months, prompting fresh calls for supplementary funding to sustain projects until year-end.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/20050128/Road-project.jpeg",
            "description": "<p>By Alois Vinga Parliament has pledged to advocate for a reasonable budget allocation towards road infrastructure development amid growing calls for contractors to complete their assigned projects within set timeframes. In recent years, Zimbabwe has invested significantly in major road infrastructure projects, including the rehabilitation and upgrading of the Beitbridge–Bulawayo–Victoria Falls Road, the Harare–Chirundu Highway,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-commits-to-push-for-increased-roads-infrastructure-funding/\">Parliament commits to push for increased roads infrastructure funding </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        },
        {
            "title": "Rape, fraud-accused Magaya granted US$3,000 bail",
            "url": "https://www.newzimbabwe.com/rape-fraud-accused-magaya-granted-us3000-bail/",
            "content": "By Mary Taruvinga\n\nProphetic, Healing and Deliverance Ministries founder, Walter Magaya, who is facing rape and fraud charges, has been granted bail by the Harare High Court.\n\nMagaya was granted US$3,000 bail by Justice Gibson Mandaza.\n\nThe beleaguered cleric was arrested last week, facing charges emanating from a botched housing project which defrauded some of his congregants of thousands of dollars.\n\nHe will appear before the court on November 18 for routine remand.\n\nMagayas co-accused, his wife Tendai Magaya and Tapiwa Chikondo, his bodyguard, who was facing a charge of resisting law officers, were granted bail by the Magistrates Court last week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Prophetic, Healing and Deliverance Ministries founder, Walter Magaya, who is facing rape and fraud charges, has been granted bail by the Harare High Court. Magaya was granted US$3,000 bail by Justice Gibson Mandaza. The beleaguered cleric was arrested last week, facing charges emanating from a botched housing project which defrauded some of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rape-fraud-accused-magaya-granted-us3000-bail/\">Rape, fraud-accused Magaya granted US$3,000 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        },
        {
            "title": "Two CUT students abducted during SRC election campaigns – union",
            "url": "https://www.newzimbabwe.com/two-cut-students-abducted-during-src-election-campaigns-union/",
            "content": "By Staff Reporter\n\nTwo students from Chinhoyi University of Technology (CUT) were allegedly kidnapped on Monday night during campaigns for the Student Representative Council (SRC) elections, the Zimbabwe National Students Union (ZINASU) has claimed.\n\nAccording to ZINASU, its members, Lindon Zanga and Marlvin Saint Madanda, were violently abducted at Mzimba Shopping Centre in Chinhoyi.\n\nThe union said the pair was taken by unidentified individuals driving an unmarked grey Isuzuthat had previously been seen on campus distributing campaign materials for their rivals, the Zimbabwe Congress of Students Union (ZICOSU).\n\nIn a statement, ZINASU alleged that the abductions were part of a wider attempt to intimidate students and silence dissenting voices on campus.\n\nThe two student leaders were snatched in front of dozens of witnesses in a brazen act of banditry that has not only instilled fear but also exposed the modus operandi of a rogue regime seemingly afraid of open contestation of ideas.\n\nThis is a panic reaction from ZICOSU, which is directly sponsored by the ruling ZANU PF regime, and a clear attempt to silence the students voice.\n\nStudents have ceased to be seen as beacons of academic excellence. In the eyes of a jittery regime, they are viewed as terrorists who defy oppression, ZINASU said.\n\nThe student union also accused ZANU PF Youth League Political Commissar Taurai Kandishaya of being involved in the conflict.\n\nThe notorious presence of Youth League Political Commissar Taurai Kandishaya, who has a sordid history of doing everything necessary and unnecessary to please his bosses, should not be overlooked.\n\nHe is known for threatening and exposing innocent citizens who dare to think differently from the ZANU PF script. His hand is visible in this case.\n\nAn SRC election should be a democratic process giving young people a glimpse into leadership, yet rogue elements in power continue to use state resources to suppress dissent and manipulate outcomes, ZINASU added.\n\nZINASU said it is demanding the immediate release of Zanga and Saint and vowed to take legal action over the matter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11111935/CUT-ZINASU.jpeg",
            "description": "<p>By Staff Reporter Two students from Chinhoyi University of Technology (CUT) were allegedly kidnapped on Monday night during campaigns for the Student Representative Council (SRC) elections, the Zimbabwe National Students Union (ZINASU) has claimed. According to ZINASU, its members, Lindon Zanga and Marlvin Saint Madanda, were violently abducted at Mzimba Shopping Centre in Chinhoyi. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-cut-students-abducted-during-src-election-campaigns-union/\">Two CUT students abducted during SRC election campaigns – union</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        },
        {
            "title": "Upcoming Premier League Changes Promise to Shake Up the Future of Football",
            "url": "https://www.newzimbabwe.com/upcoming-premier-league-changes-promise-to-shake-up-the-future-of-football/",
            "content": "The Premier League is the richest and most competitive football league in the world. But the local administration has decided to undergo its biggest transformation in decades. They consider implementing a form of salary cap, known as anchoring. It wont allow clubs to pay new players more than several times the revenue of the lowest-earning club in the league. This financial transformation can potentially reshape the Premier League and the world of football overall. But this is not the only change to be expected in modern football. The busy schedule also required an immediate solution. Read on to learn more about upcoming changes.\n\nAnchoring the Premier League\n\nThe new salary cap will link how much a club can spend on wages to the earnings of the leagues lowest-earning club. The idea is to create financial parity, preventing a few elite clubs from outspending everyone else by huge margins. This transformation promises to have a huge impact on the national league, so every reliableinternet betting serviceis currently assessing potential changes to the betting markets and odds.\n\nThe Premier League has always been a huge financial power in professional sports. Manchester City, Liverpool, and Chelsea are the top clubs, attracting the best players with massive contracts. Yet critics argue that this growing wealth gap has ruined competition, making it hardly possible for smaller clubs to reach the top. Should the anchoring proposal pass or not? It will definitely tie top clubs hands when negotiating salaries. The so-called Big Six clubs have expressed concerns that the new system would limit their ability to attract elite players, potentially damaging the reputation of the national league in the world.\n\nThe financial reform is the main topic for discussion in the Premier League. Meanwhile, other countries are discussing player overload, which is slowly becoming a serious issue. The football calendar has been expanded, with domestic, continental, and international competitions. The Club World Cup now requires teams to play up to seven matches to reach the final. Meanwhile, the Champions League format has expanded to include additional matches on the group stage. The World Cup continues welcoming new teams, increasing the total number of matchups.\n\nThe busy schedule means exciting matches for fans. But it also means more injuries among players. Not everyone can handle the pressure. Cole Palmer from Chelsea played 55 games last season. At the beginning of the new season, the 23-year-old player has already reported a groin injury that would keep him on the bench for weeks. Ousmane Dembl is also struggling with a few muscle injuries this season.\n\nAt the European Football Clubs (EFC) General Assembly, club representatives discussed possible solutions to the existing problem. They considered increasing the substitute allowance from five to six. They also discussed the idea of expanding the team registration limit from 25 to 28 players. The team will be able to rotate players more frequently, which will reduce fatigue and the risk of injury. Not everyone agrees that this could be the right solution to the problem. The Professional Footballers Association (PFA) in the UK has expressed skepticism, arguing that larger teams might not actually reduce mental fatigue. All players must attend training, travel to play matches, and remain mentally engaged throughout the season. If someone ends up without playtime, they still have to be physically and mentally prepared.\n\nOnce thing is clear: if the situation doesnt change, some players may take radical action. In Manchester United, they have already expressed its dissatisfaction with the current situation. They have even explained their failure to qualify for the main European championships with the massive fatigue among players. Will they go on strike? Or will they find other ways of solving the problem? We will know soon!\n\nThe new salary cap and the attempt to survive a busy schedule are two critical issues. The Premier League must decide whether to stay with the current system or move toward fairness and transparency. The anchoring system, if approved, would redefine financial norms in the worlds most expensive league. Increasing substitute allowance and registration limit could also be the first step toward a more reasonable football calendar. After all, player health is more important than commercial gains.\n\nYet, both measures involve a certain risk. Restricted expenses can make football less attractive to global players. Minor adjustments to squad rules may not be enough to protect players from burnout. So far, one thing is clear: change is coming. The decisions made in the coming months will shape the future of football for decades. The Premier League, once the gold standard of wealth and competition, could soon be the testing ground for a new era in world football.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/11083743/stadium.jpg",
            "description": "<p>The Premier League is the richest and most competitive football league in the world. But the local administration has decided to undergo its biggest transformation in decades. They consider implementing a form of salary cap, known as “anchoring”. It won’t allow clubs to pay new players more than several times the revenue of the lowest-earning</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/upcoming-premier-league-changes-promise-to-shake-up-the-future-of-football/\">Upcoming Premier League Changes Promise to Shake Up the Future of Football</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:32",
            "date": "12 Nov 2025"
        }
    ]
}