{
    "news": [
        {
            "title": "ANC NEC members demand investigation into intelligence failures over Palestinian refugee flights",
            "url": "https://www.newzimbabwe.com/anc-nec-members-demand-investigation-into-intelligence-failures-over-palestinian-refugee-flights/",
            "content": "IOL\n\nMembers of the ANCs national executive committee (NEC) have called for an investigation into how the South Africas intelligence services failed to warn the government about the imminent arrival of planes transporting refugees from Palestine.\n\nThe Mercury understands from NEC members, who were part of themeeting this past weekend, that concerns were raised that refugees had arrived in the country, with the intelligence services knowing nothing about it.\n\nTwo planes have landed in the country, withone landing a few days ago. The arrival of the passengers raised alarms within government circles, as it has since emerged that the refugees did not know where they were being taken.\n\nA source in the NEC said during discussions, members were shocked that the intelligence services failed to detect this situation.\n\nKeep in mind that this is not the first time something like this has happened; there is another plane that has arrived before, and there have been people coming from Palestine and, we understand, others from Ukraine. However, the intelligence service was unaware; how can that be? We now want them to be investigated, stated the source.\n\nThe NEC members said that both the domestic and foreign intelligence arms should take responsibility for this security breach.\n\nA plane filled with people just landed in our country and they know nothing about it. We wanted answers because this means this could happen again and again.\n\nThe source said the issue was not about the Palestinian refugees but the fact that such a security breach was allowed to happen. The party also wants a profile of everyone that is in the country.\n\nWe are concerned that some of the people that have arrived stated that they paid about R30 000 to be taken here, and we wanted to confirm if that is indeed the case.\n\nThe NEC member also said the party would want to put more stringent visa regimes in place going forward, pointing out that Palestinians and Israelis could get into the country with visas, and that could be beefed up going forward. We have to know who is in the country.\n\nSeveral attempts to get comment from the ANC yesterday were unsuccessful.\n\nPolitical analyst Thabani Khumalo said the situation has left many questions for the ruling party to answer.\n\nIn South Africa, you do not know whether this is a country or what; the manner in which this unfolded has left many people feeling unsafe. We do not feel safe, and the visitors to the G20 will feel unsafe as well.\n\nHow many people are roaming the streets that are unknown? There have been reports of people operating training camps, and even the defence members are complaining, indicating that many things are not going well.\n\nInternational Relations Minister Ronald Lamola said the flight was part of a clear agenda to cleanse Palestinians from Gaza and the West Bank.\n\n[This] is a clearly orchestrated operation because they are not only being sent to South Africa. There are other countries where such flights have been sent, he said.\n\nIt was reported that the Palestinian embassy in South Africa stated that the group left Israels Ramon Airport and flew to the country via the Kenyan capital, Nairobi, without any prior notice or co-ordination.\n\nThe embassy added that an unregistered and misleading organisation had exploited the plight of the Gaza citizens, deceived families, collected money from them, and facilitated their travel in an irregular and irresponsible manner.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/28060019/ANC-rally.jpeg",
            "description": "<p>IOL Members of the ANC’s national executive committee (NEC) have called for an investigation into how the South Africa’s intelligence services failed to warn the government about the imminent arrival of planes transporting refugees from Palestine. The Mercury understands from NEC members, who were part of the meeting this past weekend, that concerns were raised that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/anc-nec-members-demand-investigation-into-intelligence-failures-over-palestinian-refugee-flights/\">ANC NEC members demand investigation into intelligence failures over Palestinian refugee flights</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/",
            "content": "FAO\n\nZimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025from 1920 November, a flagship event held duringWorld Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the worlds most pressing public health and development challenges\n\nAMR threatens the effective treatment of infections in humans, animals and plants, impacting health systems, food security, trade and the environment. Zimbabwe has made substantial progress, supported by the Fleming Fund and the AMR Multi-Partner Trust Fund, in improving laboratory capacity, AMR and AMU surveillance, infection prevention and control (IPC), biosecurity in the agrifood sector and behaviour change initiatives across communities\n\nThe conference aims to provide a national platform where evidence can be shared widely, partnerships strengthened, and innovations showcased to improve policy influence and sustainability of ongoing AMR interventions.\n\nOver the two days, participants will engage inscientific presentations, panel discussions, exhibitions and poster sessions, covering themes such as surveillance across One Health sectors, stewardship and governance, digital innovation, community-level solutions and policy pathways. The programme features multisectoral speakers including experts from the Ministry of Health and Child Care, Ministry of Lands and Agriculture, FAO, WHO, BRTI, academia, development partners, civil society and the private sector.\n\nA dedicatedInnovation and Exhibition Pavilionwill showcase laboratory tools, digital platforms, biosafety technologies and solutions developed by research institutes, private companies and implementing partners. Youth engagement will be led by the Generational Stewards for Antimicrobials (GSA), underscoring the critical role of young scientists and advocates in sustaining momentum on AMR response.\n\nThe conference will also profile Zimbabwes progress in implementing thesecond National Action Plan for AMR (20242028)and highlight emerging regional opportunities for collaboration.\n\nEvent organizers, including the Government of Zimbabwe through the One Health Secretariat, FAO, WHO and BRTI, affirm that strengthening multisectoral partnerships is key to safeguarding the effectiveness of antimicrobials and securing the countrys health and food systems for future generations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19043945/AMR.jpg",
            "description": "<p>FAO Zimbabwe will convene national, regional and international experts for the One Health AMR Conference 2025 from 19–20 November, a flagship event held during World Antimicrobial Awareness Week (WAAW). The conference will bring together more than 150 in-person participants and a broad virtual audience to strengthen collaboration around antimicrobial resistance (AMR), one of the world’s most pressing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-landmark-one-health-amr-conference-during-world-antimicrobial-awareness-week/\">Zimbabwe to host landmark One Health AMR Conference during World Antimicrobial Awareness Week</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute",
            "url": "https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/",
            "content": "By Staff Reporter\n\nFormer legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility.\n\nMliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused his office by allegedly pressuring the City Council to remove residents who acquired land legally along Airport Road.\n\nHarare City Council were intimidated by the office of the Vice President. He forced them to write letters. Vice President can not be using the church to amass wealth for himself and George Charamba, said Mliswa.\n\nThe outspoken politician further called on the Zimbabwe Anti-Corruption Commission (ZACC) to investigate the City Council over the controversial eviction notices.\n\nHere comes the institutions that fight corruption, ZRP, ZACC, you need to investigate Harare City Council. Why they then wrote letters to displace those people when they are the owners of the land? They gave them the land. Everything was paid for. Over US$2 million was paid for that land, then suddenly you think people must just leave because somebody in a higher office, who is a Vice President says something, said Mliswa.\n\nHarare City Council acting Town Clerk Phakamile Mabena Moyo recently issued a three-month notice for the occupants to vacate the land, citing violation of Section 24 of the Regional, Town and Country Planning Act (Chapter 29:12).\n\nMliswas latest remarks come shortly after he accused Chiwengas wife, Minoyothabo Baloyi, of allegedly running a parallel structure in the Zimbabwe National Army.\n\nCity Council, I am going to report you to ZACC for overturning such decisions. That is fraud. If you have overturn decisions of such nature because of certain powers, you will go to jail like a joke, added Mliswa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/30052903/Chiwenga-680x380-1.webp",
            "description": "<p>By Staff Reporter Former legislator Temba Mliswa has accused Vice President Constantino Chiwenga and presidential spokesperson George Charamba of colluding with senior Harare City Council officials to displace St Martins residents to make way for the construction of a medical facility. Mliswa, who has recently intensified his attacks on the Vice President, claims Chiwenga abused</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mliswa-threatens-zacc-probe-into-chiwenga-charamba-over-alleged-abuse-of-office-in-st-martins-land-dispute/\">Mliswa threatens ZACC probe into Chiwenga, Charamba over alleged abuse of office in St Martins land dispute</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Mutapa Fund mining cluster injects 2.4 tons of gold in nine months",
            "url": "https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/",
            "content": "By Alois Vinga\n\nThe Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions.\n\nAs the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests in opportunities aligned with national development priorities across agriculture, renewable energy, technology, and mining. The Fund derives income primarily through dividends and investment returns, and may selectively pursue third-party funding while maintaining conservative leverage under strict risk and governance frameworks.\n\nAddressing delegates at the Zimbabwe Gold Investment Conference 2025, MIF Deputy Chief Investment Officer Ernest Denhere said the strong performance was driven by investee companies within the mining cluster.\n\nThe Fund has strong presence in the gold space through Kuvimba Mining House (KMH) and Defold Mine, delivering 29% of Large Scale Miners gold to Fidelity between January and September, at 2.4 tons. The Fund recognises that gold currently presents a unique opportunity for value creation and growth in export receipts, he said.\n\nMIF officials noted that precious metals, especially gold, have surged in 2025 as investors seek safe-haven assets amid geopolitical and economic uncertainty. Gold has gained 56% year-to-date, while Zimbabwes gold exports have grown by 71% for the nine months to September 2025.\n\nDenhere said the value of gold exported by September stood at US$3.2 billion, with artisanal and small-scale miners contributing 74% of total gold output.\n\nWith a funding pipeline of at least US$500 million across several gold projects, the Fund is open to exploring different strategies to support the sector and bolster the gold value chain. MIF is a long-term, non-speculative investor focused on providing patient capital to its investors.\n\nThe Funds strategy also includes establishing an exploration fund. With gold as a safe-haven asset with long-term upside, there is strong upside for new discoveries, added Denhere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/18124726/Gold-Smuggling.png",
            "description": "<p>By Alois Vinga The Mutapa Investment Fund (MIF) mining cluster has produced a total of 2.4 tons of gold in the first nine months of the year, with plans underway to further boost output through targeted strategic interventions. As the principal investment arm of the Zimbabwean government, MIF is a sector-agnostic sovereign fund that invests</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutapa-fund-mining-cluster-injects-2-4-tons-of-gold-in-nine-months/\">Mutapa Fund mining cluster injects 2.4 tons of gold in nine months</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "ZIFA blocks PSL bid to suspend relegation, says proposal is invalid",
            "url": "https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer Leagues (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, cannot be implemented.\n\nAt an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under PSLs proposal, eight teams that were facing relegation this season would survive, while the four regional division champions would be promoted to the topflight, bringing the league to 22 clubs.\n\nThe meetingwas convened after ZIFA had earlier recommended a 20-team league structure.\n\nIn a statement, ZIFA, however, trashed the PSLs resolution,\n\nThe Association wishes to make it unequivocally clear that this proposal cannot be implemented. Promotion and relegation are fundamental components of football competition and are essential to maintaining the integrity, fairness, and sporting merit of the league system.\n\nZIFA confirmed that four clubs will be relegated at the conclusion of the 2025 Castle Lager Premier Soccer League season, which officially ends on 23 November 2025.\n\nThe association also reminded the PSL to follow proper procedure when proposing structural changes in the future.\n\nShould the Premier Soccer League or any other member wish to propose an adjustment to the number of participating teams or propose any other resolution, such a request must be formally submitted to the Association. In accordance with ZIFA statutes, the proposal will then be tabled for consideration at the next ZIFA Congress, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has blocked the Premier Soccer League’s (PSL) move to suspend relegation for the current season, saying the decision, made just days before the campaign ends, “cannot be implemented.” At an Extraordinary General Meeting held on Tuesday, the PSL resolved to scrap relegation for the 2025 season. Under</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-blocks-psl-bid-to-suspend-relegation-says-proposal-is-invalid/\">ZIFA blocks PSL bid to suspend relegation, says proposal is invalid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Cloudflare outage disrupts X, ChatGPT and other parts of the internet",
            "url": "https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/",
            "content": "The Verge\n\nCloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage thats taking down sites across the web. Users encountered error messages when trying to access X,ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs of recovery.\n\nMany sites displayed an error message saying Please unblock challenges.cloudflare.com to proceed. On Cloudflaresstatus page, the most recent update from the company at 9:34AM ET says:\n\nWeve deployed a change which has restored dashboard services. We are still working to remediate broad application services impact.\n\nIn a statement toThe Verge, Cloudflare spokesperson Jackie Dutton says the company noticed a spike in unusual traffic to one of its services starting at 6:20AM ET, causing some traffic passing through Cloudflares network to experience errors. Dutton adds, We do not yet know the cause of the spike in unusual traffic. We are all hands on deck to make sure all traffic is served without errors. The company is also planning to investigate the cause of the unusual spike in traffic.\n\nOther online services, including Indeed, Grindr, Uber, Canva, Spotify, NJ Transit,League of Legends, and Archive of Our Own, experienced issues during the outage, while digital outlets likeAxios,The Information, andPoliticoalso went down.\n\nThe Cloudflare outage comes less than a month after a hugeAmazon Web Services crash took downFortnite, Alexa, Snapchat, and other services, which was followed by issues atMicrosoft Azure that brought Xbox offlinefor hours.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18150503/cloudflare.jpeg",
            "description": "<p>The Verge Cloudflare, a networking company that provides DDoS protection and internet content delivery services for many companies around the globe, is working to fix a major outage that’s taking down sites across the web. Users encountered error messages when trying to access X, ChatGPT, and even the outage-tracking site DownDetector, which are now showing signs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cloudflare-outage-disrupts-x-chatgpt-and-other-parts-of-the-internet/\">Cloudflare outage disrupts X, ChatGPT and other parts of the internet</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        },
        {
            "title": "Magaya slams State for conducting investigations on social media, says he is ready for rape, fraud trial",
            "url": "https://www.newzimbabwe.com/magaya-slams-state-for-conducting-investigations-on-social-media-says-he-is-ready-for-rape-fraud-trial/",
            "content": "By Mary Taruvinga\n\nLawyers representing Prophetic Healing and Deliverance Ministries founder Walter Magaya and his wife on Tuesday accused the State of conducting investigations through social media, insisting their clients are ready to proceed to trial.\n\nMagaya and his wife face 13 fraud charges, while the cleric is also charged separately with rape. Their companies, Planet Africa and Yadah Connect, are jointly charged.\n\nThe accused persons are ready and the State should investigate the matter in a manner which is not prejudicial to the accused persons, said lead counsel Admire Rubaya.\n\nThe couple appeared before Harare magistrate Marewanazvo Gofa for routine remand, and the matter was postponed to December 9 as investigations continue.\n\nProsecutors requested the postponement, arguing that inquiries were still underway. However, Rubaya, together with lawyer Malvern Mapako, countered that the State should proceed to trial instead of issuing statements on social media.\n\nThis follows several police statements, one calling for victims to come forward and another alleging a US$200,000 scheme to bribe the justice system, remarks which Magaya says are prejudicial.\n\nThe State should bring the accused to trial. They have been investigating the matter since 2022. They should take a leaf from the police homicide department which investigates and bring people to court and not statements.\n\nThey are busy issuing statements as if matters are won on social media. Recently, the accused complained that the police issued a statement alleging there is a fund of 200 thousand to bribe judges, magistrates and instead of arresting the people they are putting out statements.\n\nThere is no need for megaphone investigations. They have been investigating this case and should not develop jelly legs.\n\nThis matter should not just be a statistic that in 2025 there was a case involving Magaya, Rubaya said.\n\nProsecutors allege the couple misrepresented to congregants and followers that they had secured large tracts of land for residential developments in Chishawasha, Norton, Westgate, Fern Valley (Mutare), Bulawayo, Kwekwe, Arcturus, Ruwa, Manyame, and Nyatsime. The companies allegedly collected about US$50,000 and R190,000 from prospective homeowners for stands that never materialised.\n\nIn his bail application, Magaya addressed the rape allegations, dismissing them as fabrications at the instance of the Zimbabwe Gender Commission, which he said has misused its powers to force these two complainants into concocting all manner of allegations against him.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga Lawyers representing Prophetic Healing and Deliverance Ministries founder Walter Magaya and his wife on Tuesday accused the State of conducting investigations “through social media”, insisting their clients are ready to proceed to trial. Magaya and his wife face 13 fraud charges, while the cleric is also charged separately with rape. Their companies,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magaya-slams-state-for-conducting-investigations-on-social-media-says-he-is-ready-for-rape-fraud-trial/\">Magaya slams State for conducting investigations on social media, says he is ready for rape, fraud trial</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:33",
            "date": "19 Nov 2025"
        }
    ]
}