{
    "news": [
        {
            "title": "Bursar jailed for embezzling US$150,000 in school fees",
            "url": "https://www.newzimbabwe.com/bursar-jailed-for-embezzling-us150000-in-school-fees/",
            "content": "By Staff Reporter\n\nTambudzai Majuru (34), a former bursar at Little Rock International School, has been sentenced to four years imprisonment for embezzling US$150,000 in school fees.\n\nThe court heard that Majuru would use fake receipts when learners paid school fees.\n\nThe scheme was exposed later following a tip-off after she had already pocketed US$150,000 over 2 years and 4 months.\n\nFormer Little Rock International School bursar, Tambudzai Majuru (34) of Dema, Chief Seke, was convicted of stealing US$150000 (150K) in school fees using fake receipts by the Harare Magistrates Regional Court.\n\nThe state averred that Majuru created fake receipt books which she used to pocket school fees paid by parents between January 2022-May 2024.\n\nA tip-off led to an audit exposing the fraud. Harare Regional Court sentenced her to an effective 4 years imprisonment, said the NPA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter Tambudzai Majuru (34), a former bursar at Little Rock International School, has been sentenced to four years imprisonment for embezzling US$150,000 in school fees. The court heard that Majuru would use fake receipts when learners paid school fees. The scheme was exposed later following a tip-off after she had already pocketed US$150,000</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bursar-jailed-for-embezzling-us150000-in-school-fees/\">Bursar jailed for embezzling US$150,000 in school fees</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Warriors coach Nees hails Zemura’s Udinese form, outlines AFCON ambitions",
            "url": "https://www.newzimbabwe.com/warriors-coach-nees-hails-zemuras-udinese-form-outlines-afcon-ambitions/",
            "content": "Zimbabwe head coach Michael Nees (57) has praised Jordan Zemuras (25) impressive performances for Udinese this season.\n\nThe formerBournemouthleft-back has been a key player for the Serie A side as they push for European qualification next season.\n\nFor context, the Warriors star has featured in 21 matches across all competitions for Kosta Runjaics Little Zebras, scoring once againstLecce.\n\nThe German tactician is happy withZemuras display so far for the Italian top-flight outfit, while hoping he continues in that form ahead of next months international action.\n\nI think were very happy with his development,coach Nees told Flashscore.com.\n\nAtUdinese, he has attracted some clubs because of his performance, but I think hes in good hands there.\n\nAnd in the national team, he has also performed very well. We have other players who are performing very well.\n\nBut if you ask me, we are very happy with his development and we hope this continues especially with focus on Marchs international football fixtures.\n\nFollowing the expiration of Zemuras contract at Bournemouth, he penned a four-year deal with Udinese on a free transfer.\n\nDespite interest from clubs across Europe and beyond,Zimbabwes head coach suggests the Bluenergy Stadium is the perfect place for him to flourish.\n\nHe continued:I want him to be happy where he plays and to perform good.\n\nFor me as a national coach, Im happy if hes regularly playing in his club.\n\nNees was appointed Zimbabwes head coach in July 2024, replacing indigenous manager Jairos Tapera.\n\nThe 57-year-old is no stranger to African football, having previously managedSeychellesandRwanda, and also serving asSouth Africas technical advisor.\n\nConfident in his credentials, the German coach is eager to guide Zimbabwe to a strong performance at the 2025 Africa Cup of Nations, where they will faceEgypt, South Africa, andAngolain Group B.\n\nHe added:Ive worked in a few more countries like that, and its different in various positions. I think I have a versatile background.\n\nFootball is not only decided with training on the pitch, its decided by many things, especially as a national coach, and I think I can bring a very versatile experience. That I can confidently say.\n\nIve worked in many different positions. I was in various tournaments in different positions, so I know the different points which can affect performance.\n\nBut let me be honest, I think this AFCON will be very well organized and definitely fair.\n\nWe have about 11 months to prepare and we will plan accordingly, and we will try our best. Lets see what comes out.\n\nAgain, I believe in our team, in our players first, but we will respect our opponent.\n\nOn the countrys readiness forMorocco2025, he said:Were still in the process. I came six months ago, and were still developing.\n\nWe have a lot of potential to improve, but I think weve performed quite well so far. Otherwise, we wouldnt have qualified, so we can be satisfied with our progress.\n\nLets see. The AFCON is months away, which is a long time. First, the preparation is divided into organizational and sporting aspects.\n\nFrom an organizational standpoint, this is a huge advantage. Everything is already well-prepared, with team-based camps and hotels arranged, so in a way, theres not much we can influence in that regard.\n\nThe Warriors were disqualified from the 2023 Africa Cup of Nations in Cte dIvoire due to a FIFA suspension. However, they have qualified for the finals five times, although they have yet to progress beyond the group stage.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/21045625/zemura.png",
            "description": "<p>Flashscore Zimbabwe head coach Michael Nees (57) has praised Jordan Zemura’s (25) impressive performances for Udinese this season. The former Bournemouth left-back has been a key player for the Serie A side as they push for European qualification next season. For context, the Warriors’ star has featured in 21 matches across all competitions for Kosta Runjaic’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/warriors-coach-nees-hails-zemuras-udinese-form-outlines-afcon-ambitions/\">Warriors coach Nees hails Zemura’s Udinese form, outlines AFCON ambitions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "US sanctions Rwandan minister, militant over DRC conflict",
            "url": "https://www.newzimbabwe.com/us-sanctions-rwandan-minister-militant-over-drc-conflict/",
            "content": "The United States on Thursday said it was imposing sanctions on a Rwandan government minister and a senior member of an armed group for their alleged role in theconflict in the eastern Democratic Republic of Congo(DRC).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/16020044/DRC-Rebels.png",
            "description": "<p>Reuters The United States on Thursday said it was imposing sanctions on a Rwandan government minister and a senior member of an armed group for their alleged role in the conflict in the eastern Democratic Republic of Congo (DRC). The Rwanda-backed M23 militant group has overrun eastern Congo’s two major cities in recent weeks, deepening a dire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-sanctions-rwandan-minister-militant-over-drc-conflict/\">US sanctions Rwandan minister, militant over DRC conflict</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "A heady brew of people and passion:  Zimbabwe’s Sbu Nkolothi coffee venue wins KZN’s Battle of the Beans competition",
            "url": "https://www.newzimbabwe.com/a-heady-brew-of-people-and-passion-zimbabwes-sbu-nkolothi-coffee-venue-wins-kzns-battle-of-the-beans-competition/",
            "content": "IOL\n\nCoffee entrepreneur, Sbu Nkolothi, the owner and inspiration behind Coffee LAB in Ballito, was chosen as Kwazulu Natals top coffee venue in the Battle of the Beans competition sponsored by Selati Sugar.\n\nNkolothi hails from Victoria Falls in Zimbabwe where he started out as a golf caddy before moving to Durban during the FIFA World Cup in 2010. After a variety of odd jobs, he started working at a popular restaurant where he learned to make coffee and appreciate good food.\n\nSoon, he was making coffee at workspaces and learning everything he could from the coffee mentors who took him under his wing.\n\nHe also became interested in the history of coffee making and studied everything he could about it. He went on to train baristas, which he says was an important opportunity to uplift people and develop skills that would, ultimately, lead to work opportunities.\n\nIn 2020, he opened Coffee LAB, which was almost an immediate hit. However, this extremely modest entrepreneur believes the value of good coffee does not remain in the cup. Coffee brings people together. It connects them. When I make coffee, Im able to engage in and build relationships with them through my coffee. I love people, he says.\n\nAsked how he was drawn to coffee, Nkolothi says: The funny thing is coffee found me  it was a surprise. I started in 2010 as a barista at Mama Lucianas. It was my big coffee break and there was this big coffee machine and I was the guy. The coffee was just giving me peace and love and connecting me with people ever since.\n\nHe then started a facebook page to learn more and connect with coffee professionals all over the world. Everything started to shape up. I was understanding what coffee was all about, training myself, and communicating with people. Coffee is more about character.\n\nAttitude is everything. You can be the best barista in the world but if your character is not right, you are not authentic.\n\nHe soon started training other baristas.\n\nThe Coffee Lab was a dream. It was never meant to be a coffee shop, but more a coffee cabin, he says. Retrenched in 2020, he got a call from the art gallery to open in the foyer. When something is meant to be, its meant to be, Nkolothi says. Up until today coffee has been a passion.\n\nNkolothi has three young girls and loves reading. He also loves it when people drop by to watch football. Hes a Liverpool fan.\n\nThe first runner up in the Battle of the Beans was Lineage, Hillcrest whose owner, Craig Charity, has been at the forefront of coffee roasting and making in KZN for over a decade.\n\nThe second runner up was another relative newcomer to the industry, Skyline Salt Rock. Originally the coffee shop was part of Skyline Coffee Roasters in Morningside but new owner, Darren Lewis, bought the shop in 2023. He says he bought the venue due to its great community spirit. He was a former regional manager for Vida e in KZN.\n\nA good coffee shop is about serving consistently good coffee and food, knowing every regulars coffee order and name. We have over 100 regulars who come to the store five to six times a week, he says.\n\nTop barista was Keagon Chavoos from Crane Flower Coffee in Kloof.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/21043137/Sbu-Nkolothi-with-the-trophy-His-coffee-shop-won-the-2024-Battle-of-the-Beans-competition-in-KZN.webp",
            "description": "<p>IOL Coffee entrepreneur, Sbu Nkolothi, the owner and inspiration behind Coffee LAB in Ballito, was chosen as Kwazulu Natal’s top coffee venue in the Battle of the Beans competition sponsored by Selati Sugar. Nkolothi hails from Victoria Falls in Zimbabwe where he started out as a golf caddy before moving to Durban during the FIFA</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-heady-brew-of-people-and-passion-zimbabwes-sbu-nkolothi-coffee-venue-wins-kzns-battle-of-the-beans-competition/\">A heady brew of people and passion:  Zimbabwe’s Sbu Nkolothi coffee venue wins KZN’s Battle of the Beans competition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Mt Hampden residents facing displacement to make way for Cyber City plead for clarity from govt",
            "url": "https://www.newzimbabwe.com/mt-hampden-residents-facing-displacement-to-make-way-for-cyber-city-plead-for-clarity-from-govt/",
            "content": "By Thandiwe Garusa\n\nTURNER farm residents in Mt Hampden, who are facing displacement to pave way for the development of the new multi-million-dollar Zim Cyber City project, 26 kilometres northwest of Harare, are appealing to the government to provide a clear timeline for their relocation.\n\nThe displacement will affect thousands of residents, but the affected persons say the uncertainty is hindering them from making long-term plans.\n\nThe cyber city, estimated to cost around US$60 billion when complete, will be part of Zimbabwes proposed new administrative capital, also known as New Harare.\n\nAs a precursor to the evictions, the government unilaterally exhumed about 1 000 graves between June and August last year, to pave way for the project.\n\nThe cyber city is being developed by United Arab Emirates-based industrial conglomerate Mulk International, which has injected an initial US$500 million.\n\nAn investigation conducted by NewZimbabwe.com, in conjunction with Information for Development Trust last year, revealed the community was in panic and fear as it faced eviction, relocation uncertainty, and job losses.\n\nThe residents, many of whom have lived in the area for decades have nowhere else to go.\n\nTamira Rufaso (40) said she and other residents were anxious because they do not know what lies ahead for them.\n\nWe are just hanging, waiting for something to happen, we are living on the edge, she said.\n\nThe Ministry of Local Government last year told this publication that affected residents would be moved by mid-2025 and that the government would find them a place to settle.\n\nResidents however say they have not been formally informed of the relocation.\n\nCosmas Mandipwanya, who has been living in Mt Hampden since 1994, pleaded with the government to communicate its position.\n\nWe are pleading with the government to at least give us enough information. They should give us the timelines so that we know when we are leaving and where we are going so that we can plan using the governments calendar, he said.\n\nRight now, I cannot even do a six-month or one-year project because we are scared that anytime we may be evicted.\n\nKungonzwa mota ichiuya wakutofunga kuti wavingwa kuzodzingwa (each time you see a vehicle approaching,you think they have come to evict you), he said.\n\nAnother resident, Amos Basi (48), said residents cant plan.\n\nWe are waiting to hear from the government. We have children to provide for, and right now we cannot even plan for the future. We cant even do our small projects like chicken rearing or gardens Basi said.\n\nResidents also said they were anxious about the impact the evictions would have on their childrens education.\n\nI have grandchildren in exam classes, some in primary school and another one in secondary school, and I am scared that we may get evicted before they write exams. If that happens, what will I do with them? Where will they go and learn?\n\nEphraim Kurushiwe (62), who has called Mt Hampden home since 1997, said his biggest fear is the risk of being homeless at an old age.\n\nI am asking the government to give us accommodation when they move us, he said.\n\nMeanwhile, President Emmerson Mnangagwas spokesperson, George Charamba, dismissed the residents plight on one of his X handle in November last year.\n\nSome stories hadzina mushumo, (are useless). Imagine a story featuring one seemingly distressed farm laborer standing in front of some dingy tenement of one room, all against a headline which says, thousands in distress from displacement by proposed Cyber City!\n\nThe solution implied in the article is that the Cyber City, which, like all cities, will house millions, has to wait for the sake of this wretch and his equally wretched tenement.\n\nTinombofungawo here tisati tanyora zvinyaya zvedu, nhai vanyori nevapepeti venhau (do you think before writing your stories) or we just believe in obstructive journalism, however stupid and futile? Charamba wrote.\n\nEfforts to get a comment from the local government ministry were fruitless. The ministrys spokesperson Gabriel Masvora kept saying he was looking for the information.\n\nMost of the affected residents have no other place to go, as they are mainly children of deceased farm workers originally from Mozambique, Malawi, and Zambia, with some from Zimbabwe.\n\nBetween the early 1900s and the mid-1960s, a significant number of people migrated from Malawi (then known as Nyasaland) to Zimbabwe (then Rhodesia) for various reasons, including the pursuit of higher-paying jobs.\n\nNyasaland, like Zimbabwe, was a British colony but was more densely populated and less economically developed. This economic disparity prompted many to move in search of better employment opportunities.\n\nDuring the same era, Zimbabwe also drew labourers from Mozambique and Zambia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/26153547/Zimbabwe-Cybercity.png",
            "description": "<p>By Thandiwe Garusa TURNER farm residents in Mt Hampden, who are facing displacement to pave way for the development of the new multi-million-dollar Zim Cyber City project, 26 kilometres northwest of Harare, are appealing to the government to provide a clear timeline for their relocation. The displacement will affect thousands of residents, but the affected</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mt-hampden-residents-facing-displacement-to-make-way-for-cyber-city-plead-for-clarity-from-govt/\">Mt Hampden residents facing displacement to make way for Cyber City plead for clarity from govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "European Union lifts sanctions on Zimbabwe’s arms manufacturer, maintains embargo on equipment which may be used for repression",
            "url": "https://www.newzimbabwe.com/european-union-lifts-sanctions-on-zimbabwes-arms-manufacturer-maintains-embargo-on-equipment-which-may-be-used-for-repression/",
            "content": "By James Muonwa\n\nTHE European Union (EU) has lifted sanctions on the Zimbabwe Defence Industries but kept in place the embargo on arms which might be used for internal repression.\n\nIn a recent statement, the bloc says the embargoes extension would be for a further one year.\n\nThe Council today renewed its framework for restrictive measures in view of the situation in Zimbabwe for a further year, until 20 February 2026, the EU noted.\n\nThe arms manufacturer, the Zimbabwe Defence Industries, was the last remaining entityon the sanctions list.\n\nThe Council also delisted the last remaining entity, the Zimbabwe Defence Industries, the announcement further read.\n\nThe EU says it continues to closely follow developments in Zimbabwe, paying particular attention to the human rights situation. It recalls its readiness to adapt the whole range of its policies accordingly.\n\nOn February 15, 2011, the Council adopted Decision 2011/101/CFSP concerning restrictive measures in view of the rights situation in Zimbabwe.\n\nThe remaining restrictive measures do not affect the people of Zimbabwe, its economy, foreign direct investments, or trade.\n\nCountries that are part of the EU bloc include Austria, Belgium, Bulgaria, Croatia, Republic of Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain and Sweden.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/15041109/European-Union.jpg",
            "description": "<p>By James Muonwa THE European Union (EU) has lifted sanctions on the Zimbabwe Defence Industries but kept in place the embargo on arms which might be used for “internal repression”. In a recent statement, the bloc says the embargoes extension would be for a further one year. “The Council today renewed its framework for restrictive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/european-union-lifts-sanctions-on-zimbabwes-arms-manufacturer-maintains-embargo-on-equipment-which-may-be-used-for-repression/\">European Union lifts sanctions on Zimbabwe’s arms manufacturer, maintains embargo on equipment which may be used for repression</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Zimbabwe’s ARV supplies may run dry by June after USAID cut funding",
            "url": "https://www.newzimbabwe.com/zimbabwes-arv-supplies-may-run-dry-by-june-after-usaid-cut-funding/",
            "content": "By Staff Reporter\n\nZIMBABWEs antiretroviral (ARV) medication supplies will be depleted by the end of June if it fails to address a funding gap which has been created by USAIDs recent cessation of its aid.\n\nThe UnitedStatesEmbassy in Zimbabwe paused all U.S. foreign assistance funded by or through the State Department and USAID for reviewand this has ledto temporary suspension of services at New Start Centres and truck stop clinics across the country impacting patients on antiretroviral therapy (ART) and those seeking PrEP refills.\n\nThis has caused panic as HIV patients face uncertainty.\n\nHowever, speaking in a parliamentary session Wednesday, Minister of Health Douglas Mombeshora assured the national assembly that by the end of June the government would have replenished its stocks.\n\nWe sat down and assessed thetype of medicines that we need. It is not correct that all medicines werecoming through USAID, I think it was 31%.\n\nWe have medicines to takeus up to the end of June but by June, we will have replenished.\n\nPeople should not panic, there is enough medication and medication will be available forever, Mombeshora said.\n\nMombeshora also said the termination of USAID funding has led to job losses for healthcare personnel in HIV treatment clinics, disrupted transport for remote healthcare access, and has forced the ministry to seek additional funding to address these challenges.\n\nThe health ministry will be approaching Parliament for support during the supplementary budget for review.\n\nWe are therefore seized with scouting for replacements. The other challenge that we are facing pertains to vehicles and motorbikes which were used by healthcare personnel to access remote clinics.\n\nMotorbikes which were used to transport blood samples were also affected by theexecutive order.\n\nThis has culminated into a situation where our Ministry is in the process of requesting extra funding to cater for such key personnel, Mombeshora said.\n\nBefore the funding cut, Zimbabwe used to receive over $200 million annually from the U.S. Presidents Emergency Plan for AIDS Relief (PEPFAR), and the U.S government has given Zimbabwe over $1.7 billion since 2006 to strengthen health systems and support people living with HIV.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/01/08044936/mombeshora.webp",
            "description": "<p>By Staff Reporter ZIMBABWE’s antiretroviral (ARV) medication supplies will be depleted by the end of June if it fails to address a funding gap which has been created by USAID’s recent cessation of its aid. The United States Embassy in Zimbabwe paused all U.S. foreign assistance funded by or through the State Department and USAID for review and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-arv-supplies-may-run-dry-by-june-after-usaid-cut-funding/\">Zimbabwe’s ARV supplies may run dry by June after USAID cut funding</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Bodies of 90 illegal Stilfontein miners remain unclaimed",
            "url": "https://www.newzimbabwe.com/bodies-of-90-illegal-stilfontein-miners-remain-unclaimed/",
            "content": "Sowetan Live\n\nOnly three of the 93 illegal miners who died at Stilfontein have been claimed by their families so far, North West police say\n\nThe remaining bodies are still at state mortuaries as no next of kin have come forward to claim them since police asked relatives to help identify them three weeks ago.\n\nTen of the bodies were identified through police records which showed they had been arrested before, while 80 are still unidentified.\n\nPolice spokesperson Brig Sabata Mokgwabone said DNA samples were obtained from the bodies and fingerprints were taken for comparison. This process resulted in the identification of 10 bodies through previous arrests in the country, he said.\n\nThe 10 were identified through the police database, which showed they were arrested in Jane Furse, Burgersfort, Welkom, Barberton and Kwa-Mhlanga.\n\nMokgwabone confirmed that one is South African, seven are from Mozambique and the others from Lesotho and Zimbabwe. He did not have information about their previous charges. . We have their particulars, but they are not yet identified by their families, he said.\n\nMokgwabone said the bodies that had been claimed were handed over to their relatives, who are all from Mozambique.\n\nNorth West department of health spokesperson Lucas Mothibedi said they will keep the bodies and will only bury them as paupers after police have exhausted all avenues to find their next of kin.\n\nThe law does permit us to keep them for 30 days when there are no issues  i.e. police investigations, outstanding legal documentations, and no court battles/litigations.But in a unique case like this one, we can keep them as long as all avenues have not been fully explored, he said.\n\nWithout presuming, we will be guided by the police. Once they are satisfied that theres no hope, we will archive the DNA and then proceed with paupers funerals. The objective here is to ensure we find families  burying them is the last resort. We have enough space to keep them.\n\nMokgwaabone said people with missing relatives who know or suspect they worked in and around Khuma/Stilfontein as zama zamas and have not seen or heard from them for some time were requested to contact the investigation team at Stilfontein police station.\n\nThis led to us obtaining 45 control samples  18 from Mozambican nationals, six from Lesotho nationals, eight from Zimbabweans, 12 from South Africans and one from a Botswana national.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/20053329/stilfontein.jpg",
            "description": "<p>Sowetan Live Only three of the 93 illegal miners who died at Stilfontein have been claimed by their families so far, North West police say The remaining bodies are still at state mortuaries as no next of kin have come forward to claim them since police asked relatives to help identify them three weeks ago.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bodies-of-90-illegal-stilfontein-miners-remain-unclaimed/\">Bodies of 90 illegal Stilfontein miners remain unclaimed</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "AU ambassador hires Florida lobbyists in bid to get Trump to lift Zim sanctions",
            "url": "https://www.newzimbabwe.com/au-ambassador-hires-florida-lobbyists-in-bid-to-get-trump-to-lift-zim-sanctions/",
            "content": "News24\n\nThe African Unions (AU) mission to the US has engaged the services of a Florida-based lobby group to urge the Trump administration to lift targeted sanctions on senior Zimbabwean officials, including that of the countrys, President Emmerson Mnangagwa.\n\nA Foreign Agents Registration Act (FARA) filing from December last year shows that the AU mission engaged lobby group Ford and London Global Strategies, in a bid to lift targeted sanctions on Zimbabwe and foster a renewed partnership between the US and Zimbabwe.\n\nZimbabwe and the AU have long called for all sanctions to be lifted.The FARA filing shows that the AUs mission is optimistic that the Trump administration might be more receptive to this request than the Biden White House.\n\nAU ambassador to the US, Hilda Suka-Mafudze, wrote in an email to the lobby group last year that lifting sanctions on Zimbabwean individuals and entities would benefit the US by securing vital resources, creating economic opportunities for US businesses, and reasserting American leadership in southern Africa.\n\nShe pitched the idea that bilateral trade and investment agreements could prioritise US businesses under the America First strategy, ensuring US firms have preferential access to Zimbabwes markets and resources. Suka-Mafudzes email sets out the key messages she wants the lobby group to take to its meeting with team Trump. One of her proposals includes the line: Countering Chinese Influence.\n\nSuka-Mafudze writes that the US could benefit from Zimbabwes strategic location in Southern Africa, its critical minerals, and its workforce while reducing the regions dependence on Chinese investments. Aligning with Zimbabwe could counterbalance Chinas growing influence in the region and open avenues for US investments in agriculture, mining, and infrastructure, she adds.\n\nChina is one of Zimbabwes largest trading partners. According to the Chinese Embassy in Zimbabwe, bilateral trade between China and Zimbabwe was upwards of $3.8bn, in 2024.\n\nThe US first sanctioned Zimbabwe in 2001 under the Zimbabwe Democracy and Economic Recovery Act. This suite of sanctions was based on allegations of political repression, election rigging, land seizures, and corruption under former President Robert Mugabe.\n\nFormer US President Joe Biden ended this sanctions programme in March last year, unblocking all individuals, entities, and property previously affected.\n\nHowever, the US then proceeded to impose new targeted sanctions under the Global Magnitsky Programme on 11 individuals and three entities.\n\nThose sanctioned included Zimbabwean President Emmerson Mnangagwa, first lady Auxillia Mnangagwa, and first Vice-President Constantino Chiwenga.\n\nThe US has hit back against claims that the sanctions are responsible for Zimbabwes economic woes, saying they target only a handful of Zimbabweans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>News24 The African Union’s (AU) mission to the US has engaged the services of a Florida-based lobby group to urge the Trump administration to lift targeted sanctions on senior Zimbabwean officials, including that of the country’s, President Emmerson Mnangagwa. A Foreign Agents Registration Act (FARA) filing from December last year shows that the AU mission</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/au-ambassador-hires-florida-lobbyists-in-bid-to-get-trump-to-lift-zim-sanctions/\">AU ambassador hires Florida lobbyists in bid to get Trump to lift Zim sanctions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        },
        {
            "title": "Chinese doctors to provide free surgeries for 600 cataract patients in Zimbabwe",
            "url": "https://www.newzimbabwe.com/chinese-doctors-to-provide-free-surgeries-for-600-cataract-patients-in-zimbabwe/",
            "content": "Xinhua\n\nA total of 600 cataract patients in Zimbabwe will receive free surgeries from Chinese doctors under the China-aided Bright Journey program.\n\nA team of 12 doctors from Chinas Hunan Provincial Peoples Hospital will perform the surgeries from Feb. 23 to March 1 in Harare, Zimbabwes capital, Hong Xiuqin, the team leader, told Xinhua on Wednesday.\n\nScreening for eligible patients began on Feb. 12 and is currently underway, Hong said, adding that the Chinese medical team will collaborate with local doctors, provide on-site training, and engage in academic exchanges with Zimbabwean healthcare personnel.\n\nThe program marks the 45th anniversary of diplomatic relations between China and Zimbabwe and the 40th anniversary of bilateral medical cooperation.\n\nHong said the program aims to foster cooperation and exchanges between the two countries by bringing light and hope to Zimbabwean patients.\n\nThe incidence of cataracts in Zimbabwe is high, and we are concerned about the health of the Zimbabwean people, she said, adding that the Chinese government attaches great importance to the cooperation and friendship between China and Zimbabwe.\n\nBoniface Macheka, head of ophthalmology at Parirenyatwa Group of Hospitals, praised the initiative as a testament to Zimbabwe-China relations.\n\nThere is a historical basis to the relationship between our country and China. I believe this relationship is going to be further solidified by this program, he told Xinhua.\n\nHe expressed hope for more bilateral medical collaborations in the future. We hope to be able to increase the diversity of the surgeries that we do at this hospital so that well be able to serve our people better and to make the services more available, he said.\n\nAmos Chakaza, a 67-year-old patient, traveled over 170 km from Manicaland Province to Harare for screening. I cant wait for my vision to be clear since I have a lot of responsibilities. Having poor eyesight is detrimental to my work. I need to see clearly to be more productive, Chakaza said.\n\nHunan has implemented numerous medical projects in Zimbabwe over the years, including initiatives for maternal and child health, schistosomiasis prevention and treatment, and traditional Chinese medicine training.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/20044441/cataract.jpg",
            "description": "<p>Xinhua A total of 600 cataract patients in Zimbabwe will receive free surgeries from Chinese doctors under the China-aided “Bright Journey” program. A team of 12 doctors from China’s Hunan Provincial People’s Hospital will perform the surgeries from Feb. 23 to March 1 in Harare, Zimbabwe’s capital, Hong Xiuqin, the team leader, told Xinhua on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chinese-doctors-to-provide-free-surgeries-for-600-cataract-patients-in-zimbabwe/\">Chinese doctors to provide free surgeries for 600 cataract patients in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "21 Feb 2025"
        }
    ]
}