{
    "news": [
        {
            "title": "Cardi B reveals she’s expecting baby with Stefon Diggs, reflects on falling in love again",
            "url": "https://www.newzimbabwe.com/cardi-b-reveals-shes-expecting-baby-with-stefon-diggs-reflects-on-falling-in-love-again/",
            "content": "CBS News\n\nCardi Bis expecting her fourth child, the rapper exclusively announced Wednesday on CBS Mornings.\n\nThe 32-year-old said she feels excited and happy, while preparing to release new music and balancing motherhood.\n\nI feel like Im in a good space. I feel very strong. I feel very powerful that Im doing all this work. But Im doing all this work while Im creating a baby, me and my man, were very supportive of each other, she said.\n\nCardi B said she and Diggs share the same ambition, each determined to be the greatest in their fields. She also credited Diggs with giving her a sense of stability as she readies her next album, Am I The Drama?, which includes a track called Safe.\n\nAnd he just makes me feel safe and very confident and very strong, she said. I mean, like, two weeks ago I was literally having a panic attack. I was, like, crying and crying and crying, just because I was just getting really nervous with you know, the whole album rollout  People were coming at me very hard. You know, sometimes people love you, people hate you. And people was just saying very mean things about me.\n\nShe admitted harsh criticism sometimes makes her question releasing music.\n\nAnd Im like, see, this is why I dont put music out, because its like, this is my art and this is something that I put a lotta love and time to. And its just like, sometimes, when people just rip it apart it just hurts you and it crushes you, she said.\n\nThrough it all, Cardi B  whose real name is Belcalis Marlenis Almnzar  said Diggs support keeps her steady.\n\nHe makes me feel very confident And it makes you feel like you could take over the world.\n\nShe added that she waited to announce the pregnancy until she was able to close some deals first. She also admitted she has not yet told her parents, jokingly saying she is scared of them.\n\nCardi B, who shares three children with rapper Offset, said she was reluctant to fall in love again amid their high-profile divorce. But she recalled Diggs telling her: Let me heal you. Give me a chance for me to heal you.\n\nNow that pregnancy rumors are confirmed, Cardi B used her world-famous humor to ask fans to purchase her new album: Now yall could buy my album so I can buy Pampers and diapers and all that type of stuff. I told you. Now go support my album, cause Im a mother of four now.\n\nCardi B says her sophomore album feels complete.\n\nI feel like it touch every little thing that I want to touch. And I just feel like its something that is not out there right now.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17173351/cardi-b.webp",
            "description": "<p>CBS News Cardi B is expecting her fourth child, the rapper exclusively announced Wednesday on “CBS Mornings.” The Grammy winner revealed she is pregnant and having a baby with her boyfriend, New England Patriots wide receiver Stefon Diggs, confirming weeks of speculation about her personal life. She said the baby is due before the start of her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cardi-b-reveals-shes-expecting-baby-with-stefon-diggs-reflects-on-falling-in-love-again/\">Cardi B reveals she’s expecting baby with Stefon Diggs, reflects on falling in love again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "18 Sep 2025"
        },
        {
            "title": "Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine",
            "url": "https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/",
            "content": "By Darlington Gatsi\n\nPRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs.\n\nThe judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of the Chinese nationals.\n\nWe call through you, Madam Speaker, for an appeal of the recent judgement of foreign nationals who were fined US$150 for being arrested in possession of dangerous drugs. We further propose the immediate deportation of these foreign nationals, who are bad apples amongst us, said Tendai Pinduka, a ZANU PF MP.\n\nHarare magistrate Vakayi Chikwekwe ruled that the quantity of cocaine the nine Chinese nationals were in possession of was insignificant.\n\nThe leniency of the judgement has been widely criticised, with the Zimbabwean government accused of being too soft on the Chinese, with whom it maintains a strong relationship.\n\nBy comparison, being found in possession of drugs in China is met with far harsher punishment, in some cases, a death penalty.\n\nThe judgement has been viewed as a mere slap on the wrist and one that undermines the governments stance on fighting drug abuse in communities.\n\nSurprisingly, foreign nationals were recently found in possession of dangerous drugs and cocaine, arrested, and fined a paltry US$150, which in our view is not deterrent enough. It further undermines the authority of His Excellency the President, Dr E.D. Mnangagwa, in combating the menace and scourge of drugs and substance abuse, said Pinduka.\n\nChinese nationals have been accused of committing crimes and escaping harsh sentences by leveraging their all-weather friendship with Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/26021333/new-parliament-16-1024x637-1.png",
            "description": "<p>By Darlington Gatsi PRESSURE continues to mount on the National Prosecution Authority (NPA) over a recent judgement in which Chinese nationals escaped jail despite being found in possession of drugs. The judgement has been met with public outrage, and on Tuesday it was raised in the National Assembly, with legislators calling for the deportation of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-calls-for-deportation-of-chinese-nationals-found-in-possession-of-cocaine-demands-a-relook-into-imposed-us150-fine/\">Parliament calls for deportation of Chinese nationals found in possession of cocaine – demands a relook into imposed US$150 fine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "18 Sep 2025"
        },
        {
            "title": "Zimbabwe Alternative Mining Indaba urges pro-poor, sustainable mining practices",
            "url": "https://www.newzimbabwe.com/zimbabwe-alternative-mining-indaba-urges-pro-poor-sustainable-mining-practices/",
            "content": "By Alois Vinga\n\nThe 14th edition of the Zimbabwe Alternative Mining Indaba (ZAMI) kicked off in Bulawayo on Tuesday, with participants urging government and industry players to embrace mining initiatives that place people and communities at the centre of resource exploitation.\n\nZimbabwe is endowed with vast mineral wealth, including platinum-group metals (PGMs), chrome, lithium, gold, coal, diamonds, nickel, copper, black granite, and asbestos, alongside potential resources such as iron ore, tungsten, and semi-precious stones. Yet, despite this vast mineral basket, the majority of Zimbabweans continue to face economic hardship.\n\nThe Borgen Project estimates that 60% of the population lives on less than US$3.65 a day, making Zimbabwe one of the poorest countries in the SADC region. Rural communities, home to about 67% of the population, remain most vulnerable to food insecurity, drought, and economic shocks. Meanwhile, the health sector continues to struggle, with 87% of Zimbabweans lacking medical aid coverage and persistent shortages of medicines, staff, and resources worsened by an ongoing brain drain.\n\nSpeaking at the event, Zimbabwe Council of Churches (ZCC) Secretary General Wilfred Dimingu described mining in the country as a story of plunder rather than stewardship.\n\nIn Zimbabwe, we have witnessed rivers polluted, communities displaced, and workers exploited in the name of short-term gains. This is not stewardship. It is idolatry, worshipping mammon over the Creator. Theologically, we are called to a different path, he said.\n\nDimingu stressed that sustainable development must be rooted in justice and fairness.\n\nThis means harnessing Zimbabwes minerals, particularly those critical for renewable energy and battery technologies, not through voracious extraction that scars the land and sidelines the poor, but through operations that ensure equity and sustainability, he added.\n\nZandile Mvududu, a project officer at Silveira House, emphasised the need for collaboration in shaping the extractive sectors future.\n\nStakeholders must continue to dialogue, hinging on the faith-based approach which we encourage in the districts we work in. The coming Mines and Minerals Bill presents an opportunity for communities to give input and resolve legacy issues in the sector, she said.\n\nProfessor Tumai Murombo, a legal and environmental expert from the University of the Witwatersrand (South Africa), echoed calls for reform, urging a total overhaul of Zimbabwes minerals governance and environmental management framework.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17164316/Dimingu-ZCC.png",
            "description": "<p>By Alois Vinga The 14th edition of the Zimbabwe Alternative Mining Indaba (ZAMI) kicked off in Bulawayo on Tuesday, with participants urging government and industry players to embrace mining initiatives that place people and communities at the centre of resource exploitation. Zimbabwe is endowed with vast mineral wealth, including platinum-group metals (PGMs), chrome, lithium, gold,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-alternative-mining-indaba-urges-pro-poor-sustainable-mining-practices/\">Zimbabwe Alternative Mining Indaba urges pro-poor, sustainable mining practices</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "18 Sep 2025"
        },
        {
            "title": "Maningi Queens FC quits Women’s Premier Soccer League over alleged FIFA grant fraud",
            "url": "https://www.newzimbabwe.com/maningi-queens-fc-quits-womens-premier-soccer-league-over-alleged-fifa-grant-fraud/",
            "content": "By Sports Reporter\n\nManingi Queens FC has pulled out of the Zimbabwe Womens Premier Soccer League (ZWPSL), citing alleged fraud involving FIFA and CAF womens football grants.\n\nNewZimbabwe.com has it on good authority that the club, on September 15, formally wrote to the league executive notifying them of its decision to withdraw.\n\nIn its letter, the club raised several grievances, including the diversion of FIFA and CAF grants meant for womens football to mens football activities, lack of legal action on player development and training compensation by bigger teams that poach players, as well as unaffordable referees fees in a league with no sponsorship.\n\nThe club further alleged that ZIFA administrators were being bribed to corruptly clear players for bigger clubs at the expense of teams investing in development.\n\nConfirming the withdrawal Tuesday evening, the ZWPSL applauded Maningi Queens for their significant contribution to the growth of womens football despite their decision to exit.\n\nThe league acknowledges the concerns raised by the club and respects their decision to withdraw.\n\nThe ZWPSL extends its heartfelt gratitude to Maningi Youth Soccer Academy for their substantial contributions to the advancement of womens soccer.\n\nZWPSL remains committed to promoting a competitive and vibrant womens game and looks forward to continuing to work with stakeholders to advance womens football in Zimbabwe, read part of the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/17162039/maningi-queens.jpg",
            "description": "<p>By Sports Reporter Maningi Queens FC has pulled out of the Zimbabwe Women’s Premier Soccer League (ZWPSL), citing alleged fraud involving FIFA and CAF women’s football grants. NewZimbabwe.com has it on good authority that the club, on September 15, formally wrote to the league executive notifying them of its decision to withdraw. In its letter,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/maningi-queens-fc-quits-womens-premier-soccer-league-over-alleged-fifa-grant-fraud/\">Maningi Queens FC quits Women’s Premier Soccer League over alleged FIFA grant fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:30",
            "date": "18 Sep 2025"
        }
    ]
}