{
    "news": [
        {
            "title": "‘Not in Our Name’ – South African artists condemn Gayton McKenzie’s xenophobic tirade",
            "url": "https://www.newzimbabwe.com/not-in-our-name-south-african-artists-condemn-gayton-mckenzies-xenophobic-tirade/",
            "content": "IOL Entertainment\n\nActress Thandi Sebe has joined a growing chorus of South African artists condemning Minister of Sports, Arts and Culture,Gayton McKenzie,for spreading Afrophobic hate speech.\n\nIn a recent post on Instagram, Sebe said: As the South African Constitutional Court turns 30, we as South African artists call upon our leaders to protect the ideals of our beautiful constitution that guarantee the promise of a South Africa that belongs to all who live in it.\n\nWe condemn the hateful vitriol that the Minister for Arts and Culture spews about foreign citizens living in this country. We unequivocally condemn his tirades and say: Not in Our Name.\n\nMcKenzie came under firefollowing recent remarks targeting the employment of two Zimbabweans by the Market Theatre.\n\nHe is reported to have said: some of you here have the audacity to hire foreigners instead of South Africans; I dont care how you used to do it. But for as long as I am the minister, there will be no foreigner that will work in an entity while a South African can do the same thing; and foreigners employed bygovernment departmentsneeded to be out in three weeks I said it, I want them out, get them out.\n\nSebe went on to demand accountability from politicians, urging them to honour the constitution of the country.\n\nOther artists participating in the condemnation included Rafeeqah Galant, Marc Lottering, Hakeem Kae-Kazim, Mike van Graan, Tshamano Sebe, Rea Rangaka, Liza Scholtz, Lesedi Kolotsi, Matthew Griffiths, Ace Marcus, Liyema Duze, Mzu Ntantiso, Thandi Sebe, Rameez Cassiem, Danica Jones and Mihlali Kope.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24011832/Minister-of-Sport-Arts-and-Culture-Gayton-Mackenzie-Picture-Ayanda-Ndamane-Independent-Media-File.webp",
            "description": "<p>IOL Entertainment Actress Thandi Sebe has joined a growing chorus of South African artists condemning Minister of Sports, Arts and Culture, Gayton McKenzie, for spreading Afrophobic hate speech. In a recent post on Instagram, Sebe said: “As the South African Constitutional Court turns 30, we as South African artists call upon our leaders to protect the ideals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/not-in-our-name-south-african-artists-condemn-gayton-mckenzies-xenophobic-tirade/\">‘Not in Our Name’ – South African artists condemn Gayton McKenzie’s xenophobic tirade</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "26 Jun 2025"
        },
        {
            "title": "Prince Dube’s Young Africans lift Tanzanian League Title",
            "url": "https://www.newzimbabwe.com/prince-dubes-young-africans-lift-tanzanian-league-title/",
            "content": "By Sports Reporter\n\nPrince Dubes club, Young Africans, on Wednesday afternoon won the NBC Tanzania Premier League trophy after beating rivals and fellow contenders Simba SC 2-0 in the final match of the season.\n\nThe title marks Prince Dubes first league title in his professional career, which started at Highlanders.\n\nYoung Africans lifted the league trophy with a record 82 points, four ahead of Simba SC, who finished on 78 points.\n\nWinning the title will see Yanga representing Tanzania in the coming 2025-26 Total CAF Champions League season.\n\nDube joined Young Africa in July last year after a three-year stint with another Tanzanian side, Azam FC.\n\nSince joining Yanga, the Zimbabwean forward has managed to score 14 league goals and three more in the CAF Champions League.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26045208/Screenshot-2025-06-26-at-05.50.42.png",
            "description": "<p>By Sports Reporter Prince Dube’s club, Young Africans, on Wednesday afternoon won the NBC Tanzania Premier League trophy after beating rivals and fellow contenders Simba SC 2-0 in the final match of the season. The title marks Prince Dube’s first league title in his professional career, which started at Highlanders. Young Africans lifted the league</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prince-dubes-young-africans-lift-tanzanian-league-title/\">Prince Dube’s Young Africans lift Tanzanian League Title</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "26 Jun 2025"
        },
        {
            "title": "Sixteen killed, hundreds injured, in antigovernment Kenyan protests",
            "url": "https://www.newzimbabwe.com/sixteen-killed-hundreds-injured-in-antigovernment-kenyan-protests/",
            "content": "Agencies\n\nAt least 16 people have been killed in nationwide rallies against police brutality and government corruption in Kenya, according to Amnesty International and the Kenya National Commission on Human Rights.\n\nAnother 400 people were injured on Wednesday, including protesters, police and journalists. The casualties included people hit by live fire and others who were wounded by rubber bullets, or were beaten, and were primarily in the Kenyan capital, Nairobi.\n\nDemonstrators had clashed with police, who hurled tear gas canisters and wielded batons. The protests mark one year since people stormed parliament at the peak of antigovernmentdemonstrations.\n\nThousands took to the streets to commemorate last years youth-led demonstrations against tax rises, during which at least 60 people were killed by security forces, according to rights groups.\n\nAmong the crowds in the capital, some waved Kenyan flags and placards with pictures of demonstrators killed last year and chanted Ruto must go, referring to President William Ruto, whose proposed tax hikes triggered last years youth-led protests.\n\nIve come here as a Kenyan youth to protest. It is our right for the sake of our fellow Kenyans who were killed last year. The police are here  they are supposed to protect us, but they kill us, Eve, a 24-year-old woman, told the AFP news agency.\n\nIt is extremely important that the young people mark June 25th because they lost people who look like them, who speak like them  who are fighting for good governance, said Angel Mbuthia, chair of the youth league for the opposition Jubilee Party.\n\nProtesters also gathered in various other parts of the country, including in the town of Matuu, approximately 100km (62 miles) from the capital, where there were reports of clashes.\n\nPolice blocked main roads leading into the capitals central business district, while government buildings were barricaded with razor wire.\n\nThe government ordered TV and radio stations to halt live coverage of the protests.\n\nNetBlocks, a global internet tracker, said social media platform Telegram had been restricted. And Kenyan broadcaster KTN was taken off the air later on Wednesday, a senior official at its parent company, Nation Media Group, said.\n\nAl Jazeeras Malcolm Webb, reporting from Nairobi, said protests across the country have been met with a lot of violence by the police.\n\nAbout a dozen people have been treated for gunshot wounds, he said, citing local media reports.\n\nKenyas Citizen TV reported that protesters torched court facilities in Kikuyu on the outskirts of Nairobi.\n\nIsolated clashes were reported in the port city of Mombasa, according to NTV, with protests also in the towns of Kitengela, Kisii, Matuu and Nyeri.\n\nThe anniversary comes amid soaring anger aboutpolice brutality, particularly after 31-year-old blogger and teacher, Albert Ojwang, was killed in custody earlier this month following his arrest for criticising a senior officer.\n\nSix people, including three police officers, were charged with murder on Tuesday for Ojwangs killing. They have all pleaded not guilty.\n\nPolice have said protests are permitted as long as they are peaceful and unarmed.\n\nBut a group of peaceful protesters was attacked last week by a large gang of motorbike-riding goons, as they are known in Kenya, armed with whips and clubs and working in tandem with the police.\n\nOn Tuesday, the embassies of the United States, the United Kingdom, Canada, and other Western nations released a joint statement on X urging all involved to facilitate peaceful demonstrations and to refrain from violence.\n\nThe use of plain clothed officers in unmarked vehicles erodes public trust, the statement said. Rights campaigners condemned the presence of unidentified police officers at protests last year.\n\nKenyas Ministry of Foreign Affairs said in a statement late on Tuesday that any policing violations would be addressed through government institutions, including the parliament and the judiciary.\n\nThe ministry reminds all that diplomatic partnerships flourish best in mutual respect, open channels and a recognition of each others unique governance contexts, it said.\n\nThere is also growing resentment among young people towards Ruto, who came to power in 2022, promising rapid economic progress.\n\nMany have been disillusioned by continued stagnation, corruption and high taxes, even after last years protests forced Ruto to cancel an unpopular finance bill. His government has been at pains to avoid direct tax rises this year.\n\nBut the frequent disappearances of government critics  rights groups have counted more than 80 since last years protests, with dozens still missing  have led many to accuse Ruto of returning Kenya to the dark days of its dictatorship in the 1980s and 90s.\n\nRuto previously promised an end to abductions but was unapologetic in a speech on Tuesday, pledging to stand by the police.\n\nYou cannot use force against the police or insult, or threaten the police, he warned protesters. You are threatening our nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/26042000/AFP__20250625__63PB84A__v2__HighRes__TopshotKenyaUnrestPolitics-1750838089.webp",
            "description": "<p>Agencies At least 16 people have been killed in nationwide rallies against police brutality and government corruption in Kenya, according to Amnesty International and the Kenya National Commission on Human Rights. Another 400 people were injured on Wednesday, including protesters, police and journalists. The casualties included people hit by live fire and others who were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sixteen-killed-hundreds-injured-in-antigovernment-kenyan-protests/\">Sixteen killed, hundreds injured, in antigovernment Kenyan protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "26 Jun 2025"
        },
        {
            "title": "Dynamos summoned by PSL, Chaminuka reacts",
            "url": "https://www.newzimbabwe.com/dynamos-summoned-by-psl-chaminuka-reacts/",
            "content": "By Sports Reporter\n\nDynamos coach Saul Chaminuka has responded to the recent summons to appear before the Premier Soccer League Disciplinary Committee.\n\nThis comes after the team walked off the pitch in a match against FC Platinum on Sunday, protesting against the referees decision leading to the abandonment of the match.\n\nSpeaking during a press conference this afternoon, Chaminuka said he is willing to go before the disciplinary and share his side of the story.\n\nI dont think that we will fail to answer the questions, because we are going to be talking about what happenedon the field of play, and thats my area.\n\nIt will be a question of how they want to take it; otherwise, we are going to talk in football, and I think Im the specialist when it comes to that area, said Chaminuka.\n\nDynamos was summoned by PSL to appear before the Disciplinary Committee together with coach Chaminuka on the 8thof July.\n\nThe Harare giants will become the third club this season to appear before the committee, the other two being Kwekwe United and Chicken Inn.\n\nKwekwe United failed to appear for their home fixture against Herentals in April and Chicken Inn walked off the pitch against Scottland last month at Rufaro in protest of a penalty, an incident which then led to the abandonment of the match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Sports Reporter Dynamos coach Saul Chaminuka has responded to the recent summons to appear before the Premier Soccer League Disciplinary Committee. This comes after the team walked off the pitch in a match against FC Platinum on Sunday, protesting against the referee’s decision leading to the abandonment of the match. Speaking during a press</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-summoned-by-psl-chaminuka-reacts/\">Dynamos summoned by PSL, Chaminuka reacts </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "26 Jun 2025"
        },
        {
            "title": "Deal or no deal? Zimbabwe still divided over land 25 years after white farmers evicted",
            "url": "https://www.newzimbabwe.com/deal-or-no-deal-zimbabwe-still-divided-over-land-25-years-after-white-farmers-evicted/",
            "content": "BBC\n\nA quarter of a century after their land was seized during a chaotic land reform programme that made global headlines, a small group of white Zimbabwean farmers have accepted a controversial compensation deal from the government.\n\nOnce the backbone of the countrys agricultural sector, many of them are now elderly, visibly frail, battling illness and financially desperate.\n\nI believe this is the only opportunity. We cant wait 10 years for another deal,  71-year-old Arthur Baisley told the BBC.\n\nStill recuperating from back surgery, Mr Baisley was among those who arrived earlier this year at a conference room in the capital, Harare  some aided by walking sticks and walking frames  to discuss the deal.\n\nThe catch is that these farmers have now been paid only 1% of their total compensation in cash  the rest is being issued as US dollar-denominated treasury bonds that mature in 10 years  with 2% interest paid twice a year.\n\nThe land reform programme, sparked by the invasion of white-owned farms around the country by supporters of the late Robert Mugabe, was launched in 2000 by the then president, who was desperate to shore up political support at the time when Zimbabwe had about 2,500 white farmers owning 4,000 farms  half of the countrys best farmland.\n\nThe seizures became Africas biggest modern-day land revolution, and was meant to redress colonial-era land grabs, when black people were forced to leave their land. But it set the country on a collision path with Western nations  economic sanctions followed, companies exited and the economy collapsed.\n\nThis compensation deal has been pushed by Mugabes successor President Emmerson Mnangagwa, who is keen to mend fences. The money being given to the farmers, as stipulated by the constitution, is for infrastructure and improvements to the land  like buildings and dams, not the value of the land itself, which Zimbabwes government insists rightfully belongs to the countrys original inhabitants.\n\nOverall this is estimated to total $3.5bn (2.6bn). However, the recent cash pay-out totalled just $3.1m for 378 farms.\n\nMr Baisley said it was not the best deal but was reasonably fair  and his decision to accept it has come with the realisation that the takeovers cannot be undone.\n\nIt was difficult for my family in the beginning but life goes on, you have to move on, he said, adding that he would start selling some of the bonds immediately to offset medical bills and to care for his sickly parents.\n\nIt is a significant shift, a softening of hard lines previously drawn by both sides.\n\nAFP/Getty Images In 2000 it suited President Robert Mugabe to push land reform to shore up his support in the face of growing opposition\n\nMugabe used to pound the lectern at party rallies saying the white farmers should go to the UK, the former colonial power, for their compensation  although quietly he was paying out select farmers.\n\nThe white farmers meanwhile had insisted on a $10bn full cash settlement. Both sides have settled on the $3.5bn figure.\n\nHowever, unlike Mr Baisley, the majority of white farmers are holding out for a deal which would see all the cash paid upfront.\n\nDeon Theron, who in 2008 was forced off the farm he had bought after independence, leads more than 1,000 farmers who have rejected the offer.\n\nBoxes of his possessions, hastily packed during his departure, still fill the veranda of his Harare home where he told me the deal was not fair as there was no guarantee that the bonds would be honoured in 10 years time.\n\nDeon Therons faction of farmers wants to be paid in cash and feel the UK government should help with negotiations\n\nThe 71-year-old said it was clear that the government did not have the money  and he wanted to see the international community, including the UK, help with negotiations as the government was refusing to budge, or even meet the dissenting group.\n\nThe British cant go and sit in the pavilion and watch whats happening because they are part of it. They are linked with our history. They cant walk away from it, he told the BBC.\n\nIn an agreement brokered in the run-up to independence, the UK was to support land reform financially  but it floundered towards the end of the 1990s when the Labour government came to power and relations soured.\n\nThe need to re-engage Britain on the compensation was the battle cry of many of the war veterans who led the farm invasions. They had fought in the 1970s war against white-minority rule  and felt let down by the slow pace of land reform following independence.\n\nBut like the white farmers, the war veterans are also split over the governments handling of the compensation.\n\nGodfrey Gurira is part of a group of war veterans suing the government  saying the compensation agreed for white farmers is too much at a time of economic hardship\n\nOne faction is suing the government for clandestinely agreeing to pay $3.5bn in compensation, saying the offer should have been agreed in parliament.\n\nOne of its leaders, Godfrey Gurira, said that given the myriad economic challenges cash-strapped Zimbabwe faced, it should not have prioritised white farmers.\n\nIts such a colossal amount for a nation of our size. People are suffering they can hardly make ends meet, the hospitals have nothing, then we have the luxury to pay $3.5bn. In our opinion its an unnecessary act of appeasement, he told the BBC.\n\nA second lawsuit challenges an aspect of a new land policy that demands that new farmers pay for the land in order to obtain title deeds to own the land outright.\n\nIn the wake of the redistribution, the 250,000 people who replaced the 2,500 white farmers were only entitled to 99-year leases. However this meant it was near-impossible for them to get bank loans as their security of tenure was not guaranteed.\n\nLast year, the government said farmers could apply to own their land outright  with title deeds  but they needed to pay between $100 and $500 per hectare (2.47 acres).\n\nThat money will go towards the compensation deal to white farmers, according to the government.\n\nThose challenging this say forcing black farmers to effectively buy back the land contradicts the law.\n\nAnd the black farmers themselves are divided over the issue.\n\nThe land reform programme has had mixed results. Many new farmers did not have the skills, the finances and labour to farm successfully. But the countrys agricultural sector is now rebounding with pockets of successful farmers.\n\nIn 2002, Solomon Ganye arrived on a bicycle to receive a 20-hectare bare piece of land in Harare South.\n\nIt was part of the sprawling 2,700-hectare farm that had been divided among 77 people.\n\nHe found the initial years a struggle  suffering from a lack of finances and climate shocks. But slowly through Chinese money ploughed into the tobacco sector, and after handing the business over to his sons  both agriculture graduates in their 20s  things have improved.\n\nThey have built an enviable enterprise with 200 permanent workers, and have expanded into dairy and livestock farming. They are applying for the title deeds of their land and have even acquired more in recent years from the government.\n\nAaron Ganye, his oldest son, told the BBC that without the land reform programme, his family would probably not have been able to buy a farm because in the past the structure of ownership saw vast tracts of land being held by a single family.\n\nIm very happy because to be honest weve taken farming to another level because now were living a good life through farming. Were doing more than what the white guys were doing in terms of quality of tobacco and the leaf is good, the 25-year-old said proudly.\n\nWeve invested in technology. Its not easy. Im now motivating more farmers to do good work here, he said.\n\nHe does believe that new farmers should contribute to compensation payments but based on the value of infrastructure they inherited.\n\nOn the political front, tensions are also easing  and the UK government no longer has any Zimbabwean on its sanction list having recently delisted four military and government officials it had accused of human rights abuses.\n\nThe UKs Foreign, Commonwealth and Development Office told the BBC this was because they were no longer in the positions they held at the time they were added to the list in 2021.\n\nNonetheless, it is a significant development, marking the end of more than 20 years of sanctions against Zimbabwe.\n\nThe country now hopes that the farmers compensation issue can be properly sorted out to get Western support for ongoing talks on restructuring its massive foreign debt.\n\nThere is no question that 25 years on, calm has returned to almost all farming fronts.\n\nAgriculture is rebounding, this year farmers have sold over 300,000 tonnes of tobacco at auction  the highest tobacco production ever.\n\nBut compromise is needed on all sides for the country to fully jump over the hurdle of land reform and its fallout.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/25111139/farm.webp",
            "description": "<p>BBC A quarter of a century after their land was seized during a chaotic land reform programme that made global headlines, a small group of white Zimbabwean farmers have accepted a controversial compensation deal from the government. Once the backbone of the country’s agricultural sector, many of them are now elderly, visibly frail, battling illness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/deal-or-no-deal-zimbabwe-still-divided-over-land-25-years-after-white-farmers-evicted/\">Deal or no deal? Zimbabwe still divided over land 25 years after white farmers evicted</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:11",
            "date": "26 Jun 2025"
        }
    ]
}