{
    "news": [
        {
            "title": "Why should we seek the word of the cross?",
            "url": "https://www.newzimbabwe.com/why-should-we-seek-the-word-of-the-cross/",
            "content": "THE SUNDAY MORNING TABLET\n\nTHE call to seek the word of the cross\n\nIn todays world, filled with challenges and uncertainties, the call to seek the face of Christ has never been more urgent.\n\nLife can feel overwhelming, and the influence of evil spirits and the devil seems to loom larger as we stray from our spiritual foundations.\n\nYet, in the midst of this turmoil, we are reminded of the powerful promise found in Jeremiah 29:13: You will seek me and find me when you seek me with all your heart.\n\nThis verse encapsulates the essence of pursuing a relationship with Jesus Christ, the ultimate source of hope and strength.\n\nThe story of Zacchaeus in Luke 19:1-10 serves as a poignant reminder of the importance of our efforts to seek Christ. Zacchaeus, a tax collector, was determined to see Jesus, even climbing a sycamore tree to catch a glimpse of Him.\n\nInterestingly, despite his efforts, it was not Zacchaeus who found Jesus first; rather, Jesus saw him. This teaches us that even our smallest attempts to seek Christ matter.\n\nWhen Jesus called out to Zacchaeus, saying, Hurry and come down! For I must stay at your house today, He demonstrated that He is always ready to respond to our desires for connection. Jesus sees us before we see Him, and He invites us into a relationship that transforms our lives.\n\nJesus invites us to try me and see if I dont find favour in you. This call to test His goodness is echoed in Malachi 3:10, where we are encouraged to bring our whole selves to Him. When we seek the face of Christ, we open ourselves to the possibility of His grace and favour, enabling us to confront our challenges with renewed strength.\n\nAs we invite Christ into our lives, He establishes a permanent relationship with us. This relationship empowers us to conquer our difficulties and stand firm against the adversities we face. When we put our minds and faith in Christ, we are reminded that we are not alone. He walks with us, guiding and supporting us through every trial.\n\nThe call to seek the word of the cross is a call to embrace a relationship with Jesus Christ. Like Zacchaeus, let us not be discouraged by our limitations but instead be encouraged by the knowledge that every effort we make to seek Him is met with His love and grace.\n\nAs we draw closer to Him, we prepare ourselves to be called children of God when He returns. Let us seek the face of Christ, for in doing so, we find our true strength and purpose.\n\nPRAYER\n\nHeavenly Father,\n\nWe come before You with humble hearts, seeking Your presence and the transformative power of the cross.\n\nThank You for the gift of Your Son, Jesus Christ, who invites us to draw near to Him. We acknowledge that in the midst of our challenges, it is easy to lose sight of You, but we desire to seek Your face with all our hearts.\n\nLord, just as Zacchaeus climbed the sycamore tree in his pursuit of You, grant us the courage to climb beyond our fears and doubts. Help us to reach for You, knowing that even our smallest efforts are seen by You. We trust that You are always looking out for us and that Your love is eager to embrace us.\n\nAs we navigate the trials of life, may we find strength in Your Word and comfort in Your promises. Teach us to rely on You, and let our faith be unwavering. Help us to recognize the influence of darkness around us and empower us to stand firm in Your light.\n\nLord, we ask that You come into our homes and hearts, establishing a deep and lasting relationship with us.\n\nMay our lives reflect Your love and grace, and may we be filled with the hope of being called Your children when You return. Remove all the tribulations and pains we find ourselves in today. Restore peace and make us rejoin all our families in love and harmony once again.\n\nIn Jesus name, we pray.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/13082437/IMG-20250713-WA0008.jpg",
            "description": "<p>THE SUNDAY MORNING TABLET THE call to seek the word of the cross In today’s world, filled with challenges and uncertainties, the call to seek the face of Christ has never been more urgent. Life can feel overwhelming, and the influence of evil spirits and the devil seems to loom larger as we stray from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-should-we-seek-the-word-of-the-cross/\">Why should we seek the word of the cross?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "14 Sep 2025"
        },
        {
            "title": "Police probe incident of Beitbridge couple found dead with gunshot wounds",
            "url": "https://www.newzimbabwe.com/police-probe-incident-of-beitbridge-couple-found-dead-with-gunshot-wounds/",
            "content": "By Staff Reporter\n\nMEMBERS of the border town of Beitbridge are in shock following the grisly discovery of a couple lying dead in their matrimonial home with gunshot wounds under yet unclear circumstances.\n\nOne of the victims, the now deceased Farai Prosper Longwe (34) was lying lifeless with a gun in hand suggesting he could have killed his wife before turning the firearm on himself.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP is investigating a murder case involving a couple, Nyasha Madenyika (32) and Farai Prosper Longwe (34), whose bodies were found lying in a room at their residence in Medium Density, Beitbridge, on September 11, 2025, said Nyathi.\n\nThe bodies had gunshot wounds, with Nyasha Madenyika shot on the cheek and Farai Prosper Longwe on the right side of the ear.\n\nThe police recovered a Smith and Wesson Revolver loaded with three live rounds, which was found in Longwes right hand, along with three spent cartridges and 36 live rounds.\n\nPolice sais more details will be revealed as investigations unfold.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/09162322/Gun-and-bullets.png",
            "description": "<p>By Staff Reporter  MEMBERS of the border town of Beitbridge are in shock following the grisly discovery of a couple lying dead in their matrimonial home with gunshot wounds under yet unclear circumstances. One of the victims, the now deceased Farai Prosper Longwe (34) was lying lifeless with a gun in hand suggesting he could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-probe-incident-of-beitbridge-couple-found-dead-with-gunshot-wounds/\">Police probe incident of Beitbridge couple found dead with gunshot wounds </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "14 Sep 2025"
        },
        {
            "title": "Seven perish, 15 injured after bus, Toyota Aqua collide head-on",
            "url": "https://www.newzimbabwe.com/seven-perish-15-injured-after-bus-toyota-aqua-involved-in-head-on-collision/",
            "content": "By James Muonwa\n\nA ROAD traffic accident involving a bus and two other vehicles claimed seven lives along the Masvingo-Beitbridge Road Friday morning.\n\nAs a result of the crash, 15 other people were injured.\n\nThe Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nThe ZRP confirms a fatal road traffic accident involving three vehicles, a Yutong bus, a Toyota Aqua and a Toyota Dyna truck, which occurred at the 175 km peg along Masvingo-Beitbridge Road on September 12, 2025 at 0245 hours.\n\nSeven people died and 15 others were injured after a motorist who was driving a Yutong bus with 48 passengers on board towards Beitbridge collided head-on with a Toyota Aqua, which had five passengers on board, travelling towards Masvingo and a Toyota Dyna with two occupants, also travelling towards Masvingo, said Nyathi.\n\nHe added that as a result of the crash, two passengers from the bus, three occupants from the Toyota Aqua, including the driver, and two occupants from the Toyota Dyna, also including the driver, died on the spot.\n\nThirteen passengers from the bus and two passengers from the Toyota Aqua were reportedly injured.\n\nPolice said further details regarding the horrific accident will be made available soon.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
            "description": "<p>By James Muonwa  A ROAD traffic accident involving a bus and two other vehicles claimed seven lives along the Masvingo-Beitbridge Road Friday morning. As a result of the crash, 15 other people were injured. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms a fatal road traffic accident</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/seven-perish-15-injured-after-bus-toyota-aqua-involved-in-head-on-collision/\">Seven perish, 15 injured after bus, Toyota Aqua collide head-on</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "14 Sep 2025"
        },
        {
            "title": "NewZimbabwe.com senior journalists elected to labour union’s national executive",
            "url": "https://www.newzimbabwe.com/newzimbabwe-com-senior-journalists-elected-to-labour-unions-national-executive/",
            "content": "By Staff Reporter\n\nNEWZIMBABWE.COMsenior journalists Mary Taruvinga and Leopold Munhende were on Friday elected to the industrys labour body, Zimbabwe Union of Journalists (ZUJ) national executive committee.\n\nTaruvinga, who was elected vice president of the union, becomes the first female deputy of the institution since its inception. She beat Bulawayo-based freelance journalist Bongi Mpofu to land the post.Munhende, the Young Journalists Association (YOJA) president, was elected a board member with 23 votes against a maximum of 19 from seven other candidates; Elias Maginya (9), Fungai Lupande (14), Miriam Mangwanya (19), Admore Mbonda (9), Flata Kavinga (10), Siphathisiwe Mpofu (19) and Valentine Mabhugu (7).Mpofu was eventually elected the second committee member after a run-off election between her and Mangwanya.I pledge to work tirelessly alongside our president and the entire leadership to promote the welfare and interests of journalists across our nation, said Taruvinga at the elective congress held in Harare.Perfect Hlongwane was given a once off 10-year mandate as General Secretary, as per the unions new constitution. He was elected unopposed.ZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.Zimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nTaruvinga, who was elected vice president of the union, becomes the first female deputy of the institution since its inception. She beat Bulawayo-based freelance journalist Bongi Mpofu to land the post.\n\nMunhende, the Young Journalists Association (YOJA) president, was elected a board member with 23 votes against a maximum of 19 from seven other candidates; Elias Maginya (9), Fungai Lupande (14), Miriam Mangwanya (19), Admore Mbonda (9), Flata Kavinga (10), Siphathisiwe Mpofu (19) and Valentine Mabhugu (7).Mpofu was eventually elected the second committee member after a run-off election between her and Mangwanya.I pledge to work tirelessly alongside our president and the entire leadership to promote the welfare and interests of journalists across our nation, said Taruvinga at the elective congress held in Harare.Perfect Hlongwane was given a once off 10-year mandate as General Secretary, as per the unions new constitution. He was elected unopposed.ZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.Zimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nMunhende, the Young Journalists Association (YOJA) president, was elected a board member with 23 votes against a maximum of 19 from seven other candidates; Elias Maginya (9), Fungai Lupande (14), Miriam Mangwanya (19), Admore Mbonda (9), Flata Kavinga (10), Siphathisiwe Mpofu (19) and Valentine Mabhugu (7).\n\nMpofu was eventually elected the second committee member after a run-off election between her and Mangwanya.I pledge to work tirelessly alongside our president and the entire leadership to promote the welfare and interests of journalists across our nation, said Taruvinga at the elective congress held in Harare.Perfect Hlongwane was given a once off 10-year mandate as General Secretary, as per the unions new constitution. He was elected unopposed.ZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.Zimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nMpofu was eventually elected the second committee member after a run-off election between her and Mangwanya.\n\nI pledge to work tirelessly alongside our president and the entire leadership to promote the welfare and interests of journalists across our nation, said Taruvinga at the elective congress held in Harare.Perfect Hlongwane was given a once off 10-year mandate as General Secretary, as per the unions new constitution. He was elected unopposed.ZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.Zimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nI pledge to work tirelessly alongside our president and the entire leadership to promote the welfare and interests of journalists across our nation, said Taruvinga at the elective congress held in Harare.\n\nPerfect Hlongwane was given a once off 10-year mandate as General Secretary, as per the unions new constitution. He was elected unopposed.ZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.Zimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nPerfect Hlongwane was given a once off 10-year mandate as General Secretary, as per the unions new constitution. He was elected unopposed.\n\nZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.Zimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nZUJ president George Maponga retained his post after a tightly contested race against Alpha Media Holdings (AMH) Jairos Saunyama.\n\nZimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\nZimpapers Emmanuel Kafe was elected ZUJ organising secretary after beating The NewsHawks Brenna Matendere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/13095309/IMG-20250913-WA0023.jpg",
            "description": "<p>By Staff Reporter NEWZIMBABWE.COM senior journalists Mary Taruvinga and Leopold Munhende were on Friday elected to the industry’s labour body, Zimbabwe Union of Journalists (ZUJ) national executive committee. Taruvinga, who was elected vice president of the union, becomes the first female deputy of the institution since its inception. She beat Bulawayo-based freelance journalist Bongi Mpofu</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/newzimbabwe-com-senior-journalists-elected-to-labour-unions-national-executive/\">NewZimbabwe.com senior journalists elected to labour union’s national executive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:38",
            "date": "14 Sep 2025"
        }
    ]
}