{
    "news": [
        {
            "title": "You can not aspire to wear second-hand clothes – Harare Mayor says following government ban on their import and sale",
            "url": "https://www.newzimbabwe.com/you-can-not-aspire-to-wear-second-hand-clothes-harare-mayor-says-following-government-ban-on-their-import-and-sale/",
            "content": "By Staff Reporter\n\nWHILE the government has faced backlash over the ban on the importation and sale of second-hand clothing in cities, Harare Mayor Jacob Mafume has backed the move, saying the capital cannot be turned into a city of bales.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, earlier this week reaffirmed a ban on second-hand clothes, known asbhero,alongside night vending.\n\nSpeaking during a full council session on Thursday, Mafume stated that Harare cannot be sustained by second-hand clothes.\n\nIt is a serious dichotomy. We can not have a society that aspires to wear second-hand clothes. It is a serious oxymoron; we have cotton we can not make new clothes. So we wait for the cotton to be exported and clothes to be manufactured, and they are worn before we wear them.\n\nOn the other hand, we have some in our midst wearing second-hand clothes. We must assist each other as a society. We need to deal with it in a sensitive manner, but at the same time, we can not sustain a city based on second-hand clothes.\n\nDespite their importation ban by the Zimbabwe Revenue Authority (ZIMRA), second-hand clothes have provided relief for cash-strapped individuals due to their affordability.\n\nThe ban on the importation of second-hand clothes was implemented by ZIMRA in 2015, but due to porous borders, they continue to flood the streets, being sold at cheaper prices.\n\nIn Harare, second-hand clothes are also sold at night, a practice the government is also banning.\n\nThe Combined Harare Residents Association (CHRA) has since condemned the move as autocratic, particularly in an economy reliant on the informal sector.\n\nThe Combined Harare Residents Association (CHRA) notes with deep concern the position taken by the Ministry of Local Government on banning the selling of second-hand clothing and street vending\n\nThis intervention by the Ministry of Local Government is a clear reflection of the failure of the implementation of devolution within the local authority, the decision was made from an autocratic position\n\nThe City of Harare has to run the operations within the City in accordance with Section 264 of the Constitution, the procedure should be done in accordance with the Constitution.\n\nThe informal sector has for years been complementing the formal sector as there has been an emergence of formal businesses operating 24/7 in the CBD over the years, reads the statement by CHRA.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19190808/Vendors-14-scaled.jpg",
            "description": "<p>By Staff Reporter WHILE the government has faced backlash over the ban on the importation and sale of second-hand clothing in cities, Harare Mayor Jacob Mafume has backed the move, saying the capital cannot be turned into a “city of bales”. The Minister of Local Government and Public Works, Daniel Garwe, earlier this week reaffirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-can-not-aspire-to-wear-second-hand-clothes-harare-mayor-says-following-government-ban-on-their-import-and-sale/\">You can not aspire to wear second-hand clothes – Harare Mayor says following government ban on their import and sale</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "Defending champions Dynamos prioritising relegation survival over Chibuku Super Cup win",
            "url": "https://www.newzimbabwe.com/defending-champions-dynamos-prioritising-relegation-survival-over-chibuku-super-cup-win/",
            "content": "By Sports Reporter\n\nDynamos FC is this season not prioritising winning the Chibuku Super Cup tournament despite being the defending champions.\n\nThe two-time winners revealed this on Wednesday after eliminating Yadah in the preliminary round of the tournament at Ngoni stadium via penalties 4-3 following a nil-all draw in regulation time.\n\nHaving won the Chibuku Super Cup back to back in 2023 and 2024, Dembare is not worried about chasing a new record of winning the prestigious knockout tournament three times in a row.\n\nOur main aim is to survive relegation, we are not worried much about winning the Chibuku Super Cup.\n\nSo we will push and take each game as it comes, but at the back of our mind, we know what we want, said Dynamos assistant coach Thomas Ruzive.\n\nDynamos is a relegation candidate this season. Currently, the team is sitting second from bottom (17) on the log with 19 points.\n\n2025 marks Dembares worst season run in history as they have only managed three wins in 24 games.\n\nHowever, the Glamour Boys seem to be enjoying life under former Highlanders coach Kelvin Kaindu, who was appointed last week.\n\nSince his arrival, Dembare has won two games, a 1-0 win over MWOS on Saturday and Wednesday, and 4-3 penalty shootout win against Yadah.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/18144839/200853473_277859160786955_7126518592801743654_n.jpg",
            "description": "<p>By Sports Reporter Dynamos FC is this season not prioritising winning the Chibuku Super Cup tournament despite being the defending champions. The two-time winners revealed this on Wednesday after eliminating Yadah in the preliminary round of the tournament at Ngoni stadium via penalties 4-3 following a nil-all draw in regulation time. Having won the Chibuku</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defending-champions-dynamos-prioritising-relegation-survival-over-chibuku-super-cup-win/\">Defending champions Dynamos prioritising relegation survival over Chibuku Super Cup win</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "US suspends routine visa services in Zimbabwe, cites national security, overstay concerns",
            "url": "https://www.newzimbabwe.com/us-suspends-routine-visa-services-in-zimbabwe-cites-national-security-overstay-concerns/",
            "content": "By Thandiwe Garusa\n\nThe United States Embassy in Harare has announced the suspension of all routine immigrant and nonimmigrant visa services, except for most diplomatic and official visas, citing national security and public safety concerns under the Trump administration.\n\nThe instruction came from Washington to pause consular operations at the embassy in Harare.\n\nThis means the embassy in Harare will not be conducting any visa appointments or interviews until further notice.\n\nIn a statement posted on its official website Thursday, the U.S Embassy said this was to prevent visa misuse and overstays.\n\nThe suspension does not apply to Zimbabweans who already hold valid U.S. visas.\n\nIt is alleged that 709 Zimbabweans, or about 10.57%, overstayed in the U.S. on their B1 and B2 visas (non-immigrant visas for temporary stays, either business or tourism).\n\nThere are also concerns over overstaying rates for those on student visas.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/06020401/US-Embassy-Harare.png",
            "description": "<p>By Thandiwe Garusa The United States Embassy in Harare has announced the suspension of all routine immigrant and nonimmigrant visa services, except for most diplomatic and official visas, citing national security and public safety concerns under the Trump administration. The instruction came from Washington to pause consular operations at the embassy in Harare. This means</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-suspends-routine-visa-services-in-zimbabwe-cites-national-security-overstay-concerns/\">US suspends routine visa services in Zimbabwe, cites national security, overstay concerns</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "Socialite Enchantress in court over witchcraft claims – blames ‘malicious fabrication’ on bitter former maid",
            "url": "https://www.newzimbabwe.com/socialite-enchantress-in-court-over-witchcraft-claims-blames-malicious-fabrication-on-bitter-former-maid/",
            "content": "By Mary Taruvinga\n\nSocial media personality Melody Natalie Mhandu, popularly known as Enchantress, was on Thursday hauled before a Mbare magistrate accused of casting a spell on her former friend Tatenda Butau.\n\nMhandu (34) was charged with engaging in practices commonly associated with witchcraftas defined in section 98 (i) of the Criminal Law Codification and Reform Act Chapter 9.23.\n\nShe was released unconditionally after briefly appearing in court.\n\nThe state alleged that on August 4 and at Churu Farm, Mhandu unlawfully committed the offence by writing Tatendas name and others on a red cloth which she wrapped around a knife and sprinkled snuff powder before burying it under amuhachatree in a bid to cast a spell on her.\n\nAccording to State papers, Mhandu did this with the help of a traditional healer, Christine Matashu, also known as Manjenjenje.\n\nHer former helper, Elizabeth Mharirire, wrote a statement telling the court that Mhandu asked her to accompany her to see Manjenjenje when the ritual was performed.\n\nMharirire said she later found snuff powder in her room and bathroom before confronting Mhandu about it.\n\nThe two had an altercation before she told Mhandu that she could no longer work for her, given the circumstances.\n\nThe maid later told Butau that her former employer had bewitched her.\n\nShe then accompanied her and her boyfriend to the spot where Mhandu allegedly performed the rituals.\n\nButau dug up the cloth and knife before she confronted Mhandu.\n\nThe matter was also reported to the police.\n\nMhandu denies the allegations.\n\nThrough her lawyer, Mhandu said she was never at Churu Farm on August 4 as alleged.\n\nShe will specifically deny putting Tatenda Butaus name or any other name for that purpose on a red cloth as alleged or at all.\n\nShe will deny having wrapped any red cloth with a dagger and snuff powder and burying it underground as alleged or at all.\n\nShe will deny having any intention to harm or realising the real risk or possibility of harming any person as alleged or at all.\n\nShe will tell the court that she does not know any ritualist by whatever name. She never visited any either alone or with any other person as alleged or at all.\n\nShe did not cast any spell on anyone as alleged or at all, read her defence outline.\n\nThe lawyer said his client will tell the court that the charges are a malicious fabrication of a vindictive former maid who is manipulating the current bad blood between the accused and the complainant.\n\nThe former maid had been relieved of her duties and is bitter about it.\n\nMhandu also said Butau filed the current report as a social media blitz against her and for the purpose of countering a report she made against her at Highlands Police Station on 4 August 2025 under RRB Number 6440490.\n\nShe will also state that the allegations against her do not amount to any practice associated with witchcraft.\n\nFurther, the allegations are vague and embarrassing. They are only meant as a public show for the purposes of causing embarrassment and humiliation of the accused, said the lawyer, praying that the court returns a verdict of not guilty and acquits her of any wrongdoing.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07153744/mhandu.png",
            "description": "<p>By Mary Taruvinga Social media personality Melody Natalie Mhandu, popularly known as Enchantress, was on Thursday hauled before a Mbare magistrate accused of casting a spell on her former friend Tatenda Butau. Mhandu (34) was charged with engaging in practices commonly associated with witchcraft as defined in section  98 (i) of the Criminal Law Codification and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/socialite-enchantress-in-court-over-witchcraft-claims-blames-malicious-fabrication-on-bitter-former-maid/\">Socialite Enchantress in court over witchcraft claims – blames ‘malicious fabrication’ on bitter former maid</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "“If we are not careful, Zimbabwe will become a mono state” – Mwonzora calls for opposition unity following defeat in Epworth by-election",
            "url": "https://www.newzimbabwe.com/if-we-are-not-careful-zimbabwe-will-become-a-mono-state-mwonzora-calls-for-opposition-unity-following-defeat-in-epworth-by-election/",
            "content": "By Thandiwe Garusa\n\nMovement for Democratic Change (MDC) leader Douglas Mwonzora has stressed the importance of unity among opposition parties in Zimbabwe, urging them to work together to reverse the trend of poor electoral performance.\n\nHis remarks follow the recently held Epworth ward 6by-election,where the ruling party Zanu PFs candidate Civilised Bushe secured 3,022 votes, beating MDC-Ts Alice Nyahunzvi, who managed just 120 votes. Independent candidate Peter Nyapetwa received only 23 votes. The main opposition party, Citizens Coalition for Change (CCC), did not participate in the by-election.\n\nMwonzora, who boycotted the 2023 presidential elections, surprisingly fielded a candidate in Epworth who performed poorly, triggering widespread criticism from opposition supporters.\n\nSpeaking in an X space on Wednesday, Mwonzora said the by-election was a test to assess whether the Zimbabwe Electoral Commission (ZEC) had implemented electoral reforms.\n\nZEC produced a document called a strategy towards free and fair elections, so we decided to test ZECs attempted electoral reforms empirically. ZEC failed dismally in the test.\n\nThere was rampant vote buying, as Epworth residents were being given food hampers on election day. We have video evidence of that. People were receiving EcoCash and being told to vote for Zanu PF.\n\nThey also received threats from Zanu PF and were told that if they voted for the MDC, the 16,000 houses in Epworth would be destroyed.\n\nWe, the MDC party, were given a soft copy of the voters roll, but it would not open. We made a formal complaint to ZEC, which did nothing about it, Mwonzora said.\n\nMwonzora urged other opposition parties to unite against Zanu PF instead of mocking him for losing the by-election.\n\nThe poor performance is not confined to the MDC; it is a trend, and as the opposition, we must work to change it.\n\nThere is a need to bury the hatchet. As we have seen, there is no winner in a losing team. We need to work together. If we are not careful, Zimbabwe will become a mono-state.\n\nYes, we may want to score political points by mocking the MDC, which lost only one by-election, yet other opposition parties lost 45, Mwonzora said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Thandiwe Garusa Movement for Democratic Change (MDC) leader Douglas Mwonzora has stressed the importance of unity among opposition parties in Zimbabwe, urging them to work together to reverse the trend of poor electoral performance. His remarks follow the recently held Epworth ward 6by-election, where the ruling party Zanu PF’s candidate Civilised Bushe secured 3,022 votes,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/if-we-are-not-careful-zimbabwe-will-become-a-mono-state-mwonzora-calls-for-opposition-unity-following-defeat-in-epworth-by-election/\">“If we are not careful, Zimbabwe will become a mono state” – Mwonzora calls for opposition unity following defeat in Epworth by-election</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "Eating chips regularly raises risk of type 2 diabetes by 20%, study finds",
            "url": "https://www.newzimbabwe.com/eating-chips-regularly-raises-risk-of-type-2-diabetes-by-20-study-finds/",
            "content": "The Guardian\n\nLove potatoes? Well, theres good news and theres bad news.\n\nEating chips has been found to raise the risk of developing type 2 diabetes, but baking, boiling or mashing potatoes was much healthier.\n\nConsuming french fries three times a week increases the chances of someone getting the disease by 20%  and doing so five times a week by 27%  according to a study published in the British Medical Journal.\n\nGlobally, potatoes are thethird most commonly consumed food crop, after rice and wheat.\n\nNine out of 10 of the estimated 5.8 million people in the UK with diabetes have the type 2 version of the disease, which is closely associated with lifestyle, especially diet.\n\nThe findings confirm potatoes do not of themselves pose a danger to health, but frying them to turn them into chips, and eating them regularly, does make a diagnosis of type 2 diabetes more likely.\n\nAn international team of researchers, led by Seyed Mohammad Mousavi, a public health expert at Harvard University, investigated the relationship between potato intake and the risk of developing type 2 diabetes. They based their findings on food questionnaires filled out by 205,000 health professionals in the US every four years between 1984 and 2021.\n\nSomeone who eats chips three times a week was found to raise their risk of diabetes by 20%, but those who ate potatoes with the same regularity after baking, boiling or mashing them did so by only 5%.\n\nThe high starch content of potatoes, leading to a high glycemic index and load, combined with possible loss of nutrients and possible health risks resulting from various cooking methods, could contribute to adverse health outcomes, the study explains.\n\nReplacing potatoes with whole grains lowers the risk of diabetes by 8%, and if grains are eaten instead of chips specifically, that cuts the risk by 19%.\n\nDr Kawther Hashem, a lecturer in public health nutrition at Queen Mary University of London, said: Potatoes can be part of a healthy diet, but its how we prepare them that makes the difference. Boiled, baked or mashed potatoes are naturally low in fat and a source of fibre, vitamin C and potassium.\n\nBut when we deep fry them into chips or french fries, especially in large portions and with added salt, they become less healthy with their high-fat, salt and calorie content thats much more likely to contribute to weight gain and increase the risk of type 2 diabetes.\n\nHowever, replacing any form of potatoes with white rice is a bad idea as it leads to an increased risk of type 2 diabetes, the paper found.\n\nDr Hashem added: This research reinforces the simple message, which is to enjoy potatoes  just dont rely on chips as your go-to option. And, where possible, try swapping them out for whole grains like brown rice, bulgur wheat, wholemeal pasta or even sweet potato with skin on, which are healthier and protective for long-term health.\n\nThe researchers stressed their findings were observational and did not prove a cause and effect relationship between eating chips and type 2 diabetes risk.\n\nThe Food Standards Agency and Department of Health and Social Care both declined to comment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07034125/chips.jpg",
            "description": "<p>The Guardian Love potatoes? Well, there’s good news and there’s bad news. Eating chips has been found to raise the risk of developing type 2 diabetes, but baking, boiling or mashing potatoes was much healthier. Consuming french fries three times a week increases the chances of someone getting the disease by 20% – and doing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eating-chips-regularly-raises-risk-of-type-2-diabetes-by-20-study-finds/\">Eating chips regularly raises risk of type 2 diabetes by 20%, study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "Two Ghanaian ministers die in helicopter crash, along with six others",
            "url": "https://www.newzimbabwe.com/two-ghanaian-ministers-die-in-helicopter-crash-along-with-six-others/",
            "content": "BBC\n\nGhanas ministers of defence and environment have died in a military helicopter crash in the central Ashanti region, along with six other people, a government spokesperson says.\n\nDefence Minister Edward Omane Boamah and Environment, Science and Technology Minister Ibrahim Murtala Muhammed,50, were killed in the crash, which Chief of Staff Julius Debrah described as a national tragedy.\n\nEarlier, the Ghana Armed Forces said the Z9 helicopter, which was carrying three crew and five passengers, had gone off the radar.\n\nIt had taken off from the capital, Accra, at 09:12 local time (and GMT) and was heading to the town of Obuasi for an event to tackle illegal mining.\n\nImages purportedly showing the charred remains of the helicopter are circulating on social media.\n\nThe authorities have not confirmed the cause of the crash.\n\nThe chief of staff has directed the countrys flags to fly at half-mast.\n\nHe extended condolences to the servicemen who died in service to the country, on behalf of President John Dramani Mahama and the government.\n\nGhanas Deputy National Security Coordinator and former Agriculture Minister Alhaji Muniru Mohammed was also among the dead, along with Samuel Sarpong, Vice-Chairman of the governing National Democratic Congress party.\n\nThe crew members were named as Squadron Leader Peter Bafemi Anala, Flying Officer Manin Twum-Ampadu, and Sergeant Ernest Addo Mensah.\n\nPresident Mahama was feeling down, down emotionally, Education Minister Haruna Iddrisu was cited as saying by news agency AFP.\n\nBoamah served under Mahamas previous government as communications minister and before that he was minister of environment. As defence minister he tackled jihadist activity that was brewing in the northern border in Burkina Faso.\n\nIn 2022, a France-based NGO, Promediation, said its research showed that jihadist groups had recruited between 200 and 300 young Ghanaians.\n\nViolence in the area has also been on the rise, with concerns that jihadists may be trying to exploit communal in-fighting between rival communities in northern Ghana.\n\nBoamahs book A Peaceful Man In An African Democracy, about former president John Atta Mills, was due to come out later in the year.\n\nMuhammed was at the forefront of the battle against illegal gold mining, which has wrecked the environment and contaminated rivers and lakes.\n\nProtests against the practice, known locally as Galamsey, peaked during Mahamas run for the presidency last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07033721/ghana-crash.webp",
            "description": "<p>BBC Ghana’s ministers of defence and environment have died in a military helicopter crash in the central Ashanti region, along with six other people, a government spokesperson says. Defence Minister Edward Omane Boamah and Environment, Science and Technology Minister Ibrahim Murtala Muhammed, 50, were killed in the crash, which Chief of Staff Julius Debrah described as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-ghanaian-ministers-die-in-helicopter-crash-along-with-six-others/\">Two Ghanaian ministers die in helicopter crash, along with six others</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        },
        {
            "title": "WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says",
            "url": "https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/",
            "content": "AP\n\nWhatsApp has taken down 6.8 million accounts that were linked to criminal scam centers targeting people online around the world, its parent companyMetasaid this week.\n\nThe account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts tocrack down on scams. In a Tuesday announcement, Meta said it was also rolling new tools on WhatsApp to help people spot scams  including a new safety overview that the platform will show when someone who is not in a users contacts adds them to a group, as well as ongoing test alerts to pause before responding.\n\nScams arebecoming all too commonand increasingly sophisticated in todays digital world  withtoo-good-to-be-trueoffers and unsolicited messages attempting to steal consumers information or money filling our phones, social media and other corners of the internet each day. Meta noted that some of the most prolific sources of scams are criminal scam centers, which oftenspan from forced laboroperated by organized crime  and warned that such efforts often target people on many platforms at once, in attempts to evade detection.\n\nThat means that a scam campaign may start with messages over text or a dating app, for example, and then move to social media and payment platforms, the California-based company said.\n\npointed to recent scam efforts that it said attempted to use its own apps  as well as TikTok, Telegram and AI-generated messages made using ChatGPT  to offer payments for fake likes, enlist people into a pyramid scheme and/or lure others into cryptocurrency investments. Meta linked these scams to a criminal scam center in Cambodia  and said it disrupted the campaign in partnership with ChatGPT makerOpenAI.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/07033548/Whatsapp-1.webp",
            "description": "<p>AP WhatsApp has taken down 6.8 million accounts that were “linked to criminal scam centers” targeting people online around the world, its parent company Meta said this week. The account deletions, which Meta said took place over the first six months of the year, arrive as part of wider company efforts to crack down on scams. In</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/whatsapp-takes-down-6-8-million-accounts-linked-to-criminal-scam-centers-meta-says/\">WhatsApp takes down 6.8 million accounts linked to criminal scam centers, Meta says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:56",
            "date": "08 Aug 2025"
        }
    ]
}