{
    "news": [
        {
            "title": "In Pictures: City of Harare’s blitz leaves small business owners stranded",
            "url": "https://www.newzimbabwe.com/in-pictures-city-of-harares-blitz-leaves-small-business-owners-stranded/",
            "content": "Scores of small business owners in Harare were left stranded after the City Council shut down shops and trading spaces in a blitz enforcing municipal bylaws. Authorities say the operation is aimed at restoring order in the capital.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02162525/Tuckshops-3.png",
            "description": "<p>Scores of small business owners in Harare were left stranded after the City Council shut down shops and trading spaces in a blitz enforcing municipal bylaws. Authorities say the operation is aimed at restoring order in the capital. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-city-of-harares-blitz-leaves-small-business-owners-stranded/\">In Pictures: City of Harare’s blitz leaves small business owners stranded</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "02 Oct 2025"
        },
        {
            "title": "In Pictures: Shoko Festival marks 15 Years with “The Legacy XV” edition",
            "url": "https://www.newzimbabwe.com/in-pictures-shoko-festival-marks-15-years-with-the-legacy-xv-edition/",
            "content": "Shoko Festival marked its 15th anniversary with a landmark edition themedThe Legacy XV, bringing together international collaborations and local talent. The three-day urban culture celebration ran from September 25 to 27 in Harare and Chitungwiza.\n\nPictures by Shoko Festival\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02114014/IMG_0633.jpg",
            "description": "<p>Shoko Festival marked its 15th anniversary with a landmark edition themed “The Legacy XV”, bringing together international collaborations and local talent. The three-day urban culture celebration ran from September 25 to 27 in Harare and Chitungwiza. Pictures by Shoko Festival</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-shoko-festival-marks-15-years-with-the-legacy-xv-edition/\">In Pictures: Shoko Festival marks 15 Years with “The Legacy XV” edition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "02 Oct 2025"
        },
        {
            "title": "Nelson Mandela’s grandson Mandla ‘abducted’ by Israeli forces during intercept of humanitarian flotilla",
            "url": "https://www.newzimbabwe.com/nelson-mandelas-grandson-mandla-abducted-by-israeli-forces-during-intercept-of-humanitarian-flotilla/",
            "content": "IOL\n\nActivist and grandson of Nelson Mandela, Mandla Mandela, who was sailing to Gaza aboard a boat which is part of the Global Sumud Flotilla (GSF), has been kidnapped by Israeli forces who intercepted the flotilla in the early hours of Thursday.\n\nMandela prerecorded a message in case of interception by Israel.\n\nIm a citizen of the Republic of South Africa. If you are receiving this video, it means that we have been intercepted and have been abducted by the state of apartheid Israel, he said. I call you to request our government to exert pressure for my immediate release.\n\nThe South African group of the flotilla has condemned the interception of its vessels by Israeli occupation forces in international waters, describing the attack as a deliberate attempt to block humanitarian aid to Gaza.\n\nDelegates aboard the flotilla, which included South African civilians, were reportedly detained and faced drone and water cannon attacks.\n\nIn a statement, the Global Sumud Flotilla (GDF) confirmed that the Israeli occupation forces ambushed the Global Sumud Flotilla in international waters, detaining some of the delegates and attacking the vessels with drones and water cannons.\n\nThese actions represent yet another attempt to silence voices of solidarity and to prevent even the smallest lifeline of relief from reaching Gaza. This is illegal under international law, the GDF said in a statement.\n\nThe organisation emphasised that the flotillas mission was purely humanitarian and peaceful.\n\nThe GSF was carrying civilians committed to drawing attention to the devastating conditions faced by Palestinians. Their mission is peaceful. Their objective is humanitarian. Their interception exposes once more the reality that Gaza is held under siege not only by walls and checkpoints, but by warships, drones, and policies of isolation.\n\nThe GSF called on the South African government to act immediately to ensure the safe return of its citizens.\n\nThe Global Sumud Flotilla  RSA demands the immediate and unconditional release of all the delegates with full access to their lawyers, and for Israel to respect all international laws and measures governing the protection of civilians and humanitarian missions, the unhindered delivery of the humanitarian aid, and the lifting of the siege that continues to strangle Gaza, they said.\n\nOn Wednesday, Chrispin Phiri, spokesperson for the Department of International Relations and Cooperation (Dirco), emphasised South Africas call for restraint and adherence to international law.\n\nSouth Africa wishes to reiterate, in the strongest terms, its call for all actors to adhere strictly to international law, including the United Nations Convention on the Law of the Sea and relevant international humanitarian law principles, he said.\n\nPhiri stressed that the safety and security of the flotillas participants, includingSouth African citizens, are of paramount importance.\n\nThe safety, security, and physical integrity of all unarmed participants aboard the Flotilla, including South African citizens, are of paramount importance, he added.\n\nHe warned that any military engagement or forceful detention of the vessels in international waters would constitute a serious breach of international norms. Phirifurther highlighted the peaceful and humanitarian mission of theflotilla.\n\nIt must be underscored that the Flotilla is a civilian-led initiative, embarked upon a peaceful and humanitarian mission. Its participants aim to draw attention to the severe and urgent humanitarian needs of the Palestinian people in Gaza and to deliver vital aid to alleviate the widespread suffering, Phiri said.\n\nOther South Africans who are part of the mission include Fatima Hendricks, Zaheera Soomar, Zukisa Wanner, Reaaz Moola, Bashera Soomar and Carolyn Shelver.\n\nFormer Economic Freedom Fighters (EFF) MP Mbuyiseni Ndlozi shared his support of Mandela. \n\nMandla Mandela! Selfless brave soul. You make us eternally proud Madiba. Strength to the Sumud Flotilla, Free Palestine, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02093932/mandla-.png",
            "description": "<p>IOL Activist and grandson of Nelson Mandela, Mandla Mandela, who was sailing to Gaza aboard a boat which is part of the Global Sumud Flotilla (GSF), has been kidnapped by Israeli forces who intercepted the flotilla in the early hours of Thursday. Mandela prerecorded a message in case of interception by Israel. “I’m a citizen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nelson-mandelas-grandson-mandla-abducted-by-israeli-forces-during-intercept-of-humanitarian-flotilla/\">Nelson Mandela’s grandson Mandla ‘abducted’ by Israeli forces during intercept of humanitarian flotilla</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "02 Oct 2025"
        },
        {
            "title": "Mugabe’s son arrested over illegal drugs possession",
            "url": "https://www.newzimbabwe.com/mugabes-son-arrested-over-illegal-drugs-possession/",
            "content": "By Staff Reporter\n\nFormer President Robert Mugabes son, Robert Mugabe Jr. (33), is set to appear in court in Harare today.\n\nThis follows his arrest on Wednesday after he was allegedly found in possession of cannabis and cocaine.\n\nWATCH: Mugabe's son arrested over illegal drugs possession\n\nRead more:https://t.co/aBEsNpCHCdhttps://t.co/4kaaN5zVdmpic.twitter.com/WOiNPOC2IA\n\n NewZimbabwe.com (@NewZimbabweCom)October 2, 2025\n\nMore details to follow\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02082338/Robert-Mugabe-Jr-Regalia2.jpg",
            "description": "<p>By Staff Reporter Former President Robert Mugabe’s son, Robert Mugabe Jr. (33), is set to appear in court in Harare today. This follows his arrest on Wednesday after he was allegedly found in possession of cannabis and cocaine. WATCH: Mugabe's son arrested over illegal drugs possession Read more: https://t.co/aBEsNpCHCd https://t.co/4kaaN5zVdm pic.twitter.com/WOiNPOC2IA — NewZimbabwe.com (@NewZimbabweCom) October</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mugabes-son-arrested-over-illegal-drugs-possession/\">Mugabe’s son arrested over illegal drugs possession</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "02 Oct 2025"
        },
        {
            "title": "Cardi B claims Nicki Minaj is on drugs, bipolar, and her husband takes her credit card",
            "url": "https://www.newzimbabwe.com/cardi-b-claims-nicki-minaj-is-on-drugs-bipolar-and-her-husband-takes-her-credit-card/",
            "content": "Complex\n\nAs the fiery beef betweenNicki MinajandCardi Brages on, the two rappers continue to fire off inflammatory accusations against each other.\n\nIn the latest installment of the saga, Cardi accuses Minaj of being on drugs. Quiet as kept the truth is you BEEN diagnosed with schizophrenia and bipolar for almost 9 years and you also on heavy drugs COCAINE..PERCS.. AND XANAX!!! the Bodak Yellow rapper alleges. You dont listen to nobody around you.. the only person that have the power is Kenneth Petty but you know what happens wit that Amex when you sedated.\n\nCardi is referring to Minajs husband,Kenneth Petty,claiming he takes away her credit card.\n\nCardi B on X\n\nThe rapper also warned Minaj to keep her child out of the arguments, while doubling down on her claim that Minajs son, Papa Bear, is developmentally disabled. Im letting you know again.. stop playing with my kid btch.. you just mad cuz your son fav color is 5.. GET TF ON YOU CRACKHEAD, she wrote on X.\n\nCardi B on X\n\nMinaj fired back, writing, tucking a DL man raw & got pregnant wit another monkey. You said oh well, he all our baby daddies now, referring to Stefon Diggs allegedly fathering a child with another woman. Your husband said he NEVER LIKED YOU. Your pussy on YUCK. HUBBY told PEE YEARS ago how UGLY you look always swollen & botched in the face from surgery. So guess what? Zoo TAKE MY MONEY!!!!! YASSSSS ZADDY. OWWWWW. Its BOTH OUR MONEY NEOW ZADDY.\n\nNicki Minaj on X\n\nShe also brought up Quavo, the former Migos member alongside Cardis ex-husband, Offset. Quavo was it worth it dummy? No career, takeoff gone. Remember you told me u were the Beyonc of the group? I laughed so hard inside. Anyway. Pay offset his alimony Barney B.\n\nOn Monday (Sept. 29), their feud resurfaced following the release of Cardis latest album,Am I The Drama?Since then, the two have exchanged devastating blows, with the conflict escalating from petty remarks about album sales to accusations of drug use, assault, and more.\n\nMinaj took aim at Cardis youngest, tweeting, Kulture vulture you ugly too, and Cardi countered with, Your son nonverbal cuz you fucked him up wit them drugs.\n\nThe feud entered its third day with no end in sight, and Minajs 2026 album could add further fuel to the fire. Of course, we rounded up all the wild and viciousinsults on social media between the two here.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02061053/cardinicki_yaqumh.webp",
            "description": "<p>Complex As the fiery beef between Nicki Minaj and Cardi B rages on, the two rappers continue to fire off inflammatory accusations against each other. In the latest installment of the saga, Cardi accuses Minaj of being on drugs. “Quiet as kept the truth is you BEEN diagnosed with schizophrenia and bipolar for almost 9 years and you also</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cardi-b-claims-nicki-minaj-is-on-drugs-bipolar-and-her-husband-takes-her-credit-card/\">Cardi B claims Nicki Minaj is on drugs, bipolar, and her husband takes her credit card</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "02 Oct 2025"
        },
        {
            "title": "Farmers embrace indigenous seeds to strengthen food security in Zimbabwe",
            "url": "https://www.newzimbabwe.com/farmers-embrace-indigenous-seeds-to-strengthen-food-security-in-zimbabwe/",
            "content": "Xinhua\n\nLinda Hungwe, a 52-year-old farmer from Masvingo Province in southeastern Zimbabwe, believes that the key to maintaining food security is to adopt indigenous seed varieties that are well-adapted to the local environment.\n\nSeed symbolizes the beginning of life, and when I control the choice of the seed I grow, I take charge of my destiny, Hungwe told Xinhua during the National Good Seed and Food Festival recently held in Harare, the countrys capital, an annual event to promote indigenous seeds, traditional foods, and sustainable agricultural practices.\n\nDuring the festival, Hungwe and other farmers showcased various indigenous seeds, exchanged seeds, and shared knowledge on Zimbabwes culinary culture.\n\nThe farmer said she grows indigenous crops such as pearl millet, finger millet, round nuts, and cowpeas, which are more drought-tolerant, better adapted to local soil, and more resilient to pests.\n\nIn Zimbabwe, recurrent droughts have diminished crop yields for farmers dependent on rain-fed agriculture, prompting them to adopt drought-tolerant indigenous crops.\n\nFarmer-led seed systems are important because, as a farmer, I know the qualities of the seed, my soil, its shortcomings and needs, she said, adding that indigenous seeds can be grown organically, which reduces reliance on expensive external inputs such as fertilizers and pesticides.\n\nChristopher Chinyoka, another farmer from Masvingo Province, said seed exchange among farmers is a long-standing tradition that ensures food security by maintaining locally adapted crops.\n\nSeed exchanges have been carried on from our ancestors; its a culture that creates a bond between people. We had seeds that had gone extinct, but now they have been revived, thanks to seed exchanges. If my crop fails due to drought or other reasons, I can always get the seed from other farmers, he said.\n\nA farmer shows her agricultural products at a seed and food festival in Harare, Zimbabwe, Sept. 20, 2025.(Xinhua/Tafara Mugwara)\n\nChinyoka added that smallholder farmers should not be at the periphery of food production, but rather be at the forefront to effectively safeguard food security.\n\nArchbold Sasa, a lecturer in the Department of Crop Science at the Marondera University of Agricultural Sciences and Technology in Zimbabwe, said smallholder farmers are key to promoting food security and resilience.\n\nSmallholder farmers play a crucial role in storing some seed varieties because they keep producing them from time to time, so that we dont lose that genetic material as a country. Its sort of a seed bank, he said. Some crops are being neglected, and people are not producing them anymore, but we tend to find those seeds in smallholder farmers.\n\nIn addition to indigenous grains, farmers are encouraged to adopt indigenous vegetables, including blackjack, pigweed, okra, and pumpkin leaves, due to their high nutritional value and adaptation to local climates.\n\nWe are doing seed exchange from one district to another so that people will have a diversity of these indigenous vegetables to promote their nutrition, resulting in improved health, said Sasa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02060658/indigenous-seeds-.png",
            "description": "<p>Xinhua Linda Hungwe, a 52-year-old farmer from Masvingo Province in southeastern Zimbabwe, believes that the key to maintaining food security is to adopt indigenous seed varieties that are well-adapted to the local environment. “Seed symbolizes the beginning of life, and when I control the choice of the seed I grow, I take charge of my</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/farmers-embrace-indigenous-seeds-to-strengthen-food-security-in-zimbabwe/\">Farmers embrace indigenous seeds to strengthen food security in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "02 Oct 2025"
        }
    ]
}