{
    "news": [
        {
            "title": "King Labash ‘inexplicably’ axed from Summer Jam Festival",
            "url": "https://www.newzimbabwe.com/king-labash-inexplicably-axed-from-summer-jam-festival/",
            "content": "By Darlington Gatsi\n\nZIMBABWEAN dancehall musician, Lloyd Muponda, popularly known as King Labash, has suffered a major blow in his ambition to perform at one of the genres biggest stages after being inexplicably withdrawn from the SummerJam Festival running.\n\nKing Labash was one of a plethora of artists competing for a slot at the Summer Jam Festival, set to be held in Germany from July 4 to 6.\n\nThe organisers are running a social media competition for artists to win a performance slot in Cologne.\n\nThe winners will perform alongside icons such as Vybz Kartel, Beenie Man, and Shenseea, among others, at the three-day festival.\n\nHowever, in a move that smacks of sabotage, King Labash has been ejected from the running, with Summer Jam accusing him of faking the traffic in his votes.\n\nIn a statement, King Labash said he was disappointed by the unfair disqualification without being given an opportunity to defend himself.\n\nKing Labashs post has been removed from the Summer Jam Instagram page, and he has been unfairly disqualified without warning or a chance to respond.\n\nThis decision lacks transparency, and its concerning that out of the three contestants, only one seemingly favoured by the organisers remains.\n\nWe believe there was malicious intent from someone who added fake likes to Kings post, leading to his disqualification.\n\nThis was beyond our control, and instead of investigating as per normal procedure, the organisers chose to remove him, even though he had more likes than everyone contesting before the incident, said King Labash.\n\nThe Summer Jam Festival is one of the biggest festivals in the world and would have been a significant boost to Zimbabwean musicians career.\n\nBurna Boy, Tarrus Riley, Romain Virgo, and Busy Signal are some of the musical heavyweights to have featured at the fiesta.\n\nKing Labashs disqualification has attracted the ire of music enthusiasts, who are calling for the reinstatement of the dancehall artist.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/15024025/1739587016461.jpg",
            "description": "<p>By Darlington Gatsi ZIMBABWEAN dancehall musician, Lloyd Muponda, popularly known as King Labash, has suffered a major blow in his ambition to perform at one of the genre’s biggest stages after being inexplicably withdrawn from the SummerJam Festival running. King Labash was one of a plethora of artists competing for a slot at the Summer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-labash-inexplicably-axed-from-summer-jam-festival/\">King Labash ‘inexplicably’ axed from Summer Jam Festival </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Bulawayo council intensifies crackdown on dog owners",
            "url": "https://www.newzimbabwe.com/bulawayo-council-intensifies-crackdown-on-dog-owners/",
            "content": "By Staff Reporter\n\nTHE City of Bulawayo has intensified a strict enforcement of its dog control regulations following an alarming increase in the number of animals kept on private properties, which residents report as a growing nuisance.\n\nIn response to the issue, Bulawayo town clerk, Christopher Dube announced that it has imposed several measures to contain the problem.\n\nDog owners and the general public are hereby advised that, in terms of the Bulawayo (Dog Licensing and Control) By Laws, no person shall keep a dog aged 6 months or more in the council area unless he/she is the holder of a licence.\n\nNo person shall keep in the council area more than two dogs on any property measuring less than 2000 square meters, and not more than four dogs on any larger property.\n\nNo person shall allow his dog(s) to roam outside his premises without restraint, said Dube\n\nHe also added that, Dogs shall only be kept where the property is securely fenced/walled and gated. (A hedge is not permissible.)\n\nDogs within the council area shall be vaccinated against rabies. No person shall breed a dog or keep an unspayed bitch in the council area unless he/she is a licensed breeder.\n\nCouncil has also encouraged dog owners to get licences, which are valid for one year.\n\nA dog licence is valid from the (1st January 31st December) and can be obtained from any City of Bulawayo Revenue Office upon production of a valid vaccination certificate and payment of a fee of US$24 for a male dog and USD$27 for a female and an unspayed dog USD$27, said Dube\n\nOwners who can no longer keep their dogs are encouraged to call the Society for the Prevention of Cruelty to Animals (SPCA).\n\nDog owners who can no longer care for or need their dogs are advised to surrender them to the Society for the Prevention of Cruelty to Animals (SPCA).\n\nResidents and stakeholders are advised that the City of Bulawayo, Zimbabwe Republic Police, Department of Veterinary Field Services, and Society for the Prevention of Cruelty to Animals (SPCA) will respond to any complaints, said Dube.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/13163601/Dogs.jpg",
            "description": "<p>By Staff Reporter THE City of Bulawayo has intensified a strict enforcement of its dog control regulations following an alarming increase in the number of animals kept on private properties, which residents report as a growing nuisance. In response to the issue, Bulawayo town clerk, Christopher Dube announced that it has imposed several measures to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bulawayo-council-intensifies-crackdown-on-dog-owners/\">Bulawayo council intensifies crackdown on dog owners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Rapist stepfather sentenced to 20 years in jail",
            "url": "https://www.newzimbabwe.com/rapist-stepfather-sentenced-to-20-years-in-jail/",
            "content": "By Staff Reporter\n\nA SHAMVA man has been sentenced to 20 years imprisonment at the Bindura Magistrates Court for repeatedly raping his 13-year-old stepdaughter.\n\nThe offender (name withheld to protect victim), who is the victims stepfather, committed the heinous crimes between November 2, 2024, and January 14 this year at their home in Shamva.\n\nThe court heard that the accused person took advantage of his position and threatened victim inorder to silence her.\n\nThe abuse only came to light after a condom was discovered in the girls blankets, prompting an investigation by her mother.\n\nThe minor then narrated her ordeal at the hands of her stepdad.\n\nShe was referred to Shamva Hospital for medical examinations and evidence was presented in court, leading to the rapists conviction and subsequent sentencing to 20 years behind bars.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/08/27185530/Rape-e1598550954788.jpeg",
            "description": "<p>By Staff Reporter  A SHAMVA man has been sentenced to 20 years’ imprisonment at the Bindura Magistrates Court for repeatedly raping his 13-year-old stepdaughter. The offender (name withheld to protect victim), who is the victim’s stepfather, committed the heinous crimes between November 2, 2024, and January 14 this year at their home in Shamva. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rapist-stepfather-sentenced-to-20-years-in-jail/\">Rapist stepfather sentenced to 20 years in jail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "No child shall be barred from school for failing to pay school fees, not having a birth certificate — Government says",
            "url": "https://www.newzimbabwe.com/no-child-shall-be-barred-from-school-for-failing-to-pay-school-fees-not-having-a-birth-certificate-government-says/",
            "content": "By Thandiwe Garusa\n\nTHE government has gazetted a new Statutory Instrument (S.I.), which prohibits schools from barring children from attending classes due to non-payment of fees or the lack of a birth certificate.\n\nAccording to S.I.13 of 2025 no child shall be denied access to education for failing to pay school fees or for not possessing a birth certificate.\n\nBasic education is compulsory and, if the parents of the pupil cannot afford the tuition fees and levies at a government school, the State shall assist, within the limits of the resources available to it, in providing that education.\n\nNo pupil shall be excluded from school for non-payment of any form of school fees or levies, part of the S.I. reads.\n\nPresident Emmerson Mnangagwas government also said that no head of a public school shall refuse to enroll a school-aged child solely because the child does not possess a birth certificate.\n\nNo school head shall exclude a child of school-going age from enrolment at a government school solely on the ground that the child does not have a birth certificate, the S.I. added.\n\nMeanwhile, government also said in cases where a girl who is a pupil at a school becomes pregnant, the institutions head shall facilitate psycho-social supportive services to the girl and parent and the girl may stay in school as long as possible before giving birth and return after recovery if she and her parents choose to do so.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/13155141/school-teacher.jpg",
            "description": "<p>By Thandiwe Garusa THE government has gazetted a new Statutory Instrument (S.I.), which prohibits schools from barring children from attending classes due to non-payment of fees or the lack of a birth certificate. According to S.I.13 of 2025 no child shall be denied access to education for failing to pay school fees or for not</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-child-shall-be-barred-from-school-for-failing-to-pay-school-fees-not-having-a-birth-certificate-government-says/\">No child shall be barred from school for failing to pay school fees, not having a birth certificate — Government says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Rwandan-backed rebels take control of DRC airport as president seeks support abroad",
            "url": "https://www.newzimbabwe.com/rwandan-backed-rebels-take-control-of-drc-airport-as-president-seeks-support-abroad/",
            "content": "By News24\n\nRWANDAN-backed M23 rebels in eastern Democratic Republic of Congo have taken control of the strategic Kavumu airport that serves Bukavu, the regions second biggest city, the rebel alliance and a civil security source said on Friday.\n\nThe rebels have been trying to push south towards Bukavu since they seized Goma, the largest city in eastern Congo, at the end of last month.\n\nThe capture of Bukavu, the capital of South Kivu province, would represent an unprecedented expansion of territory under the M23s control and deal a further blow to Kinshasas authority in the east.\n\nThe city of Bukavu can no longer hold, a civil society source in Bukavu said.\n\nTwo people who work at the airport, mostly used for NGO and military flights, told Reuters earlier on Friday that it had been effectively closed.\n\nCongolese forces had already removed equipment including drones and military aircraft.\n\nA spokesperson for the rebel alliance that includes M23 said in a post on X that the rebels were in control of the airport, and surrounding areas.\n\nA member of the civil security service confirmed that to Reuters, while a UN source, a diplomatic source and an M23 source earlier said the rebels had reached the airport.\n\nCongolese President Felix Tshisekedi meanwhile was seeking international support to help end the crisis.\n\nHe flew to Germany to attend the Munich Security Conference, the presidency said in a statement on social media on Friday.\n\nA source at the presidency said he would head to Addis Ababa on Friday evening to attend the African Union summit on Saturday.\n\nThe conflict will be high on the agenda at the annual two-day meeting in the Ethiopian capital.\n\nThe UN refugee agency voiced concern on Friday at the rapidly deteriorating situation, saying the war had left around 350 000 displaced people with no roof over their heads.\n\nEarlier on Friday, rebels seized the town of Katana, 11km from Kavumu where the airport is located, three sources said.\n\nA video taken by a Katana resident also showed armed men also walking through that town.\n\nM23 soldiers are blocking the road and are heading towards Kavumu  they already have control of Katana, the resident said.\n\nThe town of Kabamba, north of Katana, was taken on Thursday, according to three people.\n\nAs the fighting rages in the east, a heavier military presence has also been visible throughout the countrys capital Kinshasa, some 1 600 km west of Goma, over the past week, a Reuters reporter said.\n\nAfter the fall of Goma, protesters in Kinshasa attacked a UN compound and embassies including those of Rwanda, France and the United States, expressing anger at what they said was foreign interference. Looters ransacked the embassy of Kenya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/15015316/a8ddd4b925054a299d71b8442707298a.jpg",
            "description": "<p>By News24 RWANDAN-backed M23 rebels in eastern Democratic Republic of Congo have taken control of the strategic Kavumu airport that serves Bukavu, the region’s second biggest city, the rebel alliance and a civil security source said on Friday. The rebels have been trying to push south towards Bukavu since they seized Goma, the largest city</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rwandan-backed-rebels-take-control-of-drc-airport-as-president-seeks-support-abroad/\">Rwandan-backed rebels take control of DRC airport as president seeks support abroad</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Changes at Steward Bank as Nyambirai makes a comeback",
            "url": "https://www.newzimbabwe.com/changes-at-steward-bank-as-nyambirai-makes-a-comeback/",
            "content": "By NewzWire\n\nECOCASH Holdings has announced changes to its board following businessman Tawanda Nyambirais recent acquisition of a controlling stake in the company.\n\nLast year, Econet Wireless took over EcoCashs mobile money business along with VAYA Technologies, Econet Insurance, Econet Life, MARS Zimbabwe, and Maisha Health.\n\nThe restructuring left Steward Bank as the only remaining subsidiary of EcoCash Holdings.\n\nI am happy that I have now bought Steward Bank back and look forward to continued support from everyone, Nyambirai recently posted on social media.\n\nNo details have been given yet on the transaction.\n\nNyambirai originally founded the bank in 2001 as TN Bank before selling it to Econet in 2013 as part of a bailout deal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/16060727/Steward-Bank.jpg",
            "description": "<p>By NewzWire ECOCASH Holdings has announced changes to its board following businessman Tawanda Nyambirai’s recent acquisition of a controlling stake in the company. Last year, Econet Wireless took over EcoCash’s mobile money business along with VAYA Technologies, Econet Insurance, Econet Life, MARS Zimbabwe, and Maisha Health. The restructuring left Steward Bank as the only remaining</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/changes-at-steward-bank-as-nyambirai-makes-a-comeback/\">Changes at Steward Bank as Nyambirai makes a comeback</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Migrant workers, including Zimbabweans, in UK to fill care roles ‘charged up to £20,000’ in illegal fees",
            "url": "https://www.newzimbabwe.com/migrant-workers-including-zimbabweans-in-uk-to-fill-care-roles-charged-up-to-20000-in-illegal-fees/",
            "content": "By The Guardian\n\nMIGRANT workers who come to the UK to bolster the countrys care system are having to share beds, sleep rough, and are in some cases being charged more than 20,000 in illegal fees, according to research.\n\nA survey of more than 3,000 people who have travelled to the UK on health and care worker visas found that just under a quarter had paid fees to their employer or an intermediary upfront before coming to the UK, in return for the promise of a job.\n\nMore than 100 respondents, many of whom came to the UK from Nigeria, Zimbabwe, Zambia and other parts of Africa, as well as India, Pakistan, the Philippines, Brazil and Indonesia, paid between 5,000 and 20,000 in fees, and 50 over 10,000. Five paid 20,000 or more.\n\nDespite handing over such large sums, migrant care workers are often housed in overcrowded, substandard accommodation and face appalling levels of racism, the research shows.\n\nNearly a quarter of those in living in accommodation provided by their employer said they were obliged to share a bedroom with other workers.\n\nOne said 15 people were staying in a one-bedroom flat, and another was among nine sharing a three-bedroom property. Many struggle to afford to pay their rent and bills and two care workers said they had to sleep rough at times.\n\nWorkers from overseas are seen as vital resource for plugging recruitment gaps in the UKs creaking care system.\n\nSkills for Care estimates an average of 8.3% of social care roles in England were vacant in 2023/24, equivalent to approximately 131,000 vacancies. It also calculates that about one-third of new starters in the 2023/24 financial year were recruited internationally.\n\nThe survey by the trade union Unison also found widespread racism in the workplace. More than 800 people said they had experienced racism at work, with 355 reporting racism by their colleagues and nearly 300 by their boss.\n\nFear of reprisals prevents many migrant care staff from speaking out, according to the poll. More than a third of respondents said they or a migrant worker colleague had been threatened with dismissal or redundancy for raising issues about their treatment at work.\n\nCare companies employing overseas staff must assign a sponsorship certificate to every migrant worker they employ, which is used to apply for a visa. According to latest government figures, there were 21,300 applications for health and care visas between April and December 2024.\n\nBut if a staff member decided to leave, or if their company goes bust, they can be at risk of being deported if they cannot get a new sponsor within 60 days.\n\nChristina McAnea, Unisons general secretary, said: Care staff who come here from overseas are shoring up a crumbling sector. These workers should be treated with respect, not taken advantage of and abused. No one deserves to be treated in this despicable way.\n\nThe government must overhaul the sponsorship system as a matter of urgency. This would help prevent exploitation and drive up standards across the care sector.\n\nResponding to the findings, Dr Shabna Begum, chief executive of the Runnymede Trust, said: The racist treatment of migrant care workers, who are disproportionately people of colour, is symptomatic of the dreadful state of our broken care system.\n\nChronic under-investment in the care sector has created a situation where the people who we rely on to care for our elderly and vulnerable are exploited and brutalised on Dickensian terms, by both the system of recruitment and then the conditions in which they are expected to work.\n\nJamila Duncan-Bosu, a solicitor at the Anti Trafficking and Labour Exploitation Unit, a charity providing specialist legal support to survivors of trafficking and slavery, said: Exploitation is baked into the systems which the UK uses to recruit migrant workers. Workers who are tied to an employer and reliant on them for their ongoing visa status are far less able to escape exploitation.\n\nThe current system is a gift to those who seek to exploit migrant workers, as they can be certain that there will be little oversight or scrutiny of their actions.\n\nA government spokesperson said: We are deeply concerned about findings from this report, and stand firm on our zero-tolerance approach to labour exploitation and abuse of our immigration system by unscrupulous employers.\n\nThats why we have already set out first steps to ban rogue employers from sponsoring overseas workers, and will deliver legislation for the Fair Work Agency to ensure strong and fair employment rights for all.\n\nBusinesses found guilty of breaching employment law will have their sponsorship licenses refused or revoked, and care workers affected by this will be supported to find alternative employment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/28072448/Nurse-UK.png",
            "description": "<p>By The Guardian  MIGRANT workers who come to the UK to bolster the country’s care system are having to share beds, sleep rough, and are in some cases being charged more than £20,000 in illegal fees, according to research. A survey of more than 3,000 people who have travelled to the UK on health and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/migrant-workers-including-zimbabweans-in-uk-to-fill-care-roles-charged-up-to-20000-in-illegal-fees/\">Migrant workers, including Zimbabweans, in UK to fill care roles ‘charged up to £20,000’ in illegal fees</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Raza, Ervine’s return boosts Chevrons ahead of ODI clash against Ireland",
            "url": "https://www.newzimbabwe.com/raza-ervines-return-boosts-chevrons-ahead-of-odi-clash-against-ireland/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens cricket team has received a huge boost ahead of their three-match One Day Internationals (ODI) clash against Ireland as team captain Craig Ervine and star player Sikandar Raza have marked their return.\n\nThe duo missed out on the teamss Test match against the same opponents which saw Zimbabwe being handed a 63-run defeat at Queens Sports Club in Bulawayo recently.\n\nHarare Sports will host all the three-match ODI series which kicks off Friday, followed by another one on Sunday before the last one scheduled for February 18.\n\nErvine missed out on the Test match after a last-minute withdrawal due to family issues while Raza was away in the United Arab Emirates playing franchise cricket.\n\nCommenting ahead of the clash the captain highlighted the return of several players likeWellingtonMasakadza,Raza and himselfas a huge boost.\n\nFortunately, Wellington Masakadza is in the squad, and he covers a few of those roles quite nicely.\n\nHe (Masakadza) is very versatile with the ball, and Raza returning and Tony Manyonga coming in does give a little more fire-power down the batting order, said Ervine.\n\nHe however said, Willo (Williams) is an integral part of the squad, and resting him for the series does leave us with a few gaps in our batting and bowling departments.\n\nZimbabwes ODI series will be followed up by a three-match T20 series at Harare Sports Club scheduled to run from the 22nd to the 25th of February.\n\nChevrons ODI Squad\n\nCraig Ervine (Captain), Brian Bennett, Johnathan Campbell, Ben Curran, Trevor Gwandu, Wessly Madhevere, Tinotenda Maposa, Tadiwanashe Marumani, Wellington Masakadza, Nyasha Mayavo, Blessing Muzarabani, Richard Ngarava, Newman Nyamhuri, Sikandar Raza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/03/22105926/craig-ervine.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s cricket team has received a huge boost ahead of their three-match One Day Internationals (ODI) clash against Ireland as team captain Craig Ervine and star player Sikandar Raza have marked their return. The duo missed out on the teams’s Test match against the same opponents which saw Zimbabwe being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/raza-ervines-return-boosts-chevrons-ahead-of-odi-clash-against-ireland/\">Raza, Ervine’s return boosts Chevrons ahead of ODI clash against Ireland</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Tennis president confident of revival after Morroco whitewash",
            "url": "https://www.newzimbabwe.com/tennis-president-confident-of-revival-after-morroco-whitewash/",
            "content": "By Sport Reporter\n\nAfter a recent humiliating whitewash against Morroco on home soil, Zimbabwe Tennis Federation president Walter Jera says the team can revive itself and improve.\n\nThis follows Zimbabwes 4-0 defeat in a Group 11 play-off encounter which saw them being relegated to Davis Cup Group 111.\n\nWe have no doubt a good chance of claiming back our spot to Group 11 when we play the round Robin group 3 in June this year.\n\nPlayers in US colleges will be on holiday and able to join the squad.\n\nWe need to mobilize to host the tie, and also to prepare the squad as a team before the tie, ZTF president Walter Jera told New Zimbabwe.com.\n\nZimbabwes performance saw Courtney Lock one of the favourites losing 6-2; 6-4, while Ethan Sibanda lost 6-3; 6-2 in a singles match.\n\nThis was followed up by a 6-1; 6-1 defeat in the doubles where Zimbabwe was represented by Courtney and Mtisi, before the latter was handed another defeat for the visitors to complete a whitewash.\n\nZimbabwe suffered a huge setback ahead of the clash when star player Benjamin was ruled out due to an injury and Jera believes their reliance on one individual cost them.\n\nOur loss came from the withdrawal of our number 1 player Benjamin Lock, who could no longer play due to an elbow injury despite his preparation with the team.\n\nOur other college player Bennedict Badza and Tatenda Mutetwa could also not be released from their colleges having just opened and that limited our squad strength, Jera said.\n\nZimbabwe is now setting sight to a Group 11 playoffs tie coming later in June to revive themselves although they are yet to discover their opponents.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/06/06034938/tennis-racket.jpg",
            "description": "<p>By Sport Reporter After a recent humiliating whitewash against Morroco on home soil, Zimbabwe Tennis Federation president Walter Jera says the team can revive itself and improve. This follows Zimbabwe’s 4-0 defeat in a Group 11 play-off encounter which saw them being relegated to Davis Cup Group 111. “We have no doubt a good chance</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tennis-president-confident-of-revival-after-morroco-whitewash/\">Tennis president confident of revival after Morroco whitewash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        },
        {
            "title": "Mutsvangwa avoids tackling ZANU PF factionalism head-on, claims vocal Geza being “used”",
            "url": "https://www.newzimbabwe.com/mutsvangwa-avoids-tackling-zanu-pf-factionalism-head-on-claims-vocal-geza-being-used/",
            "content": "By Darlington Gatsi\n\nAS the Zanu PF internal fissures worsen, party spokesperson, Christopher Mutsvangwa, on Thursday sidestepped the elephant in the roomfactionalism.\n\nZANU PF is currently divided, with one faction pushing for the suspension of the 2028 elections to enable President Emmerson Mnangagwa to remain in power until 2030, while another believed to be backing Vice President Constantino Chiwenga insists on maintaining the constitutionally stipulated two-term limit.\n\nNeither Mnangagwa nor Chiwenga has publicly acknowledged the emerging factions.\n\nAddressing the media at the ZANU PF headquarters on Thursday, Mutsvangwa professed ignorance of the simmering tensions within the party.\n\nThat question is new to me. I am trying to focus on things which have consequences, said Mutsvangwa when questioned by the media.\n\nNational events have laid bare the fractures within the ruling party, with supporters displaying clear internal divisions. Recently two factions of ZANU PF supporters were heard chanting pro-Mnangagwa and another, pro-Chiwenga songs at Heroes Acre.\n\nAnother faction of war veterans, led by the outspoken Blessed Geza, has been calling for Mnangagwa to step aside, accusing him of overseeing a corrupt government.\n\nMnangagwas term ends in 2028, and he has stated that he will not run for another term, contrary to the sentiments of some of his supporters within ZANU PF.\n\nWithout mentioning names, Mutsvangwa suggested that Geza was being used to further a certain agenda within the party to unseat Mnangagwa.\n\nI have a lot of angst about the way he is being used by people who have a certain agenda. Comrade Geza, I do not know what other issues might be bothering you, but we, the war veterans, always remember I wish he would not follow fools who are misleading him. I am deeply concerned about what is happening with him, said Mutsvangwa.\n\nThe factional battles within ZANU PF are reminiscent of the internal politics that rocked the revolutionary party, resulting in the ousting of long-time ruler Robert Mugabe, who was replaced by Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Darlington Gatsi AS the Zanu PF internal fissures worsen, party spokesperson, Christopher Mutsvangwa, on Thursday sidestepped the elephant in the room—factionalism. ZANU PF is currently divided, with one faction pushing for the suspension of the 2028 elections to enable President Emmerson Mnangagwa to remain in power until 2030, while another believed to be backing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mutsvangwa-avoids-tackling-zanu-pf-factionalism-head-on-claims-vocal-geza-being-used/\">Mutsvangwa avoids tackling ZANU PF factionalism head-on, claims vocal Geza being “used”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:25",
            "date": "15 Feb 2025"
        }
    ]
}