{
    "news": [
        {
            "title": "Zimbabweans to face increased load shedding as Hwange Unit 3 shuts down for 44 days",
            "url": "https://www.newzimbabwe.com/zimbabweans-to-face-increased-load-shedding-as-hwange-unit-3-shuts-down-for-44-days/",
            "content": "By Thandiwe Garusa\n\nZIMBABWEANS will have to brace for longer power outages after ZESA Holdings announced that Hwange Power Stations Unit 3 will be offline for statutory maintenance for at least one and a half months.\n\nThis comes at a time when most areas in the country are already experiencing up to 20 hours of power cuts daily.\n\nThe Zimbabwe Power Company is currently generating 1,427MW, which falls short of the approximately 2,000MW the country requires at peak demand.\n\nIn a statement, ZESA Holdings said the maintenance, which began Wednesday will end on October 24 leaving only four units in operation and further straining the countrys already struggling electricity supply.\n\nZESA Holdings wishes to inform its valued stakeholders that Hwange Unit 3 will undergo statutory maintenance from 10 September to 24 October 2025, a planned outage of 44 days.\n\nThis exercise is essential to enhance the units availability and reliability.\n\nDuring this period, Hwange Power Station will maintain four units in operation to support generation.\n\nThe power utility emphasised its commitment to delivering a reliable and efficient power supply, underscoring the importance of these maintenance activities in safeguarding the nations energy infrastructure.\n\nZimbabwe has been facing electricity generation challenges for decades owing to obsoleteinfrastructure at its hydroelectricity and thermal power plants.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/21021127/Power-Cuts-1.png",
            "description": "<p>By Thandiwe Garusa ZIMBABWEANS will have to brace for longer power outages after ZESA Holdings announced that Hwange Power Station’s Unit 3 will be offline for statutory maintenance for at least one and a half months. This comes at a time when most areas in the country are already experiencing up to 20 hours of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabweans-to-face-increased-load-shedding-as-hwange-unit-3-shuts-down-for-44-days/\">Zimbabweans to face increased load shedding as Hwange Unit 3 shuts down for 44 days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        },
        {
            "title": "Another ‘first AI factory in Africa’? Uganda is said to have made its entry into the AI race",
            "url": "https://www.newzimbabwe.com/another-first-ai-factory-in-africa-uganda-is-said-to-have-made-its-entry-into-the-ai-race/",
            "content": "Business Insider Africa\n\nThe Aeonian Project, which is being touted as potentially being Africas AI factory, is now set for a swift rollout, with the first phase of the deployment scheduled for the second half of next year.\n\nAt the core of the initiative, the Aeonian Project says that intends to retain critical computing power within the continent, reducing Africas dependence on foreign entities storing its data.\n\nWith its focus on AI, the project would also ensure that homegrown researchers and developers would build AI models in local languages, which would be rooted in African data, an objective that sounds all too familiar.\n\nAs seen on theKenyanWallStreet, the projects central component, the USIO, a 10MW sovereign supercomputer, was built in partnership with NVIDIA, AI infrastructure company MDCS.AI, and Automation NV of Belgium.\n\nIt will use 100MW of surplus pre-transmission electricity from the Karuma power plant in the East African country.\n\nIn the same way gold and oil once shaped economies, digital tokens will shape the next era of innovation. Africa must not just mine data, but also mint intelligence, the machine targets to support applications in healthcare, life sciences, higher education, and research, said Niels Van Rees, Co-Founder of MDCS.AI.\n\nIn addition to using modular technologies to recycle heat and relying on natural river water for cooling, the plant will be connected to a new 2,500km fiber optic backbone that connects Uganda to international cables via Kenya and Tanzania.\n\nIn July, it was reported that much like the Aeonian Project, Project Mufungi via Cassava Technologies, owned by Strive Masiyiwa, Zimbabwes richest man, would be partnering with Nvidia to build the firstArtificial Intelligence (AI) factory in Africa.\n\nThis initiative encompasses setting up Nvidias high-performance AI processing infrastructure in Cassavas data centers across Africa.\n\nEgypts Kenya, Morocco, and Nigeria will be added after South Africa in June 2025.\n\nCollaborating with Nvidia gives us the advanced computing capabilities needed to drive Africas AI innovation while strengthening the continents digital independence, Masiyiwa said in a press release.\n\nCassava Technologies said back in April that it had intentions ofinvesting up to $720 millionin the AI plant.\n\nThe objective of the project is to provide African companies, researchers, and startups with local access to cutting-edge AI power so they may create their own AI models and solutions.\n\nAs per its official website, Synectics Technologies is developing The Aeonian Project, which is a hybrid Tier-4 Plus (4+) off-grid green energy regional Hyperscale Data & High-Performance Computing Centre (DHPC) powered by 100MW of excess pre-transmission electricity from the government-owned 600MW Karuma Hydro Power Plant (K-HPP) in Uganda.\n\nTo connect the facility to the companys headquarters in Kampala, for remote surveillance, and to the submarine cable in Kenya for global connection, data is sent via two (2) core dark fiber optic cables that are leased.\n\nData transfer between the two neighboring landlocked nations will be facilitated by the cables alternate arm.\n\nColocation, blockchain, data storage, artificial intelligence, and on-demand cloud services are the areas in which the suggested service provider falls.\n\nAdditionally, existing data centers in the area will get Disaster Recovery Services (DRaaS) from the Center.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/12054142/ai-factory.png",
            "description": "<p>Business Insider Africa The Aeonian Project aims to establish an AI factory in Africa, leveraging advanced computing infrastructures to retain data processing locally. The project will use surplus electricity from Uganda’s Karuma power plant to power a 10MW sovereign AI supercomputer built in collaboration with NVIDIA. This initiative intends to support diverse fields such as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-first-ai-factory-in-africa-uganda-is-said-to-have-made-its-entry-into-the-ai-race/\">Another ‘first AI factory in Africa’? Uganda is said to have made its entry into the AI race</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        },
        {
            "title": "You are responsible for sanctions – Mudenda bluntly tells opposition MPs",
            "url": "https://www.newzimbabwe.com/you-are-responsible-for-sanctions-mudenda-bluntly-tells-opposition-mps/",
            "content": "By Staff Reporter\n\nIn a potential sign of overstepping, the Speaker of the National Assembly, Jacob Mudenda, bluntly told the opposition legislators that they are responsible for the economic sanctions on Zimbabwe.\n\nMudenda said this recently in the National Assembly during a Question and Answer session when Citizens Coalition for Change (CCC) legislator, Shakespeare Hamauswa, sought his protection after Minister of Justice, Legal and Parliamentary Affairs Ziyambi Ziyambi insinuated that the opposition was responsible for the sanctions-induced downfall of the economy.\n\nWe are now developing a serious problem in this House. Whenever we passionately ask questions which are aimed at advancing the lives of Zimbabweans, we are met with insinuations that you are the owners of sanctions, you are the people who brought sanctions, which is not really fair, said Hamauswa.\n\nIn response, Mudenda bluntly told the National Assembly that the leaders of the opposition had invited economic sanctions on the country.\n\nThe element of sanctions is very genuine. If you recall the earlier leaders of the opposition, then MDC, they actually went to America to ask for those sanctions. Please recall. If you do not know your history, can you research on it? said Mudenda.\n\nSanctions have been a point of contention in Zimbabwean politics, with the ruling party ZANU PF using them as an excuse for the decay of the economy.\n\nThe economic ruin is marked by the comatose industry.\n\nThe government predicted to have lost millions in funding as a result of sanctions that were imposed by the United States of America and Britain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/13200646/Jacob-Mudenda-.jpg",
            "description": "<p>By Staff Reporter In a potential sign of overstepping, the Speaker of the National Assembly, Jacob Mudenda, bluntly told the opposition legislators that they are responsible for the economic sanctions on Zimbabwe. Mudenda said this recently in the National Assembly during a Question and Answer session when Citizens Coalition for Change (CCC) legislator, Shakespeare Hamauswa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/you-are-responsible-for-sanctions-mudenda-bluntly-tells-opposition-mps/\">You are responsible for sanctions – Mudenda bluntly tells opposition MPs </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        },
        {
            "title": "Hatters boss confirms Nakamba is an option for Luton after Zimbabwe outing",
            "url": "https://www.newzimbabwe.com/hatters-boss-confirms-nakamba-is-an-option-for-luton-after-zimbabwe-outing/",
            "content": "Midfielder hasnt featured for Luton this season\n\nLutonboss Matt Bloomfield has confirmed that midfielder Marvelous Nakamba will be back in contention for the Hatters following his first outing of the season forZimbabwelast week, although faces a real battle to regain a place in the side.\n\nThe 31-year-old won his 30th cap when playing 74 minutes for the Warriors as they as they lost 1-0 to Benin in their World Cup qualifier on Friday at the Stade de lAmiti, although didnt feature in their 1-0 home loss to Rwanda at the National Sports Stadium on Tuesday, a result which left Zimbabwe firmly rooted at the bottom of their group table.\n\nNakamba is yet to play for Luton this term, or be involved in any first team squads, as with rumours of a move away surrounding his pre-season at Kenilworth Road, he has been restricted to just one outing for the U21s. However, with thoughts of an exit ended following the closure of the transfer window last Monday evening, it means that the experienced player will now remain in Bedfordshire until January at least, with Bloomfield stating he will come into consideration for the Hatters League One fixtures.\n\nAsked just how close he is fitness-wise to being able to do so, the Town chief said: Hes managed to get himself through 90 minutes for Zimbabwe so hes a lot closer than what he was before which is great. He was really keen to go on international duty, weve had some good competition in that midfield area but a fit and ready Marvelous Nakamba is obviously a plus for us as well, so hell come back into the group.\n\nWell welcome him back and look forward to seeing him, although competition for places is fierce in the middle of the pitch. I think George (Saville) has done particularly well, Clicker (Jordan Clark) is evergreen, Zacks (Nelson) done great the last couple of games, weve got Lamine (Fanne) as well and Walshy (Liam Walsh), so competition is fierce but Marv comes back into the thinking.\n\nWith Nakamba expected back from his country later in the week, on how hungry he was to still be a part of the Hatters squad, as the former Club Brugge and Aston Villa player, who has made 57 appearances since joining the club in January 2023, last starting for Town in their 2-0 defeat to fierce rivals Watford in February, injury restricting him to just one other sub appearance at Derby County in the run-in after that, Bloomfield added: Marv has had some interest, as a number of our players have had.\n\nTheres so many different situations that weve spoken about a number of times, but hes still with us now, so hes our player and hell be ready to contribute. Hes got to get back safely from international duty and we welcome him back into training on Friday and hell be ready to compete. Hes had, weve spoken about before, a bit of a slow summer, working his way back and its great for us and for him that hes gone and played 90 minutes for Zimbabwe. He was obviously really keen to play for his country as he always is, so another proud moment for him and good for us to have him back to fitness.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/12195354/Marvey-Nakamba.png",
            "description": "<p>Luton Today Midfielder hasn’t featured for Luton this season Luton boss Matt Bloomfield has confirmed that midfielder Marvelous Nakamba will be back in contention for the Hatters following his first outing of the season for Zimbabwe last week, although faces a real battle to regain a place in the side. The 31-year-old won his 30th cap when playing</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/hatters-boss-confirms-nakamba-is-an-option-for-luton-after-zimbabwe-outing/\">Hatters boss confirms Nakamba is an option for Luton after Zimbabwe outing</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        },
        {
            "title": "‘He was really in love’: Family demands justice after Zimbabwean man murdered in Pretoria love triangle",
            "url": "https://www.newzimbabwe.com/he-was-really-in-love-family-demands-justice-after-zimbabwean-man-murdered-in-pretoria-love-triangle/",
            "content": "By Jonisayi Maromo, IOL\n\nA 21-year-old man was scheduled to appear before the Pretoria Magistrates Court on Thursday after allegedly stabbing to death 24-year-old Liberty Shawn Wazara during an altercation reportedly linked to a woman.\n\nGauteng provincial police spokesperson Lieutenant Colonel Mavela Masondo toldIOLthat the murder-accused 21-year-old man was arrested after handing himself over to police this week.\n\nThe 21-year-old suspect handed himself in at the police station. He was then charged with murder. He is expected to appear before the Pretoria Magistrates Court on Thursday, 11 September 2025, said Masondo.\n\nHe confirmed that the murder case was opened at Wonderboompoort police station in Pretoria, and the matter is under investigation.\n\nFamily members of the murdered victim described Shawn as a humble young man, who was deeply in love with the woman he met in Pretoria in December.\n\nI recall vividly that the love relationship between my cousin Shawn and her girlfriend (name withheld by IOL) started on a high. They seemed to be deeply in love with each other. I can tell you with certainty that Shawn really loved the woman and would do many things to show his love. The two quickly moved in together after they met in December, Shawns uncle, Everton Wazara, spoke to IOL.\n\nShawn Wazara during happier times with her girlfriend. Image: IOL\n\nThe two moved into an apartment in Mayville, in Pretoria. However, the woman maintained another romantic relationship with another man, who later showed up at the apartment on Saturday around midnight and (allegedly) brutally killed my cousin.\n\nRight now, Shawns mother is inconsolable since we broke the news to her. She has been crying nonstop. I do not know what I will say to my sister, he said.\n\nEverton said the relationship between Shawn and his girlfriend had started off promising, but cracks soon appeared.\n\nOn Saturday, I am told Shawn visited her girlfriends workplace, a popular pub in Pretoria. She works as a bartender. They later went to their home, but there was an argument between the couple, with Shawn asking her where her phone was. The context is that Shawn had somehow become informed about the other boyfriend. The lady insisted she had left her phone at work, Everton narrated.\n\nAs the fight escalated, the girlfriend contacted her other boyfriend, who then rushed to the scene. The man rocked up on a bike, just before midnight on Saturday, and the lady went out to talk to him. The man was insisting on taking the woman away. As someone who truly loved the woman, Shawn also went out in an effort to persuade the woman, but that was when he was repeatedly stabbed. He had several deep stab wounds.\n\nEverton described the murder scene as devastating.\n\nEven though I knew the girlfriend well and had maintained contact with her, from the early days of the relationship, I am still asking myself why she never contacted me, as a representative of the family, to alert us that Shawn had been brutally murdered. We only became aware of the death from a Facebook post made by (socialite and Gauteng-based lawyer) Moreboys Munetsi, who was looking for family members of a murdered man.\n\nRight now, we are appealing for justice for Shawn. He did not deserve to be killed like an animal. For what? Some witnesses saw everything taking place. We are grateful for the work done by the South African Police Service (SAPS) detective so far, who has also been supportive in our quest for answers. We will be in court today (Thursday) so that we can come face to face with the killer, he said.\n\nEmmanuel Mahamba was run over by a Ford Ranger, and killed in Rivonia, Sandton, earlier this year Image: Supplied\n\nIn April,IOL published another story of Emmanuel Mahamba, who was brutally murdered in a horrific incidentthat sent shockwaves in South Africa.\n\nIn the video, widely shared on social media, Mahamba is seen seated on the road while a Ford Ranger runs over him repeatedly. He died at the scene.\n\nIn a previous update, Gauteng police said they were still searching for the motorist implicated in the brutal death of a man following a heated dispute, linked to a love triangle.\n\nMahambas murder attracted international news headlines, with many social media users expressing shock over the gratuitous violence and murder.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/11173819/Liberty-Shawn-Wazara-with-girlfriend-his-uncle-Everton-Wazara-and-a-friend-in-Pretoria.png",
            "description": "<p>By Jonisayi Maromo, IOL A 21-year-old man was scheduled to appear before the Pretoria Magistrate’s Court on Thursday after allegedly stabbing to death 24-year-old Liberty Shawn Wazara during an altercation reportedly linked to a woman. Gauteng provincial police spokesperson Lieutenant Colonel Mavela Masondo told IOL that the murder-accused 21-year-old man was arrested after handing himself over to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/he-was-really-in-love-family-demands-justice-after-zimbabwean-man-murdered-in-pretoria-love-triangle/\">‘He was really in love’: Family demands justice after Zimbabwean man murdered in Pretoria love triangle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        },
        {
            "title": "Zimbabwe will freeze most state hiring in 2026 to curb wage bill",
            "url": "https://www.newzimbabwe.com/zimbabwe-will-freeze-most-state-hiring-in-2026-to-curb-wage-bill/",
            "content": "Bloomberg\n\nZimbabwes government will freeze recruitment in most of its departments next year to contain the state wage bill, the nations finance ministry said.\n\nThe halt to hiring will exclude only the health, security and education departments,George Guvamatanga, the secretary for finance and economic development, said in a circular seen by Bloomberg News and confirmed by the ministry. The Zimbabwean government has proposed a freeze on headcount before, including in last years budget, though the policy hasnt been implemented.\n\nTreasury has noted with concern the size of the civil service in non-critical sectors, despite the recruitment freeze policy stance, Guvamatanga said. For 2026, the recruitment freeze will apply to all sectors with the exception of health, education and the security sector to a limited extent.\n\nZimbabwes government employs 330,000 people, whose wages account for about56%of the southern African nations 276.4 billion ZiG ($10.4 billion) budget. The International Monetary Fund in June cited public-sector pay as one of the key fiscal pressures the country faces.\n\nThe finance ministry plans to start the consultation process for the 2026 budget later this month. Guidelines will be issued by Sept. 20 that will include spending ceilings for government ministries, departments and agencies, according to the circular.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>Bloomberg Zimbabwe’s government will freeze recruitment in most of its departments next year to contain the state wage bill, the nation’s finance ministry said. The halt to hiring will exclude only the health, security and education departments, George Guvamatanga, the secretary for finance and economic development, said in a circular seen by Bloomberg News and confirmed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-will-freeze-most-state-hiring-in-2026-to-curb-wage-bill/\">Zimbabwe will freeze most state hiring in 2026 to curb wage bill</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        },
        {
            "title": "Zim Under-17 falls to Mozambique in COSAFA Cup opener",
            "url": "https://www.newzimbabwe.com/zim-under-17-falls-to-mozambique-in-cosafa-cup-opener/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Under-17 team on Thursday kicked off their Africa Cup of Nations: COSAFA Qualifiers with a 1-0 defeat at the hands of Mozambique at Ngoni Stadium.\n\nThe Young Warriors conceded 8 minutes into the game and failed to get an equaliser despite good attempts in the second half.\n\nThursdays result left Zimbabwe in 3rd position in Group A with 0 points, while Comoros is sitting on top with 3 points, the same as Mozambique, who are in second place.\n\nSpeaking after the match, Zimbabwes coach Thulani Sibanda said, We obviously didnt start well, thats why we conceded that soft goal.\n\nBut I think we gradually came into the game, especially second half.\n\nWe did create quite a number of chances, which we could have parried; nevertheless, I think we did play very, very well, said Sibanda.\n\nThe former Bulawayo Chief coach, however, added that all hope is not yet lost.\n\nWe can do better in our next game, judging how we played there is room for improvement. Hopefully, we will do so in our next game, he added.\n\nZimbabwe will be back in action on Saturday when they face Eswatini at Ngoni Stadium, before completing their group fixtures against Comoros on Monday at the same venue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/12055110/U17-cosafa-.jpeg",
            "description": "<p>By Sports Reporter The Zimbabwe Under-17 team on Thursday kicked off their Africa Cup of Nations: COSAFA Qualifiers with a 1-0 defeat at the hands of Mozambique at Ngoni Stadium. The Young Warriors conceded 8 minutes into the game and failed to get an equaliser despite good attempts in the second half. Thursday’s result left</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-under-17-falls-to-mozambique-in-cosafa-cup-opener/\">Zim Under-17 falls to Mozambique in COSAFA Cup opener</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:30",
            "date": "12 Sep 2025"
        }
    ]
}