{
    "news": [
        {
            "title": "Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals",
            "url": "https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/",
            "content": "By Thandiwe Garusa\n\nA police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura.\n\nThe weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two counts of murder, attempted murder, and possession of an illegal firearm.\n\nNational police spokesperson Assistant Commissioner Paul Nyathi confirmed the findings, saying, The gun which killed the policeman is the same pistol which killed the businessman Mutangadura.\n\nMutangadura was murdered on the night of August 17, 2025, when seven armed robbers wearing balaclavas stormed his farmhouse. They attacked a security guard and the businessmans son before shooting him.\n\nSo far, police have arrested three suspects: Given Mandizadza (34), Phillip Mutasa (38), and Vengesai Jabulani Mutasa, while four other accomplices remain at large.\n\nVengesai Jabulani Mutasa\n\nVengesai initially shot Detective Constable Ngwenya of CID Homicide, who was part of a team trying to apprehend him for Mutangaduras murder, before fleeing arrest.\n\nHe later went to the police station on Sunday, where he found Constable Courage Muchechesi taking a statement from Abraham Mavayo, who was reporting an assault case.\n\nPolice said Vengesai confronted officers at the station, accusing homicide detectives of stealing US$1,000 from his home and demanding to see them.\n\nHe allegedly forced Constable Muchechesi and Mavayo to lie down while demanding money before shooting Muchechesi in the stomach.\n\nMuchechesi staggered out of the building, calling for help, and collapsed near the single quarters where he was later found dead by fellow officers.\n\nHe fled the station and was later arrested by residents from Sanyati, Kadoma, Chakari, and Patchway who had joined forces to track him down.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Thandiwe Garusa A police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura. The weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/\">Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "CZI says RBZ on track to meet 2025 inflation target",
            "url": "https://www.newzimbabwe.com/czi-says-rbz-on-track-to-meet-2025-inflation-target/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) says the annual inflation target set by the Reserve Bank of Zimbabwe (RBZ) remains within reach, citing consistency in the implementation of inflation containment measures.\n\nAccording to the Zimbabwe National Statistics Agency (Zimstat), the Zimbabwe Gold (ZWG) currency has maintained notable stability against the US dollar since September 2024, when it last experienced a major dip.\n\nZimstat data shows that month-on-month inflation stood at -0.2% in September 2025, down by 0.6 percentage points from 0.4% in August 2025.\n\nIn its latest inflation tracker, CZI expressed optimism that the RBZ will meet its 2025 inflation target by year-end.\n\nIf ZiG month-on-month inflation continues to grow by less than 1% in the next four months to December 2025, annual inflation is projected to be less than 20% in December 2025, CZI said.\n\nThis implies that the 2025 Midterm Monetary Policy Statement (MPS) targets, of keeping annual ZiG inflation below 30% and month-on-month inflation between 1% and 3%, are likely to be achieved.\n\nThe industry body noted that between July and late August 2025, the ZiG appreciated on both the official and parallel markets. Despite this, the parallel market premium remained relatively constant at around 27%, indicating some degree of exchange rate convergence.\n\nCZI added that the still-high annual inflation rate largely reflects the September 2024 devaluation of the ZiG, and that inflation pressures are expected to ease further in October 2025, provided no new shocks emerge.\n\nAfter rising in July 2025, month-on-month inflation eased to 0.4% in August 2025, a development CZI attributed to the effectiveness of the current tight monetary policy stance in stabilising prices, albeit under constrained liquidity conditions.\n\nIn the long term, monetary policy will need to gradually ease liquidity conditions as stability becomes more sustainable, CZI said.\n\nKeeping inflation below 1% enhances price stability and broadens the use of the ZiG beyond a transaction currency. Businesses that previously preferred USD-only transactions are now slowly encouraging ZiG payments to meet some of their monthly obligations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171617/rbz-.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) says the annual inflation target set by the Reserve Bank of Zimbabwe (RBZ) remains within reach, citing consistency in the implementation of inflation containment measures. According to the Zimbabwe National Statistics Agency (Zimstat), the Zimbabwe Gold (ZWG) currency has maintained notable stability against the US dollar</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-says-rbz-on-track-to-meet-2025-inflation-target/\">CZI says RBZ on track to meet 2025 inflation target</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "High Court boots out former Duly’s manager’s car claim — says Labour Court has exclusive jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-boots-out-former-dulys-managers-car-claim-says-labour-court-has-exclusive-jurisdiction/",
            "content": "By Mary Taruvinga\n\nThe High Court has struck off a claim by retired Duly Holdings Limited administrator, Theresa Ruredzo, who was demanding a Ford Everest vehicle as part of her terminal benefits, ruling that the matter belongs in the Labour Court, not the High Court.\n\nJustice Munangati-Manongwa upheld a special plea filed by the vehicle dealer, agreeing that Ruredzos case, though framed as a contractual dispute, was fundamentally rooted in her former employment and thus a labour matter.\n\nIt is evident that the plaintiffs claim, despite its contractual framing, fundamentally relates to the employment relationship and the associated terminal benefits, ruled the judge.\n\nHence, the Labour Court possesses exclusive jurisdiction to resolve such disputes.\n\nRuredzo, who worked for 31 years and two months at Duly Holdings, rising from clerk typist to national administration manager, retired in November 2017. She told the court that the company failed to pay her full terminal benefits and later agreed to compensate her with a Ford Everest to be delivered within five years  a promise she said was never fulfilled.\n\nHer lawyer argued that the case was purely contractual since the agreement to deliver the vehicle was made after her retirement, and therefore outside the Labour Courts reach. He cited previous judgments suggesting that post-employment contracts do not qualify as labour disputes.\n\nBut Duly Holdings countered that Ruredzos demand amounted to a claim for unpaid terminal benefits, squarely falling under labour law. The company argued that the 2013 Constitution and subsequent amendments to the Labour Act gave the Labour Court exclusive jurisdiction over such employment-related claims.\n\nThe plaintiff has brought her claim before the wrong court, the defence argued, relying on a string of Supreme Court decisions affirming that even cleverly framed contractual claims cannot escape the Labour Courts authority.\n\nJustice Priscilla Munangati-Manongwa agreed, noting that while Ruredzo tried to repackage her claim as a private contract, the car in question was undeniably part of her terminal benefits.\n\nThe agreement for the delivery of the Ford Everest motor vehicle is intrinsically linked to the employment relationship between the plaintiff and the defendant, the judge said. This brings the claim squarely within the jurisdiction of the Labour Court.\n\nThe court upheld Duly Holdings special plea and ordered Ruredzo to pay costs.\n\nRuredzos long-running fight for her promised Ford Everest is now likely to continue before the Labour Court, the only forum legally empowered to decide whether Duly Holdings must finally deliver the vehicle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3-e1760934227524.jpg",
            "description": "<p>By Mary Taruvinga The High Court has struck off a claim by retired Duly Holdings Limited administrator, Theresa Ruredzo, who was demanding a Ford Everest vehicle as part of her terminal benefits, ruling that the matter belongs in the Labour Court, not the High Court. Justice Munangati-Manongwa upheld a special plea filed by the vehicle</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-boots-out-former-dulys-managers-car-claim-says-labour-court-has-exclusive-jurisdiction/\">High Court boots out former Duly’s manager’s car claim — says Labour Court has exclusive jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "28 Oct 2025"
        },
        {
            "title": "Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’",
            "url": "https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/",
            "content": "By Mary Taruvinga\n\nComedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 for making the President laugh.\n\nThis comes a few daysafter President Emmerson Mnangagwa personally handed hima brand-new Ford Raptor.\n\nIn a lengthy social media post, Chivayo said the cash gift was a small token of appreciation for the comedians talent and humour.\n\nFor a young comedian to make the President of the Republic laugh is never a small achievement!His Excellencys words  Ndafara newe mfana  set you apart. Ukafadza President, neniwo unenge wandifadza and wafadza nyika yese!\n\nThe controversial tenderpreneur, known for showering public figures with luxury cars and cash gifts, told Comic Elder to collect US$150,000 from his lawyer Sikhumbuzo Mpofu andbuy a decent house.\n\nFor safety, the money can be transferred directly to your preferred bank account, Chivayo added. Or my lawyer can facilitate the purchase of your desired house and transfer it into your name. The choice is entirely yours.\n\nComic Elderscharacters,including Anna Mugwaku, Obvious Mututu, Alfred Mweya, Nichodimas Chigovanyika, and Potipher Zvombo, have become household favourites.\n\nChivayos lavish spending on public figures landed him in a corruption dossier reportedly authored by Vice President Constantino Chiwenga, calling for investigations into possible siphoning of state funds through dubiously awarded tenders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064152/comic-elder.jpg",
            "description": "<p>By Mary Taruvinga Comedian Leeroy Tadiwanashe Zavare, popularly known as Comic Elder, has once again found himself in the spotlight, this time after controversial businessman Wicknell Chivayo gifted him a staggering US$150,000 “for making the President laugh.” This comes a few days after President Emmerson Mnangagwa personally handed him a brand-new Ford Raptor. In a lengthy social</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/comic-elder-strikes-gold-again-gifted-us150000-by-chivayo-for-making-president-laugh/\">Comic Elder strikes gold again, gifted US$150,000 by Chivayo for ‘making President laugh’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:32",
            "date": "28 Oct 2025"
        }
    ]
}