{
    "news": [
        {
            "title": "Will Liga MX Return to FC 26?",
            "url": "https://www.newzimbabwe.com/will-liga-mx-return-to-fc-26/",
            "content": "It has been a disappointing period for fans of Mexican soccer, as the premier soccer gaming option hasnt had the licensing rights for the Liga MX since FIFA 22.\n\nThe leagues absence has been a big miss for gamers, especially those that wish to play as some of the major teams from the region such as Club America and Tigres.\n\nHowever, there could yet be good news on the horizon for Liga MX fans as the competition is set toreturn to the EA Sportsfranchise in time to be included in the upcoming release later this year.\n\nPrevious Partnership Ends\n\nThe reason for Liga MXs exclusion from recent EA releases is due to the competitions ongoing partnership with Konami, meaning that it was only able tofeature in theeFootballseries.\n\nThat has been a major blow for fans of the competition, especially considering that the quality of the Konami titles has diminished compared to the offerings provided by EA Sports throughout modern history.\n\nHowever, it was revealed on the site of the eFootball series that Liga MX is no longer listed as an official partner for the title, which signals the end of their three-year agreement.\n\nWhile it has not yet been officially announced that the competition will return to the EA series, there is an expectancy that one of the worlds most popular leagues will once again feature in the worlds most popular soccer gaming title.\n\nWhy is Liga MX So Important?\n\nThe absence of Liga MX clubs in the EA Sports game would have been felt by the developer, especially considering the popularity of the competition across the Americas. The Mexican league is very popular in Americas, as you can see in mostLiga MX betting apps.\n\nWith no Liga MX clubs licensed, sales of the game in Mexico have diminished, with many fans opting to instead play as their favorite clubs in the eFootball series. Gaining licensing rights for the competition is vitally important for the long-term success of the EA Sports game, as the tournament is one of the most followed across the Americas.\n\nThat is reflected by the fact that Liga MX is second to only the Premier League in terms of average viewing figures in the United States. Not only that, but the atmospheric stadiums available to players in Mexico offer players a unique environment to play matches.\n\nThere are also important factors that should be considered when it comes to the stadium licenses, as EA FC will have the rights to include all major arenas that will be used for next summers World Cup. However, the title of the competition will need to be different due to the ending of the agreement between EA Sports and FIFA.\n\nWhen Was Liga MX Last in an EA Sports Game?\n\nIt has been a long wait for Liga MX fans, as the competition hasnt been included an EA Sports series since FIFA 2022. The absence was felt by fans in the proceeding years, as it greatly reduced the number of teams available to players.\n\nHowever, its return is likely to appease the vast majority of gamers that like to experience and play with new teams that they wouldnt typically come across. It is also a further reminder that EA Sports are committed to offering the most authentic and comprehensive soccer gaming experience to their customers.\n\nOther Teams That Will Miss Out on EA FC 26\n\nThere will be a host of teams that will miss out on being included in the upcoming release of EA FC 26. Among those include teams that have been relegated from the bottom available tiers in the title. That includes English clubs such as Carlisle United and Morecambe.\n\nHowever, Barnet will replace one of the teams following their promotion from the National League. Two of the biggest teams in world soccer will also be likely to be missing in the title this year. EA has been missing Italian teams in recent editions of the title, and once again, it appears unlikely that either Inter Milan or AC Milan will be licensed in time to feature in the 2026 title.\n\nWith the World Cup fast approaching, there will also be major concerns that some of the biggest national teams in the world are also not licensed. The most notable of those is Brazil, who havent been licensed in the EA Sports series since FIFA 23.\n\nBelgium was unlicensed in EA FC 25, but featured in the previous edition of the title. Other nations that could make the World Cup but are unlikely to be licensed in time for the release this year include Australia, Canada, China, and Turkey. The latter of the nations hasnt featured in an EA Sports series title since FIFA 2021.\n\nWhen is EA FC 26 Released?\n\nSoccer fans still face a lengthy wait before the upcoming title in the EA Sports series is released, as EA FC 26 isnt set to hit shelves until late September.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29121714/WhatsApp-Image-2025-05-29-at-13.00.03.jpeg",
            "description": "<p>It has been a disappointing period for fans of Mexican soccer, as the premier soccer gaming option hasn’t had the licensing rights for the Liga MX since FIFA 22. The league’s absence has been a big miss for gamers, especially those that wish to play as some of the major teams from the region such</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/will-liga-mx-return-to-fc-26/\">Will Liga MX Return to FC 26?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "Dynamos hit with FIFA ban",
            "url": "https://www.newzimbabwe.com/dynamos-hit-with-fifa-ban/",
            "content": "By Sports Reporter\n\nZimbabwe football giants Dynamos has been hit with a FIFA ban due to an outstanding amount of US$18,500 owed to two former players from Ghana, Emmanuel Paga and Ansa Botchway.\n\nAccording to reports, Dynamos owes Paga US$8,500, while Botchway is owed US$10,000.\n\nThe duo parted ways with Dynamos in December last year, with Paga joining Mutare-based outfits Manica Diamonds, as Botchway crossed to Scottland FC.\n\nDembare had a turbulent 2024 season campaign, with players boycotting training several times in protest over unpaid winning bonuses and sign-on fees.\n\nThis then led to a mass players exodus at the end of the season as 15 senior players left.\n\nDynamos has become the fourth Zimbabwean club to be slapped with a FIFA ban since last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29044358/paga.png",
            "description": "<p>By Sports Reporter Zimbabwe football giants Dynamos has been hit with a FIFA ban due to an outstanding amount of US$18,500 owed to two former players from Ghana, Emmanuel Paga and Ansa Botchway. According to reports, Dynamos owes Paga US$8,500, while Botchway is owed US$10,000. The duo parted ways with Dynamos in December last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-hit-with-fifa-ban/\">Dynamos hit with FIFA ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "Giant of African literature Ngũgĩ wa Thiong’o dies aged 87",
            "url": "https://www.newzimbabwe.com/giant-of-african-literature-ngugi-wa-thiongo-dies-aged-87/",
            "content": "BBC\n\nNgg wa Thiongo, who has died aged 87,was a titan of modern African literature  a storyteller who refused to be bound by jail, exile and illness.\n\nHis work spanned roughly six decades, primarily documenting the transformation of his country  Kenya  from a colonial subject to a democracy.\n\nNgg was tipped to win the Nobel Prize for Literature countless times, leaving fans dismayed each time the medal slipped through his fingers.\n\nHe will be remembered not only as a Nobel-worthy writer, but also as a fierce proponent of literature written in native African languages.\n\nNgg was born James Thiongo Ngg in 1938, when Kenya was under British colonial rule. He grew up in the town of Limuru among a large family of low-income agricultural workers.\n\nHis parents scrimped and saved to pay for his tuition at Alliance, a boarding school run by British missionaries.\n\nIn aninterview, Ngg recalled returning home from Alliance at the end of term to find his entire village had been razed by the colonial authorities.\n\nHis family members were among the hundreds and thousands forced to live in detention camps during a crackdown on the Mau Mau, a movement of independence fighters.\n\nThe Mau Mau uprising, which lasted from 1952 to 1960, touched Nggs life in numerous, devastating ways.\n\nIn one of the most crushing, Nggs brother, Gitogo, was fatally shot in the back for refusing to comply with a British soldiers command.\n\nGitogo had not heard the command because he was deaf.\n\nIn 1959, as the British struggled to maintain their grip on Kenya, Ngg left to study in Uganda. He enrolled at Makerere University, which remains one of Africas most prestigious universities.\n\nDuring a writers conference at Makerere, Ngg shared the manuscript for his debut novel with revered Nigerian author Chinua Achebe.\n\nAchebe forwarded the manuscript to his publisher in the UK and the book, named Weep Not, Child, was released to critical acclaim in 1964. It was the first major English-language novel to be written by an East African.\n\nNgg swiftly followed up with two more popular novels, A Grain of Wheat and The River Between. In 1972, the UKs Times newspaper said Ngg, then aged 33, was accepted as one of Africas outstanding contemporary writers.\n\nThen came 1977  a period that marked a huge change in Nggs life and career. For starters, this was the year he became Ngg wa Thiongo and shed his birth name, James. Ngg made the change as he wanted a name free of colonial influence.\n\nHe also dropped English as the primary language for his literature and vowed to only write in his mother tongue, Kikuyu.\n\nHe published his last English language novel, Petals of Blood, in 1977.\n\nNggs previous books had been critical of the colonial state, but Petals of Blood attacked the new leaders of independent Kenya, portraying them as an elite class who had betrayed ordinary Kenyans.\n\nNgg didnt stop there. The same year, he co-wrote the play Ngaahika Ndeenda (I Will Marry When I Want), which was a searing look at Kenyas class struggle.\n\nIts theatre run was shut down by the government of then President Jomo Kenyatta and Ngg was locked up in a maximum security jail for a year without trial.\n\nIt was a fruitful 12 months, however  as Ngg wrote his first Kikuyu novel, Devil on the Cross, while in prison. It is said he used toilet paper to write the entire book, as he did not have access to a notebook.\n\nNgg was released after Daniel arap Moi replaced Mr Kenyatta as president.\n\nNgg said that four years later, while in London for a book launch,he learnt there was a plot to kill himon his return to Kenya.\n\nNgg began self-imposed exile in the UK and then the US. He did not return to Kenya for 22 years.\n\nWhen he finally did return, he received a heros welcome  thousands of Kenyans turned out to greet him.\n\nBut the homecoming was marred when assailants broke into Nggs apartment, brutally attacking the author and raping his wife.\n\nNgginsisted the assault was political.\n\nHe returned to the US, where he had held professorships at universities including Yale, New York and California Irvine.\n\nIn academia and beyond, Ngg became known as one of the foremost advocates of literature written in African languages.\n\nThroughout his career  and to this day  African literature was dominated by books written in English or French, official languages in most countries on the continent.\n\nWhat is the difference between a politician who says Africa cannot do without imperialism and the writer who says Africa cannot do without European languages? Ngg asked in a seminal, fiery essay collection, named Decolonising the Mind.\n\nIn one section, Ngg called out Chinua Achebe  the author who helped to launch his career  for writing in English. Their friendship soured as a result.\n\nAway from his literary career, Ngg was married  and divorced  twice. He had nine children, four of whom are published authors.\n\nMy own family has become one of my literary rivals, Ngg joked in a 2020LA Times interview.\n\nHis son, Mukoma wa Ngg, has alleged that his mother was physically abused by Ngg wa Thiongo.\n\nSome of my earliest memories are me going to visit her at my grandmothers where she would seek refuge, his son wrote in a social media post, which Ngg wa Thiongo did not respond to.\n\nLater in his life, Nggs health deteriorated. He had triple heart bypass surgery in 2019 and began to struggle with kidney failure. In 1995, he was diagnosed with prostate cancer and given three months to live.\n\nNgg recovered, however, adding cancer to the lengthy list of struggles he had overcome.\n\nBut now one of African literatures guiding lights  as Nigerian writer Chimamanda Ngozi Adichie once called him  is gone, leaving the world of words a little darker.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29042804/ngugi.webp",
            "description": "<p>BBC Ngũgĩ wa Thiong’o, who has died aged 87, was a titan of modern African literature – a storyteller who refused to be bound by jail, exile and illness. His work spanned roughly six decades, primarily documenting the transformation of his country – Kenya – from a colonial subject to a democracy. Ngũgĩ was tipped to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/giant-of-african-literature-ngugi-wa-thiongo-dies-aged-87/\">Giant of African literature Ngũgĩ wa Thiong’o dies aged 87</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "Chief Justice Malaba challenges judicial aspirants on tech competence as courts adopt IECMS",
            "url": "https://www.newzimbabwe.com/chief-justice-malaba-challenges-judicial-aspirants-on-tech-competence-as-courts-adopt-iecms/",
            "content": "By Mary Taruvinga\n\nChief Justice Luke Malaba on Wednesday encouraged the judicial officers to embrace technological advancements.\n\nMalaba said individuals lacking basic computer skills have no place in Zimbabwes judiciary at a time when the world is evolving technologically.\n\nThis urgent call for proficiency arose during the ongoing public interviews conducted by the Judicial Service Commission (JSC) for candidates vying for the post of Labour Court judges.\n\nThe JSC has implemented the internet-based Integrated Electronic Case Management System (IECMS), designed to streamline the digital management of court cases.\n\nTo effectively utilise this system, users must possess devices such as laptops, computers, tablets, and smartphones, along with reliable internet access.\n\nThey must also complete a registration process and receive adequate training on the IECMS platform.\n\nMalabas scrutiny fell on local lawyer Joseph Masango, who was applying for the Labour Court judge position.\n\nThe Chief Justice criticised Masangos apparent lack of initiative in keeping up with necessary skills, revealing that he had scored a zero on a test integral to the selection process.\n\nWhen Malaba inquired about Masangos computer literacy, the lawyer confidently affirmed his ability.\n\nHowever, when confronted with his test score, Masango attributed his failure to a lack of experience with IECMS, as his cases had not reached higher courts.\n\nIECMS is now a critical component in the justice system. How can you be a law officer without knowledge of using IECMS, especially since it was introduced back in 2022? Malaba remarked.\n\nYou cant pursue such a post when you score zero in a crucial test meant to prepare you for this role. All lawyers should know how to use the IECMS.\n\nHe continued to express his disappointment, saying, There is a component of laxity in you Your attitude toward IECMS is worrying. We cannot understand why a senior lawyer like you doesnt know these things or seems indifferent to the changes occurring not just in Zimbabwes judicial space but globally.\n\nIn response, Masango vowed to amend his approach if granted the position.\n\nI will never do that again. If I am given the post, I will change that attitude and put my all into this job, he said.\n\nMy CV shows that I have not been stagnant; Ive received promotions because my supervisors were satisfied with my performance. If there was laxity in my work, clients would have reported me to the Law Society. Im a go-getter, and I adhere to ethical conduct.\n\nThe JSC is interviewing 28 candidates who are competing for eight positions on the Labour Court bench. The process began on Tuesday. Initially, the commission received 53 nominations, but following a review, six submissions were invalidated, and two were withdrawn.\n\nOn April 14, 2025, 45 candidates participated in the first-level examination, with 28 qualifying for the final interviews.\n\nThe panel of interviewers includes Malaba, his deputy, Elizabeth Gwaunza, Attorney General Virginia Mabhiza, Judge President Mary Zimba Dube, and Chief Magistrate Vongai Guuriro Muchuchuti, among others.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/13122004/Chief-Justice-Luke-Malaba.jpg",
            "description": "<p>By Mary Taruvinga Chief Justice Luke Malaba on Wednesday encouraged the judicial officers to embrace technological advancements. Malaba said individuals lacking basic computer skills have no place in Zimbabwe’s judiciary at a time when the world is evolving technologically. This urgent call for proficiency arose during the ongoing public interviews conducted by the Judicial Service</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chief-justice-malaba-challenges-judicial-aspirants-on-tech-competence-as-courts-adopt-iecms/\">Chief Justice Malaba challenges judicial aspirants on tech competence as courts adopt IECMS</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "ZWG annual inflation rate hits 92,1%",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-rate-hits-921/",
            "content": "By Alois Vinga\n\nTHE local ZWG inflation rate has surged to 92,1% amid grave concerns bytheindustry for authorities to contain the rates.\n\nData published by the Zimbabwe National Statistics Agency (ZimStat) this week revealed that annual inflation, which stood at 85% last month, surged by 7% in the month of May 2025.\n\nThe ZWG month-on-month inflation rate was 0.9 percent in May 2025, gaining 0.3 percentage points on the April 2025 rate of 0.6 percent. The ZWG year-on-year inflation rate (annual percentage change) for the month of May 2025, as measured by the all-items ZWG Consumer Price Index (CPI), was 92.1%, the statistics agency said.\n\nLast month, the Confederation of Zimbabwe Industries said the high ZWG inflation largely reflects cumulative shocks that drove month-on-month inflation in 2024. The industry grouping said a significant factor was the September 2024 exchange rate devaluation, which substantially increased the ZiG Consumer Price Index (CPI) and, in turn, elevated annual inflation compared to April 2024 levels.\n\nThe industry body said high ZWG annual inflation poses challenges for businesses, particularly due to its impact on interest rates.\n\nZimstat said the weighted month-on-month inflation rate was 0.0 percent in May 2025, shedding 0.3 percentage points on the April 2025 rate of 0.3 percent while the weighted year-on-year inflation rate for May 2025 as measured by the all-items USD Consumer Price Index (CPI), was 26.9 percent.\n\nThe USD month-on-month inflation rate was -0.3 percent in May 2025, shedding 0.5 percentage points on the April 2025 rate of 0.2 percent. The USD year-on-year inflation rate (annual percentage change) for the month of May 2025, as measured by the all-items USD Consumer Price Index (CPI), was 13.9 percent, said Zimstat.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga THE local ZWG inflation rate has surged to 92,1% amid grave concerns by the industry for authorities to contain the rates. Data published by the Zimbabwe National Statistics Agency (ZimStat) this week revealed that annual inflation, which stood at 85% last month, surged by 7%  in the month of May 2025. “The ZWG month-on-month</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-rate-hits-921/\">ZWG annual inflation rate hits 92,1%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "Mnangagwa declares multi-vehicle collision which killed 12 a national disaster, victims named",
            "url": "https://www.newzimbabwe.com/mnangagwa-declares-multi-vehicle-collision-which-killed-12-a-national-disaster-victims-named/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwa has declared the fatal accident involving a fuel tanker, a two-tonne truck and a van, which claimed 12 lives near Kwekwe, a national disaster.\n\nThe accident occurred at the 200 kilometre peg along the Harare-Bulawayo Road near Sebakwe River.\n\nAccording to the Zimbabwe Republic Police (ZRP), the fuel tanker with two trailers, travelling towards Kwekwe, collided with a truck travelling from the opposite direction, resulting in a head-on collision with a Nissan AD van, which had 12 people on board.\n\nThe tanker dragged the van for several metres before overturning and falling on top of it, trapping the 12 occupants inside.\n\nPolice have released names of eight of the victims  James Ncube (23), Marvellous Mapanzure (20), Emilly Mpofu Mucheuki (25), Joshua Muza (35), Reward Nyatsongo (28), Farai Bisendi (47), Emmanuel Mangomana (21) and Maria Jasi (43).\n\nFour females are yet to be identified.\n\nIn a statement, Mnangagwa declared the accident a national disaster.\n\nMy heart goes out to families that have lost their loved ones in this horrific accident. Equally, I wish a speedy recovery to all those nursing injuries from the incident. I have since directed the responsible arms of my Government to declare this traffic accident a national disaster.\n\nThis crucial legal step paves the way for Government to move in and take all-round responsibility for the interment of all those who perished the accident, and for support to those hospitalised. May all the bereaved and other affected families find comfort and a solace in that our Nation joins and mourns with them in this hour of deep grief and pain, said Mnangagwa.\n\nHe urged the public to support law enforcement in addressing reckless driving.\n\nThe deadly incident adds yet another grim statistic to the needless toll which reckless driving levies on our people and our Nation. While I am pleased that the Zimbabwe Republic Police is moving speedily towards a full deployment of high-end technologies for traffic management, and for curbing waywardness on our roads, more still has to be done to arrest the ever-spiralling fatalities we face as a Nation.\n\nThe duty for safe traffic conduct squarely falls on all road users, while the responsibility to call out reckless road-users includes the general public who should support our law enforcement agencies to tame what in essence has become a traffic jungle, added Mnangagwa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/28170019/kwekwe-accident.jpeg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa has declared the fatal accident involving a fuel tanker, a two-tonne truck and a van, which claimed 12 lives near Kwekwe, a national disaster. The accident occurred at the 200 kilometre peg along the Harare-Bulawayo Road near Sebakwe River. According to the Zimbabwe Republic Police (ZRP), the fuel tanker</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-declares-multi-vehicle-collision-which-killed-12-a-national-disaster-victims-named/\">Mnangagwa declares multi-vehicle collision which killed 12 a national disaster, victims named </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "Chevrons to play Proteas in Battle of Limpopo test match",
            "url": "https://www.newzimbabwe.com/chevrons-to-play-proteas-in-battle-of-limpopo-test-match/",
            "content": "By Sport Reporter\n\nZimbabwe senior mens cricket team will in June face neighbours South Africa at Queens Sports Club in a two-Test match series dubbed the Battle of Limpopo.\n\nThe first series is scheduled will start onJune28 to July 2, while the second one will be played from July6 to 10.\n\nChevrons upcoming series against Proteas comes on the back of an innings and 45 runs defeat against England in a historical Test match, which was played at Trent Bridge.\n\nZimbabwes Test match against South Africa will mark the third Test for the Chevrons this year, following two Test encounters against Bangladesh in April and England in May.\n\nZimbabwe and South Africas last Test meeting was a single-match encounter played at Port Elizabeth in 2017, which the host won by 120 runs.\n\nChevrons two-match series against South Africa will be used as a build-up to another two-test match series against New Zealand, which is set to tour Zimbabwe at the end of July.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/01174040/Chevrons.webp",
            "description": "<p>By Sport Reporter Zimbabwe senior men’s cricket team will in June face neighbours South Africa at Queens Sports Club in a two-Test match series dubbed the ‘Battle of Limpopo’. The first series is scheduled will start on June 28 to July 2, while the second one will be played from July 6 to 10. Chevrons’ upcoming series against</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/chevrons-to-play-proteas-in-battle-of-limpopo-test-match/\">Chevrons to play Proteas in Battle of Limpopo test match</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        },
        {
            "title": "Harare Remand Prison inmates living in degrading, inhumane conditions – rights body",
            "url": "https://www.newzimbabwe.com/harare-remand-prison-inmates-living-in-degrading-inhumane-conditions-rights-body/",
            "content": "By Anna Chibamu\n\nTHE Zimbabwe Human Rights Commission (ZHRC) hasraised concerns over the gross violations of inmates rights at Harare Remand Prison.\n\nIn a statement released recently, the ZHRC said in line with its constitutional mandate, it conducted a human rights monitoring visit to Harare Remand Prison on April 29, 2025, where inmates are living under inhumane conditions.\n\nThe Commission reported that around 80 inmates had either been detained without trial or had their legal proceedings delayed, suffered prolonged pre-trial detention, were denied access to education and healthcare, lived in overcrowded cells, suffered police abuse and several other rights violations.\n\nThe Commissions visit was meant to ascertain and verify facts following concerns over the prolonged detention of inmates arrested for politically sensitive cases.\n\nThese included Mr. Blessed Mhlanga ( HStv Journalist) and the 94 detainees arrested in relation to the March 31, 2025 protests.\n\nThe mission aimed to investigate allegations of politically motivated pre-trial detention and to ascertain circumstances surrounding the arrest and detention of the inmates and to secure appropriate redress in line with section 243(1)(g) of the Constitution of Zimbabwe.\n\nIndeed, the visit covered all other issues affecting inmates in this prison facility, part of the ZHRC statement read.\n\nThe ZHRC team was led by the Commission chairperson, Fungayi Jessie Majome.\n\nMany detainees, including Mr. Blessed Mhlanga, have faced excessive delays in their legal proceedings, raising serious concerns regarding their rights to a fair trial.\n\nInmates held in cases of political interest suffered prolonged pretrial detention in violation of the right not to be detained without trial, and to be released on bail unless there are compelling reasons justifying such detention.\n\nAlso, Some of the inmates reported significant violations of their rights to education and healthcare. Mhlanga, a first-year law student, and another University of Zimbabwe Economics student were denied the opportunity to sit for their examinations while in custody, whilst inmates experienced inhumane living conditions, mostly due to overcrowding.\n\nPrison cells designed for 35 inmates were reportedly holding more than 80, leading to unsanitary and degrading living conditions.\n\nSeveral detainees raised allegations of police abuse during their arrests, including physical violence and theft of personal belongings.\n\nThe commission revealed there were 66 irregular migrants of different nationalities whose detention was in violation of their rights, as they were not facing any criminal charges and were not awaiting trial.\n\nZHRC urged relevant authorities to take immediate action to prioritise urgent bail applications, conduct thorough investigations into allegations of police misconduct and ensure accountability for any abuses.\n\nThe Commission called for improved prison conditions, reduced crowds, restoration ofcommunication facilities, and access to adequate medical care for all detainees.\n\nPrison officers were urged to desist from imprisoning irregular migrants whose issues should be handled without resorting to indefinite detention.\n\nInmates were advised to report any complaints to the Officer In Charge, who indicated that he was ready to receive reports of assaults by prison officers and bullying by fellow inmates.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Anna Chibamu THE Zimbabwe Human Rights Commission (ZHRC) has raised concerns over the gross violations of inmates’ rights at Harare Remand Prison. In a statement released recently, the ZHRC said in line with its constitutional mandate, it conducted a human rights monitoring visit to Harare Remand Prison on April 29, 2025, where inmates are living</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-remand-prison-inmates-living-in-degrading-inhumane-conditions-rights-body/\">Harare Remand Prison inmates living in degrading, inhumane conditions – rights body </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "29 May 2025"
        }
    ]
}