{
    "news": [
        {
            "title": "Filmmakers behind BBC’s ‘Blood Parliament’ arrested in Nairobi amid outcry over police killings",
            "url": "https://www.newzimbabwe.com/filmmakers-behind-bbcs-blood-parliament-arrested-in-nairobi-amid-outcry-over-police-killings/",
            "content": "By The Eastleigh Voice\n\nFOUR filmmakers connected to the explosive BBC documentary, Blood Parliament, have been arrested in Nairobi, amid mounting controversy over the governments handling of police killings during last years protests, which were mainly led by Gen Z demonstrators, some of whom were killed by police.\n\nThe filmmakers, Chris Wamae, Nicholas Gichuki, Brian Adagala and Mark Karubiu, were taken into custody early Saturday morning from their studio in Karen.\n\nThe four men are currently being held at Muthaiga and Pangani police stations.\n\nThe arrest follows the release of a 40-minute documentary by BBC Africa Eye, which investigates the killing of peaceful protesters during anti-tax demonstrations outside Parliament in June 2024.\n\nThe film focuses particularly on the death of Eric Shieni, a finance student at the University of Nairobi, who was shot as he was leaving the protest.\n\nIn its documentary, BBC Africa Eye claimed to have reviewed over 150 images and videos taken before and after Shienis death.\n\nThe network said its investigation identified the officer responsible for the killing, who they say is a member of Kenyas armed forces. However, the officers identity has not been officially confirmed, and the Kenya Defence Forces (KDF) has denied any involvement.\n\nThe documentary has generated a significant public outcry, raising questions about the use of force by the Kenyan security forces during the protest.\n\nCritics have demanded accountability for those responsible for the deaths and injuries of unarmed protesters.\n\nOn Monday, Kenyan officials blocked a public screening of the documentary, a move that many view as an attempt to silence the investigation and prevent further scrutiny. BBC confirmed that the screening was abruptly cancelled after intervention by local authorities.\n\nThe screening was stopped at the last minute under pressure from the government, the BBC said in a statement.\n\nThis action appears to be an effort to prevent the public from viewing the documentary and its contents.\n\nThe arrest of the filmmakers is seen as part of a broader effort by the government to suppress information related to police misconduct during the protests.\n\nHuman rights organisations have condemned the arrests, calling them an attack on free speech and press freedom.\n\nThe incident has sparked fears of increased government control over the media, especially regarding sensitive political topics.\n\nMany journalists and filmmakers working on politically sensitive stories have expressed concerns about facing similar reprisals.\n\nThe Blood Parliament documentary has put the spotlight on the issue of police violence during the June 2024 protests, which saw dozens of people killed or injured.\n\nAlthough the government has pledged to investigate the deaths, there have been no significant actions taken to hold security officers accountable for the killings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/03084806/BBC-blood-parliament.jpg",
            "description": "<p>By The Eastleigh Voice  FOUR filmmakers connected to the explosive BBC documentary, Blood Parliament, have been arrested in Nairobi, amid mounting controversy over the government’s handling of police killings during last year’s protests, which were mainly led by Gen Z demonstrators, some of whom were killed by police. The filmmakers, Chris Wamae, Nicholas Gichuki, Brian</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/filmmakers-behind-bbcs-blood-parliament-arrested-in-nairobi-amid-outcry-over-police-killings/\">Filmmakers behind BBC’s ‘Blood Parliament’ arrested in Nairobi amid outcry over police killings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Kaindu concerned over Highlanders leaky defence ahead of Yadah clash",
            "url": "https://www.newzimbabwe.com/kaindu-concerned-over-highlanders-leaky-defence-ahead-of-yadah-clash/",
            "content": "By Sports Reporter\n\nHIGHLANDERS coach Kelvin Kaindu is concerned over his teams leaky defence ahead of Saturdays clash against Yadah at The Heart Stadium.\n\nBosso is travelling to Harare bubbling with confidence following a 1-0 win over Bikita Minerals Wednesday at Barbourfields Stadium.\n\nThe Kaindu-led side is second most prolific in terms of goals in the league with 11 goals to its name, one less than TelOne, which has converted the highest number of goals in the ongoing campaign.\n\nAlthough Bosso is proving to be clinical upfront, Kaindu is concerned with the way they are conceding goals.\n\nTheres still work to be done, l think we are good and almost every game we are scoring.\n\nBut Im still concerned with the way that we are defending, especially the mistakes that we make from our central defenders, he said.\n\nHighlanders have conceded six goals in five matches out of the nine games they have played in the present campaign.\n\nSaturdays trip to The Heart Stadium will be a big test for Kaindu and his boys as they lost 2-0 against the same opponents at the same venue last season, before drawing one all during the return leg played at Barbourfields.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/12193425/KELVIN-KAINDU-10.gif",
            "description": "<p>By Sports Reporter  HIGHLANDERS coach Kelvin Kaindu is concerned over his team’s leaky defence ahead of Saturday’s clash against Yadah at The Heart Stadium. Bosso is travelling to Harare bubbling with confidence following a 1-0 win over Bikita Minerals Wednesday at Barbourfields Stadium. The Kaindu-led side is second most prolific in terms of goals in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kaindu-concerned-over-highlanders-leaky-defence-ahead-of-yadah-clash/\">Kaindu concerned over Highlanders leaky defence ahead of Yadah clash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Prince Harry tells BBC he wants ‘reconciliation’ with Royal Family",
            "url": "https://www.newzimbabwe.com/prince-harry-tells-bbc-he-wants-reconciliation-with-royal-family/",
            "content": "By BBC News\n\nTHE Duke of Sussex has told the BBC he would love a reconciliation with the Royal Family, in an emotional interview in which he said he was devastated at losing a legal challenge over his security in the UK.\n\nPrince Harry said the King wont speak to me because of this security stuff, but that he did not want to fight any more and did not know how much longer my father has.\n\nThe prince spoke to BBC News in California after losing an appeal over the levels of security he and his family are entitled to while in the UK.\n\nBuckingham Palace said: All of these issues have been examined repeatedly and meticulously by the courts, with the same conclusion reached on each occasion.\n\nAfter Fridays court ruling, the prince said: I cant see a world in which I would bring my wife and children back to the UK at this point.\n\nThere have been so many disagreements between myself and some of my family, he added, but had now forgiven them.\n\nI would love reconciliation with my family. Theres no point continuing to fight any more, life is precious, said Prince Harry, who said the dispute over his security had always been the sticking point.\n\nThe prince had wanted to overturn changes to his security that were introduced in 2020 as he stepped down as a working royal and moved to the United States.\n\nSaying that he felt let down, he described his court defeat as a good old-fashioned establishment stitch up and blamed the Royal Household for influencing the decision to reduce his security.\n\nAsked whether he had asked the King to intervene in the dispute over security, Prince Harry said: I never asked him to intervene  I asked him to step out of the way and let the experts do their jobs.\n\nThe prince said his treatment during the process of deciding his security had uncovered my worst fears.\n\nHe said of the decision: Im devastated  not so much as devastated with the loss that I am about the people behind the decision, feeling as though this is okay. Is it a win for them?\n\nHe continued: Im sure there are some people out there, probably most likely the people that wish me harm, [who] consider this a huge win.\n\nPrince Harry said the decision to remove his automatic security entitlement impacts him every single day, and has left him in a position where he can only safely return to the UK if invited by the Royal Family  as he would get sufficient security in those circumstances.\n\nThe prince said changes to his security status in 2020 had impacted not just him, but his wife and, later, his children too.\n\nHe went on to say: Everybody knew that they were putting us at risk in 2020 and they hoped that me knowing that risk would force us to come back.\n\nBut then when you realise that didnt work, do you not want to keep us safe?\n\nWhether youre the government, the Royal Household, whether youre my dad, my family  despite all of our differences, do you not want to just ensure our safety?\n\nAsked whether he missed the UK, he added: I love my country, I always have done, despite what some people in that country have done and I think that its really quite sad that I wont be able to show my children my homeland.\n\nPrince Harry said he would not be seeking a further legal challenge, saying Fridays ruling had proven that there was no way to win this through the courts.\n\nI wish someone had told me that beforehand, he said, adding that the ruling had been a surprise.\n\nHe continued: This, at the heart of it, is a family dispute, and it makes me really, really sad that were sitting here today, five years later, where a decision that was made most likely, in fact I know, to keep us under the roof.\n\nHarrys emotional avalanche hits the Royal Family\n\nPrince Harry spoke to the BBC shortly after losing his latest legal challenge against the UK government over the level of security he and his family are entitled to when visiting.\n\nThe Court of Appeal dismissed the princes case, which hinged on how an official committee made the decision to remove his eligibility for automatic, full-scale protection in line with what other senior royals receive.\n\nOn Friday, the court ruled that Prince Harry had made powerful arguments about the level of threat he and his family face, but said his sense of grievance did not translate into a legal argument.\n\nHis legal complaint centred around a committee called the Protection of Royalty and Public Figures (Ravec), which authorises security for senior royals on behalf of the Home Office, and was chaired at the time by Sir Richard Mottram.\n\nUnder the committees regulations, Prince Harry argued, his case should have been put before Ravecs Risk Management Board (RMB), which would have assessed the threats to his and familys security  but that did not happen.\n\nOn Friday, senior judges said the committee had diverged from policy when making its 2020 decision over the princes security, but concluded it had been sensible to do so because of the complexity of his circumstances.\n\nPrince Harry said his jaw hit the floor when he found out a representative of the Royal Household sat on the Ravec committee, and claimed Fridays ruling had proved its decision-making process was more influenced by the Royal Household than by legal constraints.\n\nHe claimed there had been interference by the Royal Household in the 2020 decision, which he said resulted in his status as the most at-risk royal being downgraded to the least at risk overnight.\n\nSo, one does question how that is even possible and also the motive behind that at the time, he added.\n\nPrince Harry called on UK Prime Minister Sir Keir Starmer and Home Secretary Yvette Cooper to intervene in his security case, and to overhaul how the Ravec committee operates.\n\nIn a statement released later on Friday, the prince said he would write to Cooper to ask her to urgently examine the matter and review the Ravec process.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/22150038/Megan-Harry.jpg",
            "description": "<p>By BBC News THE Duke of Sussex has told the BBC he “would love a reconciliation” with the Royal Family, in an emotional interview in which he said he was “devastated” at losing a legal challenge over his security in the UK. Prince Harry said the King “won’t speak to me because of this security</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prince-harry-tells-bbc-he-wants-reconciliation-with-royal-family/\">Prince Harry tells BBC he wants ‘reconciliation’ with Royal Family</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Kanye West’s rants can’t dim Paris Hilton’s shine: new fragrance launches",
            "url": "https://www.newzimbabwe.com/kanye-wests-rants-cant-dim-paris-hiltons-shine-new-fragrance-launches/",
            "content": "By IOL\n\nKANYE West (aka Ye) is at it again, this time involving Paris Hilton in his latest tirade. Its worth remembering that Hilton played a significant role in launching Kim Kardashians career, gifting her early exposure to fame and some designer accessories.\n\nBefore Keeping Up With the Kardashians, his ex-wife was Paris Hiltons assistant-slash-bestie, following her around in early-2000s paparazzi shots, and learning the ropes of tabloid royalty.\n\nYe seems to be having regrets, not about his music or his never-ending rants, but about his parenting choices.\n\nIn a moment on a streaming platform called Digital Nas Twitch earlier this week, Ye decided to air some alternate universe fantasies.\n\nKim was Paris Hiltons assistant, he said.\n\nI shouldve had babies with Paris Hilton over Kim Kardashian. Could you imagine if I had kids with Paris Hilton? How many hotels Id have now? Think about that  the Hilton. I think yall staying at the Hilton right now. The Edition Hotels is a Hilton.\n\nHe also compared Kardashian to the late Virgil Abloh, a backhanded compliment if there ever was one.\n\nParis Hilton had the vision, and thats what happened, Ye added.\n\nKim was like the Virgil [Abloh]. Kim was like Paris Hiltons Virgil. Whew.\n\nWhile Yes out here rewriting the family tree in his head, Hilton is living her real-life fairytale and couldnt be more unbothered. On Wednesday, she took to Instagram Stories to show off her rooftop hangout with sister Nicky Hilton, celebrating her latest milestone.\n\nSo proud of my 30th fragrance, Iconic, she wrote. Hiltons got 30 perfumes under her designer belt. The womans perfume empire is practically a shelf-breaker.\n\nAnd in true Hilton style, she stepped behind the DJ booth with a bejewelled hairbrush-mic and lip-synced to her surprisingly well-loved 2006 bop, Stars Are Blind. A hit that critics once raised eyebrows at, but has since aged into a Y2K pop cult classic.\n\nAs for Ye, well, weve seen this pattern before. Hes got four children with Kardashian, and yet somehow cant stop dragging her into his latest rants.\n\nAt this point, were just waiting to see who makes it into his next stream-of-consciousness saga. One things for sure: Hiltons not interested in being part of Yes what if multiverse. Shes too busy being iconic.\n\nShame, he missed that memo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/03061056/F3IhJXcbUAAMqoT.jpg_large.jpg",
            "description": "<p>By IOL KANYE West (aka Ye) is at it again, this time involving Paris Hilton in his latest tirade. It’s worth remembering that Hilton played a significant role in launching Kim Kardashian’s career, gifting her early exposure to fame and some designer accessories. Before “Keeping Up With the Kardashians”, his ex-wife was Paris Hilton’s assistant-slash-bestie,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kanye-wests-rants-cant-dim-paris-hiltons-shine-new-fragrance-launches/\">Kanye West’s rants can’t dim Paris Hilton’s shine: new fragrance launches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Zimbabwean leather sector eyes partnership with Chinese firms for value addition",
            "url": "https://www.newzimbabwe.com/zimbabwean-leather-sector-eyes-partnership-with-chinese-firms-for-value-addition/",
            "content": "By Xinhua\n\nZIMBABWES leather sector is seeking partnerships with Chinese firms to build a competitive leather value chain and further tap into the Chinese market.\n\nFungai Zvinondiramba, a councillor at the Zimbabwe Leather Development Council, an organization that promotes the countrys leather industry, said Chinas advanced manufacturing capabilities and efficient supply chains can help local players become globally competitive.\n\nWe are looking to China as a partner in developing our leather sector. We are also focusing on the entire value and supply chains, from chemicals for our tanneries to components for our shoes and leather boots. China produces all of these, and we want strong trade relations to develop our leather value chain, he told Xinhua recently.\n\nThe Chinese market has a strong appetite for leather crafts such as belts, said Zvinondiramba, also secretary of the Bulawayo Leather Cluster (BLC), a group of businesses and individuals promoting the leather industry in Bulawayo, Zimbabwes second-largest city.\n\nZimbabwe has a long-standing tradition of leather craft. The sector benefits from the countrys rich livestock and diverse wildlife resources.\n\nLocal producers use a mix of handcrafting techniques and modern machinery to make products such as bags, shoes, belts and wallets. Unlike mass-produced leather goods made with industrial machinery and standardized designs, crafted leather products feature personalized designs, often made with hand-held tools.\n\nWe have the best hides, the best animals. And we also have a strong historical background in leather crafting. The skill set and infrastructure are already in place. We have those trained in manufacturing, as well as those with natural talent for crafting, Zvinondiramba said.\n\nHe added that other products in the leather value chain, such as raw hides, can also be exported to China.\n\nWe are also looking at promoting our abattoirs in China. With the worlds largest population, China presents a lucrative market for our meat products, especially beef, which is also part of our value chain, he said.\n\nOnce a major regional producer of leather goods, especially shoes, Zimbabwes leather sector is now undergoing a revival.\n\nJoseph Mukondo, a marketing representative for BLC, said that while small-scale producers are playing a vital role in reviving the industry, they face stiff competition from imported second-hand and synthetic footwear.\n\nSo far, the leather industry is struggling due to the influx of cheap synthetic leather imports and second-hand shoes. We are trying to win back customers by promoting genuine leather, but with the current economic hardships, people tend to buy two or three pairs of shoes for 10 U.S. dollars instead of a single genuine leather pair for 20, he said.\n\nWe used to have large foreign companies making shoes in Zimbabwe. Today, most activities are carried out by local start-ups. That is why we are turning to China to help our start-ups grow into major players in the leather sector, Zvinondiramba said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/03060819/20250501e960867f7df2462096e47606ed6938f5_CnbbeeE007011_20250501_CBMFN0A001.jpeg",
            "description": "<p>By Xinhua ZIMBABWE’S leather sector is seeking partnerships with Chinese firms to build a competitive leather value chain and further tap into the Chinese market. Fungai Zvinondiramba, a councillor at the Zimbabwe Leather Development Council, an organization that promotes the country’s leather industry, said China’s advanced manufacturing capabilities and efficient supply chains can help local</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwean-leather-sector-eyes-partnership-with-chinese-firms-for-value-addition/\">Zimbabwean leather sector eyes partnership with Chinese firms for value addition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "‘I am not a Zanu PF enabler’– Opposition LEAD president Masarira",
            "url": "https://www.newzimbabwe.com/i-am-not-a-zanu-pf-enabler-opposition-lead-president-masarira/",
            "content": "By Alois Vinga\n\nOPPOSITION Labour Economists and African Democrats (LEAD) president, Linda Masarira has dismissed rampant public suspicions that she is an invisible ruling Zanu-PF party enabler insisting her politics is driven by the passion to see unity across the countrys political divide.\n\nA section of the countrys citizens has for long suspected the female politician of being aided by the ruling Zanu PF party as a counter-strategy to neutralise the opposition space. Some have questioned her seemingly anti-tolerant bashing of opposition leaders in the country despite claiming to be fighting for the same cause.\n\nChallenged by NewZimbabwe.com to come out clean on whether she is working hand-in-glove with the ruling party on the sidelines of the Zimbabwe Congress of Trade Unions (ZCTU) organised Workers Day commemorations at Dzivarasekwa Stadium Thursday, Masarira dismissed the suspicions.\n\nYou know what? A lot of people dont understand the type of politics I am pursuing. Im a unifier. Im a States Woman. I believe in unity of people, unity in our diversity. Right now, Ive been advocating for healthcare reform. Ive been advocating for a health revolution but some people want to politicise them, she said.\n\nMasarira said what people should understand is that when one gets sick, they go to Parirenyatwa, United Bulawayo Hospitals (UBH) or Mpilo Hospital, where no one asks for their political party affiliation or political party card.\n\nShe implored Zimbabweans to shake off political jackets and the binary optics of politics that we have and converge on issues of national interest.\n\nI do not thrive on politics of patronage but on issues that affect every Zimbabwean, regardless of their political party affiliation.\n\nSo, going forward, as I embark on my political journey, I shall need votes from Zanu PF people, I shall need votes from every other ordinary Zimbabwean. I do not participate in politics of hate, in politics of toxicity, in politics of insults, she added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/04/22060108/Linda-Masarira.jpg",
            "description": "<p>By Alois Vinga OPPOSITION Labour Economists and African Democrats (LEAD) president, Linda Masarira has dismissed rampant public suspicions that she is an ‘invisible’ ruling Zanu-PF party enabler insisting her politics is driven by the passion to see unity across the country’s political divide. A section of the country’s citizens has for long suspected the female</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-am-not-a-zanu-pf-enabler-opposition-lead-president-masarira/\">‘I am not a Zanu PF enabler’– Opposition LEAD president Masarira</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Government stops councils from issuing change of land use permits amid invasion of greenways, mushrooming schools in suburbs",
            "url": "https://www.newzimbabwe.com/government-stops-councils-from-issuing-change-of-land-use-permits-amid-invasion-of-greenways-mushrooming-schools-in-suburbs/",
            "content": "By Staff Reporter\n\nCONCERNED about unregulated infrastructural developments on greenways and the sprouting of private schools and creches in suburbs, government has stopped councils processing applications and issuing permits.\n\nThe moratorium, which takes effect immediately, has been necessitated by an influx of applications to convert residential properties into institutional stands, a trend which Local Government and Public Works Minister Daniel Garwe has put on ice in terms of Section 69 of the Regional Town and Country Planning Act (Chapter 29:12).\n\nThe law provides that the relevant minister may give to any local authority directions, either general or specific, regulating the manner in which any procedures for the carrying out of its functions shall be carriedout.\n\nIn a circular dated May 2, 2025, addressed to mayors and chairpersons of councils, Garwe said the 90-day moratorium prohibits all local authorities from exercising planning powers in respect of change of reservation and change of land use, effective the date of pronouncement, which is May 2.\n\nThe moratorium is conditional in that local authorities are required to undertake specific actions elaborated in it, inorder for the moratorium to be lifted for respective councils, reads the circular.\n\nEach local authority is required to have a whole-of-council approach in ensuring adherence to the conditions set out in this moratorium.\n\nIt was further noted that interpretation of the order rests with the ministrys permanent secretary.\n\nIn an explanatory note accompanying the circular, Garwe said the proliferation of obstructive land uses in residential areas and the heightened public complaints against such developments, had jerked his ministry to stop councils from authorising developments until certain conditions were met.\n\nIn the interest of the public, the Government of Zimbabwe hereby wishes to advise the nation of measures being put in place to enhance the management of the built environment in our rural and urban areas by temporarily suspending the processing of such permits while reviews are conducted by relevant authorities, added Garwe.\n\nDuring the moratorium, councils must strengthen their development control units through staffing and provision of requisite tools of trade, enhance public consultation mechanisms to make them more effective, and enforce legal provisions, including by-laws.\n\nIn addition, the local authorities must strengthen monitoring of compliance with respect of various permits and develop plans for maintenance and beautification of buffers along roads and other public spaces.\n\nThe minister says he will uplift the moratorium for those councils that would have complied with the set conditions and provided proof of compliance by submitting a comprehensive report that shows how they would have fulfilled the criteria.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/11/11180630/Daniel-Garwe-Minister-of-National-Housing-and-Social-Ammenities.jpg",
            "description": "<p>By Staff Reporter  CONCERNED about unregulated infrastructural developments on greenways and the sprouting of private schools and creches in suburbs, government has stopped councils processing applications and issuing permits. The moratorium, which takes effect immediately, has been necessitated by an influx of applications to convert residential properties into institutional stands, a trend which Local Government</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-stops-councils-from-issuing-change-of-land-use-permits-amid-invasion-of-greenways-mushrooming-schools-in-suburbs/\">Government stops councils from issuing change of land use permits amid invasion of greenways, mushrooming schools in suburbs </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Top musician Chillmaster escapes prison with a fine and community service",
            "url": "https://www.newzimbabwe.com/top-musician-chillmaster-escapes-prison-with-a-fine-and-community-service/",
            "content": "By Mary Taruvinga\n\nPROMINENT artist Gift Hombarume popularly known as Chillmaster has escaped jail with a US$200 fine and community service following his conviction for running over a pedestrian with his vehicle.\n\nChill Master was handed a wholly suspended jail term by Mbare Magistrate Tatenda Mukurunge after a full trial.\n\nThe magistrate fined him US$200 for driving without a drivers licence and two years for culpable homicide.\n\nOne year was then suspended on condition of good behaviour while the remaining 22 months were suspended on condition that he performs 420 hours of community service at Stoneridge Primary School.\n\nThe musician caused the death of Custon Charumbira last month after hitting him with his vehicle.\n\nWhile pleading for leniency, the celebrity artist undertook to take care for the family left behind by Charumbira.\n\nHe also undertook to send Charumbiras children to school until they complete their education.\n\nThe family, through Lucia Charumbira, said he has undertaken to pay beasts to avoid avenging spirits. He undertook to send the deceaseds children to school and also buy her monthly groceries, said the magistrate in handing down her sentence.\n\nIn the victim impact statement, the family of the deceased begged the court not to give the musician a custodial sentence noting that they have already forgiven him.\n\nThe family also said Charumbira was going through stressful moments such that he could have failed to see the car that was approaching him.\n\nLucia said Chillmaster helped the family with almost everything to cover the now deceaseds funeral, including ferrying mourners from Harare to Zaka, his rural home.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/09220103/Chillmaster.webp",
            "description": "<p>By Mary Taruvinga  PROMINENT artist Gift Hombarume popularly known as Chillmaster has escaped jail with a US$200 fine and community service following his conviction for running over a pedestrian with his vehicle. Chill Master was handed a wholly suspended jail term by Mbare Magistrate Tatenda Mukurunge after a full trial. The magistrate fined him US$200</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-musician-chillmaster-escapes-prison-with-a-fine-and-community-service/\">Top musician Chillmaster escapes prison with a fine and community service</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Can Zimbabwean Immigrants Avail SASSA Grant? Eligibility & Guidelines Explained",
            "url": "https://www.newzimbabwe.com/can-zimbabwean-immigrants-avail-sassa-grant-eligibility-guidelines-explained/",
            "content": "South Africas Social Security Agency (SASSA) provides financial assistance to citizens and qualifying residents through various grant programs. These include child support grants, disability grants, old age pensions, and more. But a common question that arises especially among migrants is: Can Zimbabwean immigrants avail SASSA grants?\n\nThis article aims to provide a clear, updated, and SEO-friendly explanation of whether Zimbabwean nationals living in South Africa are eligible for SASSA grants, what types of permits are required, and what alternatives are available for those who are not eligible.\n\nThe South African Social Security Agency (SASSA) is responsible for distributing social grants to help vulnerable individuals and families meet their basic needs. Grants include:\n\nThese grants are primarily meant for South African citizens, but certain categories of non-citizens may also qualify.\n\nCan Zimbabwean Immigrants Qualify for SASSA Grants?\n\nThe short answer is: Not all Zimbabwean immigrants are eligible for SASSA grants, but some may qualify under specific conditions. You can alsoCheck Sassa Statusfor eligibility.\n\nTo qualify for most SASSA grants, an applicant must meet the following criteria:\n\nZimbabwean immigrants in South Africa fall into different legal categories. Heres how that affects their SASSA eligibility:\n\nZimbabweans who have been granted refugee status (under Section 24 of the Refugees Act) are eligible for most SASSA grants. Refugees are treated the same as citizens under South African law for social security purposes.\n\nZEP holders are not eligible for SASSA grants. This is because the ZEP is a special temporary permit that does not confer permanent residency or refugee status.\n\nEven if a ZEP holder lives and works in South Africa legally, they do not meet the criteria for social grants.\n\nAsylum seekers holding Section 22 permits are also not eligible for most SASSA grants. This is because their status is temporary, and their applications for refugee status are still being processed.\n\nIf a Zimbabwean has been granted permanent residency, they become eligible to apply for SASSA grants, just like South African citizens. However, permanent residency is a long and complex process.\n\nSASSA Grants Zimbabweans May Qualify For\n\nHere are some grants that Zimbabwean immigrantsmayaccess under certain conditions:\n\nDuring the COVID-19 pandemic, the SRD grant (R350 grant) was introduced. Initially, it was only for South African citizens, but later expanded to include refugees and asylum seekers with valid documentation from Home Affairs.\n\nWhile this grant was temporary, the SRD R370 grant has replaced it. As of 2024, it is still limited to:\n\nZimbabwean refugees or permanent residents with children may apply for the Child Support Grant, provided:\n\nIf a Zimbabwean refugee or permanent resident wants to apply for a SASSA grant, they will need:\n\nOnly recognized refugees and permanent residents can receive grantsnot all immigrants.\n\nThe ZEP (Zimbabwean Exemption Permit) is not equivalent to permanent residency and does not make the holder eligible for SASSA grants.\n\nSince Zimbabwean Exemption Permit holders are not eligible for SASSA grants, here are a few alternatives:\n\nOrganizations likeDoctors Without Borders (MSF),Scalabrini Centre, andGift of the Giversprovide food, housing, and basic needs support to migrants in need.\n\nZEP holders are legally allowed to work in South Africa. Seeking employment or freelance opportunities can help sustain financial needs.\n\nSome Zimbabwean community associations and churches in South Africa provide assistance to struggling families.\n\nNo. Work permits, including the Zimbabwean Exemption Permit (ZEP), do not qualify you for SASSA grants.\n\nOnly if they areSouth African citizensorrefugees. Children born to ZEP holders are not automatically granted citizenship.\n\nCan asylum seekers from Zimbabwe apply for the R370 grant?\n\nOnly under special temporary rulings. Most are not eligible unless otherwise stated by SASSA or government policy.\n\nWhile Zimbabwean immigrants contribute significantly to South African society, their eligibility for SASSA grants is limited. Only those with refugee status or permanent residency may legally access these social welfare benefits. ZEP holders and asylum seekers remain excluded, though they may access help through NGOs and community support networks.\n\nIf youre unsure about your status or rights, consult with legal aid organizations or visit your local SASSA office for accurate guidance.\n\n",
            "image_url": null,
            "description": "<p>South Africa’s Social Security Agency (SASSA) provides financial assistance to citizens and qualifying residents through various grant programs. These include child support grants, disability grants, old age pensions, and more. But a common question that arises especially among migrants is: Can Zimbabwean immigrants avail SASSA grants? This article aims to provide a clear, updated, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/can-zimbabwean-immigrants-avail-sassa-grant-eligibility-guidelines-explained/\">Can Zimbabwean Immigrants Avail SASSA Grant? Eligibility & Guidelines Explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        },
        {
            "title": "Dynamos pleads with fans for patience as new players “settle down”",
            "url": "https://www.newzimbabwe.com/dynamos-pleads-with-fans-for-patience-as-new-players-settle-down/",
            "content": "By Sports Reporter\n\nDynamos Football Club has asked fans to be patient with the team, which is posting poor results in the ongoing campaign.\n\nDembare has only managed one win out of the nine games they have played this season, the other eight being 5 draws and 3 defeats.\n\nThe Harare giants experienced a mass exodus of players ahead of the current season, losing more than 10 senior players.\n\nIn a press statement, Dynamos executive urged fans to be patient and give the new players room to adjust.\n\nDynamos Football Club is aware of the concerns and frustrations that our valuable fans have endured week in week out in the wake of seemingly elusive expected results for the league matches the team has played so far.\n\nThe new players who joined the club this season require support and patience as they settle down into a club with high expectations and performance standards.\n\nWe would like to appeal to our legion of fans to remain calm and patient during this period, read part of Dynamos press statement.\n\nDynamos urged fans to come in numbers for their match against Scottland on Sunday at Rufaro.\n\nThe club is deeply indebted to the fans and their leadership for their unwavering support that they have continued to demonstrate during this dark phase.\n\nAs match day 10 against Scotland FC beckons, we appeal to the fans to come out in their numbers in support of the team, further read the statement.\n\nDembare walks into the clash coming from a nil-all draw against Green Fuel in Chisumbanje on Wednesday.\n\nThe Harare giants are currently on position 14 with 8 points, three ahead of bottom-place occupiers Triangle, which is occupying position 18.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/24052151/dynamos-google-supporter.png",
            "description": "<p>By Sports Reporter Dynamos Football Club has asked fans to be patient with the team, which is posting poor results in the ongoing campaign. Dembare has only managed one win out of the nine games they have played this season, the other eight being 5 draws and 3 defeats. The Harare giants experienced a mass</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-pleads-with-fans-for-patience-as-new-players-settle-down/\">Dynamos pleads with fans for patience as new players “settle down”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:26",
            "date": "03 May 2025"
        }
    ]
}