{
    "news": [
        {
            "title": "Top US legislator says extending Mnangagwa’s term will erode Zimbabwe’s democracy",
            "url": "https://www.newzimbabwe.com/top-us-legislator-says-extending-mnangagwas-term-will-erode-zimbabwes-democracy/",
            "content": "By Leopold Munhende\n\nGREGORY Meeks, the American governments House Committee Representative Responsible for Foreign Policy Legislation and Oversight, has warned that extending President Emmerson Mnangagwas term could seriously harm Zimbabwes democratisation foundation.\n\nEfforts to lengthen Mnangagwas second term in office have been sped up by his party, Zanu PF, with recent reports indicating a plan to suspend the 2028 elections up till 2030.\n\nThe move is part of broader factional fights that have once again gripped the ruling party as Mnangagwas term draws to a close.\n\nHis deputy, Constantino Chiwenga, is in a tug of war for power against Mnangagwas preferred successor, Kudakwashe Tagwirei.\n\nSharing on X, formerly Twitter, Meeks reminded users that Mnangagwa once swore to uphold democratic process and respect the two-term limits imposed by Zimbabwes constitution.\n\nRep. Gregory Meeks\n\nPresident Mnangagwa swore to strengthen the pillars of Zimbabwes democracy and accept term limits. Extending his term would erode that foundation, said Meeks.\n\nRM@RepGregoryMeeks: President Mnangagwa swore to strengthen the pillars of Zimbabwes democracy and accept term limits. Extending his term would erode that foundation.https://t.co/ETRIY4h7ez\n\n House Foreign Affairs Committee Dems (@HouseForeign)October 22, 2025\n\nAlthough consensus on Mnangagwas term extension is yet to be achieved within the party, a resolution from the partys 2024 National Peoples Conference to amend the constitution to pave the way for it, has been acknowledged.\n\nThe recent conference demanded that the process be set in motion immediately.\n\nMnangagwa had in the past distanced himself from supporters who were calling on him to hang on to power.\n\nI will persuade the persuaders not to persuade me, he told editors at a meeting he held with them at State House last year.\n\nZanu PF is currently exploring routes by which it can amend two sections of the Zimbabwean constitution without going for a referendum so as to ensure Mnangagwas stay.\n\nThe two sections giving them headaches are Section 91(2) which sets a two-term limit for the top office and Section 328(7) that says an incumbent cannot benefit from any such amendment.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005736/SONA-1-Mnangagwa.png",
            "description": "<p>By Leopold Munhende GREGORY Meeks, the American government’s House Committee Representative Responsible for Foreign Policy Legislation and Oversight, has warned that extending President Emmerson Mnangagwa’s term could seriously harm Zimbabwe’s democratisation foundation. Efforts to “lengthen” Mnangagwa’s second term in office have been sped up by his party, Zanu PF, with recent reports indicating a plan</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-us-legislator-says-extending-mnangagwas-term-will-erode-zimbabwes-democracy/\">Top US legislator says extending Mnangagwa’s term will erode Zimbabwe’s democracy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "23 Oct 2025"
        },
        {
            "title": "Feli Nandi to lead an all female historic concert",
            "url": "https://www.newzimbabwe.com/feli-nandi-to-lead-an-all-female-historic-concert/",
            "content": "By Darlington Gatsi\n\nA piece of history will be etched into the entertainment industry when the Harare International Convention Centre (HICC) hosts an all-female headlined concert next month.\n\nDubbed Nubian Notes, the concert will celebrate and honour the voices of Zimbabwean female artists who continue to shape the entertainment industry.\n\nThe concert will be headlined by Feli Nandi, Tamy Moyo, Gemma Griffiths, Shashl, and Nisha Ts.\n\nMulti-award-winning musician Feli Nandi said the historic concert is a statement of intent by the female contingent.\n\nIt is such a great honour and an awesome privilege. All I can say is that it was about time. We are so ready to show that women can definitely do it too. This platform is not just a performance; it is a statement that women belong at the forefront of our music scene, said Feli Nandi.\n\nThe concert, which is being hosted by Gateway Stream in collaboration with ZAR Events, will be held on 8 November.\n\nTamy Moyo said the concert will debunk industry stereotypes that have seen women playing second fiddle to their male counterparts.\n\nIt is powerful to stand among women who are rewriting the story of creativity. This show celebrates our strength, softness, and individuality. It reminds me that feminine expression deserves to take up space, unapologetically.\n\nMy set is inspired by womanhood. Its strength, vulnerability and rhythm. I want the audience to feel seen, to leave with hearts full and spirits lifted. Every song tells a piece of that shared story.\n\nWomen are no longer waiting for doors to open; we are building new ones. We are redefining leadership, style, and creativity with authenticity and power. The industry feels more honest because of it, said Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/08150342/Feli-Nandi.jpg",
            "description": "<p>By Darlington Gatsi A piece of history will be etched into the entertainment industry when the Harare International Convention Centre (HICC) hosts an all-female headlined concert next month. Dubbed ‘Nubian Notes’, the concert will celebrate and honour the voices of Zimbabwean female artists who continue to shape the entertainment industry. The concert will be headlined</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/feli-nandi-to-lead-an-all-female-historic-concert/\">Feli Nandi to lead an all female historic concert</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "23 Oct 2025"
        },
        {
            "title": "Least paid employee in Real Estate sector to earn US$305",
            "url": "https://www.newzimbabwe.com/least-paid-employee-in-real-estate-sector-to-earn-us305/",
            "content": "By Alois Vinga\n\nTHE least paid employee in the Real Estate, Distribution and Clearing sub-sectors will be taking home US$305 in monthly salaries following a recent pay rise.\n\nThe details are contained in that Collective Bargaining Agreement (CBA) reached by negotiating parties in the commercial sector.\n\nI hereby inform you that the Commercial Workers Union of Zimbabwe and the National Employers Association of Zimbabwe have completed wage negotiations for the Distribution, Storage, Clearing Agents and Real Estate subsector for the period 1 July 2025 to 31 December 2025, the NEC, Commercial Sectors, General Secretary, Given Chibaya, said in a letter addressed to all NECs.\n\nLow-ranking grades, Grade 1 (a), will be pocketing US$305, while mid-level workers in grades 5 and 6 are earning between US$357 and US$366 with those falling under grades 11 and 12 will be earning US$357 and US$366.\n\nEmployers in grade 1 (b) are employees who have completed two or more years of continuous service with the same employer as at 1st July 2025, the NEC said.\n\nAll increases awarded to employees from 1st of January 2025 may be taken into account when implementing the new COLA, on condition that if the adjustment awarded falls short of the CBAs specified COLA, the affected employees shall receive further increases in the form of the difference between the stipulated COLA and the increases already awarded.\n\nEffective 1st July 2025 to 31st December 2025, all employees earning below US$533 of ZWG equivalent at the prevailing RBZ rate shall pay a levy of 1% with the employer contributing the same amount. Those employees earning above US$533 or ZWG equivalent at the prevailing RBZ rate shall pay a maximum levy of US$5,53 or ZWG equivalent at the prevailing RBZ, with the employer contributing the same amount, the NEC added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23062534/realestate.jpg",
            "description": "<p>By Alois Vinga THE least paid employee in the Real Estate, Distribution and Clearing sub-sectors will be taking home US$305 in monthly salaries following a recent pay rise. The details are contained in that Collective Bargaining Agreement (CBA) reached by negotiating parties in the commercial sector. “I hereby inform you that the Commercial Workers Union</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/least-paid-employee-in-real-estate-sector-to-earn-us305/\">Least paid employee in Real Estate sector to earn US$305</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "23 Oct 2025"
        },
        {
            "title": "Blow for Dynamos as Denver Mukamba is ruled out of Chibuku Cup semi-final clash against Highlanders",
            "url": "https://www.newzimbabwe.com/blow-for-dynamos-as-denver-mukamba-is-ruled-out-of-chibuku-cup-semi-final-clash-against-highlanders/",
            "content": "By Sports Reporter\n\nDynamos FC have suffered a major setback ahead of Sundays Chibuku Super Cup semi-final, with star midfielder Denver Mukamba ruled out through suspension.\n\nMukamba, who has been instrumental since rejoining the club in July, will miss the crucial encounter after accumulating five yellow cards, triggering an automatic one-match ban under league regulations.\n\nDynamos will also be without striker Jairos Kasondo, who is suspended for the same reason. Kasondo was Dembares hero last Sunday, scoring the equaliser in their 11 draw against Highlanders at Barbourfields Stadium.\n\nThe semi-final showdown comes as both traditional giants search for redemption following inconsistent league performances that have left them hovering near the lower half of the table.\n\nHead-to-head in league competitions, Dynamos have not beaten Highlanders in open play since 2015, adding extra pressure ahead of Sundays clash.\n\nHowever, Dembare have already made history by becoming the first team to reach the Chibuku Super Cup semi-finals for three consecutive seasons, a feat they will be hoping to build on despite the absence of two key players.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/23062100/mukamba_denver.jpg",
            "description": "<p>By Sports Reporter Dynamos FC have suffered a major setback ahead of Sunday’s Chibuku Super Cup semi-final, with star midfielder Denver Mukamba ruled out through suspension. Mukamba, who has been instrumental since rejoining the club in July, will miss the crucial encounter after accumulating five yellow cards, triggering an automatic one-match ban under league regulations.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/blow-for-dynamos-as-denver-mukamba-is-ruled-out-of-chibuku-cup-semi-final-clash-against-highlanders/\">Blow for Dynamos as Denver Mukamba is ruled out of Chibuku Cup semi-final clash against Highlanders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:43",
            "date": "23 Oct 2025"
        }
    ]
}