{
    "news": [
        {
            "title": "Young Chevrons lose second Youth ODI tri-series match to Bangladesh",
            "url": "https://www.newzimbabwe.com/young-chevrons-lose-second-youth-odi-tri-series-match-to-bangladesh/",
            "content": "By Sports Reporter\n\nZimbabwe mens under-19 cricket team on Monday lost their second Youth ODI tri-series match to Bangladesh by 91 runs.\n\nThe defeat came on the back of a humiliating 273-run defeat on Friday to South Africa in the opening match of the series.\n\nHaving won the toss, Zimbabwe opted to bowl in the first innings, in which Bangladesh racked 278 runs.\n\nBangladeshs opening batsman Zawad Abrar was too hot to handle for Zimbabwe as he amassed 83 runs , recording the highest individual runs for his side.\n\nComing back to the second innings, Zimbabwe were poor with the bat, as they were bowled out with 183 runs in 42.2 overs.\n\nThe Young Chevrons best batsman of the day was Nathaniel Hlabangana, who managed 53 runs off 72 balls.\n\nZimbabwe had half of its batsmen posting less than ten runs: Simbarashe Mudzengerere (0) , Tatenda Chimugoro (1), Panashe Mazai (0), Shelton Mazvitorera (0) and Tatenda Banda (7).\n\nMondays result saw Zimbabwe maintaining its place at the bottom of the log table, while Bangladesh were propelled to go on top of the table with two wins from two matches, followed by South Africa with one win.\n\nThe Young Chevrons will be back in action on Tuesday when they play South Africa in a return fixture, which they will be hoping to turn the tables following a 278-run defeat in the first match last week.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28223846/young-chevrons-bangladesh.jpg",
            "description": "<p>By Sports Reporter Zimbabwe men’s under-19 cricket team on Monday lost their second Youth ODI tri-series match to Bangladesh by 91 runs. The defeat came on the back of a humiliating 273-run defeat on Friday to South Africa in the opening match of the series. Having won the toss, Zimbabwe opted to bowl in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-chevrons-lose-second-youth-odi-tri-series-match-to-bangladesh/\">Young Chevrons lose second Youth ODI tri-series match to Bangladesh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:15",
            "date": "29 Jul 2025"
        },
        {
            "title": "Beyonce’s ‘Cowboy Carter’ becomes highest-grossing country tour ever",
            "url": "https://www.newzimbabwe.com/beyonces-cowboy-carter-becomes-highest-grossing-country-tour-ever/",
            "content": "Beyonces Cowboy Carter tour is now the highest-grossing country tour of all time with over $400 million in revenue, Live Nation said in a statement on Monday, citing a Billboard story.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28223145/Beyonce-1200x799-1.jpg",
            "description": "<p>Reuters Beyonce’s “Cowboy Carter” tour is now the highest-grossing country tour of all time with over $400 million in revenue, Live Nation said in a statement on Monday, citing a Billboard story. The “Cuff It” singer has also become the highest-grossing Black artist of all time and the highest-grossing R&B artist of all time, Live</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/beyonces-cowboy-carter-becomes-highest-grossing-country-tour-ever/\">Beyonce’s ‘Cowboy Carter’ becomes highest-grossing country tour ever</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:15",
            "date": "29 Jul 2025"
        },
        {
            "title": "Elephants trample soldier to death near Beitbridge border post",
            "url": "https://www.newzimbabwe.com/elephants-trample-soldier-to-death-near-beitbridge-border-post/",
            "content": "SowetanLive\n\nA South African soldier on border patrol has been trampled to death by a herd of elephants in Limpopo near Zimbabwe.\n\nThe incident happened on Sunday night near the banks of the Limpopo River in Musina, about 300m from the SANDFs Madimbo operational base.\n\nPrivate Xavier Raynard was doing routine patrols on the Malala Drift road when he was killed.\n\nThe SANDF went to collect his remains on Monday.\n\nSANDF spokesperson Prince Tshabalala said Raynard, a member of the 10 Anti-Aircraft Regiment, who was deployed under Operation Corona,was found dead near the base.\n\nEarly indications suggest that he may have been fatally trampled by a herd of elephants while conducting routine patrols in the area. His service weapon was recovered at the scene.\n\nThe matter is under investigation by SANDF authorities in co-operation with environmental and wildlife officials to determine the exact circumstances surrounding the incident. A formal board of inquiry has been initiated, said Tshabalala.\n\nTshabalala said Raynards next of kin, from Kimberley, Northern Cape, have been formally notified, and psychosocial support is being provided to the family and his unit members.\n\nOperation Corona is a national border safeguarding initiative aimed at combating transnational crimes along the countrys borders.\n\nTshabalala said that soldiers deployed in these operations face harsh terrain, isolation and exposure to unpredictable natural conditions.\n\nLauren Liebenberg from the Vhembe Biosphere Reserve said:At this time of year, the crisis with the elephant populations that roam the Limpopo River Valley intensifies.When elephant hunting starts in the dry season they come across the Limpopo River [into SA] in huge numbers, she said, adding that the elephants neededa well-managed migration corridor.\n\nThe problem extends along the whole length of the 200km strip between Mapungubwe and Kruger National Park. We become a massive human-wildlife conflict zone.\n\nLiebenberg said a programme by the US Agency for International Development to manage the problem collapsed after the US administration cancelled it earlier this year.\n\nThrough the programme, they trained elephant herders and provided all sorts of defence interventions.\n\nDeaths still remain rare and at the extreme end of the human wildlife conflict interface, but the elephants do massive damage to crops, to infrastructure  especially fencing and water infrastructure, and to the natural vegetation in the nature reserves, said Liebenberg.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28221348/raynard-.png",
            "description": "<p>SowetanLive A South African soldier on border patrol has been trampled to death by a herd of elephants in Limpopo near Zimbabwe. The incident happened on Sunday night near the banks of the Limpopo River in Musina, about 300m from the SANDF’s Madimbo operational base. Private Xavier Raynard was doing routine patrols on the Malala</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elephants-trample-soldier-to-death-near-beitbridge-border-post/\">Elephants trample soldier to death near Beitbridge border post</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:15",
            "date": "29 Jul 2025"
        },
        {
            "title": "Zim activist Duke Maplanka Atterbell criticises South Africa’s treatment of foreign nationals",
            "url": "https://www.newzimbabwe.com/zim-activist-duke-maplanka-atterbell-criticises-south-africas-treatment-of-foreign-nationals/",
            "content": "IOL\n\nZimbabwean activist Duke Maplanka Atterbell says the South African government is complicit in systemic discrimination against foreign nationals and has failed to act in the face of escalating xenophobic violence and medical exclusion.\n\nIn a formal letter dated 27 July 2025, addressed toPresident Cyril Ramaphosa,Minister of health,Minister of home affairsand theSouth African Human Rights Commission, Atterbell accused the state of both silence and active neglect, warning of formal complaints to African and international human rights bodies if urgent action is not taken.\n\nI write this letter as both a concerned African citizen and a representative voice of thousands of foreign nationals, especially Zimbabweans, living in South Africa, Atterbell said.\n\nHe described a worsening situation where foreign nationals are being chased out of hospitals, clinics, and even maternity wards. Others are beaten in the streets, publicly humiliated, or threatened by vigilantes emboldened by government silence.\n\nHis letter denounced what he calls a double standard in South Africas global human rights stance, referencing Pretorias condemnation of injustice abroad while allegedly turning a blind eye at home.\n\nHow can South Africa claim the mantle of human rights defender abroad, while at home it presides over de facto ethnic cleansing through economic and medical exclusion? This hypocrisy is staggering, he said.\n\nAtterbell warned that if no action is taken, he will escalate the matter by filing complaints with the African Commission on Human and Peoples Rights, the UN Special Rapporteur on the Right to Health, the UN Committee on the Elimination of Racial Discrimination, and the South African Human Rights Commission.\n\nHe also promised to engage in public advocacy and international media exposure.\n\nThis is not governance, it is abandonment, he wrote. This is not the South Africa that the continent stood behind during the anti-apartheid struggle. This is not Ubuntu.\n\nAtterbells appeal comes amid rising tensions in the country over undocumented migration, especially concerning access to jobs and healthcare.In March 2024, radio personality Jacinta Ngobese-Zumalaunched March and March, a non-governmental organisation that actively campaigns against the employment and public healthcare access of undocumented foreign nationals in South Africa.\n\nWhat began in KwaZulu-Natal has now spread nationally, with March and March volunteers stationed at entrances of hospitals including Addington Hospital, RK Khan Hospital, and various Gateway Clinics across the province. The group screens patients before entry, turning away those unable to produce South African ID documents.\n\nWe operate where the government has failed, the group has said. While critics have labelled it a vigilante operation targeting vulnerable people, the organisation continues to draw strong support from South Africans who believe hospitals are being overrun by foreigners.\n\nResponding to Atterbells letter, Ngobese-Zuma posted on Facebook:He is Zimbabwean and writes to OUR President and not HIS Kshuthi ngampela they believe they are South African Kshuthi we owe them Kshuthi we must intensify our fight because mentally these ppl dont think that we are serious.\n\n(Translated : He is Zimbabwean and writes to OUR President and not HIS Maybe, seriously, they believe they are South African! Maybe we owe them! Maybe we must intensify our fight because mentally these people dont think that we are serious.)\n\nAtterbell was quick to respond addressing Ngobese-Zuma in defiant terms.\n\nWhen Dudula royalty thinks they can intimidate you, he said, in reference to her association with nationalist movements. Jacinta Zinhle MaNgobese Zuma, lets get one thing straight. I am not here to bow before self-appointed foot soldiers of hate.\n\nI am an enigma, not because I hide, but because I refuse to allow you to spread your bitter view of patriotism unchecked. I am a fearless advocate for human rights, not because its easy, but because people like you have made silence a weapon. And yes, I am a hater of bigotry  proudly, loudly, and unapologetically.\n\nHe continued, accusing Ngobese-Zuma of masking fear as nationalism: You walk around with your chest puffed out like youre some gatekeeper of South Africas soul. But what you really are is a loud emblem of fear, disguised as pride. You lead mobs, I lead with conscience. You shout in mobs, I speak in truth. You weaponise suffering, I document it.\n\nAddressing her direct challenge, Atterbell wrote: You asked, Who are you? Let me answer clearly: I am the one your hate cannot reach and your intimidation cannot shake.\n\nI am the storm you didnt see coming, and the voice youll wish you hadnt tried to silence. Because while you scream for borders, I fight for bridges. While you hunt the vulnerable, I summon accountability. And while you wave your flag with fury, I carry the Constitution with fire.\n\nSo no, MaNgobese. I wont be quiet. Not now. Not ever, said Atterbell.\n\nAtterbell, however, insists that the fight is not against South Africa, but for human dignity.\n\nIf your government fails to act, history, and international law, will remember it not for its silence, but for its complicity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28222300/march-movement.png",
            "description": "<p>IOL Zimbabwean activist Duke Maplanka Atterbell says the South African government is complicit in systemic discrimination against foreign nationals and has failed to act in the face of escalating xenophobic violence and medical exclusion. In a formal letter dated 27 July 2025, addressed to President Cyril Ramaphosa, Minister of health, Minister of home affairs and the South African Human Rights</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-activist-duke-maplanka-atterbell-criticises-south-africas-treatment-of-foreign-nationals/\">Zim activist Duke Maplanka Atterbell criticises South Africa’s treatment of foreign nationals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:15",
            "date": "29 Jul 2025"
        },
        {
            "title": "Mnangagwa declares Glenview Area 8 Home Industry inferno a national disaster, refurbishment to start in September",
            "url": "https://www.newzimbabwe.com/mnangagwa-declares-glenview-area-8-home-industry-inferno-a-national-disaster-refurbishment-to-start-in-september/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has declared the Glen View Area 8 complex fire, which destroyed goods worth over US$100,000 a national disaster.\n\nThis was revealed by Local Government Minister, Daniel Garwe, on Monday, adding that the government was now moving in to assist the affected traders.\n\nOnce the President has declared a state of disaster the department of Civil Protection under the Ministry of Local Government will move in and mobilise resources and assist those that have been affected, we are now working with the City of Harare, Ministry of Women Affairs and the affected traders so that we have a comprehensive list of those that were affected so that we come up with a way of assisting them, he said.\n\nGarwe added that refurbishment of the complex will start in September, targeting completion by April 2026.\n\nWe are hoping that before Indepence (April 18) next year, beginnning of March or beginning of April we will be able to invite the President to come and commission a transformed Glew View area 8 with properly laid out areas with different shops because we cant have one roof covering over 5 hectares so we want to have different shops, a road network, electricity, water and sewer reticlutaionn properly done.\n\nThis is not the first time a fire has happened at the home industry, and this is now the 10th fire to break out at the complex since 2015.\n\nCity of Harare SMEs Committee Chairperson, Councillor Denford Ngadziore, said preliminary investigations suggest the fire was started by security guards who lit a fire to keep warm near easily flammable materials.\n\nSpeaking during a visit to the site on Monday, Small and Medium Enterprises (SMEs) Minister Monica Mutsvangwa said authorities are working together to assist affected families and find lasting solutions to the recurring fires.\n\nThere is no them and us, we must all unite to end this problem at GlenView 8.\n\nWe have a committee which involves the Local Ministry, Civil Protection Unit, City Council, SMEs ministry and other relevant authorities working on assessments of the damage and finding solutions and how we can help the families that have been affected, Mutsvangwa said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/27095435/DsbQMjIWwAAcLd2_1.jpeg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has declared the  Glen View Area 8 complex fire, which destroyed goods worth over US$100,000 a national disaster. This was revealed by Local Government Minister, Daniel Garwe, on Monday, adding that the government was now moving in to assist the affected traders. “Once the President has declared a state</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-declares-glenview-area-8-home-industry-inferno-a-national-disaster-refurbishment-to-start-in-september/\">Mnangagwa declares Glenview Area 8 Home Industry inferno a national disaster, refurbishment to start in September</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:15",
            "date": "29 Jul 2025"
        }
    ]
}