{
    "news": [
        {
            "title": "Mnangagwa orders by-election to fill vacant Nkulumane seat",
            "url": "https://www.newzimbabwe.com/mnangagwa-orders-by-election-to-fill-vacant-nkulumane-seat/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has ordered a by-election to choose a new legislator for Nkulumane constituency in Bulawayo.\n\nThe proclamation follows the death, on October 10, of then Member of Parliament (MP) Desire Moyo, who tragically died after his car hit an elephant along the Gweru-Bulawayo highway on his way from Parliament.\n\nMoyo, popularly known as Moyoxide, was from the opposition Citizens Coalition for Change (CCC), and served in Parliaments sport, recreation, arts and culture committee.\n\nThe Speaker of Parliament, Jacob Mudenda, formally notified Mnangagwa of the vacancy on October 31.\n\nThrough Proclamation 6 of 2025 issued this week, Mnangagwa decreed a by-election to fill the vacant Nkulumane National Assembly seat.\n\nWhereas it is provided by section 39(2) of the Electoral Act (Chapter 2:13), that after the President has been notified in terms of the said section of vacancies in the membership of Parliament, he shall issue a proclamation ordering a new election to fill the vacancies in the same manner, mutatis mutandi, as provided in section 38 of the said Act in regard to a general election, reads Statutory Instrument (SI) 169A of 2025.\n\nPursuant to fulfilling the provisions of the law, November 20, 2025, has been set as nomination day at the Magistrates Court in Bulawayo, while voting will be conducted on December 20, 2025, should there be more than one eligible candidate.\n\nThe countrys Electoral Act mandates the President to call a by-election within 90 days of being informed of a parliamentary vacancy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/07033715/Desire-Moyo-Parliament-1280px-t.webp",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has ordered a by-election to choose a new legislator for Nkulumane constituency in Bulawayo. The proclamation follows the death, on October 10, of then Member of Parliament (MP) Desire Moyo, who tragically died after his car hit an elephant along the Gweru-Bulawayo highway on his way from Parliament. Moyo,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-orders-by-election-to-fill-vacant-nkulumane-seat/\">Mnangagwa orders by-election to fill vacant Nkulumane seat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "07 Nov 2025"
        },
        {
            "title": "Top Ibhetshu LikaZulu official resigns after once-vibrant pressure group goes to bed with Zanu PF",
            "url": "https://www.newzimbabwe.com/top-ibhetshu-likazulu-official-resigns-after-once-vibrant-pressure-group-goes-to-bed-with-zanu-pf/",
            "content": "By Leopold Munhende\n\nGIFFORD Sibanda, the Ibhetshu LikaZulu spokesperson, has resigned from the once vibrant pressure group following revelations that Secretary General Mbuso Fuzwayo is now working hand in glove with Zanu PF to ensure President Emmerson Mnangagwas ambitions for a term extension are realised.\n\nThe group, which in the past was declared a public enemy with some of its members arrested and locked up for standing up to the Zanu PF government, is the second applicant in a Constitutional Court application veiled as an attempt to stop Mnangagwas 2030 plan.\n\nSengezo Tshabangus lawyer, Nqobile Sithole and Method Ndlovu are representing Fuzwayo and Ibhetshu LikaZulu.\n\nAccording to reports, Sibandas resignation emanates from knowledge that Fuzwayo has been tasked to challenge the illegal attempts to have Mnangagwa hang on, and lose.\n\nThis will thereby open avenues for Zanu PFs resolution to extend his second term actionably without any legal hindrances and possible challenges.\n\nThis, however, remains unconfirmed as Fuzwayos number was not going through when NewZimbabwe.com sought to get his comment on the allegations. His WhatsApp number was also not receiving messages.\n\nIt is with a heavy heart that I tender my resignation from Ibhetshu LikaZulu, effective immediately, reads Sibandas letter to Fuzwayo.\n\nThis decision comes after deep reflection on the current direction and approach the organisation has taken in the struggle against Zanu PF.\n\nUnfortunately, I find that this route diverges from my own beliefs, principles, and the foundational values that Ibhetshu LikaZulu has long stood for.\n\nThis is not an easy decision. Ibhetshu LikaZulu has been a home of conscience and courage  a movement that stood firmly with the oppressed and gave voice to the voiceless.\n\nSibanda and Fuzwayo had been comrades in arms for years, in the trenches against first late President Robert Mugabe and his harsh Zanu PF regime to the current.\n\nA resolution by Zanu PF last year mandated the partys secretary for justice to initiate the process that will extend Mnangagwas second and final term, which is supposed to end in 2028. The party wants it lengthened to 2030.\n\nThe involvement of exiled former minister in Mugabes government, Jonathan Moyo, has raised the stakes as he is a known strategist and thinker.\n\nThe resolution, which has threatened to split the revolutionary institution and riddled it with factional fights, was reinforced at its recent Peoples Conference hosted in Mutare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/22205448/Mbuso-Fuzwayo.jpg",
            "description": "<p>By Leopold Munhende GIFFORD Sibanda, the Ibhetshu LikaZulu spokesperson, has resigned from the once vibrant pressure group following revelations that Secretary General Mbuso Fuzwayo is now working hand in glove with Zanu PF to ensure President Emmerson Mnangagwa’s ambitions for a term extension are realised. The group, which in the past was declared a public</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/top-ibhetshu-likazulu-official-resigns-after-once-vibrant-pressure-group-goes-to-bed-with-zanu-pf/\">Top Ibhetshu LikaZulu official resigns after once-vibrant pressure group goes to bed with Zanu PF</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "07 Nov 2025"
        },
        {
            "title": "Robert Mugabe Jnr issued with arrest warrant",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand.\n\nHarare magistrate Lisa Mutendereki issued the warrant after Mugabes name was called three times with no response.\n\nMugabe who is out on bail, was arrested last month for unlawful possession of dagga. He was nabbed during a police traffic blitz after driving against a one-way street along Second Street Extension in Harare.\n\nProsecutors allege police recovered two sachets of dagga, a pack of rizla, and a dagga crusher from his sling bag. The drugs, weighing two grams and valued at US$30, were verified at Harare Main Post.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand. Harare magistrate Lisa Mutendereki issued the warrant after Mugabe’s name was called three times with no response. Mugabe who is out on bail,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/\">Robert Mugabe Jnr issued with arrest warrant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "07 Nov 2025"
        },
        {
            "title": "Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nA GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora.\n\nMwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling partys controversial resolution to extend President Emmerson Mnangagwas tenure to 2030 or beyond.\n\nIn a statement, the opposition party saidthe attackers armed with guns were donning Zanu PF regalia.\n\nMwonzora had made a brief stop at the MDC Bulawayo Provincial Office to address party members and journalists on Zanu PFs Agenda 2030.\n\nYesterday a group of Zanu PF vigilantes calling themselves Boys  dzaMudhara disrupted a peaceful meeting of the MDC in Bulawayo. We shall never bow down to thuggery. Our fight against desecration of our constitution and the 2030 agenda will be intensified.pic.twitter.com/yHJnTicoqS\n\n Sen Douglas Mwonzora (@DMwonzora)November 6, 2025\n\nTrouble reportedly started after Mwonzora finished addressing journalists.\n\nSoon after the members of the Press left, members of the police mainly from PISI and CID and youths wearing Zanu PF regalia entered the office from the back door, numbering about 20, armed with guns and knives and started dismissing people as they advanced towards the MDC leader threateningly.\n\nThey were chanting 2030 ino budirira chete (The 2030 agenda will succeed), said the opposition.\n\nA stampede then followed as members of the security whisked away the president (Mwonzora).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter A GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora. Mwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling party’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/\">Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:10",
            "date": "07 Nov 2025"
        }
    ]
}