{
    "news": [
        {
            "title": "Zimbabwe to work with Russia, IAEA to establish nuclear energy",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-work-with-russia-iaea-to-establish-nuclear-energy/",
            "content": "VOA\n\nZimbabwe is working with the International Atomic Energy Agency and Russian investors to establish nuclear energy as part of its efforts to end the countrys chronic power shortages, government officials said Thursday.\n\nThe nation has expressed its interest in nuclear power to the IAEA, said Edgar Moyo, Minister of Energy and Power Development, and hopes to develop small, modular reactors.\n\nThey have indicated their willingness to take us through paces until we get there, Moyo told journalists.\n\nEstablishing nuclear power is expensive and complex, said Joseph Siegle, the director of research at the Africa Center for Strategic Studies in Washington, which is the reason countries such as South Africa and Egypt have sought Russias assistance.\n\nThe process is also ripe for corruption, he said, so transparency is critical.\n\nMost economists would argue that those deals cost far more than are warranted for the benefits that they would provide to their economies and to their societies, Siegle said, and so theres a worry that these huge infrastructure projects become a source of corruption, both in the country where it is being built, but also vis-a-vis the state-owned enterprises that the Russians provide to build the plant.\n\nIn the end, it becomes the public in the country that is building the plant that would be responsible for paying off these costs, he said.\n\nZimbabwe says its goal is to have 4,000 megawatts of power capacity by 2035 and end years of power cuts that can sometimes last up to 18 hours per day.\n\nSiegle said Zimbabwes power needs do not warrant a traditional large-scale nuclear reactor and suggested that the government study the lasting impact of waste disposal.\n\n[This] has always been a concern with nuclear energy  what you do with the waste, which requires some 10,000 years for the radioactive elements to decay and not pose a health risk to society, he said.\n\nNuclear power also heightens security risks, Siegle said.\n\nGloria Magombo, secretary for energy and power development, said at the media briefing that Zimbabwe aims to increase the use of other renewable energies besides hydropower, given the nations recurring droughts.\n\nShe mentioned solar, wind and mini-hydro stations.\n\nWe are we are looking at coming in by 2030 with up to about 2,000 megawatts from those sources, Magombo said.\n\nZimbabwes current capacity for power generation is about 2,600 megawatts, according to the government. The actual daily generation is roughly half of that.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31212646/Edgar-Moyo.webp",
            "description": "<p>VOA Zimbabwe is working with the International Atomic Energy Agency and Russian investors to establish nuclear energy as part of its efforts to end the country’s chronic power shortages, government officials said Thursday. The nation has expressed its interest in nuclear power to the IAEA, said Edgar Moyo, Minister of Energy and Power Development, and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-work-with-russia-iaea-to-establish-nuclear-energy/\">Zimbabwe to work with Russia, IAEA to establish nuclear energy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Zimbabwe’s new currency woes hit traditional stores while illegal night bazaars flourish",
            "url": "https://www.newzimbabwe.com/zimbabwes-new-currency-woes-hit-traditional-stores-while-illegal-night-bazaars-flourish/",
            "content": "AP\n\nBatsirai Pabwe picked detergents, toothpaste, snacks and some pasta among several grocery items spread on the tarmac of a car parking space  an unorthodox night bazaar lit by cellphone flashlights and fluorescent lamps inZimbabwescapital, Harare.\n\nTraditional stores are struggling to survive as the volatility ofZimbabwes new currency pushes prices up. Many like Pabwe now shun them for much cheaper informal markets that pop up at night to avoid the glare of authorities.\n\nFrom dusk, sidewalks, store or office verandahs and car parking spaces burst into unorthodox open air bazaars, offering anything from groceries to fresh meat, electronics, clothes, medicines, fashion accessories and stationery.\n\nUnfettered by expenses such as rising energy costs, taxes and laws that force formal retailers to accept the local currency at artificially low official exchange rates, informal traders, including children, offer better bargains. A box of juice that sells for $3 in a supermarket costs half of that on the street.\n\nIts my first time shopping here. My friend told me that its much cheaper than the supermarkets, 30-year-old Pabwe said, visibly relieved as he filled up a plastic bag with items for just $20. I decided to give it a try and I really enjoyed it.\n\nThe once-prosperous southern African nation of 15 million people in April introduced a new gold-backed currency called ZiG, short for Zimbabwe Gold, to replace one that had been battered by depreciation and often outright rejection by the people.\n\nIt is the countrys sixth attempt at a new currency since the spectacular 2009 collapse of the Zimbabwe dollar and adoption of the U.S. dollar as legal tender amid hyperinflation of 5 billion percent, one of the worlds worst currency crashes to date. The U.S. dollar has since remained legal tender alongside successive local currencies.\n\nThe latest currency, the worlds newest, came with pomp and fanfare  promotional catchy jingles and songs played repeatedly on public radio, television and online.\n\nSeven months on, the ZiG seems to be tanking, like its predecessors. The gap between official and black market exchange rates continues to widen, with many people and informal traders who dominate the economy again preferring the more stable dollar.\n\nTraditional stores, forced by authorities to charge using the local currency, are increasing prices to make ends meet. But they have also become uncompetitive against unregulated informal markets, the Retailers Association of Zimbabwe, an industry representative group, said in September.\n\nIt warned of store closures, saying the situation is clearly untenable.\n\nIn October, Pick n Pay, one of Africas biggest grocery chains that operates more than 70 stores jointly with a local partner in Zimbabwe, said that it had impaired its investment in Zimbabwe to a book value of zero because of the deteriorating economic conditions.\n\nIn every transaction business is doing in the formal setup, its making an exchange rate loss that cannot be compensated. The major issue here is a currency crisis, said Gift Mugano, an economics professor. Huge overheads worsen the retailers situation.\n\nEverything is against their survival. The informal sector works at night, (if there is) no electricity they use their phones, they dont care. They are there for survival, Mugano said.\n\nThe contrast is palpable in Harares Central Business District, where only a few shoppers solemnly scanned prices in a supermarket on a recent day.\n\nSoothing music played from speakers inside but was drowned out by the buzz created outside by hordes of street vendors shouting out bargains to a sea of shoppers.\n\nBusiness is booming, said Oswald Gari, a vendor, adding that he only works at night when the police leave.\n\nGari, 51, said hes fending for his six children and four nephews under his care from the night trade. He harbors no hope of finding formal employment in a country where once roaring industrial sites are being turned into giant warehouses for imported goods, many which end up on the streets, and rail tracks are now overgrown with weeds.\n\nMore than 80% of Zimbabwes employable population ekes out a living in the informal sector, according to official figures and the International Labor Organization.\n\nFor Pabwe, shopping from the informal night markets means less headaches.\n\nIts quite confusing, especially for people like me who really dont understand the value of the ZiG. I always get confused when I get into supermarkets, he said.\n\nHe was satisfied with his shopping at night bazaar.\n\nI got everything I was looking for and the pricing is really affordable. I actually managed to buy a handful for just $20. I even got my washing powder and dishwashing liquid, he said. I think I will do this more often.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/23123737/Harare-Night-Streets.jpg",
            "description": "<p>AP Batsirai Pabwe picked detergents, toothpaste, snacks and some pasta among several grocery items spread on the tarmac of a car parking space — an unorthodox night bazaar lit by cellphone flashlights and fluorescent lamps in Zimbabwe’s capital, Harare. Traditional stores are struggling to survive as the volatility of Zimbabwe’s new currency pushes prices up. Many like</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-new-currency-woes-hit-traditional-stores-while-illegal-night-bazaars-flourish/\">Zimbabwe’s new currency woes hit traditional stores while illegal night bazaars flourish</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Angelina Jolie and Brad Pitt reach divorce settlement after 8 years",
            "url": "https://www.newzimbabwe.com/angelina-jolie-and-brad-pitt-reach-divorce-settlement-after-8-years/",
            "content": "AP\n\nAngelina JolieandBrad Pitthave reached a divorce settlement, her lawyer said Monday, bringing an apparent end to one of the longest and most contentious divorces in Hollywood history.\n\nJolies attorney James Simon confirmed to The Associated Press that the couple had come to a deal. News of the settlement was first reported by People magazine.\n\nMore than eight years ago, Angelina filed for divorce from Mr. Pitt, Simon said in a statement. She and the children left all of the properties they had shared with Mr. Pitt, and since that time she has focused on finding peace and healing for their family. This is just one part of a long ongoing process that started eight years ago. Frankly, Angelina is exhausted, but she is relieved this one part is over.\n\nNo court documents have been filed yet, and a judge will need to sign off on the agreement. An email late Monday night to Pitts attorney seeking comment was not immediately answered.\n\nJolie, 49, and Pitt, 61, were among Hollywoods most prominent couples for 12 years. The two Oscar winners have six children together.\n\nJoliefiled for divorce in 2016,after a private jet flight from Europe during which she said Pitt was abusive toward her and their children. A judge in 2019declared them divorced and single,but the splitting of assets and child custody needed to be separately settled.\n\nA private judge that the two had hired to handle the case reached a decision soon after that included equal custody of their children, but Joliefiled to have him removedfrom the case over an unreported conflict of interest. An appeals court agreed, the judge was removed, and the couple had to start over.\n\nNo details of the agreement were immediately revealed, and the couples use of the private judge  an increasingly common move among splitting celebrities in recent years  has kept the proceedings largely under wraps. Some details, however, have been revealed through a separate lawsuit filed by Pitt, in which he alleged Jolie reneged on an agreement that she would sell him her half of a French winery the two owned together. Its not clear how the divorce agreement will affect that lawsuit.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/07014513/Pitt-Jolie.jpeg",
            "description": "<p>AP Angelina Jolie and Brad Pitt have reached a divorce settlement, her lawyer said Monday, bringing an apparent end to one of the longest and most contentious divorces in Hollywood history. Jolie’s attorney James Simon confirmed to The Associated Press that the couple had come to a deal. News of the settlement was first reported by People magazine.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/angelina-jolie-and-brad-pitt-reach-divorce-settlement-after-8-years/\">Angelina Jolie and Brad Pitt reach divorce settlement after 8 years</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Intruder kills man (72) in cold blood, steals US$3,000 cash",
            "url": "https://www.newzimbabwe.com/intruder-kills-man-72-in-cold-blood-steals-us3000-cash/",
            "content": "By Staff Reporter\n\nAN elderly Kadoma man was murdered in cold blood by an unidentified intruder, who went on to ransack his bedroom and took US$3,000 cash.\n\nThe New Years Eve killing has reportedly left the mining community of Pathway, Kadoma in Mashonaland West shocked amid a surge in murder cases across the country.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed a manhunt has been launched to account for the suspect.\n\nPolice in Kadoma are appealing for information which may assist in the investigation of a case of murder which occurred on December 31, 2024 at around 0300 hours at Mazaretha Patchway in which Elijah Kesia (72) died.\n\nAn unknown suspect stormed into the victims bedroom and struck him with an axe on the forehead. The victim died on the spot.\n\nThe suspect stole approximately US$3,000 cash and a cellphone. Anyone with information to report at any nearest police station, said Nyathi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Staff Reporter AN elderly Kadoma man was murdered in cold blood by an unidentified intruder, who went on to ransack his bedroom and took US$3,000 cash. The New Year’s Eve killing has reportedly left the mining community of Pathway, Kadoma in Mashonaland West shocked amid a surge in murder cases across the country. Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/intruder-kills-man-72-in-cold-blood-steals-us3000-cash/\">Intruder kills man (72) in cold blood, steals US$3,000 cash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Ex-Sundowns striker Malajila finds new path in Zimbabwe",
            "url": "https://www.newzimbabwe.com/ex-sundowns-striker-malajila-finds-new-path-in-zimbabwe/",
            "content": "FarPost\n\nFormer Mamelodi Sundowns forward Cuthbert Malajila has found a new path in his homeland Zimbabwe.\n\nWhile playing for Maritzburg United in 2012, Malajila founded the CUMA Academy. The academy houses Under 13s, 15s, 19s and 23s. And the founding crop of Under-13s has gone on to be the senior team competing in big tournaments, while some have already left.\n\nAt the moment, CUMA Academy is competing in Zimbabwes second division, which is equivalent to theABC Motsepe League.\n\nThey were relegated from the first division, the Northern Region Soccer League, at the end of the 2023 season.\n\nPlausibly, the academy has been robust in terms of training programs as well as plucking good talent from obscurity.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230412/Cuthbert-Malajila.jpg",
            "description": "<p>FarPost Former Mamelodi Sundowns forward Cuthbert Malajila has found a new path in his homeland Zimbabwe. While playing for Maritzburg United in 2012, Malajila founded the CUMA Academy. The academy houses Under 13s, 15s, 19s and 23s. And the founding crop of Under-13s has gone on to be the senior team competing in big tournaments,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-sundowns-striker-malajila-finds-new-path-in-zimbabwe/\">Ex-Sundowns striker Malajila finds new path in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Happy New Year!",
            "url": "https://www.newzimbabwe.com/happy-new-year-2025/",
            "content": "Our dearest readers,\n\nAs we close the chapter on 2024 and step into 2025, we at NewZimbabwe.com want to extend our heartfelt gratitude to our readers for your continued support and engagement. We have been honoured to be your trusted source of news.\n\nLooking ahead, we remain committed to delivering timely, accurate, and thought-provoking content that keeps you informed and engaged. Your feedback and participation drive us to continually improve and serve you better.\n\nMay the year 2025 bring new opportunities, growth, and prosperity to you and your loved ones. Thank you for being part of the NewZimbabwe.com community.\n\nJoin our online community\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31221721/newzim-02.jpg",
            "description": "<p>Our dearest readers, As we close the chapter on 2024 and step into 2025, we at NewZimbabwe.com want to extend our heartfelt gratitude to our readers for your continued support and engagement. We have been honoured to be your trusted source of news. Looking ahead, we remain committed to delivering timely, accurate, and thought-provoking content</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/happy-new-year-2025/\">Happy New Year!</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Why are you always making noise on the internet? Aren’t you supposed to be kuMasowe? – Sonja takes a dig at ex-hubby Wicknell Chivayo",
            "url": "https://www.newzimbabwe.com/why-are-you-always-making-noise-on-the-internet-arent-you-supposed-to-be-kumasowe-sonja-takes-a-dig-at-ex-hubby-wicknell-chivayo/",
            "content": "By Staff Reporter\n\nCONTROVERSIAL businessman, Wicknell Chivayos ex-wife Sonja Madzikanda has hit back after he claimed their marriage broke down mainly because she could not get along with his late mother and siblings.\n\nHis younger sister, Moreblessing popularly known as Moe andSonja have in the past bashed each other on social media platforms.\n\nChivayo parted ways with Sonja, the mother of his two children several months ago after seven years of marriage.\n\nThe former couple has been trending on social media after he flaunted his new girlfriend Lulu Muteke whom he plans to marry next year.\n\nIn response to a letter directed to him on social media Chivayo however said he has not stopped looking after Sonja for the sake of his kids and recently splashed R2 million sponsoringtheir vacation inVietnam and Japan.\n\nHe added that he gave his ex-wife US$ 100,000 for shopping and to share with her family members, the same amount he revealed will be the bride price he will pay for Lulu.\n\nLeaving my ex-wife was undoubtedly one of the MOST DIFFICULT decisions I have ever had to make in my life. Not only because I was used to her presence, but I love my children John and Minana INCREDIBLY. However, our marriage faced IRRECONCILABLE differences that made it impossible to continue. She struggled to get along with my family, including my DEAR late mother and all my 6 sisters, and the constant fighting became too overwhelming for me. It reached a point where I felt that the person I was fighting for was not making an effort to support me when the world had turned its back on me. This made the marriage IRRETRIEVABLY broken down. Despite these challenges, she remains a GREAT mother and a good person, and I continue to look after her exceptionally well and respect her as such.\n\nWe now co-parent very well and I ensure that my children are well taken care of. Women are good at playing the victim and will never publicly acknowledge a mans efforts. For instance, I recently paid TWO MILLION rand for their Christmas holiday, where they travelled to Vietnam and Japan and on top of that, I gave her an additional ONE HUNDRED THOUSAND DOLLARS USD cash for their shopping and for her to share with her family, reads part of his post.\n\nSonja took no time to respond, lashing out at her ex-husband for always making noise on the internet adding that they had not seen each other in 7 months.\n\nIn a series of Instagram stories, she said, I dont care who you marry. Marry and move on\n\nRespect your business partners, respect the offices you go in. Why are you always making noise on the internet? Arent you supposed to at church? Arent you supposed to be at kuMasowe?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/31171605/wicknell.png",
            "description": "<p>By Staff Reporter CONTROVERSIAL businessman, Wicknell Chivayo’s ex-wife Sonja Madzikanda has hit back after he claimed their marriage broke down mainly because she could not get along with his late mother and siblings. His younger sister, Moreblessing popularly known as Moe and Sonja have in the past bashed each other on social media platforms. Chivayo parted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-are-you-always-making-noise-on-the-internet-arent-you-supposed-to-be-kumasowe-sonja-takes-a-dig-at-ex-hubby-wicknell-chivayo/\">Why are you always making noise on the internet? Aren’t you supposed to be kuMasowe? – Sonja takes a dig at ex-hubby Wicknell Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Zimbabwe abolishes Death Penalty, prisoners on death row to be sentenced afresh",
            "url": "https://www.newzimbabwe.com/zimbabwe-abolishes-death-penalty-prisoners-on-death-row-to-be-sentenced-afresh/",
            "content": "By Tapiwa Svondo\n\nPresident Emmerson Mnangagwa has signed into law the Death Penalty Abolition Act.\n\nZimbabwe currently has over 60 prisoners on death row who will now have their sentences commuted. The last execution in the country was nearly two decades ago in 2005.\n\nParliament had pushed to amend the Criminal Law Code, Criminal Procedure Law and theDefence Act which allowed the death penalty in cases of murder committed under aggravatingcircumstances.\n\nInternational bodies such as Amnesty International have called for the removal of the death penalty, arguing it violates the right to life.\n\nMnangagwa had sinceexpressed he is against capital punishment, sharing his own experience when his death sentence for blowing up a train during the 1960s war was commuted to 10 years in prison.\n\nAbolition of death penalty Notwithstanding any other law  no court shall impose sentence of death upon a person for any offence, whenever committed, but instead shall impose whatever other competent sentence is appropriate in the circumstances of the case;\n\nthe Supreme Court shall not confirm a sentence of death imposed upon an appellant, whenever that sentence may have been imposed, but instead shall substitute whatever other competent sentence is appropriate in the circumstances of the case: no sentence of death, whenever imposed, shall be carried out, reads part of the act.\n\nAdditionally, any death sentence given by a military court will automatically change to a life sentence in a civilian prison, with a non-release period of 20 years.\n\nEvery sentence of death that a military court lawfully imposes under this Act is automatically commuted to a sentence of imprisonment for life in a civilian prison (subject to a non-release period of twenty years, or such lesser non-release period as the court martial may specify); and upon the sentence of the military court being confirmed by the confirming authority in terms of section 63, be referred without delay (and without the need to lodge a formal appeal) to the Court Martial Appeal Court for confirmation or, where the Appeal Court so deems it fit in the interests of justice, for resentencing or for disposal in such other manner as the Appeal Court deems to be fit in the interests of justice.\n\nFor the avoidance of doubt it is declared that the provisions of this Act bearing on the death penalty shall have full force with effect from the date when any state of public emergency is declared in terms of section 113 of the Constitution, up to the date when such declaration lapses or ceases to have effect in terms of section 113(4) of the Constitution (whether in the interim the declaration has been renewed or not).\n\nThe Commissioner-General of the Prisons and Correctional Service shall do everything within their respective competences to ensure that, as soon as practicable after the fixed date, every prisoner under sentence of death is brought before the High Court to be sentenced afresh for the offence for which the death sentence was imposed upon him or her.\n\nIn Africa, 24 countries including Zambia have fully abolished the death penalty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/15180901/ED.jpg",
            "description": "<p>By Tapiwa Svondo President Emmerson Mnangagwa has signed into law the Death Penalty Abolition Act. Zimbabwe currently has over 60 prisoners on death row who will now have their sentences commuted. The last execution in the country was nearly two decades ago in 2005. Parliament had pushed to amend the Criminal Law Code, Criminal Procedure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-abolishes-death-penalty-prisoners-on-death-row-to-be-sentenced-afresh/\">Zimbabwe abolishes Death Penalty, prisoners on death row to be sentenced afresh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Mnangagwa to spend annual vacation in the country due to ‘commitments requiring his attention’",
            "url": "https://www.newzimbabwe.com/mnangagwa-to-spend-annual-vacation-in-the-country-due-to-commitments-requiring-his-attention/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa will be taking his month-long annual leave starting Tuesday 31 December.\n\nHis deputies Kembo Mohadi and Constantino Chiwenga will take turns assuming the role of Acting President.\n\nIn a statement Monday, acting chief secretary George Charamba said Mnangagwa will be in Zimbabwe due to responsibilities that demand his direct involvement, both in his capacity as President and SADC Chairman.\n\nHis Excellency the President, Dr E.D Mnangagwa, starts his month-long annual vacation tomorrow, 31st December, 2024.\n\nHe plans to spend his vacation in the country and will be available for commitments requiring his personal attention, both as State President and as Chairman of the Southern Africa Development Community (SADC).\n\nWhile he is on leave, the two Vice Presidents, Hon K.C.D Mohadi, and Hon. Dr C.G.D.N Chiwenga will stand in for him in that order.\n\nVice President Mohadi will act from 31st December, 2024 to 19th January, 2025. Thereafter, Vice President Chiwenga will act until His Excellency the President resumes duty in early February, Charamba said.\n\nThe president typically takes his yearly vacation in January.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>By Thandiwe Garusa PRESIDENT Emmerson Mnangagwa will be taking his month-long annual leave starting Tuesday 31 December. His deputies Kembo Mohadi and Constantino Chiwenga will take turns assuming the role of Acting President. In a statement Monday, acting chief secretary George Charamba said Mnangagwa will be in Zimbabwe due to responsibilities that demand his direct</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-to-spend-annual-vacation-in-the-country-due-to-commitments-requiring-his-attention/\">Mnangagwa to spend annual vacation in the country due to ‘commitments requiring his attention’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        },
        {
            "title": "Welshman Ncube threatens Tshabangu with disciplinary action as High Court reserves judgment in latest lawsuit",
            "url": "https://www.newzimbabwe.com/welshman-ncube-threatens-tshabangu-with-disciplinary-action-as-high-court-reserves-judgment-in-latest-lawsuit/",
            "content": "By Staff Reporter\n\nThe High Court has indefinitely reserved its judgement in a matter Citizens Coalition for Change (CCC) leaders who were dismissed from their Parliamentary roles by the secretary general of the party, Sengezo Tshabangu are suing him.\n\nThe urgent High Court application was heard by Justice Neville Wamambo who promised to hand down his judgment on a later date.\n\nThe leaders include the interim party leader, Welshman Ncube and his deputy, Lynette Karenyi Kore, Sesel Zwidzai and Edwin Mushoriwa who filed an application citing their party as the first applicant.\n\nTshabangu recently dismissed the leaders from their parliamentary roles and appointed his selections in their place.\n\nTshabangu, the Speaker of the National Assembly, and Senator Nonhlahla Mlotshwa were cited as respondents in court papers\n\nThe applicants are seeking a court declaration that Tshabangus decisions to oust them from the Standing Rules and Orders Committee (SROC) are unlawful and exceed his constitutional authority.\n\nThey are also challenging Mlotshwas appointment as the CCC chief whip, claiming that such a position is not recognised under Section 151 (2) of the Constitution.\n\nAdditionally, they are contesting the reshuffling of various CCC members across different parliamentary committees to which they were originally assigned.\n\nThey seek an order to prevent the Speaker from announcing these changes in the National Assembly.\n\nIn the application, Ncube said Tshabangu will soon face disciplinary proceedings for what he did.\n\nOn Monday his lawyer Method Ndlovu told the judge that the Speaker quickly acted on Tshabangus actions but ignored several letters from his client.\n\nThere are several letters which were written by the applicants but they were ignored but he was so quick to act on the which was written by the second respondent, Ndlovu said.\n\nNcube said Tshabangu defied an existing court order barring him from recalling party members adding that the reshuffle was as good as recall.\n\nHis actions (Tshabangu) do not represent the collective decision of the CCC.\n\nHe was on a frolic of his own and what he did does not reflect the collective and correct position of the 1 Applicant (CCC).\n\nHe is a non-entity and it is surprising that the Speaker keeps entertaining him instead of the party, Ncube said in his founding affidavit when he filed the lawsuit.\n\nLewis Uriri and Nqobani Sithole representing Tshabangu said the High Court has no jurisdiction to hear Ncubes application.\n\nThe significance of the mootness was never lost. They became aware of their problem on December 16 but they already knew that parliament had accepted that there would be changes.\n\nThe juristic act had already taken place. All the speaker does is that I have to inform them that these changes have been made. They want to interrupt changes which have been made, Uriri said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/10060245/tshabangu.jpeg",
            "description": "<p>By Staff Reporter The High Court has indefinitely reserved its judgement in a matter Citizens Coalition for Change (CCC) leaders who were dismissed from their Parliamentary roles by the secretary general of the party, Sengezo Tshabangu are suing him. The urgent High Court application was heard by Justice Neville Wamambo who promised to hand down</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/welshman-ncube-threatens-tshabangu-with-disciplinary-action-as-high-court-reserves-judgment-in-latest-lawsuit/\">Welshman Ncube threatens Tshabangu with disciplinary action as High Court reserves judgment in latest lawsuit</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "01 Jan 2025"
        }
    ]
}