{
    "news": [
        {
            "title": "John Symth’s victims and their families in Zimbabwe hope for closure",
            "url": "https://www.newzimbabwe.com/john-symths-victims-and-their-families-in-zimbabwe-hope-for-closure/",
            "content": "By Cyril Zenda | Religion Unplugged\n\nHe hurt us.  Guide was an only boy in a family of seven girls. What he (the abuser) did was grossly unfair. May his spirit burn in hell!\n\nThese are sentiments of Judith Nyachuru, the sister of Guide Nyachuru, the boy who died in 1992 at a holiday camp run by serial abuser John Smyth through his Zambezi Ministries in Zimbabwe.\n\nFor decades, the Nyachuru family has hoped for closure, which has proved to be elusive. When the scathingMakin Reportreleased this past November  which ultimately resulted in the resignation of Archbishop of CanterburyJustinWelby recommended that the Church of England also probe the atrocities committed by Smyth in Zimbabwe, the family was hopeful.\n\nMonths later, nothing seems to be happening about the recommended investigation into the activities of the man described as an unhinged tyrant and the embodiment of Satan by John Thorn, the former headmaster of Winchester College, in his 1989 autobiography, The Road to Winchester.\n\nNot that I know, Judith toldReligion Unpluggedwhen asked if anything had started regarding the investigations in Zimbabwe recommended by the Makin Report.\n\nEven Douglas Coltart, the lawyer who investigated allegations of abuse against Smyth in 1993 and has been the focal person for the case in Zimbabwe, remains in the dark.\n\nI am not aware of anything other than that I have been instructed by the family of the late Guide Nyachuru to investigate whether damages can be claimed following the tragic loss of Guide in the 1990s, he said.\n\nThe Church of England did not respond to questions on the status of the recommended investigation.\n\nIt is this ongoing silence that worries the victims of Smyths abuses in Zimbabwe  estimated to number about 80  and their families, as it raises fears of potential cover-up attempts by church officials.\n\nRebekah Read, senior associate solicitor at U.K.-based law firm Leigh Day Solicitors,blamed the Church of England for historically dragging its feet when it comes to handling this particular case.\n\nThese additional investigations cannot come quickly enough, Read said. The Makin Review and the police investigation into Smyths actions were announced in 2017, despite the Church of England havingfirst had knowledge of the disturbing allegations as far back as 1982. This lack of action meant that Smyth had access to children in Zimbabwe and South Africa for decades after this. The Church should waste no more time in providing restitution for the Zimbabwean and South African survivors of Smyths sadistic abuse.\n\nJason Leanders, 44, another of Smyths victims,toldBBC that many of his friends are still so traumatized by the beatings they are not even prepared to talk about it. After initially agreeing to share his story withReligion Unplugged, Leanders later changed his mind, something that, according to Coltart, who has dealt with some of these victims, isnot unusual.\n\nI think possibly there are still victims in Zimbabwe, perhaps in South Africa, who are suffering from PTSD, and I think the Anglican church has a responsibility to identify those individuals and to supply them with the medical assistance that they might require, Coltart added.\n\nEfforts to stop the abuses when they were taking place were resisted in Zimbabwe as Smyth enjoyed the support and protection of church leaders, lawyers and politicians.\n\nIt was one of those embarrassing cases that had to be swept under the carpet, a retired priest in Harare familiar with case toldReligion Unplugged. I dont think the attitudes have changed much even now, it would be difficult to get the whole truth on this matter because a lot of church leaders and lawyers took part in this cover up and considering what has happened to Welby, there is even good reason to avoid any further investigation.\n\nSmyth had been blacklisted in the U.K. after an investigation revealed he had subjected boys in the country to traumatic physical, psychological and sexual abuse. He had met most of his victims at Christian holiday camps run by a charity he chaired that was linked to the Church of England.\n\nThe 1982 report about the canings, prepared by Anglican clergyman Mark Ruston, concluded that the scale and severity of the practice was horrific, with accounts of boys beaten so badly that some of them had to wear nappies. He was also accused of promoting nudity and masturbation among the boys in his camps.The Ruston Reportfindings were not widely circulated, allowing Smyth to quietly move to Zimbabwe from Winchester in 1984.\n\nTwo years later, he has set up his Zambezi Ministries  with funding from the U.K.  and was meting out the same horrible punishments at the Christian holiday camps held at Ruzawi School in Marondera, a small town 45 miles (70 kilometers) east of the Zimbabwean capital, Harare. Zambezi Ministries exclusively marketed these holiday camps at the countrys elite private Christian schools.\n\nStarting in August 1986, the abuses went unchecked until 1993, when some parents of children from schools in Bulawayo  the countrys second largest city  complained about the severity of injuries that their children had suffered at one of Smyths camps, prompting some clergymen to engage Coltart to investigate.\n\nAfter a torrid time dealing with Smyth and his army of sympathizers, Coltarts21-page reportwas then published in October 1993, and its circulation was restricted to a handful headmasters and church leaders, conscious of the dangers of a defamation suit.\n\nAccording to Coltarts report, Smyth  an influential barrister with the right contacts within the countrys Christian, judicial and political circles  was also accused of resorting to blackmail, threats and lies to escape prosecution. Some church leaders even defended him, claiming that the acts that had been deemed inappropriate in the U.K. were acceptable in Zimbabwe. Some accused the Christian church leaders from Bulawayo of being jealous and pursuing personal vendettas against Smyth.\n\nBut the protests and subsequent investigation caused Smyth to stop the beatings, and his camps continued in some other guises.\n\nColtart later instructed another law firm to pursue a legal case against Smyth, who was eventually charged with culpable homicide over Guides death, as well as charges relating to the beatings of many others schoolboys.\n\nAfter the Coltart report and prosecution, Smyth and his family lived in Zimbabwe on temporary residency permits, which were renewable monthly. In 2001, upon their return from a long trip abroad, they were denied entry into the country, causing them to move to South Africa, where Smyth spent the last 17 years of his life. His sudden death in August 2018  ahead of being questioned from U.K. authorities or facing extradition  lead to speculation about a suicide.\n\nIn the aftermath of the Makin Report, the archbishop of Cape Town, Thabo Makgoba, immediately set up a commission to establish if the Church of England had been lacking in protecting young people from Smyth during the years that he was member of the church, but this probe has also been rocked byallegationsof renewed cover-up attempts.\n\nWith two of the three panel members holding posts in the Anglican Church of South Africa, critics questioned the objectivity of the commission, pointing out that the church could not investigate itself.\n\nThese cover-up allegations ended up claiming the scalp of Jeremy Gauntlett, a senior lawyer and a member of the Anglican Church who had been appointed to the panel, only for one sexual abuse victim of Gauntlett himself tocry out in protest. This prompted the veteran lawyer to ignominiouslyresignfrom both the panel and practicing law.\n\nSmyth was protected in England and he was protected in Zimbabwe, Leanders said. The protection went on for so long it robbed victims the chance to confront Smyth as adults.\n\nCyril Zenda is a Christian and an African journalist and writer based in Harare, Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14162502/guide-nyachuru.jpg",
            "description": "<p>By Cyril Zenda | Religion Unplugged “He hurt us. … Guide was an only boy in a family of seven girls. What he (the abuser) did was grossly unfair. May his spirit burn in hell!” These are sentiments of Judith Nyachuru, the sister of Guide Nyachuru, the boy who died in 1992 at a holiday</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/john-symths-victims-and-their-families-in-zimbabwe-hope-for-closure/\">John Symth’s victims and their families in Zimbabwe hope for closure</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "Rufaro Stadium a muddy swamp as world-class dream is washed away by rains; Mafume insists it will host international matches",
            "url": "https://www.newzimbabwe.com/rufaro-stadium-a-muddy-swamp-as-world-class-dream-is-washed-away-by-rains-mafume-insists-it-will-host-international-matches/",
            "content": "By Darlington Gatsi\n\nPutting lipstick on a pig  this idiom aptly summarises the superficial renovations carried out at Rufaro Stadium by the Harare City Council.\n\nRufaro Stadium was reopened last year after years of closure, with Harare Mayor Jacob Mafume touting the facility as one of the best in Zimbabwe, even comparing its pitch to Spains Santiago Bernabeu Stadium.\n\nMafume enthusiastically described Rufaro Stadium as a lush green venue, celebrating the achievement of reopening the imposing structure in Mbare.\n\nHowever, less than a year after its reopening, Rufaro is already showing signs of deterioration, with the superficial facelift beginning to unravel.\n\nThe stadium has hosted four matches in eight days as the 2025 Castle Lager Premier Soccer League kicked off last week.\n\nIn the rains, the pitch is prone to waterlogging, with large patches of thick, sticky mud covering parts of the field.\n\nThis is in stark contrast to Mafumes assurances that a proper drainage system had been installed during the renovations.\n\nSpeaking recently at a council meeting, Mafume praised the developments at Rufaro, saying that the aim was to bring international football back to Mbare.\n\nWe are the biggest investors in sport in this country as the City of Harare. Every weekend, something is happening in Harare. Our contribution to sport is not something that should be taken lightly. We must improve Rufaro Stadium, Gwanzura Stadium, and many other stadiums in the city, he said.\n\nWe are happy that we have six teams in the PSL, and our next goal is to bring international soccer back to the streets of Harare.\n\nHowever, with the league still in its early stages, questions are being raised overRufaro Stadiums readiness to host multiple matches.\n\nDynamos, CAPS United, ZPC Kariba, and Herentals are using the stadium for their home matches, as renovations at the National Sports Stadium are yet to be completed.\n\nDespite these plans, Rufaro Stadium remains far from meeting the standards required to host international matches, with several areas falling short.\n\nMafume deceived football fans when the City Council, through a deal with Henrietta Rushwayas Okima Plastics, installed bucket seats in a small section of Rufaro Stadium.\n\nThe situation raises concerns about the sustainability of the renovations and whether the stadium can withstand the demands of a full football season, let alone attract international fixtures.\n\nZimbabwe is burdened with a lack of proper facilities, which has forced football teams to play outside the country. The situation is predicted to exacerbate with a visible lack of appetite by relevant authorities to address the dire situation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/03180341/WhatsApp-Image-2025-03-03-at-20.02.50.jpeg",
            "description": "<p>By Darlington Gatsi Putting lipstick on a pig – this idiom aptly summarises the superficial renovations carried out at Rufaro Stadium by the Harare City Council. Rufaro Stadium was reopened last year after years of closure, with Harare Mayor Jacob Mafume touting the facility as one of the best in Zimbabwe, even comparing its pitch</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rufaro-stadium-a-muddy-swamp-as-world-class-dream-is-washed-away-by-rains-mafume-insists-it-will-host-international-matches/\">Rufaro Stadium a muddy swamp as world-class dream is washed away by rains; Mafume insists it will host international matches</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "Most corrupt country in SADC! Parliament demands answers from Ziyambi on Zimbabwe’s graft record",
            "url": "https://www.newzimbabwe.com/most-corrupt-country-in-sadc-parliament-demands-answers-from-ziyambi-on-zimbabwes-graft-record/",
            "content": "By Darlington Gatsi\n\nParliament has called upon the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, to issue a statement in the National Assembly regarding the countrys efforts to combat corruption.\n\nThis follows a recent report that identified Zimbabwe as the most corrupt nation in the Southern African region.\n\nCorruption continues to plague the country unabated, with Transparency International, the global anti-corruption watchdog, ranking Zimbabwe among the worst-performing nations in the world.\n\nThis ranking is a damning indictment of President Emmerson Mnangagwas administration, particularly given his 2017 pledge to eradicate corruption when he assumed the presidency.\n\nDuring a parliamentary session, Citizens Coalition for Change (CCC) Member of Parliament (MP) Gladys Hlatywayo challenged the government to address the countrys poor standing in the fight against corruption.\n\nGiven how disastrous the effects of corruption are, including the crowding out of social services to the citizenry, this House cannot be silent on this matter Mr. Speaker Sir.\n\nIn an era characterised by the rolling back of international aid and development, the prudential use of national resources cannot be overemphasised. After all, Parliament has the responsibility of oversight and to ensure the efficient use of national resources.\n\nI, therefore appeal to you Mr. Speaker, for the Minister of Justice, Legal and Parliamentary Affairs to favour this very House with a Ministerial Statement on how the Executive is tackling the question of corruption, including how far the Executive has gone in terms of the whistleblowers protection legislation and the witness protection legislation, said Hlatywayo.\n\nThe entrenchment of corruption has been attributed to inefficiencies within key institutions, such as the Zimbabwe Anti-Corruption Commission (ZACC). ZACC has faced criticism for its perceived leniency towards individuals associated with the ruling party, ZANU PF.\n\nAdditionally, the absence of robust legislation to protect whistleblowers has been identified as a significant obstacle in the fight against corruption.\n\nSpeaker of Parliament Jacob Mudenda emphasised the urgency of tabling the Whistleblowers Act in the National Assembly.\n\nI am not sure about the agreement. What I can only advise in support of part of what you have said is the Whistleblowers Bill that must come as soon as possible to this House. As for the indexes, I have my reservation, said Mudenda.\n\nMeasures to curb corruption are among the key areas Zimbabwe must address as part of the Structured Dialogue Platform between the country and the African Development Bank (AfDB).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Darlington Gatsi Parliament has called upon the Minister of Justice, Legal and Parliamentary Affairs, Ziyambi Ziyambi, to issue a statement in the National Assembly regarding the country’s efforts to combat corruption. This follows a recent report that identified Zimbabwe as the most corrupt nation in the Southern African region. Corruption continues to plague the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/most-corrupt-country-in-sadc-parliament-demands-answers-from-ziyambi-on-zimbabwes-graft-record/\">Most corrupt country in SADC! Parliament demands answers from Ziyambi on Zimbabwe’s graft record </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "UN food agency shuts Southern Africa office amid Trump aid cuts",
            "url": "https://www.newzimbabwe.com/un-food-agency-shuts-southern-africa-office-amid-trump-aid-cuts/",
            "content": "Bloomberg\n\nThe United Nations World Food Programme, which gets much of its funding from the US, is closing its Southern African bureau at a time when the agency is leading a response to the worst drought in the region in four decades.\n\nThe decision, which was communicated to staff around the world in an email on Friday from Global Executive Director Cindy McCain, comes as 26 million people across seven countries in the region run short of food ahead of this years harvest in May. President Donald Trump has been dismantling US foreign aid affecting everything from health care to food supplies  Washington provides nearly half of WFPs $9.7 billion budget.\n\nWe have reached the difficult decision to close WFPs regional bureau for southern Africa in Johannesburg, McCain said in the email seen by Bloomberg. Challenging times demand some difficult choices.\n\nThe southern Africa bureau buys and transports hundreds of thousands of tons from South Africa and other countries. It procures more than 60% of its food, goods and services locally, WFP said on its website. The region is regularly hit by droughts because its periodically affected by the El Nino weather phenomenon, as it was last year.\n\nThe WFPs regional director and media team didnt respond to an emailed request for comment.\n\nThe WFP has been instrumental in raising funds for countries such as Zimbabwe and Mozambique as they contend with the impact of the worst drought in at least four decades, which slashed corn harvests by as much as 70%.\n\nSome of the responsibilities of the bureau, which manages the response and deals with WFP country offices in a region spanning from South Africa to the Democratic Republic of Congo, will be taken over by the East African bureau in Nairobi, McCain said in the email.\n\nMcCain said the agency remains committed to southern Africa, adding that a transition and integration team will be established to implement the changes over the course of the year.\n\nThe 160 employees in the Johannesburg office were initially told their bureau might be combined with the one in Nairobi, a person familiar with the situation said. On February 27, Carl Skau, McCains deputy, was in Johannesburg and told staff that a decision had been taken to close the office, surprising everyone including senior management, the person said. McCains email arrived a day later.\n\nSouth Africas Department of International Relations & Cooperation has been informed, the person said. The department said it will respond to Bloombergs query later.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/02055234/WFP-6-scaled.jpg",
            "description": "<p>Bloomberg The United Nations’ World Food Programme, which gets much of its funding from the US, is closing its Southern African bureau at a time when the agency is leading a response to the worst drought in the region in four decades. The decision, which was communicated to staff around the world in an email</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-food-agency-shuts-southern-africa-office-amid-trump-aid-cuts/\">UN food agency shuts Southern Africa office amid Trump aid cuts</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "PPC’s share price surges 11% as turnaround benefits start to boost the bottom line",
            "url": "https://www.newzimbabwe.com/ppcs-share-price-surges-11-as-turnaround-benefits-start-to-boost-the-bottom-line/",
            "content": "IOL\n\nPPCs share price flew up 11.4% on the JSE Monday after the aggregates, cement and ready-mix concrete producer said the positive results from a turnaround plan had continued into the second half of its financial year.\n\nIn an operational update for the 10 months to January 31, the group said benefits from the turnaround plan, which was started after the appointment a year ago of Matias Cardarelli as CEO and other changes to the executive team, were growing as the plan gained momentum.\n\nIn the key areas of commercial, operations, and supply chain, the initiatives are already showing results, namely plant sourcing optimisation, sales product mix enhancement, improved thermal energy costs and logistics management, PPC said.\n\nThese results had increased the EBITDA margin and cash flowgeneration, Cardarelli said in the update.\n\nThe Awaken the Giant turnaround plans first key steps included key personnel changes, simplification of the organisational structure and realignment of the organisation culture to ensure the appropriate results-oriented focus, cost discipline and a sense of urgency.\n\nRevenue fell 3%, while earnings before interest tax, depreciation and amortisation (EBITDA) was up 20%. The EBITDA margin increased by 3.2 percentage points.\n\nThe decrease in revenue was mainly due to a decline in the revenue in PPCs Zimbabwe operations, while the South Africa and Botswana operation delivered a flat performance.\n\nThe increase in EBITDA and EBITDA margins was due to all business units improving their results, mainly as a consequence of the turnaround plan, PPC directors said in a statement.\n\nCapital expenditure was expected to be slightly below the guidance of R400 million to R450m for the full year. Some optimisation of capital expenditure was being re-assessed, while maintenance expenditure was as planned.\n\nAs the stringent focus on costs and working capital take effect, the South Africa & Botswana operations free cash flow net cash inflow before financing activities excluding dividends from Zimbabwe  increased by a substantial 90% to R692m.\n\nAs at January 31, 2025, the SA and Botswana group was in a net cash position of R106m. PPC Zimbabwe continues to remain debt-free and held $13m in unencumbered cash at January 31.\n\nPPC Zimbabwe also increased its free cash flowgeneration leading to an increase in dividends declared and paid of $13m compared to the $11m paid in the comparable period.\n\nOverall sales volumes in the South Africa and Botswana group fell 1%. The decline was from lower Botswana sales volumes, since sales volumes in South Africa were flat. Price increases were implemented in July and offset the decline in volumes with revenue increasing by 2%.\n\nSouth Africa and Botswana group EBITDA increased 32%, resulting in margin expansion to 14.8% from 11.4%. This was also an increase from the margin of 13.7% at the half year.\n\nWhile most of the operational improvements are yet to materialise, the margin increase reflects the early delivery of a reduction in general and administrative expenses, and a contribution margin increase.\n\nThe materials business, comprising three businesses: ready mix concrete, aggregates and fly ash, saw EBITDA improve significantly.\n\nIn Zimbabwe, volumes fell 9%, consistent with the half-year. This trend started improving in January. Revenue fell 12% in rand terms, due to the rand strengthening in the current period compared to the comparable period.\n\nThe integrated cement plant in the Western Cape that was planned to secure PPCs cost competitiveness and low carbon cement leadership, was in the final stage ahead of seeking board approval.\n\nThe improvement of the results in the current period already reflects early delivery of the turnaround plan, ahead of the previously advised timeline, the board said, adding it would consider a dividend for the year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/07095716/PPC-Zimbabwe.png",
            "description": "<p>IOL PPC’s share price flew up 11.4% on the JSE Monday after the aggregates, cement and ready-mix concrete producer said the positive results from a turnaround plan had continued into the second half of its financial year. In an operational update for the 10 months to January 31, the group said benefits from the turnaround</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ppcs-share-price-surges-11-as-turnaround-benefits-start-to-boost-the-bottom-line/\">PPC’s share price surges 11% as turnaround benefits start to boost the bottom line</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "South Africa’s Expropriation Act: Hawks investigate disinformation claims in the US, four high treason dockets opened",
            "url": "https://www.newzimbabwe.com/south-africas-expropriation-act-hawks-investigate-disinformation-claims-in-the-us-four-high-treason-dockets-opened/",
            "content": "IOL\n\nThe Directorate for Priority Crime Investigation (Hawks) have recently confirmed that four high treason dockets have been opened in response to allegations that misleading information about South Africas Expropriation Act was distributed in the United States.\n\nHawks head Lieutenant General Godfrey Lebeya told the SABC that the dockets have been opened by different individuals from different political parties.\n\nThey concern individuals that may have crossed the border to go and communicate some of the things that are perceived to be in the direction of high treason, Lebeya said.\n\nWhen asked if the individuals in question are members or leaders of lobby groupAfriForum, Lebeya could neither deny nor confirm in his response.\n\nHe added: I dont want to mention names of organisationsSome organisations have been suspected to be involved but certain complainants have indicated that this and that organisation seems to be advocating for something that appears to behigh treason.\n\nLebeya further stated that the Hawks are investigating, with the inquiry at its initial stage. The Hawks are also working with the National Prosecuting Authority (NPA).\n\nIn recent months, AfriForum and Solidarity are organisations that have been accused of treason by political parties and citizens alike.\n\nThe organisations have also criticised the Expropriation Act andrecently went to the US White Housewhere they reportedly spoke with the Donald Trumps administration.\n\nThe Solidarity Movement delegation was led by Chairperson Flip Buys and Head of International Liaison, Jaco Kleynhans. AfriForums CEO, Kallie Kriel, and Solidaritys CEO, Dr Dirk Hermann, both represented their organisations. The organisation stated that it aimed to expose human rights crimes against Afrikaners, as well as the ANCs irresponsible policies and weak governance in the nation.\n\nA request was made for the US to expand its recognition of Afrikaners as a cultural community and to increase assistance to include support for the establishment of cultural infrastructure that enables them to live freely, safely, and prosperously in southern Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/05022752/SA-Hawks.jpeg",
            "description": "<p>IOL The Directorate for Priority Crime Investigation (Hawks) have recently confirmed that four high treason dockets have been opened in response to allegations that misleading information about South Africa’s Expropriation Act was distributed in the United States. Hawks head Lieutenant General Godfrey Lebeya told the SABC that the dockets have been opened by different individuals</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-expropriation-act-hawks-investigate-disinformation-claims-in-the-us-four-high-treason-dockets-opened/\">South Africa’s Expropriation Act: Hawks investigate disinformation claims in the US, four high treason dockets opened</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "The Pope has ‘two episodes of acute respiratory failure’, Vatican says",
            "url": "https://www.newzimbabwe.com/the-pope-has-two-episodes-of-acute-respiratory-failure-vatican-says/",
            "content": "Sky News\n\nThe Pope has had two episodes of acute respiratory failure, the Vatican has said.\n\nThe statement said: Today, the Holy Father presented two episodes of acute respiratory failure, caused by significant accumulation of endobronchial mucus and consequent bronchospasm.\n\nTwo bronchoscopies were therefore performed with the need for aspiration of abundant secretions.\n\nIn the afternoon, non-invasive mechanical ventilation was resumed. The Holy Father has always remained vigilant, oriented and collaborative.\n\nThe prognosis remains reserved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/31172615/Pope-Francis.png",
            "description": "<p>Sky News The Pope has had two episodes of “acute respiratory failure”, the Vatican has said. The statement said: “Today, the Holy Father presented two episodes of acute respiratory failure, caused by significant accumulation of endobronchial mucus and consequent bronchospasm. “Two bronchoscopies were therefore performed with the need for aspiration of abundant secretions. “In the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-pope-has-two-episodes-of-acute-respiratory-failure-vatican-says/\">The Pope has ‘two episodes of acute respiratory failure’, Vatican says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "DR Congo conflict: 500 mpox patients flee clinics after rebel looting",
            "url": "https://www.newzimbabwe.com/dr-congo-conflict-500-mpox-patients-flee-clinics-after-rebel-looting/",
            "content": "BBC\n\nMore than 500 mpox patients have fled clinics in eastern Democratic Republic of Congo over the last month amid the current conflict.\n\nOfficials at Africa Centres for Disease Control and Prevention (Africa CDC), a leading health agency on the continent, have said they are worried as the missing patients risk spreading the highly contagious disease that is suspected to have killed at least 900 people in DR Congo last year.\n\nThe patients fled from facilities in Goma and Bukavu  two cities that descended into chaos as they were seized by the Rwanda-backed M23 rebels over the past weeks.\n\nWe were looted. We lost equipment. It was a disaster, Dr Samuel Muhindo, in charge of a clinic in Goma, told the BBC.\n\nMpox  formerly known as monkeypox  can cause symptoms such as lesions, headaches and fever.\n\nAccording to Africa CDC, since the start of this year almost 2,890 mpox cases and 180 deaths have been reported in the country, which has been at the epicentre of several recent outbreaks.\n\nDr Muhindo described how 128 patients had fled Gomas Mugunga health centre in the wake of the fighting at the end of January.\n\nHis health workers had not been able to trace them as paperwork at the clinic was destroyed, he said.\n\nAt Bisengimana, a hospital in Goma that also treats mpox, looters took medicines and personal protective equipment.\n\nFires were lit outside the centre and when the perpetrators departed, patients medical records were left strewn on the floor.\n\nNow we are afraid of an outbreak of the epidemic in the areas where the displaced people returned to Dr Samuel Muhindo Head of the Mugunga health facility in Goma\n\nThey were given72 hours to leave last week, although the M23 later said it was encouraging voluntary returns.\n\nNow we are afraid of an outbreak of the epidemic in the areas where the displaced people returned to, Dr Muhindo said.\n\nHis fears have been echoed by the Africa CDC.\n\nOnce again, we are calling really for the ceasefire and also the agency to establish a humanitarian corridor to facilitate the continuation of mpox interventions, Dr Ngashi Ngongo, Africa CDCs mpox incident manager, said on Thursday.\n\nBisengimana health workers Looters made away with iron sheets, medicine, gloves and masks at Bisengimana hospital as fires were lit outside the facility\n\nOver the last week, the Africa CDC says the number of missing mpox patients has risen by 100 as fighting escalates and the rebels take more territory.\n\nDr Ngongo added that a new variant of mpox with high potential for higher transmissibility had also been detected in DR Congo.\n\nThe countrys ability to respond to the disease has been hampered by the conflict, between the M23 and DR Congos army, as well as a lack of funding.\n\nThe mpox facility at Mugunga, funded by the UN childrens agency (Unicef) and BrItish government aid, managed to reopen last week.\n\nBut it is already so overstretched that there are times when four or five patients have to share one bed.\n\nSadiki Bichichi Aristide arrived at the Mugunga clinic a week ago after falling sick at camp for people displaced by the fighting\n\nI first fled from Minova to Goma when the M23 rebels began to advance from there, Sadiki Bichichi Aristide, a 23-year-old being treated at Mugunga along with two of his children, told the BBC.\n\nI began to fall sick in a [camp for displaced people]. It started with my fingers, and then I had lesions, which began to rupture on my hands. My neighbours told me to go to Mugunga with my children. I left my wife behind.\n\nHe said he had seen so many people with mpox before he arrived at the clinic last week.\n\nDr Oummani Rouafi, Unicefs Goma health specialist, told the BBC that the only reason Mugunga hospital had reopened was because staff had managed to hide some equipment and medicine from the looters.\n\nBut this had not been the case at many other treatment centres that had been completely ransacked, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/03163622/mpox-drc.webp",
            "description": "<p>BBC More than 500 mpox patients have fled clinics in eastern Democratic Republic of Congo over the last month amid the current conflict. Officials at Africa Centres for Disease Control and Prevention (Africa CDC), a leading health agency on the continent, have said they are worried as the missing patients risk spreading the highly contagious</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dr-congo-conflict-500-mpox-patients-flee-clinics-after-rebel-looting/\">DR Congo conflict: 500 mpox patients flee clinics after rebel looting</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "Judge drags “sick” Chimombe to the dock after skipping trial; commencement drags on five months later",
            "url": "https://www.newzimbabwe.com/judge-drags-sick-chimombe-to-the-dock-after-skipping-trial-commencement-drags-on-five-months-later/",
            "content": "By Mary Taruvinga\n\nHigh Court judge Justice Pisirayi Kwenda has ordered the Zimbabwe Prisons and Correctional Service (ZPCS) to bring fraud-accused businessman Mike Chimombe before the court this afternoon, having initially skipped amid reports that he is not well.\n\nTrial in a case Chimombe is jointly charged with his colleague, Moses Mpofu, on allegations of swindling the state of US$7 million in a botched goats tender. The trial was scheduled to start at 1000 hours but Chimombe was in a show for the second time.\n\nLast week, the trial could not commence after the court was notified that Chimombe was sick and needed seven days to recuperate.\n\nKwenda had no kind words for the ZPCSand both parties after he only learnt that Chimombe was not in attendance after the court sat.\n\nFive months later, the trial has beenpostponedseveral timeson various grounds.\n\nProfessor Lovemore Madhuku, taking instructions from Ashiel Mugiya, who is representing Chimombe, asked for a postponement.\n\nMadhuku also placed the blame on the State for not letting the court know Chimombes whereabouts.\n\nHe has been unwell since last week. This matter was postponed last week in the hope that he will be able to stand trial but we are informed that he is still unwell and was advised to further rest starting from the 28th.\n\nMadhuku said he was relying on information he was told by Mpofu as well as Chimombes relatives.\n\nKwenda then ordered the prisons officer who was in charge at the High Court to bring Chimombe to court at 1400 hours or come before the court with a detailed formal report on why he cannot attend court.\n\nPCO Chikoto was grilled for failing to bring Chimombe and failing to update the state and defence on what was unfolding.\n\nDo I have to remind you that it is your responsibility to bring the accused to the court? This is your statutory obligation. Thats why you exist, fumed Kwenda, further asking the officer his suggestions on the way forward.\n\nChikoto said, Maybe the court should request him to appear.\n\nKwenda hit back. As court, we dont request prisons to bring an accused to court. Its an order, and I expected to see the accused in court as was ordered last week.\n\nChikoto suggested that Chimombe could appear this Tuesday.\n\nHowever, Kwenda said he will not tolerate that.\n\nIt is not up to you to keep him at prison if he is needed at court. You listen to court orders. He should be here at 2 pm; if not then you will explain, ordered the judge.\n\nMadhuku then informed Kwenda that his client and Mpofu had an appeal being heard at the Supreme court at the same time.\n\nThe prominent lawyer also explained that at law, two courts cannot sit to hear matters involving the same people at the same time.\n\nKwenda said he could not rescind his ruling.\n\nMadhuku insisted that the judge should reverse its ruling because it was handed down while he was not aware of the case being heard at the upper court.\n\nIf the courts want to see him for something else, he can be her, but if it is for trial ,he has to be represented in accordance with the law.again thats not allowed; this court can only sit with the accused as a trial court and nothing other than that.\n\nI think you have a room to correct your order, my Lord, Madhuku said, adding that all lawyers in the matter will be arguing their clients cases at the Supreme Court; as such, no one will be available at the High Court.\n\nKwenda said his court will sit even if the lawyers do not show up.\n\nIf you want to be at the Supreme Court, the court will sit and deal with the matter. Note that the court is always fair and aware of his rights to legal representation.\n\nHe also blamed the state and the lawyers for failing to inform him about Chimombes absence in advance.\n\nThe judge also expressed his disappointment on how the trial commencement has failed to start for five months, also suggesting that parties should consider if the case should still be live-streamed.\n\nWitnesses were also dewarned because of the uncertainty.\n\nThe judge said they should stay within the courts jurisdiction in case they will be called at short notice.\n\nThe ZPCS later brought Chimombe to court.\n\nHe looked sick and slept in the dock as the judge asked him how to proceed.\n\nI have nothing to say. Had already given my lawyer instructions, he responded.\n\nThe matter was then postponed to March 17 for trial commencement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03215456/WhatsApp-Image-2024-10-03-at-12.49.46.jpeg",
            "description": "<p>By Mary Taruvinga High Court judge Justice Pisirayi Kwenda has ordered the Zimbabwe Prisons and Correctional Service (ZPCS) to bring fraud-accused businessman Mike Chimombe before the court this afternoon, having initially skipped amid reports that he is not well. Trial in a case Chimombe is jointly charged with his colleague, Moses Mpofu, on allegations of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/judge-drags-sick-chimombe-to-the-dock-after-skipping-trial-commencement-drags-on-five-months-later/\">Judge drags “sick” Chimombe to the dock after skipping trial; commencement drags on five months later</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        },
        {
            "title": "‘Help bring us home’ – Zimbabwean permit holders say life in SA has become intolerable",
            "url": "https://www.newzimbabwe.com/help-bring-us-home-zimbabwean-permit-holders-say-life-in-sa-has-become-intolerable/",
            "content": "By MoneyWeb\n\nThe Zimbabwe Exemption Permit Holders Association (Zepha) has asked the Zimbabwean government for help in expediting an urgent programme of voluntary return in light of the increasingly intolerable conditions for many of its members living in SA.\n\nZimbabweans are now forced to litigate when they go to the hospital, schools, universities, travel on the roads, and at the work place, says a memo sent by Zepha to the Zimbabwean ambassador to SA.\n\nZepha adds that it has already launched a repatriation programme, but would like the Zimbabwean governments help in assisting with the relocation of thousands of ZEP holders in finding accommodation and business opportunities, and to assist in lowering regulatory barriers to smooth their return.\n\nMany South Africans believe that Zimbabweans are hapless Zanu-PF victims useful only for their highly sought-after cheap, efficient, and trustworthy labour, reads the memo.\n\nTheir assistance for Zimbabwean staff extends only to prolonging exploitation, but not to provide Zimbabweans with the rights required to live full and dignified lives. In my view, they have no interest in the stability of Zimbabweans in South Africa, and the generations that will follow.\n\nThe majority black population in South Africa blames Zimbabweans for taking jobs, homes, medical services and economic opportunities, it says, adding that vigilant groups have been organised to harm, rob and even kill Zimbabweans, yet there has been no prosecution of the perpetrators.\n\nPhysically targeted\n\nXenophobia has been mainstreamed by political parties such as the Patriotic Alliance, MK Party and ActionSA, it adds, while quasi-militias operating as Operation Dudula and Put South Africa First have physically targeted foreigners, but more specifically Zimbabweans.\n\nThese attacks appear orchestrated and intensify during elections and national crises such as Covid and load shedding, it says.\n\nThe white minority blames Zanu-PF for ruining the Zimbabwean economy and forcing its citizens to flee to SA to avoid poverty, political persecution and maladministration, it adds.\n\nThe mainstream media, which they control, have successfully sold the South African population the idea that Zimbabwe is a failed state, which will never recover without them, and that it stands as an example of what could happen to South Africa if their interests are not protected, the memo adds.\n\nThe abuse of Zimbabweans in South Africa has caused significant psychological and emotional harm to all Zimbabweans in South Africa.\n\nIt is a matter that, in the view of many medical doctors and academics, cannot continue.\n\nThe memo also says Zimbabwean children in SA are being raised and conditioned to believe that they are second-class citizens. This is because their parents are humiliated, degraded, mistreated, and publicly scorned by what appears to be state-sponsored anti-Zimbabwe rhetoric.\n\nDiscrimination\n\nThe memo goes on to detail specific instances of discrimination that it claims have been happening, including:\n\nThe Department of Home Affairs (DHA) is accused of frustrating the rights of ZEP holders to apply for permanent residence, as allowed under the Immigration Act, even though they have lived, worked and paid taxes in SA for decades.\n\nThe DHAs decision to terminate the ZEP programme was found to be unlawful and unconstitutional in 2023 by the Gauteng High Court, which ordered the government to conduct public participation with the ZEP community.\n\nThe ZEP programme was then extended to the end of 2025, a deadline many of those applying forpermanent residence are unlikely to meet, argues Zepha.\n\nZEP holders are required to make online appointments with the visa processing company VFS, but many have received no appointment after four or more months of waiting.\n\nThis means their applications will not be processed before the expiry of the programme at the end of the year.\n\nNobody can reach their full potential in a toxic environment that is the reality for Zimbabweans in South Africa,concludes the Zepha appeal to the Zimbabwean ambassador.\n\nHistory has taught us that the return of significant numbers of the diaspora back to their country of origin, in various jurisdictions at various times, has led to economic development, transfer of skills, diversity of industry, and national pride.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/03065558/ZEP-holders-South-Africa.jpg",
            "description": "<p>By MoneyWeb The Zimbabwe Exemption Permit Holders Association (Zepha) has asked the Zimbabwean government for help in expediting an urgent programme of voluntary return in light of the increasingly intolerable conditions for many of its members living in SA. “Zimbabweans are now forced to litigate when they go to the hospital, schools, universities, travel on</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/help-bring-us-home-zimbabwean-permit-holders-say-life-in-sa-has-become-intolerable/\">‘Help bring us home’ – Zimbabwean permit holders say life in SA has become intolerable</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "04 Mar 2025"
        }
    ]
}