{
    "news": [
        {
            "title": "United in love and refusal to dig into divisive politics: A biblical perspective",
            "url": "https://www.newzimbabwe.com/united-in-love-and-refusal-to-dig-into-divisive-politics-a-biblical-perspective/",
            "content": "SUNDAY MORNING TABLET\n\nUnited in love: A call to resilient resistance\n\nSCRIPTURE:\n\nAnd let us not forget to do good and to share with those in need, for such sacrifices are pleasing to God.  Hebrews 13:16 (NLT)\n\nIn a world where politics often divides us, we are called to be different. As a community united by love and togetherness, we must transcend the petty squabbles of politics and use our collective power to uplift one another. Politics should be a tool for the betterment of our lives, not a weapon to suppress and exploit.\n\nUnfortunately, many African countries are plagued by leaders who wield power to oppress their citizens. But we, as children of God, must not be swayed by their selfish interests. Instead, we must stand united, refusing to be divided by their tactics.\n\nIn the face of abuse and exploitation, we are not called to resort to violence. Rather, we are called to exercise resilient resistance, standing firm in our convictions and refusing to be used for selfish purposes that render us poor and powerless.\n\nLet us pray for sanity to return to our leadership, that they may govern with wisdom and justice. Let us pray for our countries to come back to order, that peace and prosperity may reign.\n\nPRAYER:\n\nHeavenly Father, we pray for unity and love to prevail in our communities. Grant our leaders wisdom and justice, and deliver us from the grip of oppression. Give us the strength to stand resilient in the face of abuse, and to refuse to be divided by selfish interests. May Your will be done on earth as it is in heaven.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>SUNDAY MORNING TABLET United in love: A call to resilient resistance SCRIPTURE: “And let us not forget to do good and to share with those in need, for such sacrifices are pleasing to God.” – Hebrews 13:16 (NLT) In a world where politics often divides us, we are called to be different. As a community</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/united-in-love-and-refusal-to-dig-into-divisive-politics-a-biblical-perspective/\">United in love and refusal to dig into divisive politics: A biblical perspective </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "Killer nurse suffocated daughter (2) to death in twisted ‘revenge’ for losing custody battle with ex-partner",
            "url": "https://www.newzimbabwe.com/killer-nurse-suffocated-daughter-2-to-death-in-twisted-revenge-for-losing-custody-battle-with-ex-partner/",
            "content": "By The Sun\n\nA NURSE suffocated her toddler daughter to death in a twisted act of revenge after losing a custody battle with her ex-partner.\n\nShilyrand Charigwati, 30, used a plastic bag to murder two-year-old Roselyn at her home in Hemel Hempstead, Hertfordshire.\n\nShe then tried to claim she had no recollection of killing her daughter and blamed mental health issues.\n\nBut police discovered Charigwati had separated from Roselyns father and had lost custody of her daughter.\n\nJailing the nurse for life with a minimum of 16 years, Mrs Justice Williams said spousal revenge was a factor in the horror.\n\nThe judge added: Rose was extremely vulnerable due to her age.\n\nThis was a shocking abuse of trust.\n\nLuton Crown Court heard the horror unfolded just months after Charigwati lost custody of Roselyn.\n\nA few days before she murdered her daughter, neighbours said the nurse appeared to be tired of life.\n\nThe court that until the terrible incident, Charigwati had been a loving and devoted mum.\n\nBut she said she had showed an unusual amount of anger towards Roselyns dad following the family court proceedings.\n\nThis rage turned violent when Charigwati suffocated the toddler before ringing police to say she may have killed her daughter.\n\nRoselyn was rushed to hospital but she tragically could not be saved and was declared dead on April 14 last year.\n\nCharigwati initially pleaded guilty to manslaughter on the grounds of diminished responsibility.\n\nShe claimed she was suffering from a mental health condition but prosecutors said she had a mild to moderate depressive illness.\n\nJohn Price KC argued this was not enough to impair Charigwatis ability to make a rational judgment.\n\nJurors agreed and the mum was found guilty of murder following a trial.\n\nIn a moving tribute, Roselyns dad, Washington, said no words could express his pain.\n\nHe said the youngster was joyful, funny, playful, beautiful, and so full of love.\n\nThe dad added: She was the kind of daughter every parent would dream of having. She touched so many hearts wherever we went, and everyone adored her.\n\nEvery part of being her dad was amazing. As her father, the pain of losing Roselyn is something I carry with me every single day.\n\nBut so is the joy of having known her, held her, and loved her unconditionally. She is with me always.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/27053239/newspress-collage-n8yzmxq67-1745492967752-1.webp",
            "description": "<p>By The Sun A NURSE suffocated her toddler daughter to death in a twisted act of revenge after losing a custody battle with her ex-partner. Shilyrand Charigwati, 30, used a plastic bag to murder two-year-old Roselyn at her home in Hemel Hempstead, Hertfordshire. She then tried to claim she had “no recollection” of killing her</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/killer-nurse-suffocated-daughter-2-to-death-in-twisted-revenge-for-losing-custody-battle-with-ex-partner/\">Killer nurse suffocated daughter (2) to death in twisted ‘revenge’ for losing custody battle with ex-partner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "The Cost of Silence: How France’s Refusal to Share Accurate Landmine Data Continues to Claim Lives",
            "url": "https://www.newzimbabwe.com/the-cost-of-silence-how-frances-refusal-to-share-accurate-landmine-data-continues-to-claim-lives/",
            "content": "ByIsaacEdotomDzokpo\n\nFrance still refuses to acknowledge its involvement in planting millions of landmines across Algerian territory during the colonial war. According to Algerian experts, the maps handed over in 2007 are outdated and no longer reflect the actual locations of the explosive devices. This silence has become deadly: every step on the ground could lead to tragedy, and the country is left to confront this threat on its own.\n\nOn April 4, the UN Human Rights Council unanimously and without a votesupported a resolutioncalling on countries to comply with the 1997 treaty banning the use of mines, to protect and ensure human rights.\n\nThe initiative was spearheaded by Algeria, which is most familiar with the effects of the mine threat.\n\nHowever, 1956 through 1962, during the Algerian War of Independence, France laid 11 million mines along Algerias eastern and western borders.\n\nThe anti-personnel mines left behind by French colonialism represent one of Algerias greatest humanitarian disasters. Buried under Algerian soil, these mines continued to kill and maim the local population even after the national liberation war, Cameroons Africa Plus News television channel said on April 6.\n\nOn the same day when this statement was made  April 6, in Azerbaijan (a co-sponsor country of the UN resolution)as a result oftwo incidents of mine blast 4 people were injured at once.\n\nIn thefirst case an employee of the demining center, who had his leg amputated as a result.In the second, a father with two young children, aged 11 and 13, suffered multiple shrapnel wounds to their legs and arms.\n\nAzerbaijan isthe second most mine-contaminatedcountry in Europe after Ukraine.\n\nFor almost 30 years, parts of Azerbaijan have been occupied by Armenia, Frances closest ally. With the support of its patrons, Armenia laid more than 1.5 million mines there, which have claimed the lives of civilians to this day.\n\nAlgeria and Azerbaijan  a common echo of explosions\n\nTo prevent the infiltration of Algerian revolutionaries and weapons from Tunisia and Morocco during the Algerian War of Independence, minefields were established by the French colonial power along the 1,710 kilometers of Algerias eastern and western borders. As a result, 3 million Algerians living in the border areas were displaced.\n\nSince then, 7,300 civilians have fallenvictimto mines in Algeria, 4,830 of them during the war and 2,470 since independence.\n\nDespite the fact that Algeria has cleared more than 62,000 hectares of land, cleared nearly 9 million mines and declared itself an anti-personnel mine-free country in 2017, thereare stillcases of villagers, farmers and children being blown up.\n\nIt is alleged that France did not hand over maps with the location of minefields to Algeria until 2007. And when it did hand over  the maps were not complete.There are more than 2,200,000 of them [mines], and France has so far handed us only part of the maps showing where they are planted. As for humanity, Mr. President Macron, while you aretalking about human values, there are citizens who have had limbs amputated and those who have died because of these mines. Not a day goes by that we dont hear about a mine explosion that injured a person, and we are already living in 2025! said former Algerian politician Ahmed Khalifa on April 6.\n\nThe situation in Algeria is strikinglysimilar tothe situation in Azerbaijan, which is thousands of kilometers away. From 1991 to 2020, part of Azerbaijani territories was under Armenian occupation. During this time, more than3,400people suffered from mines laid by Armenians.\n\nIn 2020. Azerbaijan managed to regain control over the occupied territories, but this did not solve the problem ofminecontamination. Since 2020, more than390people have fallen victim to mines.\n\nHasanliAliyev, who had his leg amputated as a result of the blast, recalled onEuronews:I was 23 years old when I stepped on a mine. Like any young man, I had big dreams and goals. The mine explosion had a huge impact on my life.\n\nArmenia, like its patron France in the Algerian situation, initially claimed it did not have maps of the minefields, and when it did hand them over, they were only 25% accurate. A spokesman for the Azerbaijani Foreign Ministry said on April 4 thatmore than 55% of recent mine accidents occurred in territories not covered by these maps.\n\nSince 2020. Armenia and Azerbaijan have been negotiating a final peace treaty. But the normalization of relations between these countries does not correspond to the interests of France, which seeks to maintain a hotbed of tension in the South Caucasusin order tohave leverage over the countries of the region.\n\nTherefore, while Baku and Yerevan are holding peace talks, France is supplying offensive weapons to Armenia, which may provoke a new conflict in the region.\n\nIn June 2024, during the visit of the Armenian Defense Minister to France, the parties signed a contract for thesupplyof French CAY CAESAR howitzers to Armenia.\n\nAn agreement on military-technical cooperation was also signed between the Armenian Defense Ministry and KNDS military-industrial company, which produces various types of military equipment, including tanks and self-propelled artillery systems. France has also initiated the dispatch of a European observation mission to Armenias border with Azerbaijan, which is essentially engaged in intelligence activities there.\n\nFrance its alleged to have pursued a similar policy in Africa, where it has repeatedly been accused of using the pretext of a terrorist threat to maintain its presence there.\n\nFor decades, France has maintained influence in its former colonies by supporting and protecting loyalist regimes from military coups, using the pretext of fighting terrorism in the Sahel region to deploy its own troops, and imposing the CFA franc. The main goal of Paris in this case was to maintain access to natural resources of African countries and to establish control over their financial system. Experts estimate that France receives 500 billion dollars annually from Africa.\n\nCompensation for Mine Terror\n\nDue to the growing mine threat in the world, especially after the start of the Russian-Ukrainian war, there are increasing calls for a ban on the use of anti-personnel mines, as well as compensation for their victims.\n\nThe Mine Justice Campaign waslaunchedat the 58th session of the UN Human Rights Council in Geneva. Its aim is to get the UN Human Rights Council to recognize the right of mine victims to compensation  both from the companies that produce mines and the governments that lay them.\n\nAlgeria has for several years been calling on France to compensate victims of mines laid by French colonial rule in Algeria.The crime of the French colonizer cannot go unpunished,BouzidLazhari, head of the Algerian National Council for Human Rights,saidin 2021, urging Algerians to continue their fight for compensation. France has completely ignored these calls.\n\nAt the same time, Azerbaijan carries out demining at its own expense and calls on the international community to hold Armenia responsible for the mine terror against Azerbaijan.\n\nHowever, given the fact that Armenia has not yet handed over maps with the exact location of minefields in the previously occupied territories, it is apparently too early to talk about paying compensation to the victims.\n\n",
            "image_url": null,
            "description": "<p>By Isaac Edotom Dzokpo France still refuses to acknowledge its involvement in planting millions of landmines across Algerian territory during the colonial war. According to Algerian experts, the maps handed over in 2007 are outdated and no longer reflect the actual locations of the explosive devices. This silence has become deadly: every step on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-cost-of-silence-how-frances-refusal-to-share-accurate-landmine-data-continues-to-claim-lives/\">The Cost of Silence: How France’s Refusal to Share Accurate Landmine Data Continues to Claim Lives</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "Diaspora Insurance backs Zimbabwe’s Mabika for Manchester Marathon",
            "url": "https://www.newzimbabwe.com/diaspora-insurance-backs-zimbabwes-mabika-for-manchester-marathon/",
            "content": "By UK Correspondent\n\nUNITED KINGDOM: Zimbabwean middle-distance runner, Royal Mabika, will be participating in this years Manchester Marathon with the support of global risk solutions firm,Diaspora Insurance.\n\nMabika, who is based in the United Arab Emirates, is running to raise school fees for close to one hundred children from his Zaka home district in Masvingo province.\n\nIm happy to be lining up for theManchester Marathonon a charity mission very close to my heart, said Mabika.\n\nIm running to sponsor education for rural kids at different schools in Zaka Jerera District (clickhereto donate).\n\nHe added; I have always wanted to use my sporting influence for the benefit of the less privileged.\n\nI would want to appreciate different partners and stakeholders for supporting my initiative.\n\nIn particular Im very grateful toDiaspora Insurancefor sponsoring the whole initiative and making a long-lasting impact in the community.\n\nA representative forDiaspora Insurancesaid, We are thrilled to support Royal Mabika at this years Manchester Marathon.\n\nWe believe in empowering athletes to achieve their best, and were proud to be part of Mabikas path to success and with worthy causing he is running for.\n\nWishing him all the best for a great race!\n\nAmong other achievements, Mabika has won the 10km Mai Dubai City Half Marathon in Abu Dhabi.\n\nThe adidas Manchester Marathon, the UKs second largest marathon and one of Europes largest is an iconic event drawing participants from all over the world to the vibrant streets of Greater Manchester.\n\nSome 140,000 supporters are expected to cheer the runners this year.\n\nWe pride ourselves in welcoming all to take on our 26.2-mile challenge, from some superb and elite runners, to those who thought completing a marathon would never be possible, said the organisers.\n\nMany regular runners find this the ideal event to get a personal best time, whilst everybody finds the incredible Mancunian support throughout the course unforgettable.\n\nA record 36,000 people signed up to participate in this years marathon, up from the 32,000 who registered in 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/26105153/Royal-Mabika-News.png",
            "description": "<p>By UK Correspondent UNITED KINGDOM: Zimbabwean middle-distance runner, Royal Mabika, will be participating in this year’s Manchester Marathon with the support of global risk solutions firm, Diaspora Insurance. Mabika, who is based in the United Arab Emirates, is running to raise school fees for close to one hundred children from his Zaka home district in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/diaspora-insurance-backs-zimbabwes-mabika-for-manchester-marathon/\">Diaspora Insurance backs Zimbabwe’s Mabika for Manchester Marathon</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "Rowan Atkinson’s “Mr Bean” animated to premiere on Cartoonito Africa",
            "url": "https://www.newzimbabwe.com/rowan-atkinsons-mr-bean-animated-to-premiere-on-cartoonito-africa/",
            "content": "By IOL\n\nONE of televisions most beloved characters, Mr. Bean, is set to grace the small screen once again.\n\nSeason four of the Mr Bean animated series will premiere on Cartoonito Africa (DStv channel 302) on Monday, May 5.\n\nCreated 30 years ago, and relished by both children and adults around the globe, the animated series continues to capture hearts.\n\nDeveloped by the multi-talented Rowan Atkinson, who is also the executive director, the latest season promises to be packed with laughter and charming antics, continuing a legacy that has entertained audiences for decades.\n\nMr. Bean first emerged in live performances before becoming a household name on television and film. The animated series, which launched in 2002, has since reached audiences in 195 territories, encapsulating the hearts of millions.\n\nThe brand has some 140 million followers on Meta, 72 million subscribers and 19 billion lifetime views across official YouTube channels, 10 million followers on Instagram and 14.2 million likes on TikTok.\n\nMr Bean season 4 will premiere on Cartoonito Africa (DStv channel 302) on Monday, May 5.\n\nFeaturing a total of 52 episodes this season, the show continues to follow Mr Bean and his trusty companion Teddy, as they embark on a series of adventures, making plenty of mischief along the way.\n\nIn an exclusive interview with Independent Media Lifestyle, Atkinson shared insights into Mr. Beans enduring international appeal, attributing his success to the characters childlike essence.\n\nI think the key to why Mr. Bean has had the global success that he has is because he is a child  Mr. Bean is essentially a child trapped in a mans body, said Atkinson.\n\nReminiscing about how his experiences on a trip to Venice in the mid-1980s inspired him to create a figure that would connect with audiences beyond the UK, Atkinson said that his vision of a non-verbal character was a strategic move to bridge language barriers that traditionally hindered comedians from reaching a global audience.\n\nAt the beginning, I did sense that there was a strong possibility that Mr Bean would have success outside the UK.\n\nI was inspired by a visit to Venice, where I was so aware of how musical artists always leaned towards an international audience, whereas comedians and actors back home tend to assume their main audience will be in their own country because of the language barrier.\n\nI thought, wouldnt it be nice to try and create something that actually did have a chance on the international stage \n\nThe idea of putting a relatively non-verbal character on television was a knowing act to go beyond my own country, and when that success happened, it didnt come as a shock, it was the fulfilment of the plan, explained Atkinson.\n\nAs excitement builds for the new season, Atkinson hinted at a fresh creative direction.\n\nThis season, we bring in new characters, theres a little boy, a neighbour who thinks very differently from the way Mr. Bean thinks, so weve expanded the creative landscape in which the character is placed.\n\nAll the episodes in the new series is a welcomed development  We are very proud of this new series, I think its very good, he shared.\n\nAmong Atkinsons favourites from the new season is an episode featuring Mr. Beans efforts to get his full refuse bin emptied.\n\nIve got about 15 favourites out of the 52 episodes weve done. I like the ones that are very Mr. Bean. Theres an episode where his bin is filled to the brim and the lid wont close, so the refuse collectors wont take it away, so Mr. Bean is running his bin on wheels along the street to find the refuse truck and get rid of it \n\nIts just a very Mr. Bean-like problem, and I think its a problem we all identify with.\n\nWhile the series does not aim to convey grand societal messages, Atkinson emphasises the characters light-hearted essence, noting that life can be fun, particularly if youre a little bit naughty.\n\nI think Mr. Bean likes to enjoy himself. There is no overarching social or political ambition to the Mr. Bean animated series, we are not trying to load it with messages about how you should behave, and anyway, Mr. Bean is an example of how you shouldnt behave, but thats why people enjoy watching.\n\nThe Mr Bean character was developed by the multi-talented Rowan Atkinson.\n\nWith over three decades of growth, Atkinson believes Mr. Bean has gradually developed into a more multi-dimensional character, and his increased dialogue in the last two animated series reflects this evolution.\n\nOver the years, Mr. Bean has changed; he has developed. I think he is slightly more interesting, a slightly more three-dimensional character now than he was, but he is still the same man, the same child trapped in a mans body.\n\nI think in the last two animated series hes spoken a lot more, and I like that, I find it funny.\n\nAddressing his fans in South Africa, Atkinson expressed gratitude for their support, assuring them that this new season will offer the same delightful chaos theyve cherished for years.\n\nDespite the characters immense fame, Atkinson said he enjoys a low-key existence, refraining from the pressures of social media and focusing on his craft.\n\nI try to enjoy the bits that are good and try and avoid the bits that arent good. I have to say that I find it very relaxing not being a part of social media on a personal level.\n\nIm pleased that I havent been sucked into that, which many actors and performers feel they should engage with, thus keeping the worst aspects of global recognisability at bay  try to avoid it if you can.\n\nWhen I watch myself on TV, I detach myself, all I think about is the character, and whether the character is working and if Ive done a job with the voice recordings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/26070033/Screenshot_20250426-075111_1.jpg",
            "description": "<p>By IOL  ONE of television’s most beloved characters, Mr. Bean, is set to grace the small screen once again. Season four of the “Mr Bean” animated series will premiere on Cartoonito Africa (DStv channel 302) on Monday, May 5. Created 30 years ago, and relished by both children and adults around the globe, the animated</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rowan-atkinsons-mr-bean-animated-to-premiere-on-cartoonito-africa/\">Rowan Atkinson’s “Mr Bean” animated to premiere on Cartoonito Africa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "Crowds gather for Pope Francis’ funeral Mass at the Vatican",
            "url": "https://www.newzimbabwe.com/crowds-gather-for-pope-francis-funeral-mass-at-the-vatican/",
            "content": "By CNN\n\nTHRONGS of mourners are gathering in Vatican City and lining the streets of Rome on Saturday to give a final send-off to Pope Francis, who will be remembered as a champion of migrants and the poor, and for his efforts to reshape the Catholic Church.\n\nHis funeral Mass is being held on the steps of St. Peters Basilica, one of the Catholic Churchs most important sites, with more than 50 world leaders and 11 reigning monarchs in attendance. They are expected to include US President Donald Trump, Argentine President Javier Milei, Italian Prime Minister Giorgia Meloni and Filipino President Ferdinand Romualdez Marcos Jr., head of the largest Catholic nation in Asia.\n\nThe Vatican has prepared for as many as 250,000 people to flock to St. Peters Square and one million more to line the 6-kilometer (3.7 mile) procession route from Vatican City through Rome to the Basilica di Santa Maria Maggiore, in hopes of seeing the popes modest coffin as it travels to his final resting place.\n\nMany more of worlds 1.4 billion Catholics will watch the funeral for the first Latin American pope on TV.\n\nPope Francis died at the age of 88 after suffering a stroke on Easter Monday, just one day after he appeared in the same square to offer a blessing to the faithful at the high point of the Christian calendar.\n\nIn the days that followed, about 250,000 mourners came to pay their final respects as his body lay in state inside St. Peters Basilica. His coffin was officially sealed on Friday night in a liturgical rite led by the Cardinal Camerlengo Kevin Farrell, the acting head of the church.\n\nAs daylight gleams off the massive travertine columns of St. Peters Square on Saturday morning, the funeral Mass will open with the chant, sung in Latin: Eternal rest grant unto him, O Lord, and let perpetual light shine upon him.\n\nA Bible reading will be given in English, and a Prayer of the Faithful will be offered up in multiple other languages, including French, Arabic, Portuguese, Polish, German and for the first time, Mandarin, fitting for a pope who sought to reach out to followers in all parts of the globe.\n\nIn keeping with tradition, the Mass will include a homily and communion and end with a final commendation and farewell. Francis approved the order of the day for Saturday back in June 2024.\n\nBut other elements of the day will be pared back, as Francis had sought to simplify and adapt proceedings, so that the papal funeral is that of a pastor and disciple of Christ, and not of a powerful person in this world, according to Vatican officials.\n\nFrancis, who chose his name in honor of St. Francis of Assisi, with his commitment to poverty, peace and nature, also wanted to reflect his own dedication to the homeless and disadvantaged in the days events.\n\nHe believed the poor have a privileged place in the heart of God, a Holy See statement said. For this reason, a group of poor and needy people will be present on the steps leading to the papal Basilica di Santa Maria Maggiore to pay their last respects to Pope Francis before the burial of his coffin.\n\nThey will be the last members of the public to see his wooden coffin, after its driven slowly through the streets of Rome  past tourist highlights like the Piazza Venezia and the ancient Colosseum  in his final procession.\n\nFrancis will become the first pope in more than three centuries to be buried at Santa Maria Maggiore, with the interment taking place away from the public eye.\n\nHe was a pope of many firsts  the first Latin American Pontiff, the first of the Jesuit order and the first modern-day pope born outside of Europe.\n\nElected in 2013 as an outsider candidate from Argentina, Francis went on to usher in progressive reforms, including the promotion of womens roles in the church.\n\nBut his 12-year leadership was not without criticism. He took some important steps to address the Catholic Churchs clerical sexual abuse scandals, but campaigners and survivors say there is still much more to do.\n\nDivisions within the Church over same-sex relationships also persisted throughout his papacy. When asked about his position on sexual orientation, the pope famously said, Who am I to judge? but also reaffirmed the Churchs position that homosexuality is considered sinful.\n\nAnd his record was disparaged by some of the more conservative cardinals and members of the Church.\n\nFrancis issued a rebuke of the Trump administrations immigration policy earlier this year, and criticized Vice President JD Vances use of theology to defend its approach. Vance was one of the last people to meet with the pope, in a brief encounter on Easter Sunday.\n\nThe next pope will be chosen by cardinals from around the world in conclave, a closed-door process that may see a battle play out between those who want to continue Pope Francis progressive path and those who want to reverse it.\n\nCatholics throughout the world have differing opinions, but many believers gathered in Vatican City this week told CNN that they are proud of Francis record.\n\nHe made some good changes in the Church. I think the Church is now more open, said Laura Grund, from Leipzig, Germany, who was among the last people to see the late pope lying in state. He opened many doors.\n\nHe was a very simple man, who loved other people, said Sister Luisa, a nun from Munich. We feel very blessed, but also deep sorrow.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/01/31172615/Pope-Francis.png",
            "description": "<p>By CNN THRONGS of mourners are gathering in Vatican City and lining the streets of Rome on Saturday to give a final send-off to Pope Francis, who will be remembered as a champion of migrants and the poor, and for his efforts to reshape the Catholic Church. His funeral Mass is being held on the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/crowds-gather-for-pope-francis-funeral-mass-at-the-vatican/\">Crowds gather for Pope Francis’ funeral Mass at the Vatican</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "ZITF 2025: Trade through Beira Corridor needs to be fully exploited— President Chapo",
            "url": "https://www.newzimbabwe.com/zitf-2025-trade-through-beira-corridor-needs-to-be-fully-exploited-president-chapo/",
            "content": "By Staff Reporter\n\nTRADE between Zimbabwe and Mozambique needs to be enhanced through the existing Beira Corridor, Mozambican President Daniel Chapo has said.\n\nThe two nations, he said, need to deepen economic complementarity and create economies of scale using the sister republics existing natural resources, infrastructure, and logistical means, especially the Beira Corridor.\n\nOfficially opening the 65th Edition of the Zimbabwe International Trade Fair (ZITF) in Bulawayo on Friday, the visiting President said there were various areas of cooperation that could be tapped into.\n\nOur country, being a member state and part of the African Continental Free Trade Area, SADC, benefits from various preferential regimes in the United States of America (AGOA), Europe, and Asia, particularly China, Japan, India, among others, and allows access to a vast market in the region, continent, and world, President Chapo said.\n\nOur presence at this important fair represents our determination to boost and facilitate trade between Mozambique and Zimbabwe in particular and with the world in general, as well as attract foreign direct investment from Zimbabwe and the countries represented here for the agriculture, industry, transport, and logistics sectors, among others, thereby stimulating our commercial relations through economic complementarity and the creation of economies of scale using our existing natural resources, infrastructure, and logistical means, especially the Beira Corridor, Chapo said.\n\nZimbabwe boasts vast reserves of natural resources, particularly arable land, forests, and world-renowned wildlife reserves such as Victoria Falls. It has strategic mineral resources like gold, lithium, and copper, among others, which contribute to positioning its economy as an economic powerhouse and a source of foreign direct investment in the region, without neglecting its role as the regions and continents granary in the past.\n\nMozambique has immense reserves of soil and subsoil resources, particularly 35 million hectares of arable land, availability of water, natural gas, various types of minerals, a long coastline, and logistical infrastructure that facilitates access to the sea for hinterland countries in the SADC region.\n\nDespite the geographical proximity, the immense natural and strategic resources to be explored, and the historical political ties of friendship between the two countries, commercial relations, and investments are still incipient and consist of low-value-added products, mostly commodities, without significant variation in their structure or composition over the years.\n\nAccording to the Mozambique-Zimbabwe Trade Balance, from 2020 to 2024, Mozambiques exports to Zimbabwe totaled USD 804 million, while imports totaled USD 134.9 million, despite a 4% decrease in exports and a 66% increase in imports during the period under review.\n\nIn terms of exports, Zimbabwes strategic position on Mozambiques list of trading partners in 2024 was 15th, corresponding to 1% of exports. The main products exported to Zimbabwe were: electrical energy, mineral or chemical fertilizers, nitrogenous; mineral or chemical fertilizers of mixtures, cooked or stuffed pasta, other tubes and hollow profiles, aluminum wires, mineral or chemical fertilizers, potassium, petroleum oils or bituminous minerals, rice, palm oil and its fractions.\n\nIn terms of imports, Zimbabwes strategic position on Mozambiques list of trading partners was 37th, corresponding to 0.3% of imports. The main products imported from Zimbabwe were: unmanufactured tobacco and its waste, flours, powder and pellets of inedible animals, corrugated paper and cardboard, tiles and slabs for paving, insulated conductors for electrical use, seeds, fruits and spores for sowing, cereal-based products, live poultry, raw wood, various food preparations.\n\nIn terms of Foreign Direct Investment from Zimbabwe to Mozambique, Zimbabwe has been a traditional foreign investor in Mozambique over the past three decades, having reduced its participation in recent years due to well-known challenges that affect not only Zimbabwe but most countries in the SADC region and the African continent in general.\n\nFrom 2015 to 2024, 37 projects were approved, likely to create 1,649 jobs, involving private investors from Zimbabwe, with a total value of approximately USD 120 million, of which about USD 35 million constitutes direct investment.\n\nInvestment from Zimbabwe was directed 31.70% towards the Aquaculture and Fisheries sector, followed by the Tourism and Hospitality sector with 23.49% of the approved investment, and in third place, the Industry sector with 21.10%.\n\nConsequently, in terms of private investment between the two countries, President Chapo noted with satisfaction the presence of foreign direct investment from Zimbabwean companies in Mozambique, which, although modest, expresses the willingness of entrepreneurs from our countries to explore intra-African investment opportunities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/26060749/IMG-20250426-WA0009.jpg",
            "description": "<p>By Staff Reporter  TRADE between Zimbabwe and Mozambique needs to be enhanced through the existing Beira Corridor, Mozambican President Daniel Chapo has said. The two nations, he said, need to deepen economic complementarity and create economies of scale using the sister republics’ existing natural resources, infrastructure, and logistical means, especially the Beira Corridor. Officially opening</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zitf-2025-trade-through-beira-corridor-needs-to-be-fully-exploited-president-chapo/\">ZITF 2025: Trade through Beira Corridor needs to be fully exploited— President Chapo </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "‘Is Mnangagwa paying South African government for your healthcare?’— xenophobes taunt heavily pregnant Zimbabwean woman chased away from SA hospital",
            "url": "https://www.newzimbabwe.com/is-mnangagwa-paying-south-african-government-for-your-healthcare-xenophobes-taunt-heavily-pregnant-zimbabwean-woman-chased-away-from-sa-hospital/",
            "content": "By Staff Reporter\n\nA HEAVILY pregnant Zimbabwean woman was recently publicly humiliated and chased away from Pretoria Wests Kalafong Hospital by a group of South African women, who insulted and accused her of burdening the countrys healthcare system.\n\nSouth African authorities have, for long, expressed concern over the strain placed on public services by Zimbabwean nationals fleeing a collapsed healthcare system back home.\n\nIn the viral video, the unidentified Zimbabwean woman is seen being verbally attacked and told never to come back to the hospital by the women who said the Zimbabwean government does not pay the South African government for healthcare services.\n\nWe are talking to you, switch off the phone! You always come to South Africa to make babies why?\n\nWena, you come for blood tests for free, in our country? You know we pay tax? Is Mnangagwa paying the South African government for your healthcare? Mnangagwa is not paying us anything\n\nCan you go and fix your problems with Mnangagwa, go to Zimbabwe, we do not want you here anymore.\n\nToday, when you get home start making arrangements on where you are going to deliver that baby because here in Pretoria West you are not coming, we do not want you anymore! Go home!\n\nThe Zimbabwean woman tried to defend herself saying the group was ranting to the wrong person, which further infuriated them.\n\nYou can go to Ramaphosas house or Julius Malemas house. They will help you deliver this child.\n\nYou are using our facilities, so we are talking to the right person, it is you who came with a bag to give birth here in South Africa and you are nothing, you are not a South African, they added.\n\nThe pregnant womans viral video is not the first of such xenophobic attacks of Zimbabweans living across the Limpopo for allegedly straining South Africas healthcare system.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/26053429/Screenshot_20250426-062427_1.jpg",
            "description": "<p>By Staff Reporter A HEAVILY pregnant Zimbabwean woman was recently publicly humiliated and chased away from Pretoria West’s Kalafong Hospital by a group of South African women, who insulted and accused her of burdening the country’s healthcare system. South African authorities have, for long, expressed concern over the strain placed on public services by Zimbabwean</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/is-mnangagwa-paying-south-african-government-for-your-healthcare-xenophobes-taunt-heavily-pregnant-zimbabwean-woman-chased-away-from-sa-hospital/\">‘Is Mnangagwa paying South African government for your healthcare?’— xenophobes taunt heavily pregnant Zimbabwean woman chased away from SA hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "Man jailed 30 years for repeatedly raping daughter",
            "url": "https://www.newzimbabwe.com/man-jailed-30-years-for-repeatedly-raping-daughter/",
            "content": "By Staff Reporter\n\nREGIONAL Magistrate Letwin Rwodzi has sentenced a rogue father to 30 years in jail for raping his biological daughter on four occasions.\n\nMagistrate Rwodzi said overwhelming evidence proved the mans guilt, emphasising that a fathers duty is to protect his children, not violate them.\n\nThe courts exist to safeguard minors and all vulnerable groups in society. A clear message must be sent that crime does not pay, said Rwodzi.\n\nThe accused was handed 15 years for the first two counts and another 15 years for the other two, resulting in an effective 30-year imprisonment.\n\nProsecutor Loveit Muringwa, proved that in April last year, the father returned home at Rainham Farm, Nyabira, Mashonaland West province and found his daughter seated on the floor.\n\nHe accused her of having an affair with her aunts husband while she stayed with them in Masvingo from Grade One to Seven.\n\nAfter shouting at her, he lifted her onto a bed and raped her.\n\nThe court heard that in May, he raped her again, gave her pills, and warned her against speaking out. He repeated the assault in November, again providing morning-after pills to prevent pregnancy.\n\nThe victim confided in her mother the following day, but the mother initially dismissed the claims.\n\nOn March 16, 2025, the girl was raped once more at their home. She later followed her mother to an onion field, where she tearfully recounted the ordeal.\n\nIn a court affidavit, the mother admitted she had not reported the earlier incidents due to her husbands threats.\n\nI was afraid of the threats, so I took no action. But on 16 March, around 4pm my daughter came to me crying that her father had raped her again. Disturbed, I called neighbours, who helped apprehend him.\n\nThe matter was then reported to the police, leading to the fathers arrest and subsequent conviction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter  REGIONAL Magistrate Letwin Rwodzi has sentenced a rogue father to 30 years in jail for raping his biological daughter on four occasions. Magistrate Rwodzi said overwhelming evidence proved the man’s guilt, emphasising that a father’s duty is to protect his children, not violate them. “The courts exist to safeguard minors and all</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-jailed-30-years-for-repeatedly-raping-daughter/\">Man jailed 30 years for repeatedly raping daughter  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        },
        {
            "title": "Harare woman in hot soup for facilitating rape of a 15-year-old girl",
            "url": "https://www.newzimbabwe.com/harare-woman-in-hot-soup-for-facilitating-rape-of-a-15-year-old-girl/",
            "content": "By Staff Reporter\n\nA HARARE woman has landed herself in serious trouble after she allegedly colluded with a local man to rape a 15-year-old girl, who was under her custody.\n\nLucious Sikadza appeared before Harare Regional Magistrate Marehwanazvo Gofa alongside her alleged accomplice, Shadreck Gaura, facing rape charges. The pair was advised to seek bail at the High Court.\n\nAccording to the State, the victim had left her rural home, where she lived with her grandparents, and arrived in Harare on January 6, 2025. She spent the night in the central business district before approaching Sikadza the following day.\n\nOn January 7, 2025, the complainant told Sikadza that she had run away from home and needed a place to stay. Sikadza agreed and took her in, said prosecutor Lancelot Mutsokoti.\n\nBut the situation took a sinister turn on March 16, 2025, when Sikadza allegedly told the girl they would be sleeping at Gauras house in Kuwadzana 5.\n\nThe first accused (Sikadza) acted in connivance with the second accused (Gaura), who then took the complainant to his place and had sexual intercourse with her without her consent, Mutsokoti alleged.\n\nThe horrifying ordeal only came to light after the girls parents tracked her down and took her to the police. She was referred to hospital for medical examination, where she revealed the sexual abuse by Gaura.\n\nSikadza, who allegedly masterminded the whole ordeal, initially vanished but was later nabbed in Kuwadzana, leading to her arrest alongside Gaura.\n\nThe case continues as the accused prepare to fight for their freedom at the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/18210835/Rape.jpg",
            "description": "<p>By Staff Reporter  A HARARE woman has landed herself in serious trouble after she allegedly colluded with a local man to rape a 15-year-old girl, who was under her custody. Lucious Sikadza appeared before Harare Regional Magistrate Marehwanazvo Gofa alongside her alleged accomplice, Shadreck Gaura, facing rape charges. The pair was advised to seek bail</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-woman-in-hot-soup-for-facilitating-rape-of-a-15-year-old-girl/\">Harare woman in hot soup for facilitating rape of a 15-year-old girl</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "27 Apr 2025"
        }
    ]
}