{
    "news": [
        {
            "title": "Pensions sector demonstrates resilient growth – IPEC",
            "url": "https://www.newzimbabwe.com/pensions-sector-demonstrates-resilient-growth-ipec/",
            "content": "By Alois Vinga\n\nZimbabwes pensions sector has demonstrated resilient growth in the first half of 2025, according to the latest report released by the Insurance and Pensions Commission (IPEC).\n\nAs of June 30, 2025, the sectors total assets stood at US$2.63 billion (ZWG70.76 billion), reflecting a 6% increase from US$2.48 billion recorded at the end of March 2025.\n\nThis growth, largely driven by new investments, member contributions, and favourable adjustments in the value of investment properties and equity, signals positive movement for the sector. However, challenges persist, particularly concerning pension contribution arrears and a large proportion of inactive funds, said IPEC.\n\nDespite operating under a relatively stable exchange rate environment, the sectors total income fell sharply by 78.74% to US$295.47 million (ZWG7.87 billion) for the six months to June 2025, down from US$1.39 billion recorded during the same period in 2024.\n\nIPEC attributed the decline to reduced fair value gains, which had previously been buoyed by exchange rate movements.\n\nInvestment performance varied across asset classes. Investment properties, which form a major component of pension fund portfolios, recorded modest growth of 1.75%, increasing to US$1.16 billion (ZWG31.14 billion) from US$1.14 billion in March.\n\nUnquoted equity investments rose by 3% to US$108.17 million, up from US$105.06 million, while quoted equity investments declined by 1.11%, falling to US$460.37 million from US$465.56 million.\n\nPrescribed asset investments, which fund government securities, also dipped by 2%, decreasing to US$274 million (ZWG7.38 billion) from US$280 million, reflecting a more cautious investment stance amid ongoing economic uncertainty.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/10033942/Insurance-and-Pensions-Commission-IPEC.jpeg",
            "description": "<p>By Alois Vinga Zimbabwe’s pensions sector has demonstrated resilient growth in the first half of 2025, according to the latest report released by the Insurance and Pensions Commission (IPEC). As of June 30, 2025, the sector’s total assets stood at US$2.63 billion (ZWG70.76 billion), reflecting a 6% increase from US$2.48 billion recorded at the end</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pensions-sector-demonstrates-resilient-growth-ipec/\">Pensions sector demonstrates resilient growth – IPEC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        },
        {
            "title": "Man (40) convicted for bestiality with goat, courts worried over rise in cases of “weird sexual desires”",
            "url": "https://www.newzimbabwe.com/man-40-convicted-for-bestiality-with-goat-courts-worried-over-rise-in-weird-desires/",
            "content": "By Staff Reporter\n\nA KWEKWE magistrate has convicted a 40-year-old man for bestiality with a she goat.\n\nThe offender, Stephen Musongwe, was sentenced to six months imprisonment when he appeared at Kwekwe Magistrates Court this week. Three months of the sentence were conditionally set aside while the remainder was commuted to 105 hours of community service.\n\nThe court heard that on August 14, 2025, at around 9am at a homestead in Semchengwe village, Redcliff, the offender, a labourer formerly employed by the goats owner, proceeded to the goat pen.\n\nIt was further heard that upon arrival at the pen, Musongwe pinned the she goat before engaging in the dastardly sexual act on the animal. He was busted by the livestock owner, prompting him to flee the scene, but he had already been positively identified.\n\nA report was made to the police, leading to Musongwes arrest.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) expressed worry over the rising trend of bestiality.\n\nCase of bestiality have been on the increase lately and it is the duty of the law to protect our animals from individuals with weird sexual desires, noted the NPAZ.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/16182340/Goat.jpg",
            "description": "<p>By Staff Reporter A KWEKWE magistrate has convicted a 40-year-old man for bestiality with a she goat. The offender, Stephen Musongwe, was sentenced to six months’ imprisonment when he appeared at Kwekwe Magistrates Court this week. Three months of the sentence were conditionally set aside while the remainder was commuted to 105 hours of community</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-40-convicted-for-bestiality-with-goat-courts-worried-over-rise-in-weird-desires/\">Man (40) convicted for bestiality with goat, courts worried over rise in cases of “weird sexual desires”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        },
        {
            "title": "IMF lauds Zimbabwe’s economic progress, but says arrears block lending",
            "url": "https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>Reuters The International Monetary Fund said on Thursday it remains unable to lend to Zimbabwe due to the country’s outstanding arrears, but praised recent economic reforms as discussions progress on a potential staff-monitored program. “Zimbabwe’s ability to borrow financially from us is constrained by the fact that they have arrears through the African Development Bank,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-lauds-zimbabwes-economic-progress-but-says-arrears-block-lending/\">IMF lauds Zimbabwe’s economic progress, but says arrears block lending</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        },
        {
            "title": "Munetsi raises alarm over fake agents preying on African footballers",
            "url": "https://www.newzimbabwe.com/munetsi-raises-alarm-over-fake-agents-preying-on-african-footballers/",
            "content": "By Sports Reporter\n\nWarriors vice captain Marshall Munetsi has expressed deep concern over the growing number of African footballers falling victim to fake agents, warning that the scam is robbing many young players of their dreams and hard-earned money.\n\nThe Wolverhampton Wanderers midfielder said the trend is on the rise, with con artists exploiting the ambitions of players seeking opportunities in Europe.\n\nMunetsi, a member of the FIFPro Global Player Council, said he has long been advocating for awareness on the issue, describing it as a crisis that requires urgent attention.\n\nIts more than a crisis in Africa, a person might create a social media account, come to Europe, watch a game take a picture [with a player], then put that picture on their profile and write theyre a football agent.\n\nA lot of people then end up paying money to that agent with promises of going to Europe, he said.\n\nThe midfielder revealed that he has personally encountered victims of these scams during his time in France, including established players who were deceived by fake agents.\n\nI had three guys who came to France when I was at Reims asking for accommodation because an agent had promised them some trials in Europe, and then they were just stuck at the airport when they got there and nobody was there.\n\nI am talking about guys who are playing for top teams in Africa that were also scammed. Its a big problem that needs to get real attention, said Munetsi.\n\nWhile there are no official statistics on the number of players defrauded by bogus agents, FIFPro has intensified awareness campaigns across Africa to help players identify legitimate representation and avoid exploitation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/10070129/munetsi-debut.webp",
            "description": "<p>By Sports Reporter Warriors vice captain Marshall Munetsi has expressed deep concern over the growing number of African footballers falling victim to fake agents, warning that the scam is robbing many young players of their dreams and hard-earned money. The Wolverhampton Wanderers midfielder said the trend is on the rise, with con artists exploiting the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/munetsi-raises-alarm-over-fake-agents-preying-on-african-footballers/\">Munetsi raises alarm over fake agents preying on African footballers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        },
        {
            "title": "Police warns against participation in Geza’s October 17 protests",
            "url": "https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/",
            "content": "By Thandiwe Garusa\n\nTHEZimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatheringson Fridaywill be met with the full wrath of the law.\n\nThis follows war veteran and ex-Zanu PF committee member Blessed Gezas call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.\n\nIn a statement Thursday, policespokespersonCommissionerPaul Nyathisaid comprehensive security measures havebeen put in place nationwideto ensure peace and stability.\n\nThe Zimbabwe Republic Police assures all Zimbabweans and visitors that comprehensive security measures have been put in place to ensure peace, law and order prevails before, during and after October 17.\n\nThe public is urged not to be misled or intimidated by rumours, misinformation, or threats circulating on social media platforms.\n\nActs of violence, threats, vandalism, or incitement to commit crime will be severely dealt with in line with the countrys laws\n\nAny attempts to engage in unlawful demonstrations, gatherings, or processions will be met with the full wrath of the law, Nyathi said.\n\nHe further urged the public to go about their daily activities without fear, adding that all essential services, including schools, businesses, public transport, and government offices will continue to operate as normal.\n\nMembers of the public are implored to go about their daily activitieswithoutfear.All essential services, including schools, businesses, public transport and government institutions,willcontinue to operate as usual, headded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/19204352/Paul-Nyathi-3.png",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Republic Police (ZRP) has warned that any attempts to engage in illegal demonstrations or gatherings on Friday will be met with “the full wrath of the law”. This follows war veteran and ex-Zanu PF committee member Blessed Geza’s call for nationwide protests against President Emmerson Mnangagwa and his allies, accusing them of corruption.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-warns-against-participation-in-gezas-october-17-protests/\">Police warns against participation in Geza’s October 17 protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        },
        {
            "title": "Panicky Mnangagwa announces US$150 ‘Special Presidential Bonus’ for civil servants ahead of planned anti-govt protests",
            "url": "https://www.newzimbabwe.com/panicky-mnangagwa-announces-us150-special-presidential-bonus-for-civil-servants-ahead-of-planned-anti-govt-protests/",
            "content": "By Staff Reporter\n\nPresident Emmerson Mnangagwas administration has announced a US$150 Special Presidential Bonus for civil servants, a move widely viewed as an attempt to ease growing frustration and avert planned anti-government protests called by war veteran and former Zanu PF committee member Blessed Geza.\n\nThe announcement, made a day before the scheduled October 17 demonstrations, has fueled speculation that the government is seeking to appease the civil serviceand maintain calm amid rising economic discontent.\n\nIn a statement issued Thursday, Public Service, Labour and Social Welfare Minister Edgar Moyo said the bonus will be disbursed in two instalments of US$75 each in November and December.\n\nFollowing ongoing engagement between government and its employees and in pursuit of achieving this objective, government seeks to announce the following interventions:\n\nTo provide festive season relief and recognise dedicated service, the government will pay a once-off Special Presidential Bonus of US$150 for all civil servants, which will be disbursed in two equal instalments of US$75 in November and December 2025.This will be in addition to the regular annual bonus and salaries, said Moyo.\n\nHe added that the government will next year implement a Job Evaluation Framework to align salaries with job responsibilities and restore long-withdrawn benefits for public workers.\n\nThe civil servants vehicle rebate scheme,which allows duty-free car imports,has been reinstated to 2022 benefit levels with effect from December.\n\nThe civil servants vehicle rebate is being fully restored to 2022 benefit levels, rewarding long service and commitment as reflected in Statutory Instrument 124 of 2022 with effect from 1 December 2025.\n\nFurthermore, government is revitalising medical insurance by recapitalising Premier Service Medical Aid Society (PSMAS) to ensure sustainable access to quality healthcare for public servants, he said.\n\nThe government also pledged to assist civil servants in acquiring housing, offering 26,000 residential stands, 20,000 in Harare and 6,000 in Bulawayo, with more to be made available nationwide.\n\nGeza, who is reportedly backed by Vice President Constantino Chiwenga, has urged citizens to take to the streets accusing Mnangagwa and his allies of corruption and economic mismanagement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/09192321/President-Emmerson-Mnangagwa-.jpg",
            "description": "<p>By Staff Reporter President Emmerson Mnangagwa’s administration has announced a US$150 “Special Presidential Bonus” for civil servants, a move widely viewed as an attempt to ease growing frustration and avert planned anti-government protests called by war veteran and former Zanu PF committee member Blessed Geza. The announcement, made a day before the scheduled October 17</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/panicky-mnangagwa-announces-us150-special-presidential-bonus-for-civil-servants-ahead-of-planned-anti-govt-protests/\">Panicky Mnangagwa announces US$150 ‘Special Presidential Bonus’ for civil servants ahead of planned anti-govt protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        },
        {
            "title": "Knives out in ZANU PF as Mutsvangwa raps Chiwenga over corruption dossier, accuses VP of turning presidium into a kangaroo court",
            "url": "https://www.newzimbabwe.com/knives-out-in-zanu-pf-as-mutsvangwa-raps-chiwenga-accuses-vp-of-turning-presidium-into-a-kangaroo-court/",
            "content": "By Staff Reporter\n\nZanu PFs internal power struggles have escalated dramatically, with party spokesperson Christopher Mutsvangwa publicly rebuking Vice President Constantino Chiwenga, accusing him of turning the presidium into a kangaroo court.\n\nThe confrontation reportedly followed Chiwengas demand for President Emmerson Mnangagwa to take action against individuals named in a corruption dossier he presented to the Politburo.\n\nSources told NewZimbabwe.com tensions were high during the meeting. Chiwengas allies initially rallied behind him before retreating when questions were raised about the motives behind his dossier.\n\nThe document reportedly implicates several prominent businessmen closely associated with Mnangagwa, including Wicknell Chivayo, Delish Nguwaya, Kudakwashe Tagwirei, Pedzai Sakupwanya, and Paul Tungwarara.\n\nThe group is accused of siphoning millions from state coffers, calling for their immediate arrest,a move that has deepened divisions within the ruling party.\n\nOur Vice President decides to turn the Presidium into a kangaroo court. An inquisitive court.KutongaPresident citing that document which was authored by Kasukuwere and his colleagues, Mutsvangwa told journalists at a press briefing in Harare, Thursday, expressing his disapproval of Chiwengas actions.\n\nMutsvangwa claimed that everyone in the Politburo professed ignorance about the origins of the dossier, with the exception of Chiwengaleading to speculation that the Vice President is acting alone.\n\nHefurther suggested that the incident had served as a reminder to Chiwenga that he is merely a Presidential appointee and lacks independent powerandshould conduct himself accordingly.\n\nIt reminded the Presidium that you are appointees of the President like us. You have no powers as the Presidium. And it was one person among these Presidium members who was championing that document. All these other people were just being dragged along.\n\nThe Politburo asked who penned the document, do you accept the ownership individually? All other members of the Presidium said we dont know where it came from. So it zeroed in on the Vice President.\n\nChiwenga has consistentlyslammed corruption, describing it as a national security threat. He has also repeatedly warned those who amass wealth through unscrupulous means to watch their backs, suggesting that their day of reckoning is coming.\n\nThe individuals named in the dossier are alleged to be securing government tenders through corrupt practices. These allegations are not new, but their formal presentation within the Politburo has brought the issue to a head.\n\nFor instance, Chivayo previously defrauded ZESA of US$5 million in the Gwanda Solar Power project through his Intratek Company, and failed to deliver on the project.\n\nTagwirei has been linked to the over US$3 billion Command Agriculture scandal and is also implicated in the recent dossier alleging that approximately US$3.2 billion has been stolen from state coffers. Meanwhile, Paul Tungwarara secured a tender to drill 10,000 boreholes under the Presidential Borehole Drilling Scheme, but was recently criticised by Parliament for failing to deliver.\n\nThe government has acknowledged that it is losing US$2 billion annually due to corruption and illicit financial dealings, making the current accusations all the more damaging and increasing the pressure on Mnangagwa to take action.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/16163123/chris-mutsvangwa.jpg",
            "description": "<p>By Staff Reporter Zanu PF’s internal power struggles have escalated dramatically, with party spokesperson Christopher Mutsvangwa publicly rebuking Vice President Constantino Chiwenga, accusing him of “turning the presidium into a kangaroo court.” The confrontation reportedly followed Chiwenga’s demand for President Emmerson Mnangagwa to take action against individuals named in a corruption dossier he presented to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/knives-out-in-zanu-pf-as-mutsvangwa-raps-chiwenga-accuses-vp-of-turning-presidium-into-a-kangaroo-court/\">Knives out in ZANU PF as Mutsvangwa raps Chiwenga over corruption dossier, accuses VP of turning presidium into a kangaroo court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "17 Oct 2025"
        }
    ]
}