{
    "news": [
        {
            "title": "Telecoms mogul Masiyiwa set to build Africa’s first AI factory powered by Nvidia",
            "url": "https://www.newzimbabwe.com/telecoms-mogul-masiyiwa-set-to-build-africas-first-ai-factory-powered-by-nvidia/",
            "content": "BusinessInsiderAfrica\n\nCassava Technologies, founded by Zimbabwean telecoms mogul Strive Masiyiwa, has partnered with Nvidia Corp. to establish Africas first artificial intelligence (AI) factory.\n\nAccording to a statement on Cassavas website, the company will integrate Nvidias cutting-edge computing and AI software into its data centres in South Africa by June 2025, with further expansion planned for Egypt, Kenya, Morocco, and Nigeria.\n\nThis will give African businesses, governments and researchers access to cutting-edge AI computing capacity, helping them develop smarter AI products, streamline operations and stay competitive in a fast-changing world. It provides the supercomputers and software needed to train AI while keeping data within Africas borders,the statement read.\n\nMasiyiwa stressed that developing AI infrastructure is crucial for Africa to fully harness the opportunities of the Fourth Industrial Revolution, positioning the continent for technological and economic transformation.\n\nOur AI factory provides the infrastructure for this innovation to scale, empowering African businesses, startups and researchers with access to cutting-edge AI infrastructure to turn their bold ideas into real-world breakthroughs and now they dont have to look beyond Africa to get it, he said.\n\nAI is helping innovators solve our greatest challenges in agriculture, healthcare, energy, financial services and many other industries creating opportunity in Africa,said Jaap Zuiderveld, VP EMEA at NVIDIA. As an NVIDIA Cloud Partner, Cassava is providing essential infrastructure and software to help pioneering companies and organizations accelerate AI development to foster innovation across the continent.\n\nCassava Technologies is set to become the first company to introduce accelerated computing to Africa as an Nvidia cloud partner.\n\nMeanwhile, global tech firms are also eyeing Africas digital future. Last year, Microsoft Corp. and G42, the UAEs leading AI company, announced plans to invest $1 billion in a geothermal-powered data centre in Kenya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/07/22062820/Strive-Masiyiwa.jpg",
            "description": "<p>BusinessInsiderAfrica Cassava Technologies, founded by Zimbabwean telecoms mogul Strive Masiyiwa, has partnered with Nvidia Corp. to establish Africa’s first artificial intelligence (AI) factory. According to a statement on Cassava’s website, the company will integrate Nvidia’s cutting-edge computing and AI software into its data centres in South Africa by June 2025, with further expansion planned for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/telecoms-mogul-masiyiwa-set-to-build-africas-first-ai-factory-powered-by-nvidia/\">Telecoms mogul Masiyiwa set to build Africa’s first AI factory powered by Nvidia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "World Cup Qualifier: Zimbabwe not scared of Super Eagles – Chirewa",
            "url": "https://www.newzimbabwe.com/world-cup-qualifier-zimbabwe-not-scared-of-super-eagles-chirewa/",
            "content": "BusinessDayNG\n\nZimbabwemidfielder Tawanda Chirewa has vowed the Warriors will not be intimidated by theSuper Eaglesof Nigeria when they clash in a crucial2026 FIFA World Cup qualifierat the Godswill Akpabio Stadium in Uyo on Tuesday.\n\nSuper Eagles new head coach Eric Chelle secured his first victory in charge as Nigeria defeated Rwanda 2-0 last Friday in Kigali. The win breathed new life into their Group C qualifying campaign, following a poor start that saw them collect just one point from their opening four matches.\n\nBefore their win against Rwanda, the three-time Africa Cup of Nations champions endured a frustrating run.With the victory over Rwanda, Nigeria climbed to fourth place in Group C with six points, while Zimbabwe remained bottom of the table with three points from five matches.\n\nDespite their struggles, Tawanda Chirewa, the Huddersfield Town midfielder who is on loan from Premier League side Wolverhampton Wanderers, remains confident in Zimbabwes chances against Nigeria.\n\nIm just focused on recovery and preparing to go again on Tuesday against Nigeria, which is a very good team, Chirewa, 21, told The Standard.\n\nA lot of their players compete in England and Europe, but I want to go out there and showcase my abilities. Our squad also has plenty of talented players, so theres no reason to fear Nigeria.\n\nWith only three points from five matches, Zimbabwe faces a must-win scenario to keep their fading qualification hopes alive. Meanwhile, Eric Chelle will be eager to build on his debut victory when Nigeria host Zimbabwe on Tuesday, March 25, at the Godswill Akpabio International Stadium.\n\nThe Super Eagles will be looking to make it back-to-back wins, while Zimbabwe will be desperate for their first victory in the campaign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24183751/chirewa-warriors-e1742841491841.jpeg",
            "description": "<p>BusinessDayNG Zimbabwe midfielder Tawanda Chirewa has vowed the Warriors will not be intimidated by the Super Eagles of Nigeria when they clash in a crucial 2026 FIFA World Cup qualifier at the Godswill Akpabio Stadium in Uyo on Tuesday. Super Eagles regain momentum under Eric Chelle Super Eagles’ new head coach Eric Chelle secured his first victory in charge as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-cup-qualifier-zimbabwe-not-scared-of-super-eagles-chirewa/\">World Cup Qualifier: Zimbabwe not scared of Super Eagles – Chirewa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "US cuts to HIV aid will cost millions of lives – UNAids chief",
            "url": "https://www.newzimbabwe.com/us-cuts-to-hiv-aid-will-cost-millions-of-lives-unaids-chief/",
            "content": "BBC\n\nUS funding cuts will lead to an additional 2,000 new HIV infections each day and over six million further deaths over the next four years, the UNAids chief has warned.\n\nIt would mark a stark reversal in the global fight against HIV, which has seen the number of deaths from the disease decrease from more than two million in 2004 to 600,000 in 2023, the most recent year for which figures are available.\n\nUNAids Executive Director Winnie Byanyima said the US governments decision to pause foreign aid  which included funding for HIV programmes  was already having devastating consequences.\n\nShe called on the US to reverse the cuts immediately, warning women and girls were being hit particularly hard.\n\nUS President Donald Trump announced the pause on foreign aid, for an initial 90 days, on his first day in office in January as part of a review into government spending. The majority of the US Agency for International Developments (USAID) programmes have since been terminated.\n\nMany US-financed HIV treatment and prevention programmes received stop work orders, leading to the closure of mother and baby clinics in Africa, and severe shortages of life saving anti-retroviral (ARV) medicines.\n\nMs Byanyima said she feared a return to the 1990s, when HIV medication was scarcely available in poorer countries, and infections and deaths soared.\n\nThe US has for years been the single biggest funder of HIV treatment and prevention, and Ms Byanima thanked Washington for its generosity and humanity.\n\nShe added it was reasonable for the US to want to reduce its funding  over time, but said the sudden withdrawal of lifesaving support [was] having a devastating impact.\n\nThere has been no sign that Washington is listening to appeals to change course.\n\nTraditional aid donors in Europe also plan funding cuts, and UNAids  the joint UN agency which combats HIV  has had no indication that other countries might step in to fill the gap left by the US.\n\nSpeaking in Geneva on Monday, Ms Byanyima described the case of Juliana, a young woman in Kenya living with HIV. She worked for a US-funded programme that supported new mothers to access treatment to ensure their babies did not develop the disease.\n\nUNAids Executive Director Winnie Byanyima\n\nWith the programme suspended, Ms Byanyima said Juliana was not only out of work but, because she was still breastfeeding her youngest child, she also feared losing the treatment she needed.\n\nPreviously, the World Health Organization (WHO) said eight countries  Nigeria, Kenya, Lesotho, South Sudan, Burkina Faso, Mali, Haiti and Ukraine  could soon run out of HIV drugs after the US funding pause.\n\nWHO chief Tedros Adhanom Ghebreyesus warned that disruption to HIV programmes could undo 20 years of progress.\n\nIn February, South Africas leading Aids lobby group, the Treatment Action Campaign (TAC), warned the country could see a return to when HIV patients struggled to access necessary services for their treatment.\n\nWe cant afford to die, we cant afford to go back to those years where we were suffering with access to services, especially for people living with HIV treatment, said TAC chair Sibongile Tshabalala.\n\nMs Byanyima also proposed a deal to the Trump administration, offering an opportunity to market a new US-developed ARV to millions of people.\n\nLenacapavir, made by US company Gilead, is given by injection every six months, with UNAids believing 10 million people could benefit from it.\n\nThe profits and jobs resulting from such a deal would be hugely beneficial to the US, Ms Byanyima added.\n\nUNAids is one of a number of UN agencies facing funding cuts.\n\nThe UN Refugee Agency has suggested it may have to lose 6,000 jobs, while Unicef has warned that progress to reduce child mortality is threatened, and the World Food Programme has had to cut rations in famine threatened regions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/17083257/Know-your-HIV-status-e1579250018379.jpeg",
            "description": "<p>BBC US funding cuts will lead to an additional 2,000 new HIV infections each day and over six million further deaths over the next four years, the UNAids chief has warned. It would mark a stark reversal in the global fight against HIV, which has seen the number of deaths from the disease decrease from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-cuts-to-hiv-aid-will-cost-millions-of-lives-unaids-chief/\">US cuts to HIV aid will cost millions of lives – UNAids chief</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "‘Proud moment for all Africa’: South Africa’s Gayton McKenzie celebrates Kirsty Coventry’s on historic IOC presidency",
            "url": "https://www.newzimbabwe.com/proud-moment-for-all-africa-south-africas-gayton-mckenzie-celebrates-kirsty-coventrys-on-historic-ioc-presidency/",
            "content": "IOL\n\nMinister of Sport, Arts and Culture, Gayton McKenzie has expressed joy and anticipation after Zimbabwes Minister of Sports, Art and Recreation, swimming sensation Kirsty Coventry has become the first woman and African to be elected president of theInternational Olympic Committee (IOC).\n\nAt 41, the two-time Olympic swimming champion is also the youngest ever elected to be the most powerful person in sports governance. She will begin her eight-year term in charge of the IOC in June.\n\nIOL has previously reported thatmoments after Coventry was elected the 10th president of the IOC, she told the audience at the 144th IOC Session in Costa Navarino, Greece, on Thursday: I hope that this vote will be an inspiration to many people. Today glass ceilings were shattered, and I am fully aware of my responsibilities as a role model.\n\nIn South Africa, McKenzie said Coventrys ascension to world sports top job signals a welcome step forward in the global dynamics of sport administration.\n\nWe must pay tribute to the work of the outgoing president of the IOC, Dr Thomas Bach, who received us so warmly and respectfully as a member country at Olympic House, after paying an official visit to South Africa last year, said McKenzie.\n\nTo know that the reins are being passed to an individual as accomplished and outspoken as Kirsty Coventry fills us with hope for the future of world sport, and Africa and the Global Souths place in it.\n\nKirsty Coventry\n\nMcKenzie also spoke glowingly of Coventrys achievements.\n\nShe was already the most decorated Olympian in African history, with seven medals, including two golds.\n\nShe has now reached the highest of pinnacles in all of sport, added Minister McKenzie, paying tribute to the strong support Coventry was given by IOC members, winning the election on the first ballot, with 49 votes.\n\nThis achievement is a proud moment for all of Africa. I look forward to engaging the president-elect personally in days to come, and to express my support for all the hard work that we know still lies ahead.\n\nSpokesperson for the Department of Sport, Arts and Culture, Stacey-Lee Khojane said since becoming minister in 2024, McKenzie has used the platform tirelessly to argue the case for the end of what he has termed sports apartheid, where some of the worlds premier sporting tournaments never see expression through hosting in Africa.\n\nWhile numerous countries have hosted multiple Olympic Games, the entire continent of Africa has never hosted one, said Khojane.\n\nIn a move towards changing this imbalance, South Africa lodged an Expression of Interest to host the 2036 Olympic and Paralympic Games with the IOC in Switzerland in November of 2024, in a ministerial delegation that included the South African Sports Confederation and Olympic Committee, with the support of IOC Member in South Africa, Anant Singh, and IOC Honorary Member Sam Ramsamy.\n\nIOL reported last week that Coventrys election to global sports most powerful position marks a significant advancementin breaking glass ceilings that have historically sidelined women from leadership roles in sports. Her triumph stands as a beacon of hope for underrepresented voices in a field traditionally dominated by men.\n\nIn her acceptance speech, Coventry said: This is an extraordinary moment. As a nine-year-old girl, I never thought Id be standing up here one day, getting to give back to this incredible movement of ours.\n\nThis is not just a huge honour but is a reminder of my commitment to every single one of you that I will lead this organisation with so much pride, with the values at the core. And I will make all of you very, very proud, and hopefully extremely confident in the decision that you have taken today. Now weve got some work together.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181937/Patriotic-Alliance-PA-leader-Gayton-McKenzie-emphasizes-his-stance-on-illegal-immigration-in-South-Africa-ahead-of-the-2026-elections.webp",
            "description": "<p>IOL Minister of Sport, Arts and Culture, Gayton McKenzie has expressed ‘joy and anticipation’ after Zimbabwe’s Minister of Sports, Art and Recreation, swimming sensation Kirsty Coventry has become the first woman and African to be elected president of the International Olympic Committee (IOC). At 41, the two-time Olympic swimming champion is also the youngest ever elected</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/proud-moment-for-all-africa-south-africas-gayton-mckenzie-celebrates-kirsty-coventrys-on-historic-ioc-presidency/\">‘Proud moment for all Africa’: South Africa’s Gayton McKenzie celebrates Kirsty Coventry’s on historic IOC presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "‘My daughter is alive’: Lesedi Molapisi’s father denies ‘fake news’ of execution in Bangladesh",
            "url": "https://www.newzimbabwe.com/my-daughter-is-alive-lesedi-molapisis-father-denies-fake-news-of-execution-in-bangladesh/",
            "content": "TimesLive\n\nGoitsemodimo Molapisi, the father of Lesedi Molapisi, is urging the public to cease spreading fake news about his daughters fate after reports of her execution circulated online.\n\nLesedi, who was arrested at a Bangladesh airport in 2022 with about 3kg of heroin, was sentenced to death for drug trafficking.\n\nGoitsemodimo is adamant that his daughter is still alive and believes that she will be released.\n\nIm praying day and night. My daughter will be released. Im hopeful, he said in an interview with Newzroom Afrika.\n\nIn an emotional plea, Goitsemodimo expressed his distress about the harmful rumours.\n\nWe were shocked to see fake news trending in the news media to the fact that my daughter has been executed, and this has been speculated by heartless people who are not sensitive enough to accommodate the parents, relatives and friends of Lesedi, he said.\n\nMy daughter is still alive  as you might be aware, she is in prison in Bangladesh. We have made an appeal, and she cannot be executed while that is being processed.\n\nLesedis arrest came as a shock to her family, especially her father, who revealed that he had no knowledge of her trip to Bangladesh.\n\nLesedi was not working. She was staying in Gaborone with her elder sister, and before her arrest she visited us in December. She left us around January 18 2022. We were really shocked.\n\nGoitsemodimo said his daughter is alive and he has been in communication with her every week.\n\nI speak to Lesedi every Friday through her lawyer in Bangladesh. Even last Friday, we talked. Shes still healthy, but the problem is that shes suffering from depression after being in prison for more than three years.\n\nGoitsemodimo said he is in contact with Lesedis lawyers and they have filed an appeal. They are awaiting a response from the judges.\n\nThe Botswana government has also been actively assisting in the case, with efforts to have Lesedi extradited to Botswana for prosecution.\n\nGoitsemodimo expressed his gratitude for the support from Botswanas government, particularly fromPresident Duma Boko.\n\nIm very happy with the diplomatic efforts made by the president in assisting the family to secure a pardon for Lesedi. He is doing his best and Im quite happy with the level of assistance.\n\nHe condemned those responsible for circulating the false reports of his daughters execution. This has affected us a lot because we are still working around the clock to assist my daughter, together with the government of Botswana, and these people are starting to speculate. It is really affecting us.\n\nHe also expressed frustration with the way some individuals on social media have handled the situation: Those people who are spreading heartless fake news are really affecting us. We appeal to all the people using news media platforms to assist us by praying for my daughter instead of spreading these rumours. It feels like we have taken part in the offence that has been committed by my daughter, and that is not right.\n\nIm not happy with how people are commenting on social media. Some even seem to want to hear that my daughter has been executed.\n\nGoitsemodimo said once Lesedi is released, he plans to support her recovery.\n\nThe first thing I will do [is] just take for counselling. I will take her to professionals so that they can counsel her, and then well sit down and talk as to why she went to Bangladesh, because she never informed us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24194524/lesedi.png",
            "description": "<p>TimesLive Goitsemodimo Molapisi, the father of Lesedi Molapisi, is urging the public to cease spreading fake news about his daughter’s fate after reports of her execution circulated online. Lesedi, who was arrested at a Bangladesh airport in 2022 with about 3kg of heroin, was sentenced to death for drug trafficking. Goitsemodimo is adamant that his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/my-daughter-is-alive-lesedi-molapisis-father-denies-fake-news-of-execution-in-bangladesh/\">‘My daughter is alive’: Lesedi Molapisi’s father denies ‘fake news’ of execution in Bangladesh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "Kirsty Coventry inspiring the world",
            "url": "https://www.newzimbabwe.com/kirsty-coventry-inspiring-the-world/",
            "content": "By Gao Junya | CGTN\n\nThe Zimbabwean sports minister and former Olympic gold medalist was elected as the 10th president of the International Olympic Committee. She became the first woman and African president to hold this prestigious position in IOCs 131-year history.\n\nThis is not only a proud achievement for Coventry herself, but also for her nation, Zimbabwe, and the entire African continent. Her election is a powerful inspiration to people around the world, especially women, who see her as a symbol of perseverance, excellence and leadership.\n\nCoventrys victory has also been warmly celebrated in China as Zimbabwes Golden Girl enjoys a huge fan base here. Her athletic career is nothing short of remarkable: winning seven Olympic medals, more than anyone else from Africa, including one gold and three silvers medals earned at the 2008 Beijing Olympics.\n\nI had the privilege of interviewing Coventy in January 2022, just before she visited the Beijing 2022 Winter Olympics as an IOC member. She shared with me how Beijing means to her personally, especially the National Aquatics Center, also known as the Water Cube, where she achieved some of her greatest Olympic successes.\n\nAnd that iconic Water Cube, transformed into an ice rink for the Winter Olympics, was something she was eager to revisit.\n\nBeijing has a warm place in my heart. Obviously, thats where I won my Olympic medals, a gold and three silvers. Im excited to go back and cheer on our athletes of the world, watching athletes live out their Olympic dream, especially in the Water Cube, which will be interesting to see how different it looks now.\n\nDuring our conversation, Coventry also emphasized her dedication to promoting exchanges in sport, culture and art between Zimbabwe and China.\n\nUnder my portfolio, its not just sport, its also art and culture. I think China does an incredible job of being proud of your culture and your heritage, and thats something that were really trying to emphasize as a ministry.\n\nId love to be able to have a little bit more work alongside the Chinese counterparts to achieve a little bit more of that and learn from China in terms of how you structured your cultural lessons, your museums, things like that. That for me is really important in order to be able to have a strong identity as a Zimbabwean people, as a Zimbabwean culture.\n\nCoventrys vision is reflected in her IOC presidential manifesto, where she advocates for using sport as a bridge between countries and cultures, a source of hope, and a force for good. She also pledged to tackle inequality in sports, with a strong focus on promoting womens participation and ensuring equal opportunities for female athletes at every level.\n\nWhat many may not know is that after retiring from professional sport in 2016  having competed in five Olympic Games  Coventry launched a charitable initiative to provide sports education to underprivileged children. Her goal was to give young people a chance to discover their potential and pursue careers in sports.\n\nHer actions have already made a meaningful difference in the lives of ordinary people. Now, as the new president of the IOC, Coventry has an even greater platform to bring about positive change. Her leadership promises to inspire and uplift not just Zimbabwe and Africa, but the global sporting community as a whole.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>By Gao Junya | CGTN The Zimbabwean sports minister and former Olympic gold medalist was elected as the 10th president of the International Olympic Committee. She became the first woman and African president to hold this prestigious position in IOC’s 131-year history. This is not only a proud achievement for Coventry herself, but also for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kirsty-coventry-inspiring-the-world/\">Kirsty Coventry inspiring the world</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "Prison officer in court for assisting robbery suspects escape",
            "url": "https://www.newzimbabwe.com/prison-officer-in-court-for-assisting-robbery-suspects-escape/",
            "content": "By Mary Taruvinga\n\nA Zimbabwe Prisons and Correctional Services (ZPCS) officer who allegedly assisted two armed robbery suspects escape from lawful custody at the Harare Magistrates Court on Friday was hauled before magistrate Marewanazvo Gofa on Monday.\n\nDonald Madzinga was not asked toplead and was remanded in custody toTuesday for bail application.\n\nThe court heard he was paid US$500 to release two armed robbery suspects who were involved in the widely publicised Quest Financial US$720,000 heist.\n\nThe prison warden is being charged with criminal abuse of office charges.\n\nHe is also charged with assisting suspects to escape from lawful custody.\n\nProsecuting, Lancelot Mutsokoti alleged that on sometime this month Madzinga hatched a plan to assist two inmates Tafadzwa Richard Marondera and Luke Zinyengere to escape from lawful custody.\n\nContrary to his duties, accused conspired with the said inmates and agreed that they bring in a revolver to facilitate their escape and charged them US$700.\n\nOne of the inmates relative,Tinotenda Zinyengere was told to bring in a revolver, handed it over to Madzinga who would take and hand it over the inmates.\n\nAccused used his phone and allowed the said inmates to communicate with Tinotenda on the modalities of their plan.\n\nTinotenda Zinyengere raised US$500 which he gave to accused who agreed to facilitate the deal, the court heard.\n\nIt is alleged that upon being handed over cash and the firearm, Madzinga went on to hand the revolver to inmate Luke who kept the firearm in their cell.\n\nOn 21 March 2025 when both inmates were to appear in court 12 at Harare Magistrate Court, as per their plan, they took with them the firearm after concealing it in their pants, the State alleges.\n\nThe court heard that following close of business at court, the inmates as per plan escaped from lawful custody whilst being escorted into a prison truck whichwas totake them back to Harare Remand prison.\n\nLuke escaped and robbed a motor vehicle at gun point while Marondera was arrested outside the court fence as he tried to run towards Belvedere road, Harare.\n\nUpon arrest, Madzinga was putting on Luke Zinyengeres white Gucci jacket with a green strip, the State alleges.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Mary Taruvinga A Zimbabwe Prisons and Correctional Services (ZPCS) officer who allegedly assisted two armed robbery suspects escape from lawful custody at the Harare Magistrates Court on Friday was hauled before magistrate Marewanazvo Gofa on Monday. Donald Madzinga was not asked to plead and was remanded in custody to Tuesday for bail application. The court heard</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/prison-officer-in-court-for-assisting-robbery-suspects-escape/\">Prison officer in court for assisting robbery suspects escape</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "Operation Vala Umgodi: SAPS arrest undocumented Zimbabweans, seize illegal mining equipment",
            "url": "https://www.newzimbabwe.com/operation-vala-umgodi-saps-arrest-undocumented-zimbabweans-seize-illegal-mining-equipment/",
            "content": "A large group of undocumented foreign nationals Mozambique, Zimbabwe, and Malawi are expected to appear in the Bafokeng Magistrates Court in Tlhabane in the North West.\n\nThe suspects were arrested during an ongoing Operation Vala Umgodi dealing with illicit mining and related crimes in the Bojanala Platinum District.\n\nThe provincial police spokesperson, Captain Mpho Manyoba said teams were deployed to confiscate two excavators and several other illegal mining equipment that was found abandoned at the Bapong illegal mining site in the Mogwase policing precinct on Thursday, March 20.\n\nThe operation further led to the arrest of 10 individuals for contravention of Section 49 (1) (a) of the Immigration Act, 2002, in Gelhoutpark, Rustenburg. The suspects who are Zimbabwe and Malawi foreign nationals, are expected to appear in the Rustenburg Magistrates Court on Monday, March 24, Manyoba said.\n\nIn a separate incident in Freedom Park near Phokeng, a group of undocumented foreign nationals were also arrested.\n\nThe team nabbed 12 undocumented foreign nationals from Mozambique, Zimbabwe, and Malawi between Thursday and Friday, March 21, 2025. All the suspects are due to appear in the Bafokeng Magistrates Court in Tlhabane, Manyoba said.\n\nIn Mogwase, police further arrested nine undocumented foreign nations on Friday and Saturday in Moruleng. The team also confiscated illegal mining equipment at the Witrandjie illegal mining site.\n\nIn Schaumburg near Hartbeespoortdam, the team confiscated abandoned penduka machines and steel balls.\n\nThe acting Provincial Commissioner of the North West, Major General Patrick Asaneng thanked the members for their continuous efforts in the enforcement of the law.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24193848/The-excavator-confiscated-by-police.webp",
            "description": "<p>IOL A large group of undocumented foreign nationals Mozambique, Zimbabwe, and Malawi are expected to appear in the Bafokeng Magistrate’s Court in Tlhabane in the North West. The suspects were arrested during an ongoing Operation Vala Umgodi dealing with illicit mining and related crimes in the Bojanala Platinum District. The provincial police spokesperson, Captain Mpho</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/operation-vala-umgodi-saps-arrest-undocumented-zimbabweans-seize-illegal-mining-equipment/\">Operation Vala Umgodi: SAPS arrest undocumented Zimbabweans, seize illegal mining equipment</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "798 Zimbabweans to participate in Two Oceans marathon, 97 more countries represented",
            "url": "https://www.newzimbabwe.com/798-zimbabweans-to-participate-in-two-oceans-marathon-97-more-countries-represented/",
            "content": "IOL\n\nTHE Two Oceans is not only the worlds most beautiful marathon but also Africas biggest event thanks to its massive contribution to the Western Capes revenue.\n\nThis much was confirmed by a study from 2017, and the organisers of this years edition of the 56km ultra, its half-marathon, as well as the trail runs, plus the Cape Town International Friendship Run, believe that the impact will be even bigger.\n\nThe Two Oceans Marathon organisers say they have record highs of international entries for this years races, taking place over the weekend of April 5 in the Mother City. The race will have an incredible 98 countries represented in the different events.\n\nExpectedly, South Africans will form the bulk of the participants. Neighbours Namibia and Zimbabwe will send 839 and 798 runners each, respectively, to carry their flags. The UK is in fourth place with 337 participants. For this years race, a total of about 4 500 internationals are coming over.\n\nIt is the fact that the race has attracted runners from every conceivable corner of the world that excites the organisers, with countries such as Mauritania, Malaysia, Ecuador, Slovakia, Palestine, and New Zealand, to mention just a few.\n\nIts an honour to be welcoming more than 4 500 internationals from a record 98 countries to our shores  the highest number of countries to be represented in the history of our Two Oceans Marathon event. This speaks to the truly globally iconic nature of our race, said race manager Hilton Kearns.\n\nIt confirms to them that the Two Oceans truly is the worlds most beautiful marathon. After all, this is a race of which it was said byThe New York Timesonce that If theres one race you must run in your lifetime, it has to be the Two Oceans. Endorsements surely dont come bigger than this one, do they?\n\nAnd with good reason too, as the 56km ultra takes runners on arguably the most scenic road of any road race in the worldaround Chapmans Peak.\n\nWe are striving to make the 2025 event a memorable one for our international runners, and it is fitting that in a year of record international entries, weve also managed to bring back the Cape Town International Friendship Run, Kearns continued.\n\nThe benefits are particularly felt by the city and the province, given the contribution the visiting internationals make to the economy. The Two Oceans Marathon weekend is said to create about 4 000 temporary jobs, a number not surpassed by any of the countrys other major running events. And thats what the economic impact is pegged on.\n\nWe are, of course, also pleased at the important ancillary impact this kind of tourism pull has on the local economy, and to be recognised at the highest levels as an event thats important in this context, Kearns adds.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24182121/The-Two-Oceans-marathon-takes-place-on-the-weekend-of-April-5.webp",
            "description": "<p>IOL THE Two Oceans is not only ‘the world’s most beautiful marathon’ but also ‘Africa’s biggest event’ thanks to its massive contribution to the Western Cape’s revenue. This much was confirmed by a study from 2017, and the organisers of this year’s edition of the 56km ultra, its half-marathon, as well as the trail runs,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/798-zimbabweans-to-participate-in-two-oceans-marathon-97-more-countries-represented/\">798 Zimbabweans to participate in Two Oceans marathon, 97 more countries represented</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        },
        {
            "title": "Stop using fake credentials or risk legal action – ZIMCHE warns against fraudulent qualifications",
            "url": "https://www.newzimbabwe.com/stop-using-fake-credentials-or-risk-legal-action-zimche-warns-against-fraudulent-qualifications/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Council for Higher Education (ZIMCHE) has warned against the use of fraudulent academic titles, threatening legal consequences.\n\nThis follows a proliferation of Professor and Doctor titles awarded by institutions which are not registered with the higher learning council. According to ZIMCHE, while some qualifications are awarded to unsuspecting individuals duped out of their money, others are willing accomplices.\n\nIn a statement, the ZIMCHE said some unregistered institutions had ignored a directive to shut down and were still issuing fake degrees.\n\nAs the regulatory authority mandated under The ZIMCHE Act [Chapter 25:27], the ZIMCHE is committed to safeguarding the standards, quality, and credibility of Zimbabwes Higher Education System. In this regard, unregistered institutions are unequivocally warned to cease operations immediately, withdraw all fraudulent qualifications, and desist from issuing or conferring any degrees, including purportedly earned and honorary PhDs, reads the statement.\n\nRecipients of fraudulent qualifications and false titles are strongly advised to stop using these credentials or risk legal consequences, including civil and criminal prosecution.\n\nTo protect stakeholders, including students, employers, and the public, the ZIMCHE has initiated investigations into these unlawful activities. Appropriate legal measures will be taken against both unregistered institutions and individuals found complicit in academic fraud.\n\nZIMCHE urged the public to verify learning institutions before enrolling.\n\nMembers of the public are urged to exercise vigilance by verifying the accreditation status of such Institutions with the ZIMCHE before enrolling in any programmes. Similarly, employers are encouraged to thoroughly authenticate qualifications presented by prospective employees with the ZIMCHE. Members of the public should always be on the lookout for unregistered institutions, that in some cases frequently change their locations to evade detection.\n\nSome of these institutions are not owned by Zimbabweans, while others claim affiliation with dubious international universities that are not even registered and accredited in their countries of origin.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24202933/zimche.jpg",
            "description": "<p>By Staff Reporter The Zimbabwe Council for Higher Education (ZIMCHE) has warned against the use of fraudulent academic titles, threatening legal consequences. This follows a proliferation of Professor and Doctor titles awarded by institutions which are not registered with the higher learning council. According to ZIMCHE, while some qualifications are awarded to unsuspecting individuals duped</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/stop-using-fake-credentials-or-risk-legal-action-zimche-warns-against-fraudulent-qualifications/\">Stop using fake credentials or risk legal action – ZIMCHE warns against fraudulent qualifications</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "25 Mar 2025"
        }
    ]
}