{
    "news": [
        {
            "title": "Saul Chaminuka appointed new Dynamos coach",
            "url": "https://www.newzimbabwe.com/saul-chaminuka-appointed-new-dynamos-coach/",
            "content": "By Sports Reporter\n\nDynamos has appointed Saul Chaminuka as the new team head coach.\n\nChaminuka joins Dembare from bottom-placed Kwekwe United, where he was suspended last week.\n\nDembare fired coach Lloyd Mablanyo Chigowe on Monday following a string of poor results that have seen the side win only one in 11 matches.\n\nOf the technical team, which was led by Mablanyo, only strikers coach Takesure Chinyama and team manager Ronald Sibanda have survived the chop.\n\nThe incoming technical team, led by Chaminuka, has seen former Motor Action goalkeeper Marlon Jani coming in as a goalkeeper coach, while Philemon Mutyakureva will be an assistant coach.\n\nSaul Chaminukas appointment comes five days before Dynamos face old rivals CAPS United at Rufaro Stadium on Sunday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/11073111/Saul-Chaminuka.webp",
            "description": "<p>By Sports Reporter Dynamos has appointed Saul Chaminuka as the new team head coach. Chaminuka joins Dembare from bottom-placed Kwekwe United, where he was suspended last week. Dembare fired coach Lloyd “Mablanyo” Chigowe on Monday following a string of poor results that have seen the side win only one in 11 matches. Of the technical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/saul-chaminuka-appointed-new-dynamos-coach/\">Saul Chaminuka appointed new Dynamos coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Why Mobile Casinos Are Dominating the Market: Convenience, Speed, and Accessibility",
            "url": "https://www.newzimbabwe.com/why-mobile-casinos-are-dominating-the-market-convenience-speed-and-accessibility/",
            "content": "Once, playing at a casino meant getting dressed, going out, and settling in for hours at the tables. For plenty of players, that was part of the magic, from the atmosphere to the sense of occasion. But times have changed. Todays players want something different. They want flexibility, ease, and most of all, speed. Thats why mobile casinos have stepped in and taken over  and why they arent giving the market back anytime soon.\n\nIn the modern world, everything competes for attention. People expect to do things quickly and on their terms. Streaming shows, ordering food, and messaging friends  it all happens in an instant. Casino gaming has followed suit. Online platforms likeBetway casinohave made it possible for players to enjoy their favorite games without being tied to a desktop or traditional casino floor. Slots, roulette, blackjack, and newer favorites like Aviator are now just a tap away.\n\nThis shift isnt just about going mobile for the sake of it. Its about making the experience fit into real life. Players no longer need to plan their gaming sessions around big blocks of free time; Whether its during a lunch break, while commuting, or unwinding after a long day, mobile casinos adapt to a players schedule. That kind of convenience has changed how people engage with games.\n\nBut speed matters just as much as accessibility. Mobile casinos thrive because they offer fast-loading games that get straight to the action. Nobody wants to wait through endless animations or clunky menus. Aviator, for example, is designed perfectly for mobile play. The concept is simple  watch the multiplier rise, decide when to cash out, and try to stay ahead of the crash. Its easy to grasp, fast to play, and perfect for those short bursts of entertainment that mobile users often prefer.\n\nPlatforms like Betway understand this balance. They have invested in delivering smooth, responsive gameplay that works seamlessly across devices. Menus are clear, loading is quick, and nothing gets in the way. The result? Players dive straight into the game without wrestling with slow screens or clunky menus. Its smooth, simple, and exactly how it should be.\n\nAnother major factor is choice. Mobile casinos today arent limited in the way they once were. Modern platforms offer hundreds, sometimes thousands, of games right at your fingertips. Whether youre a fan of classic slots or prefer newer concepts like crash games, theres always something ready to play. This variety ensures that mobile players get the same rich experience they would expect from a traditional online casino, if not more.\n\nWhat ties all of this together is trust. Players need to feel confident that mobile play doesnt mean sacrificing security or fairness. Thats why established names like Betway continue to lead. Their platforms offer not only speed and convenience but also the reliability and transparency players expect. From encrypted transactions to clear game rules, everything is designed with user confidence in mind.\n\nIn the end, the rise of mobile casinos isnt a temporary trend. Its a response to what players want today. Fast, flexible, and user-focused gaming experiences are here to stay. Whether youre chasing multipliers in Aviator or spinning the reels, mobile platforms have proven they can deliver  wherever and whenever you choose to play.\n\n",
            "image_url": null,
            "description": "<p>Once, playing at a casino meant getting dressed, going out, and settling in for hours at the tables. For plenty of players, that was part of the magic, from the atmosphere to the sense of occasion. But times have changed. Today’s players want something different. They want flexibility, ease, and most of all, speed. That’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-mobile-casinos-are-dominating-the-market-convenience-speed-and-accessibility/\">Why Mobile Casinos Are Dominating the Market: Convenience, Speed, and Accessibility</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Why the NHS must make innovation its top priority",
            "url": "https://www.newzimbabwe.com/why-the-nhs-must-make-innovation-its-top-priority/",
            "content": "By Dr Richard Dune\n\nAn in-depth look at the fourth shift the NHS urgently needs, moving from research to reality to strengthen care across all system parts.\n\nWhen people across Africa think of the UKs National Health Service (NHS), they often think of excellence, world-class teaching hospitals, cutting-edge medicine, and free care at the point of delivery. For many Zimbabweans in the diaspora, the NHS is not only a place of work but also a lifeline for their families and communities. But beneath that reputation lies a system now in critical flux, and the stakes have never been higher.\n\nWith the dissolution of NHS England, budget pressures on Integrated Care Boards (ICBs), and uncertainty over future innovation funding, we are seeing the end of a chapter in British healthcare. Yet this moment also offers a unique opportunity: to reshape the NHS into something more resilient, equitable, and innovative, particularly for the communities that have often been overlooked.\n\nEarlier this year, the Wellcome Trust issued a powerful directive: make research and innovation the fourth strategic shift in the NHS. This new shift should sit alongside three long-standing goals:\n\nBut heres the truth: the other three shifts cant succeed without the fourth. The system will continue to buckle under pressure without innovation in everyday NHS practice, especially outside major hospitals.\n\nMany Zimbabweans working in health and social care across the UK are not based in elite hospitals like Cambridge or Imperial. They work in care homes, GP practices, district nursing, home care services, and mental health support roles. Yet innovation and research funding rarely reach these corners of the system.\n\nIf we truly believe that healthcare happens in the community, research and innovation must follow. But today, those working on the frontlines often lack:\n\nThis is where the disconnect lies, and where the opportunity begins.\n\nThe NHS isnt just struggling with inertia; its navigating a storm:\n\nAnd yet, innovation cant be an afterthought. It must be a daily part of delivering care, from the inner-city clinic in London to the remote outreach teams in Cornwall.\n\nTo moveFrom Research to Reality, we need five bold changes, especially in community and primary care settings:\n\nThis is not about research for its own sake. Its about:\n\nFor those of us from Zimbabwe and across Southern Africa, this conversation matters more than we might think. Many of us are part of the NHS workforce. Some of us are carers, nurses, consultants, therapists, or tech innovators. We see the cracks in the system every day, but we also see the possibilities.\n\nInnovation is not just the responsibility of those in power. Its a shared duty, especially for those on the frontline, those building health and social care businesses, and those leading change in community settings.\n\nWhat lessons can Zimbabwe and the wider region draw from this? That innovation in healthcare doesnt have to wait for billion-pound hospitals. It can start in clinics, mobile health units, digital tools, and grassroots participation. Just like the NHS must now reimagine itself from the ground up, many African systems have the opportunity to leapfrog legacy issues and build responsive, community-led health models using research, data, and locally relevant solutions.\n\nFor those working in or with the NHS, this is also a moment to shape the system from within, by championing local trials, sharing insights, and refusing to let bureaucracy block progress.\n\nAs the NHS evolves in this new post-structure era, lets not wait for permission to innovate. Lets build a system where research is part of daily life, not a distant concept confined to academia. Because without this fourth shift, the other three wont just stalltheyll collapse.\n\nAnd for the NHS, diaspora communities who rely on it, and global health systems looking on,there is no future without innovation.\n\nDr Richard Dune is the CEO of LearnPac Systems, a leading UK provider of edtech and compliance software solutions for regulated sectors. He specialises in governance, compliance, and innovation in both public and private sectors. He can be reached atdocduner@gmail.comor +44 24 7610 0090.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/13123100/Why-the-NHS-must-make-innovation-its-top-priority-Dr-Richard-Dune--scaled.jpg",
            "description": "<p>By Dr Richard Dune An in-depth look at the fourth shift the NHS urgently needs, moving from research to reality to strengthen care across all system parts. When people across Africa think of the UK’s National Health Service (NHS), they often think of excellence, world-class teaching hospitals, cutting-edge medicine, and free care at the point</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/why-the-nhs-must-make-innovation-its-top-priority/\">Why the NHS must make innovation its top priority</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "US$88 million Trabablas lnterchange to open to motorists soon",
            "url": "https://www.newzimbabwe.com/us88-million-trabablas-lnterchange-to-open-to-motorists-soon/",
            "content": "By Staff Reporter\n\nTHE multi-million Trabablas lnterchange situated along the Harare-Beitbridge highway is scheduled to officially opened to motorists this month.\n\nAccording to the Transport and Infrastructural Development Ministry, construction is almostcomplete.\n\nThe Trabablas Interchange construction project is almost complete. Well be opening it to traffic in May 2025. Stay tuned for the grand opening!! reads a post on the ministrys X handle.\n\nThe Trabablas Interchange, built at a staggering US$88 million, was once a notorious traffic bottleneck. It was transformed into a multi-level interchange aimed at easing traffic congestion and boosting regional trade.\n\nWhile the development promises improved infrastructure and economic benefits, it has faced criticism over its high cost, safety concerns, and a questionable renaming after President Emmerson Mnangagwa, whose wartime nickname was Trabablas.\n\nSituated in the heart of Harare, where Simon Mazorodze, Chitungwiza, and High Glen roads converge, the massive infrastructure project has been taking shape for years.\n\nAccording to government, the roadworks are a critical junction along the Harare-Beitbridge highway and touted as a game-changer for easing traffic congestion and boosting regional trade.\n\nThe Mbudzi roundabout, as it was previously known, was a notorious bottleneck in Harare. During peak hours, commuters faced agonizing delays as vehicles from western Chitungwiza, surrounding suburbs, and the Harare-Masvingo highway converged in a chaotic snarl.\n\nHeavy regional traffic heading to and from South Africa exacerbated the gridlock. For years, the roundabout was a daily struggle for motorists and a barrier to efficient transport along one of Zimbabwes most vital trade routes.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/13093549/mbudzi.jpeg",
            "description": "<p>By Staff Reporter THE multi-million Trabablas lnterchange situated along the Harare-Beitbridge highway is scheduled to officially opened to motorists this month. According to the Transport and Infrastructural Development Ministry, construction is almost complete. “The Trabablas Interchange construction project is almost complete. We’ll be opening it to traffic in May 2025. Stay tuned for the grand opening!!”</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us88-million-trabablas-lnterchange-to-open-to-motorists-soon/\">US$88 million Trabablas lnterchange to open to motorists soon</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Rapper Tory Lanez stabbed 14 times in California prison attack",
            "url": "https://www.newzimbabwe.com/rapper-tory-lanez-stabbed-14-times-in-california-prison-attack/",
            "content": "BBC\n\nRapper Tory Lanez has been rushed to hospital after he was stabbed 14 times in a California prison.\n\nThe Canadian hip-hop artist was attacked by another inmate on Monday morning in a housing unit at the California Correctional Institution in Tehachapi, about 75 miles (120km) north of Los Angeles, prison officials told the BBC.\n\nThe 32-year-old rapper suffered wounds across his body  causing both of his lungs to collapse, according to a post on his Instagram account.\n\nLanez, whose legal name is Daystar Peterson, is serving a 10-year prison sentence for shooting fellow musician Megan Thee Stallion in 2020.\n\nThe stars Instagram post said he was stabbed in the back, torso, head and face. He was temporarily placed on a breathing apparatus but is now able to breathe on his own, the Instagram post adds.\n\nDespite being in pain, he is talking normally, in good spirits, and deeply thankful to God that he is pulling through, the post said.\n\nThe attack happened around 07:20 local time (15:20 GMT), said Pedro Caldern Michel of the states corrections department.\n\nPrison staff began first aid before Lanez was taken to a local medical facility for further treatment, he said.\n\nAn investigation is underway into the stabbing, Mr Caldern Michel told the BBC. He did not comment on the attackers motive.\n\nLanez wassentenced in 2023for three felony gun-related charges, including assault with a semi-automatic firearm.\n\nHe shot Megan Thee Stallion, whose legal name is Megan Pete, as they were leaving a pool party at reality star Kylie Jenners Hollywood mansion.\n\nThe pair argued inside a vehicle about their previous sexual relationship and careers, Megan Thee Stallion testified during the trial.\n\nShe said that she had demanded to be let out of the vehicle, at which point Lanez started shooting at the ground and shouted at her to dance.\n\nShe required surgery to remove bullet fragments from her foot.\n\nLanezrefused to apologiseand maintained his innocence in the shooting.\n\nThe case divided the hip-hop world with rappers  including50 Centand Iggy Azalea  appearing to take sides in the conflict. Some of them wrote to the court to ask for leniency in Lanezs sentencing.\n\nLanez had seven US top 10 albums in the seven years before his conviction. He hasteased the release of a new albumfrom prison titled Peterson.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/13084443/tory-lanez-tout-051225-de1d71169b654de597801d92c45ad54a.jpg",
            "description": "<p>BBC Rapper Tory Lanez has been rushed to hospital after he was stabbed 14 times in a California prison. The Canadian hip-hop artist was attacked by another inmate on Monday morning in a housing unit at the California Correctional Institution in Tehachapi, about 75 miles (120km) north of Los Angeles, prison officials told the BBC.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rapper-tory-lanez-stabbed-14-times-in-california-prison-attack/\">Rapper Tory Lanez stabbed 14 times in California prison attack</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Gwayi- Shangani Dam completion target in doubt, again",
            "url": "https://www.newzimbabwe.com/gwayi-shangani-dam-completion-target-in-doubt-again/",
            "content": "By Alois Vinga\n\nTHE 2025 target set for the completion of the Gwayi-Shangani Construction Project is now in doubt, with the Treasury still to release funds for the work, which has to be finished in the next eight months.\n\nThe Gwayi-Shangani project is seen as a lasting solution to Bulawayos water crisis, but it is behind schedule and has missed deadlines since construction began in 2004.\n\nIn 2018, President Emmerson Mnangagwa, during a tour of the Gwayi-Shangani dam, pledged to do everything in his ability to ensure the project is completed by the end of 2019.\n\nIn 2019, the dam missed the deadline due to delays and budget constraints, and it was pushed to 2022.\n\nAfter missing the 2022 deadline, the completion date was further pushed to the end of 2023.\n\nThe government shifted the dams deadline multiple times, with the most recent target set for completion by the 2023/2024 summer cropping season.\n\nResponding to a question raised by the Hwange East legislator, Hon Joseph Bonda, who demanded to know whether the Dam would be completed this year as scheduled, Lands Deputy Minister, Vangelis Haritatos, hinted that the unavailability of funds could choke the smooth delivery of the project.\n\nWhat needs to be done is that the release of funds has to be done on time. If the releases are not done on time, unfortunately, it is outside of our purview. It is not what we can do. We can make promises. We want to keep to the timeline. If the money comes, we will do our best.\n\nThe contractors are on site. They have every intention, every incentive for them to complete the work. They want to continue and move on. This is a dam that is so fundamental. I have personally visited it more than 20 times and I know the impact it has on the community, he said.\n\nHe said the project is of paramount importance for the communities, not only of the Matabeleland provinces but also of Bulawayo, where 276 kilometres of reticulation will finally end the water woes of the southern region.\n\nThe other impediment with regard to this specific dam is that if we are only given, for example, two million dollars, this means no changes at the Gwayi-Shangani Dam. We require four million US dollars for the dam to be raised another two metres. Every two metres costs four million US dollars. If you are given three million nine hundred thousand, it still cannot be raised until we get the full four million. Not part of it because of the type of dam that we are building. The releases cannot be in drips and drops. They have to be in multipliers of four million and above, said Haritatos.\n\nHe implored stakeholders to encourage the Treasury to prioritise the completion of the dam.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/04195348/Gwayi-Shangani-Dam.png",
            "description": "<p>By Alois Vinga THE 2025 target set for the completion of the Gwayi-Shangani Construction Project is now in doubt, with the Treasury still to release funds for the work, which has to be finished in the next eight months. The Gwayi-Shangani project is seen as a lasting solution to Bulawayo’s water crisis, but it is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gwayi-shangani-dam-completion-target-in-doubt-again/\">Gwayi- Shangani Dam completion target in doubt, again</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Struggling UK care providers say overseas worker crackdown ‘short-sighted’",
            "url": "https://www.newzimbabwe.com/struggling-uk-care-providers-say-overseas-worker-crackdown-short-sighted/",
            "content": "BBC\n\nCare providers have said the government is taking away the lifeline of overseas recruitment without fixing the problems that make it difficult to recruit UK staff.\n\nSir Keir Starmer, the prime minister, announced sweeping reforms to immigration on Monday, including plans to end the recruitment of care workers from overseas.\n\nEven with staff being brought in from other countries,official estimates show there were 131,000 vacanciesin social care in England last year.\n\nCare companies said some services will struggle to survive without international recruits.\n\nThe sector has been propping itself up with dwindling resources, rising costs, and mounting vacancies, said Prof Martin Green of Care England, which describes itself as the largest representative body for independent care providers.\n\nTaking (international recruitment) away now with no warning, no funding, and no alternative, is not just short-sighted  its cruel, he said.\n\nSir Keir said the visa changes were part of a drive to reduce immigration significantly and that the government wanted to create a migration system that is controlled, selective and fair.\n\nThe government said care providers could extend visas for existing staff and recruit migrants already in the UK who have yet to find a job. It also promised a new fair pay agreement for care staff and wanted companies to recruit and train more people from UK.\n\nHowever, Dr Jane Townson of the Homecare Association said the government was introducing the changes in a vacuum as a fair pay agreement is a long way off and there is no plan to deliver the care workers our country needs.\n\nSocial care has been in crisis for years, with council funding of services squeezed, significant staff-shortages and growing demand from an ageing population. Plans for reform have been delayed time and again.\n\nWhile care workers were clapped along with health workers during the pandemic, that did not translate into an improvement in pay or status.\n\nAbout 1.7 million people work in social care in England, according to Skills for Care, the official body that monitors the workforce.It is often a minimum or just above minimum wage job, with little recognition of the increasing responsibility and complexity of the support staff provide to older and disabled people.\n\nPutting it bluntly, if someone can earn more working, for instance, in a supermarket for fewer, less strenuous hours, then that is the option many will chose.\n\nPost-Covid, some staff left care work because they felt burnt out while others who still loved the job felt they could not afford the increases in the cost of living.\n\nBetween April 2021 and March 2022, social care vacanciesreached a record highof 165,000, a 52% increase on the year before.\n\nBy December 2021, the warnings of imminent collapse prompted Boris Johnsons Conservative government to make care work a shortage occupation,making it easier for companies to look overseas for staff.\n\nRecruits had to earn a minimum of 20,480 a year to qualify for the visa, and they could bring family with them.\n\nThere wasa rapid rise in overseas recruitment in 2022/23 80,000 people arrived in the UK to work in care and in 23/24, there were another 105,000 visas.\n\nMany care companies said bringing in those staff was the difference between providing services and collapsing. However, there was also abuse of this new route into the UK. For instance,some people were exploited, ending up paying middlemen thousands for travel and sponsorship certificates.\n\nThe Home Office says 470 care companies have had their licence to recruit international staff revoked since 2022. It estimates that has led to about 40,000 staff being displaced. Companies say many will have already found alternative care work.\n\nIn March 2024, Rishi Sunaks Conservative government tightened the visa requirements. This included saying recruits could no longer bring family with them. It has led to a significant fall in the number of care workers arriving from abroad.\n\nIn the year up to December 2024, 9,500 visas were granted to people entering the UK to provide caring personal services, according to the government.\n\nHowever, in the four years since staff shortages were most acute, relatively little has changed to encourage more UK people to work in care. There has been anongoing government funded recruitment campaignand talk of the need to improve the pay and status of staff, but many workers fear solutions remain a long way off.\n\nThe independent Casey Commission started work last month to draw up plans for adult social care. It has been described by ministers as a once in a generation opportunity to transcend party politics and build consensus on the future of the sector. Its first update is due next year and its final report by 2028.\n\nAt a time when the NHS is struggling, social care is more important than ever as it can keep vulnerable people out of hospital and support patients when they return home.\n\nMany care workers will say it is an incredibly rewarding job and with overseas recruitment being closed, the question is what needs to change to encourage more UK people to take on the role?\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/17095213/Care-Worker.png",
            "description": "<p>BBC Care providers have said the government is taking away the “lifeline” of overseas recruitment without fixing the problems that make it difficult to recruit UK staff. Sir Keir Starmer, the prime minister, announced sweeping reforms to immigration on Monday, including plans to end the recruitment of care workers from overseas. Even with staff being</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/struggling-uk-care-providers-say-overseas-worker-crackdown-short-sighted/\">Struggling UK care providers say overseas worker crackdown ‘short-sighted’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Repetitive licensing fees to stop in six months – govt",
            "url": "https://www.newzimbabwe.com/repetitive-licensing-fees-to-stop-in-six-months-govt/",
            "content": "By Alois Vinga\n\nINDUSTRY and Commerce Minister, Mangaliso Ndlovu, says repetitive licenses, which are negatively contributing towards unsustainable overhead costs for companies, will be history in six months time.\n\nThe challenge of numerous licenses has dogged the economy for years amid indications that, for instance, for one to operate a single supermarket, there is a need to obtain about 25 licenses and permits. These licenses come with hefty fees, affecting large-scale retailers like OK Zimbabwe and TM Pick n Pay, which have over 50 branches nationwide.\n\nAnother example drawn from the poultry sector players shows huge licenses demanded by the National Biotechnology Authority (NBA) and the Agriculture Marketing Authority (AMA), with the former demanding an annual registration fee of $6,500 per annum despite the fact that they do not provide a service, nor do they inspect the plant.\n\nThe sectors players report that AMA also requires a quarterly registration of imported feed ingredients, which include minerals that are not genetically modified, which carry a yearly cost of $36,400.\n\nAgainst the background, AMA also issues almost similar licenses for Feed Mill Registration, costing $1,000 and plant quarantine, which costs $1,800 per annum, despite the fact that they do not provide any service nor do they inspect the plant. These license fees are over and above normal operating taxes, as well as some fees collected by the local authorities.\n\nResponding to Parliamentarians after a question about what the government is doing to ease the burden of regulatory fees, which, according to the CZI, contribute towards 18% of overhead costs, Ndlovu said such burdens will soon be a thing of the past.\n\nWe identified in our reconstruction and growth plan that the regulatory environment weighs heavily on business viability, and to address it, we have the Minister of Finance working with the Office of the President and Cabinet (OPC) to address this. They have identified most of these licences, fees and other compliance issues that have to be addressed, and shortly, Mr. Speaker, those who followed the Minister of Finance did highlight a few months back that in six months, most of these will be done away with, he said.\n\nThe Minister underscored that it is a thorough process that has to be done with due diligence, with those tasked to address the problems nearing completion.\n\nThey have indicated they are almost complete with that exercise. They will, in the nearest possible future, make announcements of the regulations that are falling away and those that will be significantly slashed to make sure we promote the ease and cost of doing business, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/28155833/Mangaliso-Ndlovu.jpg",
            "description": "<p>By Alois Vinga INDUSTRY and Commerce Minister, Mangaliso Ndlovu, says repetitive licenses, which are negatively contributing towards unsustainable overhead costs for companies, will be history in six months’ time. The challenge of numerous licenses has dogged the economy for years amid indications that, for instance, for one to operate a single supermarket, there is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/repetitive-licensing-fees-to-stop-in-six-months-govt/\">Repetitive licensing fees to stop in six months – govt</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Treasury perm sec in no show as Parliament seeks answers over mishandled US$400 million",
            "url": "https://www.newzimbabwe.com/treasury-perm-sec-in-no-show-as-parliament-seeks-answers-over-mishandled-us400-million/",
            "content": "By Staff Reporter\n\nFINANCE Ministry Permanent Secretary George Guvamatanga was again a no-show on Monday when he was expected to appear before the Parliamentary Public Accounts Committee (PAC) and explain the gross mismanagement of public funds amounting to US$400 million unearthed by the Auditor Generals report.\n\nPAC has been making efforts to interrogate Treasury officials over the Auditor Generals findings that the Finance Ministry flouted standard Public Finance Management Act (PFMA) procedures and made payments directly to suppliers, bypassing line ministries and agencies.\n\nGuvamatanga is said to have written to Parliament requesting more time to compile documents required by the Committee relating to payments amounting to US$400 million made to several companies, which include Fertilisers Seed Grain (FSG), Ziminya Dam Construction, Ventures Borehole & Exploration, Nyika Kanengoni, Semwa Dam, Makomo Engineering and RenForm CC, which is linked to controversial tenderpreneur Wicknell Chivayo.\n\nThe hearing on the running of affairs at the Treasury and the AGs findings was postponed to Friday, 23 May, to allow Minister Mthuli Ncube and his permanent secretary to put their house in order, avail themselves and give oral evidence.\n\nIf Guvamatanga does not show up again, PAC has warned it will issue a summons through the Clerk of Parliament.\n\nThe Ministry will now appear before the Committee on Friday, 23 May at 1000hrs.\n\nWe have resolved as a Committee that the Ministry of Finance Permanent Secretary (George Guvamatanga) need to appear on Friday and we also resolved last week that the Minister (Mthuli Ncube) must also come because there are policy issues that he must also come and attend to, PAC chairperson Charlton Hwende said.\n\nHe added, Regarding the non-shows, it affects only the permanent secretary (Guvamatanga) because we will be inviting the minister for the first time, so that he can come and address the policy issues that we want him to address.\n\nThe permanent secretary must also appear with his team together with the minister on Friday, at 10 oclock in the morning and failing to appear, we resolved that the Clerk of Parliament must issue summons in terms of Standing Orders that same Friday.\n\nWe give them a very final chance to appear on Friday, and we are preparing summons through the office of the Clerk of Parliament, and if they dont come, summons are issued immediately on that Friday.\n\nThe Finance Ministry is also expected by PAC to answer questions relating to its failure to submit treasury minutes to Parliament.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Staff Reporter FINANCE Ministry Permanent Secretary George Guvamatanga was again a no-show on Monday when he was expected to appear before the Parliamentary Public Accounts Committee (PAC) and explain the gross mismanagement of public funds amounting to US$400 million unearthed by the Auditor General’s report. PAC has been making efforts to interrogate Treasury officials</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/treasury-perm-sec-in-no-show-as-parliament-seeks-answers-over-mishandled-us400-million/\">Treasury perm sec in no show as Parliament seeks answers over mishandled US$400 million</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        },
        {
            "title": "Kwekwe United fined US$3,500 by PSL",
            "url": "https://www.newzimbabwe.com/kwekwe-united-fined-us3500-by-psl/",
            "content": "By Sports Reporter\n\nKwekwe United has been fined US$3,500 for failing to fulfil a fixture against Herentals last month.\n\nThe league debutantes side did not show up for the matchday seven home fixture at Bata stadium as players were protesting over outstanding salaries and signing-on fees.\n\nOn the day, visiting side Herentals showed up at the match venue and were on the pitch during kick-off time.\n\nFollowing a hearing by PSLs Disciplinary Committee, Kwekwe United were found guilty; hence Herentals have been awarded 3 points.\n\nThe Premier Soccer League Disciplinary Committee has released the judgment in the matter involving Kwekwe United FC.\n\nThe Club was found guilty of failing to fulfil a scheduled Castle Lager PSL fixture and fined a sum of USS3,500, US$500 of which is suspended for the rest of the season on condition that the club is not convicted of a similar offence.\n\nThe effective fine of US$3,000 together with costs of hearing to be paid by 23 May 2025.\n\nIn addition, the unfulfilled fixture has been awarded to Herentals FC on a three-nil scoreline, read the PSL statement.\n\nKwekwe United is facing financial challenges. Last week, the club promised to improve going forward.\n\nIndeed, like many clubs in the league, we have faced financial challenges, but I can assure you that the club is working tirelessly behind the scenes to source funding and attract strategic partners who can assist in stabilising and strengthening our operations, read part of their statement.\n\nThe Blues are currently bottom of the log with 7 points out of eleven games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/23100047/kwekwe.jpg",
            "description": "<p>By Sports Reporter Kwekwe United has been fined US$3,500 for failing to fulfil a fixture against Herentals last month. The league debutantes’ side did not show up for the matchday seven home fixture at  Bata stadium as players were protesting over outstanding salaries and signing-on fees. On the day, visiting side Herentals showed up at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kwekwe-united-fined-us3500-by-psl/\">Kwekwe United fined US$3,500 by PSL</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "13 May 2025"
        }
    ]
}