{
    "news": [
        {
            "title": "‘Abahambe’: Gayton McKenzie demands deportation of illegal foreigners, citing VAT losses to SA’s economy",
            "url": "https://www.newzimbabwe.com/abahambe-gayton-mckenzie-demands-deportation-of-illegal-foreigners-citing-vat-losses-to-sas-economy/",
            "content": "IOL\n\nThe Patriotic Alliance (PA) leader Gayton McKenzie has reiterated his demand for the deportation of illegal foreigners, declaring Abahambe, (let them go), insisting that undocumented foreigners working in restaurants and receiving healthcare should leave.\n\nMcKenzie argued that illegal immigrants dominate the restaurant industry in Cape Town, Western Cape, while South Africans remain jobless.\n\nHe added, despite being labelled asxenophobicfor his views, he has embraced the label.\n\nIve embraced that. But heres the issue. This is the uncomfortable thing that you dont want to hear, but youre going to hear today, McKenzie said in an interview with BizNews.\n\nMcKenzie, who also serves as the Minister of Sports, Arts and Culture, has repeatedly called for the deportation of illegal foreigners.\n\nHe claimed that undocumented foreigners are not contributing to the countrys economy by VAT, and are taking the jobs that South Africans could fill.\n\nIllegal foreigners working in your houses, working in your businesses, you dont VAT them. You leave them with your children, you dont know who they are, McKenzie said.\n\nHe further alleged that some of these people were arrested in their home countries and, upon release, entered South Africa illegally.\n\nSome of them, when they are in jail in Ethiopia, when they get released from jail, they come to South Africa. When they are in jail in Zimbabwe, when they are released, they come to South Africa, he said.\n\nAll illegal foreigners need to leave this country.\n\nMcKenzie expressed concern with foreign nationals being hired as workers while South Africans are often overlooked for jobs.\n\nHe suggested this is driven by racism, as employees prefer foreigners who have no rights, unions, or recourse.\n\nWhen you start saying stuff like, Zimbabweans are hard workers, South Africans dont want to work, no, its not about South Africans who dont want to work. It is your racism that you are hiding, that you prefer a foreigner, because they have no rights, he said.\n\nHe continued, stressing the harm caused byundocumented immigrants, especially in violent incidents.\n\nIf somebody kills your brother, your sister, your mother, and they are not documented, its only then when youll see the harm that illegal foreigners are causing us.\n\nMcKenzie called on all restaurants in Cape Town to stop employing illegal foreigners.\n\nGo to every restaurant in Cape Town, illegal foreigners are working. Stop hiring illegal foreigners. Get someone who is South African and can pay VAT.\n\nHe also argued that illegal foreigners should not receive medical attention in the country, saying that their presence contributes to the long lines at healthcare facilities.\n\nThe people that dont have medical aid must stand in the line and theres 10 Zimbabweans ahead of them, he said.\n\nMcKenzie also criticised the housing system, claiming that foreign nationals are taking up the spaces on RDP housing lists meant for South Africans.\n\nThe people that apply for housing must stand in the line because there are 300 Mozambicans on the same housing list, he said.\n\nHe reiterated that 12% of South Africas prison population consists of illegal foreigners, which he said is not normal.\n\nSo Im still saying to you,Abahambe, they must go, he said.\n\nWith the upcoming 2026 local government elections, McKenzie emphasised that deporting illegal immigrants, specifically those working in restaurants and accessing healthcare services will be a key focus for the PA.\n\nNext year, when we start the campaign, we are coming to all the businesses, all your businesses that are hiring illegal foreigners. We are going to give you South Africans to work there. They will have no excuse. . ., he said.\n\nGet rid of your illegal foreigners now, because next year is not going to be easy. You heard it here first.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181937/Patriotic-Alliance-PA-leader-Gayton-McKenzie-emphasizes-his-stance-on-illegal-immigration-in-South-Africa-ahead-of-the-2026-elections.webp",
            "description": "<p>IOL The Patriotic Alliance (PA) leader Gayton McKenzie has reiterated his demand for the deportation of illegal foreigners, declaring “Abahambe,” (let them go), insisting that undocumented foreigners working in restaurants and receiving healthcare should leave. McKenzie argued that illegal immigrants dominate the restaurant industry in Cape Town, Western Cape, while South Africans remain jobless. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/abahambe-gayton-mckenzie-demands-deportation-of-illegal-foreigners-citing-vat-losses-to-sas-economy/\">‘Abahambe’: Gayton McKenzie demands deportation of illegal foreigners, citing VAT losses to SA’s economy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Energy minister says Zimbabwe has lost 6,000 transformers to vandalism",
            "url": "https://www.newzimbabwe.com/energy-minister-says-zimbabwe-has-lost-6000-transformers-to-vandalism/",
            "content": "By Staff Reporter\n\nENERGY and Power Development Minister, July Moyo, has said that the nation is grappling with transmission infrastructure due to vandalism, which has seen 6,000 transformers stolen.\n\nMoyo was addressing Parliament this Wednesday while responding to a question by Murehwa South legislator, Noah Mangondo, during the Question-and-Answer session.\n\nMangondo demanded to know governments policy regarding replacing damaged or vandalised electricity transmission infrastructure, particularly for learning institutions and health centres, which at times go for months without electricity.\n\nThe main problem we are facing is vandalism of infrastructure, and as we speak, 6,000 transformers were stolen countrywide. We have no capacity locally to produce enough to replace them timeously.\n\nFor the wooden poles, the policy we now have is that we replace them with concrete ones which are more durable, Moyo told lawmakers.\n\nThe Zimbabwe Electricity Supply Authority (ZESA) was previously quoted in media reports saying it lost electricity transmission and distribution equipment valued at over US$2 million to theft and vandalism between January and October 2024, a development that has left many communities already struggling with load-shedding in the dark.\n\nAccording to the power utility, nearly 30 tonnes of copper conductors valued at US$600,000, along with 10 tonnes of aluminium conductors worth US$103,000, were stolen during this period.\n\nAdditionally, 1,543 litres of transformer oil valued at US$7,700 were siphoned off by thieves, while 136 transformers  essential components in electricity transmission  were vandalised, costing US$848,558.\n\nDaring vandals also targeted bolts and nuts from high-voltage pylons, causing damage exceeding US$4,300.\n\nIn total, ZESA recorded 1,317 cases of theft and vandalism, resulting in losses valued at US$2,163,207.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/01031427/ZESA-Transformer-1.png",
            "description": "<p>By Staff Reporter ENERGY and Power Development Minister, July Moyo, has said that the nation is grappling with transmission infrastructure due to vandalism, which has seen 6,000 transformers stolen. Moyo was addressing Parliament this Wednesday while responding to a question by Murehwa South legislator, Noah Mangondo, during the Question-and-Answer session. Mangondo demanded to know government’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/energy-minister-says-zimbabwe-has-lost-6000-transformers-to-vandalism/\">Energy minister says Zimbabwe has lost 6,000 transformers to vandalism </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "The Bombshell signal! Geza ropes in Chamisa, Sikhala as he threatens March 31 protests",
            "url": "https://www.newzimbabwe.com/the-bombshell-signal-geza-ropes-in-chamisa-sikhala-as-he-threatens-march-31-protests/",
            "content": "By Darlington Gatsi\n\nDEFIANT war veteran, Blessed Bombshell Geza, has issued President Emmerson Mnangagwa with an ultimatum to step down or face the wrath of street protests.\n\nGeza re-emerged, dressed in military attire, as he publicly spoke for the first time in an online address, condemning Mnangagwas government for overseeing and tolerating corruption.\n\nThe ousted ZANU-PF member said that Zimbabwe should prepare for a wave of protests against Mnangagwa on 31 March.\n\nOn 31 March, we kindly ask everyone to participate in an uprising. Everyone should go on the streets. We want Mnangagwa and his corrupt cabals to step down on 31 March. We appeal to those who can provide transportation to assist.\n\nCome out in numbers so that these people leave. We dont want to hear that law enforcement agents descended on the public or hurt them. Be warned. Its a wave and its unstoppable. Let people demonstrate freely. It is a constitutional right. We are doing this for Zimbabweans. So that everyone gets a better life, said Geza.\n\nGeza has not held back in his criticism ofthe government, which he accuses of cronyism and running the country into the ground.\n\nThe outspoken war veteran is currently on the run after challenging Mnangagwa to step down and not seek re-election in 2028, despite pressure from a faction within the ruling party, ZANU-PF.\n\nGeza claimed that he has the support of political figures such as Nelson Chamisa and Job Sikhala in his plan to protest against Mnangagwas government.\n\nFellow Zimbabweans. The signal is now close. We will bring it up in a clever way, so that our enemies will never know. It will be in a few days. We know that Mnangagwa wants to declare a state of emergency but that will not work. We will deal with our issues as Zimbabweans.\n\nWe have engaged all political players like Chamisa, Sikhala, Mwonzora, Komichi and we agreed on a way forward. For your own information all these people like General Chiwenga. So be warned, the signal is coming very soon, he said.\n\nThe infighting within ZANU-PF serves as a reminder of the 2017 internal battles that led to the coup, which toppled Robert Mugabe from power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/28082345/chamisa_.jpg",
            "description": "<p>By Darlington Gatsi DEFIANT war veteran, Blessed “Bombshell” Geza, has issued President Emmerson Mnangagwa with an ultimatum to step down or face the wrath of street protests. Geza re-emerged, dressed in military attire, as he publicly spoke for the first time in an online address, condemning Mnangagwa’s government for overseeing and tolerating corruption. The ousted</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-bombshell-signal-geza-ropes-in-chamisa-sikhala-as-he-threatens-march-31-protests/\">The Bombshell signal! Geza ropes in Chamisa, Sikhala as he threatens March 31 protests </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Woman sues ex-husband who assaulted her for declining Valentine’s gift",
            "url": "https://www.newzimbabwe.com/woman-sues-ex-husband-who-assaulted-her-for-declining-valentines-gift/",
            "content": "By Staff Reporter\n\nA woman was recently bashed by her ex-husband after she declined his Valentines gift, a Harare court has heard.\n\nThe suspect, Brandon Ncube (22), appeared before Harare magistrate Learnmore Mapiye and was fined US$150 following his conviction on Tuesday.\n\nNcube was convicted on one count of physical abuse.\n\nHe was also charged with theft, but the magistrate acquitted him on this count.\n\nProsecutors had alleged that after assaulting his ex-wife Rebecca Masunda, Ncube went on to steal US$10,000, which was in a piggy bank.\n\nIn convicting Ncube, the magistrate said the medical affidavit confirmed that Masunda was assaulted.\n\nPartners are also urged to find amicable ways of resolving their differences rather than to resort to violence, the magistrate said.\n\nAccording to the State, on February 14 at around 2000 hours, Ncube went to Masundas place of residence with a Valentines gift, but she refused to accept it on the basis that they had separated.\n\nThis angered the accused, who then assaulted the complainant with open hands on her face and also grabbed her by the neck. The complainant bled due to the assault, but she managed to escape, leaving Ncube in her room, the State proved.\n\nIt is at this juncture that the State alleges that Masunda later came back around 2200 hours and discovered that Ncube had stolen a piggy bank in her wardrobe, which had US$10,000.\n\nMasunda allegedly contacted Ncube, asking where her piggy bank was but he prophesied ignorance and ordered her to report the matter to the police, and that is when he was arrested.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/15052055/PSX_20240214_164835-scaled.jpg",
            "description": "<p>By Staff Reporter A woman was recently bashed by her ex-husband after she declined his Valentine’s gift, a Harare court has heard. The suspect, Brandon Ncube (22), appeared before Harare magistrate Learnmore Mapiye and was fined US$150 following his conviction on Tuesday. Ncube was convicted on one count of physical abuse. He was also charged</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/woman-sues-ex-husband-who-assaulted-her-for-declining-valentines-gift/\">Woman sues ex-husband who assaulted her for declining Valentine’s gift</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Housemaid shot, injured after firearm accidentally discharged",
            "url": "https://www.newzimbabwe.com/housemaid-shot-injured-after-firearm-accidentally-discharged/",
            "content": "By Staff Reporter\n\nA HOUSEMAID was accidentally shot and injured after a pistol dropped from the bed she was making and discharged.\n\nThe bullet from the firearm hit her on the lower limb, resulting in an injury.\n\nThe firearm is believed to belong to the victims employer, identified as Charlene Geddes aged 57.\n\nZimbabwe Republic Police (ZRP) Mashonaland West provincial spokesperson, Inspector Ian Kohwera confirmed the incident which occurred on Wednesday.\n\nZRP Kariba is investigating circumstances surrounding an incident in which a female adult aged 32 years was accidentally shot on her lower limb of the left leg and sustained a gunshot wound, said Kohwera.\n\nThe victim was doing her household chores at Stand Number 626 Baobab Lodge, Kariba. As she was preparing her employers bed a firearm dropped and fired one round which shot her leg.\n\nShe was rushed to a local medical centre for treatment. A police report was made at ZRP Kariba, he added.\n\nPolice in Mashonaland West province urged all firearm holders to ensure that their weapons are secured in gun cabinets, which are fixed to the wall.\n\nAlso, police implored gun owners to notify authorities whenever they change addresses and to take all necessary steps to have their guns cleared as outlined in the Firearms Act.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/11/28190845/domestic-worker.jpg",
            "description": "<p>By Staff Reporter A HOUSEMAID was accidentally shot and injured after a pistol dropped from the bed she was making and discharged. The bullet from the firearm hit her on the lower limb, resulting in an injury. The firearm is believed to belong to the victim’s employer, identified as Charlene Geddes aged 57. Zimbabwe Republic</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/housemaid-shot-injured-after-firearm-accidentally-discharged/\">Housemaid shot, injured after firearm accidentally discharged</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "TSL projects up to 20% higher tobacco yields",
            "url": "https://www.newzimbabwe.com/tsl-projects-up-to-20-higher-tobacco-yields/",
            "content": "By Alois Vinga\n\nTOBACCO Sales Limited (TSL) has projected a surge in the golden leafs output of between 15% to 20% this year followingimproved rainfall towards the last half of the rainy season.\n\nPresenting a trading update for the period ended January 31 2025, TSL company secretaryFadzayi Pedzisayi anticipatedhigher yields this season as compared to last year.\n\nThe national tobacco crop is projected to be between 15% and 20% higher than the 231 million kilograms achieved in 2024. As of 14 March, 11 million kgs had been sold compared to 15 million for the same number of selling days in the 2023/24 season, she said.\n\nDuring the period, group revenue for Q1 was 9% below the comparative period in prior year.\n\nThe delayed onset of the summer rains adversely affected the Groups agriculture-based operations. Group profit was, however, significantly ahead of the previous year as a result of cost containment measures implemented towards the end of the 2024 financial year.\n\nIn preparation for the start of the tobacco selling season in Q2, Tobacco Sales Floor maintained its decentralised floors in Karoi, Mvurwi and Marondera in addition to its Harare Floor and increased the level of automation to meet the targeted volume throughput.\n\nIn the TSLs logistics division, tobacco handling volumes in Q1 were 34% below prior period and forklifts hire hours were 11% below prior year as most tobacco merchants closed operations earlier due to the reduced 2024 tobacco crop.\n\nGeneral cargo storage volumes were 66% ahead of prior year as a result of the delay in the onset of the summer rains, resulting in agricultural inputs being kept for longer than anticipated. The handling volumes were resultantly depressed as most of the fertilizer received will be distributed to customers.\n\nThe Groups acquisition of a 51.43% stake in Nampak Zimbabwe is on track for completion in Q3 2025. The Board is currently engaged in obtaining the requisite approvals for the acquisition. Notwithstanding the challenging operating environment, the Group will continue to pursue key strategic initiatives that are expected to enhance shareholder value, added Pedzisayi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31054919/Tobacco-Agriculture.jpg",
            "description": "<p>By Alois Vinga TOBACCO Sales Limited (TSL) has projected a surge in the golden leaf’s output of between 15% to 20% this year following improved rainfall towards the last half of the rainy season. Presenting a trading update for the period ended January 31 2025, TSL company secretary Fadzayi Pedzisayi anticipated higher yields this season as compared to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tsl-projects-up-to-20-higher-tobacco-yields/\">TSL projects up to 20% higher tobacco yields</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Ghana journalist awarded $18m in US after suing ex-MP",
            "url": "https://www.newzimbabwe.com/ghana-journalist-awarded-18m-in-us-after-suing-ex-mp/",
            "content": "A US court awarded Ghanaian investigative journalist Anas Aremeyaw Anas $18m in damages, after a jury said he was defamed by former Ghanaian MP Kennedy Agyapong.\n\nThe case stems from comments Agyapong made about Anas afterhis BBC investigation in 2018 that exposed football corruption in Ghana and elsewhere.\n\nThe court heard that Agyapong, among other accusations made on a podcast, had called the reporter a criminal and alleged he was behind the murder of fellow journalist Ahmed Suale.\n\nAnas lost a similar legal action in Ghana seven years ago. But after the release of the podcast episode in 2021 Anas went to court in the US state of New Jersey where Agyapong has a property.\n\nThe politician was in New Jersey when he was interviewed for the Daddy Fred Show podcast, according to court papers filed by his lawyers.\n\nLast weeks initial verdict was confirmed on Tuesday. The $18m in damages was the result of a unanimous decision by an eight-member jury in Essex County Superior Court in New Jersey, finding Agyapong liable for defamation.\n\nThe figure included $8m in punitive damages.\n\nJustice has prevailed. This victory is not just for me, but for truth, press freedom, and every journalist who risks everything to expose corruption and wrongdoing, Anas said in response.\n\nNo amount of intimidation or falsehood will silence the pursuit of accountability even in the face of assassination. Our work continues, undeterred and unafraid.\n\nThe journalist, who has won multiple international awards for his reporting, has vowed to continue fighting corruption and holding wrongdoers accountable.\n\nAgyapongs lawyers had unsuccessfully argued that the case should not have been brought in the US in the first place. They also said that the comments made on the podcast were the kinds of things other courts had described as hyperbole and opinion and were not subject to a defamation case.\n\nMeanwhile, police in Ghana have arrested a suspect in connection with the murder of Anas colleague,Ahmed Hussein Suale, who was killed in 2019.\n\nThe suspect allegedly shared pictures of the undercover journalist with a popular Ghanaian politician before his death.\n\nThe death of Ahmed was also linked to a football corruption expos.\n\nThe investigation sought to expose corruption in African football and was reported by BBC Africa Eye.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19201522/anas-journo.webp",
            "description": "<p>A US court awarded Ghanaian investigative journalist Anas Aremeyaw Anas $18m in damages, after a jury said he was defamed by former Ghanaian MP Kennedy Agyapong. The case stems from comments Agyapong made about Anas after his BBC investigation in 2018 that exposed football corruption in Ghana and elsewhere. The court heard that Agyapong, among other</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ghana-journalist-awarded-18m-in-us-after-suing-ex-mp/\">Ghana journalist awarded $18m in US after suing ex-MP</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Vendors stay put in Harare CBD, ignore government directive",
            "url": "https://www.newzimbabwe.com/vendors-stay-put-in-harare-cbd-ignore-government-directive/",
            "content": "Vendors in Harares central business district (CBD) are still operating, defying a government directive ordering them to vacate the streets.\n\nLast week, government instructed the Harare City Council to remove vendors from the CBD within 48 hours; however, days later, they are still there.\n\nPictures by Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181307/Vendors-8.jpg",
            "description": "<p>Vendors in Harare’s central business district (CBD) are still operating, defying a government directive ordering them to vacate the streets. Last week, government instructed the Harare City Council to remove vendors from the CBD within 48 hours; however, days later, they are still there. Pictures by Thandiwe Garusa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vendors-stay-put-in-harare-cbd-ignore-government-directive/\">Vendors stay put in Harare CBD, ignore government directive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Northampton sign Zimbabwe prop Kundiona",
            "url": "https://www.newzimbabwe.com/northampton-sign-zimbabwe-prop-kundiona/",
            "content": "BBC\n\nNorthampton Saints have signed Zimbabwe prop Cleopas Kundiona from French side USON Nevers.\n\nThe 26-year-old tight-head will join the Premiership club for the 2025-26 season, having made 49 appearances for Nevers.\n\nKundiona will be the second Zimbabwean to play for Saints following Brian Mujati, who was with them from 2009 to 2013.\n\nWe initially spoke with Cleopas around 18 months ago, and weve continued to watch him over at Nevers, said Saints director of rugby Phil Dowson.\n\nHes garnered a huge amount of experience in what is a very tough French league, and hes someone with a lot of athleticism; hes a big man, but he is also fast and very powerful.\n\nKundiona helped Zimbabwe win last years Africa Cup, beating Algeria 29-3 in the final in Uganda.\n\nIm extremely grateful for this opportunity, it feels like a blessing for me to make this step and it has taken a lot of hard work and perseverance, he said.\n\nThe league is definitely faster than Pro D2, and Ive already watched plenty of Saints matches so I am relishing the chance to work alongside the players already at the club.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19200454/cleo-kundiona-e1742414722936.webp",
            "description": "<p>BBC Northampton Saints have signed Zimbabwe prop Cleopas Kundiona from French side USON Nevers. The 26-year-old tight-head will join the Premiership club for the 2025-26 season, having made 49 appearances for Nevers. Kundiona will be the second Zimbabwean to play for Saints following Brian Mujati, who was with them from 2009 to 2013. “We initially</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/northampton-sign-zimbabwe-prop-kundiona/\">Northampton sign Zimbabwe prop Kundiona</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        },
        {
            "title": "Ex-studio engineer charged with stealing unreleased Eminem music, selling it online",
            "url": "https://www.newzimbabwe.com/ex-studio-engineer-charged-with-stealing-unreleased-eminem-music-selling-it-online/",
            "content": "ABC News\n\nA former Eminem studio engineer is charged with stealing the Detroit rappers unreleased music and selling it online, federal prosecutors announced Wednesday.\n\nInvestigators say more than 25 songs have been played or distributed online without the consent ofEminemor Interscope Capital Labels Group, which owns Eminems music. The music was stored on password-protected hard drives kept in a safe at Eminems studio in Ferndale, Michigan, according to an FBI affidavit.\n\nJoseph Strange, 46, of Holly, Michigan, is charged with copyright infringement and interstate transportation of stolen goods, Acting U.S. Attorney Julie Beck in Detroit said. Strange, who lost his job at Eminems studio in 2021, could face up to 15 years in prison if convicted of both counts.\n\nStranges attorney, Wade Fink, said in a text to The Associated Press that Strange is a married father of two with decades of dedication to the music industry. He called the charges untested allegations that havent been vetted by a grand jury or a judge.\n\nWe will handle the matter in a courtroom and we have great faith in the judges of our district, he said.\n\nStudio employees reported the theft to the FBI in January, saying unreleased music that was still in development was being played on various websites, including Reddit and YouTube.\n\nA review showed someone transferred files from a hard drive in a safe to an external hard drive in October 2019 and January 2020, when Strange was a sound engineer at the studio.\n\nInvestigators found buyers after Eminem business associate Fred Nassar posted an online warning to fans not to distribute the music.\n\nA Canadian resident who used the screen name Doja Rat told investigators he had purchased 25 unreleased songs from Strange for about $50,000 in Bitcoin. He said he raised the money from a group of fans of Eminem, whose real name is Marshall Mathers III.\n\nStrange also was trying to sell some of Eminems handwritten lyric sheets, Doja Rat said.\n\nAnother group of fans organized by someone in Connecticut using the screen name ATL also purchased a couple of songs from Strange for about $1,000, according to the affidavit.\n\nAn FBI search of Stranges home in January turned up numerous handwritten Eminem lyric sheets and notes; a VHS tape of an unreleased Eminem video; and hard drives with 12,000 audio files. The music was in various stages of development and created by Eminem as well as by other unidentified artists working with him.\n\nEminemwon for best hip hop actat the 2024 MTV EMAs and was inducted into the Rock&Roll Hall of Fame in 2022.\n\nThe affidavit notes that Strange signed an agreement as part of his severance package that specifically prohibited him from electronically circulating Eminems work.\n\nProtecting intellectual property from thieves is critical in safeguarding the exclusive rights of creators and protecting their original work from reproduction and distribution by individuals who seek to profit from the creative output of others, Beck said in a news release.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/22053545/Eminem-Picture-Instagram.webp",
            "description": "<p>ABC News A former Eminem studio engineer is charged with stealing the Detroit rapper’s unreleased music and selling it online, federal prosecutors announced Wednesday. Investigators say more than 25 songs have been played or distributed online without the consent of Eminem or Interscope Capital Labels Group, which owns Eminem’s music. The music was stored on password-protected hard</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ex-studio-engineer-charged-with-stealing-unreleased-eminem-music-selling-it-online/\">Ex-studio engineer charged with stealing unreleased Eminem music, selling it online</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:40",
            "date": "20 Mar 2025"
        }
    ]
}