{
    "news": [
        {
            "title": "US reviewing its funding in Zimbabwe in line with Trump’s America First policy",
            "url": "https://www.newzimbabwe.com/us-reviewing-its-funding-in-zimbabwe-in-line-with-trumps-america-first-policy/",
            "content": "By Leopold Munhende\n\nThe US Embassy has announced that it is currently reviewing all funds released to Zimbabwe through its State Department and USAID, as new President Donald Trumps America First policy takes effect.\n\nOn inauguration, Trump announced a raft of changes to Americas funding model that emphasised reasonable use of taxpayers money and focus on developing the superpower first.\n\nThe policy paused millions of US dollars in funding for local civil society organisations (CSOs) and billions across the world.\n\nWith America being a major funder of development in Zimbabwes health and education sectors, fears abound they would crumble.\n\nA waiver was later announced on health-related funding as most of Africas poorly resourced health systems threatened to crumble.\n\nIn a statement released Wednesday, the US Embassy revealed that funding will now be reviewed in line with its foreign policy.\n\nThe review of all foreign assistance programs will ensure they are efficient and consistent with U.S. foreign policy under the America First agenda, reads the statement.\n\nRELATED:\n\nThe US Embassy in Zimbabwe has paused its foreign assistance and is reviewing its programs to bring them in line with this Executive Order and the waiver.\n\nThe United States is proud of the gains we have helped Zimbabwe make in health, food security, and development.\n\nToday, 1.2 million Zimbabweans live longer, healthier lives because of PEPFARs support for HIS services.\n\nOver 1600 public hospitals and clinics have benefited from training and technical support from the United States.\n\nAmerica funds most of Zimbabwes fight against sexually transmitted diseases and HIV, with PEPFAR financing most condoms and antiretroviral drugs (ARVs) distributed by local hospitals.\n\nOver half a million people affected by the recent El Nino induced drought have also benefited from its funding.\n\nAdded the statement: More than 500,000 Zimbabweans have benefited from U.S. humanitarian assistance during the El Nino-induced drought.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/15215508/Tremont-Photo-scaled.jpg",
            "description": "<p>By Leopold Munhende The US Embassy has announced that it is currently reviewing all funds released to Zimbabwe through its State Department and USAID, as new President Donald Trump’s America First policy takes effect. On inauguration, Trump announced a raft of changes to America’s funding model that emphasised “reasonable use of taxpayer’s money” and focus</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-reviewing-its-funding-in-zimbabwe-in-line-with-trumps-america-first-policy/\">US reviewing its funding in Zimbabwe in line with Trump’s America First policy</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Kendrick Lamar’s Super Bowl Halftime Show: Will he include ‘Not Like Us’?",
            "url": "https://www.newzimbabwe.com/kendrick-lamars-super-bowl-halftime-show-will-he-include-not-like-us/",
            "content": "IOL\n\nMulti-award-winning rapper Kendrick Lamarwill perform at the Apple Music Super Bowl LIX Halftime Show this Sunday. All eyes will be on Lamar at the New Orleans Caesars Superdome for his performance, which is expected to be mindblowing.\n\nRihanna, Usher, and Beyonce have previously performed at the Super Bowl. In past performances, it is a medley of their top charting songs throughout their careers that make up the 12-13 minute performance.\n\nWith a discography featuring top-charting bangers that have made him a global superstar, curiosity is piqued about whether his set list will include hisGrammy-award-winning song Not Like Us.\n\nWith an ongoing defamation case, it does raise the question of whether Lamar will leave Not Like Us out of his performance.\n\nThe song, a Drake diss track, made history by winning Record of the Year, Best Music Video, Best Rap Song, and Best Rap Performance at the 67th Annual Grammy Awards, held on February 2.\n\nNot Like Us despite its huge success with 1 975 828 412 streams on Spotify and 220,872,679 views on YouTube, makes pedophile claims towards Drake and his team.\n\nSay, Drake, I hear you like em young / You better not ever go to cell block one / To any b***h that talk to him and they in love / Just make sure you hide your lil sister from him.\n\nThey tell me Chubbs the only one that gets your hand-me-downs / And party at the party, playin with his nose now / And Baka got a weird case, why is he around? / Certified Lover Boy? Certified pedophiles.\n\nIn January,Drake filed a lawsuit against Universal Music Group(UMG), accusing the label of defamation and harassment over Lamars incendiary diss track, Not Like Us, which dropped last year.\n\nIn legal papers filed in New York, Drakes lawyers stated that UMG orchestrated a campaign to create a viral hit with Not Like Us, exploiting the controversy to boost streams at Drakes expense.\n\nUMG fired back, calling the claims offensive and untrue. It argued that the idea of them undermining one of their biggest stars is illogical, and accused Drake of trying to stifle Lamars creative freedom through legal means.\n\nFans will only know on Sunday, if Not Like Us will have made the cut or not, but what is known is that SZA will be joining Lamar for the Halftime show.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05151605/Kendrick-Lamar-is-set-to-perform-at-the-Super-Bowl-Halftime-Show-at-the-New-Orleans-Caesars-Superdome-on-February-9-Picture-Instagram-kendricklamar.webp",
            "description": "<p>IOL Multi-award-winning rapper Kendrick Lamar will perform at the Apple Music Super Bowl LIX Halftime Show this Sunday. All eyes will be on Lamar at the New Orleans Caesars Superdome for his performance, which is expected to be mindblowing. Rihanna, Usher, and Beyonce have previously performed at the Super Bowl. In past performances, it is a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/kendrick-lamars-super-bowl-halftime-show-will-he-include-not-like-us/\">Kendrick Lamar’s Super Bowl Halftime Show: Will he include ‘Not Like Us’?</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mambos wades into Zanu PF factional wars",
            "url": "https://www.newzimbabwe.com/mambos-wades-into-zanu-pf-factional-wars/",
            "content": "By Staff Reporter\n\nMAMBOS Chicken, one of Zimbabwes fast food outlets has waded into Zanu PF factional wars in its latest satirical post.\n\nIt is known for its catchy and controversial graphic advertisements inspired by daily life.\n\nGeza mawoko tidye, reads one of its latest posts.\n\nThe post is in reference to Blessed Geza, a Zanu PF central committee member calling for President Emmerson Mnangagwas immediate resignation.\n\nGeza, has been fronting one faction within Zanu PF that is against Mnangagwas bid to extend his second term to 2030.\n\nHe argues the ruling party supremo has failed, blames him for tolerating corruption the same way late President Robert Mugabe did and accuses him of nepotism.\n\nMambos makuda kutushurana nema Zanu PF. Remember vakatogumbuka ka avo, said Tembani Mudavanhu on Mambos post.\n\nZimbabwe, Zanu PF and indeed Mambos focus is now on whether Zimbabweans will allow the Mnangagwa faction to force its way to 2030.\n\nAlready his cronies have misrepresented that this could be done without going for a referendum while Geza is now being targeted for arrest and expulsion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05142250/WhatsApp-Image-2025-02-05-at-06.07.58-e1738765409481.jpeg",
            "description": "<p>By Staff Reporter MAMBO’S Chicken, one of Zimbabwe’s fast food outlets has waded into Zanu PF factional wars in its latest satirical post. It is known for its catchy and controversial graphic advertisements inspired by daily life. “Geza mawoko tidye,” reads one of its latest posts. The post is in reference to Blessed Geza, a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mambos-wades-into-zanu-pf-factional-wars/\">Mambos wades into Zanu PF factional wars</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "After two decades, Sean Williams keeps on running for Zimbabwe",
            "url": "https://www.newzimbabwe.com/after-two-decades-sean-williams-keeps-on-running-for-zimbabwe/",
            "content": "Reuters\n\nAt an age when most test cricketers have retired and only an elite few can maintain their excellence, 38-year-old Sean Williams is bucking the trend and soaring to new heights on the cusp of his 20th anniversary representing Zimbabwe.\n\nUpon the retirement of 21-year stalwart Jimmy Anderson last year, Bulawayo-born Williams became world crickets longest-tenured player and his game has only improved with time.\n\nAs his sides premier contemporary batsman, over 17 tests and 162 one-day internationals Williams has averaged 45 and 38 respectively. Since 2020, those numbers skyrocket to 81 and 51  and while captaining, 96 and 73.\n\nIve found that my scoring shot decisions have become way more selective and the percentages have become a lot higher towards me than towards the bowler, the left-hander told Reuters ahead of his Feb. 25 milestone. I just became a little bit calmer as a batsman.\n\nPromoted to the national team in 2005 after a politically-driven player exodus, facing a merciless South Africa was an eye-opening initiation for the then 18-year-old.\n\nWe were obviously young, we had no idea. We were just trying to survive 50 overs, he reflected, noting that coaches of that era tried hard but could not overhaul a negative culture.\n\nThere was fear instilled elsewhere with the board. It just wasnt good and it wasnt nice cricket. There was no plan.\n\nA two-day Cape Town massacre followed, and despite missing test selection Williams still finds humour in a 12th-man memory of teammate Brendan Taylor accidentally knocking himself out after making a low score.\n\nHe had his helmet on, but he smashed his head with the bat and then I got a fright, Williams said. I saw him go dizzy, hit the wall and then slide down the wall and lie down on the floor.\n\nAs a hopelessly-outgunned Zimbabwe retreated from the test arena, it would be eight more years before Williams made his red-ball debut.\n\nWERE GOING TO GET FIRED\n\nThe father-of-two says a positive game plan which reflects modern scoring trends has been welcomed by the playing group over the last decade, as has an off-field culture shift.\n\nAfter a string of disastrous results against Afghanistan last December, Zimbabwe Cricket managing director Givemore Makoni summoned the senior players to his office.\n\nI thought, jeez, were going to get fired here, but he actually had a meeting of support, Williams said.\n\nThats quite a sensitive thing. I mean, its something that people wouldnt know about the board, supporting a player or supporting the seniors.\n\nHes helped me a lot throughout a lot of troubled times, added Williams, who clubbed a career-best 154 in the next test.\n\nZimbabwes next challenge comes against Ireland, who tour the African nation for three T20s, three ODIs and one test starting Feb. 6.\n\nWilliams earmarked 21-year-old Brian Bennett, who collected a century and a five-wicket haul in last years Boxing Day test against the Afghans, as his teams most exciting prospect, alongside uncapped batsman Matthew Welch and paceman Takudzwa Chataira.\n\nAlthough the all-rounder has stepped away from T20 internationals, he hopes to regain fitness for the other legs, even if it means recusing himself from spin-bowling duties, having recently battled nerve pain stemming from a back injury.\n\nThere is no end in sight for the Matabeleland product, however, as he highlights the 2027 ODI World Cup, which his country will co-host with South Africa and Namibia, as the focal point on Zimbabwes calendar.\n\nI will be pushing it quite a bit then, but theyre managing us now so thats a really amazing thing, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/26152556/thumbnail_Sean-Williams.jpeg",
            "description": "<p>Reuters At an age when most test cricketers have retired and only an elite few can maintain their excellence, 38-year-old Sean Williams is bucking the trend and soaring to new heights on the cusp of his 20th anniversary representing Zimbabwe. Upon the retirement of 21-year stalwart Jimmy Anderson last year, Bulawayo-born Williams became world cricket’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/after-two-decades-sean-williams-keeps-on-running-for-zimbabwe/\">After two decades, Sean Williams keeps on running for Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mayor Mafume lies under oath, gives Harare Commission of Inquiry vehicle auction site as his place of residence – claims it was an error",
            "url": "https://www.newzimbabwe.com/mayor-mafume-lies-under-oath-gives-harare-commission-of-inquiry-vehicle-auction-site-as-his-place-of-residence-claims-it-was-an-error/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume turned himself into an embarrassment Wednesday after leading the Commission of Inquiry to the wrong residence where he purportedto be living.\n\nMafume had earlier told the Commission of Inquiry, which is investigating the operations of the Harare City Council, that he is temporarily residing at 110 CoronationRoad in Greendale.\n\nMafume told the retired Justice Cheda led Commission that he is living at the residence temporarily as his house in Belvedere is being renovated.\n\nHowever, when the Commission, accompanied by Mafume, visited the address they discovered anundeveloped property belonging to one Peter Pfukwa. The site is being used as a vehicle auction site.\n\nThis is an undeveloped stand. The only immovable structurewhich is embedded in the soil is an office structure. Certainly is not the residence, said Cheda.\n\nBREAKING: Harare Mayor Jacob Mafume led the Commission of Inquiry to an undeveloped stand he purports as his residence. He lied under oath. The stand belongs to one Mr Pfukwa.\n\nThe stand number is 110 Corronation-Greendale, Harare.\n\nFollowhttps://t.co/iVVKatQx0sWhatsApp Channelpic.twitter.com/OrQwLg9nTl\n\n NewZimbabwe.com (@NewZimbabweCom)February 5, 2025\n\nMafume is currently giving evidence before the Commission of Inquiry, with his tenure as Harare Mayor under scrutiny.\n\nThe Harare City Council is plagued by allegations of corruption, and incompetence which have negatively impacted service delivery.\n\nAcknowledging that he had misled the Commission Mafume said he had made an error in providing the wrong address despite earlier insistence that it was the correct one.\n\nI did give the address as 110. It was my error. I stay in this same street on 102, I would want to invite the Commission to pass by my house, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05134926/mafume-cheda.jpeg",
            "description": "<p>By Darlington Gatsi HARARE Mayor Jacob Mafume turned himself into an embarrassment  Wednesday after leading the Commission of Inquiry to the wrong residence where he purported to be living. Mafume had earlier told the Commission of Inquiry, which is investigating the operations of the Harare City Council, that he is temporarily residing at 110 Coronation Road in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mayor-mafume-lies-under-oath-gives-harare-commission-of-inquiry-vehicle-auction-site-as-his-place-of-residence-claims-it-was-an-error/\">Mayor Mafume lies under oath, gives Harare Commission of Inquiry vehicle auction site as his place of residence – claims it was an error</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Zanu PF to take disciplinary action against Geza for anti-ED2030 rants",
            "url": "https://www.newzimbabwe.com/zanu-pf-to-take-disciplinary-action-against-geza-for-anti-ed2030-rants/",
            "content": "By Staff Reporter\n\nTHE ruling Zanu PF party says it is seized with processes to bring war veteran Blessed Runesu Geza tobook for disparaging efforts to extend President Emmerson Mnangagwas rule beyond 2028.\n\nIn a statement this Wednesday, party spokesperson, Christopher Mutsvangwa said utterances by Geza, who recently held a press conference at which he attacked Mnangagwa, were rogue, outlandish, treasonable and egregious.\n\nThe outlandish, treasonable and egregious rantings of errant Runesu Geza offended the hallowed tenets of party discipline for a member of the Central Committee, said Mutsvangwa.\n\nGeza was flanked by five other war veterans during the widely published presser that has rattled the former revolutionary party to the core. He described Mnangagwa as a failed leader who must step down immediately or face unspecified consequences.\n\nThey also involved reckless attempts to usurp the credentials of war veterans entities in good standing with Zanu PF, the party of the permanent Zimbabwe revolution.\n\nThe relevant party organ of organisation and discipline are currently seized with this contravention as it is holistically and expeditiously handled and disposed of it, Mutswangwa added.\n\nThe former presidential adviser said Zanu PF is still pushing ahead with implementing Resolution #1 passed at last years National Peoples Conference for Mnangagwa to remain in office beyond his constitutionally permissible two terms.\n\nThe Department of Information assures the party membership of absolute loyalty of the rank and file supporters to President Mnangagwa and that they retain full confidence of the full and legal implementation of Resolution #1 of the October 2024 Bulawayo Conference under the aegis of the 2013 Constitution of Zimbabwe, Mutsvangwa said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>By Staff Reporter THE ruling Zanu PF party says it is seized with processes to bring war veteran Blessed Runesu Geza to book for disparaging efforts to extend President Emmerson Mnangagwa’s rule beyond 2028. In a statement this Wednesday, party spokesperson, Christopher Mutsvangwa said utterances by Geza, who recently held a press conference at which he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-to-take-disciplinary-action-against-geza-for-anti-ed2030-rants/\">Zanu PF to take disciplinary action against Geza for anti-ED2030 rants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "USAID staff will be put on leave starting on Friday",
            "url": "https://www.newzimbabwe.com/usaid-staff-will-be-put-on-leave-starting-on-friday/",
            "content": "BBC\n\nThousands of employees at the United States Agency for International Development (USAID) will be placed on leave from Friday night, the agency has said in a statement on its website.\n\nIn the announcement, USAID said all direct-hire personnel will be placed on leave at the end of this week except those on mission-critical functions, core leadership and specially designated programs.\n\nThe move is the latest in a string of cuts President Donald Trump has made to government-funded programs since returning to office last month.\n\nMany have argued the choice to shut it down could have a profound impact on humanitarian programmes around the world.\n\nUSAID said it would work with the State Department to arrange and pay for return travel for its many personnel posted outside the US within the month.\n\nThose employees who are part of the exceptions will be told by 15:00 EDT (20:00 GMT) on Thursday.\n\nAstatementposted on USAIDs website concludes with the message: Thank you for your service.\n\nThe agency, which provides humanitarian aid to more than 100 countries, employees 10,000 people worldwide and two-thirds of those people work overseas, according to the Congressional Research Service.\n\nOn Tuesday, many USAID staffers received an email notifying them they had been placed on paid administrative leave.\n\nThe email, obtained by BBC News, told employees they must remain available by telephone and email during business hours but are not allowed to enter USAID buildings.\n\nSince returning to the White House last month, Trump and his allies have prioritised slashing government funding.\n\nAs part of that move,the Trump administration turned its focus on USAID.\n\nEarlier this week, Secretary of State Marco Rubio became the acting head of USAID, merging one government agency into another.\n\nElon Musk, the billionaire Tesla CEO who was appointed to run a new agency to identify spending cuts in the US government, has said USAID should be shut down as it is beyond repair.\n\nMany have cautioned that closing USAIDs doors would have devastating effects on vulnerable populations across the world.\n\nUSAIDs activities range from providing prosthetic limbs to soldiers injured in Ukraine, to clearing landmines and containing the spread of Ebola in Africa.\n\nDemocrats in Washington DC have been particularly critical of the move.\n\n[USAID is] a foreign policy tool with bipartisan origins that is critical in this dangerous global environment, New Jersey Senator Andy Kim wrote on social media. Gutting it means gutting our ability to compete and keep America safe.\n\nThe agency, founded in 1961, has bases in 60 countries and works in dozens of others.\n\nUSAID managed more than $40b (32.25b) in fiscal year 2023, according to the Congressional Research Service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/02060041/USAID.jpg",
            "description": "<p>BBC Thousands of employees at the United States Agency for International Development (USAID) will be placed on leave from Friday night, the agency has said in a statement on its website. In the announcement, USAID said all “direct-hire personnel” will be placed on leave at the end of this week except those on “mission-critical functions,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/usaid-staff-will-be-put-on-leave-starting-on-friday/\">USAID staff will be put on leave starting on Friday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Soccer legend Moses Chunga appointed Chegutu Pirates coach",
            "url": "https://www.newzimbabwe.com/soccer-legend-moses-chunga-appointed-chegutu-pirates-coach/",
            "content": "By Sport Reporter\n\nFormer Premier Soccer League side Chegutu Pirates have appointedMoses Chunga as head coach.\n\nZaire will be hoping to make an immediate top-flight league return after being relegated during the 2024 season.\n\nChunga is set to lead Chegutu Pirates in the Northern Region Division One League where title winners will grab the promotion ticket.\n\nChegutu Pirates FC is thrilled to announce the appointment of Moses Chunga as the teams head coach for the 2025 season.\n\nThe club warmly welcomes Chunga and is confident that his leadership will drive the team to new heights.\n\nThe club and its fans are eagerly anticipating the positive impactChunga will have on the squad, read part of Chegutu Pirates statement.\n\nWith his extensive experience and dedication, the future looks bright for Chegutu Pirates.\n\nChunga has a rich coaching history which sawhim leading several local football teams, amongst those Dynamos and CAPS United.\n\nIn 2009, the Warriors legend won the league title with the Gunners as head coach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05052236/FB_IMG_1738688621298.jpg",
            "description": "<p>By Sport Reporter Former Premier Soccer League side Chegutu Pirates have appointed Moses Chunga as head coach. Zaire will be hoping to make an immediate top-flight league return after being relegated during the 2024 season. Chunga is set to lead Chegutu Pirates in the Northern Region Division One League where title winners will grab the promotion</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/soccer-legend-moses-chunga-appointed-chegutu-pirates-coach/\">Soccer legend Moses Chunga appointed Chegutu Pirates coach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Mighty Warriors to receive daily allowances from ZIFA while in camp",
            "url": "https://www.newzimbabwe.com/mighty-warriors-to-receive-daily-allowances-from-zifa-while-in-camp/",
            "content": "By Sport Reporter\n\nZimbabwe senior womens football team started their first training session on Tuesday morning with smiles on theirfaces after being assured of daily allowances in camp.\n\nThe Mighty Warriors will be enjoying the same privilege which was only reserved for the Warriors in previous years.\n\nThe new development was revealed ahead of the teams morning training session on Tuesday which saw the new ZIFA president Nqobile Magwizi together with board member Kudzai Kadzombe visiting for an assessment.\n\nAddressing the players, the new ZIFA board promised to push for equality during their era.\n\nNew ZIFA president Nqobile Magwizi and board member Kudzai Kadzombe addressing players\n\nWe are hopeful that you will take Zimbabwe to greater heights through your talents.\n\nYou have our full and undivided support as you go for this campaign.\n\nYou will no longer be treated as second-class citizens as before, said Kadzombe.\n\nAccording to sources, Mighty Warriors wrote to the new board requesting several things including the allowances.\n\nZimbabwe will camp for two weeks before they leave for Angola for a Womens AFCON Qualifiers match against the host in Luanda on February 22.\n\nThis will be followed up by a return fixture scheduled for February 26 at Lucas Moripe Stadium in South Africa.\n\nGender equality has been an issue at ZIFA, in previous years Mighty Warriors used to struggle for accommodation during their days in camp while the Warriors were being booked in five-star hotels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/05051611/mighty-warriora.jpeg",
            "description": "<p>By Sport Reporter Zimbabwe senior women’s football team started their first training session on Tuesday morning with smiles on their faces after being assured of daily allowances in camp. The Mighty Warriors will be enjoying the same privilege which was only reserved for the Warriors in previous years. The new development was revealed ahead of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-to-receive-daily-allowances-from-zifa-while-in-camp/\">Mighty Warriors to receive daily allowances from ZIFA while in camp</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        },
        {
            "title": "Simba Bhora coach impressed by team’s performance",
            "url": "https://www.newzimbabwe.com/simba-bhora-coach-impressed-by-teams-performance/",
            "content": "By Sport Reporter\n\nSimba Bhora coach Joel Lupahla is impressed with his teams performance in South Africa, where they are going through their pre-season training camp.\n\nThe reigning league champions will stay in South Africa for two weeks and have already kicked off five days.\n\nWith a lot of battle fronts awaiting them this season, the club opted to do a pre-season camp in a foreign land to give the squad exposure ahead of their inaugural dance in the CAF Champions League later this year.\n\nIn South Africa, Simba is testing its strength by playing several South African clubs, and coach Lupahla has praised his charges for a good show.\n\nWe have only played one game versus Baroka, the South Africans are miles ahead in terms of technique but I am proud of the boys because we fought hard.\n\nWe gave them a good run and I as the coach was also impressed especially with their ball artistry they did well we dominated play and scored a beautiful team goal and those are signs of great things to come, said Lupahla.\n\nThe Shamva-based side is currently going through a rebuilding process after a mass exodus, which saw them losing 13 players.\n\nOther than losing players, the team also parted ways with title-winning coach Tonderai Ndiraya, who was since replaced by Lupahla.\n\nSharing his assessment of the rebuilding process, Lupahla said everything is shaping up.\n\nThe pre-season so far has been great we thank our management for sacrificing hard-earned money to bring us here but it wont be in vain as this has made us gel within a short space of time.\n\nRemember we brought in a lot of players and that is unheard of in a soccer setup but we had to plug in the gap.\n\nIt needed that players gel in and in Harare it was going to be hard as players just come to train and go back home but here we have managed to stay together and share rooms with different players and that alone brings together the unity we want, added Lupahla.\n\nSimba Bhora is set to play Dynamos on the 22nd of February in a Castle Challenge Cup match scheduled to be played at Rufaro.\n\nServing as a curtain raiser to the 2025 league season, the traditional fixture is played by defending league champions and Chibuku Super Cup title holders.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/25165900/Joel-Luphahla.jpg",
            "description": "<p>By Sport Reporter Simba Bhora coach Joel Lupahla is impressed with his team’s performance in South Africa, where they are going through their pre-season training camp. The reigning league champions will stay in South Africa for two weeks and have already kicked off five days. With a lot of battle fronts awaiting them this season,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simba-bhora-coach-impressed-by-teams-performance/\">Simba Bhora coach impressed by team’s performance</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:26",
            "date": "05 Feb 2025"
        }
    ]
}