{
    "news": [
        {
            "title": "Ramaphosa appoints Gwede Mantashe as acting police minister",
            "url": "https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/",
            "content": "In a decisive move to address escalating concerns within South Africas police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening,Cape {town} Etcreports.\n\nThis temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast a shadow over the law enforcement agency.\n\nMantashes role will be short-lived as he is slated to hold the position until Professor Firoz Cachalia steps into the role at the beginning of August.\n\nCachalia, who has spent most of his career in academia, is poised to take the reins following his retirement from the University of the Witwatersrand at the end of this month.\n\nHis appointment was previously announced by Ramaphosa during a televised address on Sunday.\n\nThe political landscape is particularly volatile at present, with serious allegations surfacing against former Police Minister Senzo Mchunu. In a stark revelation, KwaZulu-Natal Provincial Police Commissioner, Lieutenant General Nhlanhla Mkhwanazi, claimed a powerful criminal syndicate has infiltrated South Africas law enforcement and judicial systems.\n\nMkhwanazi went one step further, accusing Mchunu of meddling in sensitive cases and colluding with a businessman accused of murder, aiming to dismantle the task force investigating a spate of political killings in KwaZulu-Natal.\n\nIn light of these explosive allegations, President Ramaphosa has taken decisive action, placing Mchunu on special leave while also initiating a judicial commission of inquiry to be led by Acting Deputy Chief Justice Mbuyiseli Madlanga.\n\nThe commission is tasked with investigating claims of interference in investigations, complicity among government officials, and the suppression of crucial law enforcement activities.\n\nMchunu, embroiled in controversy over the past week, has been accused by Mkhwanazi of being entwined with drug cartels and influential business concerns.\n\nAmong the allegations presented was an assertion that Lieutenant-General Shadrack Sibiya, deputy national commissioner for crime detection, colluded with Mchunu and a known information dealer, Brown Mogotsi, in a plot to disband the KwaZulu-Natal political killings task team.\n\nPolice Commissioner Masemola announced that Sibiya would also be requesting a leave of absence while investigations unfold, indicating a stern approach to restoring integrity within the police service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/12/03003040/Gwede-Mantashe.png",
            "description": "<p>Cape ETC In a decisive move to address escalating concerns within South Africa’s police ministry, President Cyril Ramaphosa has appointed Mineral and Petroleum Resources Minister Gwede Mantashe as the acting Minister of Police, effective immediately as of Tuesday evening, Cape {town} Etc reports. This temporary appointment comes as allegations of misconduct and malfeasance involving high-ranking officials cast</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ramaphosa-appoints-gwede-mantashe-as-acting-police-minister/\">Ramaphosa appoints Gwede Mantashe as acting police minister</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zim referee Brighton Chimene to officiate at CHAN",
            "url": "https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/",
            "content": "By Sports Reporter\n\nZimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month.\n\nThe tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August.\n\nChimene is one of the 75 selected referees to serve at the tournament.\n\nCHAN call-up marks Chimenes second major tournament this year, the first one being the AFCON boys under 17 three months ago.\n\nAged 35, Chimene was elevated to be an Elite B class on the FIFA panel early this year, making himself eligible for major CAF tournaments.\n\nThe four-time Zimbabwe Premier Soccer League Referee of the Year is now one level lower to officiate at the FIFA World Cup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/16052432/Brighton-Chimenes.jpg",
            "description": "<p>By Sports Reporter Zimbabwe top referee, Brighton Chimene, has been selected as one of the match officials at the 2024 CHAN tournament, scheduled to be played next month. The tournament will be co-hosted by Kenya, Tanzania and Uganda and will run from the 2nd to the 30th of August. Chimene is one of the 75</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zim-referee-brighton-chimene-to-officiate-at-chan/\">Zim referee Brighton Chimene to officiate at CHAN</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "16 Jul 2025"
        },
        {
            "title": "Zimbabwe ranks among the world’s 10 most difficult places to live",
            "url": "https://www.newzimbabwe.com/zimbabwe-ranks-among-the-worlds-10-most-difficult-places-to-live/",
            "content": "Business Insider Africa\n\nZimbabwe and Nigeria have been ranked among the worlds 10 most difficult places to live, according to a new global livability index that highlights the harsh realities of urban life in some of the worlds most challenged cities.\n\nThe annual report, compiled by the Economist Intelligence Unit (EIU), measures cities based on stability, healthcare, education, infrastructure, and environment, key indicators that affectoverall quality of life.\n\nThe Global Livability Index evaluates cities based on over 30 indicators across five core categories: stability, healthcare, culture and environment, education, and infrastructure. Stability measures crime levels, civil unrest, and the threat of conflict.\n\nHealthcare assesses the quality and availability of public and private services. Culture and environment consider factors like climate, recreational options, and personal freedoms.\n\nEducation is judged by access to quality public and private schooling, while infrastructure focuses on roads, transport, housing, and global connectivity. These combined metrics provide a snapshot of how liveable a city is for its residents.\n\nMost African nations are grappling with persistent economic pressures, insecurity, and strained public services.\n\nIn many of these cities, ongoing political unrest, insecurity, limited access to quality healthcare, and under-resourced education systems contribute topoor livability scores.\n\nIn Nigeria, cities like Lagos and Port Harcourt continue to suffer from overcrowding, inadequate healthcare systems, and rising crime rates, while Zimbabwes capital, Harare, remains burdened by hyperinflation, aging infrastructure, and limited access to essential services.\n\nAlgeria and Libya have also been named among the worldsmost difficult placesto live, joining Nigeria and Zimbabwe in a ranking that highlights the pressures facing several African cities.\n\nFor example, Tripoli in Libya continues to struggle with the effects of prolonged conflict and weakened institutions, while Algiers faces structural economic challenges and restrictions on civil liberties.\n\nThese issues are compounded byinadequate infrastructureand housing conditions that fall short of global standards.\n\nThe table below presents the ten most challenging cities to live in globally.\n\nCities at the bottom of the liveability rankings are predominantly located in the Middle East and Africa, reflecting persistent instability, limited infrastructure, and constrained access to quality services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/17050648/harare.webp",
            "description": "<p>Business Insider Africa Zimbabwe and Nigeria have been ranked among the world’s 10 most difficult places to live, according to a new global livability index that highlights the harsh realities of urban life in some of the world’s most challenged cities. Zimbabwe and Nigeria rank among the world’s most difficult places to live, according to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-ranks-among-the-worlds-10-most-difficult-places-to-live/\">Zimbabwe ranks among the world’s 10 most difficult places to live</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "16 Jul 2025"
        },
        {
            "title": "Namib minerals to invest $400m in Zimbabwe gold mines",
            "url": "https://www.newzimbabwe.com/namib-minerals-to-invest-400m-in-zimbabwe-gold-mines/",
            "content": "Bloomberg\n\nNamib Minerals plans to invest as much as $400 million in reviving two gold mining ventures in Zimbabwe over the next five years.\n\nThe company is restarting the Redwing and Mazowe mines, which jointly hold 3.7 million ounces of gold, Namib Minerals Chief Executive Officer Ibrahima Sory Tall said Tuesday in an emailed statement. The two mines were under care and maintenance between 2019 and 2020.\n\nNamib Minerals, which started trading on the Nasdaq last month, already operates the How Mine near Zimbabwes second-biggest city of Bulawayo.\n\nThe miner expects to reopen Mazowe first, as the high-grade deposit  averaging 8 grams per ton  has lower capital requirements. The larger Redwing mine requires more investment, it said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/07203627/Gold.jpg",
            "description": "<p>Bloomberg Namib Minerals plans to invest as much as $400 million in reviving two gold mining ventures in Zimbabwe over the next five years. The company is restarting the Redwing and Mazowe mines, which jointly hold 3.7 million ounces of gold, Namib Minerals Chief Executive Officer Ibrahima Sory Tall said Tuesday in an emailed statement.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/namib-minerals-to-invest-400m-in-zimbabwe-gold-mines/\">Namib minerals to invest $400m in Zimbabwe gold mines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:34",
            "date": "16 Jul 2025"
        }
    ]
}