{
    "news": [
        {
            "title": "New report finds that Southern Africa has become a hub for organised crime",
            "url": "https://www.newzimbabwe.com/new-report-finds-that-southern-africa-has-become-a-hub-for-organised-crime/",
            "content": "IOL\n\nEast and Southern Africa is regarded as a central component for organised crime, which connects regional criminal markets to global networks.\n\nThis was revealed in the Global Initiative report, which stated that the region serves as a thriving source, hub and conduit for a wide variety of illegal commodities.\n\nThese criminal syndicates operate from the shores of Somalia to border crossings and international air and sea points in Ethiopia, Kenya, Tanzania, Mozambique, Zimbabwe, South Africa and Namibia.\n\nFor example, heroin trafficked from Afghanistan via Pakistan and Iran, is shipped across the Arabian Sea and Indian Ocean by boat before it is deposited in the northern Mozambique and Tanzania.\n\nThere, according to the report titled Mapping Organised Criminal Economies in East and Southern Africa, it splits into two primary supply lines: One of higher purity bound for international markets in Europe and Australia, and another that is significantly adulterated and consumed in towns and villages across the East and Southern Africa.\n\nAccording to the report, rhino is smuggled from Johannesburg and Addis Ababa, routed through Dubai and Doha and sometimes Paris and London to throw off law enforcement.\n\nIvory departs in shipping containers from ports in Der es Salaam, Nampula and Durban, ending up in Singapore, Sihanoukville, Huangpu and Haiphong.\n\nGold is mined illegally in Zimbabwes mineral-rich Kwekwe gold fields and deep shaft mines in the towns of Krugersdorp, Carletonville, Klerksdorp and Welkom in South Africa. It is processed and eventually laundered through Dubai.\n\nThe report added that gold is also smuggled by the tonne into countries along the strife-torn Democratic Republic of Congo (DRC)s eastern border and laundered through Rwanda, Burundi, Uganda, Tanzania and the United Arab Emirates (UAE).\n\nIn the northern Mozambique and KwaZulu-Natal province, Islamic State-aligned insurgents and supporters have been implicated in criminal economies, gold smuggling, and kidnapping and extortion schemes to raise funds.\n\nThe region has attracted a coterie of international criminal players, according to the report.\n\nFor instance, networks from China, Pakistan and Iran are known to interface with African intermediaries for drug trafficking (drug precursor chemicals, methamphetamine and heroin) and wildlife smuggling (notably of abalone and ivory). In Southern Africa, Nigerian and Congolese syndicates, often operating from hubs such as Johannesburg, coordinate regional drug distribution and financial fraud schemes while also connecting to global diaspora networks.\n\nThe report added that this chaotic mixture of different criminal commodities and networks is, in many ways, shaped by geography and coalesces around a spiders web of regional hubs and economic centres.\n\nEnvironmental, social and regional dynamics in hinterlands allow warlords and smugglers to thrive, while bustling trade hubs provide cover for clandestine flows and access to key transport links.\n\nIn urban slums, neglected towns and remote rural communities, criminal actors and parallel illicit economies rapidly fill the void left by an often absent state. Ancient trade and migratory routes over mountains and along rivers and coastlines that long pre-date colonial borders allow for the largely untrammelled movement of people and goods, both licit and illicit. This means many of these trafficking networks and criminal groups are found concentrated in certain illicit hubs, reads the report.\n\nCrime expert at the Institute for Security Studies (ISS), Willem Els, added that poor governance is one of the reasons behind the challenges in the region andallows the situation to get out of control.\n\nIf you look at criminality levels, you will see that South Africa is number one in the region and number three in the continent. It is also number seven in the world. That means we created an environment that is conducive for organised crime to thrive. And one of the main factors is the State-embedded actors because none of these criminal syndicates can effectively survive without the protection of politicians and without the compromising of senior officials, Els said.\n\nHe said South Africa is rapidly approaching a failed State scenario where the rule of law is completely crumbled.\n\nSouth Africa is also suffering because of corruption, infrastructure, weak border controls and financial systems, and criminals are exploiting that, he said.\n\nThe report added that the Gauteng province is arguably the most significant organised crime hub in Southern Africa.\n\nAs the regions economic heart, with excellent transport links (notably airports and highways) and financial infrastructure, Johannesburg attracts many criminal enterprises. It is a crucial distribution centre for drugs (heroin arriving from East Africa and cocaine direct from Latin America or via West Africa) destined for local consumption or re-export.\n\nSouth African law enforcement notes that domestic and foreign drug trafficking syndicates converge in Johannesburg  for instance, Nigerian networks base themselves there to manage Southern African operations and South Asian cartel operatives have been detected collaborating with local crime bosses.\n\nJohannesburg is also a central hub for human smuggling and trafficking rings: victims from poorer African countries (including Malawi, Mozambique and Lesotho) are brought to the citys informal brothels and labour markets, while the citys international airport serves as a transit point for traffickers moving people to Europe or the Middle East.\n\nCape Town, according to the report, is a hub for the narcotics trade, a market associated with gang activity, while Northern KwaZulu-Natal is a strategic location.\n\nWeak border controls and existing criminal networks make it a prime hub for various forms of organised crime.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01084108/organised-crime.png",
            "description": "<p>IOL East and Southern Africa is regarded as a central component for organised crime, which connects regional criminal markets to global networks. This was revealed in the Global Initiative report, which stated that the region serves as a thriving source, hub and conduit for a wide variety of illegal commodities. These criminal syndicates operate from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-report-finds-that-southern-africa-has-become-a-hub-for-organised-crime/\">New report finds that Southern Africa has become a hub for organised crime</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        },
        {
            "title": "Foreign national arrested for stealing US$16,000 from motor vehicle",
            "url": "https://www.newzimbabwe.com/foreign-national-arrested-for-stealing-us16000-from-motor-vehicle/",
            "content": "By Staff Reporter\n\nDETECTIVES in Harare have arrested a foreign national for allegedly stealing US$16,000 from a parked motor vehicle while the owner was shopping.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.On August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.The suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nZimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident.\n\nOn August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.The suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nOn August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a foreign national, in connection with a case of theft from a motor vehicle which occurred at Greenfield Shopping Centre in Harare on May 14, 2025, said Nyathi.\n\nThe suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.The detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nThe suspect allegedly stole US$16 000 cash from the complainants Toyota Hilux vehicle after the complainant had parked his car at the shopping centre.\n\nThe detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\nThe detectives searched the suspect and recovered a destabilizer remote control and three car keys, including one for a Honda Accent vehicle. More details to be availed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/13180829/Crime.jpg",
            "description": "<p>By Staff Reporter  DETECTIVES in Harare have arrested a foreign national for allegedly stealing US$16,000 from a parked motor vehicle while the owner was shopping. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “On August 30, 2025, detectives from Harare acted on a tip and arrested Lama Gabriel Gabi (40), a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/foreign-national-arrested-for-stealing-us16000-from-motor-vehicle/\">Foreign national arrested for stealing US$16,000 from motor vehicle </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        },
        {
            "title": "Globe-trotting Mnangagwa to attend Chinese war commemorations",
            "url": "https://www.newzimbabwe.com/globe-trotting-mnangagwa-to-attend-chinese-war-commemorations/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa is expected to arrive in China this Monday to attend commemorations to mark the 80th Anniversary of the Victory in the Chinese Peoples War of Resistance Against Japanese Aggression and World Anti-Fascist War set for Wednesday.\n\nChina is Mnangagwas latest foreign destination to cap the month of August that saw the Zanu PF leader clocking hours on end while airborne.\n\nOn August 20, Mnangagwa travelled to Tokyo, Japan, where he met with Japanese Prime Minister Shigeru Ishiba on the sidelines of TICAD 9. He reportedly discussed strengthening cooperation in trade, health, agriculture, mining, investment, technologyincluding milestones like ZIMSAT1and reaffirmed commitment to deepen ZimbabweJapan relations.\n\nOnly last week, the 82-year-old Zanu PF leader met with His Holiness Pope Leo XIV at the Vatican, where they reflected on the Catholic churchs vital role in Zimbabwes schools, hospitals, and social services, and shared views on peace and justice in todays world.\n\nBefore the jetleg could subside, Mnangagwa, whose initial days in office were toned around austerity to cut on spending on foreign travel, he was off to the East this Sunday.\n\nAccording to State media, Mnangagwa is expected to join fellow invited Heads of State and Government from 26 countries, including Russian President Vladimir Putin, at Tiananmen Square for a massive military parade among other activities hosted by China for the commemorations.\n\nThe Chinese Peoples War of Resistance Against Japanese Aggression (1931-1945) was the first to break out and lasted the longest in the World Anti-Fascist War.\n\nAccording to reports, in 14 years, 35 million Chinese were killed or wounded. Japan officially surrendered on September 2, 1945 by signing the Instrument of Surrender.\n\nIn 2014, Chinas national legislature designated September 3 as Victory Day of its War of Resistance.\n\nA year later, the country held its first-ever large-scale parade at Tiananmen Square to mark the occasion.\n\nState media quoted Zimbabwes Ambassador to China, Abigail Shoniwa, saying President Mnangagwa, who left the Vatican last night, is one of a few African leaders invited to the event, signalling deep ties between Harare and Beijing.\n\nThe Presidents arrival is awaited and we are very excited, he is coming at the invitation of his counterpart, President Xi Jinping and he will be one of quite a number of Heads of State that are coming.\n\nPerhaps, I can take the opportunity to add that he is one of the very few African Heads of State coming, Shoniwa told State media.\n\nWhile in China, Mnangagwa is billed to hold bilateral talks with President Xi on deepening co-operation across various sectors.\n\nThe octogenarian leader will also dialogue with company executives with business interests in Zimbabwe.\n\nChina has supported Zimbabwes various local projects, including Hwange Units 7 and 8 expansion, Kariba South Hydro Power Extension, expansion of the Robert Gabriel Mugabe and Victoria Falls International Airports.\n\nChina is Zimbabwes largest source of investment with cumulative investments exceeding US$4,4 billion, including US$400 million in the past year alone. In 2024, bilateral trade surged to US$3,8 billion with 24 percent year-on-year growth.\n\nLast month, Mnangagwa presided over the signing ceremony of a US$55 million Economic and Technical Co-operation Agreement between Zimbabwe and China in Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter  PRESIDENT Emmerson Mnangagwa is expected to arrive in China this Monday to attend commemorations to mark the 80th Anniversary of the Victory in the Chinese People’s War of Resistance Against Japanese Aggression and World Anti-Fascist War set for Wednesday. China is Mnangagwa’s latest foreign destination to cap the month of August that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/globe-trotting-mnangagwa-to-attend-chinese-war-commemorations/\">Globe-trotting Mnangagwa to attend Chinese war commemorations </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        },
        {
            "title": "Scottland FC’s Tymon Machope gets late Warriors call-up",
            "url": "https://www.newzimbabwe.com/scottland-fcs-tymon-machope-gets-late-warriors-call-up/",
            "content": "By Sports Reporter\n\nAFTER netting a brace against Dynamos on Saturday, Scottland FC striker Tymon Machope has received a late call-up to feature in the national senior mens national soccer team, the Warriors, ahead of the upcoming World Cup Qualifiers.\n\nMachope, who is enjoying a good run in the league, scored seven goals in the month of August, the highest by any player this season during that period.Saturdays brace saw Machope move to second position on the top goalscorers chart with 12 goals, one behind Tel Ones Washington Navaya, who is the highest.The recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.Zimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nMachope, who is enjoying a good run in the league, scored seven goals in the month of August, the highest by any player this season during that period.\n\nSaturdays brace saw Machope move to second position on the top goalscorers chart with 12 goals, one behind Tel Ones Washington Navaya, who is the highest.The recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.Zimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nSaturdays brace saw Machope move to second position on the top goalscorers chart with 12 goals, one behind Tel Ones Washington Navaya, who is the highest.\n\nThe recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.Zimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nThe recent call-up is the second for Machope, who last year represented the Warriors at COSAFA.\n\nZimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.The Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nZimbabwe is set to play Benin on September 5, 2025, before hosting Rwanda at Orlando Stadium in South Africa four days later.\n\nThe Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.Currently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nThe Warriors hope of qualifying for the World Cup will only be kept alive if they win the two upcoming games against Rwanda and Benin.\n\nCurrently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.South Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nCurrently, Zimbabwe is bottom in Group C with four points, nine behind group leaders South Africa, who are on 13 points.\n\nSouth Africa  13 pointsBenin  8 pointsRwanda  7 pointsNigeria  6 pointsLesotho  5 pointsZimbabwe  4 points.\n\nSouth Africa  13 points\n\nBenin  8 points\n\nRwanda  7 points\n\nNigeria  6 points\n\nLesotho  5 points\n\nZimbabwe  4 points.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01050539/GM9Th8SWAAEn-TI.jpg_large.jpg",
            "description": "<p>By Sports Reporter  AFTER netting a brace against Dynamos on Saturday, Scottland FC striker Tymon Machope has received a late call-up to feature in the national senior men’s national soccer team, the Warriors, ahead of the upcoming World Cup Qualifiers. Machope, who is enjoying a good run in the league, scored seven goals in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scottland-fcs-tymon-machope-gets-late-warriors-call-up/\">Scottland FC’s Tymon Machope gets late Warriors call-up</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        },
        {
            "title": "Zimbabwe business lobby group calls for Argentina-style reforms",
            "url": "https://www.newzimbabwe.com/zimbabwe-business-lobby-group-calls-for-argentina-style-reforms/",
            "content": "Bloomberg\n\nZimbabwes main business lobby group urged the government to implement a raft of measures to reduce firms operating costs, and said Argentinas reform program could serve as a template.\n\nZimbabwe requires bold and accelerated reforms, including systematic deregulation inspired by Argentines President Javier Mileis one deregulation per-day model, the Confederation of Zimbabwe Industries said in a letter to the Industry and Commerce Ministry. Maybe in Zimbabwe, it could be one deregulation measure a week, it said.\n\nDecades of government mismanagement and policy missteps have taken a heavy toll on Zimbabwe  poverty and unemployment are widespread, basic services are lacking or non-existent, and hard currency shortages and runaway inflation are perennial problems. The CZI identified nine areas requiring immediate intervention, including cutting the states debt to the private sector, adjusting a 30% foreign-currency retention threshold for exporters and reducing sugar taxes on beverage makers.\n\nIt also called for a currency policy revamp and for the central bank to formalise and legalise its proclamations on phasing out the use of the dollar, so as to strengthen business and investor confidence. Most transactions in the southern African nation are currently conducted with the greenback, and the authorities aim to end that practice and ensure the bullion-backed Zimbabwe Gold currency is used solely by 2030.\n\nZimbabwes Industry and Commerce Minister Mangaliso Ndlovu didnt immediately respond to a call to his mobile phone seeking comment. Finance Minister Mthuli Ncube last month said the authorities are working on tackling regulatory constraints faced by formal businesses that bear the brunt of taxes, while a burgeoning informal sector avoids paying.\n\nIn Argentina, Milei has been spearheading a campaign to make it easier to do businesses, promote investment and reduce the role of the state in the economy, including scrapping most price controls and abolishing a number of regulations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/01083800/ZB-Bank-.jpg",
            "description": "<p>Bloomberg Zimbabwe’s main business lobby group urged the government to implement a raft of measures to reduce firms’ operating costs, and said Argentina’s reform program could serve as a template. Zimbabwe “requires bold and accelerated reforms, including systematic deregulation inspired by Argentine’s President Javier Milei’s one deregulation per-day model,” the Confederation of Zimbabwe Industries said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-business-lobby-group-calls-for-argentina-style-reforms/\">Zimbabwe business lobby group calls for Argentina-style reforms</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        },
        {
            "title": "ZCTU elects new secretary general",
            "url": "https://www.newzimbabwe.com/zctu-elects-new-secretary-general/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) this Saturday elected Tirivanhu Marimo as the new secretary general in a development many believe marks the return of active trade unionism due to his non-partisan stance on workers issues.\n\nMarimo takes over from long serving trade unionist, Japhet Moyo, who retired last year.\n\nDuring polls held Saturday, Marimo choked a landslide victory in which he garnered 55 votes ahead of his main contender Michael Kandukutu, who secured 38 votes from the 93 eligible delegates.\n\nA holder of a Bachelor of Laws degree from the University of South Africa (UNISA) and a Masters in Human Rights Litigation from the Witwatersrand University, Marimo has a traceable record of labour activism, and is known within and beyond Zimbabwe as a human rights advocate.\n\nHe is not a novice to the countrys labour movement after having served as a chairperson of ZCTUs National Young Workers Committee.\n\nBefore being elected the new SG, Marimo worked tirelessly to represent workers in the Zimbabwe Banks and Allied Workers Union (ZIBAWU), where he held various positions from a mere executive member to the current position of national organising secretary and legal manager.\n\nMarimo has been an outspoken critic of human rights abuses in Zimbabwe, which he believes hinder the countrys progress. He believes that strategic litigation and advocacy are essential for shaping a future free of human rights abuses.\n\nThe new ZCTU secretary general understands the link between politics and workers struggle although he believes that workers must play politics in a non-partisan manner. He also appreciates that workers must form alliances with political players based on common issues.\n\nIn his acceptance speech, Marimo pledged to immediately secure the independence of the ZCTU from vested political interests in the country.\n\nOur movement grows stronger not in the absence of competition, but in the presence of unity after competition. Let us continue to walk this journey together, for our struggle is far greater than any one individual.\n\nAs secretary general, I pledge to safeguard the independence and integrity of the ZCTU, strengthen the voice of every affiliate union and ensure that no worker feels excluded from our collective shield while fighting relentlessly for policies that uplift workers and defend their rights in workplaces, courts, and on the national stage, he said.\n\nHe called for the support of the countrys working class and citizens as he underscored that taking the ZCTU back to its former glory will not be an easy road.\n\nComrades, we have sent a clear message today: ZCTU belongs to the workers  it is their shield, their voice, their weapon of justice! History shows that workers united cannot be defeated, added Marimo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/30205426/Screenshot_20250830-214931_1.jpg",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) this Saturday elected Tirivanhu Marimo as the new secretary general in a development many believe marks the return of active trade unionism due to his non-partisan stance on workers issues. Marimo takes over from long serving trade unionist, Japhet Moyo, who retired last year. During</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zctu-elects-new-secretary-general/\">ZCTU elects new secretary general</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        },
        {
            "title": "Heroic Denver Mukamba inspires Dynamos to a 3-2 victory over Scottland FC",
            "url": "https://www.newzimbabwe.com/heroic-denver-mukamba-inspires-dynamos-to-a-3-2-victory-over-scottland-fc/",
            "content": "By Sports Reporter\n\nDENVER Mukamba was the hero for Dynamos on Saturday afternoon after coming off the bench to score his teams winning goal against Scottland FC at Rufaro Stadium.\n\nMukamba hammered a spectacular goal in the 80th minute to earn the Harare giants the much-needed three points in a match that ended 3-2.\n\nDembare went for the break trailing 1-0 after in-form striker Tymon Machope had put Scottland FC in front.\n\nComing back to the second half, Dembare pulled one goal back through Shadreck Nyahwa in the 49th minute, before Vusa Ngwenya doubled the lead 12 minutes later to make it 2-1.\n\nDynamos lead was easily cancelled by Machope, who completed his brace in the 75th minute after benefitting from a Knowledge Musona free kick.\n\nSaturdays victory saw Dembare stretching its unbeaten run in the league to four games; at the same time, it was Scottland FCs first defeat in seven games.\n\nDespite the win, Dynamos remains on position 17 on the log with 28 points, the same with 16th place occupiers Green Fuel FC, who are on position 15.\n\nOn the other end, Scottland FC maintained their second position on the log with 52 points, two behind log leaders Simba Bhora, who were held to an away 0-0 draw by Green Fuel FC.\n\nMatchday 27 Saturday Full-time Results\n\nScottland 2-3 Dynamos\n\nNgezi Platinum 1-0 FC Platinum\n\nGreen Fuel FC 0-0 Simba Bhora\n\nMWOS 2-1 Chicken Inn\n\nBikita Minerals 0-4 TelOne.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/07/25043049/Denver-Mukamba.jpg",
            "description": "<p>By Sports Reporter  DENVER Mukamba was the hero for Dynamos on Saturday afternoon after coming off the bench to score his team’s winning goal against Scottland FC at Rufaro Stadium. Mukamba hammered a spectacular goal in the 80th minute to earn the Harare giants the much-needed three points in a match that ended 3-2. Dembare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/heroic-denver-mukamba-inspires-dynamos-to-a-3-2-victory-over-scottland-fc/\">Heroic Denver Mukamba inspires Dynamos to a 3-2 victory over Scottland FC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:32",
            "date": "01 Sep 2025"
        }
    ]
}