{
    "news": [
        {
            "title": "Mai Jeremaya rape suspects found not guilty, magistrate says socialite’s evidence “inconsistent and unstatisfactory”",
            "url": "https://www.newzimbabwe.com/mai-jeremaya-rape-suspects-found-not-guilty-magistrate-says-socialites-evidence-inconsistent-and-unstatisfactory/",
            "content": "By Mary Taruvinga\n\nHarare magistrate Letwin Rwodzi has acquitted two Harare men Thabo Dube and Martin Charlie who were accused of raping socialite Ashley Masendeke better known as Mai Jeremaya.\n\nThe magistrate said the Statescasewas too weak for a reasonable court to convict.\n\nFrom a clear analysis, the complainants evidence is unsatisfactory.\n\nI conclude so because in the present case, both accused gave their own explanation, which was not rebutted by the state.\n\nInconsistencies fly in the face of the complainants evidence.\n\nOn the other hand, the accused have remained consistent that the encounter was consensual.\n\nThe complainant gave three different and inconsistent statements to the police. She told the court that she was told to change her statement by one of the police but the state did not call that police officer to testify, said the magistrate.\n\nThe magistrate said this conduct is inconsistent with someone pursuing justice.\n\nThe magistrate said there are many questions which remain unanswered regarding Mai Jeremayas allegations.\n\nShe said her testimony gives credibility to the accuseds defence that the sex was consensual and transactional.\n\nThe sequence of events clearly demonstrates that the complainants report to the police was not a complete voluntary decision, said the magistrate.\n\nShe said Mai Jeremaya told her friend, Cynthia, it was a secret, which might mean that she intended to keep it under wraps.\n\nThe complainant had no option other than to cry rape, following a confrontation with her friend.\n\nThe magistrate added that Mai Jeremaya also violated the accused by hiring a private investigator who terrorised them.\n\nThe magistrate said given all that happened leading to the accuseds arrest, it was clear that the socialite fabricated the rape.\n\nThe magistrate said, Evidence reveals an ulterior motive, either of extortion or to buy sympathy from her husband.\n\nRwodzi said failure by local PI Tafadzwa Chidawa to immediately surrender the accused to the police also shows that there was an ulterior motive.\n\nThe failure to report to the police and a pursuit for compensation after the alleged rape shows that the allegations were fabricated.\n\nThe function of the court is to do justice.\n\nIt is trite that if a litigant gives unsatisfactory evidence, their case is trashed.\n\nThe magistrate said the use of the money by the complainant shows that it was an agreed transaction.\n\nShe said there is credible evidence that Dube had a sexual encounter with Mai Jeremaya.\n\nThe totality of the evidence concludes that the sex with the second accused was consensual. He paid for the lodge, he paid for the transport and he gave the accused some money.\n\nThe magistrate took note of Mai Jeremayas allegation that the lodge was in a quiet place in trying to prove that she could not have screamed for help.\n\nShe said the video footage played in court showed that the lodge is a busy place.\n\nShe said this points out to the fact that the evidence was exaggerated.\n\nThe lodge manager also told the court that no one can access the lodge without paying first, which contradicts Mai Jeremayas testimony that the room had two doors and that Charlie used the other door to get into the room.\n\nThe magistrate also said Mai Jeremayas version of the sexual attack she gave to the police was different from that she gave in court.\n\nIn court she admitted that she was the one who went on top and guided the second accused into her vagina.\n\nAll of the above corroborate the accused version that the sex was not forced, said the magistrate.\n\nIn summary, the States case is riddled with inconsistencies.\n\nthe defence version has remained consistent. On the totality of the evidence, the complainant was a consenting part in the sexual encounter.\n\nIt clearly shows willingness to engage in sex for financial benefits. This supports the conclusion that there was an agreement for consensual sex.\n\nThe magistrate said Mai Jeremaya succumbed to domestic pressure.\n\nThe prosecution has failed to prove its case beyond reasonable doubt.\n\nRwodzi said it is true that Dube did not have sex with the socialite.\n\nI hereby find both the accused not guilty and acquitted of rape.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/30131122/mai-jeremaya.jpg",
            "description": "<p>By Mary Taruvinga Harare magistrate Letwin Rwodzi has acquitted two Harare men Thabo Dube and Martin Charlie who were accused of raping socialite Ashley Masendeke better known as Mai Jeremaya. The magistrate said the State’s case was too weak for a reasonable court to convict. “From a clear analysis, the complainant’s evidence is unsatisfactory. “I conclude so</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mai-jeremaya-rape-suspects-found-not-guilty-magistrate-says-socialites-evidence-inconsistent-and-unstatisfactory/\">Mai Jeremaya rape suspects found not guilty, magistrate says socialite’s evidence “inconsistent and unstatisfactory”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "04 Jul 2025"
        },
        {
            "title": "Zimbabwe Independent editor Faith Zaba granted US$200 bail",
            "url": "https://www.newzimbabwe.com/zimbabwe-independent-editor-faith-zaba-granted-us200-bail/",
            "content": "By Mary Taruvinga\n\nZimbabwe Independent editor Faith Zaba has been granted US$200 bail by Harare magistrate Vakayi Chikwekwe.\n\nZaba is charged with undermining the authority of the President following the publication of a satirical article in the weekly newspapers Muckraker column.\n\nZaba was due to go home on Thursday, but was sent back to jail after the magistrate failed to type his ruling due to a nationwide power outage. She had spent three nights behind bars.\n\nThe state did not oppose bail.\n\nIn granting her bail, Chikwekwe said bail was a constitutional right unless there are compelling reasons warranting detention.\n\nThe fears of the state have been allayed by the bail conditions which the defence agreed with, the judge noted.\n\nAs part of her bail conditions, Zaba was ordered to surrender her passport to the Clerk of court, continue residing at her given address, not to interfere with witnesses and to report once every Friday at CID Law and Order Harare.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/02115828/ZABA-FAITH.png",
            "description": "<p>By Mary Taruvinga Zimbabwe Independent editor Faith Zaba has been granted US$200 bail by Harare magistrate Vakayi Chikwekwe. Zaba is charged with undermining the authority of the President following the publication of a satirical article in the weekly newspaper’s Muckraker column. Zaba was due to go home on Thursday, but was sent back to jail</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-independent-editor-faith-zaba-granted-us200-bail/\">Zimbabwe Independent editor Faith Zaba granted US$200 bail</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "04 Jul 2025"
        },
        {
            "title": "ZESA Executive Chairman Gata dies",
            "url": "https://www.newzimbabwe.com/zesa-executive-chairman-gata-dies/",
            "content": "By Staff Reporter\n\nThe Executive Chairman of ZESA Holdings, Sydney Gata, has died aged 79.\n\nGata died at a local private hospital after a short illness.\n\nIt is with heavy hearts and profound sadness that we share the news of the untimely passing of Dr. Sydney Zikuzo Gata, a distinguished energy, power, and infrastructure development specialist, and the Executive Chairman of ZESA Holdings. He passed away at a local hospital on 3 July 2025, after a short illness, ZESA Holdings said in a statement.\n\nDr. Gata dedicated his life to advancing energy solutions and infrastructure development.\n\nHis illustrious career spanned several decades, during which he served as a beacon of hope for the nation and an inspiration to many.\n\nHis leadership at ZESA transformed the organisation during some of its most challenging times, addressing critical power supply issues. Dr. Gatas visionary approach saw the introduction of strategic reforms that improved service delivery and was passionate about the welfare of the entire ZESA family.\n\nHe was the first black General Manager of the Electricity Supply Commission (ESC), 1981-85.\n\nGata then served as CEO and board member of ZESA in the mid-1980s to early 1990s. He was appointed ZESA Executive Chairman in 2001-2006, and was appointed to the same position in November 2019 until the time of his death.\n\nAccording to ZESA, during the period 1976-81, Sydney Gata made an impact in Research and Teaching in the fields of Mechanical and Aeronautical Engineering. In 1976, he lectured at the Chelsea College of Aeronautical Engineering in London, United Kingdom. He also lectured at the City University Department of Mechanical Engineering and Aeronautics in London, the United Kingdom, during the period 1977-80 before he came back to Zimbabwe to lecture at the University of Zimbabwe in the Faculty of Engineering during the period 1981-82.\n\nFurthermore, Dr. Gata served as a Board member of the World Energy Council Commission (WEC) for a three-year period between 1992-94.\n\nHe also served as Deputy Chairman of the WEC Studies Committee. During his career, he held advisory and board roles at the World Energy Council, African Development Bank and Integrated Energy Systems Ltd (UK) among others.\n\nHe is survived by his wife,the Deputy Minister of Primary and Secondary Education, Angeline Gata, children and grandchildren.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/05044909/sydney-gata-900.jpg",
            "description": "<p>By Staff Reporter The Executive Chairman of ZESA Holdings, Sydney Gata, has died aged 79. Gata died at a local private hospital after a short illness. “It is with heavy hearts and profound sadness that we share the news of the untimely passing of Dr. Sydney Zikuzo Gata, a distinguished energy, power, and infrastructure development</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zesa-executive-chairman-gata-dies/\">ZESA Executive Chairman Gata dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "04 Jul 2025"
        },
        {
            "title": "Over 1,500 affected by human rights violations in June by-elections – report",
            "url": "https://www.newzimbabwe.com/over-1500-affected-by-human-rights-violations-in-june-by-elections-report/",
            "content": "By Thandiwe Garusa\n\nOVER 1,500 people were affected by political violence during the recently held by-elections across the country, human rights watchdog, the Zimbabwe Peace Project (ZPP) has said.\n\nZimbabwe last month held four by-elections in Binga and Chipinge Rural District Councils, as well as Gutu East and Insiza North constituencies, which were all won by the ruling party, ZANU PF.\n\nIn its latest report, ZPP said it documented 14 human rights violations, which were in the form of harassment, intimidation, and physical violence.\n\nIn some cases, victims were severely assaulted and sustained injuries.\n\nCumulatively, ZPP documented a total of 14 violations in the four by-elections, which affected a total of 1,587 victims, the report reads.\n\nZanu PF has a long history of political violence, with perpetrators often going unpunished.\n\nThe ZPP also said that in Gutu East, village heads Bornface Takawira, Bornsen Musara, and Herbet Manjonjo served as polling agents as a way to intimidate voters.\n\nThese traditional leaders, along with political activists, made public threats during rallies, warning people that they could be evicted from their land if they voted against the ruling party.\n\nTraditional leaders in Gutu East acted as polling agents for the ruling party, which constitutes a clear violation of both the Constitution and the Traditional Leaders Act.\n\nThese observations raise concerns about the integrity of the electoral process and the potential for voter intimidation, the report added.\n\nZPP further reported that in some instances, literate voters were forced to declare that they could not read or write and were then assigned specific ZANU PF members to assist them in voting.\n\nThe rights watchdog argues that these incidents raise serious concerns about possible voter manipulation and coerced voting.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/08/23115402/20230823_125104.jpg",
            "description": "<p>By Thandiwe Garusa OVER 1,500 people were affected by political violence during the recently held by-elections across the country, human rights watchdog, the Zimbabwe Peace Project (ZPP) has said. Zimbabwe last month held four by-elections in Binga and Chipinge Rural District Councils, as well as Gutu East and Insiza North constituencies, which were all won</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-1500-affected-by-human-rights-violations-in-june-by-elections-report/\">Over 1,500 affected by human rights violations in June by-elections – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "04 Jul 2025"
        },
        {
            "title": "Feels great to be back home – Ishmael Wadi returns to CAPS United",
            "url": "https://www.newzimbabwe.com/feels-great-to-be-back-home-ishmael-wadi-returns-to-caps-united/",
            "content": "By Sports Reporter\n\nStriker Ishmael Wadi says he is happy to be back at CAPS United after playing in South Africa for the past three years.\n\nWadi (32) is one of the three players who have been signed by CAPS United during the ongoing transfer window, which started on the 1st of July.\n\nHe last featured for CAPS United in 2021 before leaving for South Africa, where he played for Glad Africa Championship side JDR Stars.\n\nIt feels great to be back home. I think home is best, so I decided to come back to CAPS because it is home.\n\nWadi re-joins CAPS United at a time when the team is struggling with form in the ongoing campaign.\n\nMakepekepe recorded one of its worst starts in PSL history, only to revive form with the coming of Zambian coach Ian Bakala, who is a former player.\n\nCurrently, the team is in position 11 with 20 points, twelve ahead of bottom-placed Kwekwe United.\n\nI think we need to work as a team because I dont think it is an individual sport.\n\nSo we need to push because where we are standing right now is not a favourable position for us, but I think we need to work ourselves out, added Wadi.\n\nCAPS United has only scored 14 goals in 18 games.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/03203354/Ishmael-Wadi.jpg",
            "description": "<p>By Sports Reporter Striker Ishmael Wadi says he is happy to be back at CAPS United after playing in South Africa for the past three years. Wadi (32) is one of the three players who have been signed by CAPS United during the ongoing transfer window, which started on the 1st of July. He last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/feels-great-to-be-back-home-ishmael-wadi-returns-to-caps-united/\">Feels great to be back home – Ishmael Wadi returns to CAPS United</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "04 Jul 2025"
        },
        {
            "title": "South Africa’s former deputy president Mabuza dies",
            "url": "https://www.newzimbabwe.com/south-africas-former-deputy-president-mabuza-dies/",
            "content": "South Africas former deputy president, David Mabuza, whohelped bring current President Cyril Ramaphosa to power, has died, the presidency said on Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/03202505/mabuza.jpg",
            "description": "<p>Reuters South Africa’s former deputy president, David Mabuza, who helped bring current President Cyril Ramaphosa to power, has died, the presidency said on Thursday. Mabuza, 64, served as deputy president from 2018 to 2023 and played a key role in ensuring Ramaphosa won the tight 2017 party contest to lead the African National Congress. Details</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-former-deputy-president-mabuza-dies/\">South Africa’s former deputy president Mabuza dies</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "04 Jul 2025"
        }
    ]
}