{
    "news": [
        {
            "title": "Mnangagwa moves to shield himself from coup threat with army vehicle handout",
            "url": "https://www.newzimbabwe.com/mnangagwa-moves-to-shield-himself-from-coup-threat-with-army-vehicle-handout/",
            "content": "By Staff Reporter\n\nAs the succession battle within Zanu-PF intensifies, President Emmerson Mnangagwa has moved to stave off any potential coup by awarding more than 700 senior army officers top-of-the-range, all-terrain vehicles, his spokesperson George Charamba has confirmed.\n\nMnangagwas decision follows his absence from the United Nations General Assembly amid intelligence reports suggesting the possible arrest of his loyalists, controversial business tycoons Kudakwashe Tagwirei, Wicknell Chivayo, Delish Nguwaya, and Paul Tungwarara.\n\nThe four were reportedly named in a corruption dossier Vice President Constantino Chiwenga presented at the recent Zanu-PF politburo meeting in Harare.\n\nHaunted by the spectre of November 2017, Mnangagwa appears to be taking no chances, seeking to appease the military, the traditional kingmakers in Zimbabwean politics.\n\nHis Excellency the President today handed over 102 vehicles to the ZDF in order to capacitate the Defence Force. All told, the ZDF will get over 700 vehicles, the first ever time that ZDF has received such a consignment within a short-time bracket, Charamba announced on his X account on Monday.\n\nThe timing has raised eyebrows, with many viewing the gesture as a clear coup-proofing strategy.\n\nCharamba defended the move, framing it as a fulfilment of service conditions for senior officers: The vehicles, which are part of the conditions of service for senior army officers, plug a gap in conditions of service for officers, some of whom had gone for a couple of years without a full set of their entitlements.\n\nHowever, he also revealed the allocation is structured as a loan. In public sector parlance, these vehicles are called personal issue service vehicles. What that means is that the vehicle is personal to the haver, who is also allowed to buy the vehicle after a stipulated time.\n\nThe development has already sparked public scrutiny, with critics demanding clarity on the source of funds and whether the purchase was accounted for in the 2025 national budget.\n\nObservers warn Zimbabwe is increasingly resembling a mafia-style economy where political elites distribute vehicles and perks like candy to loyalists and strategic allies in order to cling to power.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29181705/army-ED.jpeg",
            "description": "<p>By Staff Reporter As the succession battle within Zanu-PF intensifies, President Emmerson Mnangagwa has moved to stave off any potential coup by awarding more than 700 senior army officers top-of-the-range, all-terrain vehicles, his spokesperson George Charamba has confirmed. Mnangagwa’s decision follows his absence from the United Nations General Assembly amid intelligence reports suggesting the possible</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-moves-to-shield-himself-from-coup-threat-with-army-vehicle-handout/\">Mnangagwa moves to shield himself from coup threat with army vehicle handout   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "30 Sep 2025"
        },
        {
            "title": "Zimbabwe to host IATF permanent secretariat",
            "url": "https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/",
            "content": "APA News\n\nThe Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO).\n\nThe move, announced during IATF2025 in Algiers, marks a major milestone in Africas push for economic integration under the African Continental Free Trade Area (AfCFTA).\n\nThe decision to base the headquarters in Zimbabwe followed a competitive bidding process involving Burkina Faso, Cameroon, Malawi, Zambia, South Africa and Zimbabwe.\n\nFormer Nigerian President Olusegun Obasanjo, chairperson of the IATF Advisory Council, said Zimbabwe was selected for its strong conferencing infrastructure, air connectivity, accommodation capacity and commitment to land provision for future expansion.\n\nThis opens a new chapter for IATF as it continues powering growth in intra-African trade and playing its role as the most important trade and investment gathering on the continent, Obasanjo said.\n\nBacked by an initial capitalisation of $28 million approved by the African Export-Import Bank (Afreximbank), IATFCO will serve as the institutional anchor for the biennial trade fair, which has grown into the continents largest marketplace for intra-African commerce.\n\nAfreximbank president Benedict Oramah hailed the development as a huge milestone, urging African governments, corporations and financial institutions to support the institution during its formative phase.\n\nIATF is co-convened by Afreximbank, the African Union Commission and the AfCFTA Secretariat.\n\nIt provides a platform for businesses to showcase goods and services, forge partnerships and tap into AfCFTAs single market of over 1.4 billion people and a combined gross domestic product exceeding $3.5 trillion.\n\nThe 2025 edition of the fair, held from 4 to 10 September in Algiers, attracted over 112,000 visitors from 132 countries, hosted 2,148 exhibitors and generated $48.3 billion in trade and investment deals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/03/08111459/harare.jpeg",
            "description": "<p>APA News The Intra-African Trade Fair (IATF) is set to become a permanent institution headquartered in Harare, Zimbabwe, following its formal transition into the newly established Intra-African Trade Fair Company (IATFCO). The move, announced during IATF2025 in Algiers, marks a major milestone in Africa’s push for economic integration under the African Continental Free Trade Area</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-to-host-iatf-permanent-secretariat/\">Zimbabwe to host IATF permanent secretariat</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "30 Sep 2025"
        },
        {
            "title": "Zimbabwe is a tobacco country, but some think the future lies in blueberries",
            "url": "https://www.newzimbabwe.com/zimbabwe-is-a-tobacco-country-but-some-think-the-future-lies-in-blueberries/",
            "content": "BBC\n\nZimbabwe is Africas biggest producer of tobacco but some farmers believe the countrys long-term future could lie in a very different crop  blueberries.\n\nThanks to a breakthrough in trade talks with China, the worlds biggest importer of the nutrient-rich fruit, Zimbabwe has taken a major step towards achieving its ambition of becoming Africas blueberry capital.\n\nTobacco sales surged to a record $1.3bn (1bn) last year, helped by the rising number of smokers in China.\n\nIn contrast, blueberry exports were worth a more modest $30m but horticulture specialist Clarence Mwale is undaunted.\n\nThe future is food, not a bad habit, he tells the BBC at his warehouse in Harare.\n\nFor the first time, China has agreed to import Zimbabwean blueberries and, crucially, has exempted them from tariffs, in a boost for the southern African states struggling economy.\n\nWe have to strike while the iron is hot, exuberant blueberry farmer Alistair Campbell tells the BBC.\n\nCurrently exporting to Europe, the Middle East and South East Asia, farmers like Campbell would be gaining access to a massive new market, once Zimbabwe passes Chinas compliance tests on pest and disease control.\n\nA former captain of Zimbabwes cricket team, 53-year-old Campbell co-owns a high-tech 50 hectare (123 acres) blueberry farm about an hour from the capital, Harare.\n\nEach of the 240,000 plants on the farm is grown in a pot imported from the Netherlands or South Africa. The pot soil is also imported.\n\nThe plants are watered eight times a day, with specially treated water, and the blueberries are kept in refrigerators soon after they are harvested to maintain freshness.\n\nCampbell said that although it was a demanding fruit to grow, the rewards are worth it, especially as global demand is increasing for what some describe as a superfood, with high levels of vitamins and anti-oxidants.\n\nCampbell believes Zimbabwe can cash in on the rising demand, as the fruit comes into season early, in late March, hitting the market ahead of major competitors like Peru.\n\nIts all about Peru avoidance, laughs Campbell.\n\nPeru is both a bitter rival and an inspiration for Zimbabwes farmers. In the last 10 to 15 years, it has gone from being responsible for less than 2% of global blueberry production to becoming the largest exporter of the fruit.\n\nZimbabwes production this year is expected to rise by 50% to 12,000 tonnes.\n\nMorocco currently leads Africas production with more than 80,000 tonnes in 2024.\n\nSouth Africa, Zimbabwes neighbour, produced 25,000 tonnes.\n\nWith South Africa being severely hit by US tariffs, it is looking for new markets for its fruit, with China being an obvious one, especially as it has promised zero tariffs for all African states, except Eswatini because of its close ties with Taiwan.\n\nThe Washington Post via Getty Images Blueberries have become increasingly popular because of their health benefits\n\nChina has not yet agreed to take South African blueberries, raising hopes among farmers in Zimbabwe that they will enter the lucrative market first.\n\nThe Zimbabwean and Chinese governments struck the deal earlier this month, offering what has been described as anunprecedented opportunity for local producers to access one of the worlds fastest-growing blueberry markets.\n\nThis agreement is a milestone for Zimbabwes horticultural sector, says Zimbabwes Horticultural Development Council executive director Linda Nielsen.\n\nWe now need collaboration to design policies that increase investment, boost production, and ensure our blueberries meet Chinas strict quality and phytosanitary standards, she adds.\n\nZimbabwe farmers are now looking for capital to boost blueberry production to 30,000 tonnes by 2030.\n\nExpressing caution about whether this can be achieved, Campbell tells the BBC: Its all good saying Zimbabwe is open for business but the underlying fundamentals need to be correct.\n\nMany analysts say that more than 20 years after the governments controversial land reform programme led to the seizure of many white-owned farms, investors remain uncertain about the security of their land, despite a new law that does away with leases and offers full title to resettled farmers.\n\nWith Zimbabwe experiencing a severe cash crisis, exporters are required to surrender almost a third of their foreign-currency earnings to the central bank in exchange for local currency  something that many Zimbabweans are loathe to do, fearing it will lose its value.\n\nLast year Zimbabwe generated $30m (22.5m) from blueberry exports.\n\nThe amount may be modest, but with unemployment high, the jobs the industry creates are welcome. It employs about 6,000 people, mostly women.\n\nShingai Nyoka / BBC Rebecca Bonzo says blueberry farms are a source of employment for women\n\nIts delicate hands that are needed for a delicate fruit, Rebecca Bonzo, a supervisor at Campbells farm, tells the BBC in the Shona language.\n\nUp to 300 women work during the peak harvesting season. Many are sole breadwinners who can now take care of their families, she says.\n\nClarence Mwale  the founder of Kuminda, which represents a collective of small- and medium-scale farmers  says he is pushing more of them to become involved in blueberry farming.\n\nHe says he has achieved this with other crops  for instance, about 5,000 small-scale farmers now supply horticultural products, mainly mange touts and sugar snap peas, to the UK and other European markets, something that was unheard of 15 to 20 years ago.\n\nMwale says he is now looking for about 100 young farmers to diversify into blueberry farming and benefit from Chinas decision to open the market to Zimbabweans.\n\nAs the Chinese market opens upit gives us much more scope, he tells the BBC. Where we were scrambling and fighting for the European markets, which we havent been able to fulfil, now we have a vast market that we have to fill.\n\nIt gives everyone a chance to get into the blueberry production.\n\nZimbabwe has traditionally been tobacco country.\n\nBut having fuelled a bad habit in China, it now wants to promote a health food there, hoping in the process to acquire the status of Africas blueberry capital.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/29105512/blueberry-BBC.webp",
            "description": "<p>BBC Zimbabwe is Africa’s biggest producer of tobacco but some farmers believe the country’s long-term future could lie in a very different crop – blueberries. Thanks to a breakthrough in trade talks with China, the world’s biggest importer of the nutrient-rich fruit, Zimbabwe has taken a major step towards achieving its ambition of becoming Africa’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-is-a-tobacco-country-but-some-think-the-future-lies-in-blueberries/\">Zimbabwe is a tobacco country, but some think the future lies in blueberries</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "30 Sep 2025"
        },
        {
            "title": "ZWG inflation rate slips to a negative 0,2%",
            "url": "https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/",
            "content": "By Alois Vinga\n\nThe Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to 0.2%, raising hopes that annual inflation,still in double digits,will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday.\n\nAccording to the latest data, the ZWG has maintained notable stability against the US dollar since September 2024, when it last registered a major dip.\n\nThe ZWG month-on-month inflation rate was 0.2% in September 2025, shedding 0.6 percentage points from the August 2025 rate of 0.4%. This means that prices, as measured by the all-items ZWG Consumer Price Index (CPI), decreased by an average of 0.2% between August and September 2025, Zimstat said.\n\nFood and Non-Alcoholic Beverages recorded a month-on-month inflation rate of 0.2% in September, up from 0.1% in August. In contrast, non-food inflation fell to 0.5%, down from 0.6% in the previous month.\n\nYear-on-year, however, inflation remains elevated. The ZWG year-on-year inflation rate for September 2025 was 82.7%, meaning prices increased by an average of 82.7% compared to September 2024, Zimstat added.\n\nThe Reserve Bank of Zimbabwe (RBZ) has continued to pursue a tight monetary policy to safeguard the ZiG currency introduced in April 2024. This has included maintaining a high policy rate to curb speculative borrowing and anchor both inflation and exchange rate expectations.\n\nMeanwhile, Zimstat reported that US dollar inflation remained steady, with the September 2025 month-on-month rate unchanged at 0%, while year-on-year inflation stood at 13.4%.\n\nOn the poverty benchmarks, the Food Poverty Line (FPL) for one person in September was ZWG 877.03, while the Total Consumption Poverty Line (TCPL) stood at ZWG 1,292.80,the minimum needed per person to cover both food and non-food requirements.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>By Alois Vinga The Zimbabwe Gold (ZWG) currency recorded a marginal decline in inflation last month, with the month-on-month rate easing to –0.2%, raising hopes that annual inflation, still in double digits, will continue to recede through year-end, the Zimbabwe National Statistics Agency (Zimstat) reported Monday. According to the latest data, the ZWG has maintained notable stability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-inflation-rate-slips-to-a-negative-02/\">ZWG inflation rate slips to a negative 0,2%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "30 Sep 2025"
        },
        {
            "title": "NoViolet Bulawayo wins the 2025 Best of Caine Award for ‘Hitting Budapest’",
            "url": "https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-2025-best-of-caine-award-for-hitting-budapest/",
            "content": "IOL\n\nThe Caine Prize for African Writing has a reason to celebrate as it marks its 25th anniversary with the announcement of Zimbabwean author NoViolet Bulawayo as the recipient of the prestigious 2025 Best of Caine Award. This accolade is bestowed upon her gripping short story, Hitting Budapest, which originally earned her the Caine Prize in 2011.\n\nThe announcement was made during the inauguralWords Across Waters Afro Lit Festivalon Saturday, by Ellah Wakatama OBE, Chair of the Caine Prize. This years judging panel, presided over by Nobel Laureate Prof. Abdulrazak Gurnah, included acclaimed authors and cultural figures such as Jennifer Nansubuga Makumbi and film producer Tony Tagoe.\n\nProf. Gurnah said, It was a tremendously impressive collection of stories to read through, but the decision to award the Best of Caine Prize to NoViolet Bulawayo was unanimous and swift. The judges were impressed with the control of voice the story demonstrated and the superb evocation of a childhood vision.\n\nExpressing her gratitude upon accepting the award, NoViolet Bulawayo reflected on her journey as a writer, stating, Winning the Caine Prize as an unpublished writer back in 2011 was truly the kind of defining highlight to jumpstart a career, it brought my work to a global audience, affirmed my literary path, and strengthened my confidence and commitment to writing.\n\nBulawayo further highlighted the significance of the Best of Caine Award as a moment of reflection on her literary evolution: Now, receiving the Best of Caine Award these many years later feels like a moment to reflect on the journey. I warmly congratulate the twenty-four remarkable winning authors and finalists whose works have helped define the prize up to this moment.\n\nSince its inception, the Caine Prize has been instrumental in nurturing and promoting African literature, offering writers unparalleled opportunities for visibility and professional development, including publishing deals and writing fellowships. Bulawayos own story is a testament to this legacy, as she has emerged as a voice of significant impact within the global literary community.\n\nThis is twenty-five years of consistency, excellence, and vision  our present is vibrant, and the future promises even more, Bulawayo remarked, dedicating her award to the emerging voices that will shape the future of African literature.\n\nI am truly excited to read you all and witness how you continue to shape the landscape of African literature.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/07/27013711/NoViolet-Bulawayo.png",
            "description": "<p>IOL The Caine Prize for African Writing has a reason to celebrate as it marks its 25th anniversary with the announcement of Zimbabwean author NoViolet Bulawayo as the recipient of the prestigious 2025 Best of Caine Award. This accolade is bestowed upon her gripping short story, “Hitting Budapest,” which originally earned her the Caine Prize</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/noviolet-bulawayo-wins-the-2025-best-of-caine-award-for-hitting-budapest/\">NoViolet Bulawayo wins the 2025 Best of Caine Award for ‘Hitting Budapest’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:39",
            "date": "30 Sep 2025"
        }
    ]
}