{
    "news": [
        {
            "title": "Government showers rare praises on America, says it wants to fix relationship with Western power",
            "url": "https://www.newzimbabwe.com/government-showers-rare-praises-on-america-says-it-wants-to-fix-relationship-with-western-power/",
            "content": "By Leopold Munhende\n\nFOREIGN Affairs Minister Amon Murwira has showered rare praises on the United States of America (USA) for its humanitarian work and business investments over Zimbabwes 45 years of Independence.\n\nMurwira, who was speaking as guest of honour at early American Independence celebrations hosted by the US Embassy in Harare, expressed Zimbabwes gratitude for the superpowers contributions in its health, agriculture and education sectors, where hundreds of millions have been poured.\n\nHe said government, in its Zimbabwe is Open for Business approach towards international re-engagement, was specifically concerned with improving relations with America.\n\nZimbabwes relationship with America broke down in the early 2000s following a string of human rights abuses that were sanctioned by late President Robert Mugabe against opposition members, targeted white farmers and other dissenting voices.\n\nWe wish to express the gratitude of the government and people of Zimbabwe for the USAs support over the past 45 years which has contributed to the progress and development of Zimbabwe through collaboration in the implementation of programmes in sectors that include agriculture, education and health sector among others, said Murwira.\n\nWe are grateful for this support.\n\nZimbabwe is open for business, it is open to fair cooperation, it is open to deepen relations with the rest of the world, particularly with America and wish therefore to invite all potential US investors to come and invest in Zimbabwe.\n\nZimbabwe is fully committed to the continued enhancement of our bilateral relations.\n\nOver a million people have been fed by America in the past year. Some 47,000 farmers have accessed US markets while more than 500,000 have received antiretroviral drugs (ARVs) from its arm, the Presidents Emergency Fund for AIDS Relief (PEPFAR).\n\nDespite past attempts to thaw relations with America, Zimbabwe has always been found wanting whenever its human rights record is analysed. Arrest of journalists, the continued use of lengthy pre-trial detention as a weapon against dissenting voices, abductions and torture by the secret service have always been brought up.\n\nGrand corruption within the government, headed by Zanu PF-aligned businessmen and a clear disregard to fix the graft have also been raised as red flags.\n\nThis latest attempt at mending relations between the two countries comes barely a month after President Emmerson Mnangagwa announced the suspension of all tariffs on goods being imported from the US in an attempt to court re-elected President Donald Trump.\n\nAdded Murwira: Zimbabwe looks forward to deepening relations and expansion of bilateral cooperation with the USA we appreciate the participation of the USA through its embassy at the 2025 edition of Zimbabwe International Trade Fair (ZITF). We thank you for that participation.\n\nWe applaud all USA companies that have established businesses in Zimbabwe, we would like to assure all these and foreign companies in Zimbabwe that the Zimbabwean government is willing to assist them to expand their operations.\n\nAmericas Independence Day was commemorated earlier in Harare as a significant number of its embassy staff are being redeployed, according to Ambassador Pamela Tremont. America will be celebrating 249 years of Independence on July 4.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05122143/murwira-tremont.jpeg",
            "description": "<p>By Leopold Munhende FOREIGN Affairs Minister Amon Murwira has showered rare praises on the United States of America (USA) for its humanitarian work and business investments over Zimbabwe’s 45 years of Independence. Murwira, who was speaking as guest of honour at early American Independence celebrations hosted by the US Embassy in Harare, expressed Zimbabwe’s gratitude</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-showers-rare-praises-on-america-says-it-wants-to-fix-relationship-with-western-power/\">Government showers rare praises on America, says it wants to fix relationship with Western power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        },
        {
            "title": "First trailer for Wicked sequel released",
            "url": "https://www.newzimbabwe.com/first-trailer-for-wicked-sequel-released/",
            "content": "BBC\n\nThe first full-length trailer for Wickeds forthcoming sequel has been released, offering fans a glimpse of how the Wizard of Oz spin-off will conclude.\n\nWicked: For Good will see Cynthia Erivo return as Elphaba, the Wicked Witch of the West, alongside Ariana Grande as Glinda the Good Witch of the North.\n\nThe new trailer shows Glinda standing on a balcony overlooking a mob of angry people carrying flaming torches searching for Elphaba.\n\nIt ends with Elphaba saying shes off to see the Wizard before flying on a broom into the distance.\n\nWicked: For Good will pick up where the first film left off and cover the years after Elphaba and Glindas decision to part ways.\n\nElphaba is now an enemy of the state of Oz, while Glinda has become a public figure controlled by the Wizard.\n\nDirector Jon M Chu said: Our heart was broken when Glinda cant make the choice that we want her to so badly at the end of movie one, and it feels empowering for Elphaba to fly away from society.\n\nIn movie two, we get to see the consequences of those choices. The temperature is up.\n\nThe films have been adapted from the hugely successful Broadway and West End musical, which itself was based on Gregory Maguires 2005 novel.\n\nHowever, the stage musical was split into two films for its big-screen adaptation, with the second due to be released on 21 November.\n\nThe two movies were shot simultaneously at Elstree Studios in Hertfordshire between December 2022 and January 2024, with production interrupted mid-way through by the Hollywood actors strike.\n\nWicked wasthe highest-grossing movie of 2024 in the UK,and scored 10 Oscar nominations  winning two for best costume and production design.\n\nAt two hours 40 minutes, the first film alone was almost as long as the entire length of the stage show.\n\nErivo and Grandes chemistry and real-life friendship prompted several viral interview moments during the first films promotional run last year, and the pair jointly opened the Academy Awards in March with a Wicked medley.\n\nBut one challenge facing the sequel is that most of the best known songs from the musical, such as Defying Gravity, Popular and The Wizard And I, featured in the first film.\n\nThe forthcoming follow-up will feature two brand new songs,with Chu telling Vanity Fair:Theyre great additions to this movie. They were necessary in this movie to help tell the story.\n\nGrande and Erivo will be joined once again by co-stars Michelle Yeoh, Jonathan Bailey and Jeff Goldblum as the Wizard.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05093412/erivo-grande-wicked.webp",
            "description": "<p>BBC The first full-length trailer for Wicked’s forthcoming sequel has been released, offering fans a glimpse of how the Wizard of Oz spin-off will conclude. Wicked: For Good will see Cynthia Erivo return as Elphaba, the Wicked Witch of the West, alongside Ariana Grande as Glinda the Good Witch of the North. The new trailer</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/first-trailer-for-wicked-sequel-released/\">First trailer for Wicked sequel released</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        },
        {
            "title": "Cargo ship on fire off Alaskan coast, 3 000 vehicles onboard",
            "url": "https://www.newzimbabwe.com/cargo-ship-on-fire-off-alaskan-coast-3-000-vehicles-onboard/",
            "content": "SABC\n\nThe crew of a cargo ship carrying around 3 000 vehicles, including 800 electric vehicles, abandoned it off the coast of Alaska after a fire broke out onboard, its operator Zodiac Maritime said on Wednesday\n\nThe 22 crew members were safely evacuated the ship after they failed to put out the fire, Zodiac said as it focuses on salvaging the vessel. They were evacuated via lifeboat and were being transferred to a nearby merchant vessel in tandem with the US Coast Guard.\n\nThe vessel, Morning Midas, was located 482.8 km southwest of Adak in Alaska, the Coast Guard said on its X account. Smoke was initially seen rising from a deck loaded with EVs, the company said.\n\nIt is not clear what brand of vehicles the ship was carrying. The Liberia-flagged ship left Chinas Yantai port on May 26 and was on the way to Lazaro Cardenas, Mexico, according to data. The Coast Guard said that aircrew and a cutter ship have been sent to assist with the situation and three vessels were already on the scene. One of the vessels ship insurers, Steamship Mutual, did not immediately respond to a Reuters request for comment.\n\nFires onboard vessels, particularly on container ships, car carriers and roll-on/roll-off ships remain a major concern for insurers. Fires across all vessel segments hit the highest level in a decade in 2024, according to insurer Allianz Commercial.The reality is the risk remains significant due to the size of these ships and the complexities involved in firefighting and salvage, Allianz said in its 2025 safety and shipping review report.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/05092833/cargo-ship.jpeg",
            "description": "<p>SABC The crew of a cargo ship carrying around 3 000 vehicles, including 800 electric vehicles, abandoned it off the coast of Alaska after a fire broke out onboard, its operator Zodiac Maritime said on Wednesday The 22 crew members were safely evacuated the ship after they failed to put out the fire, Zodiac said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cargo-ship-on-fire-off-alaskan-coast-3-000-vehicles-onboard/\">Cargo ship on fire off Alaskan coast, 3 000 vehicles onboard</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        },
        {
            "title": "ADRA employee in court over US$1 million fraud",
            "url": "https://www.newzimbabwe.com/adra-employee-in-court-over-us1-million-fraud/",
            "content": "By Staff Reporter\n\nAn Adventist Development and Relief Agency (ADRA) employee was taken to court on fraud charges after he allegedly swindled his employer of over US$1 million.\n\nFortune Goredema appeared before Harare regional magistrate Marewanazvo Gofa, who granted him US$1,000.\n\nGoredema was also put under stringent bail conditions, which will see him reporting three times a week to the police.\n\nHe was also ordered to surrender his passport and title deeds to his house as part of his bail conditions.\n\nIt is the states case that in July last year, the organisation received a tip-off that Goredema was misusing their funds.\n\nActing on the information, the ADRA board initiated a forensic audit.\n\nThe audit was done by General Conference Auditing Services (GCAS), which picked up that from 2018 to 2024, Goredema defrauded the organisation using PAYE to the Zimbabwe Revenue Authority (Zimra).\n\nThe court heard he would allegedly post fictitious information in the ADRA accounting system, purporting that money was paid to Zimra when no money was paid.\n\nHe also allegedly misrepresented that he paid NSSA dues, knowing this was false.\n\nHe also misrepresented the nature of periodic financial statements in collaboration with the external auditors Baker Tilly who then confirmed during the audit session that the figures were understated, reads court papers.\n\nThe court heard Goredema had not met the requirements for statutory obligations of US$1,209,397 meant for Zimra PAYE and US$160,437 for NSSA dies.\n\nHe was overpaying himself and a total of US$118,578.69 was directed as his remuneration in the period from 2023 to 2024, said the National Prosecuting Authority.\n\nThe court heard that after the scam was unearthed, Goredema allegedly admitted to the allegations and sought redress and leniency.\n\nThe matter could not be resolved within the church because some of the money was donated; as such, accountability was a priority.\n\nThe complainant suffered an actual prejudice of US$1,488,403.\n\nNothing was recovered.\n\nLancelot Mutsokoti prosecuted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter An Adventist Development and Relief Agency (ADRA) employee was taken to court on fraud charges after he allegedly swindled his employer of over US$1 million. Fortune Goredema appeared before Harare regional magistrate Marewanazvo Gofa, who granted him US$1,000. Goredema was also put under stringent bail conditions, which will see him reporting three</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/adra-employee-in-court-over-us1-million-fraud/\">ADRA employee in court over US$1 million fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        },
        {
            "title": "ZWG annual inflation will not affect consumer purchasing power – Central Bank",
            "url": "https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics.\n\nThis comes afterinflation statistics by the Zimbabwe National Statistics Agency (Zimstat)revealedthat annual inflation surged to 92,1% in the month of September 2025.\n\nThe developments recently triggered an outcry from industry, which blamed the September 2024 43% local currency devaluation directive for pushing up the inflationary pressures. The business community also contends that the high ZWG annual inflation rates pose challenges for businesses, particularly due to the impact on interest rates.\n\nBut in a statement Wednesday, the RBZ governor, Dr John Mushayavanhu, said the transition from the ZW$ to ZWG-denominated prices inevitably created a statistical gap in the calculation of annual inflation figures. This resulted in Zimstat computing and publishing yearly inflation in April 2015 after obtaining a full year of ZWG prices.\n\nThe RBZ therefore, advised the public that the recorded rise in year-on-year ZWG inflation in April and May 2025 is primarily due to the base effect emanating from the once-off spike in monthly inflation from 5,8% in September 2024 to 37,2% in October 2024.\n\nThe current trend in annual inflation is expected to continue up to September 2025 and decline thereafter to align with the current low and stable monthly inflation. The current annual inflation will therefore not affect consumer purchasing power and value preservation, as the inflation impact has already been realised, said Mushayavanhu.\n\nThe central bank exchequer said going forward, the economy is projected to decline to 30% by 31 December 2025 and to further decline towards single-digit levels in the outlook period.\n\nConsidering the current pricing circumstances where annual ZiG inflation is not reflective of the current pricing dynamics, the RBZ encourages economic agents to focus on month-on-month inflation, which has a more direct link to current ZWG purchasing power expectations.\n\nThe monthly ZWG inflation will remain low and stable as Monetary Policy remains appropriately tight to balance price stability and economic growth, added Mushayavanhu.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171559/mushayavanhu-rbz.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has implored economic agents to ignore annual ZWG inflation rates, arguing the stats have no bearing on pricing dynamics. This comes after inflation statistics by the Zimbabwe National Statistics Agency (Zimstat) revealed that annual inflation surged to 92,1% in the month of September 2025. The developments recently triggered an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-annual-inflation-will-not-affect-consumer-purchasing-power-central-bank/\">ZWG annual inflation will not affect consumer purchasing power – Central Bank</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        },
        {
            "title": "Rights Commission slams authorities for unlawful detention of 66 irregular migrants",
            "url": "https://www.newzimbabwe.com/rights-commission-slams-authorities-for-unlawful-detention-of-66-irregular-migrants/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Commission (ZHRC) has condemned the detention of 66 irregular migrants of various nationalities, stating that their continued imprisonment violates their rights as they are neither facing criminal charges nor awaiting trial.\n\nAccording to ZHRC, the 66 detained at Harare Remand Prison are from Burundi, Ethiopia, Malawi, South Africa, Libya, Mozambique, China, Pakistan, Taiwan, India, the United Kingdom, France and Cape Verde.\n\nIn a press statement Wednesday following its recenthuman rights monitoringvisitto Harare Remand Prison, ZHRC urged authorities to immediately endthe practice of detaining migrants indefinitely.\n\nThere were 66 irregular migrants of different nationalities whose detention was in violation of their rights as they were not facing any criminal charges and were not awaiting trial.\n\nIn light of these findings, ZHRC urged relevant authorities to take immediate action to desist from imprisonment of irregular migrants whose issues should be handled without resorting to indefinite detention, the statement reads.\n\nZimbabwe currently does not have detention facilities for irregular immigrants that are not prisons.\n\nSome illegal immigrants end up staying in prison for more than ten years awaiting deportation.\n\nAccording to Immigration Chief Director Respect Gono last year, as of September 23, there were 368 jailed illegal immigrants, 274 were awaiting deportation, 61 were serving prison sentences, and 33 were awaiting trial for various offences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29045845/harare-remand.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Commission (ZHRC) has condemned the detention of 66 irregular migrants of various nationalities, stating that their continued imprisonment violates their rights as they are neither facing criminal charges nor awaiting trial. According to ZHRC, the 66 detained at Harare Remand Prison are from Burundi, Ethiopia, Malawi, South Africa,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rights-commission-slams-authorities-for-unlawful-detention-of-66-irregular-migrants/\">Rights Commission slams authorities for unlawful detention of 66 irregular migrants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        },
        {
            "title": "VAR saves Warriors to pick a draw against Mauritius",
            "url": "https://www.newzimbabwe.com/var-saves-warriors-to-pick-a-draw-against-mauritius/",
            "content": "By Sport Reporter\n\nThe Warriors COSAFA Cup tournament campaign started with a nil-all draw against Mauritius in a Group A match played on Wednesday evening at Free State stadium in South Africa.\n\nZimbabwe sent a youthful squad to COSAFA, with goalkeeper Martin Mapisa (27) as the oldest.\n\nZimbabwe could have gone a goal up before the break, but Tinotenda Meke failed to convert two clear chances in the 32ndand 41stminutes.\n\nComing back to the second half, Mauritiusproved to be a better side, as they made several attacks in search of a goal.\n\nThe Dodos went on to score a goal in the 72nd minute, only for it to be cancelled after the intervention of VAR.\n\nDespite making a few changes, the Warriors failed to create meaningful chances upfront, although they dominated possession in the final ten minutes.\n\nTeam captain Andrew Mbeba almost gave Zimbabwe the much-needed goal in the 91stminute, only for his header to slightly miss the target.\n\nZimbabwe is now sitting third in the group with one point, the same as second-place occupiers Mauritius.\n\nMozambique is topping Group A with 3 points after beating South Africa 1-0, Wednesday afternoon.\n\nThe Warriors will be back in action on Saturday when they face neighbours South Africa in the second match of the campaign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04194541/warriors-mauritius.jpeg",
            "description": "<p>By Sport Reporter The Warriors’ COSAFA Cup tournament campaign started with a nil-all draw against Mauritius in a Group A match played on Wednesday evening at Free State stadium in South Africa. Zimbabwe sent a youthful squad to COSAFA, with goalkeeper Martin Mapisa (27) as the oldest. Zimbabwe could have gone a goal up before</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/var-saves-warriors-to-pick-a-draw-against-mauritius/\">VAR saves Warriors to pick a draw against Mauritius</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:45",
            "date": "05 Jun 2025"
        }
    ]
}