{
    "news": [
        {
            "title": "IMF wants Zimbabwe’s gold-backed ZiG to become sole currency",
            "url": "https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/",
            "content": "Bloomberg\n\nThe International Monetary Fund said it would like to see the ZiG fully becoming a national currency, as it weighs whether to place Zimbabwe on a staff-monitored program.\n\nThe ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. Its the countrys sixth attempt since 2009 to replace the dollar as the southern African nations main transacting currency, but is yet to succeed.\n\nSeveral measures will need to be adopted to boost ZiG usage, including deepening the foreign-exchange market to ensure full price discovery, said Wojciech Maliszewski, the Washington-based lenders mission chief, who is in Zimbabwe to review its request for a new SMP. The nations last program ended abruptly in 2019 after the central bank printed money that fueled the collapse of the local currency.\n\nRight now we see good stability in the official market and we also see a convergence between the parallel and official rate, he told reporters Monday after meeting Zimbabwean President Emmerson Mnangagwa in the capital, Harare. Ideally, we would like to see an elimination of this gap, we would like to see one exchange rate.\n\nStill, the ZiGs 43% devaluation in September to narrow the gap between the official and unofficial rate and its inconvertibility has led citizens to favor dollars.\n\nThe ZiG traded little changed on Tuesday at 26.96 against the dollar and exchanged hands at 32 to 35 on the parallel market.\n\nThe Washington-based lender said it isnt pushing for more exchange rate depreciation but for the two rates to converge supported by government fiscal discipline.\n\nThere is a good chance that these rates will converge, Maliszewski said.\n\nFinance Minister Mthuli Ncube last month at the annual meetings of the African Development Bank said he expected the SMP to be finalized by the end of June. The program would bring Zimbabwe closer toward revamping its $21 billion debt pile with creditors that want assurances that its authorities are pursuing prudent fiscal and monetary policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171626/zig-6.jpg",
            "description": "<p>Bloomberg The International Monetary Fund said it would like to see the ZiG “fully becoming a national currency,” as it weighs whether to place Zimbabwe on a staff-monitored program. The ZiG, short for Zimbabwe Gold, succeeded the Zimbabwean dollar in April 2024 after multiple crashes. It’s the country’s sixth attempt since 2009 to replace the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/imf-wants-zimbabwes-gold-backed-zig-to-become-sole-currency/\">IMF wants Zimbabwe’s gold-backed ZiG to become sole currency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "University of Zimbabwe docks salaries of striking lecturers",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-docks-salaries-of-striking-lecturers/",
            "content": "By Darlington Gatsi\n\nTHE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution.\n\nThe lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwes soaring cost of living.\n\nWhile UZ has remained silent on the strike, it has retaliated by withholding salaries from the defiant lecturers, who are steadfast in their demand for a return to pre-2018 wages of US$2,250 per month for junior staff  up from the current US$230.\n\nObvious Vengeyi, spokesperson for the Association of University Teachers (AUT), condemned the salary deductions as an attempt to force an end to the strike.\n\nOf course, it is an act of trying to force our members to return to work for the US$230 they initially rejected. Its a way of arm-twisting certain members of our community to resume teaching.\n\nMany here who have not been paid have resolved that, whether they receive the US$230 or not, they will not return. The majority of us have not been paid  yes. But we remain committed. Until junior lecturers get US$2,250, we will not go back to class, said Vengeyi.\n\nThe universitys latest move follows its hiring of adjunct lecturers last month to fill gaps left by the striking staff.\n\nHowever, the AUT has dismissed this as futile, claiming most replacements lack the qualifications to teach at a university level.\n\nThere is no teaching happening at the university. No supervision is taking place. A few scabs have been hired to replace sort of  the lecturers on strike, said Vengeyi further.\n\nThe prolonged strike has disrupted examinations, with planned sittings facing further delays, potentially derailing the academic year.\n\nLast month, six students were arrested after staging flash protests demanding the lecturers return, signalling the growing unrest on campus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/09165523/1000639185-scaled.jpg",
            "description": "<p>By Darlington Gatsi  THE University of Zimbabwe (UZ) has withheld the salaries of striking lecturers as turmoil continues at the institution. The lecturers have now reached 58 days of industrial action, demanding a salary increase that aligns with Zimbabwe’s soaring cost of living. While UZ has remained silent on the strike, it has retaliated by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-docks-salaries-of-striking-lecturers/\">University of Zimbabwe docks salaries of striking lecturers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "Fame doesn’t shake me! – Ex-Mommy Club star Nunurai",
            "url": "https://www.newzimbabwe.com/fame-doesnt-shake-me-ex-mommy-club-star-nunurai/",
            "content": "Daily Sun\n\nNUNURAI Mudarikwa left a lasting impression on fans during her stint in The Mommy Club.\n\nThe show, celebrated for its bold and outspoken cast, quickly became a Mzansi favourite.\n\nKnown for speaking her mind, Nunurai quickly gained attention and fame for her candid approach and unfiltered opinions.\n\nWhile some viewers praised her honesty and confidence, others were more critical.\n\nStill, her presence on the show made her one of its most talked-about personalities.\n\nDespite the attention and growing fan base, Nunurai says fame has never gone to her head.\n\nSometimes, fame is overwhelming, but its nothing I cant handle.\n\nI dont consider myself a full-blown celebrity, she told Daily Sun.\n\nThe Zimbabwean-born, South African-based businesswoman insists that the world of fame hasnt changed who she is.\n\nIve always been grounded. I know who I am and what I stand for.\n\nAlthough her time in The Mommy Club put her in the public eye, Nunurai has no plans to continue with TV, for now.\n\nI dont think youll be seeing more of me on TV anytime soon.\n\nNunurai shared what shes been up to since stepping away from the cameras.\n\nIve been focused on my business. Outside of The Mommy Club, Im a full-blown businesswoman.\n\nI literally work 12-hour days  Im all about building and growing my brand, she said.\n\nNunurai stated that she is fully dedicated to her entrepreneurial pursuits.\n\nShe says the hustle keeps her grounded and fulfilled.\n\nI love what I do, and for now, thats where my energy is going.\n\nDespite fame, Nunurai remains focused, driven, and unapologetically on and off the screen.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10195652/nunurai.jpeg",
            "description": "<p>Daily Sun NUNURAI Mudarikwa left a lasting impression on fans during her stint in The Mommy Club. The show, celebrated for its bold and outspoken cast, quickly became a Mzansi favourite. Known for speaking her mind, Nunurai quickly gained attention and fame for her candid approach and unfiltered opinions. While some viewers praised her honesty</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fame-doesnt-shake-me-ex-mommy-club-star-nunurai/\">Fame doesn’t shake me! – Ex-Mommy Club star Nunurai</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "ZACC arrests three Rusape town council officials",
            "url": "https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/",
            "content": "By Staff Reporter\n\nThe Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers.\n\nThe three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former Council Engineer.\n\nThe trio is charged with violating Section 174 of the Criminal Law (Codification and Reform) Act [Chapter 9:23] after unlawfully reviving and processing a rejected application from Texas Energy Pvt Ltd for a solar power plant in Tsanzaguru.\n\nIn 2018, Texas Energy Pvt Ltd proposed developing a solar power plant in Tsanzaguru, Rusape, but the Ministry of Local Government rejected the proposal due to insufficient land and existing residential zoning.\n\nBetween September and December 2022, the accused unlawfully revived and reprocessed the previously rejected application without adhering to required legal procedures.\n\nOn 28 December 2022, Togarepi Nerwande illegally signed a 99-year lease with Texas Energy, misrepresenting the land as open space suitable for development, despite its designation for residential use.\n\nThe accused deliberately bypassed statutory procedures, including public notification and ministerial approval required for land-use changes, reads ZACCs statement.\n\nThe three appeared at the Mutare Magistrate Court on Tuesday for their initial remand.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/22055656/arrested-handcuffed-e1667358262642.jpeg",
            "description": "<p>By Staff Reporter The Zimbabwe Anti-Corruption Commission (ZACC) has arrested three officials from Rusape Town Council on allegations of criminal abuse of duty as public officers. The three are Togarepi Nerwande, Director of Human Capital & Administration and Acting Town Secretary; Morris Tekwa, Director of Housing, Health and Community Services; and Arnold Mandizvidza Kutoka, former</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zacc-arrests-three-rusape-town-council-officials/\">ZACC arrests three Rusape town council officials</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jun 2025"
        },
        {
            "title": "‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners",
            "url": "https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/",
            "content": "TimesLive\n\nPA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzis accusations that he has abandoned his cause to fight against illegal immigrants.\n\nLonzi claimed McKenzie has not proposed any legislation on the subject, despite his partys stance on the issue.\n\nThe PA does not care about illegal foreigners, Lonzi said. Never let them lie to you. Its leader McKenzie is now a minister. He has never proposed legislation on the subject, not even a private members bill as an MP. He is just enjoying blue lights.\n\nMcKenzie swiftly responded to Lonzis accusations, asking, Uthini wena Temu Ndlozi? (What are you saying Ndlozi from Temu?). Start by telling us, do you even care?\n\nLonzi, however, was unfazed and accused McKenzie of avoiding parliamentary committee meetings. You must stop running away from parliament committee meetings. I will take you to the cleaners.\n\nThe debate stems from social media users concerns about McKenzies perceived change of attitude towards illegal foreigners.\n\nHowever, McKenzie has always reaffirmed his stance against illegal immigration, saying his partys mission remains unchanged.\n\nI speak up forAbahambe[they must leave] in closed government meetings and PA rallies. I have and will never change my stance regarding the mass deportation of all illegal foreigners but to expect me to only speak about immigration when there is a home affairs minister is wrong.Abahambeis our mission as the PA. We have and will never change. We have taken a decision to fight from within the GNU.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/10182059/gayton-eff-lonzi.jpg",
            "description": "<p>TimesLive PA leader and sport, arts and culture minister Gayton McKenzie has responded to EFF student command leader Sihle Lonzi’s accusations that he has abandoned his cause to fight against illegal immigrants. Lonzi claimed McKenzie has not proposed any legislation on the subject, despite his party’s stance on the issue. “The PA does not care</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uthini-wena-temu-ndlozi-mckenzie-clashes-with-effs-sihle-lonzi-over-illegal-foreigners/\">‘Uthini wena Temu Ndlozi?’: McKenzie clashes with EFF’s Sihle Lonzi over illegal foreigners</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:46",
            "date": "11 Jun 2025"
        }
    ]
}