{
    "news": [
        {
            "title": "Nakamba relishing AFCON after captaining Zimbabwe to first win in over a year",
            "url": "https://www.newzimbabwe.com/nakamba-relishing-afcon-after-captaining-zimbabwe-to-first-win-in-over-a-year/",
            "content": "Luton Town\n\nLutonmidfielder Marvelous Nakamba captainedZimbabweto their first win in over 12 months as they defeatedQatar2-1 in a friendly in Doha on Monday night.\n\nThe Warriors, who currently sit 129th in the FIFA rankings, went into the contest against their 52nd-placed hosts, having not triumphed in their 11 previous matches, as they suffered three defeats in their World Cup qualifiers to Benin, Rwanda and Lesotho, drawing the other three group stage fixtures against Benin, Nigeria and South Africa as they finished bottom in the table.\n\nZimbabwe also lost two out of three friendlies to Burkina Faso and Algeria, with a 1-1 draw against Nigeria, as last year, they were beaten by Cameroon and drew with Kenya in the Africa Cup of Nations qualifying matches, meaning their last victory was a 3-1 success over Namibia on October 14, a match in which Nakamba was an unused substitute.\n\nThe former Aston Villa midfielder played five games in that time, as having been overlooked for the 3-1 friendly defeat against Algeria on Thursday, returned to the starting line-up against Qatar to win his 32nd cap. The hosts, under recently appointed manager Romanian Marian Marinica, who replaced Michael Nees a few weeks ago, fell behind when Mohamed Gouda scored on just nine minutes.\n\nHowever, Munashe Garananga equalised midway through the first half, with Belgian Pro League club Mechelen winger Bill Antonio grabbing a winner on 74 minutes to seal a long-awaited triumph. Writing on Instagram, then looking ahead to the Africa Cup of Nations which sees Zimbabwe take on Angola, Egypt and South Africa in Group B, the competition starting on December 21, with the first game against Egypt on Saturday, December 22, Nakamba believes the victory was a huge momentum going into the tournament.\n\nHe said: A BIG THANK YOU to all Zimbabweans who were rallying behind us back from home, all over the world and those in Qatar, Saudi Arabia who came out in numbers to support us during the international friendly matches. Without you, we feel incomplete. Thank you to the ZIFA leadership, led by the Zifa president Nqobile Magwizi for organising such kind of international friendlies matches. Thank you to the Minister of Tourism, Honourable Barbara Rwodzi, who took time to visit the team in camp and to watch us play against Algeria in Saudi Arabia on Thursday, even though we disappointingly lost that match 3-1.\n\nLastly, I want to thank the corporate world and all football stakeholders, we dearly need your support in everything we do, kindly chip in, help and support us. The victory against Qatar brings confidence and renewed zeal within the squad, especially with just a few weeks left before the prestigious AFCON tournament. As players, we always play with our hearts out, I believe with your support and if we all pull in one direction, we will get it right. This is the moment we need your support the most. Thank you, Zimbabweans.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/11/04153736/nAKAMBA.jpg",
            "description": "<p>Luton Town Luton midfielder Marvelous Nakamba captained Zimbabwe to their first win in over 12 months as they defeated Qatar 2-1 in a friendly in Doha on Monday night. The Warriors, who currently sit 129th in the FIFA rankings, went into the contest against their 52nd-placed hosts, having not triumphed in their 11 previous matches, as they suffered three defeats</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nakamba-relishing-afcon-after-captaining-zimbabwe-to-first-win-in-over-a-year/\">Nakamba relishing AFCON after captaining Zimbabwe to first win in over a year</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "20 Nov 2025"
        },
        {
            "title": "Leaked letter to ZACC accuses High Court judge, top lawyer Thabani Mpofu of conflict of interest",
            "url": "https://www.newzimbabwe.com/leaked-letter-to-zacc-accuses-high-court-judge-top-lawyer-thabani-mpofu-of-conflict-of-interest/",
            "content": "By Staff Reporter\n\nHigh Court judge Priscilla Munangati-Manongwa and prominent lawyer Advocate Thabani Mpofu have been drawn into controversy after an anonymous whistle-blower accused them of a conflict of interest in a leaked letter seen by NewZimbabwe.com.\n\nThe letter, addressed to the Zimbabwe Anti-Corruption Commission (ZACC) and copied to the Judicial Service Commission, claims the alleged personal and professional links of the two compromise judicial impartiality.\n\nThe author, who says they are writing anonymously for fear of victimisation, alleges that Advocate Mpofu continues to take instructions from Munangati and Associates, a law firm they say still bears the judges name.\n\nI write to raise my concern over a serious conflict of interest between the above-mentioned court officials.\n\nDespite having a brother who works at Munangati and Associates, where I believe the Honourable Judge still has interests as her name still appears at the law firm, Advocate Mpofu takes instructions from the law firm and appears before Justice Munangati in those matters.\n\nThe whistle-blower argues that this arrangement is highly undesirable and grossly unfair to other litigants who will be in the dark about the relationship between the Honourable Judge and Advocate Mpofu.\n\nThe letter goes on to list several cases the author believes demonstrate the alleged conflict. Among them is HC 2312/24  Collin Zondai Makoni vs The State, which the writer says came [before] Justice Munangati despite the fact that it was from her law firm, involving lawyers Skumbuzo Mpofu and Skyvaine Vongai Tendere. This matter is pending decision pronouncement, the letter notes.\n\nThe whistle-blower also cites Thelma Chimbanga vs L Gono Enterprises (HC 1518/24), which they say was heard by the same judge despite originating from the same law firm, and is still awaiting a set down.\n\nAnother flagged case is Blue Star Logistics vs Harare Motorways (HC 8108/24), where Thabani Mpofu is representing the Applicant, with the author adding: I believe this anomaly is being overlooked since Thabani Mpofu and Webster Chiikwanha are the best of friends.\n\nThe author insists that Justice Munangati Manongwa should not hear any matters instructed to Advocate Mpofu by Munangati and Associates legal practitioners, urging ZACC to intervene because these allegations, which are very serious in nature be investigated so as to avoid prejudice to other litigants.\n\nThe writer further notes that this is not their first complaint to ZACC: Kindly note that I once wrote to your good office again on the 24th of June 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/12/27222834/Thabani-Mpofu1.jpg",
            "description": "<p>By Staff Reporter High Court judge Priscilla Munangati-Manongwa and prominent lawyer Advocate Thabani Mpofu have been drawn into controversy after an anonymous whistle-blower accused them of a conflict of interest in a leaked letter seen by NewZimbabwe.com. The letter, addressed to the Zimbabwe Anti-Corruption Commission (ZACC) and copied to the Judicial Service Commission, claims the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/leaked-letter-to-zacc-accuses-high-court-judge-top-lawyer-thabani-mpofu-of-conflict-of-interest/\">Leaked letter to ZACC accuses High Court judge, top lawyer Thabani Mpofu of conflict of interest</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe strengthens integrated cancer services to improve women’s health",
            "url": "https://www.newzimbabwe.com/zimbabwe-strengthens-integrated-cancer-services-to-improve-womens-health/",
            "content": "WHO\n\nZimbabwe is intensifying efforts to improve the prevention, early detection and treatment of breast and cervical cancers by integrating cancer and chronic disease services into primary health care. This approach aims to bring essential health services closer to communities and ensure women have equitable access to quality care.\n\nCervical cancer accounts for almost 41% of all cancers among women in the country, followed by breast cancer at 13%, according to Zimbabwes National Cancer Registry. To address the burden, the Ministry of Health and Child Care (MoHCC), with support from the World Health Organisation (WHO) and partners, is implementing measures to strengthen integrated cancer services across the health system.\n\nIn July 2025, WHO handed over medical equipment worth US$20,000 to the MoHCC to support service delivery at the primary health level. The specialised equipment can be used to screen for noncommunicable diseases, including diabetes and hypertension.\n\nBuilding on this support, the MoHCC and WHO held training-of-trainers sessions in August 2025 for health professionals from Mashonaland West and Matabeleland South provinces.\n\nMany cancers are preventable. Let us spread the word and let all women know about it, says Esther Ngaru, one of the trainees and reproductive health officers at MOHCC.\n\nTwenty-five health professionals were trained on integrating the management of breast and cervical cancers, mental health and chronic diseases, as well as coordinated provision of prevention, screening, diagnosis, treatment and care services.\n\nThe trainers are disseminating this knowledge to frontline health workers to strengthen prevention, screening, and treatment at the community level.\n\nThanks to this training, our screening will be more effective than ever, says Audrey Musorowembudzi, a nurse at Hurungwe Rural Health Centre. At my facility, I will share this knowledge with my colleagues so that no woman is left behind.\n\nIn Karoi, a town in Mashonaland West Province, seven primary health care nurses and village health workers have already benefited from these trainings.\n\nVillage health worker Angeline Mukusa from Chigumbura Village says she will use the lessons learned to raise awareness in her community. Cancer is a major concern where I live, she says. I will encourage early detection and HPV vaccination for girls. Cancer is treatable if detected early and this will save many lives.\n\nAccording to the districts medical officer Dr Munyaradzi Chidaushe this approach is already improving service delivery. This work is transformative. Village health workers can identify and refer women suspected of breast or cervical cancer more easily. Prevention is key to protecting communities, he says.\n\nThese activities are part of the Womens Integrated Care for Cancer Services (WICS) project, led by the WHO Regional Office for Africa with support from Roche. Implemented in Cte dIvoire, Kenya and Zimbabwe, the project aims to strengthen integrated breast and cervical cancer services within primary health care. Zimbabwe was selected because its established cervical cancer programme provides a foundation for integrating additional services for cancer and chronic diseases.\n\nThrough the commitment of health workers, the leadership of MOHCC, and the support of WHO and partners, Zimbabwe is taking a decisive step towards reducing the burden of breast and cervical cancer, says Dr Desta Tiruneh WHO Representative in Zimbabwe. These efforts bring the country closer to a future where no woman dies from a preventable or treatable cancer and where health systems truly serve communities with equity and compassion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/19142432/cancer-screening-zim.jpg",
            "description": "<p>WHO Zimbabwe is intensifying efforts to improve the prevention, early detection and treatment of breast and cervical cancers by integrating cancer and chronic disease services into primary health care. This approach aims to bring essential health services closer to communities and ensure women have equitable access to quality care. Cervical cancer accounts for almost 41%</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-strengthens-integrated-cancer-services-to-improve-womens-health/\">Zimbabwe strengthens integrated cancer services to improve women’s health</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "20 Nov 2025"
        },
        {
            "title": "Zimbabwe’s inflation drops, but debt management remains key",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/",
            "content": "Forbes Africa\n\nThe Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025.\n\nZimbabwes economy hasbeenimpactedbysevere inflation since the early 2000s, but officialsmaybebreathing a sigh of relieffollowinga recentConfederation of Zimbabwe Industries (CZI) report, which showed inflation to have droppedfrom82.7% in September to 32.7% in October.\n\nThe future appears brighter with inflation projected to fall to between 15% and 20% by the end of the year, marking a significant recovery from 2020, when inflation soared past 500%,amid the pandemic.\n\nIntroduced by the Reserve Bank of Zimbabwe (RBZ) in April 2024, the rising valuation ofZiG, pegged to foreign currency and precious metals, primarily gold, has beenaleading protagonist behind Zimbabwes economic resurgence.\n\nAccording to theInternational Monetary Fund, the nations current GDP is $53.31 billionup $13.35 billion from 2020.\n\nHowever, despitetheimpactof theZiG, expertsseem to becautiousofa recurring theme of volatility.\n\nThe outlook for the ZiG has improved over the near term, supported by elevated gold prices. However, it still has a long way to go before it becomes the sole legal tender for Zimbabwe, says Lyle Begbie, an economist at Oxford Economics Africa.\n\nZimbabwes history of hyperinflation and failed monetary experiments means itremainshighly dollarized. The U.S.dollar is the main medium of exchange, while the share ofZiGin monetary aggregates is small at around 17%. Prices are rarely quoted inZiG, and salaries and goods and services transactions are typically either fully or partially paid in U.S.dollars.\n\nWhile stabilizing inflation is undoubtedly positive, the landlocked nationwill need to remain steadfastregardingother challenges,before unlocking national sovereignty. Zimbabwes public debt, which reached $23.2 billion in 2024 (72.9% of GDP),per the World Bank,remainsa discouraging barrier to foreign investment.\n\nZimbabwes debt arrearssubstantially weighon its economic growth outlook, Begbie explains, before adding, Due to these arrears, the country cannot access concessional funding from multilateralorganizations, andis excluded from obtaining any sort of debt relief.\n\nThe World Bank has placed Zimbabwe in non-accrual status since 2000. Whilemassivedebtrisks stallingmomentum, addressing inflationwillput thatsummitwithin reach.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Forbes Africa The Zimbabwe Gold (ZiG) experiment seems to be proving its worth with the nation set to see a major boost by the end of 2025. Zimbabwe’s economy has been impacted by severe inflation since the early 2000s, but officials may be breathing a sigh of relief following a recent Confederation of Zimbabwe Industries (CZI) report, which showed inflation to have dropped from 82.7% in September</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-drops-but-debt-management-remains-key/\">Zimbabwe’s inflation drops, but debt management remains key</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:41",
            "date": "20 Nov 2025"
        }
    ]
}