{
    "news": [
        {
            "title": "Public transporters in ‘rain-induced’ bus fare hikes; passengers complain of unfair treatment",
            "url": "https://www.newzimbabwe.com/public-transporters-in-rain-induced-bus-fare-hikes-passengers-complain-of-unfair-treatment/",
            "content": "By Staff Reporter\n\nTHE incessant rains witnessed across the country have triggered unilateral increases in bus fares by public transporters, particularly in urban areas.\n\nIn some instances, commuters are being asked to fork out US$1 up from US$0.50c for short routes of less than 10 kilometres.\n\nFor routes such as Harare central business district to Chitungwiza, Glen View, Budiriro, Hopley, Norton, Hatcliffe, Mabvuku and Domboshava and other outlying areas where commuters pay an average of US$1, when it rains bus conductors demand US$3 per person.\n\nWhile the rains signal good tidings for everyone because they bring bountiful harvests, they are a bad omen for commuting urbanites who bear the brunt of unilateral fare hikes, said Hillary Zvoushe of Harare.\n\nAnother commuter, Ashleigh Shoriwa of St Marys in Chitungwiza raised concern over the increases in fares when it rains.\n\nCongestion during peak hours, and lately the rains are motivating the rank marshalls, conniving with conductors, to raise the fares willy-nilly. It is take-it-or-leave it, said Shoriwa.\n\nAfter a long tiring day at work, you wouldnt want to be standing at the congested ranks risking being robbed and unsure when you will get home to your children.\n\nYou end up paying whatever amount, US$1 or US$2 for a trip that normally costs half that fare, she added.\n\nA commuter omnibus conductor, Munyaradzi Chogugudza said kombi crews take advantage of the rain season to increase daily takings.\n\nIt is time for us to cash in on the rains. We give the vehicle owner the agreed daily target, say US$40, and we pocket the difference from hiked faresevery dog has its day, chuckled Chogugudza, who plies the Hatcliffe route.\n\nThe Passengers Association of Zimbabwe (PAZ) told NewZimbabwe.com that its members had raised concerns over the unexplained fare hikes.\n\nAs the rainy season persists, the PAZ continues to receive complaints about exorbitant fares charged by transport operators, said PAZ president, Tafadzwa Goliath.\n\nDue to the rains, the poor state of roads has created a situation where passengers are being taken advantage of.\n\nPassengers are being charged excessive fares for short distances, supposedly due to the poor road conditions. Some roads, although trafficable, are being used as an excuse to inflate fares.\n\nPAZ is demanding fair bus fares pricing and transparency.\n\nTransport operators must charge fares that reflect the actual distance travelled and the conditions of roads.\n\nOperators should clearly display their fare structures and provide explanations for any price increases.\n\nGoliath said relevant authorities must intervene and regulate fares and ensure that passengers are not exploited.\n\nTogether, we can fight for fair and affordable transportation, said the PAZ president.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10145359/Kombi.jpg",
            "description": "<p>By Staff Reporter THE incessant rains witnessed across the country have triggered unilateral increases in bus fares by public transporters, particularly in urban areas. In some instances, commuters are being asked to fork out US$1 up from US$0.50c for short routes of less than 10 kilometres. For routes such as Harare central business district to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/public-transporters-in-rain-induced-bus-fare-hikes-passengers-complain-of-unfair-treatment/\">Public transporters in ‘rain-induced’ bus fare hikes; passengers complain of unfair treatment </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "“Flush out illegal Zimbabwean immigrants’ children from our schools”— says Mashaba, alleges they overstretch resources in South Africa’s education sector",
            "url": "https://www.newzimbabwe.com/flush-out-illegal-zimbabwean-immigrants-children-from-our-schools-says-mashaba-alleges-they-overstretch-resources-in-south-africas-education-sector/",
            "content": "By Staff Reporter\n\nSOUTH African opposition leader, Herman Mashaba has condemned his governments directive to allow children of undocumented foreigners, including Zimbabweans, to attend schools in that country.\n\nFor the 2025 academic year, South Africas Department of Basic Education (DBE) ordered schools to admit all learners, regardless of their documentation status.\n\nAccording to the memo, those set to benefit include students who fail to provide identification for the countrys matric years and undocumented foreign pupils.\n\nA significant portion of these children are Zimbabweans, often trafficked across the border to parents working illegally in South Africa.\n\nMashaba, who leads Action SA, said had he been in authority he would not allow any undocumented individual or learner to benefit from South Africas already strained resources.\n\nHe was speaking on South Africas national broadcaster SABC.\n\nWe live in a country where a huge percentage of our public schools particularly in poor areas are dilapidated, in an environment where we do not have teachers, where our education system is dire, said Mashaba.\n\nHe said governments decision to allow children of undocumented immigrants to learn without proper documentation encourages more unregistered learners from various countries to come for subsidised education.\n\nThis is because South Africa now seems to be a country where you do not need passports or VISAs, they just have to walk through our porous borders. Our sovereignty is not there anymore.\n\nAn unquantifiable number of Zimbabweans work in South Africa illegally.\n\nThey were forced to brave trekking down south, passing through a crocodile-infested Limpopo river, by Zimbabwes continuously worsening economy that has destroyed hopes of finding jobs.\n\nZimbabweans form a unit of foreigners that include Mozambicans, Malawians and Somalis, which has over the past decades fallen victim to xenophobic vigilante groups chasing them out of South Africa. This includes the infamous Dudula militia.\n\nAdded Mashaba: I do not understand the logic behind this. The people who made this decision want to make sure that South Africans are as poor as possible.\n\nWe know our neighbouring countries are dysfunctional as a result of South Africa also not assisting but we are making matters worse.\n\nI am not sure who they are trying to satisfy. If I had my way, there was no way we would allow anyone without documentation in our country.\n\nAllowing them to use services when we cannot afford them for our own people (does not make sense). You even find in some schools children numbering 90 in a class.\n\nThis is not the first time a senior official has questioned the use of public resources by illegal immigrants in the rainbow nation.\n\nIn 2022, a health official, Phophi Ramathuba, was recorded chastising a Zimbabwean woman who had travelled to South Africa for medical attention after being involved in a car accident.\n\nYou are killing my health system, is what Ramathuba told the woman on video.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/12041618/Herman-Mashaba-jpg.webp",
            "description": "<p>By Staff Reporter SOUTH African opposition leader, Herman Mashaba has condemned his government’s directive to allow children of undocumented foreigners, including Zimbabweans, to attend schools in that country. For the 2025 academic year, South Africa’s Department of Basic Education (DBE) ordered schools to admit all learners, regardless of their documentation status. According to the memo,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/flush-out-illegal-zimbabwean-immigrants-children-from-our-schools-says-mashaba-alleges-they-overstretch-resources-in-south-africas-education-sector/\">“Flush out illegal Zimbabwean immigrants’ children from our schools”— says Mashaba, alleges they overstretch resources in South Africa’s education sector</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Father chops off teenage son’s head; Murder suspect had just returned from church shrine— Police",
            "url": "https://www.newzimbabwe.com/father-chops-off-teenage-sons-head-murder-suspect-had-just-returned-from-church-shrine-police/",
            "content": "By Staff Reporter\n\nIN a gory murder that has shaken the Buhera community of Manicaland province, a 32-year-old man hacked off his teenage sons head using an axe during an unprovoked attack.\n\nAs if the dismemberment wasnt enough, the assailant repeatedly struck the victim all over his body resulting in instant death.\n\nZimbabwe Republic Police (ZRP) confirmed the arrest of suspect, Tawanda Magoso (32) of Daakoni village, Buhera.\n\nThe ZRP reports that Tawanda Magoso (32) was arrested in connection with a case of murder which occurred at his house in Daakoni Village, Buhera on January 10, 2025, in which his son, Taonga Magoso (11) died, said ZRP national spokesperson, Commissioner Paul Nyathi.\n\nThe suspect allegedly returned home from a shrine where he had gone for prayers and took an axe from his bedroom which he used to strike the victim indiscriminately all over the body.\n\nThe victims head separated from its torso and sustained multiple injuries on the back. Resultantly, the victim succumbed to the injuries, Nyathi added.\n\nThe suspect was later apprehended with the help of members of the community and handed over to police.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Staff Reporter  IN a gory murder that has shaken the Buhera community of Manicaland province, a 32-year-old man hacked off his teenage son’s head using an axe during an unprovoked attack. As if the dismemberment wasn’t enough, the assailant repeatedly struck the victim all over his body resulting in instant death. Zimbabwe Republic Police</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/father-chops-off-teenage-sons-head-murder-suspect-had-just-returned-from-church-shrine-police/\">Father chops off teenage son’s head; Murder suspect had just returned from church shrine— Police </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Government publishes ‘dubious’ list of Mbare Musika Market beneficiaries replete with duplicated names of fire victims",
            "url": "https://www.newzimbabwe.com/government-publishes-dubious-list-of-mbare-musika-market-beneficiaries-replete-with-duplicated-names-of-fire-victims/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwas administration is in the eye of a storm following the recent publication of a dubious list of would-be beneficiaries of the rehabilitated Mbare Musika Market in Harare.\n\nThe list, which was flighted in a local newspaper, is questionable as it bears duplicated names of those set to get vending spaces at the rehabilitated Mbare Musika while other awkward-sounding names have found room on the beneficiaries roll.\n\nThe release of names of beneficiaries earmarked to take up space at the popular fruit and vegetable market follows completion of reconstruction in the aftermath of a devastating fire that razed infrastructure and wares, last year.\n\nBoth farmers and vendors suffered losses of huge proportions prompting government to intervene to restore affected livelihoods.\n\nGovernments list contains names such as Clemence Azngwe (782), Clemence Anzangwe (783), Collen Hoetl (797), Collen Hotel (798), Collen Hotera (799) and Brighton Kusikwenyu (430) and Brighton Kusikwenyi (431).\n\nMore questionable duplications such as two entries for Concillia Madzime which are followed by a Concillia Madzima (808), Clara Manzvimbo (774) and Clara Nzvimbo (775) have been highlighted.\n\nSocial media users, who have been sharing images of the list published in a local state paper, say it is a reflection of how electoral body, Zimbabwe Electoral Commission (ZEC), handled the voters roll in the 2023 polls whose results were later disputed.\n\nSomeone downloaded a ZEC version 2.0, said a user identified as Constantine of Matobo in response to a post by Crime Watch Zimbabwe on the matter.\n\nMore commented dismissing the dubious beneficiaries list.\n\nWe saw this on the voters roll and thought we could do anything. Is it high time tabvuma? said another.\n\nZEC released a voters roll riddled with mistakes, which it said it would correct headed into Zimbabwes 2023 general elections whose results were heavily contested.\n\nThe electoral body was accused of rigging the plebiscites in favour of incumbent President Emmerson Mnangagwa and his Zanu PF party.\n\nI can bet my last dollar that there is noone called Clayposy Kamwaya in Zimbabwe, said one Dzvovani.\n\nAccording to a notice, those with queries can present them on or before the 19th of January.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/09132158/Mbare-9.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa’s administration is in the eye of a storm following the recent publication of a dubious list of would-be beneficiaries of the rehabilitated Mbare Musika Market in Harare. The list, which was flighted in a local newspaper, is questionable as it bears duplicated names of those set to get vending</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/government-publishes-dubious-list-of-mbare-musika-market-beneficiaries-replete-with-duplicated-names-of-fire-victims/\">Government publishes ‘dubious’ list of Mbare Musika Market beneficiaries replete with duplicated names of fire victims</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "New Year Reflections: Embracing Forgiveness and Faith for a Fresh Start",
            "url": "https://www.newzimbabwe.com/new-year-reflections-embracing-forgiveness-and-faith-for-a-fresh-start/",
            "content": "As we reflect on the past year, we give thanks to God for His faithfulness and goodness. Despite the challenges and trials we faced, God remained steadfast and true. In Psalm 100:5, were reminded that His love endures forever, and His faithfulness continues to all generations.\n\nAs we step into this new year, 2025, were filled with hope and promise. God has great plans for us, plans to prosper us and not to harm us, plans to give us hope and a future (Jeremiah 29:11). However, we must remain committed to seeking Him and following His ways.\n\nIn Hebrews 12:2, were encouraged to fix our eyes on Jesus, the author and perfecter of our faith. As we navigate the ups and downs of life, we must cling to Christ, trusting in His power and wisdom to guide us. Those who cling to Him will triumph, regardless of the challenges they face (Romans 8:37).\n\nAs we begin this new year, lets remember to leave the grudges and bitterness of the past behind. In Matthew 6:14-15, Jesus teaches us that if we dont forgive others, our Father in heaven wont forgive us. Lets choose to forgive those who have wronged us and start the new year with a clean slate.\n\nIn addition to forgiveness, lets prioritize prayer, worship, and service to others in this new year. Lets seek to deepen our relationship with God, to love and serve our neighbours, and to shine His light in a world that desperately needs it.\n\nAs we embark on this new journey, lets pray:\n\nDear Heavenly Father,\n\nWe come before You with gratitude and hope, thanking You for the gift of a new year. Help us to fix our eyes on Jesus, to cling to Him in times of joy and sorrow, and to trust in His power and wisdom to guide us. Give us the courage to forgive those who have wronged us and the strength to serve You and others with love and humility. May Your Spirit empower us to shine Your light in the world and to bring glory to Your name.\n\nIn Jesus name, we pray.\n\nAMEN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/16093245/IMG-20240616-WA0009.jpg",
            "description": "<p>As we reflect on the past year, we give thanks to God for His faithfulness and goodness. Despite the challenges and trials we faced, God remained steadfast and true. In Psalm 100:5, we’re reminded that “His love endures forever, and His faithfulness continues to all generations.” As we step into this new year, 2025, we’re</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-year-reflections-embracing-forgiveness-and-faith-for-a-fresh-start/\">New Year Reflections: Embracing Forgiveness and Faith for a Fresh Start</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Los Angeles celebrities lose homes, share reactions to wildfires",
            "url": "https://www.newzimbabwe.com/los-angeles-celebrities-lose-homes-share-reactions-to-wildfires/",
            "content": "By BBC\n\nJEFF Bridges and Mel Gibson are among the celebrities who have lost homes in the deadly wildfires raging in the Los Angeles area.\n\nUS actor Bridges, who won an Oscar for Crazy Heart and stars in the TV series The Old Man, has lost his home in Malibu which he and his siblings inherited from their parents.\n\nOscar-winning film star Mel Gibson also revealed his Malibu home has been completely toasted while he was away recording Joe Rogans podcast.\n\nA series of major wind-driven fires in California have killed 11 people, ravaged communities, and sent thousands of people frantically fleeing their properties, including areas dotted with celebrity homes.\n\nThousands of structures have been destroyed as six separate blazes burn in and around the city, which is dotted with film stars mansions.\n\nWhich other celebrities have lost their homes?\n\nVentimiglia, best known for his roles in Gilmore Girls and Heroes, was filmed returning to his burnt-out home.\n\nYou start thinking about all the memories in the different parts of the house and whatnot, said Ventimiglia on CBS Evening News.\n\nThen you see your neighbours houses and everything around, and your heart just breaks.\n\nVentimiglia and his wife left their home on Tuesday and watched on security cameras as the flames took over.\n\nThe 47-year-old acknowledged that his character, Jack Pearson, in TV series This Is Us suffers from smoke inhalation after his home burns down in the hit series. Its not lost on me, life imitating art, he said.\n\nHotel heiress Hilton confirmed earlier this week she had lost her home in Malibu.\n\nIn a new Instagram post on Friday, Hilton uploaded a video of what was left of her home. The heartbreak is truly indescribable, she said. Its devastating beyond words.\n\nThis isnt just my story, she continued. So many people have lost everything. Its not just walls and roofs  its the memories that made those houses homes. Its the photos, the keepsakes, the irreplaceable pieces of our lives\n\nAnd yet, in this pain, I know Im incredibly lucky. My loved ones, my babies, and my pets are safe.\n\nHilton also thanked the fire fighters, first responders and volunteers risking their lives to fight these fires.\n\nRosie ODonnell, a former co-host for The View, also lost her home in Malibu.\n\nOn PCH (Pacific Coast Highway) in Malibu  the whole of beach front homes gone  including the one i lived in, she wrote in a post on TikTok.\n\nSome of the worst devastation was in the scenic enclave of Pacific Palisades, where a wind-whipped inferno exploded from several hundred acres to more than 15,000 in size since Tuesday.\n\nA swathe of the neighbourhood, which is a haven of hillside streets nestled against the Santa Monica Mountains and winding down to beaches along the Pacific Ocean, was reduced to ash.\n\nActor James Woods, who starred in films including Nixon and Casino, broke down in tears on CNN as he described losing his Pacific Palisades property.\n\nOne day youre swimming in the pool and the next day its all gone, he told the network.\n\nActor Billy Crystal said in a statement that he and his wife Janice were heartbroken by the loss of their Pacific Palisades home where they had lived since 1979.\n\nThe When Harry Met Sally star said in a statement: We raised our children and grandchildren here.\n\nEvery inch of our house was filled with love. Beautiful memories that cant be taken away.\n\nWe are heartbroken of course but with the love of our children and friends we will get through this.\n\nA home reportedly belonging to Adam Brody, who stars in hit Netflix show Nobody Wants This, and Gossip Girl star wife Leighton Meester, was also destroyed.\n\nJurassic World actress Daniella Pineda also lost her home, saying she escaped as the fire took over with only her dog and laptop.\n\nI have one pair of shoes to my name, she said.\n\nIm grateful to be alive. People really show up for one another when disaster hits.\n\nThe Hills stars Spencer Pratt and Heidi Montag, who are married, also lost their home in the blaze.\n\nIm watching our house burn down on the security cameras, Pratt posted.\n\nMontag said: So our house is on fire, and we were able to get out in time, but I keep going over and over in my mind of the things I shouldve got, but were out safe and that is the most important thing, and Spencer is behind me.\n\nIn a later post, she said while tearing up that she was so sad our house has gone and they had lost everything we worked so hard for.\n\nSinger and This Is Us actress Mandy Moore posted a video of the scene of destruction as she evacuated.\n\nGrateful for my family and pets getting out last night before it was too late (and endless gratitude to friends for taking us in and bringing us clothes and blankets).\n\nHonestly, Im in shock and feeling numb for all so many have lost, including my family. My childrens school is gone.\n\nOur favourite restaurants, levelled. So many friends and loved ones have lost everything too. Our community is broken but we will be here to rebuild together.\n\nTV host Ricki Lake told followers she had lost her dream home, adding: I grieve along with all of those suffering during this apocalyptic event.\n\nActors Sir Anthony Hopkins, John Goodman, Anna Faris and Cary Elwes also reportedly lost their homes.\n\nMiles Teller, best known for his role in Top Gun: Maverick, and his wife, Keleigh Sperry, reportedly lost their home in the Pacific Palisades.\n\nPosting on Instagram, Sperry shared a picture of the fires and a broken heart emoji.\n\nShe urged people to leave bowls of water for animals left behind as they evacuate their homes.\n\nOther stars forced to flee include Star Wars actor Mark Hamill and Schitts Creek actor Eugene Levy.\n\nIn a post on Instagram, Hamill called the blaze the most horrific since 1993, when 18,000 acres burned, destroying 323 homes in Malibu.\n\nHe said he had evacuated his Malibu house so last-minute there [were] small fires on both sides of the road.\n\nEugene Levy described black smoke appearing on the horizon before he evacuated.\n\nLevy described to local media black and intense smoke over Temescal Canyon.\n\nI couldnt see any flames but the smoke was very dark, he told the Los Angeles Times.\n\nJamie Lee Curtis said her home was safe but the situation was gnarly.\n\nObviously, there have been horrific fires in many places, she said. This is literally where I live. Everything the market, I shop in, the schools my kids go to. Friends  many, many, many friends  now have lost their homes.\n\nCurtis and her husband, fellow actor Christopher Guest, pledged $1m (800,000) to start a fund of support for our great city and state and the great people who live and love there.\n\nActor Cameron Mathison also shared a clip of his house reduced to smouldering ruins. We are safe. But this is whats left of our beautiful home, the General Hospital star wrote.\n\nOur home where our kids were raised and where they wanted to raise their own someday.\n\nTwo maps that show the scale of the area burnt by the Paliside wildfire by imposing the area in red on top of the centres of New York and London.\n\nLegendary songwriter Diane Warren, who composed classic hits including If I Could Turn Back Time and I Dont Want to Miss a Thing, also lost her home.\n\nShe posted a picture of the beachfront near her house, saying that the property shes had for close to three decades was gone.\n\nGrammy-nominated R&B singer and rapper Jhen Aiko took to Instagram to share that her home was burned to the ground.\n\nStarting from scratch. My heart is so heavy, she wrote with a broken heart emoji.\n\nActor Steve Guttenberg, known for Police Academy, stayed to help firefighters by moving cars to clear a path for incoming fire trucks.\n\nHe urged fellow Pacific Palisades residents to leave the keys in their abandoned cars so they could be moved.\n\nMeanwhile, the Palisades Charter High School  used in the 1976 horror classic Carrie  has been devastated.\n\nThe Oscar nominations have been postponed by two days because of the fires, and other star-studded events were also cancelled.\n\nFilm premieres for Unstoppable, Better Man and Wolfman have been called off, as has the Screen Actors Guild Awards nominations announcement.\n\nMeanwhile, a new blaze broke out on Wednesday night, the Sunset fire, in the Hollywood Hills, near where the world-famous Hollywood sign nestles in the hillside.\n\nSeveral other celebrities fled the city to escape the fires.\n\nSinger songwriter Dua Lipa revealed in a post on her Instagram stories that she fled the city and is safe.\n\nShe described the scene as absolutely devastating and scary couple of days in LA\n\nThinking of all my friends and the people of the city who had to evacuate their homes, she wrote.\n\nTake That singer, Mark Owen and his family also fled from the fires. His wife Emma Ferguson said the couple and their children and pets had to evacuate after waking up to helicopters, thick black smoke, winds howling, and that the uncertainty that our house would survive.\n\nIm not sure what our next step is. Right now, Im just heavy and tired, she said.\n\nRicki Lake had a home on the bluffs in the Palisades, where she was married three years ago and where she said she planned to grow old.\n\nOther celebrities who have lost their homes, according to reports and social media, include:John C Reilly, Cobie Smulders, John Goldman, Tina Knowles, Anthony Hopkins, Rikki Lake, Anna Faris, Jennifer Grey, Denise Crosby, Melissa Rivers, Cary Elwes, Carolyn Murphy and Sandra Lee.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/11041428/MV5BMTQwNTM0NDAwMF5BMl5BanBnXkFtZTcwNjcyMTAzNQ%40%40._V1_.jpg",
            "description": "<p>By BBC  JEFF Bridges and Mel Gibson are among the celebrities who have lost homes in the deadly wildfires raging in the Los Angeles area. US actor Bridges, who won an Oscar for Crazy Heart and stars in the TV series The Old Man, has lost his home in Malibu which he and his siblings</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/los-angeles-celebrities-lose-homes-share-reactions-to-wildfires/\">Los Angeles celebrities lose homes, share reactions to wildfires</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Bride’s fury after Instagram stunt wedding turns out to be real",
            "url": "https://www.newzimbabwe.com/brides-fury-after-instagram-stunt-wedding-turns-out-to-be-real/",
            "content": "By BBC\n\nA WOMAN in Australia has annulled her marriage after realising that a fake wedding ceremony she took part in for a social media stunt was in fact real.\n\nThe unknowing bride said her partner was a social media influencer who convinced her to take part in the ceremony as a prank for his Instagram account.\n\nShe only discovered the marriage was genuine when he tried to use it to gain permanent residency in Australia.\n\nA Melbourne judge granted the annulment after accepting the woman was tricked into getting married, in a judgement published on Thursday.\n\nThe bizarre case began in September 2023 when the woman met her partner on an online dating platform. They began seeing each other regularly in Melbourne, where they lived at the time.\n\nIn December that year, the man proposed to the woman and she accepted.\n\nTwo days later, the woman attended an event with the man in Sydney. She was told it would be a white party  where attendees would wear white-coloured clothing  and was told to pack a white dress.\n\nBut when they arrived, she was shocked and furious to find no other guests present except for her partner, a photographer, the photographers friend and a celebrant, according to her deposition quoted in court documents.\n\nSo, when I got there, and I didnt see anybody in white, I asked him, Whats happening?.\n\nAnd he pulled me aside, and he told me that hes organising a prank wedding for his social media, to be precise, Instagram, because he wants to boost his content, and wants to start monetising his Instagram page, she said.\n\nShe said she had accepted his explanation as he was a social media person who had more than 17,000 followers on Instagram. She also believed that a civil marriage would be valid only if it were held in a court.\n\nStill, she remained concerned. The woman rang a friend and voiced her worries, but the friend laughed it off and said it would be fine because, if it were real, they would have had to file a notice of intended marriage first, which they had not.\n\nReassured, the woman went through the ceremony where she and her partner exchanged wedding vows and kissed in front of a camera. She said she was happy at that time to play along to make it look real.\n\nTwo months later, her partner asked her to add him as a dependant in her application for permanent residency in Australia. Both of them are foreigners.\n\nWhen she told him she could not as they were technically not married, he then revealed that their Sydney wedding ceremony had been genuine, according to the womans testimony.\n\nThe woman later found their marriage certificate, and discovered a notice of intended marriage which had been filed the month before their Sydney trip  before they even got engaged  which she said she did not sign. According to the court documents, the signature on the notice bears little resemblance to the womans.\n\nIm furious with the fact that I didnt know that that was a real marriage, and the fact that he also lied from the beginning, and the fact that he also wanted me to add him in my application, she said.\n\nIn his deposition, the man claimed they had both agreed to these circumstances and that following his proposal the woman had agreed to marry him at an intimate ceremony in Sydney.\n\nThe judge ruled that the woman was mistaken about the nature of the ceremony performed and did not provide real consent to her participation in the marriage.\n\nShe believed she was acting. She called the event a prank. It made perfect sense for her to adopt the persona of a bride in all things at the impugned ceremony so as to enhance the credibility of the video depicting a legally valid marriage, he stated in the judgement.\n\nThe marriage was annulled October of 2024.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/05001007/Marriage.png",
            "description": "<p>By BBC  A WOMAN in Australia has annulled her marriage after realising that a fake wedding ceremony she took part in for a social media stunt was in fact real. The unknowing bride said her partner was a social media influencer who convinced her to take part in the ceremony as a “prank” for his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brides-fury-after-instagram-stunt-wedding-turns-out-to-be-real/\">Bride’s fury after Instagram stunt wedding turns out to be real</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Installation of bucket seats at National Sports Stadium almost complete",
            "url": "https://www.newzimbabwe.com/installation-of-bucket-seats-at-national-sports-stadium-almost-complete/",
            "content": "By Sport Reporter\n\nGOVERNMENT says it is now finalising the installation of bucket seats at the National Sports Stadium (NSS) to ensure the giant facility gets certified to host international games.\n\nThis was revealed by Acting President Kembo Mohadi during a media address on Friday at his Munhumutapa office.\n\nWe are having our home games played elsewhere. But what l can tell you is that we are now finalising the installation system of the bucket seats at the National Sports Stadium, said Mohadi.\n\nThe NSS was closed in 2023 for renovations after failing to meet Confederation of African Football (CAF) standards to host international matches due to lack of amenities, among other concerns.\n\nThis has forced the Warriors and all Zimbabwean clubs which participated in any CAF competition last year to host fixtures in foreign countries.\n\nBucket seats installation was amongst the top list of things required by CAF at the giant facility.\n\nOther than that, CAF also required the fitting of electronic turnstiles at the stadium, an uplift in the changing and medical area room.\n\nMohadi also added that government has embarked on a journey to renovate other dilapidated sporting facilities across the country.\n\nWe are also working on modernising other sporting facilities such as Magamba and others which are under the Ministry of Sport, he added.\n\nA report presented by the Minister of Sport, Recreation, Arts and Culture in 2024 before Parliament revealed that 90% of the countrys sporting facilities are nolonger fit for use and are in need of urgent facelifts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/04150859/A-an-ariel-view-of-the-National-Sports-Stadiums-turf-scaled.jpg",
            "description": "<p>By Sport Reporter GOVERNMENT says it is now finalising the installation of bucket seats at the National Sports Stadium (NSS) to ensure the giant facility gets certified to host international games. This was revealed by Acting President Kembo Mohadi during a media address on Friday at his Munhumutapa office. “We are having our home games</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/installation-of-bucket-seats-at-national-sports-stadium-almost-complete/\">Installation of bucket seats at National Sports Stadium almost complete </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "Boy (8) receiving trauma therapy after straying into wildlife-infested jungle where he spent five harrowing days",
            "url": "https://www.newzimbabwe.com/boy-8-receiving-trauma-therapy-after-straying-into-wildlife-infested-jungle-where-he-spent-five-harrowing-days/",
            "content": "By Staff Reporter\n\nHEROIC Tinotenda Pudu, the brave eight-year-old boy who strayed into wildlife-infested Matusadonha Game Park and spent five days wandering, is suffering trauma and needs specialist therapy.\n\nTinotenda, who wandered 49km in the game park, survived on eating wild berries known in vernacular as tsvanzva.\n\nAccording to Mashonaland West Proportional Representation MP Mutsa Murombedzi, posting on social media,Tinotenda and his mother will be temporarily moved away from their home, and be assessed by a mental health support team.\n\nToday, 08 Jan 2025, the Mashonaland West Provincial Medical Director called me with an update and had a discussion regarding Tinotendas situation.\n\nThe mental health team has visited the boy down in the Zambezi Valley and begun their assessments. It has become clear that his disappearance and harrowing ordeal and encounter with big game animals in Matusadonha Game Park, deep in the Zambezi Valley, has deeply affected not only him but also his family.\n\nAs part of their recommendations, the team has decided to temporarily move Tinotenda and his mother away from their home for a few days to provide them with a safer and calmer environment to prevent people from disturbing the recovery process, said the legislator.\n\nThe assessment team, she noted, will remain in the community for several days and also engage with school officials to prevent any discussions that could re-trigger trauma.\n\nAdditionally, the mental health team will return and be stationed in the community for not less than seven days to continue providing support and monitoring the boys and family progress.\n\nWith schools reopening soon, they will also engage the school authorities to ensure that when Tinotenda comes back to school, no interviews or discussions take place that might retraumatize him, said Murombedzi.\n\nThe mental health team still strongly advise against anyone conducting interviews at this stage as it may trigger emotional distress for the learner who is now proceeding to Grade Three.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/02163507/e3fc1860-c90a-11ef-b64d-9d290e039e0a.jpg.webp",
            "description": "<p>By Staff Reporter  HEROIC Tinotenda Pudu, the brave eight-year-old boy who strayed into wildlife-infested Matusadonha Game Park and spent five days wandering, is suffering trauma and needs specialist therapy. Tinotenda, who wandered 49km in the game park, survived on eating wild berries known in vernacular as ‘tsvanzva.’ According to Mashonaland West Proportional Representation MP Mutsa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/boy-8-receiving-trauma-therapy-after-straying-into-wildlife-infested-jungle-where-he-spent-five-harrowing-days/\">Boy (8) receiving trauma therapy after straying into wildlife-infested jungle where he spent five harrowing days</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        },
        {
            "title": "General manager suspended over suspected US$300,000 theft and fraud",
            "url": "https://www.newzimbabwe.com/general-manager-suspended-over-suspected-us300000-theft-and-fraud/",
            "content": "By Tapiwa Svondo\n\nBOTHA Mine general manager, Angela Mpofu-Chisvo has been suspended over allegations of theft and fraud that reportedly involve over US$300,000.\n\nIn a statement this week, mine authorities said Mpofu-Chisvo is alleged to have concealed transactions from the company.\n\nBotha Mine wishes to inform all stakeholders that Angela Mpofu-Chisvo is suspended from duty without pay or benefits from Botha Mine effective from the 6th of January 2025.\n\nShe is currently facing serious criminal allegations of theft and fraud involving more than $300 000.00 United States Dollars and charges related to concealing a transaction from the principal.\n\nInvestigations are underway under Bindura RRB 5874696, reads the statement\n\nThe company has taken precautionary measures, barring accused person from entering the mine and any of its premises while investigations are ongoing.\n\nBotha Mine warned that individuals, who engage with Mpofu in monetary transactions will be held liable.\n\nWe would like to emphasise that any individual or entity engaging in transactions with her will be held liable for any repercussions arising from such dealings.\n\nThe Bindura community to be specific is, therefore, warned from engaging in any monetary or any other transactions with Mrs. Mpofu on behalf of Botha Mine, reads the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/05/30184728/Fraud.jpg",
            "description": "<p>By Tapiwa Svondo  BOTHA Mine general manager, Angela Mpofu-Chisvo has been suspended over allegations of theft and fraud that reportedly involve over US$300,000. In a statement this week, mine authorities said Mpofu-Chisvo is alleged to have concealed transactions from the company. “Botha Mine wishes to inform all stakeholders that Angela Mpofu-Chisvo is suspended from duty</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/general-manager-suspended-over-suspected-us300000-theft-and-fraud/\">General manager suspended over suspected US$300,000 theft and fraud</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:37",
            "date": "12 Jan 2025"
        }
    ]
}