{
    "news": [
        {
            "title": "Zimbabwe’s farmers push on as land grab compensation flounders",
            "url": "https://www.newzimbabwe.com/zimbabwes-farmers-push-on-as-land-grab-compensation-flounders/",
            "content": "AFP\n\nIn a field of paprika plants in the heart of Zimbabwe, fourth-generation farmer Daniel Burger and relative newcomer Miriam Mupambawashe discuss the quality of the crop.\n\nBurger, 36, and Mupambawashe, 59, are neighbours and partners in efforts to revive the countrys once-flourishing agriculture sector cut down by a ruinous land reform drive in the 2000s.\n\nThe reform distributed land from the white minority, which still owned most of the best farmland 20 years after independence in 1980, to the black majority.\n\nAround 4,000 white-owned farms were confiscated, some with deadly violence.\n\nMupambawashe was among thousands who received land. Though she initially knew little about farming, her small subsistence plot now thrives.\n\nOther farms failed or were abandoned, with some new tenants unschooled in agriculture and others  including politicians who were handed land  uninterested.\n\nThere were food shortages and Zimbabwe soon required international aid.\n\nThere was a bit of a tough period through the 2000s and, unfortunately, I think it sort of refuelled racial tensions to an extent, Burger told AFP.\n\nBut being so passionate about farming was the motivator for me to move forward, he said.\n\nMupambawashe moved to the area from the southern city of Bulawayo, around 200 kilometres (125 miles) away.\n\nWhen we first came here in 2001, it was a forest and there was nothing built, she said.Some of the white farmers were angry but we managed to talk to each other in good faith and move forward.\n\nThey never let us down and said, You grabbed the farm, lets see if you can do it. But instead they brought their own tractors and equipment to come and help, which we felt was a nice gesture.\n\nIt was hard in the beginning, especially after irrigation equipment was stolen, and the early failures were embarrassing, Mupambawashe said.\n\nBut today her plot does so well that she only needs to buy in sugar and cooking oil.\n\nBurger leases land from her and lends tractors and expertise.\n\nHis familys land was among the few hundreds that were not seized in the 2000s.\n\nNonetheless, For a long time we became wound up in compensation, said Burger, vice-president of the Commercial Farmers Union of Zimbabwe (CFU) that represents mostly white farmers.\n\nBut it wasnt our purpose. Our purpose was driving agriculture and current agricultural affairs forward, he said.\n\nThis year, some farm owners whose land was confiscated received the first compensation payments after decades of waiting.\n\nThe process has been complex and divisive.\n\nThe government committed to compensation as part of an effort to settle arrears and reform the economy in order to be able to regain access to international credit lines cut two decades ago.\n\nIt announced in 2020 the creation of a fund that would pay out US$3.5 billion for infrastructure on farms but not the land, which it says was taken by force by colonial settlers.\n\nUnable to raise cash, the government in 2023 changed the offer to one percent in cash and the remainder in US dollar denominated treasury bonds.\n\nIn April, the first payments were made to 378 of 780 farmers approved for this scheme.\n\nDeon Theron, who represents the Compensation Steering Committee group of former white farmers, says the introduction of the bonds has annulled the original deal and negotiations need to start over.\n\nThe bonds are unsecured and there is limited recourse in the event of non-performance by government, he told AFP.\n\nThe general feeling amongst the farmers is firstly frustration that after 20-odd years we still have not received anything, Theron said.\n\nBut the Property and Farm Compensation Associationsaid its members would take what is on offer.\n\nThe bonds are under international guarantee, said leader Harry Orphanides, adding that digging in and seeking more from the government would be futile.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29191457/Screenshot-2025-05-29-at-20.14.21.png",
            "description": "<p>AFP In a field of paprika plants in the heart of Zimbabwe, fourth-generation farmer Daniel Burger and relative newcomer Miriam Mupambawashe discuss the quality of the crop. Burger, 36, and Mupambawashe, 59, are neighbours and partners in efforts to revive the country’s once-flourishing agriculture sector cut down by a ruinous land reform drive in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-farmers-push-on-as-land-grab-compensation-flounders/\">Zimbabwe’s farmers push on as land grab compensation flounders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        },
        {
            "title": "Treasury delists defaulting suppliers, bans pre-payment of services due to non-delivery",
            "url": "https://www.newzimbabwe.com/treasury-delists-defaulting-suppliers-bans-pre-payment-of-services-due-to-non-delivery/",
            "content": "By Anna Chibamu\n\nTREASURY says it has delisted suppliers who have failed to deliver goods and services after receiving payments.\n\nFinance Ministry Permanent Secretary George Guvamatanga said no advance payments will be made to suppliers who are contracted by the government.\n\nThe ban comes after the Auditor Generals report revealed that several goods and services paid for through Ministries, departments and agencies (MDAs) by the Treasury were not delivered.\n\nThose who have not delivered goods and services have been banned from transacting with government.\n\nWe have actually banned the advance payment from most of the goods and services that the ministries and departments and agencies do secure from various suppliers.\n\nAs we speak now, what has been delivered, who has been banned, and what remains outstanding, it was a very long list, Guvamatanga told the Public Accounts Parliamentary Committee (PAC) recently.\n\nHe added, We were shocked by what we discovered. But I think following that intervention, there is now a very marked improvement.\n\nAccording to Guvamatanga, some MDA officers were involved in the scandals involving the loss of millions of dollars by the government.\n\nAnd we did emphasise that there will be an action taken against the accounting officers in the event that they continue with this practice following the intervention of closure, added Guvamatanga.\n\nCommittee chairperson Charlton Hwende requested to have the list of those companies that defaulted on delivery.\n\nWe will provide the list. It is available, said Guvamatanga.\n\nRegarding defaulters, Guvamatanga said, Its the same companies, they change directors, they go and change directors, they get another contract, you know, and its the same players.\n\nSo when we present it for the identity of the companies, we then see the same players all over. We are now calling them, bringing them to where you must bring your bank statements. \n\nThose same people become the directors of the new company. They are then given another tender, which they flout. Three, two years later, they change the name of the company, but they remain with the same directors, Guvamatanga said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Anna Chibamu TREASURY says it has delisted suppliers who have failed to deliver goods and services after receiving payments. Finance Ministry Permanent Secretary George Guvamatanga said no advance payments will be made to suppliers who are contracted by the government. The ban comes after the Auditor General’s report revealed that several goods and services</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/treasury-delists-defaulting-suppliers-bans-pre-payment-of-services-due-to-non-delivery/\">Treasury delists defaulting suppliers, bans pre-payment of services due to non-delivery</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        },
        {
            "title": "Procurement Authority recommended jailed Chimombe, Mpofu’s company – former  Agriculture Permanent Secretary tells court",
            "url": "https://www.newzimbabwe.com/procurement-authority-recommended-jailed-chimombe-mpofus-company-former-agriculture-permanent-secretary-tells-court/",
            "content": "By Mary Taruvinga\n\nThe trial in which businessmen Mike Chimombe and Moses Mpofu are accused of swindling the state of US$7 million in a goats deal continued Thursday with former Agriculture Ministry Permanent Secretary John Basera taking to the witness stand.\n\nBasera told the High Court Justice Pisirayi Kwenda that the duos company, Blackdeck, had met all the fundamentals required by the Procurement Regulatory Authority (PRAZ) when it was selected for the Presidential Goat Scheme.\n\nBasera also said Blackdeck was the lowest bidder, adding that conflict arose when the company failed to meet its end of the bargain.\n\nWe got a no-objection letter from PRAZ, and we signed a contract with Blackdeck which was the lowest bidder, Basera said.\n\nBasera also told the court that the tender evaluation committee had confirmed that the company had met all the requirements.\n\nThe former PS, however, stated that the two had submitted forged documents for them to win the tender.\n\nHe said this came to light in 2024 when investigations against the two started.\n\nBasera also told the court that as an accounting officer for the ministry, he pointed out that the price of the goats was too much.\n\nI realised that US$7 million for 600,000 goats was exorbitant.\n\nI suggested that we had a meeting to discuss the price of each goat because their price range was between US$175 and US$250, he said.\n\nBasera said the ministry then engaged the supplier and reduced the prices to US$75  US$95 per goat, depending on the breed. Then we agreed to proceed with the deal, he said.\n\nAccording to Basera, Chimombe and Mpofu were advanced ZW$1,9 billion, which was equivalent to US$7,9 million.\n\nHe said the two then told the ministry that they had managed to mobilise 32,000 goats and they had kept them in holding pens.\n\nHe said when representatives went to confirm, they were shocked to find less than 3,000 goats in the holding pens.\n\nBasera said the ministry wanted Chimombe and Mpofu to pay back the money or supply the goats as agreed.\n\nAnother option was to call for a guarantee.\n\nHearing continues Friday with the duos lawyers cross-examining Basera.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/27173747/chimombe-1.jpeg",
            "description": "<p>By Mary Taruvinga The trial in which businessmen Mike Chimombe and  Moses Mpofu are accused of swindling the state of US$7 million in a goats deal continued Thursday with former Agriculture Ministry Permanent Secretary John Basera taking to the witness stand. Basera told the High Court Justice Pisirayi Kwenda that the duo’s company, Blackdeck, had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/procurement-authority-recommended-jailed-chimombe-mpofus-company-former-agriculture-permanent-secretary-tells-court/\">Procurement Authority recommended jailed Chimombe, Mpofu’s company – former  Agriculture Permanent Secretary tells court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        },
        {
            "title": "The new Broadcasting Services Amendment Act- a legal analysis",
            "url": "https://www.newzimbabwe.com/the-new-broadcasting-services-amendment-act-a-legal-analysis/",
            "content": "By Mlondolozi Ndlovu\n\nThe Broadcasting Services Amendment Act No.2, 2025 (Hereinafter referred to as the Act/ Amendment Act) represents a significant shift in Zimbabwes media regulation landscape.\n\nPromulgated as part of broader media law reforms, the amendment aims to align the Broadcasting Services Act [Chapter 12:06] with constitutional principles, technological advancements, and regional best practices.\n\nHowever, while the Act introduces commendable improvements, it also raises substantial concerns regarding media independence, digital rights, and regulatory integrity.\n\nOne of the most notable improvements is the formal recognition of online broadcasting services and digital platforms.\n\nThe Amendment marks an important step in modernising Zimbabwes media regulation by formally recognising internet-based broadcasting such as podcasts, streaming platforms, and social media live streams.\n\nThis is a timely and progressive reform, considering that audience habits have shifted dramatically toward digital content consumption.\n\nBy acknowledging the role of online platforms, the Amendment Act attempts to align Zimbabwes media law with 21st-century realities, where traditional radio and television are no longer the sole or even primary sources of information for many, especially the youth.\n\nThis recognition potentially creates space for digital content creators, entrepreneurial media startups, and community-driven online platforms to operate within a regulated environment. It may also encourage foreign investment and technological innovation in the media space, particularly if it enables licensing frameworks that are fair, transparent and inclusive.\n\nHowever, this alignment is not without risks. While the Act seeks to align with internet and technological developments, it went about it the wrong way by failing to provide a clear and narrow definition of what constitutes an internet broadcasting service.\n\nThis vagueness opens the door to regulatory overreach, where citizen journalists, bloggers, and even social media users could be subjected to licensing requirements meant for large-scale broadcasters.\n\nThe potential for selective enforcement is high, especially in politically sensitive periods such as elections, turning what should be for protective measure into a tool for digital censorship and surveillance.\n\nTherefore, internet-based broadcasting must be anchored in robust safeguards that ensure digital rights, freedom of expression, and non-discriminatory regulation. Without these, the modernisation risks becoming a digital leash, rather than a progressive leap forward.\n\nThe Amendment Act makes a notable attempt to diversify Zimbabwes broadcasting landscape by expanding the categories of services recognised under law.\n\nIn addition to traditional formats such as public, commercial and community broadcasting, the Act now formally includes subscription management services, internet-based broadcasting, webcasting, satellite uplinks, and datacasting services.\n\nThis is a progressive development that reflects the changing nature of global media, where convergence between telecoms, broadcasting, and digital content platforms is increasingly the norm.\n\nBy formally acknowledging these new categories, the Act opens the door for new entrants, especially in the digital and pay-TV sectors, and provides legal recognition for content distributed online.\n\nThis could stimulate competition, technological innovation and audience choice, while also giving a regulatory identity to previously grey areas of media activity such as podcasting and over-the-top services.\n\nIt is also commendable that community broadcasting remains prioritised with clearer licensing and funding support mechanisms introduced to enhance linguistic and cultural inclusion, especially in rural and underrepresented communities.\n\nThe Amendment Act makes a modest but important attempt to enhance womens representation in media governance structures. Specifically, the Act mandates that at least three of the seven BAZ Board members be women.\n\nWhile this quota signals progress, its impact will depend heavily on implementation, transparency in selection processes, and whether these appointments translate into real influence over policy decisions. Meaningful representation goes beyond numbers, it requires creating space for womens voices in content creation, regulation, and media leadership.\n\nOn the other hand, the promotion of community broadcasting services marks a potentially transformative step for inclusive media. The Act provides for a licensing framework that encourages grassroots participation, particularly by marginalised and rural communities. The Amendment Act also states that community broadcasters must predominantly use languages spoken by their target community and ensure community participation in content creation and station governance.\n\nOne of the most glaring flaws in the Amendment Act is the continued lack of institutional independence of the Broadcasting Authority of Zimbabwe (BAZ).\n\nWhile the Act claims to improve regulatory transparency and promote democratic media governance, Section 4 entrenches executive dominance by giving the President sole power to appoint all members of the BAZ Board, merely after consultation with the Minister and the Committee on Standing Rules and Orders.\n\nThis language is intentionally weak; consultation does not require agreement, rendering both the Minister and the Committee effectively powerless to influence the final appointments.\n\nIn practice, this means that the BAZ Board can be composed entirely of individuals handpicked by the executive, with no meaningful public scrutiny, parliamentary oversight, or stakeholder participation. This setup completely undermines the credibility, neutrality, and public trust that a broadcasting regulator must have in a democratic society. Instead of serving the public interest, such a board is highly vulnerable to political patronage, and its decisions especially regarding licensing, content regulation, and sanctions risk being driven by partisan interests rather than constitutional principles.\n\nThis framework violates Section 61 (3) of the Constitution which explicitly requires that broadcasting regulation be exercised by an independent body free from government or political control. By placing appointment powers squarely in the hands of the President, the Act defies the letter and spirit of this constitutional safeguard.\n\nIt also contradicts international best practices such as those outlined in the African Charter on Broadcasting (2001), which calls for the media regulator to be institutionally, functionally, and politically independent.\n\nThe dangers of this arrangement are not hypothetical. Zimbabwes broadcasting history is littered with examples of state-aligned media monopolies, selective licensing, and the exclusion of dissenting voices all enabled by a regulatory body beholden to political elites. Under this amendment, the same system is simply rebranded, not reformed.\n\nThe Act mandates that all motorists pay the ZBC radio license before obtaining vehicle insurance, regardless of whether they use ZBC services. While ostensibly intended to support public broadcasting, in reality, this measure is coercive and opaque.\n\nThe issue is the fact that ZBC is not subject to clear public accountability or independent audit regarding how the collected fees are used. Without legal guarantees of transparency in how these funds are allocated, the measure risks eroding public trust and the system will just resemble a state-sanctioned revenue scheme.\n\nMoreover, funnelling public money exclusively to ZBC an institution historically criticised for political bias, further undermines the principles of public service broadcasting.\n\nA plural funding model where revenues are distributed among a variety of public and community broadcasters could ensure broader support for media diversity and fairness.\n\nA particularly troubling aspect of this provision is the lack of clear, published criteria for obtaining an exemption certificate.\n\nWhile the Act provides a declaration form allowing motorists to swear their vehicle is not equipped with a radio receiver, it does not define how exemption applications are assessed, who qualifies, or what verification procedures are in place.\n\nThis opens the door to inconsistent, subjective or even discriminatory application of the law by ZBC or affiliated agencies. Section 6 of the Amendment Act introduced a provision that requires the BAZ to invite broadcasting license applications at least once every year, subject to the availability of band spectrum. At first glance, this appears to be a progressive step toward greater regulatory consistency and transparency.\n\nMandating an annual call for applications could in theory, create opportunities for new entrants, especially community broadcasters and independent players who have long been excluded from the media landscape.\n\nHowever, this provision is ultimately a mixed bag, and the potential for misuse far outweighs the intended benefits. The conditional phrase subject to the availability of band spectrum is vague, unqualified, and easily exploitable.\n\nIt gives BAZ a built-in excuse to delay or withhold licenses indefinitely, without providing any technical evidence, audit mechanisms or public justification. This loophole hands disproportionate discretion to the regulator, allowing it to arbitrarily block new broadcasters under the guise of spectrum scarcity.\n\nIn reality, spectrum scarcity is no longer a credible justification in the digital era. Advances in digital broadcasting and spectrum sharing technologies have vastly expanded the capacity to accommodate multiple broadcasters within the same frequency range.\n\nOther African countries like Kenya and Tanzania have used digital migration as a chance to open up space for diverse, community-based, and digital-first broadcasters. Zimbabwe, by contrast, appears to be using it to tighten control.\n\nThe progressive element requiring at least one public call for applications per year is undermined by the Authoritys control over timing, criteria, and technical justifications.\n\nApplicants have no right to apply proactively, they are entirely dependent on the Authority initiating the process, which can be delayed indefinitely using the spectrum line as a cover.\n\nThis turns what should be an open licensing framework into a closed, selective, and politically filtered process. Consequently, Section 6 of the Amendment Act merely disguises arbitrary licensing under a technical pretext.\n\nIn conclusion, while the Act introduces some welcome reforms, such as recognising digital broadcasting and expanding service categories, it ultimately falls short of delivering genuine media reform. The continued lack of regulatory independence, vague digital provisions do undermine democratic values.\n\nMlondolozi Ndlovu is the interim MISA Harare Advocacy Chairperson. He is also a media lecturer, legal and media researcher who writes in his own capacity. He is reachable on email-mlondo717@gmail.com\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/10133438/Radio-studio.jpg",
            "description": "<p>By Mlondolozi Ndlovu The Broadcasting Services Amendment Act No.2, 2025 (Hereinafter referred to as the Act/ Amendment Act) represents a significant shift in Zimbabwe’s media regulation landscape. Promulgated as part of broader media law reforms, the amendment aims to align the Broadcasting Services Act [Chapter 12:06] with constitutional principles, technological advancements, and regional best practices.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-new-broadcasting-services-amendment-act-a-legal-analysis/\">The new Broadcasting Services Amendment Act- a legal analysis</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        },
        {
            "title": "African Sun places Caribbea Bay Resort on the market",
            "url": "https://www.newzimbabwe.com/african-sun-places-caribbea-bay-resort-on-the-market/",
            "content": "By Alois Vinga\n\nLISTED hospitality group, African Sun Limited (ASL) has placed another asset, the Caribbea Bay Resort, on the market.\n\nThis was revealed in a Cautionary Statement issued by ASL informing shareholders of the impending transaction.\n\nShareholders and the investing public are advised that, in keeping with the strategy of unlocking value, negotiations for the disposal of a selection of hospitality assets are still underway. Pursuant to the above, the Company has placed the Monomotapa Hotel as well as the Caribbea Bay Resort on the market for sale, reads the statement in part.\n\nThe negotiations if successful, will constitute a Category 1 transaction; accordingly, the company would be seeking the approval of its shareholders at an Extraordinary General Meeting (EGM) to be convened at the appropriate time.\n\nSaid ASL, Shareholders and the investing public are therefore advised to continue exercising caution when dealing with the Companys securities until advised of the conclusion of the said ongoing processes. By order of the Board.\n\nThe move follows the recent sale of the Great Zimbabwe Hotel in Masvingo, which was sold along with its associated business operations for US$4.2 million as part of a capital-raising initiative.\n\nAfrican Suns current property portfolio includes Holiday Inn Mutare, Troutbeck Resort, Elephant Hills Resort and Conference Centre and Hwange Safari Lodge.\n\nThe group also leases three strategic properties: Holiday Inn Harare, Holiday Inn Bulawayo and The Victoria Falls Hotel.\n\nThe moves are in line with the groups long-term value creation and asset optimisation strategies in response to the industrys dynamism.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29192711/caribbea-bay.jpg",
            "description": "<p>By Alois Vinga LISTED hospitality group, African Sun Limited (ASL) has placed another asset, the Caribbea Bay Resort, on the market. This was revealed in a Cautionary Statement issued by ASL informing shareholders of the impending transaction. “Shareholders and the investing public are advised that, in keeping with the strategy of unlocking value, negotiations for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-places-caribbea-bay-resort-on-the-market/\">African Sun places Caribbea Bay Resort on the market</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        },
        {
            "title": "Joshlin Smith’s mother, two others sentenced to life imprisonment for human trafficking",
            "url": "https://www.newzimbabwe.com/joshlin-smiths-mother-two-others-sentenced-to-life-imprisonment-for-human-trafficking/",
            "content": "Sowetan Live\n\nThe trio received their sentences on Thursday morning. The 10-year kidnapping terms will run concurrently with their life sentences and theyve also been added to the child protection register.\n\nThis sentence is aimed at protecting the vulnerable in society and restoring dignity, presiding judge Nathan Erasmus said.\n\nDuring sentencing, Erasmus noted that the trio committed the crimes under the influence of drugs but stressed that substance abuse was not an excuse.\n\nAddressing Appollis directly, Erasmus said: You are a father of an 11-year-old daughter and acted as a father figure to Joshlin and Kelly Smiths other children. Your attitude in this court showed that you dont care, not only here, but when Pietersen [social worker] asked about Joshlins whereabouts, you said you didnt care.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29195204/kelly-smith.jpg",
            "description": "<p>Sowetan Live The Western Cape High Court has sentenced Joshlin Smith’s mother, Racquel “Kelly” Smith, Jacquen Appollis and Steveno van Rhyn to life imprisonment for human trafficking and 10 years for the kidnapping of the six-year-old girl. “This sentence is aimed at protecting the vulnerable in society and restoring dignity,” Judge Nathan Erasmus. The trio</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/joshlin-smiths-mother-two-others-sentenced-to-life-imprisonment-for-human-trafficking/\">Joshlin Smith’s mother, two others sentenced to life imprisonment for human trafficking</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        },
        {
            "title": "Former Mauritanian Finance Minister Tah Elected President of AfDB",
            "url": "https://www.newzimbabwe.com/former-mauritanian-finance-minister-tah-elected-president-of-afdb/",
            "content": "By Boakai Fofana\n\nFormer Mauritanian finance minister, Sidi Ould Tah, was elected president of the Africa Development Bank, the AfDBannounced. Tah, who also headed the Arab Bank for Economic Development in Africa, won after three rounds of voting by the AfDBs Board of Governors at their meeting in Abidjan, securing more than 76% of the votes in the end, according toreports.\n\nIn the weeks leading up to Thursdays vote, Tahpromisedto undertake internal reforms if elected. He spoke of the needto improve key functions of the Bank, such as reducing the time frame for the implementation of projects and attracting the necessary talent.\n\nAmongst what he said were thefour main pillars  forming the basis of his leadership  are scaling up financing for development and strengthening the continents financial architecture.\n\nThe Mauritanian becomes the ninth president of the AfDB since its founding in 1964. He ran against four candidates: Amadou Hott of Senegal, Zambias Samuel Maimbo, Mahamat Abbas Tolli of Chad, and the only woman candidate, Bajabulile Swazi Tshabalala from South Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29193432/afdb.jpg",
            "description": "<p>By Boakai Fofana  Former Mauritanian finance minister, Sidi Ould Tah, was elected president of the Africa Development Bank, the AfDB announced. Tah, who also headed the Arab Bank for Economic Development in Africa, won after three rounds of voting by the AfDB’s Board of Governors at their meeting in Abidjan, securing more than 76% of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-mauritanian-finance-minister-tah-elected-president-of-afdb/\">Former Mauritanian Finance Minister Tah Elected President of AfDB</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:07",
            "date": "30 May 2025"
        }
    ]
}