{
    "news": [
        {
            "title": "South Africa’s World Cup dreams threatened: Mokoena yellow card controversy explained",
            "url": "https://www.newzimbabwe.com/south-africas-world-cup-dreams-threatened-mokoena-yellow-card-controversy-explained/",
            "content": "IOL\n\nSouth Africas road to the 2026 Fifa World Cup has hit a potential roadblock following a yellow-card controversy surrounding midfielder Teboho Mokoena. Reports suggest that Mokoena may have been ineligible to play in Bafana Bafanas crucial Matchday 5 clash against Lesotho, which could significantly affect the teams chances of qualifying.\n\nMokoena, a central figure in South Africas midfield, received a yellow card in their opening match against Benin (MD1) and another in the following match against Zimbabwe (MD4). According to Fifas regulations, a player who accumulates two yellow cards in separate matches must serve a one-match suspension. This means Mokoena should not have featured in the Lesotho encounter.\n\nDespite the clear rules, Mokoena was included in the starting line-up for the Matchday 5 match against Lesotho, playing 81 minutes before being substituted. If the reports are confirmed, this could be a violation of Fifas qualification regulations, and South Africa may face a points deduction for fielding an ineligible player.\n\nCurrently, Bafana sit at the top of Group C with 10 points, just ahead of Benin (eight points) and Rwanda (seven points). A points deduction would not only see them lose their top spot but also tighten the race for automatic qualification. Nigeria, with just six points, could also capitalise on any misstep by South Africa. Given the competitive nature of Group C, even a small slip could be costly in the long run.\n\nThe issue stems from Fifas World Cup Qualifiers Rulebook, specifically sub-section 9, which clearly states that a player who receives two yellow cards in separate matches must serve a one-match suspension. If the suspension rule is applied and Mokoenas eligibility is found to be invalid, South Africa could lose the three points from their 2-0 win over Lesotho  a decision that would significantly impact the standings and increase pressure on the team in the final rounds of qualifiers.\n\nIn unrelated news, SAFA are also facing internal challenges.\n\nReports have emerged that Safa employees did not receive their salaries for March on time due to a delayed payment from one of their partners. A letter sent to staff members on Monday stated that salaries would be delayed, citing a lack of adequate financial reserves to cover the delay.\n\nThe March salaries will be paid by March 31, 2025, the letter concluded, adding further complications to an already tumultuous period for South African football.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/25154121/Reports-suggest-that-Teboho-Mokoena-may-have-been-ineligible-to-play-in-Bafana-Bafana-s-crucial-Matchday-5-clash-against-Lesotho-last-week.webp",
            "description": "<p>IOL South Africa’s road to the 2026 Fifa World Cup has hit a potential roadblock following a yellow-card controversy surrounding midfielder Teboho Mokoena. Reports suggest that Mokoena may have been ineligible to play in Bafana Bafana’s crucial Matchday 5 clash against Lesotho, which could significantly affect the team’s chances of qualifying. Mokoena, a central figure</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/south-africas-world-cup-dreams-threatened-mokoena-yellow-card-controversy-explained/\">South Africa’s World Cup dreams threatened: Mokoena yellow card controversy explained</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Two suspects in court for robbing Chivayo’s in-laws",
            "url": "https://www.newzimbabwe.com/two-suspects-in-court-for-robbing-chivayos-in-laws/",
            "content": "By Staff Reporter\n\nTwo members of the armed gang that robbed Wicknell Chivayos in-laws of US$74,000, believed to be part of the bride price he paid for his wife Lulu, appeared in court Tuesday.\n\nPeter Maramba Vhiya (43) and Takudzwa Maisvoreva (24) appeared before Harare magistrate Marewanazvo Gofa, who remanded them in custody to April 10.\n\nThey will be joined by another suspect who has already appeared in court.\n\nGofa said they should seek bail at the High Court.\n\nAccording to the State, on March 18, at around 1 am, the two, along with accomplices still at large, allegedly plotted a robbery at Alpha and Omega Farm in Marondera.\n\nArmed with three rifles, two pistols, bolt cutters, machetes, and iron bars, the suspects executed a well-coordinated attack.\n\nUpon arrival, they ambushed Petros Mabunhu, a security guard employed by DM Security, assaulting him with iron bars and kicking him repeatedly.\n\nThey tied his hands and legs with cable ties before forcing him into the farmyard.\n\nThe court heard they encountered another guard, Zex Mutasa Rusike, who they disarmed of a CBC shotgun without ammunition.\n\nRusike was similarly bound and marched to the front guardroom, where a third guard, Medic Zhakata, was also attacked and restrained.\n\nTwo security guards were left under the watch of two armed accomplices while the rest of the gang broke into the main house.\n\nUsing bolt cutters, they forced entry through the burglar screen and kitchen door, eventually confronting Gerald Muteke in his bedroom.\n\nFearing for his life, Muteke surrendered US$18,000 in cash, a loaded Sarsilmaz pistol, and two Samsung smartphones (S23 and S24).\n\nThe gang then moved to Vimbai Mutekes bedroom, where they demanded cash and safe keys.\n\nShe handed over US$1,100, the safe key, and a Samsung Galaxy A35. Inside the main bedroom safe, the robbers took an additional US$55,000.\n\nAs the robbers continued their raid, Elphas Maruta, armed with a 303 rifle loaded with four rounds, advanced toward the house after being alerted to the robbery.\n\nA shootout ensued, with Maruta firing two shots and the suspects firing back three shots.\n\nThe gang ultimately fled the scene with a total of US$74,600 in cash and valuables. Police later recovered stolen property worth US$3,800.\n\nThe suspects are also implicated in a separate robbery on February 25, targeting Cossam Siminya at his residence.\n\nAround 3 am, the accused and their accomplices, armed with pistols, sjamboks, iron bars, and a hammer, broke into the home after waking the complainant and his wife, Precious Makore, with the noise of their barking dogs.\n\nMakore, upon investigating, alerted her husband after hearing banging noises at the back door.\n\nWhile she attempted to seek help from a neighbour, the robbers forced entry and began ransacking the house.\n\nThey confronted Panashe Zhuwawo, who was sleeping in a spare bedroom, and stole his cellphone.\n\nOutside, neighbours who came to assist fled after one of the robbers fired two warning shots into the air.\n\nMeanwhile, the gang confronted another resident, Jane Manokore, stealing a 49-inch Samsung television, cash totaling US$700, a cellphone, and other valuables.\n\nThe robbers then entered Siminyas bedroom, stealing US$10,000 in cash, an iPhone 14 Pro, a Tecno Spark 8, groceries, and other items.\n\nThe suspects also raided a tuck shop on the property, severely assaulting Bosco Chidukudze before stealing a small Samsung cellphone.\n\nThe total value of goods stolen in the second robbery was US$13,220, and nothing has been recovered.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/25122450/chivayo-lulu.webp",
            "description": "<p>By Staff Reporter Two members of the armed gang that robbed Wicknell Chivayo’s in-laws of US$74,000, believed to be part of the bride price he paid for his wife Lulu, appeared in court Tuesday. Peter Maramba Vhiya (43) and Takudzwa Maisvoreva (24) appeared before Harare magistrate Marewanazvo Gofa, who remanded them in custody to April</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/two-suspects-in-court-for-robbing-chivayos-in-laws/\">Two suspects in court for robbing Chivayo’s in-laws</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "‘I feel really, really cross at incredibly dumb decisions’: Stephen Sackur on the end of HARDtalk – and leaving the BBC",
            "url": "https://www.newzimbabwe.com/i-feel-really-really-cross-at-incredibly-dumb-decisions-stephen-sackur-on-the-end-of-hardtalk-and-leaving-the-bbc/",
            "content": "The Guardian\n\nStephen Sackur makes no bones about it: he is not going willingly. I dont want to leave theBBC, because I still think Ive got a lot to offer, the HARDtalk presenter tells me. And I dont want the programme to be closed, but that argument has been definitively lost. Im thinking hard about other things Im going to do. Im fine. Im feeling quite positive. Maybe. But I think hes also feeling hurt, betrayed and, though he denies it, a little angry. Its definitely a strange period, he says. Were talking in February, a month before the show finishes and hes sent packing by the Beeb.\n\nSackur, 61, is a BBC lifer. He started out as a trainee in 1986, was made a foreign correspondent in 1990, and went on to some of the biggest gigs in journalism  Europe, Washington, the Middle East. For the past 19 years, hes hosted HARDtalk, the interview show that holds global power to account. The BBC has always lauded it as a flagship programme  thrice weekly, regularly watched in more than 200 countries by up to 70 million people (and, he reckons, with the podcast and World Service radio versions that figure could rise to 170 million). Which is why he got such a shock when he wastold in October that it was being pulled.\n\nAs you might expect, Sackur has not taken the end of the show lying down. After the announcement, he put out a message on X, explaining why it was sad for him personally but more importantly a depressing day for the BBC.\n\nHe made his point in a series of uncompromising posts. At a time when disinformation and media manipulation are poisoning public discourse HARDtalk is unique: a long-form interview show with only one mission  to hold to account those who all too often avoid accountability in their own countries, he wrote. Anyone who has seen our interviews with Hugo Chvez, Sergey Lavrov, Meles Zenawi, Lula, Nancy Pelosi, Recep Tayyip Erdoan, Emmanuel Macron, Imran Khan, Olusegun Obasanjo and countless others over the years will know HARDtalk was never just another news show. A brilliant team of producers and researchers is being disbanded  My commitment to rigorous exploration of world affairs wont change. I hope the BBCs doesnt either. Hardly a humble assessment of HARDTalk or his own career, but a fair one.\n\nWere in Sackurs lovely kitchen  stylish, hi-tech, posh coffee machine on the countertop, gorgeous contemporary art on the walls. He asks where Id like to sit. The sofa looks good, I say. But hes already moving towards the table, turning the kitchen into an improvised HARDtalk studio. He sits one side, Im opposite  the format hes used to. Its astonishing how many world leaders have subjected themselves to his interrogations, wrongly assuming they can best him in debate.\n\nHe is a tall, thin man, straight as an ironing board, with strong arms and a military bearing  undoubtedly officer class. Sackurs style of interviewing is forensic and barristerial. Rather than getting interviewees to open up, its more about putting the case for the prosecution, and watching them squirm or try to worm their way out of it. And he can gets great lines from guests. In 2009, Boris Johnson, then mayor of London, told him that the 250,000 a year he received for writinga weekly newspaper column was chicken feed a quote that has stuck.\n\nSackur tells me hes not taking voluntary redundancy, which he has been offered, because there is nothing voluntary about it. If the BBC is giving him the old heave-ho, it can at least do it honestly. Youre forcing them to make you redundant? Yes. I suppose its a little bit of obstinacy and just saying: OK, well, you think very hard. Youve got a journalist here whos got a lot of experience, who probably has a longer track record of covering international affairs than almost anybody in the BBC. I have pretty good contacts, know a lot of people in a lot of places. If they decide thats not what they want and need, thats fine, but Id like them to be clear about that.\n\nAlthough the HARDtalk budget had been cut in recent years, there was no suggestion that it would be axed. He says he only had one proper conversation with the director-general, Tim Davie, in five years, and that went positively. I rang him up when he got the job and I said: I just want to say hi and well done. And he said: Its great to talk to you. I appreciate how important HARDtalk is, particularly in terms of our international offer and profile. I look forward to coming down and seeing the team, which he never did. He invited me to a gathering of journalists from different parts of the BBC, but otherwise Ive never spoken or heard from him again. And, since the closure announcement, Ive not heard a word.\n\nA few weeks after the decision was taken, Sackur says, he was invited to a meeting with BBCs head of news, Deborah Turness. It didnt yield a change of mind or any hint that there would be a change of mind. So what was the point of it? Thats a very good question. I think she felt embarrassed that she had never met me. Because, if you remember, after the announcement was made, there was a massive response in this country and around the world. A lot of very senior journalists expressed their surprise and disquiet about it. And quite a few other people as well. And it did have a bit of an impact.\n\nOne of his recent interviewees was the former Washington Post editor Marty Baron. Sackur took a scalpel to him in typical fashion, suggesting that old-fashioned, top-down mainstream media has had its day, and that Baron, 70, was just another white, middle-aged privileged man the world had tired of hearing from. The same could be said of you, couldnt it, I say. He nods. Yes, I could have been talking to myself.\n\nWell, youre slightly posher than Baron, I say. He laughs. So Im even more of a problem! Yes, Im part of the same sort of media elite, and I am white and getting on a bit and all of this applies to me, and HARDtalk might well be better refreshing itself with a new presenter who carries a bit less of that baggage for sure. But, he says, even if the Beeb thought he should be put out to grass, the show shouldnt have been. Take me off HARDtalk? I totally get it. Every old horse at some point has to be taken off to the glue factory. But dont kill off the programme.\n\nActually, he says, he has thought for some time he should move on and try something new. The trouble is he enjoyed the show so much. Whats not to like about travelling the world talking to interesting people? A lot of journalists I respect greatly say to me: You have the best job in journalism. In terms of an ability to engage with whats interesting in this world of ours, theres no job like it.\n\nIts lunchtime, and Sackur suggests a visit to his local. Were just off to the pub, he shouts up to his partner, Ana, whom he has been with for five years. He was married for more than 20 years and has three adult children. As we stroll down the south London street, he talks about his own childhood. Sackur grew up in a middle-class family in Spilsby, Lincolnshire. His father, he says, was hard to pigeonhole  a Cambridge University graduate with a degree in agriculture who became a Guardian-reading farmer and stood twice, unsuccessfully, to become a Labour MP in Tory heartlands. His mother came from farming stock. Sackur was a bright boy gifted with a ruthlessly logical mind and an ability to out-argue others. He also went to Cambridge, where he studied history. Desperate to escape the isolated rural environment he grew up in, he realised that journalism was the perfect way to do it.\n\nWe order Guinness and chips at the bar, and head off to a booth. I ask him whether hes a nightmare over the dinner table, always arguing his case, always having to win. I think I was a bit of a nightmare as a kid because I was argumentative and wouldnt let it drop. Sometimes I didnt see that the best thing to do was to back down.\n\nWhat has he learned from interviewing so many significant figures? Ive learned a lot about the ego. Human beings are hugely flawed and are desperate to cover up their flaws. Has it made him look at his own flaws? Very much so. What are his main ones? Selfishness, self-absorption, being preoccupied with my place in things rather than  He comes to a stop. Did this affect his relationship with his family? Yeah, thats where I would go, but I dont want to talk about personal stuff that is difficult. I think Im a more rounded human being than I was years ago, for sure.\n\nHow has he changed? Im more tolerant. I was something of a control freak: I would expect and look for a neatness  a literal neatness and a sort of figurative neatness  in life. And Id try to impose it when, as I can see much more clearly now, life isnt neat and to be rounded up and squared off all tidy. In the past, it would leave me grumpy and intolerant in a way that was completely counterproductive. Now Im better able to live with the rough edges.\n\nHe admits he finds it tough talking about personal things  partly because hes private and partly because it inevitably involves other people he has no right to talk about. Some of it is too painful, and painful not just to me, but painful to other people that I really dont want to hurt.\n\nSo we retreat to safer ground. I ask about his most memorable guests on HARDtalk. There are so many, he says Venezuelan president Hugo Chvez, who treated Sackur with contempt before warming to him; Russian dissident Alexei Navalny, the most courageous man hes met; the tortured Allen Ault, who had beenin charge of executions in Georgia; Bill Clinton, whose magnetism made Tony Blair look second division on the charisma front; the brutal Ethiopian dictator Meles Zenawi. It was only when he returned to Ethiopia, he says, that he realised the impact of his interview with Zenawi. Id meet people on the street and theyd be quoting from it like it was verses from Shakespeare. The thing is, he says, theyd never heard Zenawi held to account before.\n\nDoes he think BBC bigwigs are aware of the significance of HARDtalk? No. I dont think at the very senior levels of the BBC there is an awareness of just how big a show HARDtalk is around the world. Perhaps people like Turness are too removed from the journalism to make important decisions about it? Ill tell you what I think. I think it is deeply regrettable that people like Deborah Turness do not spend more time making a point of hanging out with people like me. I think that would be incredibly beneficial for them, given their importance as layers-down of the sort of strategic direction of BBC News and current affairs. Again, I dont want to sound in any way egomaniacal, but I do have a lot of experience and you would think that that experience would be useful to take advice from, to tap into as a resource for those people who are defining strategic priorities.\n\nSackur is alarmed at the way news priorities have changed at the BBC. Programmes like HARDtalk, Panorama and Newsnight have long had a huge amount of autonomy. Increasingly there is a desire at the top of the BBC to centralise and control and that doesnt fit easily with these programmes. You can see it in the way Newsnight and Panorama have changed and been resourced. In previous rounds of reform and cuts, weve had our staff reduced, our money reduced, and now were disappearing altogether. Hes worried that with the focus on live news, journalism is being reduced to churnalism at the expense of more studied, groundbreaking work.\n\nPresumably, the BBC wont even save much money by axing HARDtalk, I say. After all, its hardly expensive telly. Dont even get me started on the money! Too late. I think the total sum of money BBC News declared that it had to save in that round of cuts was 24m. HARDtalk represents around 5% of that 24m  1.2m a year. In total. The team is tiny, he says  only eight staff. I cant prove this scientifically, but Im pretty sure that HARDtalk is the cheapest content per minute of broadcasting the BBC does. We represent about four middle to senior management salaries.\n\nDoes he think its a snub to highbrow journalism? No. They know what they want and we dont fit it. But Ive got too much love for the BBC and Ive got too many colleagues at the BBC who are still doing fantastic work to think that they dont want serious journalism.\n\nHe stops, and says its important to get this right. Im not leaving, raging with bitterness and resentment and the feeling that the BBC is slashing, burning and ruining the sort of journalism that I believe in. That would be simple. Its more subtle and more complex than that.\n\nWe catch up a few weeks later in mid-March. Sackur has just received his redundancy letter and been served three months notice. He is devastated for his small but perfectly formed team, and now there is no attempt to disguise his anger. I feel really, really cross at incredibly dumb decisions made by management that I fear is not doing the right thing for the BBC. I have not been impressed with their ability to deal with this in a compassionate, human way.\n\nHe tells me that one of his final interviews was with Christine Lagarde, president of the European Central Bank (ECB). It made plenty of headlines worldwide on Trump and tariffs, he says. Like so many recent guests, she told me she was completely baffled by the closure of HARDtalk. Why would they do it at a time like this? she said. As a sort of consolation she gave me a jar of ECB honey  apparently they have a hive in the banks garden.\n\nOn the positive side, he feels energised and liberated by his new freedom. He talks about his plans for the future. He has just signed a deal to write a book about journalist heroes who have risked everything to make a difference. Im not a brave person, and part of the reason for writing this book is that, over the years, Ive been so blown away by journalists whose work is truly brave in a way that mine never was and never will be. Having it out verbally in a studio doesnt compare with risking your life taking on the corrupt and powerful, he says.\n\nAs for his journalism, hes by no means finished with that. Hed love to do a revamped version of HARDtalk. As I said at the beginning, if you need people who are steeped in international affairs, whove met and reported on so many of the people and places that matter  In other words, Stephen Sackur is open to offers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/25085736/Screenshot-2025-03-25-at-10.51.07.png",
            "description": "<p>The Guardian Stephen Sackur makes no bones about it: he is not going willingly. “I don’t want to leave the BBC, because I still think I’ve got a lot to offer,” the HARDtalk presenter tells me. “And I don’t want the programme to be closed, but that argument has been definitively lost. I’m thinking hard</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/i-feel-really-really-cross-at-incredibly-dumb-decisions-stephen-sackur-on-the-end-of-hardtalk-and-leaving-the-bbc/\">‘I feel really, really cross at incredibly dumb decisions’: Stephen Sackur on the end of HARDtalk – and leaving the BBC</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Deaths, cover-ups and bribes at Zimbabwe’s lawless Redwing Mine",
            "url": "https://www.newzimbabwe.com/deaths-cover-ups-and-bribes-at-zimbabwes-lawless-redwing-mine/",
            "content": "By Owen Gagare | GroundUp News\n\nBelying the beauty of its surroundings in Penhalonga, Manicaland, in eastern Zimbabwe, lies Redwing Mine, a hub of artisanal activity, and a testament to the lawlessness and impunity of Zimbabwes political elite.\n\nApproaching Redwing Mine with its backdrop of towering hills and rugged mountains, you are greeted by an incessant noise of hammer mills and generators. Hundreds of blue canvas tents, each marking a pit, are haphazardly scattered across the landscape. With over 3,000 open pits, thousands of artisanal miners toil in the dirt, searching for gold. Young men and women, including teenagers, descend into the pits with nothing more than rudimentary tools  picks and shovels  and their bare hands.\n\nThere is little regard for safety protocols or regulations. There is a boom gate at the main entrance but people walk in and out without question. The mine is a free-for-all.\n\nDozens of mine shafts are concentrated in areas with rich gold deposits.\n\nRedwing Mine is legally owned by South African mining mogul Mzi Khumalos Metallon Corporation, but the company lost operational control in 2020 when the mine was placed under corporate rescue due to unpaid debts, wage arrears, and statutory obligations. It wasdragged to courtleading to the appointment of an administrator to manage the mine.\n\nAccording to newsreportsandcivil society organisations, Zanu-PF MP Scott Sakupwanya, an ally of President Emmerson Mnangagwa, got involved while the mine was under business rescue. His company, Betterbrands Mining, took control ofvast sectionsand 132 claims at Redwing with thecorporate rescuers assistance, despite not having mining experience.\n\nBetterbrands engaged sponsors  people who were allocated pits to mine  who in turn hired artisanal miners on a large scale.\n\nThis marked the end of formal underground mining and the start of the current chaotic state of the mine.\n\nWith the lawlessness came deaths, corruption and cover ups. The government, law enforcement agencies and regulatory authorities have largely turned a blind eye, despite revelations that senior police and army officers control some of the pits at the mine.\n\nThere are no official records available of the deaths, but civil society organisations estimate that more than 100 people may have died in the open pits since the arrival of Betterbrands Mining. Government did shut the mine twice  in January 2023 following fatal accidents and again in January 2024 after 15 miners were trapped. But on each occasion, mining resumed and little changed. Instead of addressing the issues, a web of secrecy surrounds its operations. But leaked rescue reports, seen during our investigations, and testimonies from family members of the dead are damning.\n\nReport after report, stretching over many months, conclude by saying dangerous or illegal pits will be closed.\n\nRosemary Kaponda has fond memories of her nephew, Gilbert Pedro, who died while working as an artisanal miner.\n\nGilbert Pedro died in March last year apparently from exposure to gas.\n\nWe travelled to Matika Village in Chigodora, about 50km south of Mutare, where Pedro grew up, to speak to his family.\n\nPedros aunt, Rosemary Kaponda, has fond memories of her nephew. With tears in her eyes, she told us, His death pains. It came at a time he was about to establish his own mine. He was in the process of registering his own claim and had acquired a prospectors license.\n\nThese were his final days as an artisanal miner. He was working in dangerous conditions so that he could establish himself. I knew him from a tender age. He was brilliant and tenacious even as a young child and I have no doubt he would have made it big. But sadly, his life was cut short before he could fulfill his vision.\n\nPedro was ten years old when his father died.\n\nAt that time, he was in Grade 5. He was brilliant in school and other children used to call him teacher because teachers used to ask him to explain things to his classmates when they did not understand, she said.\n\nHe did his Advanced Levels at St Werburghs Secondary School here in Chigodora. He got nine points at A-level despite not having adequate books and other resources. He was a gifted child.\n\nAfter his A-Levels, Pedro and Kapondas son Eliah Maina, made their way to Penhalonga to find work.\n\nMaina said that between 2011 and 2012 they worked as camels  people who carry gold ore from one point to another on their backs for artisanal miners near Redwing Mine.\n\nWe would carry gold ore from mining areas to the road, where it would be collected and sent to hammer mills. We got paid US$1 for each sack we carried. It was hard work, but it had no risks, unlike being an artisanal miner, he said.\n\nMaina said he vowed never to become an artisanal miner when he witnessed a fatal accident at one of the pits where he was collecting gold ore in 2012.\n\nThe pit was just nine metres deep but there was a collapse, and one person died on the spot after being crushed by a rock. The other person, who was also trapped, died later at Mutare General Hospital, he said.\n\nIt was a traumatising experience because you could see the people were in pain, but the rescue effort took long. I think the collapse happened around midnight, but they were only rescued after 4am because it was difficult. It was too much for me to handle.\n\nMaina left Penhalonga after the incident, but Pedro stayed on.\n\nEliah Maina worked between 2011 and 2012 as a camel, carrying bags of gold ore for artisanal miners.\n\nWhen the mine was partly annexed by Betterbrands Mine, Pedro ventured into artisanal mining, while saving money to start mining legally.\n\nOne night in March last year, I cannot recall the exact date, said Kapondo, I received a call around 10pm from his young sister who also lives in Penhalonga. I was told that he had died as a result of gassing.\n\nPedro had gone to the mine shaft with his young brother to collect a shovel and other equipment. His younger brother was the first to be lowered into the pit. He tapped on the rope, to indicate he wanted to come out.\n\nWhen he came up he said there was gas in the pit. Pedro decided to go inside, because he believed it was a quick job, just to go and grab the tools and come out, said Maina. Unfortunately, he was gassed.\n\nOther miners were called to blow oxygen into the pit, but it was too late.\n\nThe miners retrieved Pedros body, which was sent to a private mortuary with the assistance of Manicaland Minister of State Mischeck Mugadza. He provided a coffin and food. The family did not get any help from Metallon or Betterbrands. Pedro was buried at the Old West Cemetery in Penhanga.\n\nThe situation is particularly bad at Redwing Mine, said Kapondo. But there is nothing we can do. Those in charge are allowing the deaths to occur without putting in safety measures.\n\nArtisanal miners at Redwing Mine use water pumps to drain water from mine shafts during the rainy season.\n\nMetallon has lost control of the mine, but it keeps staff on site in the hope that it will be able to return it to regulated underground mining.\n\nPolice did not respond to our detailed questions. But incident reports prepared by Metallons rescue team on the mine, leaked to us, confirm that there have been deaths unreported by the authorities.\n\nMost accidents are caused by mine shaft collapses or gassing. Contributing factors include poor hazard awareness, lack of proper re-entry plans, inadequate ground support, defective tools, and congested working areas with poor ventilation and lacking warning systems. Heavy rains also loosen ground and destabilise tunnels. The inexperienced miners do not know how to use machinery properly.\n\nAccording to one of the reports, on 1 September 2024, Takemore Mlambo of Biriri in Chimanimani and his 19-year-old son, Tadiwa, died from gas at a pit in the Zaina section of the mine.\n\nMlambo had a sponsor. Sponsors are pit owners or middlemen between Betterbrands and artisanal miners, who are given peg numbers for pits after paying to be allowed to mine. They supply plastics, tents, timber, generators, food, blowers, work suits, gumboots and pit registration for the miners.\n\nMlambo and four other artisanal miners holed into an old working underground. They then alerted co-workers who immediately hoisted them outside, where they cooked and ate. It is said that the team notified their sponsor of the new development, and they were advised not to continue mining until the next morning. The team however did not listen and hoisted Takemore Mlambo into the pit, which is approximately 40 metres deep.\n\nMlambo stopped communicating with the outside team. Rodwell Dzemura called Tadiwa, who worked at a neighbouring pit, and told him they suspected that his father had been gassed.\n\nTadiwa then bluntly decided to be hoisted down to rescue his father. That was when he got gassed along with his father.\n\nMetallons Redwing Mine Rescue team retrieved the bodies.\n\nEach blue tent signifies a mine shaft. Artisanal miners use the tents to cover shaft openings.\n\nAnother report, dated 3 October 2024, described how the Redwing mine rescue team was dispatched to an abandoned 40-metre deep pit in the Zaina section following reports of a strong, unpleasant odour coming from the site.\n\nThe now deceased was reportedly missing since 27 September 2024, and relatives could not find him. On 2 October at around 19:00, an artisanal miner passed close to the area and smelt a heavy odour coming from the pit. The artisanal miner immediately approached some relatives of the deceased who had been looking for their missing relative, the report reads.\n\nRedwing Mine Rescue Team attended the scene and managed to retrieve the body that was in a decomposing state. Police who attended the incident took the body to Victoria Chitepo Provincial Hospital (VCPH) mortuary.\n\nThe mining manager who signed the report, stated that the pit was not barricaded and claims the deceased was known as a habitual drunkard, and it is therefore suspected that he fell into the pit whilst drunk.\n\nIn another report, dated 29 November 2024, the rescue team retrieved three bodies of a woman and two men who died in a tunnel. The report named them only as Courage, Garikayi and Mai D.\n\nRedwing Mine Rescue Team initiated the rescue around 05:30, the four illegal miners were trapped in an audit tunnel while illegally mining. One casualty was complaining of a spine injury and was admitted in VCPH and the three lifeless bodies were retrieved, the last body was out around 10:20 and handed over to ZRP Penhalonga Police, the report reads.\n\nThe report claims the tunnel was illegally mined, used as a shelter and a hand out [sic] for drug addicts.\n\nA month later, a report dated 30 December, describes how an artisanal miner called Victor Chinyowa (32) from Mafararikwa village in Marange, died from gassing in a 12-metre deep pit. The report says Chinyowa had entered the pit, which had been abandoned since October 2024, to collect his spectacles.\n\nAnother report confirmed that a body was retrieved from the Tsapaota area of the mine on 30 January 2025, a few days after this reporter visited Redwing.\n\nTsapaota is on unstable ground. Fifteen miners were trapped there last year, leading to the government shutting the mine. The miners extracted themselves after a three-day ordeal and the mine was reopened.\n\nDrilling of mine shafts close to each other has been blamed for causing mine collapses. The law says there should be spacing of at least 35 metres between shafts, but this is not the case at Redwing Mine.\n\nOn a visit to the site in January, we discovered that Zanu-PF members, Metallons own workers, individual military personnel and police officers had started their own artisanal mining operations.\n\nWe were told police take bribes to prevent investigations into deaths and mining violations to avoid further shutdowns or bad publicity.\n\nIf the police do have records of accidents and fatalities over the last year, they will not share them. We sent questions to the Zimbabwe Republic Police on 13 February and have received no response.\n\nOn 11 February, we sent questions to mining minister Winston Chitando and permanent secretary, Pfungwa Kunaka, but they did not respond.\n\nMetallon did not respond to questions first sent on 31 January.\n\nBetterbrands did not answer questions first sent on 18 February. Questions were sent to Sakupwanya, his PA, marketing and PR manager, and to mine manager Cuthbert Chitima.\n\nOwen Mbwando, director of Centre for Research for Peace and Development of Africa, which has been closely following events in Penhalonga, said, Deaths are no longer being reported while in some cases normal reporting procedures are not being followed after accidents.\n\nArtisanal miners and civil society organisations say bodies are often moved without the police, under cover of night to avoid drawing attention to the dangers of open-pit mining in the area. In some cases, bribes ensure that investigations into the deaths never take place.\n\nThis story was produced in collaboration with theIJ Hub.\n\nRedwing Mine (20022025)\n\nOctober 2002: Metallon CorporationacquiresRedwing Mine from Lonmin. The mine, in operation since 1889, is expected to profitable.\n\n2008: Redwing Mine faces significant challenges, including flooding, leading to themines closureduring Zimbabwes hyper-inflation period.\n\n2015: Redwing Mineresumesoperations after dewatering exercise. The companyprojects111,000 ounces of gold annually by 2019.\n\n2019: The companys production projections prove unrealistic, and Redwing Mine is in financial difficulty.\n\nJuly 2020: Redwing Mine is placed under corporate rescue by the High Court following action by workers unions and creditors for failure to pay wages and contractual payments. Shatirwa InvestmentssuesMetallon Gold and subsidiaries for an outstanding debt of over US$6-million.\n\nJuly 2020: The mine enters corporate rescue, with Knowledge Hofisi acting as the Interim Corporate Rescue Partner. During this time, Scott Sakupwanya annexes Redwing Mine under a controversial Tributary Agreement,enablingBetterbrands to acquire 132 mining claims from Redwing.\n\n2020-2021: Prime Royal Mining (PRM) is contracted to operate the mine during the corporate rescue process. PRMs agreement with Redwing allows artisanal miners to operate on the site, with profits split between the mine and artisanal miners.\n\n2022: Redwing Mine emerges from corporate rescue following a Supreme Court ruling. Despite this, Metallon is unable to regain control of the mine. Instead, Metallonannouncesa partnership with Hennessy Capital Investment Corp. VI, a Nasdaq-listed American special purpose acquisition company, to raise capital through a new entity, Namib Minerals, with the goal of reintroducing sustainable mining at Redwing and Mazowe mines.\n\nJanuary 2023: The Environmental Management Authority (EMA) closes Redwing Mine due to 26 fatalities in a single month. EMA cites concerns about environmental degradation andsafetyrisks. Despite the closure, mining operationscontinueunder Betterbrands without meaningful action being taken to address the issues.\n\nApril 2023: Redwing Mineresumesoperations, despite the lack of action to address safety and environmental concerns following the earlier closure.\n\nJanuary 2024: Another shutdownoccurswhen 15 miners are trapped in a collapsed shaft in the Tsapaota area. The Manicaland Provincial Mining Directors office issued a letter describing numerous safety and regulatory violations, including inadequate shaft support, lack of access control, and violations of mining safety standards.\n\nMarch 2024: Operations at Redwing Mine resumes without oversight and safety measures. Illegal activities, such as smuggling gold ore, persist.\n\nJanuary 2025: The Centre for Research and Development (CRD)revealsthat over 700 illegal hammer mills and cyanidation tanks are processing gold ore illegally extracted from Redwing Mine. Artisanal miners report ongoing corruption and bribery involving police officers and Zanu-PF officials.\n\nMarch 2025: Artisanal mining at Redwing remains unregulated, with significant safety, environmental and regulatory issues unresolved, and the risk of further fatalities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24193329/redwing_medium_shots_31_huge.jpg",
            "description": "<p>By Owen Gagare | GroundUp News Death stalks artisanal miners working in dangerous conditions at Redwing Mine in eastern Zimbabwe. The mine came under the control of a politically-connected company when it was placed under corporate rescue. Leaked rescue team reports reveal numerous unreported deaths from gas exposure and tunnel collapses. Government authorities, police and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/deaths-cover-ups-and-bribes-at-zimbabwes-lawless-redwing-mine/\">Deaths, cover-ups and bribes at Zimbabwe’s lawless Redwing Mine</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Harare residents up in arms with the City Council over multi-taxation",
            "url": "https://www.newzimbabwe.com/harare-residents-up-in-arms-with-the-city-council-over-multi-taxation/",
            "content": "By Staff Reporter\n\nHARARE residents face yet another blow to their strained budgets as the City of Harare rolls out three new levies targeting water infrastructure, street lighting, and ambulance services.\n\nThe move has sparked outrage among civic groups, who accuse the local authority of financial mismanagement and unfairly taxing citizens already burdened by one of the highest tax regimes in the region.\n\nThe Combined Harare Residents Association (CHRA) and the Zimbabwe Taxpayers Platform (ZITAP) have slammed the levies, pointing to the councils history of failing to account for public funds properly.\n\nIn a joint statement, the two organisations raised concerns over reports of inflated executive salaries within the council, alongside the handing over of key revenue streams to private entities and parastatals.\n\nThese new charges come amid revelations of fiscal abuse, where the City has been paying its top officials exorbitant salaries while surrendering critical revenue sources to private players, said CHRA and ZITAP.\n\nCHRA and ZITAP argue that the levies amount to double taxation, as the City already collects enough revenue to fund these services if managed properly.\n\nThey warned that water revenue lacks transparency, leaving it vulnerable to misuse.\n\nThe groups also highlighted the governments failure to disburse constitutionally mandated devolution funds.\n\nDespite Section 301(3) of the Constitution requiring fair allocation of national revenue to local authorities, Harare had received just 1.91 percent of its total devolution share by November 2024a meagre ZIG 1.218 million.\n\nInstead of pressuring the central government to release funds, the City is shifting the burden onto residents already struggling to make ends meet, read the statement.\n\nAs frustration grows, Harare residents are demanding not just an end to the new charges, but also greater transparency, accountability, and financial fairness from both council and government.\n\nHarare residents are miffed by the City Councils prioritisation of perks for senior officials, neglecting its core mandate.\n\nThis approach forces the financial burden onto residents who are already struggling, instead of holding the central government accountable for its failure to release the necessary funds for capital projects and infrastructure, read the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/07224513/town-house.jpg",
            "description": "<p>By Staff Reporter HARARE residents face yet another blow to their strained budgets as the City of Harare rolls out three new levies targeting water infrastructure, street lighting, and ambulance services. The move has sparked outrage among civic groups, who accuse the local authority of financial mismanagement and unfairly taxing citizens already burdened by one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-up-in-arms-with-the-city-council-over-multi-taxation/\">Harare residents up in arms with the City Council over multi-taxation </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "Telecoms mogul Masiyiwa set to build Africa’s first AI factory powered by Nvidia",
            "url": "https://www.newzimbabwe.com/telecoms-mogul-masiyiwa-set-to-build-africas-first-ai-factory-powered-by-nvidia/",
            "content": "BusinessInsiderAfrica\n\nCassava Technologies, founded by Zimbabwean telecoms mogul Strive Masiyiwa, has partnered with Nvidia Corp. to establish Africas first artificial intelligence (AI) factory.\n\nAccording to a statement on Cassavas website, the company will integrate Nvidias cutting-edge computing and AI software into its data centres in South Africa by June 2025, with further expansion planned for Egypt, Kenya, Morocco, and Nigeria.\n\nThis will give African businesses, governments and researchers access to cutting-edge AI computing capacity, helping them develop smarter AI products, streamline operations and stay competitive in a fast-changing world. It provides the supercomputers and software needed to train AI while keeping data within Africas borders,the statement read.\n\nMasiyiwa stressed that developing AI infrastructure is crucial for Africa to fully harness the opportunities of the Fourth Industrial Revolution, positioning the continent for technological and economic transformation.\n\nOur AI factory provides the infrastructure for this innovation to scale, empowering African businesses, startups and researchers with access to cutting-edge AI infrastructure to turn their bold ideas into real-world breakthroughs and now they dont have to look beyond Africa to get it, he said.\n\nAI is helping innovators solve our greatest challenges in agriculture, healthcare, energy, financial services and many other industries creating opportunity in Africa,said Jaap Zuiderveld, VP EMEA at NVIDIA. As an NVIDIA Cloud Partner, Cassava is providing essential infrastructure and software to help pioneering companies and organizations accelerate AI development to foster innovation across the continent.\n\nCassava Technologies is set to become the first company to introduce accelerated computing to Africa as an Nvidia cloud partner.\n\nMeanwhile, global tech firms are also eyeing Africas digital future. Last year, Microsoft Corp. and G42, the UAEs leading AI company, announced plans to invest $1 billion in a geothermal-powered data centre in Kenya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/07/22062820/Strive-Masiyiwa.jpg",
            "description": "<p>BusinessInsiderAfrica Cassava Technologies, founded by Zimbabwean telecoms mogul Strive Masiyiwa, has partnered with Nvidia Corp. to establish Africa’s first artificial intelligence (AI) factory. According to a statement on Cassava’s website, the company will integrate Nvidia’s cutting-edge computing and AI software into its data centres in South Africa by June 2025, with further expansion planned for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/telecoms-mogul-masiyiwa-set-to-build-africas-first-ai-factory-powered-by-nvidia/\">Telecoms mogul Masiyiwa set to build Africa’s first AI factory powered by Nvidia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "World Cup Qualifier: Zimbabwe not scared of Super Eagles – Chirewa",
            "url": "https://www.newzimbabwe.com/world-cup-qualifier-zimbabwe-not-scared-of-super-eagles-chirewa/",
            "content": "BusinessDayNG\n\nZimbabwemidfielder Tawanda Chirewa has vowed the Warriors will not be intimidated by theSuper Eaglesof Nigeria when they clash in a crucial2026 FIFA World Cup qualifierat the Godswill Akpabio Stadium in Uyo on Tuesday.\n\nSuper Eagles new head coach Eric Chelle secured his first victory in charge as Nigeria defeated Rwanda 2-0 last Friday in Kigali. The win breathed new life into their Group C qualifying campaign, following a poor start that saw them collect just one point from their opening four matches.\n\nBefore their win against Rwanda, the three-time Africa Cup of Nations champions endured a frustrating run.With the victory over Rwanda, Nigeria climbed to fourth place in Group C with six points, while Zimbabwe remained bottom of the table with three points from five matches.\n\nDespite their struggles, Tawanda Chirewa, the Huddersfield Town midfielder who is on loan from Premier League side Wolverhampton Wanderers, remains confident in Zimbabwes chances against Nigeria.\n\nIm just focused on recovery and preparing to go again on Tuesday against Nigeria, which is a very good team, Chirewa, 21, told The Standard.\n\nA lot of their players compete in England and Europe, but I want to go out there and showcase my abilities. Our squad also has plenty of talented players, so theres no reason to fear Nigeria.\n\nWith only three points from five matches, Zimbabwe faces a must-win scenario to keep their fading qualification hopes alive. Meanwhile, Eric Chelle will be eager to build on his debut victory when Nigeria host Zimbabwe on Tuesday, March 25, at the Godswill Akpabio International Stadium.\n\nThe Super Eagles will be looking to make it back-to-back wins, while Zimbabwe will be desperate for their first victory in the campaign.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24183751/chirewa-warriors-e1742841491841.jpeg",
            "description": "<p>BusinessDayNG Zimbabwe midfielder Tawanda Chirewa has vowed the Warriors will not be intimidated by the Super Eagles of Nigeria when they clash in a crucial 2026 FIFA World Cup qualifier at the Godswill Akpabio Stadium in Uyo on Tuesday. Super Eagles regain momentum under Eric Chelle Super Eagles’ new head coach Eric Chelle secured his first victory in charge as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/world-cup-qualifier-zimbabwe-not-scared-of-super-eagles-chirewa/\">World Cup Qualifier: Zimbabwe not scared of Super Eagles – Chirewa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "US cuts to HIV aid will cost millions of lives – UNAids chief",
            "url": "https://www.newzimbabwe.com/us-cuts-to-hiv-aid-will-cost-millions-of-lives-unaids-chief/",
            "content": "BBC\n\nUS funding cuts will lead to an additional 2,000 new HIV infections each day and over six million further deaths over the next four years, the UNAids chief has warned.\n\nIt would mark a stark reversal in the global fight against HIV, which has seen the number of deaths from the disease decrease from more than two million in 2004 to 600,000 in 2023, the most recent year for which figures are available.\n\nUNAids Executive Director Winnie Byanyima said the US governments decision to pause foreign aid  which included funding for HIV programmes  was already having devastating consequences.\n\nShe called on the US to reverse the cuts immediately, warning women and girls were being hit particularly hard.\n\nUS President Donald Trump announced the pause on foreign aid, for an initial 90 days, on his first day in office in January as part of a review into government spending. The majority of the US Agency for International Developments (USAID) programmes have since been terminated.\n\nMany US-financed HIV treatment and prevention programmes received stop work orders, leading to the closure of mother and baby clinics in Africa, and severe shortages of life saving anti-retroviral (ARV) medicines.\n\nMs Byanyima said she feared a return to the 1990s, when HIV medication was scarcely available in poorer countries, and infections and deaths soared.\n\nThe US has for years been the single biggest funder of HIV treatment and prevention, and Ms Byanima thanked Washington for its generosity and humanity.\n\nShe added it was reasonable for the US to want to reduce its funding  over time, but said the sudden withdrawal of lifesaving support [was] having a devastating impact.\n\nThere has been no sign that Washington is listening to appeals to change course.\n\nTraditional aid donors in Europe also plan funding cuts, and UNAids  the joint UN agency which combats HIV  has had no indication that other countries might step in to fill the gap left by the US.\n\nSpeaking in Geneva on Monday, Ms Byanyima described the case of Juliana, a young woman in Kenya living with HIV. She worked for a US-funded programme that supported new mothers to access treatment to ensure their babies did not develop the disease.\n\nUNAids Executive Director Winnie Byanyima\n\nWith the programme suspended, Ms Byanyima said Juliana was not only out of work but, because she was still breastfeeding her youngest child, she also feared losing the treatment she needed.\n\nPreviously, the World Health Organization (WHO) said eight countries  Nigeria, Kenya, Lesotho, South Sudan, Burkina Faso, Mali, Haiti and Ukraine  could soon run out of HIV drugs after the US funding pause.\n\nWHO chief Tedros Adhanom Ghebreyesus warned that disruption to HIV programmes could undo 20 years of progress.\n\nIn February, South Africas leading Aids lobby group, the Treatment Action Campaign (TAC), warned the country could see a return to when HIV patients struggled to access necessary services for their treatment.\n\nWe cant afford to die, we cant afford to go back to those years where we were suffering with access to services, especially for people living with HIV treatment, said TAC chair Sibongile Tshabalala.\n\nMs Byanyima also proposed a deal to the Trump administration, offering an opportunity to market a new US-developed ARV to millions of people.\n\nLenacapavir, made by US company Gilead, is given by injection every six months, with UNAids believing 10 million people could benefit from it.\n\nThe profits and jobs resulting from such a deal would be hugely beneficial to the US, Ms Byanyima added.\n\nUNAids is one of a number of UN agencies facing funding cuts.\n\nThe UN Refugee Agency has suggested it may have to lose 6,000 jobs, while Unicef has warned that progress to reduce child mortality is threatened, and the World Food Programme has had to cut rations in famine threatened regions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/01/17083257/Know-your-HIV-status-e1579250018379.jpeg",
            "description": "<p>BBC US funding cuts will lead to an additional 2,000 new HIV infections each day and over six million further deaths over the next four years, the UNAids chief has warned. It would mark a stark reversal in the global fight against HIV, which has seen the number of deaths from the disease decrease from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-cuts-to-hiv-aid-will-cost-millions-of-lives-unaids-chief/\">US cuts to HIV aid will cost millions of lives – UNAids chief</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "‘Proud moment for all Africa’: South Africa’s Gayton McKenzie celebrates Kirsty Coventry’s on historic IOC presidency",
            "url": "https://www.newzimbabwe.com/proud-moment-for-all-africa-south-africas-gayton-mckenzie-celebrates-kirsty-coventrys-on-historic-ioc-presidency/",
            "content": "IOL\n\nMinister of Sport, Arts and Culture, Gayton McKenzie has expressed joy and anticipation after Zimbabwes Minister of Sports, Art and Recreation, swimming sensation Kirsty Coventry has become the first woman and African to be elected president of theInternational Olympic Committee (IOC).\n\nAt 41, the two-time Olympic swimming champion is also the youngest ever elected to be the most powerful person in sports governance. She will begin her eight-year term in charge of the IOC in June.\n\nIOL has previously reported thatmoments after Coventry was elected the 10th president of the IOC, she told the audience at the 144th IOC Session in Costa Navarino, Greece, on Thursday: I hope that this vote will be an inspiration to many people. Today glass ceilings were shattered, and I am fully aware of my responsibilities as a role model.\n\nIn South Africa, McKenzie said Coventrys ascension to world sports top job signals a welcome step forward in the global dynamics of sport administration.\n\nWe must pay tribute to the work of the outgoing president of the IOC, Dr Thomas Bach, who received us so warmly and respectfully as a member country at Olympic House, after paying an official visit to South Africa last year, said McKenzie.\n\nTo know that the reins are being passed to an individual as accomplished and outspoken as Kirsty Coventry fills us with hope for the future of world sport, and Africa and the Global Souths place in it.\n\nKirsty Coventry\n\nMcKenzie also spoke glowingly of Coventrys achievements.\n\nShe was already the most decorated Olympian in African history, with seven medals, including two golds.\n\nShe has now reached the highest of pinnacles in all of sport, added Minister McKenzie, paying tribute to the strong support Coventry was given by IOC members, winning the election on the first ballot, with 49 votes.\n\nThis achievement is a proud moment for all of Africa. I look forward to engaging the president-elect personally in days to come, and to express my support for all the hard work that we know still lies ahead.\n\nSpokesperson for the Department of Sport, Arts and Culture, Stacey-Lee Khojane said since becoming minister in 2024, McKenzie has used the platform tirelessly to argue the case for the end of what he has termed sports apartheid, where some of the worlds premier sporting tournaments never see expression through hosting in Africa.\n\nWhile numerous countries have hosted multiple Olympic Games, the entire continent of Africa has never hosted one, said Khojane.\n\nIn a move towards changing this imbalance, South Africa lodged an Expression of Interest to host the 2036 Olympic and Paralympic Games with the IOC in Switzerland in November of 2024, in a ministerial delegation that included the South African Sports Confederation and Olympic Committee, with the support of IOC Member in South Africa, Anant Singh, and IOC Honorary Member Sam Ramsamy.\n\nIOL reported last week that Coventrys election to global sports most powerful position marks a significant advancementin breaking glass ceilings that have historically sidelined women from leadership roles in sports. Her triumph stands as a beacon of hope for underrepresented voices in a field traditionally dominated by men.\n\nIn her acceptance speech, Coventry said: This is an extraordinary moment. As a nine-year-old girl, I never thought Id be standing up here one day, getting to give back to this incredible movement of ours.\n\nThis is not just a huge honour but is a reminder of my commitment to every single one of you that I will lead this organisation with so much pride, with the values at the core. And I will make all of you very, very proud, and hopefully extremely confident in the decision that you have taken today. Now weve got some work together.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/19181937/Patriotic-Alliance-PA-leader-Gayton-McKenzie-emphasizes-his-stance-on-illegal-immigration-in-South-Africa-ahead-of-the-2026-elections.webp",
            "description": "<p>IOL Minister of Sport, Arts and Culture, Gayton McKenzie has expressed ‘joy and anticipation’ after Zimbabwe’s Minister of Sports, Art and Recreation, swimming sensation Kirsty Coventry has become the first woman and African to be elected president of the International Olympic Committee (IOC). At 41, the two-time Olympic swimming champion is also the youngest ever elected</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/proud-moment-for-all-africa-south-africas-gayton-mckenzie-celebrates-kirsty-coventrys-on-historic-ioc-presidency/\">‘Proud moment for all Africa’: South Africa’s Gayton McKenzie celebrates Kirsty Coventry’s on historic IOC presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        },
        {
            "title": "‘My daughter is alive’: Lesedi Molapisi’s father denies ‘fake news’ of execution in Bangladesh",
            "url": "https://www.newzimbabwe.com/my-daughter-is-alive-lesedi-molapisis-father-denies-fake-news-of-execution-in-bangladesh/",
            "content": "TimesLive\n\nGoitsemodimo Molapisi, the father of Lesedi Molapisi, is urging the public to cease spreading fake news about his daughters fate after reports of her execution circulated online.\n\nLesedi, who was arrested at a Bangladesh airport in 2022 with about 3kg of heroin, was sentenced to death for drug trafficking.\n\nGoitsemodimo is adamant that his daughter is still alive and believes that she will be released.\n\nIm praying day and night. My daughter will be released. Im hopeful, he said in an interview with Newzroom Afrika.\n\nIn an emotional plea, Goitsemodimo expressed his distress about the harmful rumours.\n\nWe were shocked to see fake news trending in the news media to the fact that my daughter has been executed, and this has been speculated by heartless people who are not sensitive enough to accommodate the parents, relatives and friends of Lesedi, he said.\n\nMy daughter is still alive  as you might be aware, she is in prison in Bangladesh. We have made an appeal, and she cannot be executed while that is being processed.\n\nLesedis arrest came as a shock to her family, especially her father, who revealed that he had no knowledge of her trip to Bangladesh.\n\nLesedi was not working. She was staying in Gaborone with her elder sister, and before her arrest she visited us in December. She left us around January 18 2022. We were really shocked.\n\nGoitsemodimo said his daughter is alive and he has been in communication with her every week.\n\nI speak to Lesedi every Friday through her lawyer in Bangladesh. Even last Friday, we talked. Shes still healthy, but the problem is that shes suffering from depression after being in prison for more than three years.\n\nGoitsemodimo said he is in contact with Lesedis lawyers and they have filed an appeal. They are awaiting a response from the judges.\n\nThe Botswana government has also been actively assisting in the case, with efforts to have Lesedi extradited to Botswana for prosecution.\n\nGoitsemodimo expressed his gratitude for the support from Botswanas government, particularly fromPresident Duma Boko.\n\nIm very happy with the diplomatic efforts made by the president in assisting the family to secure a pardon for Lesedi. He is doing his best and Im quite happy with the level of assistance.\n\nHe condemned those responsible for circulating the false reports of his daughters execution. This has affected us a lot because we are still working around the clock to assist my daughter, together with the government of Botswana, and these people are starting to speculate. It is really affecting us.\n\nHe also expressed frustration with the way some individuals on social media have handled the situation: Those people who are spreading heartless fake news are really affecting us. We appeal to all the people using news media platforms to assist us by praying for my daughter instead of spreading these rumours. It feels like we have taken part in the offence that has been committed by my daughter, and that is not right.\n\nIm not happy with how people are commenting on social media. Some even seem to want to hear that my daughter has been executed.\n\nGoitsemodimo said once Lesedi is released, he plans to support her recovery.\n\nThe first thing I will do [is] just take for counselling. I will take her to professionals so that they can counsel her, and then well sit down and talk as to why she went to Bangladesh, because she never informed us.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/24194524/lesedi.png",
            "description": "<p>TimesLive Goitsemodimo Molapisi, the father of Lesedi Molapisi, is urging the public to cease spreading fake news about his daughter’s fate after reports of her execution circulated online. Lesedi, who was arrested at a Bangladesh airport in 2022 with about 3kg of heroin, was sentenced to death for drug trafficking. Goitsemodimo is adamant that his</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/my-daughter-is-alive-lesedi-molapisis-father-denies-fake-news-of-execution-in-bangladesh/\">‘My daughter is alive’: Lesedi Molapisi’s father denies ‘fake news’ of execution in Bangladesh</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "25 Mar 2025"
        }
    ]
}