{
    "news": [
        {
            "title": "Mnangagwa’s online stormtroopers target women who speak out",
            "url": "https://www.newzimbabwe.com/mnangagwas-online-stormtroopers-target-women-who-speak-out/",
            "content": "The Varakashi are using anonymous and fake accounts to mock, delegitimise and threaten opposition to the ruling ZANU PF party.\n\nZimbabwes brutal regime, under President Emmerson Mnangagwa, is using social media, particularly X, to smear and silence mostly female anti-government political activists and human rights defenders in the country.\n\nPresident Mnangagwas army of paid pro-government social media trolls is known as theVarakashipropaganda stormtrooperswith some using names of prominent people to open fake X accounts without their knowledge. One ghostX account usesthe name of Zimbabwes former vice president, Joice Mujuru. Even President Mnangagwas spokesperson, George Charambawho is also a senior government employee runs two toxic ghost X accounts@Jamwanda2and@dhonzamusoro007which he uses to attack and post completely fabricated and malicious information about female human rights defenders and political activists in Zimbabwe. The first of these accounts wassuspended in 2022but was reinstated after Elon Musk acquired Twitter and renamed it X.\n\nIn the past year there has been a proliferation of toxic X accounts in the country and they are flourishing. At times, these X accounts incite physical and sexual violence against female political and human rights activists. In one post, a ghost X account threatened a prominent human rights activist that [Im] waiting to rape you. The post drew outrage from X users, and it was later deleted.\n\nAnd in astudy published in 2023, Constance Kasiyamhuru from the University of Johannesburg in South Africa said the Varakashi in Zimbabwe operate mostly on Twitter/X to shut down the political opponents of the governing Zanu PF party.\n\nThrough trolling, name-calling, threats, mocking, mobbing, labelling, ridicule, casting aspersions, delegitimation, disinforming, and other strategies, Varakashi seek to regulate, censure, and discipline anti-musangano[anti-ruling party] online discourse, Kasiyamhuru wrote.\n\nTendai Ruben Mbofana, a Zimbabwe based social justice advocate and writer, said the systematic deployment of online trollsparticularly targeting female human rights defenders and political activistshas become a chilling hallmark of repression in Zimbabwe.\n\nThese smear campaigns are not just personal attacks; they are part of a broader strategy to delegitimise our work, intimidate us into silence, and discredit our credibility in the eyes of the public, Mbofana said.\n\nHe added that the abuse often takes on a deeply misogynistic tone, laced with gendered insults, threats of sexual violence, and false accusations designed to shame and isolate women.\n\nIt creates a climate of fear and forces many women out of digital spaces that should otherwise be used to amplify their voices and advocacy, he said.\n\nSophia Gwasira, who was elected as the first female mayor for Mutare City in eastern Zimbabwe in August 2023, told Index on Censorship that the fear of being smeared and attacked on social media platforms by Zanu PF social media trolls was forcing many women to abandon opposition politics and activism. She said social media platforms were no longer safe places for women in opposition politics in Zimbabwe, with the attackes affecting both them and their families.\n\nIts affecting us not only physically but emotionally too. We are trying to find ways of countering these attacks. But currently we dont have any protection from our own political parties or from the government, Gwasira said.\n\nBut Gwasira said she will continue to fight for the people and, given the opportunity, she would contest the general elections slated for 2028. Gwasira and many other opposition mayors, MPs and councillors were recalled in late 2023 after her party, the Citizens Coalition for Change (CCC)was hijackedby President Mnangagwas ruling party Zanu PF through its proxy, Sengezo Tshabangu. This forced the CCC leader Nelson Chamisa toabandon the oppositionparty and he took a sabbatical from party politics in January 2024.\n\nPromise Mkwananzi, spokesperson for opposition party Citizens Coalition for Changewhich is still loyal to former leader Nelson Chamisa told Index on Censorship that as opposition, they have been identifying and exposing some of these social media ghost accounts and to direct their members to counter the toxic narratives on X.\n\nIt must be noted also that these trolls are paid using taxpayers money to denigrate women and bully voices of the alternative on social media, Mkwananzi said.\n\nBut Mkwananzi was quick to add that his party will continue to fight and mobilise people for a better Zimbabwe.\n\nWe are also educating our members to be strong and to remain focused on recruiting mobilising, educating and radicalising the base.\n\nAlthough women are the main target, men critical of the ruling party are also targeted.\n\nIn my own experience, I have faced repeated, coordinated attacks on X, particularly from anonymous accounts believed to be run or supported by high-ranking government officials, including the presidents spokesperson. These attacks are aimed at silencing dissent and discouraging public engagement. But we will not be silenced. If anything, these attacks only reinforce the urgency of our work, said Tendai Ruben Mbofana Mbofana.\n\nWhen President Mnangagwaseized powerthrough a military coup from Zimbabwes long-time dictator, Robert Mugabe in 2017, President Mnangagwa promised sweeping reforms; economic and political reforms, including upholding human rights and rule of law in the country.\n\nHowever, Zimbabwe has become worse under President Mnangagwa than Mugabe; political opponents to Zanu PF have been brutalised,torturedandkilledand corruption is widespread.\n\nA recent reportby Human Rights Watch said authorities in Zimbabwe have continued to restrict civic space and the rights to freedom of expression, association, and peaceful assembly and the human rights, political and economic situation in Zimbabwe continues to deteriorate.\n\nUnder the current constitution, President Mnangagwas term of officehis second and last termends in 2028 but his party is now planning to amend the constitution to keep him in office till 2030. Meanwhile, Mnangagwas Varakashi are flooding social media with messages in support of the extension of his term and touting his achievements so far.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Andrew Mambondiyani | Index on Censorship The Varakashi are using anonymous and fake accounts to mock, delegitimise and threaten opposition to the ruling ZANU PF party. Zimbabwe’s brutal regime, under President Emmerson Mnangagwa, is using social media, particularly X, to smear and silence mostly female anti-government political activists and human rights defenders in the country.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwas-online-stormtroopers-target-women-who-speak-out/\">Mnangagwa’s online stormtroopers target women who speak out</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "Defence Minister to pay US$25,000 compensation to 2018 August 1 shooting victim",
            "url": "https://www.newzimbabwe.com/defence-minister-to-pay-us25000-compensation-to-2018-august-1-shooting-victim/",
            "content": "By Thandiwe Garusa\n\nDEFENCE Minister Oppah Muchinguri has been ordered to pay US$25,000 in compensation to Zakeo Mutimutema, a victim of the 2018 August 1 army shootings.\n\nMutimutema sustained serious eye injuries from shattered glass caused by bullets fired by soldiers during the 2018 post-election protests following a delay in releasing the Presidential poll results by the Zimbabwe Electoral Commission.\n\nHe worked for the Zimbabwe Congress of Trade Unions (ZCTU) and live shots were fired at a building which housed their offices.\n\nThe Zimbabwe Lawyers for Human Rights (ZLHR), which helped Mutimutema sue Muchinguri, Cultural Heritage Minister Hon. Kazembe Kazembe, and ZRP Commissioner-General Stephen Mutamba for damages, said the victim was initially awarded ZWL$295,000 in November 2020, which was unpaid and lost value due to inflation.\n\nThe labour law specialist had to undergo three unsuccessful eye surgeries to remove fine glass particles that pierced his eyes after a bullet fired by soldiers shattered glass windows at his ZCTU offices.\n\nMutimutema, who was represented by Obey Shava of ZLHR, had initially been awarded ZWL$295,000 as damages in November 2020 as damages for pain and suffering, medical expenses and general damages which Muchinguri, Kazembe and Mutamba had reneged on paying.\n\nThe labour law specialist had to file an application wherein he amended his summons, arguing that the compensation award had been significantly eroded by inflation.\n\nOn Tuesday 29 July 2025, Mutimutema was a relieved man after Muchinguri agreed to pay the labour law specialist US$25,000 as compensation for damages for current and future medical expenses, pain and suffering and general damages, ZLHR said.\n\nAt least six people were shot dead by soldiers during the protest.\n\nA Commission of Inquiry, chaired by former South African President Kgalema Motlanthe and appointed by President Emmerson Mnangagwa to probe the post-election violence, recommended that government should compensate all the victims of the shootings and prosecute perpetrators.However, there has been no prosecution of perpetrators.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/13122619/oppah-kazembe-e1712810265882.jpg",
            "description": "<p>By Thandiwe Garusa DEFENCE Minister Oppah Muchinguri has been ordered to pay US$25,000 in compensation to Zakeo Mutimutema, a victim of the 2018 August 1 army shootings. Mutimutema sustained serious eye injuries from shattered glass caused by bullets fired by soldiers during the 2018 post-election protests following a delay in releasing the Presidential poll results</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/defence-minister-to-pay-us25000-compensation-to-2018-august-1-shooting-victim/\">Defence Minister to pay US$25,000 compensation to 2018 August 1 shooting victim</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "Emmanuel Mandiranga returns to Zim PSL, joins Manica Diamonds",
            "url": "https://www.newzimbabwe.com/emmanuel-mandiranga-returns-to-zim-psl-joins-manica-diamonds/",
            "content": "By Sports Reporter\n\nFormer Dynamos and CAPS United forward Emmanuel Mandiranga has joined Manica Diamonds as part of its mid-season transfer signings.\n\nMandiranga is making his return to the Zimbabwe Premier Soccer League since 2022.\n\nThe 29-year-old forward was in Mozambique, where he played for UD Songo since 2023.\n\nAlthough details of his contract have not been revealed, NewZimbabwe.com understands that Mandiranga started to train with the Mutare-based side on Tuesday.\n\nMeanwhile, Manica Diamonds has released midfielder Issa Sadiki on loan to Chicken Inn FC.\n\nSadiki joined the club in January from Dynamos, but he unfortunately struggled to make it into the team.\n\nManica Diamonds is one of the relegation candidates in the league, currently on position 16 on the log with 23 points, 13 ahead of the bottom-placed Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30192628/emmanuel-mandiranga.jpg",
            "description": "<p>By Sports Reporter Former  Dynamos and CAPS United forward Emmanuel Mandiranga has joined Manica Diamonds as part of its mid-season transfer signings. Mandiranga is making his return to the Zimbabwe Premier Soccer League since 2022. The 29-year-old forward was in Mozambique, where he played for UD Songo since 2023. Although details of his contract have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/emmanuel-mandiranga-returns-to-zim-psl-joins-manica-diamonds/\">Emmanuel Mandiranga returns to Zim PSL, joins Manica Diamonds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "‘Impossible not to be emotional’: How Ian Prior came out of retirement to help Zimbabwe end Rugby World Cup drought",
            "url": "https://www.newzimbabwe.com/impossible-not-to-be-emotional-how-ian-prior-came-out-of-retirement-to-help-zimbabwe-end-rugby-world-cup-drought/",
            "content": "By Francisco Isaac | Rugby Pass\n\nBy 2024,Ian Priorhad basically done it all. Hed been a professional player for 14 years. Hed won a Super Rugby title with the Reds, played in the Premiership with Harlequins, captained the WesternForceand played for the Perth franchise over 100 times.\n\nWith his Force contract expiring, Prior had decided to bring down the curtain on his rugby career. Fate, though, had other ideas. A year later, he stood on a Ugandan pitch with aZimbabweshirt on his torso, back-to-back Rugby Africa Cup titles won andRugby World Cupqualification secured.\n\nFor many players, taking a call from the Zimbabwe Rugby Union with an invitation to help the bid to reachAustralia2027 mightnt be reason enough to abandon retirement plans. But Prior, born in Perth to Zimbabwean parents, could not resist the opportunity. The utility back lived in Zimbabwe between 1993 and 2000 and has never forgotten what the country means to him.\n\nI had always dreamed of going back, Prior tells RugbyPass. Zimbabwe was and is a beautiful country, and I enjoyed a wonderful life growing up there. The wildlife, the freedom, and holidaying around Lake Kariba and the Zambezi River. I experienced so many great moments there. It left a deep imprint on my heart.\n\nFirst and foremost, the people from Zimbabwe are the most special part of the country. They are resilient, adaptable and even in the hardest of times they find a way to make it all work. Of course, the wildlife and the landscape are majestic as well, there arent many places in the world you get to enjoy things like Lake Kariba.\n\nPrior did not immediately leap at the Zimbabwean unions advances.\n\nAt the end of the day it comes down to what your values are, he reflects. My parents and sister were born in there, I grew up there as well, and I had the opportunity to make a difference. For me it was enough to motivate me to get involved.\n\nIt meant a lot to my family. They were born in what was Rhodesia at the time, grew up in it and then became part of Zimbabwe, devoting their lives to it. So, for me, it was a special occasion to represent my country as I got to represent my familys history and heritage. It was such a great honour, and in the end, I presented the Rugby Africa Cup final game jersey to my parents. It was the best way to honour them and to honour the love they have for Zimbabwe.\n\nI remember praying for another chance when Swanepoel was taking that last shot.\n\nWith memories from the past floating back, Prior recalls how he played barefoot rugby and cricket in Zimbabwe, and how these early carefree days were the start of his sports journey.\n\nMy dad actually tells a pretty funny story. After my first rugby training session, I got home, and I was looking a bit disappointed. My parents could tell and asked what happened, and I explained I was going to play lock for my schools D team.\n\nMy father thought it was a bit strange, as I was always playing rugby with my neighbours, and had some skills, but told me it was okay and to just keep working hard and have fun. I played that first game, and after a week, I came back home saying that I had been picked for the main team as a half-back and captain. My parents thought I was lying. It was a big 180.\n\nZimbabwe defeated Namibia in successive African finals. Last year was supposed to be a transitional campaign as the Sables built towards a shot at reaching the World Cup. Sinking one of their biggest and oldest rivals changed everyones perspectives.\n\nMost of our boys had never won against Namibia, and they were sweating throughout the whole week thinking about that game, Prior says. However, the game came, and we started to make little inroads here, a line break there, win a scrum, and the team thought we can do this. We started believing it was more than viable for us to win. It was the catalyst for what came next.\n\nWith silverware bagged, the Sables had jumped into centre stage and were viewed as one of the two favourites for the Africa World Cup qualification spot. After successfully beating Morocco and Kenya, they were in the final with Namibia again serving as the last obstacle. Zimbabwe surged into a 14-point lead, but Namibia roared back to within two, before Tiaan Swanepoels 79th-minute penalty fell. Zimbabwe clung on to win an epic final 30-28, ending a 34-year wait for a World Cup berth.\n\nIt had a bit of everything, didnt it? Prior says. We switched off for a period, and the game became completely unpredictable. I was trying to come up with solutions and a plan, a drop goal or setting up a penalty. I remember praying for another chance when Swanepoel was taking that last shot. Fortunately for us, it was short, and we were able to hang on until the end.\n\nPriors own story is all the more remarkable since he gave up the pro game at club level last year. He amassed 52 points and assisted five tries in the African tournament, and was named most valuable player.\n\nI remember back in January thinking to myself, how am I going to do this? How am I going to be on the same level as I was before? My life was 100% different, I had a full-time job, which meant training outside of working hours. I have a family now and so many otherresponsibilities. So, with all these questions, I set a high goal: to be the player of the tournament. I wanted to qualify Zimbabwe for the World Cup. I was willing to put in the work.\n\nBut couldnt Prior go abroad and tune up in Japan, the USA, France or somewhere else?\n\nI remember we came into 2024 with no warm-up games, just two weeks of camps and won it. So, imagine what we can do if we invest a bit more.\n\nI had some offers overseas, mainly from the MLR and Japan, but I didnt want to shake up things at home, as my kids were starting school and my wife had a good position as a dietitian in the Western Australian Institute of Sport. It felt really selfish for me to change everything. It turned out to be the right time to see what the next chapter would be. I am currently working as a leadership, resilience and crisis management consultant. It has been an exciting new chapter of my life.\n\nHis efforts to honour his family, friends, teammates and country were successful and that recognition as player of the Rugby Africa Cup was welcomed with joy.\n\nI got quite emotional when my name was read out. Everything just came together. I remember walking up to the stage, and I was crying. It was impossible not to beovercome with emotion, especially when I had doubts that I could perform at that level again six months before the Africa Cup.\n\nWe had heaps of videos of people supporting us coming through. We were emotional to see how Zimbabweans all over the world were supporting us. It was such a proud day for all of us, especially after what the country went through in the early 2000s.\n\nPrior firmly believes a new dawn awaits Zimbabwean rugby.\n\nIf we get some good funding and get the right pathway model set up, focus on developing more new players, and if we can nurture it in the right way, the sky is the limit. We won back-to-back Rugby Africa Cups without the same resources other teams had. I remember we came into 2024 with no warm-up games, just two weeks of camps and won it. So, imagine what we can do if we invest a bit more.\n\nTheres a considerable expectation for Prior to keep going and be available for selection when Australia 2027 arrives. Hell be 36 when the competition begins, but the allure of playing at a World Cup in his homeland is powerful.\n\nIt would be a lie if I said I wasnt happy with what I achieved until now. But the chance to play a home World Cup, with the possibility of Perth, my home town, hosting one of the games, is too big for me to pass up. On top of that, theres also the chance of Zimbabwe setting up camp in Perth. I will do everything in my power to keep my body going, my skills sharp and contribute in whichever way I can. I want to show my kids that no matter what your dreams are, if you put in the work, you can achieve them. Everything is possible.\n\nPriors skills as a leader and a voice of belief and confidence are deeply recognised by his teammates. He praises Pieter Benade, Zimbabwes head coach, and how he has propelled his squad to an historic achievement.\n\nPieter is a wonderful human being. He is authentic, cares deeply about the jersey and Zimbabwes rugby culture. The closer we got to the final, the more emotional he got when presenting the jerseys, telling a short story to each player. Thats the guy you want to play for. Thats the guy you are willing to put your head in a dark spot for. He cares about us, and that made a difference.\n\nPrior reflects with a degree of disbelief on all he has done in the game, knowing there may well be more still to do.\n\nIf you told this young boy running around the fields that he would be playing for the junior Wallabies, captaining the Western Force in Super Rugby, and helping his heritage nation to qualify for a World Cup, I wouldve laughed at you. For me, it is all pretty surreal.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30161752/ian-prior.jpg",
            "description": "<p>By Francisco Isaac | Rugby Pass By 2024, Ian Prior had basically done it all. He’d been a professional player for 14 years. He’d won a Super Rugby title with the Reds, played in the Premiership with Harlequins, captained the Western Force and played for the Perth franchise over 100 times. With his Force contract expiring, Prior had</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/impossible-not-to-be-emotional-how-ian-prior-came-out-of-retirement-to-help-zimbabwe-end-rugby-world-cup-drought/\">‘Impossible not to be emotional’: How Ian Prior came out of retirement to help Zimbabwe end Rugby World Cup drought</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "Legendary lion Blondie that was studied by Oxford University experts is shot dead by trophy hunters in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legendary-lion-blondie-that-was-studied-by-oxford-university-experts-is-shot-dead-by-trophy-hunters-in-zimbabwe/",
            "content": "DailyMailUK\n\nA legendary lion that was studied byOxford Universityexperts has been cruelly killed in Zimbabwe.\n\nBlondie was shot dead by heartless trophy hunters during the week of June 29outside Hwange National Park, the countryslargest natural reserve.\n\nThe lionwas reportedly fed chunks of meat from the back of a truck to bait him awayfrom the park, where poaching is prohibited, and into a hunting area.\n\nThe tragedy came just three months after research experts fitted Blondie with a GPS collar to track him and his pride of 10 cubs and three adult females as part of a long-term study.\n\nThere are concerns that a professional hunter involved in the hunt was aware that Blondie was collared and that he had dependent cubs.\n\nAfrica Geographic CEO Simon Espley said: As the sponsor of Blondies research collar, we are dismayed and angered by this development.\n\nThat Blondies prominent collar did not prevent him from being offered to a hunting client, confirms the stark reality that no lion is safe from trophy hunting guns.\n\nHe was a breeding male in his prime, making a mockery of the ethics that ZPGA regularly espouses and the repeated claims that trophy hunters only target old, non-breeding males.\n\nIt has been reported that, two weeks prior to the hunt, the hunter confirmed seeing Blondie with cubs and lionesses.\n\nWhen approached for his side of the story, the hunter declined to comment, other than to say that the hunt was conducted legally, and ethically,Africa Geographic reports.\n\nA photograph showing the gun-toting trophy hunter kneeling down beside Blondies body was posted online and later removed.\n\nBlondie was just five years old and was the last known descendant of the Somadada pride, which had previously moved from Hwange into community areas.\n\nHe had since established a stable pride in an area where resident lions have historically been scarce, due in part to conflict with local communities and previous hunting pressure.\n\nStrict Zimbabwean hunting regulations stipulate a minimum age of six years for trophy lions, with an emphasis on targeting older, nonbreeding males.\n\nBlondie fell well below that threshold, making his killing deeply controversial and widely condemned.\n\nThe loss of this key male lionis expected to cause turmoil for the pride, with a high likelihood that incoming rival males will kill his youngest cubs.\n\nLast night, Mike Blignaut, the co-owner of Victoria Falls Safari Services who allegedly organised the hunt for Blondie, said: At this time I cannot comment as I have been advised not to by the Zimbabwe Professional Guides Association.\n\nBut I will say the hunt was legal and conducted ethically.\n\nIt comes after sixteen lions were killed by poachers who hacked the faces and paws off eight of the adults to sell their teeth and claws to be used to turn into black magic potions in 2020.\n\nDistraught Gert Blom, 51, who owns Predators Rock Bush Lodge in Rustenburg, South Africa, was surprised when he woke up not to hear his lion pride roaring as usual at dawn.\n\nHe went down to their enclosure and found his two male lions and six lionesses missing and followed drag trails to behind a perimeter wall where he found them all butchered.\n\nGert said: They had hacked off 32 paws for the claws and eight of their snouts for their teeth after killing them with poisoned chicken which is a really agonising death for the lions.\n\nIt is cruelty that is beyond belief and an absolutely terrible sight to behold when you see magnificent predators lying there covered in flies minus their faces and their paws.\n\nA further devastating blow was that two of the lionesses were within 24 hours of giving birth and a post mortem showed that they died with 3 unborn cubs inside each.\n\nAnother lioness had given birth the day before she was poisoned and two of her cubs were found dead and it is thought they probably died after suckling milk that was poisoned.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30161006/blondie-lion.png",
            "description": "<p>DailyMailUK A legendary lion that was studied by Oxford University experts has been cruelly killed in Zimbabwe. Blondie was shot dead by heartless trophy hunters during the week of June 29 outside Hwange National Park, the country’s largest natural reserve. The lion was reportedly fed chunks of meat from the back of a truck to bait him away from the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legendary-lion-blondie-that-was-studied-by-oxford-university-experts-is-shot-dead-by-trophy-hunters-in-zimbabwe/\">Legendary lion Blondie that was studied by Oxford University experts is shot dead by trophy hunters in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "Invictus Energy’s Cabora Bassa venture to be awarded National Project status",
            "url": "https://www.newzimbabwe.com/invictus-energys-cabora-bassa-venture-to-be-awarded-national-project-status/",
            "content": "By Alois Vinga\n\nINVICTUS Energy, the Australian company developing and exploring gas deposits in northern Zimbabwe, is set to be awarded the National Project status for its Cabora Bassa venture.\n\nThe Cabora Bassa project is a significant oil and gas exploration project in Zimbabwes Cabora Bassa basin, which aims to unlock the basins potential for natural gas and condensate, with the Mukuyu gas field being a key focus.\n\nInvictus is also working towards pilot production, including a gas-to-power project for the Eureka Gold Mine, and is also exploring potential for regional gas markets.\n\nPresenting a quarterly report this week, Invictus Energy announced the possibility of being awarded a National Project status.\n\nIn June the Zimbabwe Minister of Finance identified the Cabora Bassa Project as one in line for receiving National Project Status (NPS)  a significant milestone for the company. Once formalised, the NPS would recognise the projects potential to generate broad-based economic benefits, attract foreign investment, and create employment opportunities, said the company.\n\nInvictus is currently finalising formalities required for the official granting of NPS, which will unlock a range of fiscal and non-fiscal incentives, including duty exemptions, expedited permitting, and streamlined access to critical infrastructure and services.\n\nAs a gesture of appreciation for the Invictus Energy potential, the Mutapa Investment Fund (MIF) recently injected US$5 million to accelerate the projects exploration activities, including flow testing, drilling, and seismic surveys, as Invictus transitions from exploration to development.\n\nDuring the quarter, Invictus Energy continued to progress discussions with a number of prospective farm-in and strategic partners for participation in the future development of the Cabora Bassa Project. These parties include established industry operators and investment groups with the capacity to provide both strategic capital and substantial technical and operational capabilities.\n\nTheir expertise aligns with the Companys forward program, which aims to unlock a new resource base through high-impact exploration while advancing the appraisal and potential commercialisation of the Mukuyu gas field.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/31124125/Invictus-Energy.jpeg",
            "description": "<p>By Alois Vinga INVICTUS Energy, the Australian company developing and exploring gas deposits in northern Zimbabwe, is set to be awarded the National Project status for its Cabora Bassa venture. The Cabora Bassa project is a significant oil and gas exploration project in Zimbabwe’s Cabora Bassa basin, which aims to unlock the basin’s potential for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/invictus-energys-cabora-bassa-venture-to-be-awarded-national-project-status/\">Invictus Energy’s Cabora Bassa venture to be awarded National Project status</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "Lecrae announces reconstruction World Tour ahead of new album, kicking off September 4 in Zimbabwe",
            "url": "https://www.newzimbabwe.com/lecrae-announces-reconstruction-world-tour-ahead-of-new-album-kicking-off-september-4-in-zimbabwe/",
            "content": "Thatericalper\n\nFour-time Grammy Award-winning artist, author, actor and activist Lecrae has formally announced his headlining Reconstruction World Tour, on the heels of unveiling the release date for his tenth studio album,Reconstruction, due August 22nd.\n\nThe world tour will kick off in Harare, Zimbabwe on Thu, September 4th and stretch until December 6th in Brisbane, Queensland. Along the way, the 42-day run will make stops in Lecraes hometown of Atlanta, including nights in Chicago, Houston, Los Angeles, and Nashville. The trek will also make landfall in many countries and territories throughout Africa and Australia.\n\nSpecial guests Miles Minnick, Gio, 1K Phew, and Torey DShaun will join Lecrae on select dates throughout the tour.\n\nPresales start on Wednesday, July 30th, ahead of the general sale on Friday, August 1st.\n\nMaking his anticipated return to the stage, the tour will mark one year since Lecraes last outing in 2024 for The Final Church Clothes Tour! The fan favorite is slated to perform songs from his decorated catalog, as well as music from his upcoming album.\n\nBeyond the music, Lecrae has fostered a direct relationship with his local community. Last Monday, the Grammy-winner held a back-to-school drive in the heart of Atlanta alongside nonprofit City Takers. With over 100+ people in attendance, both fans and residents alike joined Lecrae in assembling backpacks filled with essential school supplies for students across the city.\n\nAs a special treat to fans, Lecrae revealed the features onReconstructionwith a one-of-a-kind mailer that went out to one thousand of his most active supporters. Each mailer included a handwritten note from the Reach Records founder, and a QR code linking to The Workshop  an online community where fans can access early music, content, and engage to earn points for incentives.\n\nContinuing his mission of bringing Christ to the culture, he now gears up to make international headlines with his renewed stage presence, ultimately setting the tone for an unstoppable and intentional run. The announcement also heralds the arrival of Lecraes forthcoming album Reconstruction  his first solo project since 2022sChurch Clothes 4LP.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30161331/lecrae.jpg",
            "description": "<p>Thatericalper Four-time Grammy Award-winning artist, author, actor and activist Lecrae has formally announced his headlining Reconstruction World Tour, on the heels of unveiling the release date for his tenth studio album, Reconstruction, due August 22nd. The world tour will kick off in Harare, Zimbabwe on Thu, September 4th and stretch until December 6th in Brisbane,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/lecrae-announces-reconstruction-world-tour-ahead-of-new-album-kicking-off-september-4-in-zimbabwe/\">Lecrae announces reconstruction World Tour ahead of new album, kicking off September 4 in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        },
        {
            "title": "Elvis Chipezeze wins Carling Knockout Cup Player of the Tournament award",
            "url": "https://www.newzimbabwe.com/elvis-chipezeze-wins-carling-knockout-cup-player-of-the-tournament-award/",
            "content": "By Sports Reporter\n\nWarriors goalkeeper Elvis Chipezeze has been crowned Carling Knockout Cup Player of the Tournament at the 2024/25 Betway Premiership Awards held on Tuesday evening.\n\nChipezeze edged out Iqraam Rayners and Magesi FC teammate Edmore Chirambadare to claim the prestigious accolade.\n\nThe veteran shot-stopper was instrumental in Magesi FCs Cup success, earning four Player of the Match awards during the tournament, which the club went on to win.\n\nChipezeze also played a pivotal role in helping Magesi survive relegation, a run highlighted by him being named Betway Premiership Player of the Month for March.\n\nHe finished the season as one of the leagues top goalkeepers, keeping 12 clean sheets in 30 matches.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/14051412/Elvis-Chipezeze.jpg",
            "description": "<p>By Sports Reporter Warriors goalkeeper Elvis Chipezeze has been crowned Carling Knockout Cup Player of the Tournament at the 2024/25 Betway Premiership Awards held on Tuesday evening. Chipezeze edged out Iqraam Rayners and Magesi FC teammate Edmore Chirambadare to claim the prestigious accolade. The veteran shot-stopper was instrumental in Magesi FC’s Cup success, earning four</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elvis-chipezeze-wins-carling-knockout-cup-player-of-the-tournament-award/\">Elvis Chipezeze wins Carling Knockout Cup Player of the Tournament award</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:35",
            "date": "31 Jul 2025"
        }
    ]
}