{
    "news": [
        {
            "title": "Mnangagwa renames Tomlinson Depot to Chimoio Camp",
            "url": "https://www.newzimbabwe.com/mnangagwa-renames-tomlinson-depot-to-chimoio-camp/",
            "content": "By Thandiwe Garusa\n\nPRESIDENT Emmerson Mnangagwa has officially renamed the Tomlinson Depot to Chimoio Camp Depot as a way of dismantling colonial legacies.\n\nThe renaming ceremony also included the commissioning of four blocks residential flats, now called the Chimoio Police Camp Flats.\n\nSpeaking at the ceremony Friday, Mngangagwa said name changing is an important tool for preserving a countrys heritage.\n\nIt is with great honour and a sense of pride that I join you at this momentous occasion, to officiate at this ceremony marking the unveiling of the new name of Tomlinson Depot. This cantonment area will now be called, Chimoio Camp Depot.\n\nToday, we also witness the commissioning of residential flats, hereafter called the Chimoio Police Camp Flats, Mnangagwa said.\n\nThe 82-year-old Zanu PF leader also acknowledged shortage of decent accommodation for the uniformed forces, challenging relevant authorities to scale up efforts in addressing the housing needs.\n\nI am aware that with the current strength of men and women, the magnitude of resources required to provide institutional accommodation for our Police Service throughout the country, cannot be underestimated.\n\nAs such, my administration will continue to explore innovative ideas and strategies to provide decent institutional accommodation for officers.\n\nThis should ensure that the deployment or transfer of officers and their families to other stations is seamless, with minimum disruptions.\n\nI challenge the Zimbabwe Republic Police, ministries of Home Affairs and Cultural Heritage, Local Government and Public Works as well as National Housing and Social Amenities, among other stakeholders in the built environment, to scale up collaboration and innovation towards addressing the housing needs for the civil service in general, he added.\n\nThe bulk of police officers live in dilapidated and overcrowded housing across the country.\n\nThe police service also lacks sufficient resources to effectively execute their duties nationwide, particularly in rural areas where officers often have to walk long distances on foot to make arrests or escort suspects to court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/05/27184134/Mnangagwa.jpg",
            "description": "<p>By Thandiwe Garusa  PRESIDENT Emmerson Mnangagwa has officially renamed the Tomlinson Depot to Chimoio Camp Depot as a way of “dismantling colonial legacies.” The renaming ceremony also included the commissioning of four blocks residential flats, now called the Chimoio Police Camp Flats. Speaking at the ceremony Friday, Mngangagwa said name changing is an important tool</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-renames-tomlinson-depot-to-chimoio-camp/\">Mnangagwa renames Tomlinson Depot to Chimoio Camp  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "13 Jun 2025"
        },
        {
            "title": "Fugitive cop who flogged suspect to death arrested, appears in court",
            "url": "https://www.newzimbabwe.com/fugitive-cop-who-flogged-suspect-to-death-arrested-appears-in-court/",
            "content": "By Tapiwa Svondo\n\nA RUWA police officer, Constable Prince Ndavambi (39) has been charged with murder following his arrest, nearly two weeks on the run.\n\nAccused person assaulted Blessed Believe Juruvenge (30) in police custody leading to his death.\n\nNdavambi was a fugitive of the law since May 28, 2025, when the victim was declared dead. He was only arrested on June 10 and appeared in court the day after.\n\nThe murder followed Juruvenges arrest on May 27, 2025, after an altercation with a fellow resident, Mwazha/Maphosa, who reported him for assault and theft. Upon detention, the now deceased was told by Ndavambi that he would return home in a coffin.\n\nIn a statement, the National Prosecuting Authority of Zimbabwe (NPAZ) said, Ndavambi allegedly tortured the now deceased using a hoe handle before placing him in a cell.\n\nAllegations are that on the 27th of May 2025, the accused arrested a man in connection with assault and theft and took him to ZRP Ruwa. While in custody, it is alleged that the accused assaulted the suspect with a hoe handle before detaining him in the cells.\n\nLater that evening, the suspects condition reportedly deteriorated. He was taken to Ruwa Rehabilitation Clinic, where he died the following day, said NPAZ.\n\nNdavambi was granted US$400 bail and remanded to July 2, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Tapiwa Svondo A RUWA police officer, Constable Prince Ndavambi (39) has been charged with murder following his arrest, nearly two weeks on the run. Accused person assaulted Blessed Believe Juruvenge (30) in police custody leading to his death. Ndavambi was a fugitive of the law since May 28, 2025, when the victim was declared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fugitive-cop-who-flogged-suspect-to-death-arrested-appears-in-court/\">Fugitive cop who flogged suspect to death arrested, appears in court </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "13 Jun 2025"
        },
        {
            "title": "Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats",
            "url": "https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF partys primary elections.\n\nKaroro spoke following Mutukudzis appearance as a State witness in a case he is facing charges of diverting agricultural inputs.\n\nHe said Mutukudzi and Chikwamba were bitter that they had failed to unseat him in 2015, 2018 and 2023 when he won the election while on remand as a result of the case.\n\nThe primaries sought a candidate from Mbire constituency to represent Zanu PF in Parliamentary elections.\n\nAt the time the allegations arose, Chikwamba was the partys District Coordinating Committee (DCC) Chairperson while Mutukudzi was his deputy.\n\nMutukudzi told the court that he was informed by a certain Zanu PF leader of suspicious trucks, allegedly linked to Karoro, that were loading fertiliser at GMB Mushumbi depot.\n\nHe said he then proceeded, with the blessing of Chikwamba, to file a report with the police. Chikwamba accompanied him.\n\nMutukudzi admitted that he lost thrice to Karoro in the race to represent Mbire in Parliament but said he was not bitter. He said it was just human nature to want to win.\n\nIt is human nature to want to win every election, said Mutukudzi, to which Karoros lawyer Admire Rubaya further asked if he was happy with the defeat.\n\nRubaya questioned why malpractices at GMB would be reported to him if he was neither a government official nor an interested party.\n\nThe matter continues on Friday before Regional Magistrate Marehwanazvo Gofa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF party’s primary elections. Karoro spoke following Mutukudzi’s appearance as a State witness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/\">Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "13 Jun 2025"
        },
        {
            "title": "Teen sentenced to life for killing aunt in cold blood before violating her corpse",
            "url": "https://www.newzimbabwe.com/teen-sentenced-to-life-for-killing-aunt-in-cold-blood-before-violating-her-corpse/",
            "content": "By Mary Taruvinga\n\nHIGH Court judge, Justice Munamato Mutevedzi has expressed concern over some cases judges preside over further noting that crimes that are being committed around Zimbabwe may suggest that the world is coming to an end.\n\nThe judge also said court officials would require psychological support for them to cope with things they hear in court everyday.\n\nMutevedzi said this while handing down sentence against one Tapiwa Mereka (19) at the Gweru High Court.\n\nMereka was found guilty of the gruesome murder of his mothers sister Mary Mereka on January 27, 2023, and also raping her lifeless body.\n\nMutevedzi said Mereka deserved capital sentence adding that he is fortunate that death penalty had been scrapped.\n\nIf it is true that on some day God will destroy the world, then that time is nigh. Some of the crimes that we preside over suggest that Armageddon is imminent.\n\nTapiwa Mereka (the offender) has a head but it is doubtful that he has a brain inside it. If he does, then his mind is so perverted and depraved that he should not be living amongst human beings.\n\nThe crime that he committed is unconscionable and would possibly win an Oscar award for horror movies.\n\nEvery one of us who took part in the trial would be thinking about this for a long time to come.\n\nIt lays bare, the oft-repeated myth that judges are inanimate.\n\nThe reality is that judicial officers and other court officials who work in the criminal courts and hear these horrific stories almost on a daily basis may suffer what is called vicarious trauma.\n\nThey all may end up requiring therapy in one form or another, Mutevedzi said.\n\nThe court heard Mereka had plotted to rape and kill his aunt for a long time.\n\nIn his warned and cautioned statement accused person admitted that he always admired her and wanted to sleep with her.\n\nHe was biding his time and waiting for an opportune moment to strike.\n\nHe said the idea became maddening some three days before the murder andcould not shake off the desire and lust to have sexual intercourse with his aunt.\n\nHe convinced himself to carry out the satanic idea on the fateful morning.\n\nI do admit to the allegations levelled against me. The deceased was my aunt but I had quite some time admiring her and I wished that I have some time to rape her.\n\nI also had the intention to kill her. I had no valid reason but I just felt that I have to kill her.\n\nSo, when I was with her in the field weeding together with her I then got the chance and took an axe which was in the field and struck her three times on the head whilst she was not expecting it.\n\nAfter striking her she fell down. I removed her pant and had sexual intercourse with her.\n\nAfter I finished I dressed her and took the axe and threw it outside the field and went to Sebakwe River with the intention to stay there, Mereka admitted.\n\nThe teenager said at the time the time of the sex, the deceased was still alive although in a vegetative state.\n\nMutevedzi said even imagining that his victim was dead by the time he committed the abomination, his actions would have amounted to the crime of violating a dead body in contravention of section 111 of the Criminal Law (Codification and Reform) Act.\n\nHe said in other jurisdictions, it would have been the crime of necrophilia, which criminalises any sexual attraction to a dead person.\n\nThe judge said this aggravates Merekas situation.\n\nHaving found that the murder is aggravated there cannot be escaping the severest punishment.\n\nBefore the abolition of the penalty of death from our statute books this was a case that would have undoubtedly attracted capital punishment.\n\nNeedless to state, that option is no longer available. The only two choices which the court has are sentencing the offender either to life imprisonment or to a determinate term of not less than 20 years.\n\nWhat is worse is that he said he was prepared to kill for no reason. He is, therefore, a dangerous individual whom the court cannot risk letting back into society.\n\nHe may kill again for nothing else other than his enjoyment.\n\nHe appears worse than a robber who kills for financial gain because it is possible to resist that more than a desire that one cannot explain.\n\nIt is like the offender gets possessed by some irresistible spirit.Given the above, our hands are, therefore, tied. It is difficult to empathise with the offender.\n\nIf he could be so sadistic as to easily kill his own mother and still find sexual gratification from her in that state of helplessness, we shudder to think what he could possibly do to a stranger or to children.\n\nHe is someone whose soul must be left to God to correct. As a court, we can do no more than administer justice.\n\nWe will permanently remove him from society and confine him to the secure walls of a prison.\n\nAccordingly, the offender is sentenced to life imprisonment, the judge ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/07040958/Crime-and-Murder.jpg",
            "description": "<p>By Mary Taruvinga HIGH Court judge, Justice Munamato Mutevedzi has expressed concern over some cases judges preside over further noting that crimes that are being committed around Zimbabwe may suggest that the world is coming to an end. The judge also said court officials would require psychological support for them to cope with things they</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/teen-sentenced-to-life-for-killing-aunt-in-cold-blood-before-violating-her-corpse/\">Teen sentenced to life for killing aunt in cold blood before violating her corpse</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "13 Jun 2025"
        }
    ]
}