{
    "news": [
        {
            "title": "Pilot dies in Air Force of Zimbabwe jet trainer crash",
            "url": "https://www.newzimbabwe.com/pilot-dies-in-air-force-of-zimbabwe-jet-trainer-crash/",
            "content": "By Staff Reporter\n\nA young trainee pilot Nesbert Tambudza has died following the crash of a Karakorum-8 (K-8) jet trainer aircraft in Gweru.\n\nThe accident happened near Guinea Fowl where Tambudza, an Air Lieutenantwas engaged in solo navigation training.\n\nIn a statement, ZDF Commander in Chief, Valerio Sibanda said there were no civilian casualties nor damage to property on the ground.\n\nOn behalf of Officers, men and women of the ZDF, the Commander Zimbabwe Defence Forces wishes to express his heartfelt condolences to the family, relatives, friends and colleagues of our departed Officer, Air Lieutenant Tambudza.\n\nAir Lieutenant Tambudza was a young pilot who had demonstrated immense potential and was therefore selected to undergo a jet flying conversion training course at Number 2 Squadron, Josiah Tungamirai Air Force Base in Gweru. At the time of his death, he was in the final phases of training on the K-8 jet.\n\nThe accident occurred about 5 kilometres East of Guinea Fowl and on impact with the ground the aircraft was extensively damaged, reads the statement.\n\nA Board of Inquiry has been constituted to investigate the cause of the accident.\n\nArrangements for the funeral parade and burial for Air Lieutenant Tambudza will be announced in due course.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06184352/airforce.jpg",
            "description": "<p>By Staff Reporter A young trainee pilot Nesbert Tambudza has died following the crash of a Karakorum-8 (K-8) jet trainer aircraft in Gweru. The accident happened near Guinea Fowl where Tambudza, an Air Lieutenant was engaged in solo navigation training. In a statement, ZDF Commander in Chief, Valerio Sibanda said there were no civilian casualties nor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pilot-dies-in-air-force-of-zimbabwe-jet-trainer-crash/\">Pilot dies in Air Force of Zimbabwe jet trainer crash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "‘King Munhumutapa’ out on bail a month after arrest for insulting Mnangagwa",
            "url": "https://www.newzimbabwe.com/king-munhumutapa-out-on-bail-a-month-after-arrest-for-insulting-mnangagwa/",
            "content": "By Staff Reporter\n\nTimothy Chiminya, a man claiming to be King Munhumutapa who landed in trouble for insulting President Emmerson Mnangagwa is finally free after he was granted bail by the High Court.\n\nHe was arrested over a month ago. He was charged with undermining the authority of the president after he claimed to have been appointed as King Munhumutapa by a spirit medium which also gave him authority to appoint chiefs in Zimbabwe.\n\nIt is alleged that in February2024, Chiminya went to Chief Sekes homestead where he met Stanley Chimanike who was legally appointed as Chief Seke and told him that he had dethroned him and replaced himwithMasimba Rubatika.\n\nThe court heard that on 11 June 2024, Chimanike made a report of his dethronement by the accused to the Ministry of Local Government.\n\nThereafter, on dates unknown to the prosecutor but during the period from 11 June 2024 to 31 October 2024, the accused further appointed three more chiefs in Chirumhanzu and Zaka areas.\n\nHe appointed Julius Chimbi as Chief Chigegwe and Hama Piki in Chirumanzu. The accused also appointed Chief Nyakunhuwa in Zaka, Masvingo.\n\nAll the accuseds appointments were contrary to the Constitution of Zimbabwe and the Traditional Leaders Act and ridicule to the office of the President who has the executive powers to appoint Chiefs in Zimbabwe.\n\nHe proceeded to create parallel structures contrary to the ones set up by the President as per the Constitution of the Republic of Zimbabwe,  the State alleges further.\n\nThe State alleges that Chiminya undermined the authority of the president by causing ridicule as hepurportedto appoint chiefs he was performing a function that is the preserve of the president.\n\nHarare Magistrate Isheanesu Matova had dismissed his bail application ruling thathe is a security threat and did not deserve to be released from prison as he had dethroned some traditional leaders, who were installed by President Mnangagwa and that some subjects of the Chiefs, who were removed, were bound tofight the Chiefs, whom he had installed.\n\nAfter being denied bail, he mounted an appeal through his lawyerGift Mtisi of Zimbabwe Lawyers for Human Rights.\n\nThe appeal was upheld by High Court judge Justice Faith Mushure whoordered him to pay US$200 or its ZiG equivalent as bail surety.\n\nMushure also restricted him to a 25-kilometre travel radius from Harare Central Police Station until his matter is finalised.\n\nThe Judge also ordered Chiminya to report twice every week on Mondays and Fridays at Harare Central Police Station until his matter is finalised including surrendering his passport to the Clerk of Court at Harare Magistrates Court.\n\nThe traditional leader was also ordered not to interfere with state witnesses or investigations and to continue residing at his given residential address until his matter gets finalised.\n\nChiminya returns to court on 5 March 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/19060748/Timothy-Chiminya-King-Munhumutapa-e1734588504687.jpg",
            "description": "<p>By Staff Reporter Timothy Chiminya, a man claiming to be King Munhumutapa who landed in trouble for insulting President Emmerson Mnangagwa is finally free after he was granted bail by the High Court. He was arrested over a month ago. He was charged with undermining the authority of the president after he claimed to have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/king-munhumutapa-out-on-bail-a-month-after-arrest-for-insulting-mnangagwa/\">‘King Munhumutapa’ out on bail a month after arrest for insulting Mnangagwa</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "Zimbabwe central bank keeps policy rate at 35%",
            "url": "https://www.newzimbabwe.com/zimbabwe-central-bank-keeps-policy-rate-at-35/",
            "content": "Reuters\n\nZimbabwes central bank said on Thursday that its monetary policy rate had been kept unchanged at 35%.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171617/rbz-.jpg",
            "description": "<p>Reuters Zimbabwe’s central bank said on Thursday that its monetary policy rate had been kept unchanged at 35%. Spurred by food and housing prices, Zimbabwe’s inflation rose sharply in January in both U.S. dollar and local currency terms. It launched a new gold-backed currency in April last year, but it was sharply devalued in September. Since the devaluation, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-central-bank-keeps-policy-rate-at-35/\">Zimbabwe central bank keeps policy rate at 35%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "US$4.5 million mysteriously disappeared from Harare City Council – Mayor Mafume tells Commission of Inquiry",
            "url": "https://www.newzimbabwe.com/us4-5-million-mysteriously-disappeared-from-harare-city-council-mayor-mafume-tells-commission-of-inquiry/",
            "content": "By Darlington Gatsi\n\nMORE than US$4.5 million inexplicably vanished from the Harare City Council (HCC) through its subsidiary, Harare Quarry, exposing rampant corruption within the local authority.\n\nThis was revealed during the ongoing Commission of Inquiry investigating the operations of the HCC.\n\nHarare Quarry received US$4.5 million from the City Council in 2018 to revive its operations. However, the money was blown withno traceablepaper trail.\n\nMayor Jacob Mafume made the startling disclosure to the retired Justice Maphios Cheda-led Commission of Inquiry Thursday as he continued with his testimony.\n\nThe money was stolen, Mafume said bluntly.\n\nWhen pressed by Cheda on who was responsible for the theft and what measures had been taken to investigate the missing funds he replied: The management of Quarry. We resolved to get the Police involved. What we did is, we instituted, what was done before we were elected as Councillors. This was done by the previous Council and the previous management.\n\nWe were elected in 2018. The money was stolen, I am trying to think when the loan was advanced. I am not too sure.\n\nHarare Quarry, one of theCity Councils subsidiaries, has become a hub of corruption, with top officials allegedly exploiting it for personal gain.\n\nThe company has also not been remitting funds to the City Council despite its premises being leased to private companies.\n\nMafume acknowledged that the company has been a financial burden to the Council requiring constant bailouts.\n\nI am very passionate about that US$4 million because that US$4 million is the one that has caused us to have differences with the management that was there. I have pursued it in different Council meetings. I have taken the actions within my power.\n\nAs of current, because the properties are being constantly attached, I have suggested that the entity be put under management or what we used to call liquidation. For the past three weeks, as Council we have had to pay amounts that are owed by the Quarry, said Mafume.\n\nHCC chamber secretary Warren Chiwawa said the matter has been reported to the Zimbabwe Anti-Corruption Commission.\n\nI had discussions with the Business Developmentmanager, who confirmed that we indeed made a report after the matter came up in one of the committee meetings, said Chiwawa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06142935/mafume-mayor.jpg",
            "description": "<p>By Darlington Gatsi MORE than US$4.5 million inexplicably vanished from the Harare City Council (HCC) through its subsidiary, Harare Quarry, exposing rampant corruption within the local authority. This was revealed during the ongoing Commission of Inquiry investigating the operations of the HCC. Harare Quarry received US$4.5 million from the City Council in 2018 to revive</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us4-5-million-mysteriously-disappeared-from-harare-city-council-mayor-mafume-tells-commission-of-inquiry/\">US$4.5 million mysteriously disappeared from Harare City Council – Mayor Mafume tells Commission of Inquiry</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "Miss Cote d’Ivoire 2025 pageant to emphasize African authenticity, bans weaves and wigs from upcoming beauty competition",
            "url": "https://www.newzimbabwe.com/miss-cote-divoire-2025-pageant-to-emphasize-african-authenticity-bans-weaves-and-wigs-from-upcoming-beauty-competition/",
            "content": "KenyaTimes\n\nFor the first time in the history of pageantry, a national beauty pageant has banned the use of weaves and wigs in the competition.\n\nThe Miss Cote dIvoire 2025 beauty pageant has prohibited the use of weaves, wigs, and any other hair extensions during the preselection stages of the competition.\n\nContestants are expected to showcase their natural hair. It could be long, short, braided, or shaved.\n\nThe organizing committee stated that these changes are meant to emphasize natural African beauty and authenticity.\n\nThe president of the organizing committee, Victor Yapobi, referenced past participants at the Miss Universe pageant that presented themselves with short natural hair.\n\nCote dIvoire becomes the first country pageant to introduce such measures, in a national competition.\n\nThis new requirement was also influenced by Marlene Kouassi who was crowned Miss Cote dIvoire in 2022. Kouassi participated in the pageant with short hair. The initiative aims at promoting self-acceptance and confidence among contestants.\n\nThe move has attracted mixed reactions with some people stating that Africa is setting its own standards while others felt it is a means to oppress black women.\n\nSo amazing! The Queens will save so much money, and CotedIvoirewill be the standard bearer for other nations to follow, said Maxine.\n\nMeanwhile the white, Latina, and Asian miss in other countries all wear extensions. People just love to oppress black women so badly. That should be a choice, not an obligation, said Caviar Olms.\n\nOther adjustments to the requirement include the minimum height requirement which has been adjusted from 1.68 meters to 1.67 meters. The age limit has also been extended from 25 years to 28 years.\n\nThe crowning of the Miss Cote dIvoire 2025 will take place on June 26, 2025.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06100722/cote-divoire.webp",
            "description": "<p>KenyaTimes For the first time in the history of pageantry, a national beauty pageant has banned the use of weaves and wigs in the competition. The Miss Cote d’Ivoire 2025 beauty pageant has prohibited the use of weaves, wigs, and any other hair extensions during the preselection stages of the competition. Contestants are expected to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/miss-cote-divoire-2025-pageant-to-emphasize-african-authenticity-bans-weaves-and-wigs-from-upcoming-beauty-competition/\">Miss Cote d’Ivoire 2025 pageant to emphasize African authenticity, bans weaves and wigs from upcoming beauty competition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "Confirmed cases of cholera rise to 44 in Zimbabwe",
            "url": "https://www.newzimbabwe.com/confirmed-cases-of-cholera-rise-to-44-in-zimbabwe/",
            "content": "Xinhua\n\nZimbabwe has recorded 44 confirmed cases of cholera since the latest outbreak started in November last year, the Ministry of Health and Child Care said Tuesday night.\n\nAccording to a report released by the ministry, 10 new suspected cases were reported Tuesday and confirmed cholera deaths remained at two.\n\nThe latest outbreak occurred just three months after Zimbabwe declared the end of a previous 18-month-long outbreak, which resulted in 718 cumulative deaths, including 87 confirmed through laboratory testing, according to the World Health Organization.\n\nCholera is common in Zimbabwe, primarily due to poor sanitation infrastructure and residents exposure to contaminated drinking water.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/24110127/cholera.webp",
            "description": "<p>Xinhua Zimbabwe has recorded 44 confirmed cases of cholera since the latest outbreak started in November last year, the Ministry of Health and Child Care said Tuesday night. According to a report released by the ministry, 10 new suspected cases were reported Tuesday and confirmed cholera deaths remained at two. The latest outbreak occurred just</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/confirmed-cases-of-cholera-rise-to-44-in-zimbabwe/\">Confirmed cases of cholera rise to 44 in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "‘Studio sex’ and ‘hitman threats’: Insiders speak out about Diddy’s 90s music empire",
            "url": "https://www.newzimbabwe.com/studio-sex-and-hitman-threats-insiders-speak-out-about-diddys-90s-music-empire/",
            "content": "BBC\n\nI have so much money now that I could hire someone to kill you, and nobody would know. No-one would miss you. No-one would know anything.\n\nFormer music executive Daniel Evans says he can still remember the threat from his old boss, Sean Diddy Combs  then known as Puff Daddy  to a colleague. It was 1997, he says, in the New York office of Combss Grammy Award-winning music label Bad Boy Records.\n\nIt was like, this is what money does to you, he says.\n\nCombs was often prickly, but Evans says power was transforming him. Just days before, the hip-hop mogul had received his biggest reward to date  $6m (4.8m) to mark the labels success, which boasted platinum-selling artists like The Notorious B.I.G.\n\nThat year Combss music career reached its peak, with his empire soon expanding into fashion, alcohol and even his own TV network.\n\nNearly three decades on, his legacy is in ruins as he sits in jail awaiting trial on charges of sex trafficking and racketeering alongside battling dozens of lawsuits accusing him of drugging and assault at lavish parties, high-end hotels and in his labels recording studio. He denies all the allegations.\n\nNow the BBC has spoken to more than 20 people who worked with Combs at Bad Boy Records  including former executives, assistants and producers  who describe for the first time troubling incidents they say they witnessed during its 1990s rise.\n\nSome executives say they had concerns after seeing Combs having sex with women in the studio, including one incident where the employee says the young woman did not seem to react when he walked in. Another staff member complained Combs asked her to bring him condoms.\n\nThe BBC also heard that corporate funds were used to fly in women from across the US for sex at the request of artists and other employees.\n\nThere was a course of conduct that became more egregious over time and that conduct does go back to the 90s, says Tony Buzbee, a US lawyer representing dozens of alleged victims, including one who says Combs threatened to kill her in similar terms to the incident Evans says he witnessed.\n\nHis client alleges Combs raped her on a bathroom floor at a promotional party held for The Notorious B.I.G., the labels biggest star, in 1995. She says in her lawsuit that afterwards, Combs told her not to tell anyone or you will disappear.\n\nIn a statement, Combss legal team accused Buzbee of being more interested in media attention than the truth and said the hip-hop star never sexually assaulted or trafficked anyone.\n\nThe 55-year-olds lawyers said they had not been provided with sufficient details about the BBCs claims to present the facts that would counter these fabricated accusations.\n\nAs weve said before, Mr Combs cannot dignify every publicity stunt or facially absurd claim with a response. He has full confidence in the judicial process, where the truth will prevail: these accusations are pure fiction, they said.\n\nA brash go-getter, Sean Combs became an overnight millionaire when he launched Bad Boy Records in 1993 with a roster of top artists.\n\nIt was Combss first venture, having already built a name for himself as a talent director at another music label, Uptown Records, aged 19.\n\nHe said that he wanted to be one of the biggest artists in the world and it didnt matter if I believed him or not, remembers Jimmy Maynes, a former Uptown colleague.\n\nMaynes remembers Combs having a short fuse in the office, sometimes banging his hands up against the desk like a bratty kid and yelling if he did not get his way.\n\nCombs was eventually fired from Uptown and at the age of 23 started Bad Boy Records.\n\nHes the hardest working man that Ive ever met and always wanted people to match his energy, says Daniel Evans, a senior executive who managed Bad Boys recording budgets and artists contracts between 1994 and 1997.\n\nCombs described himself as the Great Gatsby and swiftly became known for hosting coveted celebrity bashes at New York nightclubs, on the beaches of Cancun, Mexico, and later infamous White Parties  named after the all-white dress code  in the Hamptons.\n\nEven President Donald Trump attended events in the 90s, says Evans, who once saw him sit on a golden throne at Combss 30th birthday and exclaim: Im the real King of New York!\n\nWe were all really young. I was 24 years old, reflects Evans, who was one of the labels original employees. People wanted to party, have fun, hook up and build good memories.\n\nBut looking back, Evans says he is troubled by some of the things he witnessed about his bosss behaviour and the company culture.\n\nIn about 1995, he says he walked in on Combs having sex with a young woman at Daddys House, Bad Boys New York recording studio near Times Square.\n\nI was getting ready to go home for the night and looking for my jacket. Open the door and hes having sex with this girl, says Evans, who thought the studio was empty as it was silent. Combs swore and shouted at him to leave. I thought I was getting fired, he says.\n\nEvans remembers the young woman had been brought to the studio, presumably for a tour, by a party-promoter who was a friend of Combs. His boss seemed sober, while she was quiet and did not really talk, he says, wondering if she was high on drugs or just shy.\n\nHe says it did not seem unusual at the time. But recalling how the woman did not react when he entered the room, he says: Knowing what I know now, theres a lot of speculation about what state she was in usually both parties are very responsive during the act.\n\nFelicia Newsome, the manager of Daddys House recording studio between 1994 and 2000, says inappropriate conduct in the music industry as a whole was rife at the time.\n\nIt was abnormal if somebody reported it, but it wasnt abnormal for it to be happening, she says.\n\nNewsome says an employee once called her to the studio in the middle of the night because Combs was in his underwear, about to have sex with a model and another woman. He was demanding the staff member fetch him condoms, she recalls.\n\nI said to Puffy, dont ever ask anyone here to go and get condoms, says Newsome, who arrived while they were getting dressed again. He replied: I didnt need anything like that, ma, and never did it again.\n\nNewsome, then in her 30s, says she found Combs reasonable and that he changed his behaviour when she challenged him. On one occasion, when the studio first opened in 1995, she says Combs was unhappy about the look of the countertops and called her a bitch in front of staff.\n\nShe says she demanded a public apology and temporarily shut the studio, asking him: If Im bringing women into this space, which is open 24 hours, how do you want to treat people?\n\nCombs responded that he wanted it to be an inclusive and safe environment, she says.\n\nBut while Newsome ran the studio with an iron fist, she says other staff were less comfortable calling Combs out.\n\nBad Boy Records was a crazy house with a lot of young people who wanted to touch the Kings robes, she says.\n\nFormer staff say the label was run by twenty-something executives and a large number of interns, some of whom were of school age. There were often sexual relationships between employees and the interns, they say.\n\nEvans remembers an uncomfortable moment with a 14-year-old in his own team, who he says propositioned him.\n\nShe says to me, you work really hard. If you ever want to like, get loose, you and I should kick it but not tonight, I have a curfew.\n\nEvans says he sent her home and called the next day, telling her not to return to work. He did not report her, but two weeks later she was back working in the mailroom.\n\nArtists and other employees at Combss record label would sometimes also request for women to be flown in to have sex at the studio, the former executive says.\n\nIf they had a [sexual] specialty in something, they would be flown in, says Evans, who told the BBC he knew because he controlled the budgets. Money for the flights would be set aside and logged under travel, he adds.\n\nIt was probably like thousands of dollars, says Evans. I dont think it happened all that often, but it was definitely a recording expense.\n\nEvans says Combss own requests were managed by his personal assistants. One told the BBC that Combs would often ask them to fly in women he was messing around with and put them up in hotels, though the assistant said they were not sex workers.\n\nIn the 2000s, the Daddys House recording studio further changed, two former staff say, into a culture of sex, drugs and rocknroll. Combs would regularly bring random women there to party, turning up with an entourage of dozens of people in three white jeeps, with white rims and white leather seats, they say. Other artists would demand suitcases of Ciroc vodka and one even brought a monkey to a session, according to a former executive.\n\nThe studio is one of the locations where women have since accused Combs of drugging and raping them. Model Crystal McKinney alleges the mogul plied her with alcohol and marijuana before sexually assaulting her there in 2003. That same year, a woman alleges that Combs and two associates gang raped her at the studio when she was 17.\n\nCombss lawyers say he looks forward to proving his innocence, adding that McKinneys claims are without merit.\n\nMany ex-staff say they still find it hard to reconcile the allegations with the man they knew. These accusations are a surprise to me, as I am sure it is to many of our circle, says Jeffery Walker, a close friend of Combs who was part of Bad Boys original production team. Ive been to White Parties and of course studio sessions, and none of what he is accused of went down in my sight.\n\nEvans was also sceptical about some of the claims until he saw the footage of Casandra Ventura, Combss ex-partner of 10 years and a former Bad Boy artist, being brutally beaten by the rapper in a hotel in Los Angeles in 2016.\n\nVentura was the first person to sue Combs back in November 2023, alleging that he had trapped her in a cycle of abuse, violence, and sex trafficking during their relationship. Combs settled the lawsuit the next day for an undisclosed amount.\n\nIts not the first time Ive seen that temper, recalls Evans, thinking back to the death threat he says he witnessed back in 1997. Its hard to see. The guy in the video with Cassie is almost identical to the guy who threatened the employee. So, you wonder, has anything changed?\n\nOver the years, Sean Combs has repeatedly reinvented himself  from Puff Daddy, to P Diddy and in recent years, Love.\n\nIf Im acting crazy, like ahhh! thats Diddy. If Im dancing real smooth with a girl, thats Puff Daddy. And if Im looking like Im nervous or scared or shy, thats Sean, he said in an interview in 2015.\n\nWith more details likely to emerge when he goes on trial in May, many of those who were close to the rapper are questioning whether they knew the real Sean Combs at all.\n\nOne could think that hes just a disgusting human being, but thats not my memory of Puff, says Jimmy Maynes, who grew up with Combs in Mount Vernon, New York.\n\nBut after a pause, he adds: Or maybe money just gives people the freedom to be exactly who they really are, and he was that guy all along.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06095515/diddy.webp",
            "description": "<p>BBC “I have so much money now that I could hire someone to kill you, and nobody would know. No-one would miss you. No-one would know anything.” Former music executive Daniel Evans says he can still remember the threat from his old boss, Sean “Diddy” Combs – then known as Puff Daddy – to a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/studio-sex-and-hitman-threats-insiders-speak-out-about-diddys-90s-music-empire/\">‘Studio sex’ and ‘hitman threats’: Insiders speak out about Diddy’s 90s music empire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "Malawi president orders troops to withdraw from DR Congo",
            "url": "https://www.newzimbabwe.com/malawi-president-orders-troops-to-withdraw-from-dr-congo/",
            "content": "BBC\n\nMalawis President Lazarus Chakwera has ordered the military to begin preparing to withdraw from their peacekeeping mission in the volatile eastern Democratic of Congo.\n\nThe Malawian troops are part of the southern African regional blocs military mission (SAMIDRC) deployed to DR Congo to help tackle armed groups.\n\nAt least 20 peacekeepers, including 14 South Africans and three Malawians, were killed as the M23 rebels captured the key city of Goma, the capital of North Kivu province, last week.\n\nPresident Chakwera said on Wednesday that his decision was meant to honour the declaration of a ceasefire by the parties, even though the fighting is continuing.\n\nIn a statement read on state TV on Wednesday evening, he said the withdrawal of troops would pave the way for their planned negotiations towards a lasting peace.\n\nMalawi Information Minister Moses Kunkuyu told the BBC Newsday programme that the planned withdrawal was being made in good faith.\n\nHe said a meeting by southern African leaders last week in Tanzania, on the sidelines of the Africa Energy Summit, had passed a resolution to call for a ceasefire from all parties in the conflict, just to pave way for peaceful negotiations.\n\nIt is pursuant to that agreement that the president of Malawi has seen it fit to contribute to the peace-building effort by withdrawing troops from the region so that there is that peaceful negotiation.\n\nHe did not indicate exactly when the troops would leave, but said what remained were the operational aspects and that they had communicated the decision to the DR Congo president and the southern Africa bloc.\n\nOn Monday, the Rwanda-backed M23 rebel group declared a unilateral ceasefire for humanitarian reasons, which was due to start the following day.\n\nHowever, fighting has since resumed, and the rebels have reportedly taken the mining town of Nyabibwe in the South Kivu province.\n\nThe Malawian president has been under pressure to withdraw his countrys forces from DR Congo in the wake of the deaths of peacekeepers.\n\nSouth Africa has faced similar pressure, but President Cyril Ramaphosa has vowed to keep his troops in DR Congo, saying they are subject to the SAMIDRC mission which has operational timeframes and an end date. The mission was initially deployed in 2023 and was last year extended until December this year.\n\nSince their capture of Goma, the rebels have been seeking to seize territories in South Kivu, especially the capital Bukavu. Congolese authorities have enlisted hundreds of civilian volunteers to help defend the city.\n\nThe rebel group has appointed top officials including a governor of North Kivu, to administer the territory.\n\nThe UN says nearly 3,000 people were killed during the M23s violent campaign to seize Goma.\n\nThere are fears that diseases such as Mpox and cholera could spread beyond the city.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/10/04074526/Chakwera2-scaled-e1601793947802.jpg",
            "description": "<p>BBC Malawi’s President Lazarus Chakwera has ordered the military to begin preparing to withdraw from their peacekeeping mission in the volatile eastern Democratic of Congo. The Malawian troops are part of the southern African regional bloc’s military mission (SAMIDRC) deployed to DR Congo to help tackle armed groups. At least 20 peacekeepers, including 14 South</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/malawi-president-orders-troops-to-withdraw-from-dr-congo/\">Malawi president orders troops to withdraw from DR Congo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "Over 1,000 jobs cut off as retail sector crisis deepens",
            "url": "https://www.newzimbabwe.com/over-1000-jobs-cut-off-as-retail-sector-crisis-deepens/",
            "content": "By Alois Vinga\n\nZimbabwes embattled retail sector has so far cut more than 1,000 jobs on the back of calls for the government to institute progressive measures to save the carnage.\n\nRegional retailer Choppies Enterprise Limited (Choppies) and fast-moving consumer goods firm Unilever Plc have indicated their intention to leave the country. Khayah Cement Limited and clothing retailer Truworths Limited entered corporate rescue in December and August 2024, respectively.\n\nAlso, British multinational and professional services provider PriceWaterHouseCoopers International Limited is on its way out of Zimbabwe.\n\nEven long-surviving resilient brands like OK Zimbabwe, TM Pick n Pay are currently battling to keep their heads above the waters.\n\nAt the heart of the crisis, authorities have identified a plethora of problems with the spiraling informal sector being the most prominent.\n\nSpeaking to NewZimbabwe.com Tuesday, the Commercial Workers Union of Zimbabwe (CWUZ) General Secretary, Cuthbert Chikwekwete said an analysis of the situation on the employment side is heartbreaking.\n\nCuthbert Chikwekwete\n\nThe challenges in the retail sector started escalating in late 2023 and have been worsening over the past year until they deteriorated this year. Our records show that over 1,000 jobs have been cut off and the majority of those affected are workers on fixed-term contracts, he said.\n\nThe workers leader said the majority of workers leaving their jobs are facing severe hardships as they struggle to put food on their tables.\n\nThe net effects of these job cuts are choking livelihoods. Many of these employees are failing to support their families heightening the chances of chronic illnesses. The fact that the retail sector was hiring employees on renewable fixed term contracts leaves them without any fallback position like pension payouts and when they lose their jobs what it means is that they are nose-diving into poverty, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27172614/OK-Supermarket.png",
            "description": "<p>By Alois Vinga Zimbabwe’s embattled retail sector has so far cut more than 1,000 jobs on the back of calls for the government to institute progressive measures to save the carnage. Regional retailer Choppies Enterprise Limited (Choppies) and fast-moving consumer goods firm Unilever Plc have indicated their intention to leave the country. Khayah Cement Limited</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-1000-jobs-cut-off-as-retail-sector-crisis-deepens/\">Over 1,000 jobs cut off as retail sector crisis deepens</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        },
        {
            "title": "RTG sinks US$500,000 in New Ambassador Hotel refurb",
            "url": "https://www.newzimbabwe.com/rtg-sinks-us500000-in-new-ambassador-hotel-refurb/",
            "content": "By Alois Vinga\n\nTOP hospitality concern, Rainbow Tourism Group (RTG) has sunk US$500,000 in refurbishing the New Ambassador Hotel as part of efforts to up the ante in line with global trends.\n\nExtensive renovations at the Harare CBD-based property which kicked off early this year include a complete transformation of guest rooms and bathrooms, aimed at enhancing comfort and elevating the overall guest experience.\n\nSpeaking to NewZimbabwe.com on the sidelines of a media tour Wednesday, RTG Corporate Affairs and Quality Manager, Pride Khumbula, highlighted that all 72 rooms are undergoing a complete overhaul.\n\nAll 72 rooms are undergoing a complete transformation. The refurbishment includes reconfiguring and reconstruction of the room layout to maximize space, the bathrooms have been overhauled with the installation of brand-new modern fixtures which include bathroom vanities, and a walk-in shower.\n\nThere are modern toilets which are low flow systems to reduce water consumption in line with the Groups sustainability drive, she said.\n\nThe hotel is set to reopen on 10 February 2025, and will host delegates during the SADC summit at the end of February.\n\nWe are pleased to advise that the New Ambassador Hotel will be ready to host the delegations attending the SADC Ministers meeting in February and March, she said.\n\nThe New Ambassador Hotel has incorporated water-saving low-flow toilet flushing systems, LED energy-efficient lighting, and other environmentally conscious measures to reduce its carbon footprint.\n\nThe hotel will also feature state-of-the-art technology, including smart televisions and internet-based telephone systems. In line with RTGs commitment to enhancing guest connectivity, the hotels WiFi infrastructure is being\n\nupgraded with enhanced wireless access points to ensure seamless, high-speed internet performance.\n\nAdditionally, the door access and locking system will transition to an RFID Key Card system, supporting mobile key technology for a streamlined check-in process while improving security and overall guest convenience.\n\nConveniently located within Harares CBD, the New Ambassador Hotel is within walking distance of major financial, commercial, and government institutions, as well as retail shops, cinemas, and cultural landmarks such as the National Museum and Art Gallery.\n\nRTG has invested US$26 million in hotel refurbishments over the past five years. In July 2024, the Group completed a US$5.2 million renovation of the Rainbow Towers Hotel and Harare International Conference Centre (HICC).\n\nFurther solidifying its position as a leader in Zimbabwes hospitality sector, RTG is investing US$380,000 in the refurbishment of its Victoria Falls properties, including Victoria Falls Rainbow Hotel and AZambezi River Lodge.\n\nThe transformation of the 3 properties reflects a commitment to quality, innovation and sustainability, echoing the aspirations of the Zimbabwean Government to foster an inclusive economy that benefits all citizens.\n\nThe Group is also not only enhancing its service offerings but also contributing to the broader goal of attracting tourism and investment, essential pillars of the 2030 vision.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/06050633/Pride-Khumbula-2-680x380-1.jpg",
            "description": "<p>By Alois Vinga TOP hospitality concern, Rainbow Tourism Group (RTG) has sunk US$500,000 in refurbishing the New Ambassador Hotel as part of efforts to up the ante in line with global trends. Extensive renovations at the Harare CBD-based property which kicked off early this year include a complete transformation of guest rooms and bathrooms, aimed</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rtg-sinks-us500000-in-new-ambassador-hotel-refurb/\">RTG sinks US$500,000 in New Ambassador Hotel refurb</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "21:06",
            "date": "06 Feb 2025"
        }
    ]
}