{
    "news": [
        {
            "title": "Arise, Sir David – Beckham receives knighthood",
            "url": "https://www.newzimbabwe.com/arise-sir-david-beckham-receives-knighthood/",
            "content": "BBC\n\nFormer England captain Sir David Beckham has been formally knighted for his services to football and British society.\n\nThe 50-year-old, who wasnamed on King Charles Birthday Honours listearlier this year, was knighted by the King during a ceremony in Berkshire on Tuesday.\n\nI couldnt be prouder, said Beckham. People know how patriotic I am  I love my country.\n\nIve always said how important the monarchy is to my family.\n\nIm lucky enough to have travelled around the world and all people want to talk to me about is our monarchy. It makes me proud.\n\nBeckham was joined by his wife Victoria and his parents Sandra and David at Windsor Castle.\n\nVictoria, who received an OBE in 2017 for services to the fashion industry, designed and made the suit that her husband wore at the castle.\n\n[King Charles] was quite impressed with my suit, said Beckham.\n\nHes the most elegantly dressed man that I know, so he inspired quite a few of my looks over the years and he definitely inspired this look.\n\nIt was something that my wife made me.\n\nI looked at old pictures of him when he was quite young in morning suits and I was like OK, thats what I want to wear  so I gave it to my wife and she did it.\n\nBeckham played 115 times for his country and captained the Three Lions for six years between 2000 and 2006.\n\nThe former Manchester United and Real Madrid midfielder featured in three World Cups for England, as well as two European Championships.\n\nBeckham emerged from Uniteds academy in 1992 and spent 11 years in the first team before joining Real in 2003 in a 25m deal.\n\nHe played for four years in the Spanish capital before joining Major League Soccer team LA Galaxy. He had two loan spells at AC Milan during his time in Los Angeles, before finishing his career at Paris St-Germain in 2013.\n\nBut Beckhams impact extends far beyond the pitch.\n\nBorn in east London, he played a role in securing the 2012 Olympics for London.\n\nHe has worked with humanitarian aid organisation Unicef since 2005 and had a fund named in his honour in 2015 to mark a decade-long partnership between the two.\n\nBeckham, who was awarded an OBE by Elizabeth II in 2003,queued for more than 12 hoursto see the Queen lying in state following her death in 2022.\n\nIts special to be here, to celebrate and to hear the different stories that people have, Beckham said afterwards.\n\nBeckham became an ambassador for the Kings Foundation in 2024, supporting King Charles education programme and efforts to ensure young people have a greater understanding of nature.\n\nHe part-owns League Two side Salford City alongside former United and England team-mate Gary Neville, and is also co-owner of MLS side Inter Miami.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04174008/beckham.webp",
            "description": "<p>BBC Former England captain Sir David Beckham has been formally knighted for his services to football and British society. The 50-year-old, who was named on King Charles’ Birthday Honours list earlier this year, was knighted by the King during a ceremony in Berkshire on Tuesday. “I couldn’t be prouder,” said Beckham. “People know how patriotic I am</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/arise-sir-david-beckham-receives-knighthood/\">Arise, Sir David – Beckham receives knighthood</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Operation Dudula’s conduct in schools and hospitals ruled unlawful",
            "url": "https://www.newzimbabwe.com/operation-dudulas-conduct-in-schools-and-hospitals-ruled-unlawful/",
            "content": "JOHANNESBURG Operation Dudulas has no right or power to prevent undocumented foreign national from accessing public healthcare and schools according to a ruling by the High Court in Johannesburg on Tuesday.\n\nThe Socio-Economic Rights Institute of South Africa brought the case to court on behalf of various groups.\n\nThe case calls the actions of the movement: harassment, intimidation, and targeting migrants.\n\nThe court ruled in SERIs favour, saying Operation Dudulas actions are unlawful and xenophobic.\n\nThe High Court in Johannesburg has interdicted them from blocking clinics and schools.\n\nSERIs litigation director,Nkosinathi Sithole said, This is an exciting moment, not only for our clients but for the South African constitution.\n\nConsidering what we have been seeing is dastardly criminal conduct by Operation Dudula of blocking people from facilities, including healthcare facilities, education, demanding identity documents of people in public: all of that has been declared unlawful and have been interdicted from doing so.\n\nThe court did not only talk about Operation Dudula, it spoke about the state as well. This includes the Minister of Police and the Minister of Home Affairs, to say that they too must make sure that they are not complacent in these acts of Operation Dudula.\n\nSithole said, the state cannot simply enter peoples homes and start doing raids. They need to have a search warrant, they need to have arrest warrants. In public, they need to have a clear, reasonable suspicion that someone is an undocumented foreign national before they can ask for such identity documents.\n\nOperation Dudula members outside the court said they would not be changing their stance and would do what needs to be done on the streets.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/09/10045549/Operation-Dudula-leader-Zandile-Dabula.jpeg",
            "description": "<p>JOHANNESBURG – Operation Dudula‘s has no right or power to prevent undocumented foreign national from accessing public healthcare and schools according to a ruling by the High Court in Johannesburg on Tuesday. The Socio-Economic Rights Institute of South Africa brought the case to court on behalf of various groups. The case calls the actions of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/operation-dudulas-conduct-in-schools-and-hospitals-ruled-unlawful/\">Operation Dudula’s conduct in schools and hospitals ruled unlawful</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Magaya’s wife granted US$500 bail in fraud case",
            "url": "https://www.newzimbabwe.com/magayas-wife-granted-us500-bail-in-fraud-case/",
            "content": "By Mary Taruvinga\n\nProphetic Healing and Deliverance (PHD) Ministries founder Walter Magayas wife, Tendai, has been granted US$500 bail by Harare magistrate Marewanazvo Gofa in a case she is accused of fraud.\n\nThe magistrate ruled that the State had failed to present compelling reasons to justify keeping her in custody.\n\nShe is jointly charged with her husband, Walter Magaya, and their company Planet Africa, represented by Tendai Chinguwa. The trio is accused of defrauding members of the public and congregants of PHD Ministries through a bogus housing and investment scheme.\n\nAccording to the State, the alleged scam saw the ministry and its associated companies receiving over US$50,000, R195,000, and ZW$1,000 from victims, none of which has been recovered.\n\nIn her ruling, Magistrate Gofa said that although Tendai Magaya faces a serious charge, this alone could not justify denying her bail.\n\nIn casu, the court finds that the submissions by the accused are plausible, Gofa said. The accused person is not a flight risk. If the State started investigating her in 2023, it shows she has been aware and could have fled to the UK, South Africa, or any other country, but she did not. Denying her bail given this would be tantamount to a travesty of justice; it defies common sense.\n\nThe magistrate added that any fears raised by the State could be adequately addressed through bail conditions.\n\nGofa described her as a good candidate for bail, noting that she has a fixed address and has not shown any intention to abscond. She was ordered to deposit US$500, surrender her passport, report once every two weeks at Waterfalls Police Station, reside at her current address, and not interfere with witnesses.\n\nShe was remanded to November 18, the same date as her husband, Walter Magaya.\n\nProsecutors allege that sometime in 2016, the accused misrepresented that they had acquired land in several areas across the country, including Chishawasha, Norton, Westgate, Mutare, Bulawayo, Kwekwe, Arcturus, Ruwa, Manyame, and Nyatsime, for housing, farming, bee-keeping, and mining projects meant to benefit church members and the public.\n\nDuring a church service that was also broadcast live on Yadah Television, it is alleged that they announced that God had instructed them to help members acquire residential stands and houses, claiming the projects would be managed through Planet Africa and Yadah Connect.\n\nPamphlets featuring Bible verses and images of the purported land and houses were distributed to lure followers.\n\nThe State further alleges that congregants were invited to buy stands and invest in various ventures, including mining and farming projects, with promises of a 50% return after six months. Many members reportedly paid thousands of dollars to the companies and signed memoranda of understanding falsely indicating that the firms had been allocated land by the Ministry of Local Government.\n\nIn 2017, after complaints began surfacing, the accused allegedly sought to restore confidence by entering into a one-season farming contract with former Reserve Bank of Zimbabwe governor Dr Gideon Gono at New Donnington Farm in Norton. They reportedly took congregants to the property, falsely claiming ownership and that it was ready for stand allocations, even though the farm belonged to Dr Gono and was not for sale.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04104529/tendai-magaya-.jpg",
            "description": "<p>By Mary Taruvinga Prophetic Healing and Deliverance (PHD) Ministries founder Walter Magaya’s wife, Tendai, has been granted US$500 bail by Harare magistrate Marewanazvo Gofa in a case she is accused of fraud. The magistrate ruled that the State had failed to present compelling reasons to justify keeping her in custody. She is jointly charged with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/magayas-wife-granted-us500-bail-in-fraud-case/\">Magaya’s wife granted US$500 bail in fraud case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "Tony Forbes forgives AKA’s killers and vows to keep his son’s legacy alive in emotional podcast",
            "url": "https://www.newzimbabwe.com/tony-forbes-forgives-akas-killers-and-vows-to-keep-his-sons-legacy-alive-in-emotional-podcast/",
            "content": "IOL\n\nDuring a recent guest appearance on the SMWX podcast,Tony Forbes, father of the late award-winning rapper Kiernan AKA Forbes,revealed that he has forgiven the men accused of killing his son.\n\nAKA and his friend Tebello Tibz Motsoanewere shot dead outside the Wish restaurant on Florida Road, Durban, in February 2023. Seven men have been charged with the murders. The men face trial in June 2026.\n\nI have forgiven those people. I had not forgiven them before I knew who they were, but now that I know, I have forgiven them, but Id like to see justice. I need to see justice.\n\nI have not walked around in the last 2 to 3 years thinking about the case or being angry, because if I did, thats all I would have done, and it would have just consumed me, shared Forbes.\n\nHe continued: I feel we are on the right path. I feel like the police and prosecution have done a tremendous job. I have huge respect for them  I feel positive about the future, that we tackle crime in this country in such a way that what happened to my son, doesnt happen to other peoples children \n\nOther parents have lost multiple children; I am not unique in that sense.\n\nDuring the conversation with host Sizwe Mpofu-Walsh, Forbes recalled his bond with his son, AKA, earlier radio appearances, as well as the fateful night he found out that AKA had been shot.\n\nI went to sleep about 9pm, and I woke up after 12. Someone was calling my name through the gate. I dont think the bell was working  I went out and it turned out to be my Godchild, Kiernans cousin, Talia and her boyfriend.\n\nTalia held out the phone and said, My dad wants to tell you something  He just said, Tony, Ive got bad news, Kiernans been shot.\n\nI remember I had a brief moment where I wanted to ask, Is he okay, is he alive?, but Trevor just said that it was fatal. It didnt register for me. I just sat down on the steps right by the gate. I was confused. I didnt break down emotionally.\n\nFive minutes later, I was on the phone with Steffan (AKAs brother), and then he put his mother (Lynn Forbes) on. I think it was like a good few minutes where we didnt say a word. There were no words to utter, there was nothing, said Forbes.\n\nForbes shared how he felt a rush of air while he was showering in the early hours of the morning after receiving the devastating news.\n\nAt around 3am, I went to take a shower. It was a windstill evening, the window was open, and I just got into the shower and I felt this rush of air. I instinctively felt it was Kiernan, who was saying, Dad, Im on the other side, but Im with you, and to this day, I feel that that was him.\n\nIm not ashamed to say that I went to see a medium, and she said to me that its not unusual when family members die in that way, as they leave this life, from the shock, its like they are screaming, and it goes to the people who are biologically linked to them.\n\nTravelling to Durban the next day, Forbes faced the heart-wrenching task of identifying his son. He had never experienced the loss of a loved one before and described his nervousness, but also found solace in the support they had received.\n\nThose two hours on the plane were just two of the most lonely hours I spent. I had never been to identify anyone in a mortuary, never, and suddenly here I am  I never dealt with death, but I was able to \n\nI remember seeing him the first time. I was very nervous, but he looked like he was sleeping, and still, I was looking for movement. We saw him again after they worked on him; he looked peaceful.\n\nWhat was amazing was how people came around us and supported us. The undertakers paid for everything; we didnt pay a cent. The people at the house, his friends, bought food, drinks, and flowers. As much as it was a very sad time, it just showed how much Kiernan was loved.\n\nAs he described the painful experience of selecting a coffin, he shared: The first time it really hit me was when we had to go select the coffin, and when I saw the coffins, that was the moment. It drove it home to me that this was it.\n\nReflecting on the inquest regarding Anele Tembes death, Forbes commented: When I think of the inquest and Anele and Kiernan, I dont think of us versus them. Anele was good to me when she was alive, just as Kiernans other partners were to me.\n\nHer dad, Moses, will tell you, I used to call him, especially on a Sunday, to see how they were doing. I sometimes look at pictures of those two children and I think, What a waste, they not here with us anymore.\n\nAs the inquest should come out, it should be at a place where its not a competition, it is not about us versus them or Kiernan versus Anele. We need some closure, but we also need to do it in a fair and balanced way.\n\nSpeaking about the remarks that formerPolice Minister Bheki Celemade surrounding Anele Tembes death, at Parliaments Ad Hoc Committee last week,Forbessaid:His words still carry a lot of weight and there are people out there, and I can see the comments on social media that are now saying, Yeah, we always suspected something and that now confirms it. I feel like his comments has reopened the wounds and its regrettable \n\nAt this moment, I think the NPA should be responding to what the ex Minister had said and set the record straight. My disappointment is that the advocate and her team are quiet. They are saying nothing, and I think that is unfair.\n\nOur job, as a family, is to protect his (AKAs) legacy, to live his legacy, to enhance his legacy and for us, these statements being made, and basically the nations being told that we thought he murdered her, is harming his legacy. I want the nation to be told the facts.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/02/29102413/TONY-FORBES.jpeg",
            "description": "<p>IOL During a recent guest appearance on the “SMWX” podcast, Tony Forbes, father of the late award-winning rapper Kiernan “AKA” Forbes, revealed that he has forgiven the men accused of killing his son. AKA and his friend Tebello “Tibz” Motsoane were shot dead outside the Wish restaurant on Florida Road, Durban, in February 2023. Seven men have been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tony-forbes-forgives-akas-killers-and-vows-to-keep-his-sons-legacy-alive-in-emotional-podcast/\">Tony Forbes forgives AKA’s killers and vows to keep his son’s legacy alive in emotional podcast</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        },
        {
            "title": "UN says 90% of cases in journalists’ murder cases go unresolved",
            "url": "https://www.newzimbabwe.com/un-says-90-of-cases-in-journalists-murder-cases-go-unresolved/",
            "content": "By Alois Vinga\n\nTHE UN High Commissioner for Human Rights, Volker Trk, says that worldwide 90% of cases involving the murder of journalists have gone unresolved amid calls for member states to put in place watertight measures to protect media practitioners.\n\nWhile Zimbabwe has recorded improvements in recent years, as shown by the countrys leap ten places up the Reporters Without Borders 2024 World Press Freedom Index, local journalists still face different types of persecution, including arbitrary arrests, harassment and intimidation prompted by a blend of a hostile legal framework.\n\nJournalists Blessed Mhlanga and Faith Zaba, both from Alpha Media Holdings (AMH), were recently arrested and detained in 2025 on charges of transmitting data messages inciting violence and undermining the authority of or insulting the President, respectively.\n\nAnother UNESCO 2025 report revealed that 63% of women journalists in Zimbabwe have experienced technology-facilitated gender-based violence (TFGBV), including hate speech and cyber harassment, contributing to self-censorship.\n\nOver the past decade, more than one thousand journalists have been killed, in both peacetime and war. In Gaza alone, my Office has documented the killing of 252 journalists since 7 October 2023. And in nearly nine out of ten cases, those who kill journalists around the world have not been brought to justice. This culture of impunity fuels further attacks and undermines freedom of expression, civic space, and ultimately, peace, Trk said.\n\nThe UN High Commissioner made the remarks in a video message to mark the International Day to End Impunity for Crimes against Journalists, which is commemorated annually on November 2.\n\nHe said journalists who expose injustice and give voice to the voiceless are human rights defenders, yet, across the globe, governments, corporations and criminals threaten, harass and detain them as well as subjecting them to arbitrary detention, to transnational repression, and even murder.\n\nThe UN official said the emergence of new journalisms have been weaponised to amplify abuse, distort reality, and intensify harm including deepfake sexual images, AI-generated defamatory content, and the amplification of misogynistic hate speech through algorithmic tools and bots.\n\nWomen journalists are targeted not only for their reporting, but also because of their gender. They face harassment, sexual violence, and coordinated online attacks designed to silence their voices and strengthen patriarchal norms. Nearly three in four women journalists report that they have been subjected to online violence. This may lead them to self-censor, to leave their jobs, or to live in fear, said Trk.\n\nThe UN official said his office is working to address these challenges by monitoring, documenting and reporting violations against journalists, including online, and advocating with States and technology companies guided by the dimensions of GBV online.\n\nStates have a legal obligation to prevent, investigate, and punish all attacks against journalists  including those that take place online. Technology companies also have responsibilities to respect human rights and to pursue accountability for people who use their platforms and products to perpetrate abuses.\n\nTo end impunity for crimes against journalists, we need stronger, more determined political will, better legal frameworks, and accountability mechanisms that respond to todays digital world, added Trk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/04022728/Volker-Turk.jpg",
            "description": "<p>By Alois Vinga THE UN High Commissioner for Human Rights, Volker Türk, says that worldwide 90% of cases involving the murder of journalists have gone unresolved amid calls for member states to put in place watertight measures to protect media practitioners. While Zimbabwe has recorded improvements in recent years, as shown by the country’s leap</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-says-90-of-cases-in-journalists-murder-cases-go-unresolved/\">UN says 90% of cases in journalists’ murder cases go unresolved</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:45",
            "date": "04 Nov 2025"
        }
    ]
}