{
    "news": [
        {
            "title": "Bribes and rationing of AIDS medicine in Zimbabwe as Trump’s aid cuts bite",
            "url": "https://www.newzimbabwe.com/bribes-and-rationing-of-aids-medicine-in-zimbabwe-as-trumps-aid-cuts-bite/",
            "content": "By Jeffrey Moyo | HealthPolicyWatch\n\nMWENEZI, Zimbabwe  Memory Sibanda tried three times to get antiretroviral medication from her usual clinic in February but was turned away.\n\nThe 67-year-old has lived with HIV for the past 28 years. Jobless and widowed since 2003 when her husband succumbed to AIDS, Sibanda is unable to afford to buy the medication should the government fail to supply it.\n\nShe finally received a three-month supply in late February  half the usual allocation  and is anxious about what will happen when this runs out.\n\nI dont know if this reduction of our treatment pills is happening only here in our village. Nurses dont say anything to us about what is happening with the pills. I fear we might eventually end up not receiving the drugs at all, meaning many of us might die, Sibanda, who lives in Chomutsvairo village in the southern province of Masvingo, toldHealth Policy Watch.\n\nIn the capital, Harare, a similar crisis faces HIV/AIDS patients. Mavis Makumbe, 65, has depended on free ARV treatment from the government for decades. But in late February, her whole life changed when she visited the New Start Centre in the city to fetch her medication.\n\nI found a notice on the door saying it was closed and no longer in operation. From there, I went back home and started taking the remaining tablets, but those again were not enough, said Makumbe, a widow who has lived with HIV for 24 years.\n\nFortunately, her daughters friends rescued her by buying six months allocation of ARVs. The current going rate is $20 for a months supply  a fortune for the average Zimbabwean, with80% of peopleworking in the low-income informal sector and battling huge inflationary costs each month.\n\nThis is unsustainable for Makumbe, who is also battling cancer on one of her legs.\n\nHIV positive prisoners also toldHealth Policy Watchthat medicines are scarce.\n\nNot so long ago, we were being given rations of limited ARVs. Things are now worse after America has stopped giving us aid. Even painkiller pills are now hard to find in jail, said an HIV positive prison inmate at Chikurubi Maximum Prison in Harare.\n\nThe ARV shortage was caused when US President Donald Trump suspended all foreign aid for 90 days with immediate effect on 20 January.The Trump administration has since disbanded the US Agency for International Development (USAID), and extended the aid cut for a further 30 days until 20 May.\n\nWe were put in a very tough situation by the aid cut by President Trumps government, said Stanley Takaona, president of the Zimbabwe HIV/AIDS Activist Union Community Trust.\n\nThe aid cut-off was a bit harsh. We are praying that both our government and the US government will put on a humanitarian face and save our lives, as people living with HIV, added Takaona, 62, who tested HIV positive at the age of 34 and started taking ARV treatment in 2001.\n\nThe governments pre-exposure prophylaxis (PrEP) initiative targeted at people with high exposure to HIV like sex workers has also been suspended amid the Trump administrations global aid cuts.\n\nIn 2022, an estimated 1.3 million Zimbabweans were living with HIV, and 1.2 million were on ARVs  yet their medicine supply is now in jeopardy.\n\nZimbabwe has made significant progress against HIV, and in 2023 it became one of only five African countries that achieved the 95-95-95 targets set by UNAIDS, with an estimated 95% of people with HIV aware of their status, 98% on treatment, and 95% of those on treatment having suppressed viral loads.\n\nThis isaccording tothe United Nations Development Programme (UNDP), which has been the main recipient of the countrys Global Fund grant since 2009.\n\nBut with the US abandoning its commitments to combat the deadly virus abroad, activists like Sphiwe Chabikwa sees the gains made in fending off the disease being reversed.\n\nWe are at risk. People may start dying again like what happened around 2000 and 2002 before ARVs were made available to everyone with HIV. Im afraid, said Chabikwa, who lives in Harare.\n\nChabikwa is a member of the Zimbabwe National Network of People Living with HIV (ZNNP+), the countrys network of people living with HIV.\n\nFor the past 25 years, Chabikwa has lived with HIV, and her steady access to ARVs has enabled her to manage the virus as a chronic disease.\n\nI get the second-line of antiretroviral treatment, but that again has had its supplies affected by the recent US aid cut. Instead of people living with HIV like me getting six months supplies of ARVs, this has now been reduced to three months supplies. That means the treatment drugs are in short supply and the authorities are trying to manage a crisis.\n\nHealth experts predict that all the gains Zimbabwe made in defeating HIV might go to waste following the abrupt withdrawal of US aid.\n\nLong queues now characterise the collection of HIV treatment, and patients are fearful about what the future holds for them.\n\nFearing a future without ARVs, some other HIV patients admit to bribing nurses in order to get six months allocation of ARVs.\n\nMany HIV positive people in my area, including myself are now bribing nurses at local clinics in order to get the usual six months allocation of treatment drugs, said a resident from Harare who asked to remain anonymous.\n\nZimbabwean nurses stationed at clinics distributing ARVs have capitalized on the patients fears.\n\nIts our time to make money from the desperate HIV patients because our salaries alone cant sustain us and so, with the now scarce ARVs, we just put a small fee on them for our own benefit in our backdoor deals with patients, said a nurse at one of the clinics in Harare who spoke to Health Policy Watch on condition of remaining anonymous.\n\nYet the Zimbabwean authorities have denied that ARVs have run out. During a parliamentary question-and-answer session in February, Health Minister Douglas Mombeshora assured the nation that access to HIV treatment will continue despite global aid uncertainty.\n\nMombeshoraclaimedthat Zimbabwe has secured enough stock of antiretroviral (ARV) drugs to last for the next six months.\n\nDespite the Ministers assurance, HIV patients have seen their treatment allocations reduced and those living with HIV fear the worst.\n\nHowever, the Zimbabwean government is developing an HIV sustainability plan to address long-term funding issues and mobilising domestic resources to maintain priority HIV programmes,according to a UNAIDSreport released on 31 March.\n\nOver the past five years, the US provided over $1 billion Zimbabwe to combat HIV.\n\nBefore widespread access to ARV therapy in Zimbabwe, AIDS was a leading cause of death and estimated 130,000 people dying from HIV-related complications in 2002 alone, according to UNAIDS.\n\nThe availability of ARVs significantly reduced AIDS deaths, with the death toll dropping to around 20,200 by 2021, according to UNAIDS. Adult HIV prevalence has fallen from its peak of 26.5% in 1997 to 11.9% in 2021.\n\nOlive Mutabeni, executive director for Life Empowerment Support Organization (LESO), a community-based HIV/AIDS organization in Zimbabwe, has challenged authorities to step up and purchase ARVs.\n\nThere is a need for the Ministry of Health and the National AIDS Council to address this issue of ARVs supplies urgently before we lose people, said Mutabeni.\n\nMutabeni, aged 64, started taking ARVs in 2009 yet 16 years later, she is unsure of her access to treatment: I am worried that many HIV patients like me might soon perish like flies.\n\nThe permanent discontinuation of HIV programmes currently supported by the US Presidents Emergency Plan for AIDS Relief (PEPFAR) would lead to an additional 6.6 million new HIV Infections and additional 4.2 million AIDS-related deaths between 2025 and 2029,according to UNAIDS modelling.\n\nImage Credits:DFID,Jeff Moyo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/30204723/2000x1300-images-aidsmap-zimbabwe-children.png",
            "description": "<p>By Jeffrey Moyo | HealthPolicyWatch As Donald Trump’s US presidency reaches its 100th day, Zimbabweans living with HIV are fearful about their futures as they struggle to get antiretroviral medication. MWENEZI, Zimbabwe – Memory Sibanda tried three times to get antiretroviral medication from her usual clinic in February but was turned away. The 67-year-old has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/bribes-and-rationing-of-aids-medicine-in-zimbabwe-as-trumps-aid-cuts-bite/\">Bribes and rationing of AIDS medicine in Zimbabwe as Trump’s aid cuts bite</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "Zimbabwe’s healthcare system needs urgent action – CWGH says in workers day message",
            "url": "https://www.newzimbabwe.com/zimbabwes-healthcare-system-needs-urgent-action-cwgh-says-in-workers-day-message/",
            "content": "By Thandiwe Garusa\n\nCOMMUNITY Working Group on Health (CWGH) has called for urgent action to address corruption and exploitation within the countrys healthcare system.\n\nIn a Workers Day statement, CWGH said the government must implement clear and practical measures to not only meet the urgent needs of the health sector but also prepare for the withdrawal of key international donors.\n\nZimbabwes health sector is generally poorly funded and relies heavily on the support of Western development partners.\n\nThe crisis in the sector is expected to worsen as some of its international donors have announced significant budget cuts and funding withdrawals.\n\nIt is undeniable that the deplorable state of the countrys health system requires urgent attention, especially giving priority to revitalising the Primary Health Care concept and philosophy that once worked so well and gave Zimbabwe health leadership within the SADC region and beyond in the yesteryear.\n\nThe government should develop concrete actions not only to address the current and pressing health sector requirements but ensure that the impending transitioning out of major funders that has been announced is factored into the national planning for domestic resources mobilisation for health and its determinants for the long haul.\n\nThe government, therefore, needs to design and implement new and innovative domestic health financing policies to fund a strengthened primary health care strategy to achieve Universal Health Coverage, CWGH wrote.\n\nCWGH also expressed concern over Zimbabwes failure to stabilise the brain drain in the health sector, dilapidated hospital infrastructure in public institutions, inadequate medicines supply, as well as poor remuneration for workers.\n\nMeanwhile, according to CWGH, many Zimbabweans in remote and rural areas still travel over 30 km, often by wheelbarrow or scotch-cart, to access healthcare, highlighting the failure to provide clinics within the promised 10 km radius.\n\nThese public health services, which poor people rely on, have become too expensive, with patients now required to pay for essentials like blood, drugs, and diagnostics.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/22145327/A-patient-on-a-stretcher-bed-being-helped-into-the-hospital-by-relatives-as-one-oth-doctors-looks-on.jpg",
            "description": "<p>By Thandiwe Garusa COMMUNITY Working Group on Health (CWGH) has called for urgent action to address corruption and exploitation within the country’s healthcare system. In a Workers Day statement, CWGH said the government must implement clear and practical measures to not only meet the urgent needs of the health sector but also prepare for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-healthcare-system-needs-urgent-action-cwgh-says-in-workers-day-message/\">Zimbabwe’s healthcare system needs urgent action – CWGH says in workers day message</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "Shopper finds car stolen, ignores nearby police station and consults sangoma",
            "url": "https://www.newzimbabwe.com/shopper-finds-car-stolen-ignores-nearby-police-station-and-consults-sangoma/",
            "content": "By Staff Reporter\n\nA KADOMA man, whose car was stolen while he was shopping in a local supermarket, shocked all and sundry after failing to make a report at a police station situated less than 300 metres away from the crime scene.\n\nInstead, the car owner, Iwan Paraiwa, the next morning, proceeded to Harare, some 150 kilometres away, to consult a traditional healer, who, however, failed to throw bones to recover the vehicle. He later opted to lodge a report.\n\nZimbabwe Republic Police (ZRP) Mashonaland West spokesperson, lnspector Ian Kohwera confirmed the incident.\n\nOn the 28th of April 2025, police received a report of theft of a motor vehicle which happened at TM Pick and Pay parking bay within Kadoma CBD area.\n\nCircumstances are that on the 27th of April 2025 at around 1700 hours, Iwan Paraiwa (35) of 455 Ingezi Kadoma proceeded to Kadoma town with his motor vehicle, a blue Honda Fit old shape registration number AFZ 2665, and parked it at TM Pick and Pay parking bay, leaving the car keys on the ignition and the doors unlocked.\n\nHe entered the shop and came back after 20 minutes only to discover that his motor vehicle was stolen. Complainant checked for his motor vehicle around Kadoma town and failed to locate it, said Kohwera.\n\nOn the 28th of April 2025 in the morning, Iwan proceeded to Harare to seek assistance from a traditional healer, only to come back to Kadoma in the evening and make a report at ZRP Kadoma Central.\n\nThe police spokesman urged motorists to be careful when parking their vehicles and avoid leaving car keys in the ignition.\n\nWhere doors are locked with the alarm system, physical checking must be done to be sure.\n\nPolice are appealing for information which may lead to the arrest of the suspects and the recovery of the motor vehicle, he added.\n\nKohwera appealed to the public to report criminal cases promptly.\n\nMoreover, police would like to advise the general public to report cases early to their nearest police stations for quick investigations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/17163132/Honda-Fit.jpg",
            "description": "<p>By Staff Reporter A KADOMA man, whose car was stolen while he was shopping in a local supermarket, shocked all and sundry after failing to make a report at a police station situated less than 300 metres away from the crime scene. Instead, the car owner, Iwan Paraiwa, the next morning, proceeded to Harare, some</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/shopper-finds-car-stolen-ignores-nearby-police-station-and-consults-sangoma/\">Shopper finds car stolen, ignores nearby police station and consults sangoma</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "Respect the law, stop interfering – striking UZ lecturers tell deans of faculties",
            "url": "https://www.newzimbabwe.com/respect-the-law-stop-interfering-striking-uz-lecturers-tell-deans-of-faculties/",
            "content": "By Thandiwe Garusa\n\nTHE University of Zimbabwe (UZ) Association of University Teachers (AUT) has written to deans of faculties asking them to stop interfering with the ongoing job action following reports of intimidation and coercion.\n\nUZ lecturers announced a strike last month and have staged demonstrations at the learning institution over paltry salaries and poor working conditions.\n\nThe lecturers are demanding that their salaries be reinstated to the pre-2018 period when a junior lecturer earned US$2,250. Currently they have a net salary of less than US$250.\n\nThe ongoing collective job action includes a full withdrawal of services such as teaching, marking, exam duties, supervision, attending meetings, and responding to administrative messages, along with sit-ins and picketing.\n\nIn a letter seen by NewZimbabwe.com, AUT president Philemon Chamburuka said that since the strike began, there have been multiple complaints that some faculty deans and chairpersons have been threatening, coercing lecturers and misusing attendance registers.\n\nThe AUT Executive has received numerous complaints of some Deans and Chairpersons who, directly or indirectly, have interfered with or obstructed theaforementioned lawful and constitutional strike.\n\nThis has included threats of non-renewal of contracts, undue pressure to provide services including teaching, marking and processing of examinations or non-attendance of examination board meetings or face unspecified consequences.These threats have been accompanied by improper use of registers of attendance.\n\nThe AUT takes serious issue with the above conduct and hereby brings notice for the immediate cessation of any and all such conduct, including threats, that interfere with or obstruct the strike, reads part of the letter.\n\nThe AUT also warned it will pursue all legal remedies, including civil and criminal action, against the university and individuals for violating the rights of the union and its members.\n\nFor the foregoing, you as a public officer and as a representative/agent of the employer and in your personal capacity have an obligation to respect the law, including the ongoing collective job action by UZ employees.\n\nConsequently, there must be no interference whatsoever, directly or indirectly, with the strike.\n\nIn the AUT case, supra, the University of Zimbabwe committed itself to fully respect the strike and picketing. This includes yourself.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/24103947/UZ-strike-8-scaled.png",
            "description": "<p>By Thandiwe Garusa THE University of Zimbabwe (UZ) Association of University Teachers (AUT) has written to deans of faculties asking them to stop interfering with the ongoing job action following reports of intimidation and coercion. UZ lecturers announced a strike last month and have staged demonstrations at the learning institution over paltry salaries and poor</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/respect-the-law-stop-interfering-striking-uz-lecturers-tell-deans-of-faculties/\">Respect the law, stop interfering – striking UZ lecturers tell deans of faculties</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "Africa’s Minerals Will Shape the Future of Global Power",
            "url": "https://www.newzimbabwe.com/africas-minerals-will-shape-the-future-of-global-power/",
            "content": "By Otaviano Canuto and Sabrine Emran\n\nRABAT/WASHINGTON, DC  The clean-energy transition has fueled the global race for critical minerals, transforming elements like lithium, cobalt, and rare earths into strategic assets. At the center of this emerging resource war is the escalating rivalry between China and the United States, both of which are keenly aware that controlling mineral supply chains is essential to technological dominance.\n\nCritical minerals  especially lithium, nickel, cobalt, manganese, and graphite  are essential to sectors like semiconductors, electric-vehicle batteries, renewable energy, and defense. Rare earths, for example, are vital for the permanent magnets used in wind turbines and EV motors, while the power grids that sustain modern economies rely on huge quantities of aluminum and copper.\n\nThe geopolitical importance of critical minerals has surged in recent years, driven not only by their role in the green transition but also by the increasing fragility of concentrated supply chains. China currently dominates global mineral processing, refining more than 60% of the worlds lithium, 85% of its rare-earth elements, and 95% of its manganese.\n\nThis dominance has created new strategic vulnerabilities. A prime example is Chinas recent export restrictions on gallium and germanium, which show how critical inputs can be weaponized by great powers to gain a technological edge.\n\nUltimately, the green transitions trajectory will depend not only on where mineral deposits are located but also on how governments adapt. As countries shift away from fossil fuels, they risk replacing one form of resource insecurity with another unless they confront the complex dynamics of mineral supply and demand. Yet much of the current debate focuses on expanding supply, overlooking potential efficiency gains, as well as advances in recycling and material substitution.\n\nImportantly, Chinas resource dominance is not the result of vast mineral reserves but of strategic foresight. Although it controls only a fraction of the worlds minerals, China has spent decades bolstering its processing capabilities through targeted industrial policies, enabling it to control key stages of the global manufacturing pipeline. As a result, technology has emerged as the central axis of geopolitical realignment.\n\nWhile the US maintains a competitive edge in advanced semiconductor design and manufacturing equipment, China dominates clean-energy supply chains, from solar panels to batteries. But the US remains fully import-dependent for 15 critical minerals  including gallium and rare earths  and more than 50% dependent for another 34.\n\nGiven that China is the primary supplier of nearly half of these minerals, it is clear that Americas resource dependence poses a strategic threat to key sectors, including semiconductor production, defense, and clean energy. Recognizing these growing vulnerabilities, former US President Joe Biden signed the 2022 CHIPS and Science Act to boost semiconductor manufacturing. President Donald Trumps administration is currently pursuing an even more domestically oriented approach aimed at accelerating the extraction of critical minerals while streamlining the permitting process for mining projects on federal land.\n\nBut mineral security cannot be achieved through domestic production alone, which is why the Biden administration joined allies like Australia, Canada, and the European Union to establish the Minerals Security Partnership  an initiative aimed at friendshoring mineral production. Trump, by contrast, has adopted a more assertive approach, threatening to acquire Greenland one way or another and attempting to pressure Ukraine into a critical-mineral deal.\n\nThe scramble for critical minerals could have profound geopolitical implications, as resource-rich developing countries find themselves courted by both the US and China. At the same time, global industries face the prospect of fragmented supply chains divided along geopolitical lines.\n\nAfrica, home to roughly 30% of known mineral reserves  including 85% of the worlds manganese and 80% of its platinum and chromium  has emerged as a focal point of resource competition. This is especially true for countries like the Democratic Republic of the Congo (DRC), which holds an estimated 70% of global cobalt reserves, and platinum-rich South Africa.\n\nYet the disconnect between Africas vast resource wealth and its limited economic development remains striking. Many African economies like the DRC rely heavily on raw-material exports, having failed to invest meaningfully in value-added processing. Consequently, Sub-Saharan economies capture, on average, just 40% of the potential revenue from their natural resources  a gap that reflects a deeper systemic failure to unlock the full economic potential of these assets.\n\nBauxite is a case in point illustrating the vast economic opportunities lost due to the continued export of unprocessed commodities. While raw bauxite ore sells for roughly $92 per ton, its refined form  aluminum  fetches around $2,438 per ton.\n\nDespite its dominant share of global cobalt reserves, the DRC remains heavily dependent on raw-material exports. This overreliance, combined with a lack of vertical integration and economic diversification, leaves the country vulnerable to sharp downturns if global cobalt prices fall for an extended period.\n\nDelivering mutual benefits for mineral-rich African countries and the global industries that depend on their resources requires moving away from the exploitative models that have long shaped the global economy  and the US is uniquely positioned to offer such an alternative. To do so, it must champion an E3 framework: economically feasible, environmentally sustainable, and ethically grounded.\n\nIn addition to technological innovation, Americas critical-mineral policy should be guided by ethical engagement and infrastructure development. The Lobito Corridor  a US-backed project that aims to renovate the railway connecting Angola to land-locked cobalt and copper mines in the DRC and Zambia  demonstrates how strategic mineral development can generate value for local economies by supporting in-country processing rather than relying solely on raw exports.\n\nEncouragingly, the US has signaled its willingness to engage with mineral-rich Sub-Saharan countries. But the limited presence of US private-sector mining operations in the region, together with the rapidly shifting geopolitical landscape, underscores the need for an innovative, strategic approach focused on long-term value creation and mutually beneficial partnerships.\n\nOtaviano Canuto, a former vice president and executive director of the World Bank, executive director of the International Monetary Fund, vice president of the Inter-American Development Bank, and deputy minister of finance of Brazil, is a non-resident senior fellow at the Brookings Institution and a senior fellow at the Policy Center for the New South. Sabrine Emran is an economist at the Policy Center for the New South.\n\nCopyright: Project Syndicate, 2025. www.project-syndicate.org\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/30205144/Africas-Minerals-Will-Shape-the-Future-of-Global-Power.jpg",
            "description": "<p>By Otaviano Canuto and Sabrine Emran RABAT/WASHINGTON, DC – The clean-energy transition has fueled the global race for critical minerals, transforming elements like lithium, cobalt, and rare earths into strategic assets. At the center of this emerging resource war is the escalating rivalry between China and the United States, both of which are keenly aware</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africas-minerals-will-shape-the-future-of-global-power/\">Africa’s Minerals Will Shape the Future of Global Power</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "State charges AMH’s Heart and Soul TV in journalist Mhlanga’s case",
            "url": "https://www.newzimbabwe.com/state-charges-amhs-heart-and-soul-tv-in-journalist-mhlangas-case/",
            "content": "By Staff Reporter\n\nIn a fresh turn of events, the state has announced that it will be going after Alpha Media Holdings (AMH)s subsidiary, Heart and Soul TV.\n\nHSTV will be jointly charged with journalist Blessed Mhlanga for allegedly publishing messages that incite public violence.\n\nThis emerged when Mhlanga, who has been in jail since February this year, challenged his further remand before magistrate Ruth Moyo.\n\nHis trial is expected to commence on May 14, and according to his lawyer, HSTV will have been charged by then.\n\nThe state was supposed to give a trial date and allocate the matter to a trial court.\n\nInitially, the state had indicated that they needed one more postponement, but the state has now decided to rope in HSTV.\n\nThe state has pronounced that HSTV, the organisation that employs Blessed Mhlanga, will be a co-accused.\n\nCharges are going to be levelled against this media house called HSTV in respect of the charges that Blessed is facing, Mhike told journalists at court on Wednesday.\n\nMhlangas lawyer had challenged the postponement of the matter because they had been promised that a trial date was going to be set on Wednesday.\n\nHowever, after the lunch break, the state announced that it was ready for trial.\n\nThey suddenly changed their position to say they are suddenly ready to go to trial and allocatedMay 14 as the trial date, Mhike said.\n\nHe said, despite their indication that his lawyer of choice will be out of the country, prosecutors insisted that they will stick to the 14th.\n\nMhlanga is accused of publishing a press conference by war veteran Blessed Geza, who is on the run.\n\nDuring the press conference, Geza demanded that President Emmerson Mnangagwa resign and challenged calls for him to remain in power until 2030.\n\nMhlanga has been denied bail on three occasions by both magistrates and the High Court.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Staff Reporter In a fresh turn of events, the state has announced that it will be going after Alpha Media Holdings (AMH)’s subsidiary, Heart and Soul TV. HSTV will be jointly charged with journalist Blessed Mhlanga for allegedly publishing messages that incite public violence. This emerged when Mhlanga, who has been in jail since</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/state-charges-amhs-heart-and-soul-tv-in-journalist-mhlangas-case/\">State charges AMH’s Heart and Soul TV in journalist Mhlanga’s case</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "Govt backtracks on Bulawayo-Vic Falls road rehabilitation claims as concerns are raised over corruption in tender awards",
            "url": "https://www.newzimbabwe.com/govt-backtracks-on-bulawayo-vic-falls-road-rehabilitation-claims-as-concerns-are-raised-over-corruption-in-tender-awards/",
            "content": "By Staff Reporter\n\nThe Ministry of Transport and Infrastructural Development has backtracked on its statement that contractors are now on site and rehabilitation of the dilapidated Bulawayo-Victoria Falls Road will soon start, claiming wrong information was posted.\n\nA state-run newspaper on Monday published an article stating that eight contractors involved in the rehabilitation of the Bulawayo-Vic Falls road were now on site, which was shared on the Transport Ministrys X page.\n\nThis was despite an advert inviting contractors to bid for the upgrade of the road, stating that the tender process only closes on April 29, raising concerns that the contracts had been corruptly awarded.\n\nFor those who found it hard to believe that Emmerson Mnangagwa is the most corrupt politician Zimbabwe has ever had, here is your answer.\n\nThey floated a tender for the repair of the BulawayoVictoria Falls Road, and the closing date for this tender process is today, 29 Aprilhttps://t.co/ptkcv55ziKpic.twitter.com/5pkcogUJuC\n\n Hopewell Chinono (@daddyhope)April 29, 2025\n\nIn a statement, the Permanent Secretary for Transport and Infrastructural Development, Eng. Joy Makumbe said no contractor has been awarded the tender for the 440.4 kilometre project.\n\nThe Ministry of Transport and Infrastructural Development wishes to unreservedly apologise to members of the public and all its stakeholders for posting a Twitter message containing incorrect information on April 29, 2025, at 09:18 hours.\n\nThe Twitter message tagged a story published on April 28, 2025, by The Herald Online, which was headlined: Victoria Falls contractors on site. The Ministry acknowledges that no contractor is on site, as the tender process is still ongoing, the statement reads.\n\nThe permanent secretary said the error was due to a breach of internal protocol caused by their social media officer, who failed to verify the information.\n\nAdded Makumbe, One of the officers assigned the duty to manage the Ministrys Twitter handle conceded and acknowledged that she breached the internal Standard Operating Procedures for information verification by not verifying the authenticity of the facts with the technical officials in the Department of Roads before posting.\n\nThe Ministry stated that an evaluation committee will now review the bids before submitting its recommendations to the Special Procurement Oversight Committee.\n\nThe Ministry wishes to set the record straight on the matter as follows: the tender which was issued on April 17, 2025, closed on April 29, 2025, at 11:00 hours.\n\nAfter the closure of the bidding period, an evaluation committee will convene, whereupon the outcome will be sent to the Special Procurement Oversight Committee for oversight of the tender process before awarding the same to successful bidders, said Makumbe.\n\nThe reconstruction of the entire road is set to take 36 months, according to the Minister of Transport, Felix Mhona. The Bulawayo-Victoria Falls road is of major concern as it leads to Zimbabwes main tourist attraction.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/05/16192007/Felix-Mhona.jpg",
            "description": "<p>By Staff Reporter The Ministry of Transport and Infrastructural Development has backtracked on its statement that contractors are now on site and rehabilitation of the dilapidated Bulawayo-Victoria Falls Road will soon start, claiming “wrong information was posted”. A state-run newspaper on Monday published an article stating that eight contractors involved in the rehabilitation of the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-backtracks-on-bulawayo-vic-falls-road-rehabilitation-claims-as-concerns-are-raised-over-corruption-in-tender-awards/\">Govt backtracks on Bulawayo-Vic Falls road rehabilitation claims as concerns are raised over corruption in tender awards</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "Geza declares war on Tagwirei, vows to block business tycoon’s rise to power",
            "url": "https://www.newzimbabwe.com/geza-declares-war-on-tagwirei-vows-to-block-business-tycoons-rise-to-power/",
            "content": "By Staff Reporter\n\nWAR veteran Blessed Geza has vowed to stop ZANU PF business tycoon Kudakwashe Tagwirei from ascending to the countrys presidency.\n\nGeza, who has made Tagwirei a target of criticism, is claiming that the controversial businessman has set his sights on replacing President Emmerson Mnangagwa.\n\nHis claims stem from Tagwireis proximity to Mnangagwa and recent endorsement by the partys Harare Province into the Central Committee.\n\nHe is not stopping there. He is now in the Central Committee, whose position he got through the back door. He is not stopping there, he wants to become the President of the country. That is unacceptable. We will not accept this, said Geza.\n\nBusinessman Kudakwashe Tagwirei(Photo credit JEKESAI NJIKIZANA/AFP/Getty Images)\n\nTagwirei, through his proxies, has been securing government contracts. He won a multimillion-dollar deal to construct the Mbudzi Interchange flyover.\n\nHe has also expanded his business interests into mining and has a near-monopoly in the fuel sector.\n\nAdditionally, Tagwirei has been spearheading the Command Agriculture programme and is currently the chairperson of the Land Tenure Implementation Committee.\n\nThe business moguls company, Sakunda Holdings, was implicated in the disappearance of $3 billion from the Ministry of Agriculture between 2017 and 2018.\n\nAs a result, Tagwirei was sanctioned by the United States of America, which accused him of assisting senior government officials in corruption.\n\nGeza blasted Tagwirei and tenderpreneur Wicknell Chivayo, accusing them of corruption, which is bleeding the country.\n\nLook at the effects of this corruption. Our civil servants are getting peanuts. University lecturers are on strike protesting poor salaries. Even students have joined their lecturers.\n\nWhen you see University lecturers demonstrating, know the situation has deteriorated. It is a mockery when Chivayo, a grade seven, is being given millions just because they are close to Mnangagwa, said Geza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter WAR veteran Blessed Geza has vowed to stop ZANU PF business tycoon Kudakwashe Tagwirei from ascending to the country’s presidency. Geza, who has made Tagwirei a target of criticism, is claiming that the controversial businessman has set his sights on replacing President Emmerson Mnangagwa. His claims stem from Tagwirei’s proximity to Mnangagwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/geza-declares-war-on-tagwirei-vows-to-block-business-tycoons-rise-to-power/\">Geza declares war on Tagwirei, vows to block business tycoon’s rise to power </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "March 31 protest: Bail hearing of 94 protesters postponed again as prosecutors ask for more time",
            "url": "https://www.newzimbabwe.com/march-31-protest-bail-hearing-of-94-protesters-postponed-again-as-prosecutors-ask-for-more-time/",
            "content": "By Staff Reporter\n\nHigh Court judge, Justice Philipa Philips was on Wednesday forced to postpone the hearing of a bail appeal application by 94 individuals who were locked up on allegations of staging protests on March 31.\n\nOnly one of the 95, Munyaradzi Mazhiririwas granted bail.\n\nThe case could not be heard last week as state papers were not in order.\n\nOn Wednesday, the state stalled progress after prosecutors requested to call the investigating officer to testify against the suspects.\n\nThe hearing was then moved to next Monday.\n\nThe 94 are accusedof participating in a gathering with theintentionto promote public violence.\n\nThe state alleges the group took heed of calls by war veteran, Blessed Geza, currently in hiding, to protest against President Emmerson Mnangagwa.\n\nAccording to the State, on 31 March 2025 at around 0920 hours, the accused gathered at Robert Mugabe Square commonly known as the Freedom Square intending to march in the streets of Harare.\n\nProsecutors allege the group also wanted to proceed to the State House of Zimbabwe and forcibly remove the Constitutionally elected President Emmerson Mnangagwa.\n\nThe accused were making their vows of removing the President saying enough is enough, Mnangagwa must go, ED must go nezvigananda zvake.mMadzibaba veshanduko huyai mutitungamirire, comrade Geza huyai mutitungamirire and whistled.\n\nPolice officers who were deployed for maintenance of order observed about two hundred 200 people gathered and approached the group.\n\nThe accused piled stones, bricks and tyres along Robert Mugabe road. They threw stones towards the police officers whilst singing Hatidi zvekupihwa order nemasasikamu. They also took themselves pictures and videos which they posted on various social media platforms, reads court papers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/31133846/march-7.png",
            "description": "<p>By Staff Reporter High Court judge, Justice Philipa Philips was on Wednesday forced to postpone the hearing of a bail appeal application by 94 individuals who were locked up on allegations of staging protests on March 31. Only one of the 95, Munyaradzi Mazhiriri was granted bail. The case could not be heard last week as</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/march-31-protest-bail-hearing-of-94-protesters-postponed-again-as-prosecutors-ask-for-more-time/\">March 31 protest: Bail hearing of 94 protesters postponed again as prosecutors ask for more time   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        },
        {
            "title": "‘It is a damaging reinforcement of gender-based disrespect’ — Moja Love condemns MacG’s derogatory language",
            "url": "https://www.newzimbabwe.com/it-is-a-damaging-reinforcement-of-gender-based-disrespect-moja-love-condemns-macgs-derogatory-language/",
            "content": "TshisaLive\n\nIn a surprise turn of events, Moja Love has made a bold statement against misogyny and derogatory language on air.\n\nIn a recent episode ofPodcast and Chill, while discussing Minnie Dlaminis break-up from plastic surgeon Dr Brian Monaisa, MacG questioned why the media personality cannot keep a man and suggested her private parts could have an unpleasant smell.\n\nMoja Love released a statement on social media condemning the behaviour of MacG for using offensive language towards women.\n\nMacGs persistent use of derogatory language towards women, reducing them to vulgar slurs and objectifying their bodies, is not only offensive, it is a damaging reinforcement of gender-based disrespect. Such behaviour has no place in society and media specifically, where voices should uplift, not degrade. Moja Love (DStv 157) as a platform is committed to fostering a respectful and inclusive environment. We refuse to stay silent.\n\nMisogyny on air doesnt only harm the individuals targeted, it perpetuates a toxic culture that normalises the dehumanisation of women. Yesterday we took a firm stance against this conduct, and we will continue to challenge such rhetoric whenever it arises. Media is designed to shape societal norms, and with that influence comes responsibility. To MacG and others who use their platforms carelessly: accountability is not optional. We urge audiences and broadcasters alike to reject sexist vitriol and demand better. Respect isnt a privilege, its a right.\n\nThe channel has also received flack for airing a recent episode of the reality showIsencane Lengane.\n\nThe show, in its seventh season, which follows the lives of Siyacela Dlamuka and Thando Msomi, who married when they were teenagers,sparked outrage among viewers, with many raising concerns about the couples toxicity.\n\nAccording to Moja Love,Isencane Lenganeis designed to contribute to the discourse on gender-based violence and societal ills, with the aim of raising awareness and promoting positive change.\n\nMoja Love said they are committed to providing psychological support to affected members, including Thando, who was affected by events depicted in the show, and would continue to offer support.\n\nIt is important to note the show is a reality show which reflects, explores and raises awareness and contributes to the discourse on gender-based violence and societal ills. The channel has through many of its social justice programmes played a pivotal role in shaping discourse and contributing positively in society, read thestatement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/30072806/macg.png",
            "description": "<p>TshisaLive In a surprise turn of events, Moja Love has made a bold statement against misogyny and derogatory language on air. In a recent episode of Podcast and Chill, while discussing Minnie Dlamini’s break-up from plastic surgeon Dr Brian Monaisa, MacG questioned why the media personality cannot “keep a man” and suggested her private parts could</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/it-is-a-damaging-reinforcement-of-gender-based-disrespect-moja-love-condemns-macgs-derogatory-language/\">‘It is a damaging reinforcement of gender-based disrespect’ — Moja Love condemns MacG’s derogatory language</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:33",
            "date": "01 May 2025"
        }
    ]
}