{
    "news": [
        {
            "title": "Eli Lilly weight-loss drug appears to suppress binge-eating signal, small study finds",
            "url": "https://www.newzimbabwe.com/eli-lilly-weight-loss-drug-appears-to-suppress-binge-eating-signal-small-study-finds/",
            "content": "Researchers monitoring the brain activity of a patient with a severe binge-eating problem reported that Eli Lillys GLP-1 weight-loss drug appeared to temporarily suppress food-craving signals in the reward center of the brain.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18053406/weight-loss-injections.jpg",
            "description": "<p>Reuters Researchers monitoring the brain activity of a patient with a severe binge-eating problem reported that Eli Lilly’s GLP-1 weight-loss drug appeared to temporarily suppress food-craving signals in the “reward center” of the brain. These are the first direct measurements of brain activity in a person receiving tirzepatide, sold as Mounjaro for diabetes and Zepbound</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/eli-lilly-weight-loss-drug-appears-to-suppress-binge-eating-signal-small-study-finds/\">Eli Lilly weight-loss drug appears to suppress binge-eating signal, small study finds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Nov 2025"
        },
        {
            "title": "In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds",
            "url": "https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/",
            "content": "The Globe and Mail\n\nThe documentaryMbira Talks, about a Zimbabwean-Canadian musicians relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Eds department store in the background.\n\nThe lights went out in that building in 2016, and it was torn down a year later. Director Adrienne Amato originally planned to make a film about Stella Chiweshe, the pioneering rebel queen of the instrument, often referred to as a thumb piano because of the metal tines affixed to a wooden board that are struck by the first digits of the human hand.\n\nLogistics sabotaged the film on Chiweshe, who died in 2023 at age 76. Amato, who is white and was born in Zimbabwe when it was still under British rule as Rhodesia, immigrated to Toronto in 1977. After Chiweshes death, she shifted her focus to Mutamba. Still, the documentary, which premieres online and at the South African Film Festival in Toronto on Monday, took years to make, mostly because of money.\n\nIts very specific what gets funding these days, said the filmmaker, who joined Mutamba on a video call. Unless you have a celebrity in your doc or its a whodunnit crime thing, its a difficult landscape for making documentaries these days.\n\nAmato did not have a celebrity in her film, but she and Mutamba did have one on their side. Canadian indie-pop star Leslie Feist donated her frequent-flier miles for the trip to Africa by Amato, Mutamba and cinematographer Tess Girard. She also helped pay for the digging of a well at the Ubuntu Learning Village, the educational and community hub Mutamba co-founded in rural Zimbabwe.\n\nMutamba came to Canada more than 20 years ago to study economics at Trent University in Peterborough, Ont. The self-described village human finds Toronto too loud and crowded. In 2007, longing for a connection with his homeland, he took up the mbira, a ceremonial instrument tied to traditions of the Shona culture.\n\nThe late Chiweshe called the mbira a telephone to the spirits of people, water, trees and birds. Deeming it subversive, Rhodesias white authorities and Christian missionaries banned the instrument. The mbira is part of Mutambas educational mission involving food sovereignty, arts and cultural reclamation.\n\nIm intrigued by the power of community, he said. People are searching for it. Were all searching for village.\n\nFormer Toronto landmark Honest Eds can be seen across the street from Mutamba in a still from the documentary.Supplied\n\nMutamba is both a facilitator and a searcher himself. He longs for home, but Toronto is where he earns a living as co-director of Bloom Consulting, specializing in strategic planning, conflict mediation and psychotherapy. Canadas wealthy biggest city is his hunting place, where money is made to be used in Zimbabwe.\n\nThe mbira is more popular in Western Canada than in its eastern counterpart  Vancouver Island is the hotbed. Though the instrument is foreign to Canada, Mutamba believes its effect is universal.\n\nIt provokes certain emotions, he said. It is in the body. Its beyond the otherness. It is a sound that is human.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18051030/rainos-mutamba-mbira-canada.jpg",
            "description": "<p>The Globe and Mail The documentary Mbira Talks, about a Zimbabwean-Canadian musician’s relationship with an instrument once banned during colonisation, took a long time to make. We know this because Moyo Rainos Mutamba is shown plucking his mbira on a Toronto street, with the glittering Honest Ed’s department store in the background. The lights went</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-canadian-documentary-mbira-talks-a-zimbabwean-musical-instrument-connects-two-worlds/\">In Canadian documentary ‘Mbira Talks’, a Zimbabwean musical instrument connects two worlds</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Nov 2025"
        },
        {
            "title": "AfriForum seeks G20 countries’ intervention on South Africa’s property rights and farm murders",
            "url": "https://www.newzimbabwe.com/afriforum-seeks-g20-countries-intervention-on-south-africas-property-rights-and-farm-murders/",
            "content": "IOL\n\nLobby group AfriForum has called on G20 countries to usethe upcoming summit in Johannesburgand subsequent diplomatic engagements with South Africa to urge the government to respect property rights and take stronger action to address farm murders.\n\nThe organisation stated that it had written to the embassies of G20 member states, outlining concerns about what it described as the erosion of property rights and the rise in violent attacks on farmers, and had also presented what it called practical solutions to both issues.\n\nAfriForum CEO Kallie Kriel stated that the lack of progress in addressing these matters had already impacted the G20 summit,pointing out that the United States had decided to boycott the gathering due to such concerns.\n\nG20 countries can play a constructive role in stabilising both local and international relations by pledging their support for efforts to protect property rights and combat farm murders, Kriel said.\n\nHe argued that it was in the G20s own interest to ensure that property rights in South Africa were safeguarded, warning that uncertainty in this area could deter foreign investment.\n\nThe disregard for property rights in places like Zimbabwe and Venezuela has caused great suffering for ordinary people, leading to hyperinflation, unemployment and growing poverty, Kriel added.\n\nAfriForum has been a vocal critic of the Expropriation Act, which allows for the taking of property without compensation under certain conditions. Kriel said the organisations campaign against the policy was motivated by what it saw as the potentially catastrophic consequences for all South Africans.\n\nAmong the measures AfriForum is proposing are:\n\nOn property rights, AfriForum has called for amendments to the Expropriation Act, including the scrapping of Section 12(3), which allows for expropriation without compensation.\n\nAfriForum said it is set to launch a report regarding what it termed the violation of minorities human rights in South Africa.\n\nLast week,IOL reported that Argentinas President Javier Milei will not attend the G20 leaders summit in Johannesburg, aligning witha boycott of the key meeting backed by United States President Donald Trump.\n\nAccording to reports in Argentine media, Milei will instead send Foreign Minister Pablo Quirno to represent the country, along with G20 negotiator Federico Pinedo.\n\nThe decision marks a show of solidarity with Trump, who announced that the United States would not participate in the G20 summit in South Africa, citing alleged human-rights abuses against Afrikaner farmers in the country.\n\nArgentinas government has not issued an official statement on the withdrawal, but presidential aides quoted in local outlets said the move was in line with Washingtons position.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/18050036/Afriforum.jpg",
            "description": "<p>IOL Lobby group AfriForum has called on G20 countries to use the upcoming summit in Johannesburg and subsequent diplomatic engagements with South Africa to urge the government to respect property rights and take stronger action to address farm murders. The organisation stated that it had written to the embassies of G20 member states, outlining concerns about what</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/afriforum-seeks-g20-countries-intervention-on-south-africas-property-rights-and-farm-murders/\">AfriForum seeks G20 countries’ intervention on South Africa’s property rights and farm murders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Nov 2025"
        },
        {
            "title": "Brendan Galloway injury update as Plymouth Argyle defender set to get all clear",
            "url": "https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/",
            "content": "Plymouth Live\n\nPlymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday.\n\nThe 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria in another friendly international last Thursday, which was played in Saudi Arabia.\n\nGalloway started the match at the Prince Abdullah Al-Faisal Stadium in Jeddah but was substituted in the 84th minute as he made his seventh appearance for Zimbabwe.\n\nGalloway will be assessed by Argyles medical department on his return to Home Park from international duty later this week.\n\nThe friendly internationals against Algeria and Qatar, under newly-appointed head coach Mario Marinica, are Zimbabwes final games before they compete at the 2025 Africa Cup of Nations in Morocco at the end of December.\n\nZimbabwe have been drawn in Group B and will play games against Egypt on December 22, South Africa on December 26 and Angola on December 29.\n\nWith Galloway expected to be included in the Warriors squad for the tournament, he is likely to miss a few matches for Argyle over the Christmas and New Year period.\n\nArgyle are bottom of League One and did not have a game at the weekend because of international call-ups, including that of Galloway, while Port Vale moved up one position to 22nd after a 0-0 draw at home to Wycombe Wanderers.\n\nPilgrims boss Tom Cleverley was among the crowd at Vale Park as he took the opportunity to get a first-hand glimpse of Darren Moores Valiants.\n\nIt was a result which moved the Staffordshire side a point clear of the Pilgrims, but they have now played one more match than them.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/18042712/Brendan-Galloway.png",
            "description": "<p>Plymouth Live Plymouth Argyle defender Brendan Galloway is expected to be available for the important League One away game against Port Vale on Saturday despite not being involved for Zimbabwe in a friendly international against Qatar on Monday. The 27-year-old suffered a minor facial injury playing for his country in a 3-1 defeat by Algeria</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-galloway-injury-update-as-plymouth-argyle-defender-set-to-get-all-clear/\">Brendan Galloway injury update as Plymouth Argyle defender set to get all clear</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Nov 2025"
        },
        {
            "title": "Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party",
            "url": "https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/",
            "content": "By Leopold Munhende\n\nFormer Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling partys 2013 election victory by financing its campaign.\n\nShamu, famed for his vaMugabe iCremora praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend.\n\nHe said Tagwirei, who was recently co-opted into Zanu PFs influential Central Committee, quietly provided key resources that helped secure the partys win.\n\nFormer Minister Webster Shamu\n\nI did not get to know Tagwirei today; many of us have known him for years.\n\nFor the first time in public, I will tell you that Tagwirei financed our 2013 election campaign. He gave us resources, ensured we had fuel, and provided everything we needed.\n\nWe did not say this in newspapers because he is a quiet, disciplined, and humble leader, said Shamu.\n\nZanu PF went on to claim 61.88% of the presidential vote in 2013 and secured 196 of the 270 contested parliamentary seats.\n\nTagwirei has recently taken an increasingly visible role in the ruling partys affairs and is widely viewed as a potential successor to President Emmerson Mnangagwa in 2028 or 2030, depending on whether Mnangagwas second-term extension push succeeds.\n\nHis main rival remains Vice President Constantino Chiwenga, whose presidential ambitions have long been known.\n\nWhile Chiwenga has kept a low profile, Tagwirei has been a prominent guest at party events, reportedly donating more than US$500,000.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/15160729/tagwirei.jpeg",
            "description": "<p>By Leopold Munhende Former Zanu PF political commissar Webster Shamu has revealed that businessman Kudakwashe Tagwirei played a major role in the ruling party’s 2013 election victory by financing its campaign. Shamu, famed for his “vaMugabe iCremora” praise-singing, made the remarks at a Provincial Coordinating Committee (PCC) meeting in Chinhoyi over the weekend. He said</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tagwirei-bankrolled-zanu-pfs-2013-campaign-reveals-former-minister-shamu-says-controversial-tycoon-not-new-to-the-ruling-party/\">Tagwirei bankrolled Zanu PF’s 2013 campaign, reveals former Minister Shamu – says controversial tycoon ‘not new’ to the ruling party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Nov 2025"
        },
        {
            "title": "Over 2,500 people affected by political violence in October, Zanu PF the leading perpetrator – report",
            "url": "https://www.newzimbabwe.com/over-2500-people-affected-by-political-violence-in-october-zanu-pf-the-leading-perpetrator-report/",
            "content": "By Thandiwe Garusa\n\nAt least 2,531 people were affected by political violence in October across the country, according to the latest report by the human rights watchdog Zimbabwe Peace Project (ZPP).\n\nZPP listed the ruling Zanu PF as the leading perpetrator of human rights violations, followed by local authorities, the police, and traditional leaders.\n\nThe organisation recorded 116 incidents, which included threats of violence, restrictions on freedoms of assembly and expression, denial of access to social services, politically motivated assaults, displacement, unfair distribution of food aid, and arbitrary arrests.\n\nAcross the country, 116 violations affected 2,531 individuals, including persons with disabilities, highlighting the vulnerability of marginalised groups. Citizens were subjected to forced displacements, politically motivated assaults, hate-driven attacks, and threats of violence, while fundamental rights to freedom of assembly, association, and expression were routinely curtailed, reads the report.\n\nOf those affected, 1,360 were women and 1,171 were men, including 109 persons with disabilities.\n\nThe watchdog urged authorities to strengthen human rights protections, ensure transparent delivery of public services, and establish safe reporting mechanisms that protect victims from retaliation.\n\nThe actions of ruling party supporters, local authorities, police, and traditional leaders illustrate how political power is often leveraged to intimidate, coerce, and control communities, eroding public trust and reinforcing inequalities.\n\nZimbabwe must urgently improve protections for civic and political rights, ensure fair and transparent delivery of public services, and create strong, safe systems for reporting abuses. These steps are needed to protect victims from retaliation and to make sure human rights are genuinely respected, not just promised in law.\n\nZanu PF has repeatedly been cited this year as the main perpetrator of human rights violations in Zimbabwe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/04031733/Political-Violence.png",
            "description": "<p>By Thandiwe Garusa At least 2,531 people were affected by political violence in October across the country, according to the latest report by the human rights watchdog Zimbabwe Peace Project (ZPP). ZPP listed the ruling Zanu PF as the leading perpetrator of human rights violations, followed by local authorities, the police, and traditional leaders. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/over-2500-people-affected-by-political-violence-in-october-zanu-pf-the-leading-perpetrator-report/\">Over 2,500 people affected by political violence in October, Zanu PF the leading perpetrator – report</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:44",
            "date": "18 Nov 2025"
        }
    ]
}