{
    "news": [
        {
            "title": "Minister Garwe defends government, blames Chitungwiza Municipality for delayed response to Seke Road accident",
            "url": "https://www.newzimbabwe.com/minister-garwe-defends-government-blames-chitungwiza-municipality-for-delayed-response-to-seke-road-accident/",
            "content": "By Darlington Gatsi\n\nLocal Government Minister Daniel Garwe has insisted that the Civil Protection Department responded well and swiftly to the Seke Road accident that claimed 17 lives, despite criticism over the slow emergency response.\n\nSeventeen people died when a haulage truck veered off the road, swerving into the opposite lane and colliding with an oncoming minibus along Seke Road last week.\n\nThe accident exposed the governments weak emergency response mechanisms, with eyewitnesses reporting that many victims died on the accident scene due to the absence of a rescue crane.\n\nResponding to questions in the National Assembly recently, Minister of Local Government and Public Works, Daniel Garwe, defended the governments handling of the tragedy.\n\nThe issue of responsiveness in terms of time taken is subject to the time that the accident is reported to the responsible authority, in this case, the Civil Protection Department.\n\nWe cannot say the Ministry failed to respond timeously. It depends on the time when the incident was reported. I will have to find out the time that was taken to receive the response and the time we went to the site, said Garwe.\n\nHe added:The issue of having cranes on site also depends on how the accident was reported. Maybe people just reported that there was an accident along the Chitungwiza Road at a river bridge without giving the intimate details of how the accident was reported.\n\nSo, we cannot answer that in that regard, it is very difficult, but from the Civil Protection Department side, the Government is doing extremely well. We responded swiftly.\n\nFollowing the horrific crash, the government faced criticism from observers and opposition figures, including Nelson Chamisa, over its lack of preparedness for emergencies.\n\nHowever, Garwe shifted blame onto the Chitungwiza Municipality, accusing it of a delayed response despite being equipped to handle such situations.\n\nAt the Chitungwiza Road accident, the Department of Civil Protection was there first before everybody else and the fire tenders which came from Harare, were also activated by that department.\n\nMadam Speaker, you may want to know that the Government has capacitated all 92 local authorities with firefighting equipment to use in situations such as what happened last week on Friday in Chitungwiza, where a road traffic accident cost the lives of 17 of our citizens.\n\nAll local authorities in the urban areas were equipped with at least two fire tenders each and we wanted to sit down and ask the local authority responsible in Chitungwiza why its reaction was so slow and to ask the city council to come and assist, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133122/1000794263-scaled.jpg",
            "description": "<p>By Darlington Gatsi Local Government Minister Daniel Garwe has insisted that the Civil Protection Department responded “well and swiftly” to the Seke Road accident that claimed 17 lives, despite criticism over the slow emergency response. Seventeen people died when a haulage truck veered off the road, swerving into the opposite lane and colliding with an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/minister-garwe-defends-government-blames-chitungwiza-municipality-for-delayed-response-to-seke-road-accident/\">Minister Garwe defends government, blames Chitungwiza Municipality for delayed response to Seke Road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "01 Aug 2025"
        },
        {
            "title": "National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors",
            "url": "https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/",
            "content": "By Darlington Gatsi\n\nGOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/08040038/WhatsApp-Image-2025-05-07-at-22.29.25.jpeg",
            "description": "<p>By Darlington Gatsi GOVERNMENT is racing against time to complete the renovation of the National Sports Stadium, with doubts growing over whether the Zimbabwe national team will play their remaining World Cup qualifiers on home soil. The stadium has been undergoing renovations after being deemed unfit to host international matches in 2021 by the Confederation</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/national-sports-stadium-renovations-delay-as-world-cup-qualifiers-loom-for-homeless-warriors/\">National Sports Stadium renovations delay as World Cup Qualifiers loom for homeless Warriors</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "01 Aug 2025"
        },
        {
            "title": "‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record",
            "url": "https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/",
            "content": "BBC\n\nA baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record.\n\nLindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce toldMIT Technology Reviewher family thought its like something from a sci-fi movie.\n\nIt is believed to be longest that an embryo has been frozen before resulting in a successful live birth. The previous record-holder wasa pair of twins who were born in 2022 from embryos frozen in 1992.\n\nThe Pierces had tried to have a child for seven years before they decided to adopt the embryo Linda Archerd, 62, made with her then-husband in 1994 through IVF.\n\nAt the time, Ms Archerd initially created four embryos. One become her now-30-year-old daughter, and the other three were left in storage.\n\nDespite separating from her husband, she did not want to get rid of the embryos, donate them for research or give them to another family anonymously.\n\nShe said it was important that she was involved with the baby, as they would be related to her adult daughter.\n\nMs Archerd paid thousands of dollars a year for storage until she found a Christian embryo adoption agency, Nightlight Christian Adoptions, which runs a programme known as Snowflakes. Many of these agencies consider their programmes to be saving lives.\n\nThe programme used by Ms Archerd allows donors to choose a couple, meaning they can state religious, racial and nationality preferences.\n\nMs Archerds preference was for a married Caucasian, Christian couple living in the US, as she didnt want to go out of the country, she told MIT Technology Review.\n\nShe ultimately matched with the Pierces.\n\nThe IVF clinic in Tennessee at which the couple underwent the procedure, Rejoice Fertility, said its aim was to transfer any embryo it received, no matter the age or conditions.\n\nMs Pierce said she and her husband did not set out to break any records, but just wanted to have a baby.\n\nMs Archerd told MIT Technology Review she had not met the baby in person yet, but could already see a resemblance with her daughter.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31194934/embryo.webp",
            "description": "<p>BBC A baby boy has been born to an Ohio couple from an embryo that was frozen for more than 30 years, reportedly setting a new world record. Lindsey, 35, and Tim Pierce, 34, welcomed their son, Thaddeus Daniel Pierce, on Saturday. Ms Pierce told MIT Technology Review her family thought “it’s like something from a sci-fi</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/like-a-sci-fi-movie-us-baby-born-from-30-year-old-frozen-embryo-breaks-record/\">‘Like a sci-fi movie’: US baby born from 30-year-old frozen embryo breaks record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "01 Aug 2025"
        },
        {
            "title": "Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash",
            "url": "https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/",
            "content": "CentralNewsZA\n\nPolokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality.\n\nIn a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota, a Zimbabwean national, as the new Director of Water and Sanitation at Polokwane Municipality. Mpe stressed that the choice was driven by Chihotas strong qualifications and experience, which he believes will help fix long-standing water shortages and infrastructure issues in the city.\n\nChihota is a professionally registered engineer (ECSA) and holds: a Bachelors Degree in Civil Engineering (University of Zimbabwe), Mpe said, highlighting the engineers academic background. He added that Chihota also has Four Masters Degrees in: Water Resources Engineering & Management (University of Zimbabwe), Business Administration (University of Zimbabwe), Property Development (University of the Witwatersrand), and Engineering (University of Stellenbosch).\n\nThis defence comes after widespread public outcry on social media and in local communities, where some residents accused the municipality of favouring foreign nationals over South Africans amid high unemployment rates. The appointment has sparked debates about job opportunities for locals, especially in a province like Limpopo where water access remains a daily struggle for many.\n\nChihotas Qualifications and Experience Under the Spotlight\n\nMpe went into detail about why Chihota stood out during the selection process. He described the new director as a seasoned professional with over 20 years in water systems management, mostly in South African municipalities. He brings experience from: University of Limpopo (Senior Lecturer), Capricorn District Municipality (PMU Manager, Water Services Manager, and Senior Manager for Infrastructure), City of Cape Town, Johannesburg Water, and City of Ekurhuleni, Managing Director at Ekurhuleni Water Care Company, the mayor explained. Mpe made it clear that with such a track record, the municipality is not experimenting but executing on its plans to improve services.\n\nChihotas role is seen as key in dealing with Polokwanes water backlogs, which have left some areas without reliable supply for years. The city has faced ongoing problems like ageing pipes, leaks, and unequal distribution, made worse by rapid urban growth. Residents in townships often rely on communal taps or tankers, while rural parts battle droughts. Mpe argued that Chihotas expertise in water resources and infrastructure will speed up fixes, including upgrades to dams, treatment plants, and distribution networks. Supporters on social media have echoed this, with one user praising him as a seasoned engineer who has spent 20 years serving mostly municipality water systems, hoping for flowing taps of clean water.\n\nHowever, critics question if local talent was overlooked. Opposition parties like the Economic Freedom Fighters (EFF) and Democratic Alliance (DA) have called for transparency in the hiring process, pointing to thousands of unemployed South African engineers. They argue that while merit matters, the government should prioritise citizens in public jobs to fight poverty and build skills at home.\n\nBacklash Linked to Broader Allegations of Favouritism\n\nThe controversy around Chihotas appointment has been fuelled by recent claims that Polokwane Municipality awards tenders to foreign nationals, which Mpe confirmed but defended as merit-based. Just days before, explosive allegations surfaced about a R56 million tender for water infrastructure reportedly given to a company owned by the municipal manager Thuso Nemugumonis alleged Zimbabwean boyfriend. The deal, worth R56,309,901.35, involved supply and maintenance work, but opposition groups labelled it as nepotism and corruption. Mpe has denied any wrongdoing, calling the claims a smear campaign aimed at damaging the municipalitys image.\n\nSocial media has been ablaze with mixed views. Some posts slam the hire as spitting on the faces of voters, with one user noting qualified South African youth are overlooked while foreigners get top posts. Others defend it, saying, Zimbabweans are doing great and serving our communities well. The backlash has hints of xenophobia, with calls to put South Africans first amid economic hardships. Community groups worry this could strain relations with migrant workers who contribute to Limpopos economy in farming and services.\n\nNew Chief Operations Officer Appointed to Strengthen Leadership\n\nIn the same council meeting, Polokwane also named Babalwa Mosomane as the new Chief Operations Officer (COO), a move Mpe hailed as another step to boost efficiency. Mosomane brings a wealth of auditing and management skills to the role. She holds Postgraduate Diplomas in Forensic Auditing and Internal Auditing from UNISA, along with B-Tech and National Diplomas in Internal Auditing from Nelson Mandela Metropolitan University. Her other qualifications include the Municipal Finance Management Programme and Programme in Management Development from Wits Business School.\n\nMosomane is a certified internal audit practitioner, certified ethics practitioner, and a qualified quality assessor, accredited by the relevant professional bodies. Mpe said her expertise will help tighten controls on spending and fight corruption, especially after recent tender troubles. Her appointment has received less criticism, with many seeing it as a positive for good governance in the municipality.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31195725/KENNEDY-CHIHOTA.webp",
            "description": "<p>CentralNewsZA Polokwane Mayor John Mpe defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash, insisting the decision prioritises skills to tackle water challenges rather than politics or nationality. In a media briefing held at Peter Mokaba Stadium on Thursday, Mayor John Mpe addressed growing criticism over the recent council approval of Kennedy Chihota,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/polokwane-mayor-defends-merit-based-appointment-of-zimbabwean-engineer-kennedy-chihota-amid-public-backlash/\">Polokwane Mayor defends merit-based appointment of Zimbabwean engineer Kennedy Chihota amid public backlash</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "01 Aug 2025"
        },
        {
            "title": "UK: Diaspora Insurance hosts Zimbabwe Embassy outreach for passports and other consular services",
            "url": "https://www.newzimbabwe.com/uk-diaspora-insurance-hosts-zimbabwe-embassy-outreach-for-passports-and-other-consular-services/",
            "content": "By UK Correspondent\n\nLONDON: THE Zimbabwe Embassy in the UK will next week take its outreach programme to the West Midlands, allowing Zimbabweans in the region to apply for passports and access other consular services.\n\nAccording to a notice from the embassy, the outreach will be hosted byDiaspora Insuranceat its global headquarters in Birmingham from Tuesday (05/08/25) to Thursday (07/05/25).\n\nServices available include passports, child registration, temporary travel documents, as well as police clearance.\n\nService is on first come first serve basis. No appointment is required. We look forward to meeting you soon for seamless Consular services, the embassy said in its public notice.\n\nThe global risk solutions specialist firm will host the embassy at Diaspora Insurance House, Parklands Business Centre, Parklands Business Park,Birmingham B45 9PZ.\n\nCommenting on the development, a company representative said, We are pleased to host the Zimbabwe Embassys consular services outreach programme.\n\nProviding a platform for such essential services not only helps facilitate easier access to consular assistance but also demonstrates our commitment to serving the needs of the Zimbabwean community here.\n\nWe look forward to continuing this collaboration and working together to ensure that our community members receive the support and services they deserve.\n\nFrom Birmingham, the outreach programme will also take in the Channel Islands of Jersy and Gurnsey towards the end of August.\n\nMeanwhileDiaspora Insurancesaid its head office is available not just to the Zimbabwe community but all the 20 African nationalities the company covers across the globe.\n\nEstablished more than 14 years ago,Diaspora Insurancehas grown exponentially over the years with its bespoke funeral cash plan product providing critical financial intervention which ensures Africans in the Diaspora do not endure the indignity of GoFundMe appeals to deal with end-of-life expenses.\n\nWith no medicals asked, African transnational citizens can cover themselves in the Diaspora as well as family back home with a product that removes the double trauma of bereaving a loved one while also begging for financial assistance to help with funeral costs.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/31170830/Diaspora-Insurance-House.png",
            "description": "<p>By UK Correspondent LONDON: THE Zimbabwe Embassy in the UK will next week take its outreach programme to the West Midlands, allowing Zimbabweans in the region to apply for passports and access other consular services. According to a notice from the embassy, the outreach will be hosted by Diaspora Insurance at its global headquarters in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-diaspora-insurance-hosts-zimbabwe-embassy-outreach-for-passports-and-other-consular-services/\">UK: Diaspora Insurance hosts Zimbabwe Embassy outreach for passports and other consular services</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:34",
            "date": "01 Aug 2025"
        }
    ]
}