{
    "news": [
        {
            "title": "More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe",
            "url": "https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/",
            "content": "IOL\n\nA 31-year-old man has appeared before the Polokwane Magistrates Court in Limpopo after he was arrested when police intercepted another stolenToyota Corolla Crosssport utility vehicle which was apparently being driven towards the Beitbridge port of entry.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody, and the court postponed the matter to Monday next week.\n\nMashaba said the matter was postponed for profiling of the arrested man. Police have since established that Mlambo is a South African national.\n\nEarlier,IOL reported that thegrey SUV that was driven by Mlambo in Limpopo was reported stolen earlier this month, around Pretoria Central.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nOn Friday, 16 May 2025, members of provincial Flying Squad were busy conducting routine patrol duties when they received intelligence information about a grey Toyota Corolla Cross SUV vehicle that was reported stolen this month, said Mashaba.\n\nThe vehicle was allegedly travelling at high speed along the N1 South public road and was destined to be smuggled to Zimbabwe.\n\nThe police immediately commenced an intensive search for the stolen vehicle until it was positively spotted driving outside Polokwane.\n\nPolice officers attempted to stop the speeding vehicle, but the driver refused to yield.\n\nA car chase ensued until the vehicle was intercepted at Nirvana robots. It was searched and police suddenly discovered a damaged tracking device removed from the vehicle, said Mashaba.\n\nThe 31-year-old man driving the stolen vehicle could not produce authentic documentation proving ownership, and he was immediately placed under arrest.\n\nThe arrested driver was charged for possession of a suspected stolen motor vehicle.\n\nProvincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba said the grey SUV was reported stolen earlier this month, around Pretoria central. Image: SAPS\n\nMeanwhile, provincial commissioner of police in Limpopo, Lieutenant General Thembi Hadebe has saluted the law enforcement team which intercepted and recovered the vehicle.\n\nShe urged the team to continue in their concerted efforts to combat cross border crimes.\n\nEarlier on Tuesday,IOL reported that police in Limpopo announced a significant breakthrough with the recovery of two vehicles, a Toyota Corolla Cross and a Toyota Hilux GD-6valued at approximately R1.4 million, which were destined to be smuggled out of South Africa.\n\nMashaba said the two vehicles were meant to be driven across the Beitbridge port of entry, into the neighbouring Zimbabwe on Sunday.\n\nIn a co-ordinated anti-smuggling operation involving SAPS Anti-Smuggling Team, Tshimollo Security and Investigation, and Reflex Anti-Hijacking Security, the officers intercepted a Toyota Hilux GD-6 double cab on the R101 near Polokwane weighbridge. During the stop, one male suspect fled into nearby bushes, while two female suspects attempted to escape but were apprehended after a foot chase, said Mashaba.\n\nThe women aged 19 and 20 were arrested, and are facing charges of possession of a suspected stolen motor vehicle.\n\nA man escaped on foot, evading arrest while two women aged 19 and 20 were arrested for possession of a Toyota Hilux GD-6 double cab bakkie. Image: SAPS\n\nPreliminary investigations confirmed that the vehicle was stolen on 16 May 2025 in the Garsfontein policing area in Pretoria East, Gauteng.\n\nIn a separate but related intelligence-driven operation, Mashaba said officers intercepted a Toyota Corolla Cross at Mokopane CBD on the R101 road, which was also en route to the Beitbridge port of entry.\n\nInvestigations revealed that this vehicle had been reported stolen at the Wierdabrug (City of Tshwane) policing area on Friday. The driver, a 34-year-old undocumented foreign national, was arrested, said Mashaba.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21052738/Screenshot-2025-05-21-at-06.26.54.png",
            "description": "<p>IOL A 31-year-old man has appeared before the Polokwane Magistrate’s Court in Limpopo after he was arrested when police intercepted another stolen Toyota Corolla Cross sport utility vehicle which was apparently being driven towards the Beitbridge port of entry. Provincial police spokesperson in Limpopo, Brigadier Hlulani Mashaba, told IOL that Mikael Mlambo was remanded in custody,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/more-nights-in-jail-for-south-african-man-who-was-driving-stolen-toyota-corolla-to-zimbabwe/\">More nights in jail for South African man who was driving stolen Toyota Corolla to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "21 May 2025"
        },
        {
            "title": "Parliament: Private sector practising modern slavery, hiring interns for cheap labour",
            "url": "https://www.newzimbabwe.com/parliament-private-sector-practising-modern-slavery-hiring-interns-for-cheap-labour/",
            "content": "By Anna Chibamu\n\nTHE private sector has been accused of practising modern slavery, with companies employing mostly interns and underpaying them to save on costs.\n\nMarondera Central MP Caston Matewu raised this issue on a point of national interest in Parliament this Tuesday, describing the situation as new day modern slavery.\n\nMatewu told Speaker Jacob Mudenda that the private sector, particularly in the hospitality and tourism industry, was not rewarding interns.\n\nThe legislator alleged that most private companies have interns constituting 70% of their staff, and this is done to cut costs.\n\nMy point of national interest arises from the new day modern slavery, which is happening in the private sector.\n\nYou find that especially in the hospitality and tourism industry, most of the institutions are employing at least 70% interns who are not paid.\n\nSome who are given less than US$50 but have to work 12-hour shifts, and most of these institutions are doing this to save costs, Matewu said.\n\nNow that has two impacts, this means that those in such industries and qualified do not have jobs and that brings our unemployment rate high.\n\nIt is also slavery to those who are being made to work on the basis that they are being trained, yet they are actually covering for the profits of these institutions.\n\nMatewu called upon Parliament to come up with laws that help deal with the challenge.\n\nI think this August House must come up with policies and solutions to ensure that we curb this scourge that is going on in the private sector, Matewu told the Speaker.\n\nIn his response, Mudenda urged the MP to bring the matter as a motion to allow the responsible ministry to come up with answers and solutions.\n\nWhy do you not come up with a motion to address the issue in detail so that it covers the responsible ministry to respond accordingly? Mudenda said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21043603/Caston-Matewu.webp",
            "description": "<p>By Anna Chibamu THE private sector has been accused of practising “modern slavery”, with companies employing mostly interns and underpaying them to save on costs. Marondera Central MP Caston Matewu raised this issue on a point of national interest in Parliament this Tuesday, describing the situation as “new day modern slavery”. Matewu told Speaker Jacob</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/parliament-private-sector-practising-modern-slavery-hiring-interns-for-cheap-labour/\">Parliament: Private sector practising modern slavery, hiring interns for cheap labour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "21 May 2025"
        },
        {
            "title": "Makate High Flyers leaves for COSANA tournament",
            "url": "https://www.newzimbabwe.com/makate-high-flyers-leaves-for-cosana-tournament/",
            "content": "By Sports Reporter\n\nMurehwa-based Makate High Flyers on Monday left the country for Namibia, where they will represent Zimbabwe at the Confederation of Southern Africa Netball Association (COSANA) tournament, which kicks off, Thursday.\n\nMakate will be representing the country together with defending Premier Netball League champions ZDF Queens.\n\nThe inaugural regional netball club tournament will run for five days with clubs from Zimbabwe, Botswana, Lesotho, Eswatini and the host nation, Namibia.\n\nMakate were drawn in group A with Namibia Correctional Services and Wanderers Queens, Lesothos Royal Flames, Mauneng Queens and Jwaneng Queens from Botswana.\n\nZDF Queens will be battling in group B with Botswana Defence Force team, Lesotho Correctional Services, the Navy Army team and Mighty Gunners from Namibia.\n\nSpeaking ahead of their departure, Makate High Flyers captain Felistus Murigwa said the team is targeting to attain a good position.\n\nWe are looking forward to this tournament, we believe we are ready to showcase our talent.\n\nOur target is very simple, we want to bring back home a medal, so one way or the other we have to attain a podium finish, she said.\n\nMakate High Flyers is marking its debut in the Premier Netball League after gaining promotion from the Division One League last year.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/21051047/makate.jpeg",
            "description": "<p>By Sports Reporter Murehwa-based Makate High Flyers on Monday left the country for Namibia, where they will represent Zimbabwe at the Confederation of Southern Africa Netball Association (COSANA) tournament, which kicks off, Thursday. Makate will be representing the country together with defending Premier Netball League champions ZDF Queens. The inaugural regional netball club tournament will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/makate-high-flyers-leaves-for-cosana-tournament/\">Makate High Flyers leaves for COSANA tournament</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "21 May 2025"
        },
        {
            "title": "University of Zimbabwe to replace striking lecturers – offers adjunct lecturers US$3 per hour",
            "url": "https://www.newzimbabwe.com/university-of-zimbabwe-to-replace-striking-lecturers-offers-adjunct-lecturers-us3-per-hour/",
            "content": "By Staff Reporter\n\nTHE University of Zimbabwe (UZ) has announced a decision to replace striking lecturers, with the replacements set to earn a measly US$5.50per hour.\n\nOf the US$5.50, 40%, which translates to US$2.20, will be paid in the local ZWG currency.\n\nThe salary will also be subject to income tax.\n\nA letter shared with NewZimbabwe.com indicates that the process has already begun, with some part-time lecturers having already received letters of employment.\n\nUZ lecturers have been on strike for about a month, demanding better wages and working conditions, among other issues.\n\nYou will be paid based on the following structure: 60% of the total hours will be paid at a rate of US$3.30 per hour, and the remaining 40% at a rate of US$2.20 per hour, payable in ZIG equivalence, reads a letter sent to one of the part time lecturers.\n\nPlease note that this rate is inclusive of all teaching-related duties, including preparation, assignment setting and marking, as well as the setting and marking of examination scripts.\n\nNote that the remuneration for your services to the University will be subject to income tax.\n\nHaving once earned as much as US$3,000, lecturers now earn US$250.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/12142202/UZ-1.png",
            "description": "<p>By Staff Reporter THE University of Zimbabwe (UZ) has announced a decision to replace striking lecturers, with the replacements set to earn a measly US$5.50 per hour. Of the US$5.50, 40%, which translates to US$2.20, will be paid in the local ZWG currency. The salary will also be subject to income tax. A letter shared with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/university-of-zimbabwe-to-replace-striking-lecturers-offers-adjunct-lecturers-us3-per-hour/\">University of Zimbabwe to replace striking lecturers – offers adjunct lecturers US$3 per hour</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:31",
            "date": "21 May 2025"
        }
    ]
}