{
    "news": [
        {
            "title": "Four brothers and neighbour sentenced to life imprisonment for murder",
            "url": "https://www.newzimbabwe.com/four-brothers-and-neighbour-sentenced-to-life-imprisonment-for-murder/",
            "content": "By Staff Reporter\n\nFOUR members of the Ncube family from Silobela in Kwekwe, together with their neighbour, were last week convicted of murder and sentenced to life imprisonment.\n\nMkhululi (26), Qhubekani (23), Cabangani (30) and Thulani (27) all hailing from the Ncube clan and neighbour, Mexen Moyo (28) appeared at the Gweru High Court Circuit for killing a fellow villager in 2022.\n\nThe court heard how the five men brutally attacked Isabel Ndlovu at Linda Business Centre, Silobela, on November 30, 2022, stabbing and assaulting him with knives, logs and empty beer bottles.\n\nThe victim succumbed to injuries while being rushed to Kwekwe District Hospital.\n\nMeanwhile, Jeremiah Donhora and Kudakwashe Ncube, both from Shurugwi, appeared before the same court for the cold-blooded murder of Bernard Canaan Ngulube in 2017.\n\nThe duo was slapped with 20 years imprisonment.\n\nProsecutors proved how the pair, along with an accomplice who is still at large, accused the now deceased of theft.\n\nCourt heard how the assailants unleashed violence and started punching and kicking Ngulube, before scalding him with boiling water.\n\nVictim sustained serious injuries which led to his death five days later while hospitalised.\n\nThe presiding magistrate found the killers actions callous and premeditated, thereby deserving of languishing in jail for the next 20 years.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/12224313/Murder.jpg",
            "description": "<p>By Staff Reporter  FOUR members of the Ncube family from Silobela in Kwekwe, together with their neighbour, were last week convicted of murder and sentenced to life imprisonment. Mkhululi (26), Qhubekani (23), Cabangani (30) and Thulani (27) all hailing from the Ncube clan and neighbour, Mexen Moyo (28) appeared at the Gweru High Court Circuit</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/four-brothers-and-neighbour-sentenced-to-life-imprisonment-for-murder/\">Four brothers and neighbour sentenced to life imprisonment for murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "In Pictures: Various musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare",
            "url": "https://www.newzimbabwe.com/in-pictures-various-musicians-perform-at-a-show-to-launch-cigarette-brands-by-swan-valley-group-in-mbare/",
            "content": "A WIDE array of musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare, Harare on Saturday. Hereunder are scenes from the free event that attracted a huge crowd.\n\nPictures by Tapiwa Svondo.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27024548/IMG-20250126-WA0020.jpg",
            "description": "<p>A WIDE array of musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare, Harare on Saturday. Hereunder are scenes from the free event that attracted a huge crowd. Pictures by Tapiwa Svondo.      </p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-various-musicians-perform-at-a-show-to-launch-cigarette-brands-by-swan-valley-group-in-mbare/\">In Pictures: Various musicians performed at a show to launch cigarette brands by Swan Valley Group in Mbare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "‘l cannot be bought with a car’— Winky D spits lyrical venom targeting Wicknell Chivayo",
            "url": "https://www.newzimbabwe.com/l-cannot-be-bought-with-a-car-winky-d-spits-lyrical-venom-targeting-wicknell-chivayo/",
            "content": "By Tapiwa Svondo\n\nTHE undisputed king of Zimdancehall, Wallace Chirumiko popularly known as Winky D, has confirmed his resolve to stay away from gifts and other trinkets offered by politicians and their associates inorder to influence his art.\n\nDuring a Saturday gig in Mbare, Harare, sponsored by a cigarette maker Swan Valley Group, Winky D took aim at tenderprenuer Wicknell Chivayo, telling him he will never be bought with a car and will not betray the struggle of the young people, who face unemployment and other vices.\n\nVanoti nemuzita rababa, apa ndofuti vaba, vhura meso hona ka, handitengeke nemota car (They preach the word of God but they are the ones stealing, open your eyes I am not bought by a car), he sang to wild applause from the crowd.\n\nChivayo has in recent months been on a spree donating cars and money, which he has been gifting artists aligned to the ruling party, Zanu PF.\n\nSaturday saw Winky D returning to perform in Mbare after seven years, a development which was met with cheers and enthusiastic sing alongs.\n\nThe dreadlocked artist is popular among youths as his lyrics resonate with their struggles, hopes and aspirations.\n\nWinky D, who rarely makes noise on social media, uses the stage as a platform to address a number of societal issues, and Saturday nights repertoire was no exception.\n\nNdakachibata kuti dzvii but handisi keeper ini handitengese handisi Peter ini, ndorwiswa handinete ndichasvika ini, ndendiri zii handina noise handisi speaker ini (Im holding it firm but Im not a keeper, Im not a sellout like Peter, they fight me, but I wont give up. I will get there, Im not a speaker I dont make noise, I am cool)\n\nFurther, the gifted artist used a powerful wordplay to address a contentious issue, which saw him being elbowed out of Harare International Conference Centre (HICC) by Zanu PF acolyte, Kudakwashe Tagwirei ostensibly to pave way for a church event.\n\nNdabva paJabhuna (HICC) horaiti chiitai, musandipe tuma notes handina teacher ini, ndapfuura 40 handidi teacher ini, ndosasa nezvandada handina firita (I left HICC its fine do your own, dont give me notes I dont have a teacher, I passed 40 I dont want a teacher, I say what I like I dont filter), he went on.\n\nZanu PF activists and spendthrifts, Wicknell Chivayo and Passion Java were not spared the lyrical attacks.\n\nIn 2020, Passion Java attempted to lure Winky D with a US$35 000 contract which the latter refused to accept.\n\nWinky D also referenced ongoing tender scandals involving Zanu PF member Mike Chimombe and his associate Moses Mpofu, adding a layer of commentary on the current state of the music industry.\n\nHamusi Mapofu (Mpofu) mbudzi yadzoswa (Winky) buritsai Mic (Chimombe), sang Winky, loosely translated to mean You are not blind, the goat has been brought back release the mic.\n\nAdditionally, Winky D responded to Seh Calaz for accusing him of sidelining him at shows.\n\nThe free music concert showcased an impressive lineup of artists, including Master H, Aleck Macheso, Saintfloew, Da Ruler, Silent Killer, and Nisha T, but it was Winky D who juggled the Mbare audience.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27021831/InShot_20250126_200744969-scaled.jpg",
            "description": "<p>By Tapiwa Svondo THE undisputed king of Zimdancehall, Wallace Chirumiko popularly known as Winky D, has confirmed his resolve to stay away from gifts and other trinkets offered by politicians and their associates inorder to influence his art. During a Saturday gig in Mbare, Harare, sponsored by a cigarette maker Swan Valley Group, Winky D</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-cannot-be-bought-with-a-car-winky-d-spits-lyrical-venom-targeting-wicknell-chivayo/\">‘l cannot be bought with a car’— Winky D spits lyrical venom targeting Wicknell Chivayo</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "Marange UMC High School among Manicaland’s ZIMSEC Advanced Level results fast movers",
            "url": "https://www.newzimbabwe.com/marange-umc-high-school-among-manicalands-zimsec-advanced-level-results-fast-movers/",
            "content": "By Alois Vinga\n\nTHE United Methodist Church (UMC) run Marange High School (MHS) has proved its mettle after recording a significant improvement in the latest Zimbabwe School Examinations Council (ZIMSEC) 2024 Advanced Level exams, becoming one of the greatest movers in Manicaland province.\n\nOut of an enrolment of 85 students, who sat for their A Levels, Marange, the institutions overall pass rate rose significantly to 98.82% from the previous years pass rate that hovered around 91%, a development which is set to improve the schools nationwide ranking once the relevant authorities are done with comparisons.\n\nEducation experts in the province believe the institutions results are breathtaking considering that MHS does not ordinarily stick to a strict policy of recruiting already highly capable learners as is the case with other institutions.\n\nThe latest results analysis shows that the school produced 16 students with flying colours whose results ranged from 14 to 20 A Level points.\n\nThe most excelling wizkid produced 20 points in Mathematics, Physics, Computers and Chemistry, followed by four others who scored between 16 and 19 points.\n\nThe institution has also managed to deliver the gender dividend, after enrolling 56 female students against 29 males.\n\nOfficial records indicate that in the 20224 A Level results the majority of districts in the province attained higher than the national pass rate of 94.58% pass, with Buhera scoring 97.8%, Makoni 97.3%, Mutare 96.54%, Nyanga 97.16%, Chimanimani 98.23%, Mutasa District 98.7% while Chipinge district which was the least in the province had 93.5%.\n\nAbout half of Zimbabwes best top 10 performing schools have been drawn from Manicaland province over the years, testifying the areas spine in contributing towards the countrys education dividend.\n\nAccording to Zimsec, 31 443 of the 33 246 candidates got Grade E or better in two or more subjects, representing a pass rate of 94.58% compared to 94.60% in 2023 nationally.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27021515/maxresdefault-1.jpg",
            "description": "<p>By Alois Vinga THE United Methodist Church (UMC) run Marange High School (MHS) has proved its mettle after recording a significant improvement in the latest Zimbabwe School Examinations Council (ZIMSEC) 2024 Advanced Level exams, becoming one of the greatest movers in Manicaland province. Out of an enrolment of 85 students, who sat for their ‘A’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marange-umc-high-school-among-manicalands-zimsec-advanced-level-results-fast-movers/\">Marange UMC High School among Manicaland’s ZIMSEC Advanced Level results fast movers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Corporate Rescue in Zimbabwe",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-corporate-rescue-in-zimbabwe/",
            "content": "NewZimbabwe.com has invited Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal)to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss corporate rescue, what it is and when it is necessary.\n\nVM: Before defining what corporate rescue is and its purpose, it is necessary to contextualize it in light of the general business operating environment in Zimbabwe. We have witnessed a lot of major businesses applying to be placed in corporate rescue of late.\n\nThis is a result of the limited access to affordable finance for businesses which are expected to remain innovative against the novel, fluid informal sector which operates with little to no recurrent fixed costs like wages, statutory obligations and rentals.\n\nIt is common knowledge that at the heart of every business, guaranteeing its very survival, is the businesss ability to manage cashflow. A failure to manage cashflow can ultimately affect the very existence of the business due to financial distress.\n\nCorporate rescue, previously known as judicial management, is intended to literally rescue businesses that face collapse by placing a moratorium on legal actions against the company from creditors, restructuring the companys liabilities, debts, affairs and property with the purpose of returning it to being a viable concern.\n\nThe overarching purpose is to ensure that the business remains viable and open, employees remain at work and creditors are paid the whole or an agreed part of what they are owed.\n\nIt is probably the last line of defence for a business against collapse.\n\nReporter:When is a company considered financially distressedincorporate rescue proceedings?\n\nVM: A company is financially distressed when it cannot pay its debts when they become due in the normal course of business or when it is likely to be insolvent within 6 months. Key indicators may be negative cashflow, possibly from the company being owed significantly under long-term arrangements while itself being burdened by short term loans that have become due.\n\nWhat is critical in the analysis of financial distress from a corporate rescue perspective is that the company has a realistic prospect of recovery if it is placed in corporate rescue, it has a positive net worth, with assets that are more valuable than liabilities or that if managed properly, the assets are capable of paying off the liabilities and returning the business to a viable competitive state.\n\nReporter: What is the procedure to place a company incorporaterescue?\n\nVM: Our law allows for directors of a company to pass a resolution to put the company in corporate rescue if the directors are of the view that the company is financially distressed and there are reasonable prospects of rescuing the company.\n\nAlternatively, an affected person, such as a creditor or even an employee can apply to the court to have the company placed under corporate rescue if they can demonstrate that the company is distressed and there are reasonable prospects of the company being rescued from that distress.\n\nReporter: What is the effect of corporate rescue on stakeholders?\n\nVM: Once an order has been issued to place the company in corporate rescue, a corporate rescue practitioner takes over the management of the company. He or she will develop a rescue plan which includes the restructuring of the debts and operations of the company including its implementation plan if approved by stakeholders.\n\nThe most significant development is that a moratorium is imposed on all legal proceedings against the company allowing the company breathing spaceto operationalize its rescue plan.\n\nLong and short, the creditors ability or rights to sue or enforce their judgments or court orders against the company are suspended. Their only option is to participate in the development of the rescue plan and in some instances, they will have to compromise on the quantum of the debts meaning agreeing to a haircut of what they are owed. This in some situations is their only guarantee that the debts are repaid.\n\nOn the other hand, the employees contracts remain in force and employee claims of unpaid wages are a priority. The powers of directors are significantly curtailed as they have to report to the corporate rescue practitioner and assist him or her in bringing back the company to viability.\n\nThe rights of the shareholders are preserved, however, their interest in the company may be affected by the restructuring and its consequences to the remaining value of the company. The positive is that after a successful rescue, they will still have a company to talk of. The alternative is having no company without corporate rescue.\n\nReporter: Can an interested person object to a company being placed in corporate rescue and what will the grounds be?\n\nVM: Any affected party, creditors, employees, shareholders or any stakeholder can object to a company being placed in corporate rescue. The common objection is that the company is attempting to use corporate rescue in bad faith for purposes of circumventing its obligation to pay debts that have become due.\n\nHowever, stakeholders may have different reasons for objecting to a rescue plan, for instance, if employees feel that their rights or claims are not adequately addressed, creditors feel that the rescue plan will not likely succeed but result in them having to wait too long for only a fraction of their debtet cetera.\n\nOther reasons may be the questionable capacity of the rescue practitioner to revive the company, an unviable rescue plan or that the company has no prospect of rescue.\n\nReporter: Thank you, Mr. Madzima we will continue on insolvency next week but we have run out of time.\n\nVM: Thank you.\n\nRELATED:\n\nYou can contact Vengai Madzima onvengai@mcmlegal.co.zwor at www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/07/28062922/WhatsApp-Image-2024-07-26-at-15.42.14-e1722144586557.jpeg",
            "description": "<p>NewZimbabwe.com has invited Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal) to discuss with us legal issues that affect Zimbabweans. The discussions are of a general nature and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, this week we want to discuss corporate rescue,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-corporate-rescue-in-zimbabwe/\">Legal Discussions with Vengai Madzima: Corporate Rescue in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "Labour rejects government’s policy for civil servants to work ‘forever’",
            "url": "https://www.newzimbabwe.com/labour-rejects-governments-policy-for-civil-servants-to-work-forever/",
            "content": "By Alois Vinga\n\nTHE Zimbabwe Congress of Trade Unions (ZCTU) has rejected governments policy offering civil servants an opportunity to work way beyond their retirement age arguing the initiative breaches basic rights.\n\nThrough Statutory Instrument 201 of 2024 under the Presidential Powers (Temporary Measures) (General Laws Amendment) Regulations, 2024, President Emmerson Mnangagwa raised the retirement age from 65 to 70.\n\nHowever, at the age of 60, they still have the choice to retire early, provided they submit a three-month notice.\n\nbefore the effective date, may have a pensionable age of sixty-five years with option to retire at seventy-years on full pension: Provided that any retirement after the year of sixty-fifth anniversary and before the seventieth anniversary shall be deemed to be early retirement; or on or after the effective date, shall have a pensionable age of seventy years.\n\nA member may, on giving three months notice of retirement be permitted by the commission to retire before pensionable age at any time after attaining the age of sixty, part of the SI reads.\n\nWhile some sections of the society have perceived the move as noble for those civil servants who are still active, the countrys most influential labour organ, ZCTU expressed reservations over the extension of the retirement age for civil servants and uniformed forces.\n\nThe labour organ contends that the move is not adequate to address issues affecting its employees and pensioners.\n\nCivil servants and pensioners are plagued with serious welfare challenges arising from poor remuneration and working conditions that are pauperising them to the extent that they involuntarily find it reasonable to work forever instead of resting and enjoying their old age.\n\nThe government needs to address fundamental welfare challenges affecting its employees so that it becomes attractive to retire, the ZCTU acting secretary general, Runesu Dzimiri said in a statement.\n\nThe ZCTU said it finds it outrageous for the government to, without adequate consultation, resort to self-help antics to avoid meeting and improving its obligations to employees and pensioners.\n\nWhile noting that it is optional for one to extend to the new age limits, the ZCTU reiterated that the option must not be driven by desperation and fear of poverty after retirement owing to poor pensions and implored the government to pay above Poverty Datum Line (PDL)salaries so that a worker can be at liberty to continue working or proceed on retirement without reservations.\n\nSaid Dzimiri; Government policy needs to unlock employment opportunities for thousands of youths graduating from universities, polytechnics and vocational training institutions instead of shutting them out of employment. The move entails a five year freeze or insignificant payment of pension gratuities with the government saving millions of dollars.\n\nHe said the move may also disadvantage some workers who may die before reaching the age of 70 as their benefits would be significantly reduced.\n\nThe ZCTU called upon the government to revisit the reform, respect senior citizens and focus on tenets that bring direct and improved benefits to its employees and pensioners instead of crafting slave policies to wriggle out of its responsibilities.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/09/09165340/ZCTU.jpg",
            "description": "<p>By Alois Vinga THE Zimbabwe Congress of Trade Unions (ZCTU) has rejected government’s policy offering civil servants an opportunity to work way beyond their retirement age arguing the initiative breaches basic rights. Through Statutory Instrument 201 of 2024 under the Presidential Powers (Temporary Measures) (General Laws Amendment) Regulations, 2024, President Emmerson Mnangagwa raised the retirement</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/labour-rejects-governments-policy-for-civil-servants-to-work-forever/\">Labour rejects government’s policy for civil servants to work ‘forever’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "24 people killed in Zimbabwe’s rainfall-related incidents",
            "url": "https://www.newzimbabwe.com/24-people-killed-in-zimbabwes-rainfall-related-incidents/",
            "content": "By Xinhua\n\nA TOTAL of 24 people died, and six others have been injured in rainfall-related incidents in Zimbabwe since the start of the rainy season last October, the countrys Department of Civil Protection (DCP) said Friday.\n\nAfter experiencing below-average rainfall during the first half of the season, from October to December 2024, Zimbabwe has recorded significant rainfall across the country since January, leading to several rain-induced incidents, including drownings.\n\nAccording to a situation report issued by the DCP, the heavy rains have affected hundreds of households and caused damage to critical public infrastructure, including schools, health facilities, roads, bridges, dams, electricity poles and irrigation schemes.\n\nSince October, 983 households, 129 schools and 13 health facilities have been damaged, the DCP reported.\n\nMoreover, 42 public infrastructure facilities, including a police post, a government building responsible for issuing national identity documents and industrial buildings, have sustained damage due to the heavy rains, the DCP noted.\n\nZimbabwes rainy season typically spans the summer months, occurring from around October to March.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/16044936/Drown.jpg",
            "description": "<p>By Xinhua A TOTAL of 24 people died, and six others have been injured in rainfall-related incidents in Zimbabwe since the start of the rainy season last October, the country’s Department of Civil Protection (DCP) said Friday. After experiencing below-average rainfall during the first half of the season, from October to December 2024, Zimbabwe has</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/24-people-killed-in-zimbabwes-rainfall-related-incidents/\">24 people killed in Zimbabwe’s rainfall-related incidents</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "UN fears ‘regional war’ as DRC-Rwanda conflict escalates, claims a dozen SADC peacekeepers",
            "url": "https://www.newzimbabwe.com/un-fears-regional-war-as-drc-rwanda-conflict-escalates-claims-a-dozen-sadc-peacekeepers/",
            "content": "By newZWire\n\nTHE United Nations Security Council convened an emergency meeting on Sunday over deadly clashes in eastern Democratic Republic of Congo after Kinshasa withdrew its diplomats from Kigali as Rwanda-backed rebels advanced on the key city of Goma.\n\nOn Saturday, three countries  South Africa, Malawi and Uruguay  announced the deaths of some of their soldiers serving as peacekeepers in the conflict zone, 13 in all.\n\nSouth Africas defence ministry said Saturday that it lost nine members by Friday.\n\nA Malawian army spokesman said three of its soldiers with the SADC force also died during clashes.\n\nUruguays military announced that one of its members serving with the UN peacekeepers had been killed and four others wounded.\n\nSADC has condemned the attacks by the Rwanda-backed M23 rebels, and vowed to continue its mission in the DRC.\n\nSADC reaffirms its unwavering commitment to continue supporting the DRC in its pursuit of safeguarding its independence, sovereignty, and territorial integrity, as well as sustainable peace, security, and development.\n\nTo this end, the SAMIDRC will remain resolute in supporting efforts aimed at addressing the unstable and deteriorating security and humanitarian situation prevailing in the Eastern DRC, SADC said in a statement on Saturday.\n\nThe United Nations Mission in the Democratic Republic of Congo (MONUSCO) said its Quick Reaction Forces had been actively engaged in intense combat with its heavy artillery firing against M23 positions.\n\nThe resource-rich eastern provinces of North and South Kivu have been plagued by conflicts for three decades, with the Rwanda-backed M23 emerging as one of the most powerful armed groups in recent years.\n\nAfter peace talks between Rwandan President Paul Kagame and DRCs Etienne Tshisekedi were cancelled in mid-December, the rebels have steadily advanced toward Goma, the capital of North Kivu and a key city home to more than a million people.\n\nThe escalation in fighting prompted an emergency UN Security Council meeting, originally set for Monday, to be moved up to Sunday. Congolese army spokesman General Sylvain Ekenge told journalists his countrys armed forces were working to push back the enemy.\n\nRwanda is determined to seize the city of Goma, he said. The DRC announced it was pulling its diplomats from Kigali in a letter to Rwandas embassy in Kinshasa.\n\nUN Secretary-General Antonio Guterres expressed fears on Thursday that the fighting could aggravate the risk of a regional war.\n\nSince the beginning of January, about 400,000 people have been forced to flee the fighting. The UN has begun evacuating non-essential staff from Goma to neighbouring Uganda and to the Congolese capital Kinshasa.\n\nThe African Union urged all parties to preserve the lives of civilians. Angolan President Joao Lourenco, the African Unions mediator between Rwanda and the DRC, denounced irresponsible actions by the M23 and its supporters which would have harmful consequences for regional security.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/27020216/SA-696x355-1.png",
            "description": "<p>By newZWire  THE United Nations Security Council convened an emergency meeting on Sunday over deadly clashes in eastern Democratic Republic of Congo after Kinshasa withdrew its diplomats from Kigali as Rwanda-backed rebels advanced on the key city of Goma. On Saturday, three countries – South Africa, Malawi and Uruguay – announced the deaths of some</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/un-fears-regional-war-as-drc-rwanda-conflict-escalates-claims-a-dozen-sadc-peacekeepers/\">UN fears ‘regional war’ as DRC-Rwanda conflict escalates, claims a dozen SADC peacekeepers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "CCC youths unleash violence at late MP’s funeral, damage MDC-T president Mwonzora’s car",
            "url": "https://www.newzimbabwe.com/ccc-youths-unleash-violence-at-late-mps-funeral-damage-mdc-t-president-mwonzoras-car/",
            "content": "By Staff Reporter\n\nCITIZENS Coalitions for Change (CCC) Welshman Ncube faction has condemned the violence that ensued at a legislators funeral in Glen View South over the weekend.\n\nThe attacks occured during the funeral of CCC Glen View South Member of Parliament Grandmore Hakata (56), who died last week due to diabetes complications.\n\nMDC-T leader, Douglas Mwonzoras vehicle was allegedly damaged whilst a member of his political party, Preston Mwabaya, was seriously injured in the skirmishes and is reportedly admitted in the lntensive Care Unit (ICU) at a local hospital.\n\nScreengrab from a video circulating showing CCC youths heckling Mwonzora as he leaves the funeral venue\n\nIn a statement this Sunday, CCC Ncube faction spokesperson Willias Madzimure condemned the violence, accusing former CCC leader Nelson Chamisa of causing the mayhem.\n\nThe Citizens Coalition for Change (CCC) condemns in the strongest terms the violence that erupted at the funeral of our beloved member, Hon. Hakata, who was a loyal member of the CCC led by Prof. Welshman Ncube. Hon Hakata had stood firm in his principles and refused to resign from Parliament when ordered to do so by Hon Nelson Chamisa.\n\nWe are deeply disturbed by the actions of certain individuals who sought to disrupt the peaceful proceedings and cause harm to innocent mourners.\n\nAmong those who were attacked and harassed by the perpetrators were Hon. Matsunga, Hon. P. Chitimbe, Hon. Musarurwa, and Hon. Madzimure, all of whom were present to pay their respects to the deceased.\n\nWe are disappointed that Hon. Nelson Chamisa, when he addressed his supporters and the mourners, failed to condemn the violence. As a leader, it is imperative to promote peace and stability, and we expect more from those who aspire to lead our nation, Madzimure said.\n\nHe said his party was outraged by the attack on Senator Mwonzora, the president of MDC-T party, and the damage to his vehicle and called on law enforcement agents to deal with perpetrators.\n\nThis blatant display of thuggery and intimidation is a clear indication of the lack of leadership and accountability within Hon Nelson Chamisas camp.\n\nAs a party, we value the principles of peace, tolerance, and respect for human life. We urge all our supporters and members to remain calm and peaceful, even in the face of provocation.\n\nWe call upon the authorities to investigate the violence and bring the perpetrators to justice. We also urge all Zimbabweans to promote a culture of peace, tolerance, and respect for human life, added Madzimure.\n\nAccording to witnesses and opposition members who attended the funeral, some of the youths involved in the attacks were visibly drunk.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/09/05055436/douglas-mwonzora.jpg",
            "description": "<p>By Staff Reporter CITIZENS Coalitions for Change (CCC) Welshman Ncube faction has condemned the violence that ensued at a legislator’s funeral in Glen View South over the weekend. The attacks occured during the funeral of CCC Glen View South Member of Parliament Grandmore Hakata (56), who died last week due to diabetes complications. MDC-T leader,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ccc-youths-unleash-violence-at-late-mps-funeral-damage-mdc-t-president-mwonzoras-car/\">CCC youths unleash violence at late MP’s funeral, damage MDC-T president Mwonzora’s car</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        },
        {
            "title": "New brooms: Newly elected ZIFA board full list",
            "url": "https://www.newzimbabwe.com/new-brooms-newly-elected-zifa-board-full-list/",
            "content": "By Staff Reporter\n\nSATURDAY January 25, 2025, marked a fresh chapter in Zimbabwean football following the election of a new Zimbabwe Football Association (ZIFA) executive board, led by president Nqobile Magwizi.\n\nThe previous controversy-ridden board led by Felton Kamambo was dissolved in November 2021 by FIFA and Zimbabwe banned from participating in international matches.\n\nFurther, the nation was placed under the administration of a caretaker Normalisation Committee led by Lincoln Mutasa since June 2023.\n\nThe much-hyped ZIFA board elections, which dominated media space in the past weeks, were finally held at a Harare hotel, where Magwizi emerged the biggest winner, amassing an unassailable 80 percent of the votes to land the presidency. A total 77 councillors voted.\n\nPresidential aspirants Phillemon Machana, Twine Phiri, Marshal Gore and Makwinji Phiri fell by the wayside in embarrassing fashion, all gathering less than 10 votes each.\n\nOne of the front-runners before the election, Martin Kweza withdrew his candidature just before the election citing personal reasons although it later turned out he had been selected for another plum post as board member at the Zimbabwe Broadcasting Corporation (ZBC).\n\nHereunder is the full list of the new ZIFA board;\n\nPresident  Nqobile Magwizi\n\nVice President Loveness Mukura\n\nVice President  Kenny Ndebele\n\nBoard members;\n\nAlice Zeure\n\nTafadzwa Benza\n\nDavison Muchena\n\nThomas Marambanyika\n\nBrighton Ushendibaba\n\nKudzai Kadzombe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/26075612/magwizi-secures-landslide-victory-in-zifa-presidential-election.webp",
            "description": "<p>By Staff Reporter  SATURDAY January 25, 2025, marked a fresh chapter in Zimbabwean football following the election of a new Zimbabwe Football Association (ZIFA) executive board, led by president Nqobile Magwizi. The previous controversy-ridden board led by Felton Kamambo was dissolved in November 2021 by FIFA and Zimbabwe banned from participating in international matches. Further,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-brooms-newly-elected-zifa-board-full-list/\">New brooms: Newly elected ZIFA board full list</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:09",
            "date": "27 Jan 2025"
        }
    ]
}