{
    "news": [
        {
            "title": "Police raise concern over spike in drowning cases as two girls perish while fishing in dam",
            "url": "https://www.newzimbabwe.com/police-raise-concern-over-spike-in-drowning-cases-as-two-girls-perish-while-fishing-in-dam/",
            "content": "By Staff Reporter\n\nTHE onset of the rains has resulted in a rise in drowning cases, worrying police.\n\nThis follows the drowning of two girlsaged 11 and 10 in a dam while fishing in Tengwe, Hurungwe district in Mashonaland West province.\n\nThe now-deceased persons were identified as Kudzai Chitehwe (11) and Yolanda Madiro (10).\n\nZimbabwe Republic Police (ZRP) Mashonaland West acting provincial spokesperson, Assistant Inspector Effort Chapoto confirmed the incident.\n\nI can confirm a sad incident in which two juveniles drowned in Tengwe on February 2, 2025 at around 1400 hours at Ndiripo dam situated at Ndiripo farm, Tengwe, said Chapoto.\n\nKudzai Chitehwe, a female juvenile aged 11 of Plot 34, Yolanda Madiro a female juvenile aged 10 of plot 3 and Talent Madiro a female juvenile aged 10 of Plot 3 all from Ndiripo farm, Tengwe were fishing at Ndiripo farm Dam.\n\nYolanda Madiros fishing rod broke and she got into the dam trying to retrieve it and drowned. Kudzai Chitehwe then got into the dam trying to help and she also drowned.\n\nTalent Madiro rushed home and informed Kudzai Chitehwes uncle Christopher Chitehwe (58) of Plot 34 Ndiripo farm, Tengwe.\n\nThe uncle and other locals proceeded to the dam and retrieved the bodies. The matter was reported at ZRP Tengwe, who attended the scene and conveyed the bodies to Karoi District Hospital mortuary for postmortem. No foul play is suspected, said Chapoto.\n\nThe incident in Tengwe follows yet another drowning of a 12-year-old Chinhoyi boy in the Hunyani River last Saturday while swimming with his friend.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/16044936/Drown.jpg",
            "description": "<p>By Staff Reporter THE onset of the rains has resulted in a rise in drowning cases, worrying police. This follows the drowning of two girls aged 11 and 10 in a dam while fishing in Tengwe, Hurungwe district in Mashonaland West province. The now-deceased persons were identified as Kudzai Chitehwe (11) and Yolanda Madiro (10). Zimbabwe</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-raise-concern-over-spike-in-drowning-cases-as-two-girls-perish-while-fishing-in-dam/\">Police raise concern over spike in drowning cases as two girls perish while fishing in dam  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Marshall Munetsi joins Wolverhampton",
            "url": "https://www.newzimbabwe.com/marshall-munetsi-joins-wolverhampton/",
            "content": "Soccer24\n\nZimbabwean international Marshall Munetsi has joined English Premier League side Wolverhampton on a three-and-half year deal from Stade Reims.\n\nWolves are understood to have paid 16m for the transfer of Munetsi. The fee makes him the most expensive Zimbabwean player.\n\nMunetsis Rise from Ligue 1 to the Premier League\n\nMunetsi had a good half season for Reims after scoring 4 goals and recording two assists in 19 games.\n\nThe 28-year-old, who joined Reims in 2019 from Orlando Pirates, made over 150 appearances across all competitions.\n\nHe became a key player in his debut campaign and went on to earn a reputation for his versatility, work rate, and defensive solidity.\n\nHis performances in France made him a highly sought-after player, with several clubs monitoring his progress before Wolves secured his signature.\n\nThe Zimbabwean international also showed his leadership qualities after becoming Reims vice-captain at the start of the 2024/25 season. Munetsi was the second transfer deadline signing for Wolves after the club signed Burkina Faso international Nasser Djiga.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/22214807/Reims-midfielder-Marshall-Munetsi_.png",
            "description": "<p>Soccer24 Zimbabwean international Marshall Munetsi has joined English Premier League side Wolverhampton on a three-and-half year deal from Stade Reims. Wolves are understood to have paid £16m for the transfer of Munetsi. The fee makes him the most expensive Zimbabwean player. Munetsi’s Rise from Ligue 1 to the Premier League  Munetsi had a good half</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marshall-munetsi-joins-wolverhampton/\">Marshall Munetsi joins Wolverhampton</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Mighty Warriors get down to business ahead of 2025 WAFCON Qualifiers",
            "url": "https://www.newzimbabwe.com/mighty-warriors-get-down-to-business-ahead-of-2025-wafcon-qualifiers/",
            "content": "By Sport Reporter\n\nZimbabwe senior womens national team kicked off its training Monday ahead of their Womens Africa Cup of Nations (WAFCON) qualifiers against Angola later this month.\n\nThe Mighty Warriors trooped into camp on Sunday and went through light paces on Monday morning before engaging in medical tests.\n\nMood is good, we just did medicals today and just pre-camp meetings and the attitude looks positive, said team head coach Sithethelelwe Kwinji 15  Sibanda.\n\nSibanda called into camp a provisional squad of 29 players which will be trimmed before they depart for the upcoming fixture.\n\nZimbabwe will play Angola on the 20th of February in Luanda before hosting them a week later at Lucas Moripe Stadium in South Africa.\n\nThe winner between Zimbabwe and Angola will face the winner between Malawi and Congo in a final qualifying match for the WAFCON scheduled for 2026 in Morroco.\n\nWith Zimbabwe Womens Super League currently on a break, coach Sibanda assured that she will do everything possible to condition the players ahead of the tie.\n\nPlayers are coming from an offseason, we will make up through integrated sessions and make sure we develop all the football components in these sessions so that we are ready.\n\nThe attitude is positive, team is beefed up so the additions made will be very influential, she added.\n\nThe Mighty Warriors were last in action last year at the Womens COSAFA Cup tournament where they crushed out in the group stages.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/09/24011009/Sithethelelwe-%E2%80%98%E2%80%98Kwinji-15-Sibanda.jpg",
            "description": "<p>By Sport Reporter Zimbabwe senior women’s national team kicked off its training Monday ahead of their Women’s Africa Cup of Nations (WAFCON) qualifiers against Angola later this month. The Mighty Warriors trooped into camp on Sunday and went through light paces on Monday morning before engaging in medical tests. “Mood is good, we just did</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-get-down-to-business-ahead-of-2025-wafcon-qualifiers/\">Mighty Warriors get down to business ahead of 2025 WAFCON Qualifiers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Wolves loan Warriors Forward Tawanda Chirewa to Huddersfield",
            "url": "https://www.newzimbabwe.com/wolves-loan-warriors-forward-tawanda-chirewa-to-huddersfield/",
            "content": "By Sport Reporter\n\nWarriors forward Tawanda Chirewa will spend the rest of the season at English League One side Huddersfield Town where he has been loaned by parent club Wolves.\n\nChirewas loan move comes after the player returned to Wolves last month from Championship side Derby County who cut short his season loan deal.\n\nAt Derby County Chirewa made six appearances, five of them in the league.\n\nHere's everything Tawanda, Michael and Mark have had to say #htafc\n\n Huddersfield Town (@htafc)February 3, 2025\n\nThe 21-year-old Zimbabwe international is one of the promising youngsters at Wolves where he made his English Premier Soccer League debut in January 2024 against Brighton & Hove.\n\nCommenting on X upon the completion of Chirewas deal, Huddersfield wrote, We are delighted to announce the signing of Tawanda Chirewa on loan from Wolverhampton Wanderers on loan for the remainder of the 2024/25 season.\n\nTawanda Chirewa speaks to HTTV for the first time #htafc\n\n Huddersfield Town (@htafc)February 3, 2025\n\nHuddersfield are currently sitting in position 5 in the Skybet English League One with 48 points, 15 points away from log leaders Birmingham City who have 63.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/04055610/chirewa.jpeg",
            "description": "<p>By Sport Reporter Warriors forward Tawanda Chirewa will spend the rest of the season at English League One side Huddersfield Town where he has been loaned by parent club Wolves. Chirewa’s loan move comes after the player returned to Wolves last month from Championship side Derby County who cut short his season loan deal. At</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/wolves-loan-warriors-forward-tawanda-chirewa-to-huddersfield/\">Wolves loan Warriors Forward Tawanda Chirewa to Huddersfield</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Harare Town Clerk Chisango’s acquittal in US$9 million fraud case raises stink",
            "url": "https://www.newzimbabwe.com/harare-town-clerk-chisangos-acquittal-in-us9-million-fraud-case-raises-stink/",
            "content": "By Staff Reporter\n\nHARARE town clerk Hosiah Chisangos recent acquittal has raised a lot of stink, with officials at Town House and antigraft body ZACC questioning the move.\n\nThe National Prosecuting Authority (NPA) last week dropped all charges against Chisango, Never Murerwa, supply chain manager Denford Zhungu, principal accountant in a US$9 million fraud case that had dragged on for about a year.\n\nIt also withdrew charges against Tawanda Mutenhabundo, engineering technician and principal contracts administrator Artkins Mandaza.\n\nJabulani Mukomazi, the principal buyer, was indicted.\n\nCharges against Chisango and his crew came up after incarcerated businessmen Mike Chimombe and Moses Mpofus Julika End Joint Venture (Pvt) Ltd was illegally awarded a US$9 million tender after having initially been disqualified.\n\nThe duo, which is locked up at Harare Central Prison on remand had misrepresented facts in its bid.\n\nRELATED:\n\nTypically the Town Clerk or CEO of a local authority, holds the sole responsibility for procurement within any public entity, said a source from ZACC.\n\nThis means that the Town Clerk, in this case, Hosiah Chisango, should have been held accountable for any procurement irregularities, however, it appears that the principal buyer has been left to face the criminal charges, while Chisango walks free.\n\nAdding to the controversy is the role of Public Prosecutor Whisper Mabhaudhi, who has been handling multiple high-profile cases, including those against Kandemiri, Ndemera, Chisango, and Gomba.\n\nDespite overwhelming evidence against Chisango as the Town Clerk and key decision-maker, he was allowed to go free, thanks to the same judge who granted them bail in the Juluka case, Judge Kwenda.\n\nThis raises serious concerns about the impartiality and integrity of the judiciary. A fresh Public Prosecutor and judge would likely provide a different perspective and ensure justice is served.\n\nThe dismissal of the case against Hosiah Chisango is a glaring example of the compromised judiciary, the infamous but true catch and release by law enforcement and the lack of accountability within the City of Harares procurement processes.\n\nChisango is one of many council officials arrested by ZACC and released by the courts in a never-ending series of catch and release.\n\nA lowly conviction rate of cases investigated by ZACC has seen it being tagged a toothless bulldog while its officials maintain the NPA lets them down.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/06/03181857/Hosiah-Chisango-Harare-City-Town-Clerk.jpg",
            "description": "<p>By Staff Reporter HARARE town clerk Hosiah Chisango’s recent acquittal has raised a lot of stink, with officials at Town House and antigraft body ZACC questioning the move. The National Prosecuting Authority (NPA) last week dropped all charges against Chisango, Never Murerwa, supply chain manager Denford Zhungu, principal accountant in a US$9 million fraud case</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-town-clerk-chisangos-acquittal-in-us9-million-fraud-case-raises-stink/\">Harare Town Clerk Chisango’s acquittal in US$9 million fraud case raises stink</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Ziyambi leads push to oust Geza from Zanu PF, accuses the war vet demanding Mnangagwa’s resignation of murder",
            "url": "https://www.newzimbabwe.com/ziyambi-leads-push-to-oust-geza-from-zanu-pf-accuses-the-war-vet-demanding-mnangagwas-resignation-of-murder/",
            "content": "By Staff Reporter\n\nZANU PF politburo member Ziyambi Ziyambi is leading a push to fire outspoken Central Committee member Blessed Geza, who has for just over a week been demanding that President Emmerson Mnangagwa resigns immediately.\n\nGezas scathing reviews of Mnangagwas leadership, at various press conferences and interviews, have worsened factional fights within the ruling party.\n\nIn what resembles a repeat of 2017 events, Geza has been laying bare claims of nepotism, state capture and corruption at the hands of Mnangagwa and his cronies.\n\nZiyambi was speaking at NorthCourt Stadium in Zvimba East Constituency to hundreds of Zanu PF followers loyal to Mnangagwa and in support of attempts to have him stay on as President beyond the two term limits set by Zimbabwes constitution.\n\nIt is one thing to just say what you think, but coming out as a Central Committee member and declaring that Mnangagwa must go shows that one does not understand the Zanu PF constitution, said Ziyambi.\n\nZanu PF goes to a congress after five years and if he entertained any hopes of challenging Mnangagwa he was supposed to wait for 2027.\n\nHe is behaving like someone who is making his decision either after eating too much sadza or too much opaque beer.\n\nHe is demonic, he has the biblical Legions demons that is why he refers himself as we, the demons are too many.\n\nIn the past, he murdered someone at his homestead and the case was not thoroughly investigated, if you murder someone the case does not just appear, we are going to tell Mutamba (ZRP Commissioner General) to investigate.\n\nRELATED:Mnangagwa is a failure and must go now, his 2030 agenda is illegal and treacherous say war veterans miffed by rampant corruption\n\nSupporters sang songs in Mnangagwas praise, chanting 2030 slogans as his loyalists battle to formally have the 2024 resolution tabled in Parliament.\n\nBlessed Geza\n\nGeza and a group of war veterans who fought in the countrys liberation war believe that will be retracing footsteps back to the Robert Mugabe era of what seemed like life presidency.\n\nThis man and those around him have failed us, they have failed all Zimbabweans who believed that the events of 2017 would bring an end to nepotism and privatisation of the nation and its people, said Geza.\n\nIt is clear to us that Mnangagwa is not fit to run this country and his time to go is now. We ask him to go peacefully. If he refuses to take heed of this advice, we have no option but to ask the people of Zimbabwe to deal with a rogue President in line with the constitution.\n\nGeza, a former Member of Parliament (MP) and soldier is believed to be part of a camp in favour of Constantino Chiwenga taking over despite having been a strong proponent of Mnangagwas presidency in 2017 when he took over from Mugabe.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/10/18024540/Ziyambi-Ziyambi.png",
            "description": "<p>By Staff Reporter ZANU PF politburo member Ziyambi Ziyambi is leading a push to fire outspoken Central Committee member Blessed Geza, who has for just over a week been demanding that President Emmerson Mnangagwa resigns immediately. Geza’s scathing reviews of Mnangagwa’s leadership, at various press conferences and interviews, have worsened factional fights within the ruling</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ziyambi-leads-push-to-oust-geza-from-zanu-pf-accuses-the-war-vet-demanding-mnangagwas-resignation-of-murder/\">Ziyambi leads push to oust Geza from Zanu PF, accuses the war vet demanding Mnangagwa’s resignation of murder</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "22 youths arrested for attending vuzu party in Chegutu",
            "url": "https://www.newzimbabwe.com/22-youths-arrested-for-attending-vuzu-party-in-chegutu/",
            "content": "By Staff Reporter\n\nPOLICE in Chegutu have confirmed the arrest of 22 youths at a wild party held at the weekend.\n\nZimbabwe Republic Police (ZRP) Mashonaland West acting provincial spokesperson, Assistant Inspector Effort Chapoto said the arrested youths were aged between 15 and 25 yearsold.\n\nZRP Chegutu arrested 22 youths aged between 15 to 25 years for convening a party where drugs and substances were abused.\n\nCircumstances are that Tinashe Kamunda (23) of House Number 30160 Rifle Range, Chegutu created some WhatsApp group links where he advertised a birthday concert, said Chapoto.\n\nAttendance was on payment of US$2 for boys and US$1 for girls plus an extra US$5 for liquor each. The party was held under closed durawall with music and dances.\n\nPolice received a tip-off that there was suspected drug abuse by youths at a party in Rifle Range. Reacting to the information, ZRP Chegutu raided the house and arrested 15 boys and 7 girls, he added.\n\nSearches were conducted around the house and resulted in the recovery of stubs of smoked dagga, unused condoms, some liquor and Shisha smoking equipment.\n\nParents and guardians of the accused were located while Kamunda was charged with disorderly conduct and paid an admission of guilt fine.\n\nAll the other youths also deposited a fine with a lesser charge and were released in the custody of their parents.\n\nPolice urged parents and guardians to check and confirm the whereabouts of their children regularly.\n\nWe thank those who supplied positive information as we remind everyone that community policing is the way to go. The collaboration between the community and the police always yields positive results, said Chapoto.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/04045530/party.jpg",
            "description": "<p>By Staff Reporter POLICE in Chegutu have confirmed the arrest of 22 youths at a wild party held at the weekend. Zimbabwe Republic Police (ZRP) Mashonaland West acting provincial spokesperson, Assistant Inspector Effort Chapoto said the arrested youths were aged between 15 and 25 years old. “ZRP Chegutu arrested 22 youths aged between 15 to 25</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/22-youths-arrested-for-attending-vuzu-party-in-chegutu/\">22 youths arrested for attending vuzu party in Chegutu</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Harare City Council workers stage go-slow after two months without salaries",
            "url": "https://www.newzimbabwe.com/harare-city-council-workers-stage-go-slow-after-two-months-without-salaries/",
            "content": "By Darlington Gatsi\n\nHARARE City Council (HCC) workers have downed tools in protest against poor welfare conditions and non-payment of salaries, adding to the municipalitys growing challenges.\n\nThe workers have not been paid for two months, and the council has failed to honour its promise to pay them on time.\n\nTheir situation has been worsened by the ongoing economic difficulties, which have significantly eroded the value of their yet-to-be-paid salaries due to inflation.\n\nIn a letter addressed to HCCs senior officials, the Zimbabwe Municipalities Nurses and Allied Workers Union (ZIMNAWU) president Simbarashe Tafirenyika expressed concerns over the councils delays in paying its workers, which has led to severe financial strain.\n\nThis unacceptable situation has drastically impacted workers livelihoods, working conditions, and overall well-being. The delay in salary payments has caused financial hardship and discontent, as salaries are being eroded by inflation.\n\nThis has left our members incapacitated, which in turn affects service delivery. We urge the City of Harare to address these delays and ensure that workers are paid on time. Please note that employees have not been paid for December 2024 or January 2025, and February is already approaching.\n\nAccording to Statutory Instrument 13 of 2015, workers should be paid by the 28th of each month. We urge your office not to stagger salary payments and to pay all workers at once, as the current situation is causing disharmony in the workforce due to the instability of our local currency, read the letter.\n\nRELATED:\n\nThe workers grievances come amid an ongoing investigation by a Commission of Inquiry set up by President Emmerson Mnangagwa to examine operations at the Town House.\n\nThe Commission has uncovered widespread corruption within the City Council, with senior officials allegedly using it as a source of personal enrichment, which has negatively impacted service delivery in the capital.\n\nZIMNAWU further announced that its members would limit their working hours to two or three days per week to pressure the employer into addressing their concerns.\n\nIn light of the current situation, we have no choice but to declare that our members will only work two to three days per week until the employer resumes timely salary payments.\n\nThis decision is meant to safeguard the health, safety, and welfare of our employees, who can no longer afford to work under conditions that compromise their dignity and well-being, the letter concluded.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/25025158/Harare-Town-House.png",
            "description": "<p>By Darlington Gatsi HARARE City Council (HCC) workers have downed tools in protest against poor welfare conditions and non-payment of salaries, adding to the municipality’s growing challenges. The workers have not been paid for two months, and the council has failed to honour its promise to pay them on time. Their situation has been worsened</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-city-council-workers-stage-go-slow-after-two-months-without-salaries/\">Harare City Council workers stage go-slow after two months without salaries   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "Nearly half of Zimbabwean women suffer from GBV",
            "url": "https://www.newzimbabwe.com/nearly-half-of-zimbabwean-women-suffer-from-gbv/",
            "content": "\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/03182231/GBV-March--scaled.jpg",
            "description": "<p>By Thandiwe Garusa NEARLY half of Zimbabwean women have experienced gender-based violence (GBV), with many suffering abuse at the hands of those closest to them, European Union (EU) ambassador to Zimbabwe, Jobst von Kirchmann has said. Speaking after a HeForShe march against GBV recently held in Harare, Kirchmann said 42.5% of women in the country</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nearly-half-of-zimbabwean-women-suffer-from-gbv/\">Nearly half of Zimbabwean women suffer from GBV</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        },
        {
            "title": "32 Chivero farm residents in court following clash over ownership of land",
            "url": "https://www.newzimbabwe.com/32-chivero-farm-residents-in-court-following-clash-over-ownership-of-land/",
            "content": "By Staff Reporter\n\nA total of 32 Warwick Shire farm residents were on Monday dragged to court charged with public violence after they protested against the subdivision of the farm to clear way for residential stands.\n\nLawrence Munyaru and his neighbours appeared before magistrate Apolonia Marutya who remanded them in custody pending finalisation of their bail application.\n\nIt is the States case that on 30 January 2025, the group and others still at large connived and gathered at Warwick Shire farm, Lake Chivero, Zvimba and protested against the subdivision of the farm for residential stands and the subsequent development of the land.\n\nThey engaged in acts of public violence through vandalising several properties and setting several houses on fire within the farm. Firstly, the accused went to Southlands land developers site offices where they destroyed a security fence to gain entry and burnt two wooden cabins used as store room and office respectively resulting in the destruction of several building materials and diesel fuel.\n\nThereafter, the accused persons proceeded to Loom Light land developers site offices and destroyed a three-roomed house by removing its roof and breaking all window panes.\n\nThey also destroyed a 5000-litre water tank, borehole and some construction equipment. The accused persons also set several fowl runs with chickens on fire and fled from the scene of the crime after the arrival of the police, leading to their subsequent arrest, reads State papers.\n\nThe total value of the damaged property is yet to be established.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/10/28155839/Harare-Magistrates-Court.jpg",
            "description": "<p>By Staff Reporter A total of 32 Warwick Shire farm residents were on Monday dragged to court charged with public violence after they protested against the subdivision of the farm to clear way for residential stands. Lawrence Munyaru and his neighbours appeared before magistrate Apolonia Marutya who remanded them in custody pending finalisation of their</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/32-chivero-farm-residents-in-court-following-clash-over-ownership-of-land/\">32 Chivero farm residents in court following clash over ownership of land</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:26",
            "date": "04 Feb 2025"
        }
    ]
}