{
    "news": [
        {
            "title": "47 murdered in one week – police",
            "url": "https://www.newzimbabwe.com/47-murdered-in-one-week-police/",
            "content": "By Thandiwe Garusa\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
            "description": "<p>By Thandiwe Garusa AT LEAST 47 people were murdered across Zimbabwe between December 20 and 26, police have said. In a statement on Friday, police spokesperson Commissioner Paul Nyathi expressed concern over the murder cases and urged the public to resolve disputes without resorting to violence. “47 cases of murder have been received during the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/47-murdered-in-one-week-police/\">47 murdered in one week – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "WestProp offers lucrative brick discount",
            "url": "https://www.newzimbabwe.com/westprop-offers-lucrative-brick-discount/",
            "content": "By Business Reporter\n\nLISTED property firm, WestProp Holdings is offering its residential property customers at Pomona City the opportunity of a lifetime to pay 50 percent deposit for their brick requirements and enjoy a two-year instalment payment.\n\nThe company is setting up a US$1 million brick moulding company to assist the realisation of the one billion bricks vision by 2050 and to speed development after encountering delays in brick delivery and at times below standard bricks.\n\nOf all its development projects so far  only customers at Pomona City are building their own homes while at other developments the company is offering complete turn-key products.\n\nOnly 29 residential stands remain at Pomona phases 1B & C and 1A out of the initial 765 ahead of the introduction of the exciting leasehold concept next year.\n\nThe brick factory is designed to supply bricks to WestProp projects and with growth the company will then be able to supply excess bricks to outside customers.\n\nWestProp Holdings CEO Ken Sharpe says the new venture is in response to market delays in delivering bricks to the companys construction sites and a quest to manage brick quality.\n\nAs of March, next year, we start production. Those bricks are pre-sold. They are going to our customers. Our customers will pay a 50 percent deposit and pay the balance in instalments over two years, he said.\n\nThe initiative is meant to incentivise the customers to build and not be burdened by paying lump sums towards the bricks and then failing to buy other building materials.\n\nThe purchase price of $0.14 a brick will include transportation costs to the building site.\n\nSpeaking at a Christmas and excellence recognition awards ceremony for WestProp employees, Sharpe stressed the concept of urgency in service delivery to meet customer expectations.\n\nHe rallied the employees to embrace the one billion brick vision adding that their hands would be imprinted on the achievements of the vision.\n\nWhatever we do with the billion bricks stands forever. For the test of time, he said.\n\nSharpe reiterated his love for Zimbabwe noting that he formed the company to make a difference and provide livelihoods to thousands of people whose value chain depends on WestProp.\n\nI set up this business to be a public company. Not to enrich myself. I have enough money. I set it up so that you can benefit from it, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/10055033/Pomona_City_tOTx.jpg",
            "description": "<p>By Business Reporter LISTED property firm, WestProp Holdings is offering its residential property customers at Pomona City the opportunity of a lifetime to pay 50 percent deposit for their brick requirements and enjoy a two-year instalment payment. The company is setting up a US$1 million brick moulding company to assist the realisation of the one</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/westprop-offers-lucrative-brick-discount/\">WestProp offers lucrative brick discount</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Zimbabwe’s inflation slows to 3.7% in December",
            "url": "https://www.newzimbabwe.com/zimbabwes-inflation-slows-to-3-7-in-december/",
            "content": "Xinhua\n\nZimbabwes inflation slowed to 3.7 percent in December, down from 11.7 percent recorded the previous month, according to data released by the Zimbabwe National Statistics Agency (ZIMSTAT) on Friday.\n\nAccording to the ZIMSTAT, the downward trend in inflation in November and December, from a peak of 37.2 percent in October, reflects the prevailing stability of prices and the local currency, the Zimbabwe Gold (ZiG), after the central bank devalued it by 43 percent in September.\n\nWhile presenting the 2025 national budget to Parliament in November, Finance Minister Mthuli Ncube said he expects the ZiG month-on-month inflation to remain stable and average below 3 percent next year, backed by tight fiscal and monetary policies.\n\nHe said the 2025 fiscal plan was built on single-digit inflation and a stable exchange rate to create a favorable business environment.\n\nAny deviation from these assumptions, including the widening of the premium between the official and parallel markets, will severely impact macroeconomic stability, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Xinhua Zimbabwe’s inflation slowed to 3.7 percent in December, down from 11.7 percent recorded the previous month, according to data released by the Zimbabwe National Statistics Agency (ZIMSTAT) on Friday. According to the ZIMSTAT, the downward trend in inflation in November and December, from a peak of 37.2 percent in October, reflects the prevailing stability</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-inflation-slows-to-3-7-in-december/\">Zimbabwe’s inflation slows to 3.7% in December</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Mnangagwa pampers ‘neglected’ Mbare Chimurenga choirs",
            "url": "https://www.newzimbabwe.com/mnangagwa-pampers-neglected-mbare-chimurenga-choirs/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa on Thursday gave the Mbare Chimurenga Choirs gifts in recognition of their contribution to Zimbabwes cultural heritage.\n\nThe Mbare Chimurenga Choirs received Christmas hampers and money.\n\nSpeaking during the donation event, Mnangagwa urged the choirs to bring in fresh talent, keep their music alive, and explore new ways of distributing their music.\n\nGoing forward, I urge you to continue infusing the new crop of musicians, particularly the youth, into your groups.\n\nIt is equally important that you broaden the reach of your music, riding on the diversity of ICT platforms, Mnangagwa said.\n\nThe groups are well known for their revolutionary songs and energetic dance moves that motivate the ruling party Zanu PF and the nation for national cohesion, unity, patriotism and development.\n\nRecently, the groups made headlines after reports surfaced that they were struggling to secure funds to record new music.\n\nAccording to some choir members, during the late former President Robert Mugabes era, they were often invited to perform at nearly every gala in Zimbabwe, and the government would arrange hotel accommodations for them, ensuring they had all they needed.\n\nHowever, they claim they are no longer invited to perform at most events.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27184520/mbare-chimurenga.jpeg",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa on Thursday gave the Mbare Chimurenga Choirs gifts in recognition of their contribution to Zimbabwe’s cultural heritage. The Mbare Chimurenga Choirs received Christmas hampers and money. Speaking during the donation event, Mnangagwa urged the choirs to bring in fresh talent, keep their music alive, and explore new ways of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-pampers-neglected-mbare-chimurenga-choirs/\">Mnangagwa pampers ‘neglected’ Mbare Chimurenga choirs</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Test records for Zimbabwe and Williams as Afghanistan toil",
            "url": "https://www.newzimbabwe.com/test-records-for-zimbabwe-and-williams-as-afghanistan-toil/",
            "content": "AFP\n\nResuming on 363 for four, the home side were all out for 586 at Queens Sports Club in the southern city. Afghanistan were 95 for two off 30 overs in reply when bad light stopped play.\n\nThe Zimbabwe first innings total was their highest in a Test, bettering 563 for nine against the West Indies in Harare 23 years ago. It was the sixth Zimbabwe innings to exceed 500 runs.\n\nHaving made 145 runs on the first day, Williams added nine more before being caught by Rahmat Shah close to the boundary line off a Naveed Zadran bouncer.\n\nHis 154 overtook a previous best of 151 not out, also against Afghanistan, in Abu Dhabi three years ago.\n\nWilliams, batting at No. 4, struck three sixes and 10 fours off 174 balls in a 266-minute stand in the city where he was born. It was his fourth century in six Tests.\n\nHis partnerships included 163 for the fifth wicket with captain Craig Ervine, who went on to make 104, including 10 fours, before his inside edge was snapped up by wicketkeeper Afsar Zazai.\n\nIf I can lead by example and not by talking I believe my young teammates will learn quickly, said 38-year-old Williams.\n\nZimbabwe fielded three debutants, including 68-run opener Ben Curran, and three others are making just their second Test appearances.\n\nMiddle-order Brian Bennett was another Zimbabwe centurion, hitting a brisk unbeaten 110 that included four sixes and five fours.\n\nTeenage spinner Allah Ghazanfar was the most successful Afghanistan bowler, but his three wickets proved expensive as he conceded 127 runs.\n\nThe Afghanistan innings began disastrously with Test newcomer Sediqullah Atal out for three in the second over after a Trevor Gwandu delivery uprooted his middle stump.\n\nFellow opener Abdul Malik was dismissed for 23 before Shah patiently built an unbeaten 49 that included a six and five fours. Captain Hashmatullah Shahidi was 16 not out.\n\nBoth teams are seeking a first Test victory since beating each other three years ago.\n\nBrief scores\n\nZimbabwe 586 in 135.2 overs (Sean Williams 154, Brian Bennett 110 not out, Craig Ervine 104, Ben Curran 68; Allah Ghazanfar 3-127) v Afghanistan 95-2 in 30 overs (Rahmat Shah 49 not out). Bad light stopped play\n\nToss: Zimbabwe\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27185517/Screenshot-2024-12-27-at-20.54.57.png",
            "description": "<p>AFP Resuming on 363 for four, the home side were all out for 586 at Queens Sports Club in the southern city. Afghanistan were 95 for two off 30 overs in reply when bad light stopped play. The Zimbabwe first innings total was their highest in a Test, bettering 563 for nine against the West</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/test-records-for-zimbabwe-and-williams-as-afghanistan-toil/\">Test records for Zimbabwe and Williams as Afghanistan toil</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Mnangagwa hints at cabinet reshuffle amid factional tensions over “ED2030” slogan",
            "url": "https://www.newzimbabwe.com/mnangagwa-hints-at-cabinet-reshuffle-amid-factional-tensions-over-ed2030-slogan/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has signalled the possibility of a cabinet reshuffle in 2025 amid Zanu PF divisions over the extension of his tenure beyond 2028.\n\nMnangagwa who is serving his second and final term has indicated that he will not go beyond his 2028 constitutional mandate.\n\nHowever, factional rifts and political maneuvering have been the order of the day as the ED2030 slogan has become a point of contention within the ruling party.\n\nCritics within Zanu PF argue that the focus on the slogan masks underlying challenges, including corruption, inefficiency, and economic stagnation whilst the ordinary citizens wallow in abject poverty.\n\nThe reshuffleis viewedas an opportunity for Mnangagwa to consolidate his power by sidelining dissenters.\n\nThe reshuffle might not just be about performance. It could be about loyalty to EDs vision, a political analyst suggested.\n\nMnangagwa has reshuffled his cabinet multiple times in recent years, often citing the need for efficiency.\n\nDuring his Christmas Day interview with ZBC, Mnangagwa emphasized the importance of performance and accountability among leaders.\n\nThis is the season to reflect, not just on personal matters, but on professional performance. Those entrusted with leadership must evaluate their contributions to the people of Zimbabwe, he said.\n\nWe must look at that and say this was my team, this is the team that has delivered our vision. Or does it require interrogating it? And are you going forward with that team like you were saying? No, I cant release it now, Ill make my statement after January 1, 2025.\n\nThis is because, at this moment, everybody is celebrating Christmas. Without me, how shall we? I said dont go and do what I will be doing. We reflect on how weve worked as a team and what weaknesses have I identified, what is necessary for me to strengthen, to execute government work.\n\nWhile stopping short of naming specific cabinet ministers or portfolios under review, Mnangagwa made it clear that underperformance would not be tolerated.\n\nZimbabwe deserves a government that works tirelessly for the people. This requires commitment and results from those in leadership, he added.\n\nHis remarks have left the political landscape buzzing, with many speculating about which ministers might be affected by the potential shakeup.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has signalled the possibility of a cabinet reshuffle in 2025 amid Zanu PF divisions over the extension of his tenure beyond 2028. Mnangagwa who is serving his second and final term has indicated that he will not go beyond his 2028 constitutional mandate. However, factional rifts and political maneuvering</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-hints-at-cabinet-reshuffle-amid-factional-tensions-over-ed2030-slogan/\">Mnangagwa hints at cabinet reshuffle amid factional tensions over “ED2030” slogan</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "77 deaths, 401 injuries recorded in festive season road traffic accidents – police",
            "url": "https://www.newzimbabwe.com/77-deaths-401-injuries-recorded-in-festive-season-road-traffic-accidents-police/",
            "content": "By Staff Reporter\n\nA total of 77 people lost their lives in 1,211 road accidents that occurred between December 15 and 26, the Zimbabwe Republic Police (ZRP) has said.\n\nAccording to the latest statistics released by the police, 401 people were injured during the same period.\n\nWhile the number of accidents decreased slightly from 1,454 recorded during the same time last year, the number of fatalities and injuries showed an increase.\n\nThe number of deaths rose by six, from 71 in December 2023 to 77 this year, while the number of injuries increased by eight, from 393 to 401.\n\nMost of these accidents involved private vehicles, with only one incident involving public service vehicles, where three South Africa-bound buses collided, resulting in two fatalities.\n\nIn a statement Friday, police spokespersonCommissionerPaul Nyathi said some of the accidents were caused by fatigue and the negligent conduct of drivers.\n\nAccidents involving pedestrians trying to cross the roads have also been recorded.\n\nDrivers are urged to be observant, especially when approaching built-up areas or places frequented by the public, including residential areas.\n\nMeanwhile, the Zimbabwe Republic Police reiterates that drivers should avoid speeding and overtaking in circumstances that are clearly not safe to do so.\n\nAbove all, motorists are implored not to overload vehicles when travelling on the countrys roads, Nyathi said.\n\nThe public has also been urged to report any bad driving to the police.\n\nOn the other hand, motorists have been urged to be responsible and effectively contribute towards road safety in the country.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/22172738/IMG-20241222-WA0013.jpg",
            "description": "<p>By Staff Reporter A total of 77 people lost their lives in 1,211 road accidents that occurred between December 15 and 26, the Zimbabwe Republic Police (ZRP) has said. According to the latest statistics released by the police, 401 people were injured during the same period. While the number of accidents decreased slightly from 1,454</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/77-deaths-401-injuries-recorded-in-festive-season-road-traffic-accidents-police/\">77 deaths, 401 injuries recorded in festive season road traffic accidents – police</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Illegal trade booms in South Africa’s ‘super-strange looking’ plants",
            "url": "https://www.newzimbabwe.com/illegal-trade-booms-in-south-africas-super-strange-looking-plants/",
            "content": "BBC\n\nA biodiversity hotspot in a remote part of South Africa has become the hub of an illegal trade in protected plant species, with organised crime groups capitalising on overseas demand.\n\nTheyve not just stolen our land or our plants, theyve stolen our heritage as well, a livestock farmer angrily tells the BBC, as she expresses dismay at the social and ecological crisis that the poaching has caused.\n\nMost of the plants in question are a variety known as succulents, named for their ability to hold water and survive in arid climates.\n\nMany of the worlds succulent species are only found in the Succulent Karoo desert, which spans South Africa and Namibia.\n\nSucculent species range in size, shape and colour  some look like small multi-coloured buttons and some look like cacti, sprouting colourful flowers at certain times of the year.\n\nWhile these varieties can be cultivated in nurseries, global demand is also fuelling the poaching of these plants from the wild which are then smuggled and sold online to buyers in the US, Europe and East Asia.\n\nIn Kamieskroon, a small town in the centre of South Africas Namaqualand region, the rolling hills have become a haven for poachers.\n\nSome of the species are highly localised, and so can be wiped out by just a small amount of poaching.\n\nIn South Africa, we know already of seven species that has been wiped out completely and there are certainly more species that will go extinct very soon, says Pieter van Wyk, a nursery curator at the/Ai /Ais-Richtersveld Transfrontier Park.\n\nIt is hard to obtain figures for how many plants are being poached, but the non-governmental organisation Traffic reports that1.6 million illegally harvested succulents were seizedby South Africas law enforcement agencies between 2019 and 2024. This only represents the contraband that was detected, so the true figure is likely to be far higher.\n\nThe South African government is well aware of the problem, and unveiled a strategy in 2022 to combat poaching. It includes running community programmes about the need to protect the environment.\n\nAccording to Mr Van Wyk and other conservationists, plant poaching has been booming since the Covid-19 lockdown in 2020.\n\nWith international traders unable to travel to South Africa during that time, they turned to local people to collect succulents for them and post them out of the country.\n\nMr Van Wyk says this coincided with an increase in global demand.\n\nPeople had more time to try to find something to keep busy with, and plants were one of the only things that in your house, could connect you to the outside world.\n\nThis has been seized upon by organised crime syndicates who hire teams of plant poachers and then market the wild plants on social media and e-commerce platforms.\n\nThe syndicates saw this as an opportunity of making something viral telling a wide as possible public: We have this super-strange looking thing that comes from the African continent,' Mr Van Wyk says.\n\nThen the public just loses their heads and they say: I want to buy one, and [the syndicates] arrange for the species to be poached, he adds.\n\nThe uptick in organised crime activity in the region is having knock-on effects on local communities.\n\nThis is a low-income area, people are not rich here, and people will exploit opportunities for income, explains Malinda Gardiner from Conservation South Africa.\n\nExpressing a similar view, the livestock farmer whom the BBC spoke to says there is always an influx of money in her community when poaching takes place.\n\nWhen we see young men going up in the mountain areas, we know theyre poachers, adds the farmer, who asks not to be identified for fear of reprisals.\n\nThey use screwdrivers to uproot the succulents and they carry backpacks and sacks to keep the stolen plants.\n\nA few days after that, there is an outbreak of binge drinking and illegal activity.\n\nWhen they get the money, theres more drugs, more alcohol, children are neglected because mummy is drunk, daddy is drunk, theres no food, adds the farmer.\n\nMs Gardiner worries that the tensions will have longer-term effects.\n\nSmall communities here really need each other but this brings distrust. It brings a split in the communities as well, she says.\n\nMr Van Wyks assessment is starker: People are being abused and enslaved by syndicates and buyers.\n\nAttempts are being made to raise awareness among buyers about the importance of understanding where a plant might have come from.\n\nChina has become a major source of demand for wild succulents in the last few years, but an internet campaign there to educate people about the illegal succulent trade has seen some results.\n\nThe Clean Internet for Conophytum campaign was launched in March 2023 by the China Biodiversity Conservation and Green Development Foundation.\n\nAccording to the foundations deputy secretary-general Linda Wong, they have seen an 80% reduction in online adverts for conophytum  a type of succulent  with an unknown source, and buyers are starting to ask questions about where plants being sold online have come from.\n\nThe key is awareness. Once people know, they want to take action. They want to take responsibility to consume those plants and enjoy their beauty in a very responsible way, she tells the BBC.\n\nConservationists advise customers all over the world to ask about the origin of a plant, and under no circumstances should they buy those advertised as wild.\n\nTraffic and the UKs Kew Gardens recently announced that they were teaming up with eBayto develop new ways of preventing the sale of wild succulents on its platform.\n\nIn South Africa, Mr Van Wyk says more should be done to promote the cultivation of succulents that can be grown and harvested legally, to reduce the demand for poaching.\n\nWe as a country need to say that: We have this resource, and there are other countries that are majorly benefiting from this, why arent we?' he tells the BBC.\n\nMr Van Wyk now runs a nursery at the /Ai /Ais-Richtersveld Transfrontier Park which looks after plants that have been confiscated by law enforcement, and he says they have received more than 200,000 so far.\n\nIts obviously stressful seeing things disappearing. But if you study these plants, it brings so much joy and pleasure and you just forget about all the nonsense thats happening in the world, Mr Van Wyk says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27053445/84b81310-bd64-11ef-a0f2-fd81ae5962f4.jpg.webp",
            "description": "<p>BBC A biodiversity hotspot in a remote part of South Africa has become the hub of an illegal trade in protected plant species, with organised crime groups capitalising on overseas demand. “They’ve not just stolen our land or our plants, they’ve stolen our heritage as well,” a livestock farmer angrily tells the BBC, as she</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/illegal-trade-booms-in-south-africas-super-strange-looking-plants/\">Illegal trade booms in South Africa’s ‘super-strange looking’ plants</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Williams praises Curran’s ‘intent’ as Zimbabwe find their scoring touch",
            "url": "https://www.newzimbabwe.com/williams-praises-currans-intent-as-zimbabwe-find-their-scoring-touch/",
            "content": "Zimbabwe had as many as three debutants in theBoxing Day Test against Afghanistanin Bulawayo. One of them, opening batterBen Curran, went on to score 68 on day one, while the other two debutants were pace bowlersTrevor GwanduandNewman Nyamhuri.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/27053204/currant.webp",
            "description": "<p>ESPNCricinfo Zimbabwe had as many as three debutants in the Boxing Day Test against Afghanistan in Bulawayo. One of them, opening batter Ben Curran, went on to score 68 on day one, while the other two debutants were pace bowlers Trevor Gwandu and Newman Nyamhuri. Curran reached his half-century off just 54 balls, and hit 11 boundaries during his stay</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/williams-praises-currans-intent-as-zimbabwe-find-their-scoring-touch/\">Williams praises Curran’s ‘intent’ as Zimbabwe find their scoring touch</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        },
        {
            "title": "Zanu PF’s plans to keep Mnangagwa in office beyond 2028 trigger a wave of violence",
            "url": "https://www.newzimbabwe.com/zanu-pfs-plans-to-keep-mnangagwa-in-office-beyond-2028-trigger-a-wave-of-violence/",
            "content": "By Darlington Gatsi\n\nAN ambitious plan to extend President Emmerson Mnangagwas tenure beyond the constitutionally mandated two terms has triggered a wave of violence and intimidation, a recent report has revealed.\n\nDespite Mnangagwa saying he will respect the constitution and leave office after the end of his current and final term some ruling party officials are pushing for the octogenarian to remain in power.\n\nSeveral officials, including former cabinet ministers Supa Mandiwanzira and Owen Ncube have been clamouring in their respective provinces for Mnangagwa to rule beyond 2028.\n\nThis is in contrast to the partys resolution at this years conference in Bulawayo, which declared that Mnangagwa is serving his final term as president.\n\nThe Zimbabwe Peace Project (ZPP) latest report revealed that those opposed to Mnangagwa extending his term have faced violence from Zanu PF officials in Midlands province.\n\nSeveral incidents of intimidation included the harassment of known political activists by Zanu PF supporters who are focused on promoting the ED2030 campaign, which seeks to extend President Mnangagwas rule beyond 2028. The incidents were reported in Chiwundura and Kwekwe, among other areas.\n\nIn Chiwundura, Zanu PF activists Calvin Mhondiwa, Forbes Choto, and Adam Dhliwayo threatened a male victim belonging to a group supporting former CCC leader Nelson Chamisa. They allegedly harassed him for campaigning against the ongoing Mnangagwa beyond 2028 movement, promising to deal with the victim violently and extending such treatment to anyone opposed to the campaign, the report reads.\n\nZanu PF must amend Sections 91(2) and 382(7) of the constitution to allow Mnangagwa to extend his term.\n\nZPP has called on the police to take action on the allegations levelled against Zanu PF officials.\n\nThe ZRP should take concrete steps to prevent and investigate incidents of violence, particularly those related to the ED2030 campaign. The police must also ensure that perpetrators are held accountable and that victims receive adequate protection, said ZPP.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/22195935/F1o4Bw1WwAEXt93.jpg",
            "description": "<p>By Darlington Gatsi AN ambitious plan to extend President Emmerson Mnangagwa’s tenure beyond the constitutionally mandated two terms has triggered a wave of violence and intimidation, a recent report has revealed. Despite Mnangagwa saying he will respect the constitution and leave office after the end of his current and final term some ruling party officials</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pfs-plans-to-keep-mnangagwa-in-office-beyond-2028-trigger-a-wave-of-violence/\">Zanu PF’s plans to keep Mnangagwa in office beyond 2028 trigger a wave of violence </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:27",
            "date": "28 Dec 2024"
        }
    ]
}