{
    "news": [
        {
            "title": "In Pictures: At least 17 killed in Seke Road accident",
            "url": "https://www.newzimbabwe.com/in-pictures-at-least-17-killed-in-seke-road-accident/",
            "content": "AT LEAST 17 people were killed in an accident which occurred along Seke Road on Tuesday morning when a haulage truck collided with a commuter omnibus.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133056/1000794251-scaled.jpg",
            "description": "<p>AT LEAST 17 people were killed in an accident which occurred along Seke Road on  Tuesday morning when a haulage truck collided with a commuter omnibus. Below are some images from the accident scene. Pictures by Tapiwa Svondo</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-pictures-at-least-17-killed-in-seke-road-accident/\">In Pictures: At least 17 killed in Seke Road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "22 Jul 2025"
        },
        {
            "title": "17 die in Seke road accident",
            "url": "https://www.newzimbabwe.com/17-die-in-seke-road-accident/",
            "content": "By Mary Taruvinga\n\nA total of 17 people have been confirmed dead by rescue and medical teams following a horror crush involving a haulage truck and a commuter omnibus along Seke road, Harare this morning.\n\nThe fatal accident took place at Hunyani Bridge near Water Works.\n\nAmong the 17, the first two were hit by the 30 tonne haulage truck before it crushed the commuter omnibus which remained trapped for a long time before rescue came.\n\nThree other victims were rushed to hospital in critical conditions.\n\nIn first videos that went viral on social media, victims could be heard crying.\n\nAuthorities are yet to give an account of what happened.\n\nHowever, some eye witnesses said the truck was traveling to Harare while the commuter omnibus was headed for St Marys when the crush happened.\n\nIt is believed that a Honda Fit veered into the lane of the truck causing the driver to serve into the opposite lane resulting in a head-on collision with the commuter omnibus.\n\nThe kombi was dragged before it was crushed under the truck.\n\nVictims are yet to be identified.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/22133056/1000794251-scaled.jpg",
            "description": "<p>By Mary Taruvinga A total of 17 people have been confirmed dead by rescue and medical teams following a horror crush involving a haulage truck and a commuter omnibus along Seke road, Harare this morning. The fatal accident took place at Hunyani Bridge near Water Works. Among the 17, the first two were hit by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/17-die-in-seke-road-accident/\">17 die in Seke road accident</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "22 Jul 2025"
        },
        {
            "title": "Brendan Taylor set to return to face NewZealand after three-year ban",
            "url": "https://www.newzimbabwe.com/brendan-taylor-set-to-return-to-face-newzealand-after-three-year-ban/",
            "content": "NZ Herald\n\nFormer Zimbabwe cricket captain Brendan Taylor is set to face the Black Caps just days after his three-and-a-half-year ban from cricket is lifted, according to reports.\n\nTaylor was handed the ban in 2022 for breaching the ICCs anti-corruption code after he admitted to taking money from match-fixers in India  but claimed he never fixed or manipulated games.\n\nHis ban officially expires on Saturday, after which he will be named in the Zimbabwe test squad to face the Black Caps, with the first test beginning on July 30, Cricinfo reports.\n\nThe 39-year-old has previously played 34 tests including leading Zimbabwe to a close defeat to the Black Caps in 2011, in which he scored a century in the fourth innings before the home side fell 34 runs short of victory.\n\nTaylor admitted he took money from match-fixers who tried to blackmail him into manipulating international games with a secret video of him using cocaine on a visit to India in 2019.\n\nEven though he took US$15,000 ($25,000) from the fixers, Taylor said he never fixed or manipulated games.\n\nTaylor said he was invited to India to discuss a sponsorship opportunity in October 2019. At a dinner with businessmen, he was offered cocaine and foolishly took the bait.\n\nThe following morning, the same men entered my hotel room to show me a video taken of me the night before doing cocaine and told me that if I did not partake in spot fixing at international matches, the video would be released to the public, Taylor said.\n\nTaylor said he took the US$15,000 from the men, who said it was now a deposit for him to fix and they promised him another US$20,000 ($33,500) once the fixing job was complete.\n\nTaylor took four months to report the incident to the ICC and accepted that was against crickets anti-corruption rules.\n\nThe Black Caps and Zimbabwe will play a two-test series with both matches taking place in Bulawayo.\n\nZimbabwe have already named a 16-man squad which includes four changes following a 2-0 series defeat to South Africa last month, with Ben Curran, Sikandar Raza, Roy Kaia and Tanunurwa Makoni joining the side. Cricinfo reports Taylor is expected to be added to the squad.\n\nTaylor told Cricinfo in March that he has been using facilities at an elite independent school in Harare, preparing for his return.\n\nI still want to play and I believe I could make an impact as a player, he said.\n\nI look at where Im at physically and mentally and if I didnt feel I could do it, I wouldnt bother. Givemore [Makoni, managing director of Zimbabwe Cricket] has really supported me on this. He sort of shut down the coaching role for now and said, Can you play and try to push yourself up until the 2027 World Cup? Granted Ill be 41 then but with sobriety, Im living my truest form.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/16073556/brendan-taylor-e1581839069251.jpg",
            "description": "<p>NZ Herald Former Zimbabwe cricket captain Brendan Taylor is set to face the Black Caps just days after his three-and-a-half-year ban from cricket is lifted, according to reports. Taylor was handed the ban in 2022 for breaching the ICC’s anti-corruption code after he admitted to taking money from match-fixers in India – but claimed he</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/brendan-taylor-set-to-return-to-face-newzealand-after-three-year-ban/\">Brendan Taylor set to return to face NewZealand after three-year ban</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "22 Jul 2025"
        },
        {
            "title": "Pastor escapes 20 year jail term; court hears rape was reported 12 years later",
            "url": "https://www.newzimbabwe.com/pastor-escapes-20-year-jail-term-court-hears-rape-was-reported-12-years-later/",
            "content": "By Mary Taruvinga\n\nA Harare pastor has been spared from serving a 20-year jail term after the High Court quashed his conviction and sentence, having found that the lower court erred in finding him guilty.\n\nJeane Pierre Dusabe was jailed by a Harare magistrate for allegedly raping and indecently assaulting a minor girl he took custody of after her parents divorced back in 2014.\n\nThe rape only emerged ten years later, when the girl got married, with a formal report being made later in 2023.\n\nThe court heard, Dusabe was aged 39 while the girl was aged 12 years when the offence was allegedly committed.\n\nThe allegations in count one were that the appellant indecently assaulted the complainant once at a house in Harare.\n\nOn the second count, it was alleged that on dates unknown to the prosecutor between the years 2014 and 2022 and at different places in Harare and Masvingo, the appellant hadsexual intercourse with the complainant without her consent on several occasions.\n\nDusabe was charged with one count of rape and another of indecent assault.\n\nThe complainantstestimony was that sometime in 2014 Dusabe touched her private parts when her aunt was away on a trip to South Africa.\n\nShe was having swimming lessons conducted by Dusabe in a pool at her home in Mandara, together with her sister, who was also a minor.\n\nOn the same day, around midnight, the appellant came into the room, got into the blankets, and got on top of her.\n\nShe awoke to find the appellant on top of her before he raped her while covering her mouth.\n\nShe said after this incident, the appellant had sexual intercourse with her without her consent several times at different homes they stayed in.\n\nShe also said sometime in 2015 on unknown dates and in Hateld, the appellant would occasionally transport her to and from school using his commuter omnibus. It is alleged that during these times, the appellant would take advantage of the complainant and have sexual intercourse with her without her consent at a bushy area in Arlington.\n\nThe complainant also told the court a quo that sometime in March 2022, on an unknown date, she fell sick and sought the appellants help.\n\nShe said Dusabe suggested to her that they go to Masvingo to a doctor whom he knew who could treat her.\n\nWhilst there, Dusabe had sexual intercourse with her four times without her consent, after his relatives, whom they had found at his house, had left for Harare.\n\nThe alleged rape only surfaced after her husband confronted her over her virginity when they got married.\n\nShe told her that Dusabe had raped her several times.\n\nThe husband then told church members in 2022 but a formal report was made two years later.\n\nThe trial court found Dusabe guilty of rape and indecent assault before sentencing him to 20 years imprisonment.\n\nAggrieved, he mounted the present application, complaining that the lower court erred in convicting him when there was no evidence linking him to the alleged crimes.\n\nDusabe proved that his wife never visited South Africa in 2014 by producing her passport.\n\nThree relatives testified that Dusabe never resided at a house with a functional swimming pool.\n\nHis lawyer said the lower court was wrong in finding that the delay in reporting the rape was reasonable when one considers the manner in which the offence surfaced and material discrepancies in the evidence of the complainant.\n\nHe also said the alleged rape in Masvingo took place when the complainant was already married and that she failed to disclose it, then was therefore unreasonable.\n\nHigh Court judge Justice Christopher Dube Banda upheld Dusabes appeal, ruling that the report of rape does not meet the requirements for admissibility.\n\nThe trial court erred in failing to make findings on material aspects of the case.\n\nThe delay in reporting the alleged rape and indecent assault and the circumstances under which the disclosure was made render the complaint doubtful and unreasonable.\n\nConsequently, the State evidence led is not reliable and safe to convict on.\n\nThe appellants story is convincing.\n\nThe State failed to prove its case beyond a reasonable doubt.\n\nThe evidence that was placed before the court did not meet the required threshold when regard is had to the evidence of the State witnesses.\n\nOn that basis, this court is obliged to interfere with the findings of the trial court.\n\nThe evidence being unreliable, it was unsafe to convict the appellant on its basis.\n\nAccordingly, the court finds that the States concession was properly made. The appeal succeeds. As a result, it is ordered that the appeal against both conviction and sentence is upheld.\n\nThe court a quos conviction and sentence be and is hereby set aside and in its place is substituted the following; The accused is found not guilty and acquitted, the judge ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Mary Taruvinga A Harare pastor has been spared from serving a 20-year jail term after the High Court quashed his conviction and sentence, having found that the lower court erred in finding him guilty. Jeane Pierre Dusabe was jailed by a Harare magistrate for allegedly raping and indecently assaulting a minor girl he took</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/pastor-escapes-20-year-jail-term-court-hears-rape-was-reported-12-years-later/\">Pastor escapes 20 year jail term; court hears rape was reported 12 years later</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "22 Jul 2025"
        },
        {
            "title": "VP Chiwenga distances self from Tagwirei’s “pseudo-event”",
            "url": "https://www.newzimbabwe.com/vp-chiwenga-distances-self-from-tagwireis-pseudo-event/",
            "content": "By Darlington Gatsi\n\nDEPUTY President Constantino Chiwenga has distanced himself from an event allegedly organised by allies of President Emmerson Mnangagwa, exposing deepening fissures within the ruling ZANU-PF party.\n\nOn the events flyer shared on social media platforms, Chiwenga is listed as the guest of honour with controversial businessmen Kudakwashe Tagwirei and Paul Tungwarara headlining.\n\nThe event dubbed Matebeland Business Dinner features a speakers panel with several cabinet ministers.\n\nHowever, Chiwengas office has denied any involvement, calling the event fraudulent and a violation of government protocol.\n\nIt has come to the attention of Honourable Vice President Gen. (Retd) Dr. C. G. D. N. Chiwengas office that a group of persons have been flighting Advertisements on social media purporting to announce a Business Dinner dubbed Matabeleland Business Dinner at which the Vice President is touted as Guest of Honour.\n\nThe office of the Vice President categorically disassociates itself from the event which has nothing to do with Government, blatantly violates Government protocol, and goes against our organisational norms, read the statement.\n\nTagwirei and Tungwarara are part of a clique of businessmen reportedly referred to by Chiwenga as zvigananda, a derogatory term for individuals accused of amassing wealth through opaque deals and political patronage.\n\nThis also comes as Chiwenga reportedly moved against the co-option of Tagwirei into the ZANU PF Central Committee, recently delaying the businessmans adoption into the powerful organ of the party.\n\nTagwirei has reportedly been eyeing to replace Mnangagwa as the leader of ZANU PF when his constitutionally limited two terms expire. However, the business mogul has since denied harbouring this ambition.\n\nChiwengas statement further condemned the dinner as an extortion scheme.\n\nThe Vice President takes great exception to being associated with such a fraudulent pseudo-event designed to extort the unsuspecting public through false association with him and other figures of Government, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/29170900/Chiwenga.jpeg",
            "description": "<p>By Darlington Gatsi DEPUTY President Constantino Chiwenga has distanced himself from an event allegedly organised by allies of President Emmerson Mnangagwa, exposing deepening fissures within the ruling ZANU-PF party. On the event’s flyer shared on social media platforms, Chiwenga is listed as the guest of honour with controversial businessmen Kudakwashe Tagwirei and Paul Tungwarara headlining.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vp-chiwenga-distances-self-from-tagwireis-pseudo-event/\">VP Chiwenga distances self from Tagwirei’s “pseudo-event”  </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "22 Jul 2025"
        },
        {
            "title": "Zimbabwe’s export of minerals used in battery production surges 30%",
            "url": "https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/",
            "content": "Reuters\n\nPrices of lithium  used in batteries to power renewable energy technologies  have tumbled nearly 90% over the past two years, mainly due to oversupply, but producers remain positive about the metals long-term prospects amid a global push towards cleaner energy sources and electric vehicles.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/24130533/Lithium-Mining.jpeg",
            "description": "<p>Reuters  Zimbabwe’s exports of spodumene concentrate, a lithium-bearing mineral essential for battery production, surged 30% in the first half of 2025 despite weak global lithium prices, official statistics show. Africa’s top lithium producer exported 586,197 metric tons of spodumene concentrate between January and June, compared to 451,824 metric tons during the same period last year,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-export-of-minerals-used-in-battery-production-surges-30/\">Zimbabwe’s export of minerals used in battery production surges 30%</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:38",
            "date": "22 Jul 2025"
        }
    ]
}