{
    "news": [
        {
            "title": "George Foreman, the fearsome heavyweight who became a beloved champion, dies at 76",
            "url": "https://www.newzimbabwe.com/george-foreman-the-fearsome-heavyweight-who-became-a-beloved-champion-dies-at-76/",
            "content": "By Associated Press\n\nGEORGE Foreman became the heavyweight champion of the world in his 20s, only to lose his belt to Muhammad Ali in perhaps the most memorable fight in boxing history.\n\nA full 20 years later in 1994, the 45-year-old Foreman became the oldest man to win the heavyweight championship, throwing one perfect combination to steal Michael Moorers title in an epic upset.\n\nFew fighters ever had more big moments than Big George Foreman  and even after he finally left the ring, he was only getting started.\n\nThe fearsome heavyweight, who lost the Rumble in the Jungle to Ali before his inspiring second act as a surprising champion and a successful businessman, died Friday night. Foreman was 76.\n\nForemans family announced his death on social media, not saying how or where he died.\n\nA devout preacher, a devoted husband, a loving father and a proud grand- and great-grandfather, he lived a life marked by unwavering faith, humility and purpose, his family wrote.\n\nA humanitarian, an Olympian and two-time heavyweight champion of the world, he was deeply respected. A force for good, a man of discipline, conviction, and a protector of his legacy, fighting tirelessly to preserve his good name for his family.\n\nA native Texan, Foreman began his boxing career as an Olympic gold medalist who inspired fear and awe as he climbed to the peak of the heavyweight division by stopping Joe Frazier in 1973.\n\nHis formidable aura evaporated only a year later when Ali pulled off one of the most audacious victories in boxing history in Zaire, baiting and taunting Foreman into losing his belt.\n\nForeman left the sport a few years later, but returned after a 10-year absence and a self-described religious awakening.\n\nThe middle-aged fighter then pulled off one of the most spectacular knockouts in boxing history, flooring Moorer  19 years his junior  with a surgical right hand and claiming Moorers two heavyweight belts. Foremans 20 years is easily the longest gap between heavyweight title reigns.\n\nForemans transformation into an inspirational figure was complete, and he fought only four more times  finishing 76-5 with 68 knockouts  before moving onto his next career as a genial businessman, pitchman and occasional actor.\n\nOutside the ring, he was best known as the face of the George Foreman Grill, which launched in the same year as his victory over Moorer. The simple cooking machine sold more than 100 million units and made him much wealthier than his sport ever did.\n\nGeorge was a great friend to not only myself, but to my entire family, Top Rank president Bob Arum said. Weve lost a family member and are absolutely devastated.\n\nIn the first chapter of his boxing career, Foreman was nothing like the smiling grandfather who hawked his grills on television to great success.\n\nForeman dabbled in petty crime while growing up in Houstons Fifth Ward, but changed his life through boxing. He made the U.S. Olympic team in 1968 and won gold in Mexico City as a teenager, stopping a 29-year-old opponent in a star-making performance.\n\nForeman rose to the pinnacle of the pro game over the next five years, but was also perceived as an aloof, unfriendly athlete, both through his demeanor and through the skewed racial lenses of the time.\n\nJim Lampley, the veteran boxing broadcaster who worked alongside Foreman for many years at HBO, told The Associated Press on Friday night that Foremans initial demeanor was an attempt by his camp to emulate Sonny Liston, the glowering heavyweight champ of the 1960s.\n\nAt some point somewhere along the way, he realized that wasnt him, Lampley said.\n\nForeman stopped Frazier in an upset in Jamaica in January 1973 to win the belt, with his knockout inspiring Howard Cosells iconic call: Down goes Frazier! Down goes Frazier!\n\nForeman defended his belt against Ken Norton before accepting the fight with Ali in the now-immortal bout staged in Africa by promoter Don King. Ali put on a tactical masterclass against Foreman, showing off the rope-a-dope strategy that frustrated and infuriated the champion. Foreman was eventually knocked down for the first time in his career, and the fight was stopped in the eighth round.\n\nForeman told the BBC in 2014 that he took the fight almost out of charity to Ali, who he suspected to be broke.\n\nI said I was going to go out there and kill him, and people said, Please, dont say youre going to kill Muhammad, Foreman said. So I said, OK, Ill just beat him down to the ground. Thats how easy I thought the fight would be.\n\nExhausted and disillusioned, Foreman stopped fighting in 1977 and largely spent the next decade preaching and working with kids in Houston after his religious awakening. He returned to boxing in 1987 in his late 30s with a plan to defy time through frequent ring appearances, and he racked up a lengthy series of victories before losing to Evander Holyfield in a surprisingly competitive title fight in 1991.\n\nThree years later, Foreman got in the ring with Moorer in Las Vegas, more for his celebrity than for his perceived ability to beat Moorer. The champion appeared to win the first nine rounds rather comfortably, with Foreman unable to land his slower punches. But Foreman came alive in the 10th, hurting Moorer before slipping in the short right hand that sent Moorer to the canvas in earth-shaking fashion.\n\nLampley, who was calling the fight, named his upcoming autobiography  which includes a prologue about Foreman  after his famous call of that moment: It Happened!\n\nForeman quit the ring for good in 1997, although he occasionally discussed a comeback. He settled into a life as a boxing analyst for HBO and as a pitchman for the grills that grew his fame and fortune. Much of the world soon knew Foreman as both a lovable friend and a ferocious fighter.\n\nHe started performing as this pitchman, this product pitchman with the big, ever-present giant grin on his face, Lampley recalled. When I was working with him, people would say, George is a big clown.\n\nAnd I would say, Well, you can call him a clown, but hes actually a genius. He may be the greatest genius Ive ever met. And people would say, Well, genius, what do you mean? Id say, Well, check the bank account. If that isnt proof enough, I dont know what is. So, he was a genius. He was a human genius.\n\nForeman briefly starred in a sitcom called George in the 1990s, and he even appeared on the reality singing competition The Masked Singer in 2022. A biographical movie based on his life was released in 2023.\n\nForeman had 12 children, including five sons who are all famously named George Edward Foreman.\n\nLegendary boxing champion, life-changing preacher, husband, father, grand- and great-grandfather and the best friend you could have, WBC President Mauricio Sulaiman wrote on social media.\n\nHis memory is now eternal, may Big George rest in peace.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/22073921/download-10.webp",
            "description": "<p>By Associated Press  GEORGE Foreman became the heavyweight champion of the world in his 20s, only to lose his belt to Muhammad Ali in perhaps the most memorable fight in boxing history. A full 20 years later in 1994, the 45-year-old Foreman became the oldest man to win the heavyweight championship, throwing one perfect combination</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/george-foreman-the-fearsome-heavyweight-who-became-a-beloved-champion-dies-at-76/\">George Foreman, the fearsome heavyweight who became a beloved champion, dies at 76</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Suspected Zanu PF thugs destroy car, house belonging to party member opposed to Mnangagwa’s 2030 agenda",
            "url": "https://www.newzimbabwe.com/suspected-zanu-pf-thugs-destroy-car-house-belonging-to-party-member-opposed-to-mnangagwas-2030-agenda/",
            "content": "By Staff Reporter\n\nPROPERTY belonging to a Zanu PF member was Thursday destroyed by suspected fellow party activists during a nocturnal raid in Zvimba, Mashonaland West province, as intra-party violence escalates in the ruling establishment.\n\nGifford Gomwe had his vehicle and house destroyed for allegedly bravely coming out to vociferously resist President Emmerson Mnangagwas supporters push to extend his rule beyond his constitutionally-permissible two five-year terms.\n\nGifford Gomwe\n\nGomwe, who faced off with Justice Minister Ziyambi Ziyambi during the 2023 Zanu PF primaries in which both eventually lost to current Labour deputy minister Mercy Maruva-Dinha, is counting his loss after unknown assailants descended on his homestead Thursday night.\n\nThe attackers, seemingly on a terror mission, didnt take away any valuables but targeted a double-cab vehicle whose windows and lights they shattered using unknown objects. They also smashed window panes around the house before fleeing.\n\nGomwe confirmed the incident to NewZimbabwe.com in a telephone interview.\n\nThe incident happened while l was away in Harare for work but one of my relatives was there. The assailants were clearly on a mission to intimidate me because all they did was to vandalise my property and didnt take away anything of value, Gomwe told NewZimbabwe.com.\n\nPolice attended the scene but until the time of publishing, no suspect had been arrested.\n\nHowever, Gomwe is convinced the attack was politically-motivated.\n\nThis is clearly the work of fellow Zanu PF comrades who want to silence me because l have been vocal in resisting the 2030 agenda to have President Emmerson Mnangagwas term extended beyond 2028. I am taking that stance because l am a constitutionalist, said Gomwe, who insists he is still a Zanu PF member despite a recent Politburo decision to expel him.\n\nI was never served with a charge sheet nor given an opportunity to respond to the allegations. Also, the expulsion was never formally communicated to me, l only learnt about it through social media and the very same people pushing for my expulsion were the ones behind the attack at my home.\n\nLosers from the 2023 elections such as Ziyambi and others were allegedly angered by those pushing back calls for Mnangagwa to perpetuate his rule, Gomwe opined.\n\nIndividuals who lost elections and went on to benefit from President Mnangagwas appointments are the ones agitating for him to cling to power, which l personally disagree with, he added.\n\nIn a public statement, Gomwe noted that the recent attack at his homestead would not shake his resolve to ensure Zanu PF observes the party and national constitutions.\n\nI stand unwavering and unshaken by the recent vandalism incident at my rural homestead in Zvimba. This cowardly and barbaric act will not intimidate me, nor will it deter our collective march towards a brighter future.\n\nThe damaged car\n\nSuch acts of violence and intimidation only serve to expose the desperation and fear of those who seek to undermine our progress, he wrote.\n\nLet me be clear: these tactics will not succeed. The revolution that seeks to emancipate our people and bring us to greater heights will not be stopped by senseless acts of destruction.\n\nTo the perpetrators, you will face the full wrath of the law. Justice will be served, and you will be held accountable for your actions.\n\nTo my fellow comrades, let us stand strong and united in the face of such cowardice. Let us continue to push forward, undeterred, towards a future that is brighter, more just, and more equal for all. Aluta continua.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/22065322/IMG-20250321-WA0015.jpg",
            "description": "<p>By Staff Reporter  PROPERTY belonging to a Zanu PF member was Thursday destroyed by suspected fellow party activists during a nocturnal raid in Zvimba, Mashonaland West province, as intra-party violence escalates in the ruling establishment. Gifford Gomwe had his vehicle and house destroyed for allegedly bravely coming out to vociferously resist President Emmerson Mnangagwa’s supporters’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/suspected-zanu-pf-thugs-destroy-car-house-belonging-to-party-member-opposed-to-mnangagwas-2030-agenda/\">Suspected Zanu PF thugs destroy car, house belonging to party member opposed to Mnangagwa’s 2030 agenda</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Fugitive Blessed Geza’s YouTube post dressed in military uniform riles Zimbabwe Defence Forces",
            "url": "https://www.newzimbabwe.com/fugitive-blessed-gezas-youtube-post-dressed-in-military-uniform-riles-zimbabwe-defence-forces/",
            "content": "By Staff Reporter\n\nZIMBABWEs military has, in a rare show of power and authority, come out to denounce individuals either wearing military fatigue or pretending to be part of the army.\n\nThis follows the appearance of disgruntled war veteran Blessed Geza in full army uniform in a video posted last weekend that has been shared widely.\n\nGeza is the man who has been calling for the immediate resignation of President Emmerson Mnangagwa and on the police to deal with his associates whom he accuses of grand corruption.\n\nThe video, which has now been posted on numerous channels, has him calling for a March 31 mass protest that is expected to force out Mnangagwa who still has to serve three years of his second term.\n\nGezas motivation has been Mnangagwas attempts to disrespect the Constitution by having it amended to his benefit. Sections within the party want him to hang on until 2030 despite the Constitution declaring that he should vacate office in 2028 after two terms in office.\n\nThis, argues Geza, is wrong, unfair, corrupt and the reason why Zimbabwes army is backing his deputy Constantino Chiwenga to take over, in factional fights bedeviling the ruling party.\n\nThe Zimbabwe Defence Forces further note with concern, the continued misuse of military uniform by some members of the public, reads the statement.\n\nThe public is advised that according to the Defence Act (Chapter 11:02), the abuse of military uniform is an offence which prohibits and criminalises the wearing of military uniform by individuals who are not members of the Defence Forces.\n\nAny person who without authority wears or uses any decoration supplied to or authorised for use by any member of the Defence Forces or other military forces or any decoration so nearly resembling such decoration as to be likely to deceive shall be guilty of an offence.\n\nMembers of the public are therefore urged to desist from acquiring or wearing any items of military uniform or apparel resembling such. Those caught on the wrong side of the law will be prosecuted.\n\nMembers of the public are also urged to report to the Zimbabwe Republic Police or the Zimbabwe Military Police any persons seen wearing military uniforms outside cantonment and other designated areas, or those committing crimes on the pretext that they are members of the Zimbabwe Defence Forces.\n\nDespite the statement, Geza, who is on the polices wanted list on charges of inciting violence and undermining the authority of the president, is widely believed to be enjoying the security and support of Zimbabwes army.\n\nHe is widely believed to be pushing an agenda whose interests are in sync with the armys, the installment of Chiwenga as President.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18200459/Screenshot-2025-03-18-at-22.03.06.png",
            "description": "<p>By Staff Reporter ZIMBABWE’s military has, in a rare show of power and authority, come out to denounce individuals either wearing military fatigue or pretending to be part of the army. This follows the appearance of disgruntled war veteran Blessed Geza in full army uniform in a video posted last weekend that has been shared</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/fugitive-blessed-gezas-youtube-post-dressed-in-military-uniform-riles-zimbabwe-defence-forces/\">Fugitive Blessed Geza’s YouTube post dressed in military uniform riles Zimbabwe Defence Forces</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Axia Corporation bemoans US$2,28 million exchange rate linked losses",
            "url": "https://www.newzimbabwe.com/axia-corporation-bemoans-us228-million-exchange-rate-linked-losses/",
            "content": "By Alois Vinga\n\nLISTED retail and distribution concern, Axia Corporation has bemoaned the surging exchange rate related losses, a situation which the group said was further complicated by weakening demand due to company closures.\n\nPresenting the groups performance for the first half of 2025, the reputed company, which runs three operating business units, namely TV Sales & Home, Transerv and Distribution Group Africa described the operation as tough.\n\nThe company said the Zimbabwean trading environment in the first half of the financial year has been challenging for the formal retail sector, with several major retailers facing difficulties underscoring that the group which relies on an efficient route to market through formal retail channels was equally affected by the tough operating conditions.\n\nExchange rate stability remained a significant hurdle to the groups operations. The official exchange rate on local currency depreciated from 13.908 to the US Dollar at the beginning of the year, underwent an official devaluation by 43% on 27 September 2024, and further weakened by 7% to 31 December 2024.\n\nThese devaluations resulted in substantial financial losses amounting to US$2.287m being incurred for the Group especially on the ZWG Treasury Bill instruments arising from outstanding auction funds. Additionally, the downsizing and closure of some companies have further dampened effective demand across the economy, said Axia.\n\nDuring the period, Basic Earnings Per Share (EPS) and Headline Earnings Per Share (HEPS) were both 0.58 US cents, reflecting a 10% decline from the prior year. The Groups statement of financial position remained strong.\n\nThe net current asset position increased by US$4.489 million whilst borrowings declined marginally to close off at US$20.136 million.\n\nThe Group is confident that the tight monetary policy stance by the Reserve Bank of Zimbabwe shall persist into the near future and that the stability of the ZWG shall continue to contain inflation.\n\nThe policy measures by the Government to control the informal sector are anticipated to accelerate the recovery of the formal sector and spur demand for the Groups products. It is the Groups responsibility to sell products at affordable prices to consumers and distribute them efficiently, added Axia.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/22053204/TV-Sales-Home-Gwanda-branch.-680x351-1.webp",
            "description": "<p>By Alois Vinga LISTED retail and distribution concern, Axia Corporation has bemoaned the surging exchange rate related losses, a situation which the group said was further complicated by weakening demand due to company closures. Presenting the group’s performance for the first half of 2025, the reputed company, which runs  three operating business units, namely TV</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/axia-corporation-bemoans-us228-million-exchange-rate-linked-losses/\">Axia Corporation bemoans US$2,28 million exchange rate linked losses</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Coventry confirms she is quitting post as Sports minister",
            "url": "https://www.newzimbabwe.com/coventry-confirms-she-is-quitting-post-as-sports-minister/",
            "content": "By Sports Reporter\n\nNEWLY-elected International Olympics Committee (IOC) president Kirsty Coventry says she is stepping down as Zimbabwes Minister of Sports, Recreation, Arts and Culture to fully focus on her new office.\n\nCoventry confirmed this during a press conference Friday following her victory a day earlier.\n\nThe 41-year-old sports personality is expected to spend the larger part of her time in Lausanne, Switzerland, where the IOC is headquartered.\n\nResponding on her future regards to how she will manage the two posts, Coventry confirmed she will be resigning as Zimbabwes Sports minister.\n\nRight now l want to go and thank everybody for supporting me.I will be moving to Lausanne and of course l need to have a conversation with my President first.\n\nThere is no way l will do both. They knew and they were supportive of me running this campaign.\n\nI believe they might be a bit sad to say good bye, but at the same time they are proud of me, said Coventry.\n\nCoventry is Africas most celebrated Olympian with seven medals to her name , that is two golds, four silvers and one bronze.\n\nThe new IOC president remains an iconic figure in Zimbabwes sports history as she won seven of the eight medals that Zimbabwe has scooped at the Olympics.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30022211/Kirsty-Coventry.jpeg",
            "description": "<p>By Sports Reporter NEWLY-elected International Olympics Committee (IOC) president Kirsty Coventry says she is stepping down as Zimbabwe’s Minister of Sports, Recreation, Arts and Culture to fully focus on her new office. Coventry confirmed this during a press conference Friday following her victory a day earlier. The 41-year-old sports personality is expected  to spend the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/coventry-confirms-she-is-quitting-post-as-sports-minister/\">Coventry confirms she is quitting post as Sports minister </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Doctors demand urgent action to address health crisis at Sally Mugabe hospital",
            "url": "https://www.newzimbabwe.com/doctors-demand-urgent-action-to-address-health-crisis-at-sally-mugabe-hospital/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Association of Doctors for Human Rights (ZADHR) has criticized the governments response to the crisis at Sally Mugabe Hospital, stating that it lacks urgency and specificity.\n\nNurses at the hospital, staged a protest Monday over poor salaries and poor working conditions, including the lack of basic amenities such as electricity and running water.\n\nIn response, the Ministry of Health and Child Care announced plans to address their grievances, which included water availability, elevator upgrades, adding a second staff bus, improved accommodation and cafeteria services and steps to resolve medical sundries supplies.\n\nHowever, ZADHR condemned the governments approach, arguing that it is not acting swiftly enough to resolve the urgent matter.\n\nWe are concerned that the response lacks urgency and specificity. While plans to repair water tanks and elevators are necessary, they fail to address the immediate crisis.\n\nThere is no clear timeline for resolving power and water shortages, nor any commitment to ensuring adequate medical supplies and improved working conditions for healthcare professionals.\n\nZADHR calls on the government to take swift and decisive action, including immediate restoration of electricity and water supply at Sally Mugabe Central Hospital to prevent further disruption of critical healthcare services, transparency and accountability in the Ministrys response, with clear timelines for addressing infrastructure failures and shortages and urgent investment in healthcare workers through fair remuneration, safe working conditions, and non-retaliation against those who voice legitimate concerns, ZADHR said in a statement Friday.\n\nZADHR also warned that ignoring these issues would further escalate the public health crisis, putting lives at risk and weakening trust in Zimbabwes healthcare system.\n\nFailure to address these concerns will only deepen the public health crisis, endanger lives, and further erode confidence in Zimbabwes healthcare system, ZADHR added.\n\nThe status quo at Sally Mugabe Hospital reflects broader issues across Zimbabwes public health sector, with conditions in rural hospitals even worse.\n\nZimbabwes healthcare sector remains severely underfunded and largely dependent on support from Western development partners.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/18171916/sally-mugabe-nurses.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Association of Doctors for Human Rights (ZADHR) has criticized the government’s response to the crisis at Sally Mugabe Hospital, stating that it lacks urgency and specificity. Nurses at the hospital, staged a protest Monday over poor salaries and poor working conditions, including the lack of basic amenities such as electricity</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/doctors-demand-urgent-action-to-address-health-crisis-at-sally-mugabe-hospital/\">Doctors demand urgent action to address health crisis at Sally Mugabe hospital</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "New IOC president Kirsty Coventry can meet expectations, says Thomas Bach",
            "url": "https://www.newzimbabwe.com/new-ioc-president-kirsty-coventry-can-meet-expectations-says-thomas-bach/",
            "content": "By AFP\n\nZIMBABWEAN Kirsty Coventry, the first African president of the International Olympic Committee (IOC) can even exceed the expectations of the continent, said her predecessor Thomas Bach on Friday.\n\nCoventry (41) became the most powerful single figure in sport after sweeping aside her six rivals in the first round of voting on Thursday. She is also the first woman to lead the Olympic movement.\n\nSwimming great Coventry  who won seven of Zimbabwes eight Olympic medals, two of them gold  has always been hurt by suggestions that she does not fully represent Zimbabwe or Africa because she is white.\n\nI was born there, she said in January. My mother was born there. My grandmother was born there. I have no links to any other country other than Zimbabwe.\n\nHence expectations are high that during her eight-year term Coventry will not only be a standard bearer for Africa itself, but that an African city could be named host of an Olympics for the first time.\n\nBach said he could not speak about the hosting possibility but he had full confidence in his successor fulfilling expectations.\n\nShe is used to living with them (expectations), said Bach in a press conference after the IOC session ended.\n\nIt helps having been an athlete, you know how to deal with high expectations and to know expectations are only a pressure if its your own expectations.\n\nIf you have a clear compass, and this is what she has, then I have no doubt she can cope with these expectations and can even exceed these expectations Africa might have in her.\n\nAs Bach prepares to end his 12-year tenure  he hands over officially on June 24  he will remain honorary president but he insisted he will not be a phantom presence hanging around Olympic House in Lausanne.\n\nBattling the weight\n\nThe 71-year-old German  who is widely believed to have favoured Coventrys candidacy from the start  said he will hold meetings with his successor and if they differ over decisions it will be hers which prevails.\n\nIt depends greatly on the president elect and new president, he said.\n\nShe of course will have priority to decide. I think it would not be fair at the very beginning the old guy be hanging around.\n\nAsked what the future held for him, Bach said he was looking forward to watching sport without the responsibility of worrying about what went on on and off the pitch.\n\nFor me sport is still pretty competitive. I have been thinking about golf but having seen many of my friends playing golf and all of a sudden nothing else in their mind.\n\nYou could spend a very inspiring evening with them and ask what it was like the ninth hole and you would not speak for the rest of the evening!\n\nLets see, there will be endurance running around in the mountains, doing something for battling the weight and enjoying nature.\n\nHis first wish, though, is for a dream to be fulfilled.\n\nFirst of all attend the Champions League final in Munich on May 31 and hope Bayern wins finally at home.\n\nReal Madrid wont even make it to the final, he chortled, addressing a reporter who is a Real fan.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20181137/kirsty-IOC-scaled.jpeg",
            "description": "<p>By AFP ZIMBABWEAN Kirsty Coventry, the first African president of the International Olympic Committee (IOC) can “even exceed the expectations” of the continent, said her predecessor Thomas Bach on Friday. Coventry (41) became the most powerful single figure in sport after sweeping aside her six rivals in the first round of voting on Thursday. She</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/new-ioc-president-kirsty-coventry-can-meet-expectations-says-thomas-bach/\">New IOC president Kirsty Coventry can meet expectations, says Thomas Bach</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "‘l have not been in dialogue with anyone’— Chamisa denies Geza’s claims over roping him in planned protests",
            "url": "https://www.newzimbabwe.com/l-have-not-been-in-dialogue-with-anyone-chamisa-denies-gezas-claims-over-roping-him-on-planned-protests/",
            "content": "By Staff Reporter\n\nFORMER Citizens Coalition for Change (CCC) president and stalwart of the opposition, Nelson Chamisa, has denied any agreement with the outspoken and now expelled Zanu PF Central Committee member, Blessed Runesu Geza.\n\nThe key opposition figure in Zimbabwean politics is distancing himself from Gezas push against President Emmerson Mnangagwas hyped 2030 agenda and the mass protests planned for March 31, 2025.\n\nGeza, who has been in hiding for weeks after police announced he was a wanted person, made his address to the nation Tuesday evening from an undisclosed location via YouTube.\n\nIn it, he dropped names of several opposition figures, including Chamisa, former Finance Minister Tendai Biti, and Job Sikhala.\n\nGeza claimed these influential opposition activists had agreed to get behind the protests, which aims to get Mnangagwa out of office as soon as possible.\n\nHowever, Chamisa himself  who is opposed to Mnangagwa extending his term beyond 2028 and has repeatedly urged the Zanu PF leader to stand down and allow fresh blood to take Zimbabwe forward  has said while his door is open for constructive dialogue with anyone, he has not been involved in any discussions about recent events, including the call for protests against the 82-year-old President.\n\nI want to clarify that my door is always open to speak with anyone who reaches out to me for constructive conversations and nation building, but I have not been involved in recent dialogues with anyone. I do not want to be made the focal point of things that have nothing to do with me, Chamisa wrote on X Friday.\n\nIn his address, Geza condemned the arrest and imprisonment of opposition leaders like Senator Jameson Timba and Job Sikhala as unwarranted.\n\nThis was perhaps a canny move, calculated to win their support in the push to block Mnangagwas potential presidential term limit beyond 2028.\n\nGeza, a former intelligence operative, even suggested that opposition politicians are also backing Retired General Constantino Chiwengas bid to take over from Mnangagwa.\n\nWe have spoken with all political players. The likes of Chamisa, Sikhala, Biti, Komichi and Mwonzora. We did not leave anyone behind. We have agreed the way forward. And among all these people, no one does not like Chiwenga, Geza said.\n\nWhile Gezas utterances hold a legitimate cause to free Zimbabweans from a possible dynasty, they have stirred controversy.\n\nMany on social media are warning that the opposition should not be taken for a ride by the fractured ruling elite again, as they were in 2017 when they supported the military coup, only for Zanu PF to claim ownership of the birth of the Second Republic afterwards.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/01190356/MDC-leader-Nelson-Chamisa.jpg",
            "description": "<p>By Staff Reporter FORMER Citizens Coalition for Change (CCC) president and stalwart of the opposition, Nelson Chamisa, has denied any agreement with the outspoken and now expelled Zanu PF Central Committee member, Blessed Runesu Geza. The key opposition figure in Zimbabwean politics is distancing himself from Geza’s push against President Emmerson Mnangagwa’s hyped ‘2030 agenda’</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/l-have-not-been-in-dialogue-with-anyone-chamisa-denies-gezas-claims-over-roping-him-on-planned-protests/\">‘l have not been in dialogue with anyone’— Chamisa denies Geza’s claims over roping him in planned protests</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "Journalist Mhlanga denied bail on appeal by High Court",
            "url": "https://www.newzimbabwe.com/journalist-mhlanga-denied-bail-on-appeal-by-high-court/",
            "content": "By Mary Taruvinga\n\nAlpha Media Holdings (AMH) journalist Blessed Mhlanga has been denied bail on appeal by the High Court.\n\nHe is accused of transmitting informationinciting public violence following a press conference bywar veteran Blessed Geza.\n\nHe was denied bail by Magistrate Farai Gwitima, who ruled that if granted bail, Mhlanga was likely to interfere with witnesses who are his junior subordinates.\n\nThe magistrate also said his lawyers were trying to trivialize a huge offence by treating it lightly.\n\nGwitima said his release would trigger anarchy in Zimbabwe.\n\nMhlanga then mounted the present appeal, which was dismissed by the High Court.\n\nIn passing his ruling judge Justice Gibson Mandaza said the lower court was right in concluding that the journalist was likely to interfere with investigations.\n\nMandaza said there was no need to interfere with the lower courts ruling.\n\nMy view is that the appellant lost it when he took the prosecutions view as an attack on his profession.\n\nHe said everyone, including journalists, should know that no one is above the law.\n\nEveryone should know that they are supposed to practice their job within the confines of the law, the judge said, adding that the state was right when it said he transmitted inciting messages.\n\nMandaza said the finding that he transmitted inciting messages cannot be faulted, although it is accepted that he is not Heart and Soul TV.\n\nThe defence had argued that witnesses statements had not been recorded, so releasing Mhlanga would jeopardise investigations.\n\nChris Mhike, representing Mhlanga also said there was no violence following the publication.\n\nThe judge said the charge is about transmission.\n\nIt is not an essential element of the offence that violence should have occurred, he said.\n\nI therefore associate my sentiments with those of the court below that the statement would affect peace and tranquility. Such a finding based on the messages that were circulated cannot be faulted, Mandaza said.\n\nHe said to allege that Mhlanga is being punished for what Geza said was invalid.\n\nI pointed out for the umpteenth time that the charge is not that he uttered the words. The fact that the messages were uttered by Geza does not change the colour of the allegations, said the judge.\n\nMhike said other suspects get bail, and his clients case was not unique.\n\nApplicants should not equate themselves with other accused persons. The law does not say that, said the judge.\n\nMhike said the presumption of innocence still operated in his clients favour because he is yet to be convicted\n\nBut the judge said that what is debatable is that bail is not an absolute right.\n\nBail is not absolute. You cant just say I deserve the constitutions notions.\n\nIts a qualified privilege which can be denied or granted by the court depending on the circumstances as supported by the law.\n\nMhike had also said the magistrate failed to appreciate that Mhlanga handed himself to the police when it denied him bail.\n\nMandaza said this would have worked in favour of Mhlanga if he had been recorded as a flight risk.\n\nOn the issue of interference. He didnt deny that he was a senior reporter.\n\nSurely the prosecution and the police didnt invent his title.\n\nIf that title was anything to go by, it would mean that the appellant wields significant power at HSTV, the judge said.\n\nOn the issue of public security, Mandaza said the court should take it upon itself to weigh the interests of an accused and that of the law to determine the issues of bail.\n\nThere was nothing amiss in the findings by the court aquo that the release of the appellant will undermine peace and security, the judge said.\n\nGiven the above, I have no doubt that the argument by the applicant that the finding of the magistrate was a misdirection is without merit and must be dismissed.\n\nThe ground of appeal should be dismissed. Most of the issues brought up are triable issues. It is my view there was a proper exercise of discretion in denying the appellant bail by the court aquo.\n\nMy conclusion is that .I did not find any misdirection by the court aquo. The appeal cannot succeed, and in the end, the decision of this court is that the appeal of the appellant against the magistrate be and is hereby dismissed in its entirety. Accordingly, this application is dismissed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26003108/InShot_20250225_165102005-scaled-e1741780334367.jpg",
            "description": "<p>By Mary Taruvinga Alpha Media Holdings  (AMH) journalist Blessed Mhlanga has been denied bail on appeal by the High Court. He is accused of transmitting information inciting public violence following a press conference by war veteran Blessed Geza. He was denied bail by Magistrate Farai Gwitima, who ruled that if granted bail,  Mhlanga was likely to interfere</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/journalist-mhlanga-denied-bail-on-appeal-by-high-court/\">Journalist Mhlanga denied bail on appeal by High Court</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        },
        {
            "title": "London’s Heathrow airport shuts after fire causes power outage",
            "url": "https://www.newzimbabwe.com/londons-heathrow-airport-shuts-after-fire-causes-power-outage/",
            "content": "Al Jazeera\n\nThe United Kingdoms Heathrow airport has closed until midnight on Friday due to a power outage, throwing the plans of tens of thousands of travellers into chaos.\n\nLondons main airport, which is Europes busiest gateway, said on Friday that it had suffered a significant power failure due to a fire at an electrical substation supplying the facility.\n\nTo maintain the safety of our passengers and colleagues, Heathrow will be closed until 23h59 on 21 March, Heathrow airport said in a post on X.\n\nPassengers are advised not to travel to the airport and should contact their airline for further information. We apologise for the inconvenience.\n\nFlight tracking website FlightRadar24 said the shutdown would affect at least 1,351 flights.\n\nThere were 120 aircraft in the air set to be diverted to alternate airports or return to their origin at the time of the announcement, according to FlightRadar24.\n\nWere trying to stop passengers from travelling to the airport, and then work with airline partners on flights that are delayed, diverted, or cancelled, a Heathrow spokesperson told Al Jazeera.\n\nThey [passengers] can reach out to airline partners to work on rebooking.\n\nHeathrow is one of the most globally connected airports and regularly ranks among the top five busiest gateways worldwide.\n\nThe airport serves more than 200 destinations in nearly 90 different countries and territories, and last year handled nearly 84 million passengers, the largest number on record.\n\nThe true impact of the closure only began to emerge hours after the announcement as the earliest flights depart from Heathrow at 06:00 GMT.\n\nAs the UK began to wake up early on Friday morning, the ripples of the closure were starting to be felt across Asia.\n\nSingapores Changi airport said in a statement that passengers should check with their airline about the status of upcoming flights.\n\nFootage shared on social media showed an inferno several stories high, lighting up the night sky and emitting massive plumes of black smoke.\n\nThe London Fire Brigade said that it had deployed 10 engines and about 70 firefighters to a fire at an electrical substation near the airport in Hayes, west London.\n\nThis is a highly visible and significant incident, and our firefighters are working tirelessly in challenging conditions to bring the fire under control as swiftly as possible, Assistant Commissioner Pat Goulbourne said in a statement.\n\nThe fire has caused a power outage affecting a large number of homes and local businesses, and we are working closely with our partners to minimise disruption. Firefighters have led 29 people to safety from neighbouring properties, and as a precaution, a 200-metre cordon has been established, with around 150 people evacuated.\n\nGoulbourne said the fire would be a prolonged incident, with crews to remain on scene throughout the night.\n\nAs we head into the morning, disruption is expected to increase, and we urge people to avoid the area wherever possible, he said.\n\nDue to the significant amount of smoke, we strongly advise local residents to keep their windows and doors closed.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/21065347/heathrow.jpg",
            "description": "<p>Al Jazeera The United Kingdom’s Heathrow airport has closed until midnight on Friday due to a power outage, throwing the plans of tens of thousands of travellers into chaos. London’s main airport, which is Europe’s busiest gateway, said on Friday that it had suffered a “significant” power failure due to a fire at an electrical</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/londons-heathrow-airport-shuts-after-fire-causes-power-outage/\">London’s Heathrow airport shuts after fire causes power outage</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:07",
            "date": "22 Mar 2025"
        }
    ]
}