{
    "news": [
        {
            "title": "JUST IN: Sables qualify for 2027 Rugby World Cup after winning continental trophy",
            "url": "https://www.newzimbabwe.com/just-in-sables-qualify-for-2027-rugby-world-cup-after-winning-continental-trophy/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens rugby team has beaten Namibia 30-28 to win the 2025 Rugby Africa Cup at Nelson Mandela Stadium in Uganda.\n\nThe trophy comes with a ticket to the Australia 2027 Rugby World Cup for the Sables, who defended their title after winning it last year again.Zimbabwes qualification to the World Cup saw them ending a 34-year jinx, the last time they played at the World Cup was in 1991.So heart breaking was the defeat for Namibia, who have never failed to qualify for a World Cup tournament since 1998.Zimbabwe now boast of three Rugby Africa Cup trophies in history since their debut win in 2012.\n\nThe trophy comes with a ticket to the Australia 2027 Rugby World Cup for the Sables, who defended their title after winning it last year again.\n\nZimbabwes qualification to the World Cup saw them ending a 34-year jinx, the last time they played at the World Cup was in 1991.So heart breaking was the defeat for Namibia, who have never failed to qualify for a World Cup tournament since 1998.Zimbabwe now boast of three Rugby Africa Cup trophies in history since their debut win in 2012.\n\nZimbabwes qualification to the World Cup saw them ending a 34-year jinx, the last time they played at the World Cup was in 1991.\n\nSo heart breaking was the defeat for Namibia, who have never failed to qualify for a World Cup tournament since 1998.Zimbabwe now boast of three Rugby Africa Cup trophies in history since their debut win in 2012.\n\nSo heart breaking was the defeat for Namibia, who have never failed to qualify for a World Cup tournament since 1998.\n\nZimbabwe now boast of three Rugby Africa Cup trophies in history since their debut win in 2012.\n\nZimbabwe now boast of three Rugby Africa Cup trophies in history since their debut win in 2012.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/19165420/IMG-20250719-WA0058.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s rugby team has beaten Namibia 30-28 to win the 2025 Rugby Africa Cup at Nelson Mandela Stadium in Uganda. The trophy comes with a ticket to the Australia 2027 Rugby World Cup for the Sables, who defended their title after winning it last year again. Zimbabwe’s qualification to the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/just-in-sables-qualify-for-2027-rugby-world-cup-after-winning-continental-trophy/\">JUST IN: Sables qualify for 2027 Rugby World Cup after winning continental trophy </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "19 Jul 2025"
        },
        {
            "title": "Man killed in yet another train accident",
            "url": "https://www.newzimbabwe.com/man-killed-in-yet-another-train-accident/",
            "content": "By Staff Reporter\n\nAN unidentified Chinhoyi man was killed after being run over by a train on Friday evening, becoming the latest statistic of fatalities on the countrys deadly rail tracks.\n\nThe National Railways of Zimbabwe (NRZ) confirmed the tragic incident in a brief statement.\n\nAn unidentified man died today after being run over by a train in Chinhoyi.\n\nThe accident occurred at Chinhoyi station at 1606 hours.The man had no identity particulars on him, NRZ said.\n\nThe latest tragedy on the rail tracks comes on the back of numerous other related mishaps across the country in recent weeks.\n\nThe NRZ is concerned that people continue to be run over by trains on its railway tracks.\n\nWe appeal to members of the public to be vigilant while walking close to railway tracks to avoid such incidents, the company said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/11032208/NRZ-train-1.jpg",
            "description": "<p>By Staff Reporter  AN unidentified Chinhoyi man was killed after being run over by a train on Friday evening, becoming the latest statistic of fatalities on the country’s deadly rail tracks. The National Railways of Zimbabwe (NRZ) confirmed the tragic incident in a brief statement. “An unidentified man died today after being run over by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-killed-in-yet-another-train-accident/\">Man killed in yet another train accident </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "19 Jul 2025"
        },
        {
            "title": "Africa emerges strategic ‘testing ground’ for China’s currency ambitions",
            "url": "https://www.newzimbabwe.com/africa-emerges-strategic-testing-ground-for-chinas-currency-ambitions/",
            "content": "By Business Insider\n\nCHINAS push to globalize its currency, the yuan, is gaining traction in Africa, with the continent emerging as a strategic testing ground for Beijings broader de-dollarization ambitions.\n\nIn a recent milestone, the central banks of China and Egypt signed a series of agreements to increase yuan use in bilateral trade and investment.\n\nThe deals, signed during Chinese Premier Li Qiangs visit to Cairo last week, were praised by Peoples Bank of China governor Pan Gongsheng as a key step in advancing economic ties between the two countries.\n\nKey provisions include electronic payment cooperation such as expanding Chinas UnionPay system in Egypt, and enabling cross-border yuan-denominated transactions for banks operating in the China-Egypt TEDA Suez Economic and Trade Cooperation Zone.\n\nThese financial operations will be processed through the Cross-border Interbank Payment System (CIPS), Chinas alternative to the SWIFT network, thereby reducing reliance on Western financial systems.\n\nWith this development, Egypt now joins a growing list of African nations, including South Africa, Nigeria, and Angola, that are actively incorporating the yuan into their trade and financial dealings with China.\n\nChinas growing currency ambition in Africa\n\nThe expansion of the yuan across Africa is part of Chinas broader strategy to challenge the dominance of the U.S. dollar.\n\nThis move aligns with the continents gradual shift away from Western financial systems toward a China-Russia-led coalition under BRICS, reflecting a strategic effort to diversify trade and currency frameworks.\n\nChina-Africa trade reached $282 billion in 2023, cementing Chinas 15-year run as the continents top trading partner. The surge has boosted renminbi use in cross-border deals and reserve holdings.\n\nBeyond Egypt, where the central banks recently signed agreements to deepen yuan usage in trade and investment, China has steadily advanced its currency diplomacy across Africa.\n\nAs early as 2015, South Africa signed a 30 billion yuan swap deal to improve trade liquidity. The South African Reserve Bank (SARB) explained that the three-year agreement was designed to facilitate trade and investment and serve as a buffer for short-term balance of payment pressures.\n\nEarlier this year, Nigeria and China renewed their bilateral currency swap deal valued at 15 billion yuan (3.19 trillion), three years after the initial agreement expired.\n\nThe Peoples Bank of China said the renewed three-year pact aims to promote bilateral trade and investment facilitation.\n\nIn Angola, a key oil supplier to China, the yuan is increasingly being used in energy and infrastructure transactions, with the Cross-Border Interbank Payment System (CIPS), Chinas alternative to SWIFT, being integrated into the financial system.\n\nLauren Johnston, a senior research fellow at the AustChina Institute and China-Africa expert, told the South China Morning Post that Africa offers a strategic testbed for Beijings currency goals.\n\nAfrica is a continent where trade with China is important, but it is also one where many countries struggle to access sufficient foreign currencies such as the euro or US dollar, she noted.\n\nJohnston added, For China, there may be a chance to test the internationalisation of the RMB via a few countries in Africa first, where volumes might be small on a global scale and Chinas footprint in the region relatively large.\n\nThese efforts mark a broader rebalancing of global financial influence, with China positioning the yuan as a viable alternative in Africas evolving economic landscape.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/18171433/R.png",
            "description": "<p>By Business Insider  The adoption of the yuan aligns with Africa’s shifts towards non-Western financial systems. Africa serves as a strategic region for testing China’s currency internationalization efforts. CHINA’S push to globalize its currency, the yuan, is gaining traction in Africa, with the continent emerging as a strategic testing ground for Beijing’s broader de-dollarization ambitions.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/africa-emerges-strategic-testing-ground-for-chinas-currency-ambitions/\">Africa emerges strategic ‘testing ground’ for China’s currency ambitions</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "19 Jul 2025"
        },
        {
            "title": "Sables coach bullish ahead of Rugby Africa Cup final against Namibia",
            "url": "https://www.newzimbabwe.com/sables-coach-bullish-ahead-of-rugby-africa-cup-final-against-namibia/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens rugby team, the Sables, will this Saturday evening face Namibia in the 2025 Rugby Africa Cup final at Nelson Mandela Stadium in Uganda.\n\nThe match is more than just a final as it comes with a 2027 Rugby World Cup ticket for the winner.The Sables road to Saturdays final has been convincing, starting off with a 43-9 win over Morocco in the quarter finals before beating old rivals Kenya 29-23 in the semi-finals.Namibia has never failed to qualify for a Rugby World Cup since 1999. However, Sables coach Piet Benade is not reading much into that ahead of this penultimate encounter.It is entirely up to us to step up and challenge a team that has been to the World Cup.They havent lost in a World Cup qualifier in 30 yearsand its our job tomorrow to take that away from them, Benade said.With a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\nThe match is more than just a final as it comes with a 2027 Rugby World Cup ticket for the winner.\n\nThe Sables road to Saturdays final has been convincing, starting off with a 43-9 win over Morocco in the quarter finals before beating old rivals Kenya 29-23 in the semi-finals.Namibia has never failed to qualify for a Rugby World Cup since 1999. However, Sables coach Piet Benade is not reading much into that ahead of this penultimate encounter.It is entirely up to us to step up and challenge a team that has been to the World Cup.They havent lost in a World Cup qualifier in 30 yearsand its our job tomorrow to take that away from them, Benade said.With a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\nThe Sables road to Saturdays final has been convincing, starting off with a 43-9 win over Morocco in the quarter finals before beating old rivals Kenya 29-23 in the semi-finals.\n\nNamibia has never failed to qualify for a Rugby World Cup since 1999. However, Sables coach Piet Benade is not reading much into that ahead of this penultimate encounter.It is entirely up to us to step up and challenge a team that has been to the World Cup.They havent lost in a World Cup qualifier in 30 yearsand its our job tomorrow to take that away from them, Benade said.With a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\nNamibia has never failed to qualify for a Rugby World Cup since 1999. However, Sables coach Piet Benade is not reading much into that ahead of this penultimate encounter.\n\nIt is entirely up to us to step up and challenge a team that has been to the World Cup.They havent lost in a World Cup qualifier in 30 yearsand its our job tomorrow to take that away from them, Benade said.With a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\nIt is entirely up to us to step up and challenge a team that has been to the World Cup.\n\nThey havent lost in a World Cup qualifier in 30 yearsand its our job tomorrow to take that away from them, Benade said.With a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\nThey havent lost in a World Cup qualifier in 30 yearsand its our job tomorrow to take that away from them, Benade said.\n\nWith a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\nWith a defending champion tag on their back, Zimbabwe walks into Saturdays match hoping to win so as to qualify for Rugby World Cup since 1991.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/08213955/sables-morocco.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s rugby team, the Sables, will this Saturday evening face Namibia in the 2025 Rugby Africa Cup final at Nelson Mandela Stadium in Uganda. The match is more than just a final as it comes with a 2027 Rugby World Cup ticket for the winner. The Sables’ road to Saturday’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sables-coach-bullish-ahead-of-rugby-africa-cup-final-against-namibia/\">Sables coach bullish ahead of Rugby Africa Cup final against Namibia</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:41",
            "date": "19 Jul 2025"
        }
    ]
}