{
    "news": [
        {
            "title": "US releases incriminating human rights rap sheet on Zimbabwe – says government not doing anything to bring perpetrators to task",
            "url": "https://www.newzimbabwe.com/us-releases-incriminating-human-rights-rap-sheet-on-zimbabwe-says-government-not-doing-anything-to-bring-perpetrators-to-task/",
            "content": "By Leopold Munhende\n\nTHE United States Department of State has released a damning report on Zimbabwes human rights situation, noting how perpetrators have gone unpunished and the increased abuse of journalists by the state.\n\nZimbabwe has, for close to three decades, failed to respect basic human rights, an issue that has put it at loggerheads with world leaders such as America, the United Kingdom (UK) and the rest of Europe.\n\nCases of state-sponsored abductions, violence and targeting of dissenting voices, mainly opposition politicians, human rights defenders and journalists, have dominated its record.\n\nThe report in question focuses on the year 2024.\n\nThere were no significant changes in the human rights situation in Zimbabwe during the year, reads the report.\n\nSignificant human rights issues included credible reports of: torture or cruel, inhuman, or degrading treatment or punishment; arbitrary arrest and detention; serious restrictions on freedom of expression and media freedom, including violence or threats of violence against journalists and censorship; trafficking in persons, including forced labor; significant restrictions on workers freedom of association; and significant presence of the worst forms of child labor.\n\nThe government did not take credible steps to identify and punish officials who committed human rights abuses.\n\nAlthough the absence of extrajudicial killings was noted, this can be best explained by the fact that 2024 was not an elective year, as was witnessed in 2023 when the country headed for local authority, parliamentary and presidential elections.\n\nFreedom of speech was, however, heavily inhibited according to the report, which was released just months after journalist Blessed Mhlanga was released from pretrial detention.\n\nAdds the report: Authorities were sensitive to criticism of the government, security officials, the president, and the ruling Zanu PF party.\n\nIn July 2023, the government amended the criminal code to introduce heavy penalties for citizens at home and abroad and permanent residents convicted of willfully injuring the sovereignty and national interest of Zimbabwe.\n\nCivil society organisations and human rights defenders reported the law continued to have a chilling effect on freedom of expression.\n\nZimbabwes poor record has been a major stumbling block for President Emmerson Mnangagwa in his attempts to re-engage with the West.\n\nHe is widely considered tainted, having not just been late President Robert Mugabes right-hand man for decades until his deposition, but having also played a central role in the Gukurahundi genocide that killed more than 20,000 mainly Ndebele-speaking people.\n\nThe government regularly used arbitrary arrest and detention as tools of intimidation and harassment, especially against opposition party members, political activists, civil society members, journalists, attorneys, and ordinary citizens asserting their rights, it reads.\n\nThe government launched a crackdown on government critics in the lead-up to the Southern Africa Development Community (SADC) Summit on August 17 in Harare. In June, police arrested 80 opposition activists after violently breaking up their meeting at a private residence.\n\nCivil servants poor working conditions were also noted, with failed attempts at dialogue illustrated by arrests of not just Zimbabwe National Students Union (ZINASU) leaders but also Amalgamated Rural Teachers Union (ARTUZ) officials.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/04155842/mnangagwa1.jpg",
            "description": "<p>By Leopold Munhende THE United States Department of State has released a damning report on Zimbabwe’s human rights situation, noting how perpetrators have gone unpunished and the increased abuse of journalists by the state. Zimbabwe has, for close to three decades, failed to respect basic human rights, an issue that has put it at loggerheads</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-releases-incriminating-human-rights-rap-sheet-on-zimbabwe-says-government-not-doing-anything-to-bring-perpetrators-to-task/\">US releases incriminating human rights rap sheet on Zimbabwe – says government not doing anything to bring perpetrators to task</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Aug 2025"
        },
        {
            "title": "Elite school locks horns with Chinese firm over cement plant near campus, blasts EMA for dubious approval despite health risks",
            "url": "https://www.newzimbabwe.com/elite-school-locks-horns-with-chinese-firm-over-cement-plant-near-campus-blasts-ema-for-dubious-approval-despite-health-risks/",
            "content": "By Mary Taruvinga\n\nA bitter showdown has erupted between Bryden Country School in Chegutu and Chinese-owned Shuntai Cement, after the company pushed ahead with building a lime and cement factory just 497 metres from the schools boundary despite a High Court order to stop operations.\n\nThe elite school accuses Shuntai of endangering pupils health with toxic dust, noxious fumes and noise pollution, while cornering the Environmental Management Agency (EMA) for issuing an Environmental and Social Impact Assessment (ESIA) certificate that allegedly ignored glaring health and zoning violations.\n\nIn a letter addressed to parents dated August 16 2025 gleaned by NewZimbabwe.com, it has emerged that on March 25, the High Court ordered Shuntai to suspend any activities at its Eastbourne, Chegutu site.\n\nTheChinesecompany pressed on with construction, including blasting and heavy machinery works, which parents say have already exposed children to hazardous dust and fumes.\n\nFrustrated, Bryden took Shuntai back to court, accusing the company of contempt of court.\n\nAlso, on 25 July, a High Court judge visited the site to determine for himself if Shuntai was in contempt of the first stop order.\n\nHis ruling in the current High Court order confirms this.\n\nThe school has also dragged EMA to court, accusing the regulator of rubber-stamping Shuntais ESIA report despite clear evidence that the project sits in an education zone with multiple institutions nearby, including Springs of Grace, Seventh Day Adventist Secondary School and a university.\n\nIn the letter to parents, Brydens chairperson of governors, A. Noor, said EMA only released the ESIA after a court order, but it was the same flawed report initially rejected.\n\nShuntai managed to wangle an ESIA certificate from EMA, suggesting they had addressed stakeholder concerns, of which they had not, Noor said.\n\nThe school has now appealed to parents to stand firm as the legal battle escalates.\n\nWe are not yet out of the woods as Shuntai is determined to proceed even against the ruling of the High Court of Zimbabwe, Noor warned. Forty-three years ago, parents came together to build this school, and today we are appealing for parents to stand united to defend it.\n\nThe dispute now awaits a decisive hearing before the Administrative Court and the Minister of Environment, but with construction still underway, Bryden says children remain at risk.\n\nIn the meantime, massive building has continued on site, and the school has been experiencing increased dust influx as well as fumes from burning of noxious material, as well as noise of heavy machinery and some blasting mainly experienced on the pool side of the school.\n\nThus, the school was compelled to go back to court to reinforce the first stop order, Noor said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18175033/bryden-scaled.png",
            "description": "<p>By Mary Taruvinga A bitter showdown has erupted between Bryden Country School in Chegutu and Chinese-owned Shuntai Cement, after the company pushed ahead with building a lime and cement factory just 497 metres from the school’s boundary despite a High Court order to stop operations. The elite school accuses Shuntai of endangering pupils’ health with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/elite-school-locks-horns-with-chinese-firm-over-cement-plant-near-campus-blasts-ema-for-dubious-approval-despite-health-risks/\">Elite school locks horns with Chinese firm over cement plant near campus, blasts EMA for dubious approval despite health risks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Aug 2025"
        },
        {
            "title": "ZimRights urges UN, International Community to step up support for women’s rights in Zimbabwe",
            "url": "https://www.newzimbabwe.com/zimrights-urges-un-international-community-to-step-up-support-for-womens-rights-in-zimbabwe/",
            "content": "By Thandiwe Garusa\n\nTHE Zimbabwe Human Rights Association (ZimRights) has called on the United Nations (UN) and the International Community to step up targeted support for local womens rights organisations and grassroots initiatives.\n\nThis follows the visit of the United Nations Working Group on Discrimination Against Women and Girls to Zimbabwe.\n\nThe group was reviewingthe progress made and challenges faced in promoting gender equality and ending discrimination against women and girls.\n\nConsultations, community engagements, and documentation gathered through womens forums across the country noted that women and girlsin Zimbabwe remain structurally disadvantaged across nearly all aspects of life .\n\nEconomic dependency remains a major barrier to womens autonomy and participation in both family and community life.\n\nWomen without access to income, land, or property are systematically excluded from decisions that directly affect their lives and are often rendered invisible in both private and public spheres.\n\nTo the UN and International Community, provide increased targeted technical and financial support to local womens rights organisations, including grassroots initiatives advancing civic participation, political engagement, and legal empowerment, ZimRights said.\n\nAnother key finding was that health care, a critical pillar of womens well-being and empowerment, remains in crisisas maternal deaths rise amid a failing health system, while poverty, school dropouts, and child marriages continue to block access to education and empowerment.\n\nMaternal and child health outcomes continue to deteriorate, particularly in rural and low-income urban areas.\n\nEducation, another key determinant of empowerment, remains out of reach for many girls. Poverty-induced school dropout continues unabated, and early and forced marriages, often driven by cultural and religious norms, further limit girls life choices.\n\nTo the UN and International Community, support independent civic education and electoral participation programs that equip women and girls with the tools to engage meaningfully in public life and facilitate capacity-building programs for law enforcement, the judiciary, and public officials on gender-sensitive governance and human rights-based approaches, ZimRights added.\n\nZimRights also urged the government of Zimbabwe to enforce stronger institutional accountability, prosecution of political violence against women, improved access to basic services, expanded support for survivors of gender-based violence, and stricter enforcement of child marriage laws to advance womens rights.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/10/28170936/Norton-women-e1635437392692.jpg",
            "description": "<p>By Thandiwe Garusa THE Zimbabwe Human Rights Association (ZimRights) has called on the United Nations (UN) and the International Community to step up targeted support for local women’s rights organisations and grassroots initiatives. This follows the visit of the United Nations Working Group on Discrimination Against Women and Girls to Zimbabwe. The group was reviewing the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimrights-urges-un-international-community-to-step-up-support-for-womens-rights-in-zimbabwe/\">ZimRights urges UN, International Community to step up support for women’s rights in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Aug 2025"
        },
        {
            "title": "UK Ambassador Vowles to headline historic Zimbabwe Achievers Awards in Harare",
            "url": "https://www.newzimbabwe.com/uk-ambassador-vowles-to-headline-historic-zimbabwe-achievers-awards-in-harare/",
            "content": "By Darlington Gatsi\n\nBRITISH Ambassador to Zimbabwe, Peter Vowles, will be the special guest and keynote speaker at the highly anticipated Zimbabwe Achievers Awards (ZAA) Diaspora Forum.\n\nThe two-day programme features the ZAA Diaspora Forum on 29 August at the Hyatt Regency Hotel and concludes with an awards gala on 30 August at Manna Resorts, Harare.\n\nThe awards ceremony will be the first instalment to be held in Zimbabwe, with several figures expected to be honoured at the glitz and glamour event.\n\nIn a bid to deepen the ties between Zimbabwe and Britain, Vowles will deliver a keynote address, which will touch on key aspects such as the role of the diaspora in driving inclusive and sustainable development opportunities for trade, investment, and entrepreneurship.\n\nVowles said the event will present a perfect platform to unlock opportunities between Zimbabwe and Britain.\n\nThe UK is committed to strengthening our partnership with Zimbabwe through constructive dialogue, sustainable investment, and deepening our rich people-to-people links. Events like the ZAA Diaspora Forum are vital platforms for building trust, fostering innovation, and unlocking shared prosperity, said Vowels.\n\nZAA aims to honour the countrys trailblazers who are leaving a mark in foreign lands, known as the diaspora.\n\nThe end-of-month event will mark the first time the awards have been held in Zimbabwe, with previous editions taking place in the United Kingdom, South Africa, Canada, and Australia.\n\nAnother layer of interest will be the launch of the book, The Zimbabwean Dream, written by ZAA founder Conrad Mwanza.\n\nMwanza said the presence of Vowles at the ZAA will serve as an important factor in steering diaspora progress.\n\nWe are honoured to welcome Ambassador Vowles to this landmark edition of ZAA. His presence underscores the importance of inclusive partnerships and diaspora-driven progress in shaping Zimbabwes future, said Mwanza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18165507/vowles_.png",
            "description": "<p>By Darlington Gatsi BRITISH Ambassador to Zimbabwe, Peter Vowles, will be the special guest and keynote speaker at the highly anticipated Zimbabwe Achievers Awards (ZAA) Diaspora Forum. The two-day programme features the ZAA Diaspora Forum on 29 August at the Hyatt Regency Hotel and concludes with an awards gala on 30 August at Manna Resorts,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/uk-ambassador-vowles-to-headline-historic-zimbabwe-achievers-awards-in-harare/\">UK Ambassador Vowles to headline historic Zimbabwe Achievers Awards in Harare</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Aug 2025"
        },
        {
            "title": "ZWG acceptance still a challenge – Hippo Valley",
            "url": "https://www.newzimbabwe.com/zwg-acceptance-still-a-challenge-hippo-valley/",
            "content": "By Alois Vinga\n\nLEADING sugar producer, Hippo Valley Estates Limited (HVEL) has decried the mismatch between the obtaining ZWG exchange rate stability and therejection ofthe unit across the markets.\n\nThe outcry comes on the back of stable exchange rates, which have maintained sanity since the September 2024 official devaluation of 43%. The two markets, official and parallel, have maintained a close range, hovering between ZWG28, 00 to a high of ZWG34, 00 against the greenback.\n\nBut presenting a trading update for the companys first quarter period, Hippo Valley said the local unit still faces acceptance challenges.\n\nWhile the ZWG currency has shown relative stability since the significant devaluation experienced at the end of September 2024, it faces significant challenges, particularly in gaining widespread acceptance.\n\nThe tight liquidity conditions that prevailed during the quarter and the currency mix dilemma when trading using the ZWG currency resulted in episodes of excess ZWG cash balances for the company and USD working capital challenges, with most suppliers of goods and services, particularly the informal sector, continuing to favor the USD currency due to perceived stability, the company said.\n\nThe sugar producer said that despite the first quarter ending with relatively stable exchange rates, input costs were elevated due to inflationary pressures and geopolitical tensions as global trade policies shifted.\n\nIn terms of operations, the first quarter sugar production period ended on a positive note, marked by a 15% increase in cane supply from the companys plantations (miller-cum-planter), attributed to the higher milling crushing season.\n\nAdditionally, cane quality improved from an Estimated Recoverable Crystal of 11,30% to 11,46%.\n\nDespite some minimal mill start-up challenges, the plant had impressive recoveries, after achieving a cane sugar ratio of 8.49 against the prior year of 8.50 and the target of 8.75. Private cane deliveries marginally dropped due to diversions to the Triangle mill after the start-up challenges referred to above, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/06044805/Hippo-Valley-Sugar-Estates.png",
            "description": "<p>By Alois Vinga LEADING sugar producer, Hippo Valley Estates Limited (HVEL) has decried the mismatch between the obtaining ZWG exchange rate stability and the rejection of the unit across the markets. The outcry comes on the back of stable exchange rates, which have maintained sanity since the September 2024 official devaluation of 43%. The two markets, official</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zwg-acceptance-still-a-challenge-hippo-valley/\">ZWG acceptance still a challenge – Hippo Valley</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Aug 2025"
        },
        {
            "title": "M23 rebels suspend peace talks with DR Congo government",
            "url": "https://www.newzimbabwe.com/m23-rebels-suspend-peace-talks-with-dr-congo-government/",
            "content": "BBC\n\nThe main rebel group in eastern Democratic Republic of Congo, the M23, has walked away from peace talks with the government, saying it will not return unless the authorities adhere to a previous ceasefire deal.\n\nFighting between the two sides escalated in January, when the M23 captured large parts of the mineral-rich east, including the regional capital Goma.\n\nIn Qatar last month, the rebels and the government signed a ceasefire agreement, intended as a step towards a permanent peace deal.\n\nBut on Monday, as negotiations were set to resume, the M23 said its representatives were not present in Qatar.\n\nM23 spokesperson Lawrence Kanyuka told the BBCs Great Lakes service that the Congolese government doesnt want peace.\n\nHe accused the authorities of not respecting the provisions contained in the ceasefire deal, but DR Congos military denies this charge.\n\nKanyuka alleged that government forces had continued to attack rebel positions, despite the agreement stating that both sides must refrain from assaults.\n\nHowever, the Congolese armed forces accused the M23 of launching attacks almost daily in the North Kivu and South Kivu provinces.\n\nThe Qatar peace deal was supposed to be signed by Monday.\n\nOn Sunday, an unnamed official from Qatar told the AFP news agency that a draft agreement had been shared with DR Congo and the M23.\n\nThe agreement runs alongside a peace deal between DR Congo and Rwanda, which was brokered by the US in June.\n\nDR Congo, the UN and numerous Western powers have accused Rwanda of backing the M23.\n\nDespite participating in the Washington peace talks, Rwanda has long denied the allegations against it.\n\nThe Washington peace deal, hailed by President Donald Trump as a glorious triumph,could grant the US access to DR Congos vast mineral wealth.\n\nHowever, it is the latest in a long line of failed peace deals in the region.\n\nDuring the ongoing conflict, thousands of people have been killed and hundreds of thousands of civilians forced from their homes, the UN says.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18183327/m23-.webp",
            "description": "<p>BBC The main rebel group in eastern Democratic Republic of Congo, the M23, has walked away from peace talks with the government, saying it will not return unless the authorities adhere to a previous ceasefire deal. Fighting between the two sides escalated in January, when the M23 captured large parts of the mineral-rich east, including</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/m23-rebels-suspend-peace-talks-with-dr-congo-government/\">M23 rebels suspend peace talks with DR Congo government</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:09",
            "date": "19 Aug 2025"
        }
    ]
}