{
    "news": [
        {
            "title": "Private Investigator Chidawa to further languish in jail as defence case drags on in theft case",
            "url": "https://www.newzimbabwe.com/private-investigator-chidawa-to-further-languish-in-jail-as-defence-case-drags-on-in-theft-case/",
            "content": "By Staff Reporter\n\nA former cop, Tafadzwa Chidawa will further languish in jail after he was remanded in custody while his defence case is dragging on.\n\nChidawa, popularly known as Kedha is currently locked up after his bail was cancelled for failing to appear in court for over a year.\n\nHe is jointly charged with Paradza Passmore Matubu, Perseverance Chisango, Malvern Mutanda, and Francis Takura on US$20,000 fraud allegations.\n\nMutanda isstill on the runand Takura is serving 36 yearsimprisonmentfor robberies.\n\nThe State alleges that the suspects stole US$20,000 from oneMelody Matanhire sometime in 2020.\n\nOn Monday,Chidawa took it to the witness stand to defend himself arguing that he knows nothing about the case.\n\nChidawa told regional magistrate Vongai Guwuriri that it is shocking that his particulars including his police officeridentification cards were found in Takuras car.\n\nChidawa told Muchuchuti that he only knows Takura as his former colleague at ZRP.\n\nTakura also exonerated Chidawa accusing the police of planting thedocuments in his car.\n\nI was arrested in the Central Business District but police drove my car to Highlands police station and I only signed a seizure for the vehicle because when they searched my carthey did not find anything.\n\nThe complainant ( Matanhire) was also tried for the same offence(theft) and she was sentenced.\n\nI never took US$20,000 which belongs to Matanhire, I dont know her and there is no proof to show that I met her, he said.\n\nHe also told the court that Matanhire lied to her husband of 21 years that the money was stolen when she was spending the money with her boyfriend.\n\nAccording to the State papers, Matanhire was in a relationship with Mutanda.\n\nThe court heard that on an unknown date in 2020, Matanhire told Mutanda that she had US$100,000 soiled money which needed some cleaning.\n\nMutanda allegedly told her that the process required US$20,000 in clean notes.\n\nOn August 27 2020, pursuant to the misrepresentation she advised Mutanda that she had managed to secure US$20 000, she then made arrangements with Mutanda to proceed to Blue Ridge Lodge where they were going to clean the money.\n\nUnbeknown to her Mutanda hatched a plan with Chidawa, Takura, Paradzai Matubu and Perseverance Chisango to steal from Melody.\n\nThe court heard that Matanharire handed over the money to Mutanda who then put it in a cooler box for the cleaning process to commence.\n\nAll other accomplices allegedly entered the lodge masquerading as police officers and manhandled Mutanda and took away the cooler box which had the money and they went away.\n\nThe hearing continues on Wednesday.\n\nTakudzwa Jambawu is prosecuting.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17153155/chidawa-e1739806340985.jpg",
            "description": "<p>By Staff Reporter A former cop, Tafadzwa Chidawa will further languish in jail after he was remanded in custody while his defence case is dragging on. Chidawa, popularly known as Kedha is currently locked up after his bail was cancelled for failing to appear in court for over a year. He is jointly charged with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/private-investigator-chidawa-to-further-languish-in-jail-as-defence-case-drags-on-in-theft-case/\">Private Investigator Chidawa to further languish in jail as defence case drags on in theft case </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Mnangagwa shoots down 2030 agenda; says he will “step aside” when his term ends",
            "url": "https://www.newzimbabwe.com/mnangagwa-shoots-down-2030-agenda-says-he-will-step-aside-when-his-term-ends/",
            "content": "By Darlington Gatsi\n\nPRESIDENT Emmerson Mnangagwa has shot down calls within the ruling party Zanu PFfor him to extend his rule beyond the constitutionally mandated two terms, insisting he will step down and not seek re-election.\n\nZANU PF is currently divided, with one faction advocating for the suspension of the 2028 elections to enable Mnangagwa to remain in power until 2030, while another faction insists on adhering to the constitutionally stipulated two-term limit.\n\nA faction believed to be backing Vice President Constantino Chiwenga is opposing the extension of Mnangagwas term limit.\n\nGovernment ministers have been vying for Mnangagwa to extend his rule beyond 2028, under the guise of completing his projects.\n\nAddressing editors from mainstream media outlets in Harare, Mnangagwa took a swipe at a section of supporters in Zanu PF who do not abide by the ethos of the party.\n\nI have my two terms, and these terms are very definite and I am so democratic, when they come to an end I will step aside and my party will elect a successor. That is clear as day.\n\nI think those who really are Zanu PF at the heart go by the rules in decorum of Zanu PF. We have other people who are in Zanu PF in themselves are not Zanu PF but they dress in the Zanu PF regalia. So we must always see when people talk and they see to which camp they belong as they open their mouths, said Mnangagwa.\n\nWe have people in ZANU PF who themselves are not ZANU PF President Emmerson Mnangagwa during a meeting with selected news editors.\n\nMnangagwa added that he will step down after completing his 2 terms.\n\nFollowhttps://t.co/iVVKatR4Q0WhatsApp Channel for news updates pic.twitter.com/U2jGaKzku0\n\n NewZimbabwe.com (@NewZimbabweCom)February 17, 2025\n\nMnangagwa has publicly insisted that he will not stand in the next elections, despite a resolution from Zanu PF to push for the amendment of the constitution.\n\nHowever, the sincerity of his public declaration is under scrutiny, as he has not rebuked or cracked down on the 2030 proponents within Zanu PF.\n\nFormer Citizens Coalition for Change (CCC) spokesperson, Fadzayi Mahere, said Mnangagwas declaration reeks of a public stunt.\n\nDoes he plan to cause any amendments to the Constitution? If his parliamentary super-majority changes the Constitution to extend his term, will he comply? This face-saving, word-twisting approbation and reprobation simply doesnt cut it, said Mahere.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/09/10141426/Mnangagwa.png",
            "description": "<p>By Darlington Gatsi PRESIDENT Emmerson Mnangagwa has shot down calls within the ruling party Zanu PF for him to extend his rule beyond the constitutionally mandated two terms, insisting he will step down and not seek re-election. ZANU PF is currently divided, with one faction advocating for the suspension of the 2028 elections to enable Mnangagwa</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-shoots-down-2030-agenda-says-he-will-step-aside-when-his-term-ends/\">Mnangagwa shoots down 2030 agenda; says he will “step aside” when his term ends</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Singing for supper, breakfast and lunch: Chivayo wades into Zanu PF factional wars, says Mnangagwa doing “exceptionally well”",
            "url": "https://www.newzimbabwe.com/singing-for-supper-breakfast-and-lunch-chivayo-wades-into-zanu-pf-factional-wars-says-mnangagwa-doing-exceptionally-well/",
            "content": "By Darlington Gatsi\n\nControversial tenderpreneur Wicknell Chivayo has backed the extension of President Emmerson Mnangagwas rule beyond the constitutionally stipulated two-term limit, inserting himself into the ruling partys ongoing factional battles, which show no signs of abating.\n\nThe push to extend Mnangagwas rule has deepened divisions within the ruling party, with two factions emerging at loggerheads. One faction, loyal to Mnangagwa, is advocating for the suspension of the 2028 elections to allow him to remain in power until 2030.\n\nMeanwhile, another faction, believed to be aligned with Vice President Constantino Chiwenga, is pushing for adherence to the constitutional term limits.\n\nChivayo, a beneficiary of controversial government deals, has apparently chosen a side in the factional dispute, praising Mnangagwa for having done exceptionally well.\n\nThis development in the USA got me deeply reflecting on our beloved Country, where H. E. President Mnangagwa has demonstrated remarkable leadership. In my opinion, when a leader is delivering exceptional results, their presidency should not be cut short, especially if the people overwhelmingly support his continued leadership. Even the opposition in Zimbabwe, despite being fragmanted, recently agreed to this concept.\n\nI personally believe that progress must take precedence over procedural constraints created by a Constitution. Most will say Im singing for my supper and yes indeed, without a shadow of doubt, I will also sing for breakfast and lunch too.\n\nIn my view, a performing President like President E.D must be allowed to complete his vision for the nation. The will of the people should always be at the core of democracy. As we have seen in the U.S.A, policy inconsistencies caused by frequent leadership changes disrupt national progress, said Chivayo in a post on his social media posts.\n\nMnangagwa has, on numerous occasions, publicly rejected the idea of a term extension. On Monday, he told several state media editors that he would not seek to remain in office beyond 2028.\n\nHowever, a section of veterans of the liberation struggle, led by Blessed Geza, has accused Mnangagwa of insincerity. They have demanded his resignation, accusing him of presiding over widespread corruption.\n\nPolitical commentator Youngerson Matete avers that Chivayos support for the term extension is motivated by a desire to facilitate questionable deals and corruption.\n\nYou are criminal Chikurubhi bound, so it is normal that you will support the mutilation of our constitution to allow Mnangagwa to stay not because he is delivering but because you keep looting our tax and get his protection but the day of reckoning is coming Chigananda, said Matete.\n\nActivist Setfree Mafukidze said Mnangagwas clique should not hold the country to ransom by desecrating the constitution.\n\nOur national constitution should not and will not be tempered with to suit ED, we came up with this constitution in 2013 and there is a reason we all supported a maximum of 2 terms per President, we all wanted to avoid exactly what ED is doing today.\n\nThere is no one man who can run the country forever which is why even President Mugabe was removed from power through a coup by ED and his colleagues.\n\nOur country is not a playground and this agenda will fail dismally, it will be a disaster if ED persists on this route,it will backfire spectacularly. We are not going to allow failed leadership to continue, it wont happen, said Mafukidze.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/06/13064002/CHIVAYO-MNANGWA.webp",
            "description": "<p>By Darlington Gatsi Controversial tenderpreneur Wicknell Chivayo has backed the extension of President Emmerson Mnangagwa’s rule beyond the constitutionally stipulated two-term limit, inserting himself into the ruling party’s ongoing factional battles, which show no signs of abating. The push to extend Mnangagwa’s rule has deepened divisions within the ruling party, with two factions emerging at</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/singing-for-supper-breakfast-and-lunch-chivayo-wades-into-zanu-pf-factional-wars-says-mnangagwa-doing-exceptionally-well/\">Singing for supper, breakfast and lunch: Chivayo wades into Zanu PF factional wars, says Mnangagwa doing “exceptionally well”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Mighty Warriors leave for WAFCON Qualifier clash against Angola",
            "url": "https://www.newzimbabwe.com/mighty-warriors-leave-for-wafcon-qualifier-clash-against-angola/",
            "content": "By Sports Reporter\n\nZimbabwe senior womens football team has left the country for Angola where they are set to play their counterparts in the Womens Africa Cup of Nations Qualifiers.\n\nThe Mighty Warriors will be hosted by the Welwitchias in Luanda on February 20th, before the Welwitchias host them for the second leg at Lucas Moripe stadium in Durban, South Africa.\n\nThe team left the country Monday morning after a send-off ceremony held on Sunday where Minister of Sport Kirsty Coventry was the guest of honour.\n\nThe winner between Zimbabwe and Angola will play the winner between Congo and Malawi in the final qualifying stage for next years WAFCON, which will be hosted by Morocco.\n\nZimbabwe senior womens national team received a huge boost from the new ZIFA executive which introduced daily allowances for everyone during their training camp period.\n\nMIGHTY WARRIORS FINAL TRAVELLING SQUAD\n\nG0ALKEEPERS\n\nVanessa Lunga\n\nPrecious Mudyiwa\n\nLindiwe Magwede\n\nDEFENDERS\n\nEgness Tumbare\n\nheila Antonio\n\nPurity Mugayi\n\nNobukhosi Ncbe\n\nAlice Moyo\n\nFortunate Ngocho\n\nMIDFIELDERS\n\nDaisy Kaitano\n\nMorelife Nyagumbo\n\nEnnetty Chemhere\n\nNatasha Ndowa\n\nDanai Bhobho\n\nEmmaculate Msipa\n\nMavis Chirandu\n\nShyline Dambamuromo\n\nSTRIKERS\n\nChristabel Katona\n\nRutendo Makore\n\nEthel Chinyerere\n\nYolanda Kanyai\n\nRuvimbo Mucherera\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17111315/WhatsApp-Image-2025-02-17-at-13.02.28.jpeg",
            "description": "<p>By Sports Reporter Zimbabwe senior women’s football team has left the country for Angola where they are set to play their counterparts in the Women’s Africa Cup of Nations Qualifiers. The Mighty Warriors will be hosted by the Welwitchias in Luanda on February 20th, before the Welwitchias host them for the second leg at Lucas</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-leave-for-wafcon-qualifier-clash-against-angola/\">Mighty Warriors leave for WAFCON Qualifier clash against Angola</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "US man sues travel company after hippo kills wife on Zambia trip",
            "url": "https://www.newzimbabwe.com/us-man-sues-travel-company-after-hippo-kills-wife-on-zambia-trip/",
            "content": "VOA\n\nA New Jersey man whose wife was killed in a horrific hippopotamus attack last year during a safari in Africa is suing the U.S. company that arranged the trip, alleging it failed to ensure their safety and did not adequately screen and supervise the tour guides.\n\nCraig and Lisa Manders were on a guided walk in Zambia in June when a hippo charged out of the water, grabbed Lisa Manders by its mouth and crushed her head and body with its bite, according to the lawsuit filed against African Portfolio, a safari tour company based in Greenwich, Connecticut. The company denies the lawsuits allegations.\n\nThe lawsuit, filed Feb. 5 in Stamford, Connecticut, alleges that as a horrified Craig Manders watched the attack, the tour guides  including at least one armed with a rifle  walked away without helping the couple. Lisa Manders, 70, suffered catastrophic injuries and died shortly after, the lawsuit says.\n\nWere doing this because this should never have happened, said Paul Slager, an attorney who is representing Craig Manders with his law partner, Nicole Coates. There are basic safety standards that businesses are expected to follow, and that includes people in the safari tour industry. And those were not followed, and the consequences here were absolutely devastating.\n\nSlager said the lawsuit seeks monetary damages that have not yet been determined, as well as accountability for Lisa Manders death and keeping others safe in the future. He said Craig Manders was not giving interviews.\n\nThe Manderses, of Cranford, New Jersey, were on a special anniversary trip and it was their first time in Africa, Slager said. Lisa Manders had worked in the financial industry for over 40 years and loved cooking, traveling and visiting New York City, where she was born in Queens in 1953, according to her obituary. The couple had three children and a granddaughter.\n\nThe companys lawyer, Rodney Gould, said it was not negligent or reckless in connection with Lisa Manders death. He said African Portfolio only arranged the couples lodging and the owners of the lodging, Chiawa Safaris in Zambia, provided the tour guides.\n\nIts a horrible tragedy when somebody goes on one of these trips and is injured or killed. Its awful, Gould said. I think its important to understand what African Portfolios role in this is. Its a tour operator. It arranges trips. It puts together the pieces.\n\nHe added, My client didnt conduct the safari. It arranged it. It booked all the components.\n\nGould also said the company was not negligent in vetting Chiawa, because it has an excellent reputation. He said African Portfolio will either ask a judge to dismiss the lawsuit or request that the matter go to arbitration, which was a condition of an agreement the Manderses signed for the trip.\n\nIn a statement, African Portfolio did not directly address the lawsuit. It said Chiawa arranged the walking safari and guests were accompanied by an experienced and highly trained guide, a ranger and an armed National Park scout. It said Chiawa told authorities that safety measures were implemented before the attack and repeated warnings were issued to guests to return to the safety of the vehicle during the incident.\n\nAsked whether the guests were warned about the hippo before the attack, African Portfolio said in an email only that the statement is an accurate reflection of the events as we understand them. Gould declined to comment.\n\nThe company also said its founder flew to Zambia immediately after the attack and joined Chiawas owner in ensuring that everything possible was being done to support the family and all those involved. Our thoughts and prayers continue to be with the family, and everyone else involved in this tragic incident.\n\nThe lawsuit, which does not mention Chiawa, says African safaris are inherently dangerous activities because of the unpredictability and sometime aggressive nature of wild animals, and they require careful planning and execution to be completed safely. It says African Portfolio vetted and oversaw the tour guides and vouched that they were competent, qualified and trained to keep people safe.\n\nThe suit alleges that African Portfolio encouraged and/or permitted the Manderses to be exposed to an avoidable and highly dangerous encounter with a dangerous hippopotamus in the Zambian wilderness. It also accuses the company of failing to provide safe conditions during the wilderness walk and failing to ensure that the tour guides were adequately selected, screened, supervised and trained to provide a safe experience.\n\nAfrican Portfolio also failed to take adequate steps to protect the Manderses before and during the attack, the suit alleges.\n\nHippos are the worlds second-largest land mammals after elephants, measuring about 3.5 meters long and about 1.5 meters tall, according to International Fund for Animal Welfare. The average male hippo weighs about 3,200 kilograms.\n\nHippos are known to be territorial and aggressive at times. A year before Lisa Manders died, seven people were killed in the southern African nation of Malawi when a hippo charged into a canoe and capsized it on a river. Estimates of how many people are killed by hippos each year vary, with lower figures beginning at around 500.\n\nLisa Manders suffered significant premorbid fear and emotional pain, suffering and mental anguish before her death, the suit says. Craig Manders suffered severe and debilitating emotional and psychological injuries that have made it difficult for him to cope with daily routines, it says.\n\nThe lawsuit is seeking damages on allegations of negligence and recklessness.\n\nHes suing both for the loss of his wife and the impact that has on him and his life, Slager said. And he also has a claim for having witnessed what happened to her, having seen the attack, which is unthinkable. Its unimaginable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17070704/Zambia-Fatal-Hippo-Attack-749x500-1.jpg",
            "description": "<p>VOA A New Jersey man whose wife was killed in a horrific hippopotamus attack last year during a safari in Africa is suing the U.S. company that arranged the trip, alleging it failed to ensure their safety and did not adequately screen and supervise the tour guides. Craig and Lisa Manders were on a guided</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/us-man-sues-travel-company-after-hippo-kills-wife-on-zambia-trip/\">US man sues travel company after hippo kills wife on Zambia trip</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Marshall Munetsi in EPL debut defeat against Liverpool",
            "url": "https://www.newzimbabwe.com/marshall-munetsi-in-epl-debut-defeat-against-liverpool/",
            "content": "By Sport Reporter\n\nWARRIORS vice-captain, Marshall Munetsi Sunday afternoon made his English Premier Soccer League (EPL) debut for Wolveshampton Wanderers in their 2-1 defeat against Liverpool at Anfield.\n\nThe 28-year-old midfielder was introduced at the beginning of the second half, thereby marking his first EPL appearance, which was the second in Wolves colours following last weeks debut against Blackburn Rovers in the FA Cup.\n\nMunetsi was a transfer deadline signing for Wolves, who aqcuired him from French League 1 side Stade Reims at a fee of 20 million.\n\nTurning back to Sundays match, the Zimbabwean midfielder was introduced at the beggining of the second half whilst his team was already trailing 2-0 following two first half strikes from Luis Diaz (15 mins) and Mohamed Salah (37 mins) who scored for the host.\n\nMunetsis presence on the pitch gave Wolves the much needed bolster, with the expatriate forward creating himself a one-on-one opportunity against Liverpool goalkeeper Allison Becker, who denied him.\n\nWolves continued to pile more pressure and got their consolation goal in the 67th minute through Matheus Cunha, who curled in a beautiful strike.\n\nThe former Orlando Pirates and Stade Reims midfieder almost salvaged a point for his side in the final minutes, only to have his efforts blocked by substitute Jarell Quansah.\n\nThe midfielder, however, applauded his teammates for the performance despite the defeat.\n\nWe tried our best. The coach made some changes to put them under pressure, we created a lot of chances and made them uncomfortable.\n\nIn the first half we didnt really cause them a lot of problems but the second half was the identity of the team, this is what the coach wants. This is something we have to keep doing, he said during post match interview.\n\nCommenting after the match Wolves coach Vitor Pereira admitted that his second half substitutes including Munetsi changed the game for his side.\n\nHe said, Frustrated because it wasnt a win. Our first half, we committed a lot of mistakes, a lot of respect to them.\n\nWe cannot play like this, we must play our game. At half-time I asked the team to play and press them in our way.\n\nWe did a fantastic second half, the second goal wasnt possible, but I think we deserved it.\n\nThe change and vibe we showed in the second half is how we should play.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/17041353/FB_IMG_1739740941561.jpg",
            "description": "<p>By Sport Reporter WARRIORS vice-captain, Marshall Munetsi Sunday afternoon made his English Premier Soccer League (EPL) debut for Wolveshampton Wanderers in their 2-1 defeat against Liverpool at Anfield. The 28-year-old midfielder was introduced at the beginning of the second half, thereby marking his first EPL appearance, which was the second in Wolves colours following last</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marshall-munetsi-in-epl-debut-defeat-against-liverpool/\">Marshall Munetsi in EPL debut defeat against Liverpool</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Legal Discussions with Vengai Madzima: Environmental Protection in Mining Areas",
            "url": "https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-environmental-protection-in-mining-areas/",
            "content": "NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner atMadzima Chidyausiku Museta Legal Practitioners (MCM Legal),to discuss legal issues that affect Zimbabweans with us. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer.\n\nReporter: Welcome back Mr. Madzima, this week we want to discuss the impact of mining on the environment in Zimbabwe. What has been the impact of mining on our environment and has it been worth it?\n\nVM: That is a two-pronged question. Mining has had a significantly negative impact on our environment and since most mining occurs in farms or rural areas, it has also affected and in some instances disrupted the socio-economic lives of the people in such areas.\n\nLet me address your question of whether it is worth it. Mining is a significant contributor to our economy through taxes, foreign currency earnings, employment creation, technology transferet cetera.It is the anchor of our future economic growth projections as new minerals are continuously being discovered and through on-going exploitation of our historical minerals like gold, which we still hold in abundance. In fact, the resuscitation of our currency is hinged on continued gold mining.\n\nThe real question has to be on sustainable mining. Our laws starting from the constitution prescribe and advocate for the protection of the environment for the benefit of current and future generations. However, current practices for one reason or another have resulted in a lot of deforestation, contamination of land and water resources, air pollution and so on and so forth.\n\nReporter:What measures are available currently to protect the environment against harmful mining activities?\n\nVM: The Environmental Management Agency commonly known as EMA is the body that is mandated to oversee and monitor activities that are potentially harmful to the environment.\n\nIt is the watchdog.\n\nMining is an activity with serious potential to harm the environment. Entrants into this space are required by law to first submit an Environment Impact Assessment Report to EMA which will assess it and then issue a certificate approving the mining if satisfied.\n\nReporter: What information is contained in the Environmental Impact Assessment Report?\n\nVM: The report will describe the proposed project in detail, and what developments or works will be carried out at the project. It will also look at the geographical and socio-economic conditions in the area where the project is being implemented, including any legal policy affecting or that may be potentially affected by the project. Lastly, the report addresses the potential environmental and social impact of the project and proposes mitigation measures for the projected impact. Social impact is critical as mining activities are carried out in places that were or are inhabited by people.\n\nThe report will also address post-mining issues which include land reclamation and rehabilitation.\n\nReporter: If there are such measures then why are we experiencing such land degradation and harmful environmental practices?\n\nVM: This is a fair question.\n\nThe first part of the question relates to whether EMA has the full economic capacity to carry out its mandate in light of our economic hardships and the mushrooming of illegal miners everywhere in the country specifically in the most remote of areas.\n\nA 2024 conservation report estimated illegal miners to be around 400,000 people. That is a staggering figure if you then juxtapose that with the potential environmental impact that such unregulated people, operating clandestinely and sometimes at night, will have on the environment.\n\nIn areas such as Gwanda, animals were falling in pits, the area experienced reduced biodiversity and also lost a significant number of their Mopane trees where they had historically harvested Mopane worms for personal consumption and resale.\n\nEMA retains the mandate to rehabilitate such land using budgetary support from the Government. That is why I then raised the question of capacity. The Chamber of Mines did propose that rehabilitation levy be imposed on miners which may find its way in the new Mines and Minerals Bill.\n\nThe panacea of our environment is directly linked with the solution to our illegal miners problem.\n\nReporter: What penalties are available for breach of environmental laws in mining?\n\nVM: Our laws impose penalties for the various breaches that can occur from mining activities. The penalties range from applicable fines to imprisonment. Further, the perpetrators may be ordered to pay the costs of restoration of the land or water or compensate EMA for works done in restoring such property to its normal state. An additional penalty may be imposed ordering the perpetrators to compensate third parties who have suffered harm as a result of their mismanagement of the environment.\n\nReporter: Thank you, Mr. Madzima we have run out of time.\n\nVM: Thank you.\n\nRELATED:Legal Discussions with Vengai Madzima: Acquisition of Mining Rights in ZimbabwebyDiaspora and Foreign Investors\n\nYou can contact Vengai Madzima atvengai@mcmlegal.co.zwor www.mcmlegal.co.zw\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/07/06173942/mine.webp",
            "description": "<p>NewZimbabwe.com has invited Mr. Vengai Madzima, the Senior Partner at Madzima Chidyausiku Museta Legal Practitioners (MCM Legal), to discuss legal issues that affect Zimbabweans with us. The discussions are of a general nature, and those seeking specific legal advice should contact their lawyer. Reporter: Welcome back Mr. Madzima, this week we want to discuss the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/legal-discussions-with-vengai-madzima-environmental-protection-in-mining-areas/\">Legal Discussions with Vengai Madzima: Environmental Protection in Mining Areas</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Mnangagwa, Hichilema lead SADC push for African Development Bank presidency",
            "url": "https://www.newzimbabwe.com/mnangagwa-hichilema-lead-sadc-push-for-afdb-presidency/",
            "content": "By NewzWire\n\nAT the AU Summit in Addis Ababa, President Emmerson Mnangagwa and Zambian President Hakainde Hichilema, joined by Burundis Evariste Ndaishimiye, the Common Market for Eastern and Southern Africa (COMESA) chair, held a joint press conference to rally support for Zambian candidate Samuel Maimbo in the race for African Development Bank (AfDB) president.\n\nMaimbo, a VP at the World Bank, secured backing from regional leaders at last years SADC Summit in Harare.\n\nHe faces competition from candidates across other regions ahead of the elections set for May in Cte dIvoire.\n\nAfDB has played a significant role in Zimbabwes financial landscape, extending $55 million in credit lines to the private sector since 2023, with a further $135 million planned for 2025.\n\nOutgoing AfDB president, Akinwumi Adesina, has also led Zimbabwes arrears clearance negotiations with creditors.\n\nThe banks ownership structure comprises 54 African nations, collectively holding a 60% stake, while 27 non-African member countries control the remaining share.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/26040614/African-Development-Bank-AfDB.png",
            "description": "<p>By NewzWire AT the AU Summit in Addis Ababa, President Emmerson Mnangagwa and Zambian President Hakainde Hichilema, joined by Burundi’s Evariste Ndaishimiye, the Common Market for Eastern and Southern Africa (COMESA) chair, held a joint press conference to rally support for Zambian candidate Samuel Maimbo in the race for African Development Bank (AfDB) president. Maimbo,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-hichilema-lead-sadc-push-for-afdb-presidency/\">Mnangagwa, Hichilema lead SADC push for African Development Bank presidency</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "‘Nothing unusual about amending Constitution to push Mnangagwa’s incumbency until 2030’— Information minister",
            "url": "https://www.newzimbabwe.com/nothing-unusual-about-amending-constitution-to-push-mnangagwas-incumbency-until-2030-information-minister/",
            "content": "By Staff Reporter\n\nINFORMATION Minister Jenfan Muswere says Zanu PF will push Parliament to make constitutional amendments to enable President Emmerson Mnangagwa to retain power arguing legislators are legally mandated to effect such alterations.\n\nAt the Zanu PFs Annual National Peoples Conference last October in Bulawayo, the ruling party passed Resolution # 1 to extend Mnangagwas term of office until 2030, or possibly beyond that timeline.\n\nAlthough the 82-year-old leader has publicly declined the offer arguing he is a constitutionalist, who will stick to a provision of the two five-year term limits, his backers are plotting he remains at State House.\n\nSpeaking at the launch of the Presidential War Veterans Fund, Presidential War Veterans Rural Home and Borehole Drilling Scheme at Dewedzo High School in Makoni West constituency Saturday, Muswere said Zanu PF was ananimous about implementing Resolution #1 and nothing was unusual about amending the Constitution citing a provision allowing for the changes.\n\nTo those who think there are divisions at the top, listen, there is no noise in the cockpit. There is unity. Do you think there is anyone who loves the President more than those in the Presidium? Those people are united. Our leaders are truly united. There is no disharmony, we are driving the boat towards 2030, said Muswere.\n\nThere is nothing unconstitutional about amending the constitution. The role of Parliament is multifaceted, encompassing oversight, representation, and legislative responsibilities, which include amending the Constitution.\n\nNotably, our current Constitution is not the first we have had. We began with the Lancaster House Constitution and in 1999, a new Constitution was proposed, which went to a referendum where the majority voted against it.\n\nIn 2013, under the inclusive Government, we adopted our present Constitution. Parliaments duty is to enact laws, including delegating legislative authority to other legally and properly constituted institutions.\n\nTherefore, its untrue to claim that a Constitution cannot be amended; after all, the Constitution is made for the people, he told Zanu PF supporters in his Makoni West constituency.\n\nMuswere said the party, from districts to the Central Committee, passed the resolution to amend the Constitution to allow the party leadership to continue beyond 2028.\n\nHe added that extending President Mnangagwas leadership was an opportunity to consolidate the ongoing economic, infrastructural and social transformation programmes, guaranteeing continuity in policies aimed at achieving Vision 2030.\n\nStability and consistency in leadership, he said, are crucial for realising the countrys long-term goals.\n\nThe information minister added that Zanu PF is a collosal and well-oiled institution with grassroots support, capable of annihilating the opposition even if the constitutional amendment goes to a referendum.\n\nWe have massive grassroots support as Zanu PF, and with the collective resolution we have passed, it is a foregone conclusion  we have already won, regardless of whether we proceed to a referendum or plebiscite.\n\nWe must dispel the misconception that amending the Constitution is unconstitutional. Our Constitution has democratic processes in place for amendments, he said.\n\nIn apparent reference to controversial war veteran Blessed Runesu Geza, now wanted by police for allegedly undermining Mnangagwa among other charges, Muswere said some Central Committee members bypass internal remedies and platforms to discuss party issues in the media.\n\nWhen a decision is made, they are part of it. When asked if anyone opposes it, they dont raise objections. Instead, they want to discuss conference business in newspapers.\n\nWe must be principled. If given the opportunity to express concerns, we should do so promptly, he said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/10/03005745/SONA-4-Mnangagwa.png",
            "description": "<p>By Staff Reporter  INFORMATION Minister Jenfan Muswere says Zanu PF will push Parliament to make constitutional amendments to enable President Emmerson Mnangagwa to retain power arguing legislators are legally mandated to effect such alterations. At the Zanu PF’s Annual National People’s Conference last October in Bulawayo, the ruling party passed Resolution # 1 to extend</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/nothing-unusual-about-amending-constitution-to-push-mnangagwas-incumbency-until-2030-information-minister/\">‘Nothing unusual about amending Constitution to push Mnangagwa’s incumbency until 2030’— Information minister </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        },
        {
            "title": "Another defeat for Raila Odinga as African leaders elect Djibouti’s foreign minister as new AU chief",
            "url": "https://www.newzimbabwe.com/another-defeat-for-raila-odinga-as-african-leaders-elect-djiboutis-foreign-minister-as-new-au-chief/",
            "content": "By Associated Press\n\nADDIS ABABA, Ethiopia  African leaders on Saturday elected Djiboutis foreign minister to become the next leader of the commission than runs the continent-wide African Union.\n\nMahmoud Ali Youssouf defeated Raila Odinga, a former prime minister of Kenya, and Richard Randriamandrato, an ex-foreign minister of Madagascar, in a vote at the AU summit in Addis Ababa, the Ethiopian capital.\n\nThe AU has 55 member states. Presidents or heads of government pick the commissions leader, who is effectively the chief executive of the Addis Ababa-based secretariat running the AU.\n\nYoussouf, who will serve a four-year term, replaces Moussa Faki of Chad, who has held the post since 2017.\n\nThe result is a blow for the high-profile Odinga, who sought support among allies at home and abroad.\n\nThe 80-year-old Odinga has sought Kenyas presidency five times over three decades, and the AU post would have been his last foray in public affairs. His long and colorful career in local politics peaked with his rise to the position of prime minister in 2008 after tense negotiations to end postelection violence in which at least 1,000 people were killed in Kenya.\n\nOdinga remains a beloved figure in Kenya, but some saw his recent political alliance with William Ruto, the current president of the country, as a betrayal of a decades-long fight for good governance in the east African country.\n\nAs head of the AU Commission, Youssouf inherits challenges ranging from the rise of military juntas in west Africa to a violent rebellion in eastern Congo, where rebels backed by Rwanda have taken two major cities in recent days.\n\nYoussouf has been Djiboutis foreign affairs minister since 2005.\n\nThe AU is frequently criticized for perceived inaction or lack of serious response to armed conflicts in different parts of Africa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/02/06230326/Raila-Odinga-e1594778985303.jpg",
            "description": "<p>By Associated Press  ADDIS ABABA, Ethiopia — African leaders on Saturday elected Djibouti’s foreign minister to become the next leader of the commission than runs the continent-wide African Union. Mahmoud Ali Youssouf defeated Raila Odinga, a former prime minister of Kenya, and Richard Randriamandrato, an ex-foreign minister of Madagascar, in a vote at the AU</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/another-defeat-for-raila-odinga-as-african-leaders-elect-djiboutis-foreign-minister-as-new-au-chief/\">Another defeat for Raila Odinga as African leaders elect Djibouti’s foreign minister as new AU chief</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:34",
            "date": "17 Feb 2025"
        }
    ]
}