{
    "news": [
        {
            "title": "Keyshia Cole’s South African concert officially cancelled: A dream dashed for R&B fans",
            "url": "https://www.newzimbabwe.com/keyshia-coles-south-african-concert-officially-cancelled-a-dream-dashed-for-rb-fans/",
            "content": "IOL\n\nIn a disappointing turn of events for R&B fans, the eagerly awaited concert,Keyshia Cole  Live in South Africa, has been officially cancelled.\n\nThis announcement comes after a series of scheduling difficulties that have plagued the planning of the event, with Coles team requesting yet another postponement to accommodate her global tour later this year.\n\nCole was initially meant to perform in South Africa in September, however due to unforeseen circumstances it was postponed to January 2025.\n\nThe January date was rescheduled to Aprildue to a devastating fire incident in Los Angeles earlier this year, fans had finally received optimism when a confirmation video was shared byColeherself on social media, declaring the show would go ahead next week.\n\nHowever, amidst further complications, it has now been confirmed that the concert will not take place as planned.\n\nThe concert promoter Glen21 Entertainment issued a heartfelt statement this morning, expressing their disappointment at letting fans down once more. We are incredibly disappointed to let fans down once again, they said.\n\nSouth African fans have shown immense excitement and loyalty, and we were truly looking forward to bringingKeyshia Coleto our shores. Unfortunately, under the current circumstances with a request for yet another postponement, we are unable to continue pursuing a new tour date yet again.\n\nFor those who purchased tickets, the promoter assured that all ticket holders would be contacted directly with detailed information regarding refunds.\n\nAdditionally, the official ticketing platform is set to provide further assistance in the coming days. Fans seeking immediate answers can also reach out via the email addressinfo@ticketpro.co.za.\n\nThe promoter extended their gratitude to fans for their patience and understanding throughout this trying ordeal, and sincerely apologised for the inconvenience caused.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18053022/Keyshia-Cole-is-officially-no-longer-going-to-perform-in-South-Africa-after-two-postponements-Picture-Instagram-keyshiacole.webp",
            "description": "<p>IOL In a disappointing turn of events for R&B fans, the eagerly awaited concert, Keyshia Cole – Live in South Africa, has been officially cancelled. This announcement comes after a series of scheduling difficulties that have plagued the planning of the event, with Cole’s team requesting yet another postponement to accommodate her global tour later this</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/keyshia-coles-south-african-concert-officially-cancelled-a-dream-dashed-for-rb-fans/\">Keyshia Cole’s South African concert officially cancelled: A dream dashed for R&B fans</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "Vision Group secures clearance to take over Tongaat Hulett’s operations in Zimbabwe",
            "url": "https://www.newzimbabwe.com/vision-group-secures-clearance-to-take-over-tongaat-huletts-operations-in-zimbabwe/",
            "content": "IOL\n\nThe Vision Group announced on Wednesday that it has received competition approvals for acquisition of all Tongaat Huletts assets in Zimbabwe.\n\nUnder the transaction, Ball Foundry has been given the nod by the Competition and Tariff Commission of Zimbabwe to acquire Triangle Sugar Corporation, which holds Tongaat Huletts operations in Zimbabwe.\n\nProsper Ziyadhuma, an official with the Zimbabwe CTC, confirmed this toBusiness Reporton Wednesday.\n\nWe had given them an intended decision as indicated in the notice they provided, Ziyadhuma said.\n\nVision Group, whose principals include Mpumalanga businessman Robert Gumede and Zimbabwean business executive Rutenhuro Moyo, has beneficial ownership in Ball Foundry, which is incorporated in Mauritius.\n\nThe purchase consideration will be settled by way of a set-off against a portion ofthelendergroupclaims.Triangle Sugar is the holding company of Tongaat Hulettsoperations in Zimbabwe, Tongaat Hulett, currently under business rescue, said in December.\n\nWhile the transaction for the disposal of Tongaat Huletts operations in Zimbabwe was signed on December 21, the agreement had been subject to the fulfillment of a number of suspensive conditions, including employee related conditions.\n\nTongaat Hulett also confirmed on Wednesday that the Competition and Tariff Commission of Zimbabwe hasprovided approval for the Alternative Transaction subject to certain employment-relatedconditions.\n\nThese conditions have been duly accepted, rendering the approval effective. Thismarks the final competition authority approval required across all applicable jurisdictions forthe implementation of the alternative transaction, said the company.\n\nTongaat Hulett and the Business Rescue Practitioners continue to work closely with Vision to finalise the implementation of the transaction. This collaborative effort underscores a shared commitment to revitalising Tongaats operations for the benefit of employees, cane growers, suppliers and rural communities.\n\nThe alternativetransactionforms the cornerstone ofthe Tongaat Hulett adoptedbusinessrescueplanandentails the sale ofthe troubled South African agro-processing and sugar manufacturersbusiness and assets including those in Zimbabwe, Botswana and Mozambique among others as a going concern.\n\nThe sale will be finalised in a consolidated group transactionto Vision.\n\nThe transaction includes the sale of Tongaat Huletts South African assets, including its sugar operations and corporate head office, as well as the sale of its shares in and claims against the Zimbabwe, Mozambique, and Botswana businesses.\n\nEarlier this year, theHigh Court in Durban dismissed RGS Group Holdings application seeking to interdict Vision Groups implementation of Tongaat Huletts business rescue plan related to the sale of the agro-processing entitys assets and businesses.\n\nLast year, creditors in Tongaat voted in favour of a business rescue plan put forward by Vision.\n\nThis was after an accounting scandal rocked Tongaat Hulett, with the company tail-spinning into a debt of R8.2 billion and prompting shareholders to adopt an amended business rescue plan, which the companys business rescue practitioners now intend to implement.\n\nTongaat Hulettis envisioned to continue playing critical rolesin the economic fabric of Southern Africa.\n\nIn South Africa, the businessremains a cornerstone of the sugar industry, directly employing 2600 individuals, indirectly supporting 25 500 rural jobs and sourcing cane from 15 000 small-scale growers  thereby sustaining local farming communities, and underpinning numerous rural economies, especially in theKwaZulu-Natalprovince.\n\nIn Zimbabwe, Tongaat Hulett owns two operating businesses, Triangle and separately listed Hippo Valley Estates.Triangle saidrecentlythat it was facing operational challenges that had forced it to retrench employees after cost-cutting measures failed to yield a respite.\n\nItsaid it had seenprofit margins decline significantly by 55%, with manpower costsspikingby 133% as a proportion of revenue and debt levels rose to unsustainable levels.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/29151203/Tongaat-Hulett.jpeg",
            "description": "<p>IOL The Vision Group announced on Wednesday that it has received competition approvals for acquisition of all Tongaat Hulett’s assets in Zimbabwe. Under the transaction, Ball Foundry has been given the nod by the Competition and Tariff Commission of Zimbabwe to acquire Triangle Sugar Corporation, which holds Tongaat Hulett’s operations in Zimbabwe. Prosper Ziyadhuma, an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vision-group-secures-clearance-to-take-over-tongaat-huletts-operations-in-zimbabwe/\">Vision Group secures clearance to take over Tongaat Hulett’s operations in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "We suffer in silence – says Zimbabwean migrant care worker",
            "url": "https://www.newzimbabwe.com/we-suffer-in-silence-says-zimbabwean-migrant-care-worker/",
            "content": "BBC\n\nA migrant social care worker has said her employer threatened to cancel her visa if she complained about being forced to work long hours without any days off.\n\nSophia  not her real name  said she paid more than 2,000 in fees to a South Yorkshire care company that sponsored her visa to come to the UK from Zimbabwe to work for them in 2023.\n\nThe Home Office has cracked down on abuse and exploitation by some care companies by revoking their licences, leaving many workers without a job.\n\nLeeds City Council, which oversees a Yorkshire-wide project to find new jobs for unemployed overseas workers, said there had been challenges in matching people with roles.\n\nSophia came to the UK on a health and care worker visa, designed to help plug staffing gaps in the sector.\n\nShe said she was placed in an unregistered, multi-occupancy house and when she complained that she was paying too much for the accommodation was told she was not grateful.\n\nSophia added that she was threatened with having her Certificate of Sponsorship terminated  a document provided by an employer that is required for the visa to be valid.\n\nYoure supposed to be quiet, so we had to suffer in silence, Sophia said. You cant move, you cant breathe, you are stuck.\n\nYou have sacrificed everything to come here so that you can start a new life. When you get here, you see the treatment is not good.\n\nSophia said she was often out of the house for 16 hours a day for work, without any days off.\n\nShe felt unable to seek any other employment because her visa depended on the care company.\n\nThe union Unison has called for the government to take control of issuing Certificates of Sponsorship, to stop individual care companies having an enormous amount of power over workers.\n\nJordan Stapleton, the unions regional migrant lead, said: Were seeing migrant workers who are having to pay thousands of pounds in illegal fees, often working 16 hours a day, often without a break, not getting paid correctly, not being paid for travel time and being threatened with deportation and their visa being removed if they complain.\n\nAlthough the government has been revoking the licence of some of these employers, many employers are still operating because [employees] darent report them.\n\nJamila Duncan-Bosu, a solicitor from the charity Anti Trafficking and Labour Exploitation Unit (Atleu), said she had seen a rise in the number of inquiries from care workers seeking legal action over their experiences.\n\nThere needs to be a proper safety net, she said.\n\nBetween July 2022 and December 2024, the government said it had revoked more than 470 care providers licences, which enable companies to give visas to overseas workers across England, where there were concerns about abuse and exploitation.\n\nBut the move had left thousands of the workers unemployed.\n\nHome Office figuresreleased last monthrevealed more than 39,000 workers had been associated with these care providers since October 2022.\n\nTo help find the workers find new jobs, in March 2023, the then-Conservative government gave councils across England a total of 16m to tackle the exploitation of overseas workers, help find them new work and offer support.\n\nLeeds City Council runs the Yorkshire and Humber branch of the project.\n\nThe project said it had been approached by 4,355 workers who had been left without employment after having their visa sponsorships revoked.\n\nIt had successfully matched 71 people to new roles or new sponsors since it launched two years ago.\n\nA council spokesperson said a lack of Home Office-approved sponsor organisations in the area affected the number of job matches.\n\nWe recognise that there have been challenges across the region in finding workers new sponsors, which is in line with national recruitment issues faced by organisations in the care sector across the UK, they said.\n\nA government spokesperson said they were determined to protect migrant care workers from exploitation and abuse, including from employers that fail to provide work they had promised or non-payment of minimum wage.\n\nWhere there is evidence of illegal and unethical practices, we will always take action as swiftly as possible, they said.\n\nDan Archer, chief executive of home care service Visiting Angels, which has no involvement with Sophias case, said his company had chosen not to hire staff through the visa scheme.\n\nHe said in some cases hiring overseas workers was the wrong solution to fix the staffing shortage.\n\nIt feels exploitative, bringing people to the UK to ask them to do a job that not enough people in the UK are prepared to do, he said.\n\nInstead, Mr Archer said the company aimed to make the job more attractive to workers already in the UK, by offering better pay and avoiding zero-hour contracts.\n\nElaine Thompson, from Thurnscoe, near Barnsley, said she had relied on the firms care since her husband died five years ago.\n\nHer carer, mother-of-three Natalie Henstalk, said she enjoyed the job because she felt she was helping people and flexible hours meant she could also look after her children.\n\nI love my job. Its a good job to have, she said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/18052159/sophia-bbc-.webp",
            "description": "<p>BBC A migrant social care worker has said her employer threatened to cancel her visa if she complained about being forced to work long hours without any days off. Sophia – not her real name – said she paid more than £2,000 in fees to a South Yorkshire care company that sponsored her visa to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/we-suffer-in-silence-says-zimbabwean-migrant-care-worker/\">We suffer in silence – says Zimbabwean migrant care worker</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "Police to deploy breathalysers, smart traffic policing at roadblocks",
            "url": "https://www.newzimbabwe.com/police-to-deploy-breathalysers-smart-traffic-policing-at-roadblocks/",
            "content": "By Staff Reporter\n\nAUTHORITIES have heightened policing at roadblocks by deploying newly-acquired breathalysers to sniff drunk drivers while new technology will be used to account for traffic offenders.\n\nThe latest developments will curb drunk-driving and recklessness, reducing road traffic accidents, which have been a major cause of deaths in the country.\n\nHome Affairs and Cultural Heritage Minister Kazembe Kazembe and Transport and Infrastructural Development Minister Felix Mhona this week issued a joint statement confirming the developments.\n\nOur priority is deploying an electronic traffic management system. Technology doesnt discriminate  it does not care about your face, relationship, or status. It ensures fairness and holds everyone accountable, read the statement.\n\nThe smart traffic management system is part of a wider scheme to reduce road carnage, congestion and corruption.\n\nA Dubai-based company, Vitronic Machine Vision Middle East, is reportedly spearheading the project through a public-private partnership.\n\nThe firm is set to inject an initial investment of an estimated US$80 million into this novel plan.\n\nThey underscored the importance of transitioning to electronic traffic management, highlighting its impartiality and efficiency.\n\nWhile the system is being implemented, police presence, roadblocks, and traffic controls will remain essential tools for maintaining order.\n\nThe ministers also called on drivers to adhere to traffic laws and urged the public to collaborate with the police in upholding safety standards, particularly during public holidays such as Independence and Easter.\n\nThe ministers warned of stiffer penalties for traffic offenders in a bid to tame the traffic jungle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17084747/breathalyser.jpg",
            "description": "<p>By Staff Reporter AUTHORITIES have heightened policing at roadblocks by deploying newly-acquired breathalysers to sniff drunk drivers while new technology will be used to account for traffic offenders. The latest developments will curb drunk-driving and recklessness, reducing road traffic accidents, which have been a major cause of deaths in the country. Home Affairs and Cultural</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/police-to-deploy-breathalysers-smart-traffic-policing-at-roadblocks/\">Police to deploy breathalysers, smart traffic policing at roadblocks</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "“The elderly, desperate and destitute being used to pretend compensation has been resolved” – former white farmers reject govt’s dollar bonds deal; say Finance minister’s claims “misleading”",
            "url": "https://www.newzimbabwe.com/the-elderly-desperate-and-destitute-being-used-to-pretend-compensation-has-been-resolved-former-white-farmers-reject-govts-treasury-bonds-deal-say-finance-ministers-claims/",
            "content": "By Staff Reporter\n\nA group of former white farmers who were displaced during the 2000s land reform programme has rejected the governments dollar-bonds compensation deal, citing that it is reliant on very uncertain and very high-risk long-term payouts.\n\nFinance Minister Mthuli Ncube recently revealed that treasury bonds worth US$308 million and cash payments had been made to former white farm owners. Receipt of the payments was confirmed by ex-Commercial Farmers Union (CFU) leader Andrew Pascoe, whom the group now says was voted out in 2024 after agreeing to a deal they had rejected.\n\nNcube last week said after the cash payment the balance will be paid in treasury bonds with a 2% coupon and maturities of two years, which the former white farmers Compensation Steering Committee (CSC) has rejected.\n\nAngus Selby, a representative of the CSC said these bonds do not clear the debt but merely convert displaced farmers (Title Deed Holders) into bondholders reliant on very uncertain, very high-risk, very long-term payouts.\n\nThe payments are under the Global Compensation Deed (GCD) signed in 2020, where government agreed to pay a discounted US$3,5 billion to the former white farm owners.\n\nThe acting chairman of the former white farmers CSC Deon Theron said, the overwhelming majority of farmers supported this deal in a survey at the time but, to date, almost five (5) years on, nothing has been paid per this agreement.\n\nInstead, in 2023 the government offered an alternative payment schedule in Government Treasury Bills over ten years heavily weighted towards years 5-10, a token 2 percent interest rate was added which compares to regional USD interest rates of 10-20%.\n\nThe revised offer was put to the farmers in April 2023 via a formal survey in which it was rejected by the majority of farmers. Whereas 3100 voted in favour of the 2020 proposal, only 782 voted for the adjusted offer in 2023.\n\nHe added that the few farmers who have accepted the governments deal did so because they are destitute and in urgent need of money for food and healthcare.\n\nTheron revealed this was clearly communicated to the government in an official correspondence.\n\nDespite this rejection, the government pushed ahead with the revised offer that became known as the Farmers Compensation Agreement (FCA) in which 378 farms have now (nearly two years later) received initial payments of 1% of their share of the discounted offer.\n\nThe bottom line is that governments recent payments represent a tiny fraction of the GCDs $3.5 billion which is already a substantial discount on the actual value of the properties, and these payments have reached fewer than 10% of farmers, stated Theron.\n\nThe FCA was originally presented as interim relief payments for distressed farmers, but is now being repositioned and repackaged as a comprehensive compensation solution.\n\nThis is simply not the case.\n\nThe Land Compensation Committee approved compensation for 740 former white farmers, which the former white farmers committee says is only a fraction of the over 4,500 who were displaced by the land grabs.\n\nIn reality, only a small token payment has been made and thousands of farmers, the significant majority by number remain uncompensated, Theron said.\n\nLater former President Robert Mugabe pioneered the land reform programme in 2000 which saw violent evictions of more than 4000 white farmers.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/24024537/White-Farmers.jpg",
            "description": "<p>By Staff Reporter A group of former white farmers who were displaced during the 2000s land reform programme has rejected the government’s dollar-bonds compensation deal, citing that it is reliant on “very uncertain and very high-risk” long-term payouts. Finance Minister Mthuli Ncube recently revealed that treasury bonds worth US$308 million and cash payments had been</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-elderly-desperate-and-destitute-being-used-to-pretend-compensation-has-been-resolved-former-white-farmers-reject-govts-treasury-bonds-deal-say-finance-ministers-claims/\">“The elderly, desperate and destitute being used to pretend compensation has been resolved” – former white farmers reject govt’s dollar bonds deal; say Finance minister’s claims “misleading”</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "ZimRE plots AFCFTA-linked regional expansion",
            "url": "https://www.newzimbabwe.com/zimre-plots-afcfta-linked-regional-expansion/",
            "content": "By Alois Vinga\n\nZimRE Holdings Limited (ZHL) has tabled plans to pursue a regional expansion strategy riding on the opportunities presented by the African Continental Free Trade Area (AfCFTA).\n\nThe AfCFTA is a free trade area encompassing most of Africa, designed to create a single continental market for goods and services with the objective of boosting intra-African trade, increasing industrialisation. It is the worlds largest free trade area by number of participating countries, connecting 1,3 billion people across 55 countries.\n\nPresenting the group performance for the period ended December 31 2024, ZHL board chairman, Desmond Matete, said going forward, regional expansion will be a priority.\n\nAs we look to 2025, the Group is focused on regional expansion and market diversification, strengthening operations across Sub-Saharan Africa, leveraging on the African Continental Free Trade Area (AfCFTA) to access new opportunities, he said.\n\nHe said a key priority for this year is the implementation of Phase 2 of the amalgamation exercise through the potential listing of Emeritus International on the Botswana Stock Exchange. The listing will upscale the balance sheets of the regional subsidiaries, improving underwriting capacity to enhance competitiveness while exposing the Group to international best practice.\n\nAdditionally, the Eagle REIT listing in 2025 is expected to unlock shareholder value, enhance brand visibility and optimise asset returns. To drive operational efficiency, the Group is accelerating its digital transformation agenda, enhancing customer experiences through technology-driven insurance and wealth management solutions. A key focus is ensuring responsible data usage and stakeholder protection, reinforcing ZHLs position as a trusted financial services provider.\n\nDuring the period, insurance contract revenue recorded a significant increase of 24%, from USD50.0 million to USD61.86 million, attributable to strong business growth in key business segments, namely life and pension, local reinsurance, and the Mozambique reinsurance operations, with a combined contribution of 63% up from 61% in 2023.\n\nOverall, the key revenue growth drivers were increased market share locally, thanks to a diverse range of products; external business partnerships, new life business written and expansion into the rest of Africa through the Groups regional business units, added Matete.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17053744/Screenshot-2025-04-17-at-06.37.32.png",
            "description": "<p>By Alois Vinga ZimRE Holdings Limited (ZHL) has tabled plans to pursue a regional expansion strategy riding on the opportunities presented by the African Continental Free Trade Area  (AfCFTA). The AfCFTA is a free trade area encompassing most of Africa, designed to create a single continental market for goods and services with the objective of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimre-plots-afcfta-linked-regional-expansion/\">ZimRE plots AFCFTA-linked regional expansion</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "Masomere joins Division One Side Hardrock  FC",
            "url": "https://www.newzimbabwe.com/masomere-joins-division-one-side-hardrock-fc/",
            "content": "By Sports Reporter\n\nBarelythree days after he was fired by Triangle as head coach, Luke Masomere has been appointed technical director for Central Region Division One League side Hardrock FC.\n\nAlthough details of his new contract with Hardrock have not been disclosed, Masomere is expected to guide Hardrocks technical team, led by head coach Calvin Maphosa.\n\nSpeaking after joining Hardrock, Masomere said, I feel very much honoured to be here. I promise to meet the targets set by the club and I will have to work very hard to achieve that. I wont do it alone; we are going to do it as a team.\n\nThe players will play their part and as the technical we will also play our part as well as the executive and the sponsor, so its a collective thing. I think we will work well together and produce the desired results.\n\nMasomere is a seasoned coach who has won several titles in Zimbabwean football. In 2018, he guided Manica Diamonds to a promotion into the top-flight league after winning the Eastern Region Division One League title.\n\nLast year, Vahombe won the same title with his former club Triangle, which he parted ways with earlier this week.\n\nMasomere made history in 2003 when he won the PSL championship with Amazulu.\n\nCommenting on Masomeres appointment Hardrock spokesperson, Garikayi Matava said, Masomere brings a wealth of experience and expertise to the role, with a proven track record.\n\nAs the Technical Director, he will be heading up the technical team and providing guidance and support to ensure successful project delivery.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17053217/IMG-20250416-WA0030.jpg",
            "description": "<p>By Sports Reporter Barely three days after he was fired by Triangle as head coach, Luke Masomere has been appointed technical director for Central Region Division One League side Hardrock FC. Although details of his new contract with Hardrock have not been disclosed, Masomere is expected to guide Hardrock’s technical team, led by head coach Calvin</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/masomere-joins-division-one-side-hardrock-fc/\">Masomere joins Division One Side Hardrock  FC </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "Harare residents call for probe into approval of illegal Vainona building; say they will not bear costs for council’s gross incompetence",
            "url": "https://www.newzimbabwe.com/harare-residents-call-for-probe-into-approval-of-illegal-vainona-building-say-they-will-not-bear-costs-for-councils-gross-incompetence/",
            "content": "By Darlington Gatsi\n\nHARARE residents have called for heads to roll at the City Council following revelations that senior officials corruptly approved the construction of a double-storey building in Vainona despite glaring irregularities.\n\nThe double-storey building, situated at the corner of Alpes and Grant roads, is one of many construction projects that the City of Harare improperly approved.\n\nThe building, which is nearing completion, is set for demolition after it emerged at the Commission of Inquiry probing the operations of the City Council that it violated by-laws.\n\nThis will set the stage for a potential legal tussle between the City of Harare and the owner, as the structure is almost complete.\n\nIn a statement, the Combined Harare Residents Association (CHRA) said the City Council should institute a special committee to probe the approval of plans of this nature.\n\nThe Combined Harare Residents Association is urgently calling for the Harare City Council to conduct a Special Council Meeting to constitute an Investigation Committee to interrogate the error that was made in approving the construction of a double-storey building by the local authority on an illegal piece of land in Vainona, and take disciplinary measures, including the dismissal of all employees found liable for this costly decision.\n\nIn terms of Section 100(1)(a) of the Urban Councils Act [29:15], the Harare City Council is empowered to set up a Special Committee to conduct investigations, especially on pertinent issues of this nature. Considering the magnitude of this issue and the oversight function of the council as provided in the Urban Councils Act [29:15], turning a blind eye on this matter will make elected representatives (councillors) accomplices, read the statement.\n\nWith the Council realising that it erred in approving the plan, residents will bear the brunt of paying the compensation costs as the building faces demolition. The double-storey building infringes on the frontage line and extends onto Alpes Road.\n\nCHRA said residents cannot shoulder the consequences of the City of Harares rushed approval.\n\nWe affirm that residents and ratepayers of Harare cannot bear the consequences and cost of this gross incompetence and maladministration within the City of Harares planning division without disciplinary measures being taken, read the statement.\n\nThe Harare City Council has come under intense scrutiny after overseeing the approval of questionable plans.\n\nAuthorities at Town House have conceded that certain plans were approved without due diligence.\n\nCHRA said the Vainona building is not an isolated case, as many approved projects violate the council bylaws.\n\nThe Vainona case is similar to other construction activities that have been approved by the local authority in Ecologically Sensitive Areas (wetlands) gazetted by the Government of Zimbabwe across the city.\n\nWe suspect that there were some underhand dealings relating to this matter, hence we call on the local authority to conduct an urgent investigation, read the statement further.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17052343/vainona-building.jpeg",
            "description": "<p>By Darlington Gatsi HARARE residents have called for heads to roll at the City Council following revelations that senior officials corruptly approved the construction of a double-storey building in Vainona despite glaring irregularities. The double-storey building, situated at the corner of Alpes and Grant roads, is one of many construction projects that the City of</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-residents-call-for-probe-into-approval-of-illegal-vainona-building-say-they-will-not-bear-costs-for-councils-gross-incompetence/\">Harare residents call for probe into approval of illegal Vainona building; say they will not bear costs for council’s gross incompetence</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "In landmark ruling, UK’s top court says legal definition of woman refers to biological sex",
            "url": "https://www.newzimbabwe.com/in-landmark-ruling-uks-top-court-says-legal-definition-of-woman-refers-to-biological-sex/",
            "content": "Reuters\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17050203/Screenshot-2025-04-17-at-06.01.37.png",
            "description": "<p>Reuters Britain’s highest court ruled on Wednesday that only biological and not trans women meet the definition of a woman under equality laws, a landmark decision greeted with concern by trans supporters but welcomed by the government as bringing clarity. The much anticipated ruling centred on whether a trans woman with a gender recognition certificate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/in-landmark-ruling-uks-top-court-says-legal-definition-of-woman-refers-to-biological-sex/\">In landmark ruling, UK’s top court says legal definition of woman refers to biological sex</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        },
        {
            "title": "Love Triangle turns Deadly: Zimbabwean man killed in brutal bakkie attack in Sandton",
            "url": "https://www.newzimbabwe.com/love-triangle-turns-deadly-zimbabwean-man-killed-in-brutal-bakkie-attack-in-sandton/",
            "content": "IOL\n\nJoburg-based activist Moreboys Munetsi has intervened to assist the family of a Zimbabwean man, Emmanuel Mahamba, who was brutally murdered in a horrific incident which has sent shockwaves in South Africa.\n\nIn a video, widely shared on social media, Mahamba is seen seated on the road while a Ford Ranger runs over him repeatedly. He died at the scene.\n\nGauteng police said they were still searching for the motorist implicated in the brutal death of a man following a heated dispute.\n\nMunetsi, a lawyer by profession, said he was providing legal support to the victims family.\n\nFor now I am giving the family legal support. At the same time, we were encouraging the Zimbabwean community in Joburg to raise funeral money through contributions. The funeral contributions are coming from the Zimbabwean community, Munetsi told IOL.\n\nMunetsi is popular among the South African and Zimbabwean communities in Gauteng as an anti-crime and social cohesion activist.\n\nHe is also a successful businessman who runs an international company, Greathope Insurance.\n\nSpeaking about the incident, Munetsi said: The body of Emmanuel has been repatriated already for burial in Zimbabwe.\n\nEmmanuels murder has attracted international news headlines, with many social media users questioning why the alleged killer has not been arrested.\n\nThe incident unfolded on April 5, 2025, in Rivonia, Sandton, and culminated in a tragic and violent confrontation that ended in Mahamba being run over by a Ford Ranger bakkie multiple times.\n\nOn his Facebook page, which has more than 144,000 followers, Munetsi held a live conversation with Ntombi, the woman who was involved in a relationship with Mahamba, while she lived with her other romantic partner.\n\nThe Ugandan man, who has two children with Ntombi, allegedly murdered Emmanuel in the bakkie attack.\n\nI agree that I once dated Emmanuel in January, and we broke up in February. Yes, we were in a relationship. We broke up because some Ugandans recorded a video of me when I was with the guy (Emmanuel). My baby daddy is a Ugandan. So I broke up with Emmanuel for my safety, for my kids and also for the sake of Emmanuel. I stopped talking to Emmanuel.\n\nNtombi said on the fateful day, Emmanuel and some Ugandan men who lived at the same house with, came over to her work premises. Ntombis baby daddy was already at the business premises, where motorbike parts are sold.\n\nLater on, I heard some noise, people fighting. When I went outside, I asked Emmanuel what he was doing, but he did not even respond to me; he only looked at me. He was holding a stone, and he threw it away. He picked it again and hit the vehicles (wind) screen. That is when my baby daddy got angry, went to Emmanuel and beat him, she said.\n\nSUSPECT WANTED FOR MURDER\n\nPolice are looking for a suspect who was driving a black Ford Ranger Double cab wiyh registration number KV10WLGP in Sandton, Rivonia next to Mzanzi building anyone with information can contact the police on 08600 10111.pic.twitter.com/HC2fq60B80\n\nIn the video, Ntombi can be seen screaming, frantically trying to stop the Ford Ranger driver.\n\nNarrating how she fell in love with the deceased man, Ntombi said she met Emmanuel at Rivonia, Sandton, as he used to come to the shop that she works at, buying motorbike parts.\n\nShe said when she met Emmanuel this year, she was still involved with the Ugandan man although the relationship was experiencing some difficulties. Ntombi was living with the Ugandan man when she started dating Emmanuel.\n\nI had to date Emmanuel, she told Munetsi in the Facebook live session.\n\nNtombi has two children with the Ugandan man and the two have been in a relationship for around three years.\n\nThe Ugandan men who came to the premises with Emmanuel, according to Ntombi, had previously recorded a video of her and Emmanuel and they had also informed Ntombis other boyfriend, the Ugandan man who drives a Ford Ranger.\n\nEmmanuel had not told me that he was staying (at a house) with Ugandans. I was at Emmanuels place and I went out, they recorded the video and sent it to my boyfriend, the baby daddy. In the video, I was walking while holding hands with Emmanuel. I then told Emmanuel that we had to end our relationship, she said.\n\nNtombi said she was confronted angrily by her baby daddy over her romantic relationship with Emmanuel. She said the Ugandan man was very angry, and she decided to end things with Emmanuel.\n\nPolice spokesperson, Colonel Dimakatso Nevhuhulwi, said police received a complaint regarding the incident and upon arrival, they found a man lying on the side of the road with injuries all over his body.\n\nThe paramedics declared him dead on the scene. According to information at hand, the victim reportedly argued with the shop owner and allegedly hit the shop owners vehicle with a brick, breaking the windscreen. The shop owner reportedly came out and drove over his body several times before fleeing the scene, said Nevhuhulwi.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/04/17045656/A-woman-only-identified-as-Ntombi-has-narrated-how-her-baby-daddy-a-Ugandan-national-who-is-on-the-run-brutally-murdered-her-former-boyfriend-Zimbabwean-national-Emmanuel-Mahamba.webp",
            "description": "<p>IOL Joburg-based activist Moreboys Munetsi has intervened to assist the family of a Zimbabwean man, Emmanuel Mahamba, who was brutally murdered in a horrific incident which has sent shockwaves in South Africa. In a video, widely shared on social media, Mahamba is seen seated on the road while a Ford Ranger runs over him repeatedly.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/love-triangle-turns-deadly-zimbabwean-man-killed-in-brutal-bakkie-attack-in-sandton/\">Love Triangle turns Deadly: Zimbabwean man killed in brutal bakkie attack in Sandton</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:36",
            "date": "18 Apr 2025"
        }
    ]
}