{
    "news": [
        {
            "title": "Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals",
            "url": "https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/",
            "content": "By Thandiwe Garusa\n\nA police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura.\n\nThe weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two counts of murder, attempted murder, and possession of an illegal firearm.\n\nNational police spokesperson Assistant Commissioner Paul Nyathi confirmed the findings, saying, The gun which killed the policeman is the same pistol which killed the businessman Mutangadura.\n\nMutangadura was murdered on the night of August 17, 2025, when seven armed robbers wearing balaclavas stormed his farmhouse. They attacked a security guard and the businessmans son before shooting him.\n\nSo far, police have arrested three suspects: Given Mandizadza (34), Phillip Mutasa (38), and Vengesai Jabulani Mutasa, while four other accomplices remain at large.\n\nVengesai Jabulani Mutasa\n\nVengesai initially shot Detective Constable Ngwenya of CID Homicide, who was part of a team trying to apprehend him for Mutangaduras murder, before fleeing arrest.\n\nHe later went to the police station on Sunday, where he found Constable Courage Muchechesi taking a statement from Abraham Mavayo, who was reporting an assault case.\n\nPolice said Vengesai confronted officers at the station, accusing homicide detectives of stealing US$1,000 from his home and demanding to see them.\n\nHe allegedly forced Constable Muchechesi and Mavayo to lie down while demanding money before shooting Muchechesi in the stomach.\n\nMuchechesi staggered out of the building, calling for help, and collapsed near the single quarters where he was later found dead by fellow officers.\n\nHe fled the station and was later arrested by residents from Sanyati, Kadoma, Chakari, and Patchway who had joined forces to track him down.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/18132443/Joseph-Mutangazi-Mutangadura-1280px-t-feat-750x375-1.webp",
            "description": "<p>By Thandiwe Garusa A police ballistics examination has revealed that the firearm used to fatally shoot a police officer at Sanyati Police Station is the same gun used in the murder of Ruwa businessman Joseph Mutangadura. The weapon was recovered following the arrest of Vengesai Jabulani Mutasa (41), who now faces multiple charges, including two</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/gun-used-to-kill-sanyati-cop-was-also-used-in-mutangaduras-murder-ballistics-exam-reveals/\">Gun used to kill Sanyati cop was also used in Mutangadura’s murder – ballistics exam reveals</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "28 Oct 2025"
        },
        {
            "title": "CZI says RBZ on track to meet 2025 inflation target",
            "url": "https://www.newzimbabwe.com/czi-says-rbz-on-track-to-meet-2025-inflation-target/",
            "content": "By Alois Vinga\n\nThe Confederation of Zimbabwe Industries (CZI) says the annual inflation target set by the Reserve Bank of Zimbabwe (RBZ) remains within reach, citing consistency in the implementation of inflation containment measures.\n\nAccording to the Zimbabwe National Statistics Agency (Zimstat), the Zimbabwe Gold (ZWG) currency has maintained notable stability against the US dollar since September 2024, when it last experienced a major dip.\n\nZimstat data shows that month-on-month inflation stood at -0.2% in September 2025, down by 0.6 percentage points from 0.4% in August 2025.\n\nIn its latest inflation tracker, CZI expressed optimism that the RBZ will meet its 2025 inflation target by year-end.\n\nIf ZiG month-on-month inflation continues to grow by less than 1% in the next four months to December 2025, annual inflation is projected to be less than 20% in December 2025, CZI said.\n\nThis implies that the 2025 Midterm Monetary Policy Statement (MPS) targets, of keeping annual ZiG inflation below 30% and month-on-month inflation between 1% and 3%, are likely to be achieved.\n\nThe industry body noted that between July and late August 2025, the ZiG appreciated on both the official and parallel markets. Despite this, the parallel market premium remained relatively constant at around 27%, indicating some degree of exchange rate convergence.\n\nCZI added that the still-high annual inflation rate largely reflects the September 2024 devaluation of the ZiG, and that inflation pressures are expected to ease further in October 2025, provided no new shocks emerge.\n\nAfter rising in July 2025, month-on-month inflation eased to 0.4% in August 2025, a development CZI attributed to the effectiveness of the current tight monetary policy stance in stabilising prices, albeit under constrained liquidity conditions.\n\nIn the long term, monetary policy will need to gradually ease liquidity conditions as stability becomes more sustainable, CZI said.\n\nKeeping inflation below 1% enhances price stability and broadens the use of the ZiG beyond a transaction currency. Businesses that previously preferred USD-only transactions are now slowly encouraging ZiG payments to meet some of their monthly obligations.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171617/rbz-.jpg",
            "description": "<p>By Alois Vinga The Confederation of Zimbabwe Industries (CZI) says the annual inflation target set by the Reserve Bank of Zimbabwe (RBZ) remains within reach, citing consistency in the implementation of inflation containment measures. According to the Zimbabwe National Statistics Agency (Zimstat), the Zimbabwe Gold (ZWG) currency has maintained notable stability against the US dollar</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/czi-says-rbz-on-track-to-meet-2025-inflation-target/\">CZI says RBZ on track to meet 2025 inflation target</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "28 Oct 2025"
        },
        {
            "title": "ZIFA’s hunt for new Warriors coach begins",
            "url": "https://www.newzimbabwe.com/zifas-hunt-for-new-warriors-coach-begins/",
            "content": "By Sports Reporter\n\nThe Zimbabwe Football Association (ZIFA) has begun its hunt for a new Warriors coach, following the sacking of German tactician Michael Nees last week.\n\nCalls for applications for the vacant post were advertised by ZIFA on Monday, with a CAF Pro license being the minimum requirement.\n\nSources at ZIFA told New Zimbabwe.com that the association is not planning to settle for a local coach, but prefer one Europe.\n\nWith less than two months before the 2025 AFCON finals start, ZIFA is expected to complete the recruitment process next week to give the incoming coach time to prepare for the continental tournament.\n\nIn the last seven years, the association has hired seven coaches, among them five locals and two foreigners.\n\nNees was fired for posting poor results, as he only managed two wins in the 14 games he was in charge.\n\nHe however, helped Zimbabwe qualify for the upcoming AFCON finals, which was a part of his goals.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/20185711/warriors-.webp",
            "description": "<p>By Sports Reporter The Zimbabwe Football Association (ZIFA) has begun its hunt for a new Warriors coach, following the sacking of German tactician Michael Nees last week. Calls for applications for the vacant post were advertised by ZIFA on Monday, with a CAF Pro license being the minimum requirement. Sources at ZIFA told New Zimbabwe.com</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifas-hunt-for-new-warriors-coach-begins/\">ZIFA’s hunt for new Warriors coach begins</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "28 Oct 2025"
        },
        {
            "title": "Cameroon’s 92-year-old President Paul Biya re-elected to eighth term, opposition reports gunfire",
            "url": "https://www.newzimbabwe.com/cameroons-92-year-old-president-paul-biya-re-elected-to-eighth-term-opposition-reports-gunfire/",
            "content": "Cameroons PresidentPaul Biyawas re-elected to an eighth term with 53.66% of the vote, official results showed on Monday, raising the prospect of confrontations with supporters of the main opposition candidate who has claimed victory.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/10/23000209/Paul-Biya.jpg",
            "description": "<p>Reuters Cameroon’s President Paul Biya was re-elected to an eighth term with 53.66% of the vote, official results showed on Monday, raising the prospect of confrontations with supporters of the main opposition candidate who has claimed victory. After the results were announced by the Constitutional Council, opposition challenger Issa Tchiroma Bakary wrote on Facebook that gunfire</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/cameroons-92-year-old-president-paul-biya-re-elected-to-eighth-term-opposition-reports-gunfire/\">Cameroon’s 92-year-old President Paul Biya re-elected to eighth term, opposition reports gunfire</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "28 Oct 2025"
        },
        {
            "title": "High Court boots out former Duly’s manager’s car claim — says Labour Court has exclusive jurisdiction",
            "url": "https://www.newzimbabwe.com/high-court-boots-out-former-dulys-managers-car-claim-says-labour-court-has-exclusive-jurisdiction/",
            "content": "By Mary Taruvinga\n\nThe High Court has struck off a claim by retired Duly Holdings Limited administrator, Theresa Ruredzo, who was demanding a Ford Everest vehicle as part of her terminal benefits, ruling that the matter belongs in the Labour Court, not the High Court.\n\nJustice Munangati-Manongwa upheld a special plea filed by the vehicle dealer, agreeing that Ruredzos case, though framed as a contractual dispute, was fundamentally rooted in her former employment and thus a labour matter.\n\nIt is evident that the plaintiffs claim, despite its contractual framing, fundamentally relates to the employment relationship and the associated terminal benefits, ruled the judge.\n\nHence, the Labour Court possesses exclusive jurisdiction to resolve such disputes.\n\nRuredzo, who worked for 31 years and two months at Duly Holdings, rising from clerk typist to national administration manager, retired in November 2017. She told the court that the company failed to pay her full terminal benefits and later agreed to compensate her with a Ford Everest to be delivered within five years  a promise she said was never fulfilled.\n\nHer lawyer argued that the case was purely contractual since the agreement to deliver the vehicle was made after her retirement, and therefore outside the Labour Courts reach. He cited previous judgments suggesting that post-employment contracts do not qualify as labour disputes.\n\nBut Duly Holdings countered that Ruredzos demand amounted to a claim for unpaid terminal benefits, squarely falling under labour law. The company argued that the 2013 Constitution and subsequent amendments to the Labour Act gave the Labour Court exclusive jurisdiction over such employment-related claims.\n\nThe plaintiff has brought her claim before the wrong court, the defence argued, relying on a string of Supreme Court decisions affirming that even cleverly framed contractual claims cannot escape the Labour Courts authority.\n\nJustice Priscilla Munangati-Manongwa agreed, noting that while Ruredzo tried to repackage her claim as a private contract, the car in question was undeniably part of her terminal benefits.\n\nThe agreement for the delivery of the Ford Everest motor vehicle is intrinsically linked to the employment relationship between the plaintiff and the defendant, the judge said. This brings the claim squarely within the jurisdiction of the Labour Court.\n\nThe court upheld Duly Holdings special plea and ordered Ruredzo to pay costs.\n\nRuredzos long-running fight for her promised Ford Everest is now likely to continue before the Labour Court, the only forum legally empowered to decide whether Duly Holdings must finally deliver the vehicle.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3-e1760934227524.jpg",
            "description": "<p>By Mary Taruvinga The High Court has struck off a claim by retired Duly Holdings Limited administrator, Theresa Ruredzo, who was demanding a Ford Everest vehicle as part of her terminal benefits, ruling that the matter belongs in the Labour Court, not the High Court. Justice Munangati-Manongwa upheld a special plea filed by the vehicle</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-boots-out-former-dulys-managers-car-claim-says-labour-court-has-exclusive-jurisdiction/\">High Court boots out former Duly’s manager’s car claim — says Labour Court has exclusive jurisdiction</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "28 Oct 2025"
        },
        {
            "title": "From Zimbabwe to Bay of Plenty: Family builds future on truffle farm",
            "url": "https://www.newzimbabwe.com/from-zimbabwe-to-bay-of-plenty-family-builds-future-on-truffle-farm/",
            "content": "NZ Herald\n\nZimbabwean couple Nikki and Lance Dodd met at university in Cape Town, South Africa, where she was studying interior design and he was studying horticulture. Their future plans were abruptly halted by the start of political unrest in Zimbabwe, leading to a long journey searching for a place to call home.\n\nWe are both from farming backgrounds and after university we intended to return to my parents farm in Zimbabwe and diversify from tobacco into berries and stone fruit, says Lance.\n\nThen we got the call in early 2000 saying dont come home, get a job. Both family farms had been requisitioned by the Zimbabwean Government and with no farms to go back to, everything was lost for both families.\n\nBy the early 2000s, Nikkis mum, dad, sister and two brothers had emigrated to New Zealand. Lances family went overseas but his father remains in Zimbabwe.\n\nA few fresh starts\n\nI followed Lance, and we went to the UK on an ancestral visa as we both had UK grandparents, says Nikki. It gave us the space to earn over there and work out what to do next.\n\nThis path led them back to Africa in 2003. Lance worked for a British company on a Kenyan flower farm that exported to Europe.\n\nThe couple had two children Hayley (now 17) and Matthew (now 14) and enjoyed living on a 20,000ha game farm with 200-300ha set aside for the flowers. They describe it as beautiful and remained there for 10 years until political unrest between Kenya, Somalia and Sudan made life dangerous once more and the family left the country.\n\nWe had visited my family in New Zealand several times over the years, so it made sense to come here. They lived a safe and peaceful life with their families, says Nikki.\n\nNikki in the truffire training Indie the springer spaniel pup to hunt for truffles. Photo / Supplied\n\nThe Dodds moved to the Bay of Plenty in 2012, with Lance finding work in the kiwifruit packhouses and later working in a management role.\n\nIts hard starting again from scratch, but we knew we had finally found somewhere safe and around family and where we could finally put down roots, says Lance.\n\nA place of their own\n\nThe couple began looking at lifestyle properties where they could live, work and give their children a rural life similar to the one they experienced when young.\n\nWhen Lance first saw a truffle farm near Te Puke for sale it was out of budget, but he noticed it again 10 months later and the price was now within reach.\n\nLance looked at it with a friend and before he even had time to tell us, hed put an offer on and approached the bank for finance! says Nikki.\n\nThe property was an 8ha block where previous owners Maureen and Colin Binns had established a truffle farm and ran truffle tasting tours to teach people about an almost mystical fungus, the black Prigord truffle.\n\nLance saw the possibilities and luckily so did his family when they visited for the first time. They moved in December 2024.\n\nAs well as the truffiere, we have an idyllic 3.5ha of QEII covenanted New Zealand bush and a crystal-clear waterway, which Maureen and Colin looked after so well. We are certainly happy to take over their legacy and have plans to resurrect the 8km of walkways through the forest and share the beauty with others, says Lance.\n\nHaving never seen a truffle before buying the property, its been a steep learning curve for Nikki and Lance. Despite being four hours drive away, Maureen and Colin have returned several times to pass on their wisdom and knowledge, something the Dodds are hugely grateful for.\n\nThis included using truffles for culinary delights and how to train a dog to hunt for truffles.\n\nSix-month-old springer spaniel Indie is doing well and Nikki says that she already goes into the truffiere and finds truffles.\n\nShe still rushes a bit but Im finding it amazing to be forming a strong bond with a dog and learning to read her, says Nikki.\n\nHayley Dodd with pet piglet Piggywig. Photo / Supplied\n\nHayley has a pet pig and Lance is interested in seeing if he can train it to truffle hunt as pigs are traditionally used for that role in Europe.\n\nOther animals include three cows, 12 sheep for mowing, 18 chickens and beehives from a local beekeeper.\n\nBy July 2025, Lance had committed to working fulltime on their property. Alongside the summer and winter truffle seasons and the summer truffle tours, the couple intend to grow exotic mushrooms such as oyster, shiitake and enoki to provide a consistent, year-round income.\n\nAfter being caught up in turbulent times overseas, the family has finally found peace and a home to call their own.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/27064937/DOD-FAMILY.jpg",
            "description": "<p>NZ Herald Zimbabwean couple Nikki and Lance Dodd met at university in Cape Town, South Africa, where she was studying interior design and he was studying horticulture. Their future plans were abruptly halted by the start of political unrest in Zimbabwe, leading to a long journey searching for a place to call home. “We are</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/from-zimbabwe-to-bay-of-plenty-family-builds-future-on-truffle-farm/\">From Zimbabwe to Bay of Plenty: Family builds future on truffle farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:10",
            "date": "28 Oct 2025"
        }
    ]
}