{
    "news": [
        {
            "title": "Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats",
            "url": "https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/",
            "content": "By Staff Reporter\n\nFORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF partys primary elections.\n\nKaroro spoke following Mutukudzis appearance as a State witness in a case he is facing charges of diverting agricultural inputs.\n\nHe said Mutukudzi and Chikwamba were bitter that they had failed to unseat him in 2015, 2018 and 2023 when he won the election while on remand as a result of the case.\n\nThe primaries sought a candidate from Mbire constituency to represent Zanu PF in Parliamentary elections.\n\nAt the time the allegations arose, Chikwamba was the partys District Coordinating Committee (DCC) Chairperson while Mutukudzi was his deputy.\n\nMutukudzi told the court that he was informed by a certain Zanu PF leader of suspicious trucks, allegedly linked to Karoro, that were loading fertiliser at GMB Mushumbi depot.\n\nHe said he then proceeded, with the blessing of Chikwamba, to file a report with the police. Chikwamba accompanied him.\n\nMutukudzi admitted that he lost thrice to Karoro in the race to represent Mbire in Parliament but said he was not bitter. He said it was just human nature to want to win.\n\nIt is human nature to want to win every election, said Mutukudzi, to which Karoros lawyer Admire Rubaya further asked if he was happy with the defeat.\n\nRubaya questioned why malpractices at GMB would be reported to him if he was neither a government official nor an interested party.\n\nThe matter continues on Friday before Regional Magistrate Marehwanazvo Gofa.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Staff Reporter FORMER Deputy Minister of Agriculture Douglas Karoro has said political rivals Takesure Chikwamba and Charles Mutukudzi are behind allegations that he stole fertiliser from the Grain Marketing Board (GMB) mainly because he has beaten them thrice in the Zanu PF party’s primary elections. Karoro spoke following Mutukudzi’s appearance as a State witness</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/former-agriculture-deputy-minister-claims-zanu-pf-rivals-are-targeting-him-for-successive-election-defeats/\">Former Agriculture deputy minister claims Zanu PF rivals are targeting him for successive election defeats </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "A Fragile State: Zimbabwe Reckons With the Catastrophic Loss of US Aid",
            "url": "https://www.newzimbabwe.com/a-fragile-state-zimbabwe-reckons-with-the-catastrophic-loss-of-us-aid/",
            "content": "By Linda Mujuru and Gamuchirai Masiyiwa, GPJ Zimbabwe\n\nThis story was originally published byGlobal Press Journal.\n\nHARARE, ZIMBABWE  Eliza Mandove was a child when her brother was killed during Zimbabwes war for independence. She was beaten during the same attack and sustained injuries to her hands and legs. Now 46, Mandove has no motor function in her left hand and struggles to walk and carry heavy loads. She suffers from chronic headaches. She cant work in the fields. Her husband once farmed, but years of drought and erratic rainfall have led to diminishing yields.\n\nAid from the United States was crucial. It kept Mandoves family of seven fed.\n\nIn January, that food aid abruptly stopped. On his first day in office, US President Donald Trump signed an executive order that ended nearly all foreign aid. Mandove and her family  and many others  were left with very little.\n\nThe end of US foreign aid was abrupt. In Zimbabwe, the sudden suspension put many at immediate risk ofhunger. In Uganda, health workers told patients to collect their antiretroviral drugs before clinicsshut down. In Bangladesh, tuberculosis specialists were immediatelylaid off, leaving people with that illness without care.\n\nStories like this emerged around the world.\n\nThe sudden pullout has left a crisis behind. The aid had been a lifeline for millions since the United States Agency for International Development, the US foreign aid agency, was formed in 1961. At the same time, it failed to transform the economies and governance of low-income countries. In the worst cases, it enabled corruption.\n\nIn Zimbabwe alone, nearly US$7 billion in US aid poured in between 1980 and 2025. But in the four decades since its independence from colonial rule, the countrys per capita gross domestic product hasfallen by almost10%. It is poorer today than it was then.\n\nForeign aid, in most cases, feeds people and offers them medical aid one day at a time.\n\nInvestment from China, on the other hand, continues to sweep across the continent. Overall, that investment is creating stable jobs and infrastructure that has the potential to upend decades of reliance on that aid. The question now in Zimbabwe, as in other African countries, is whether this new era will be the one that, at last, brings economic transformation.\n\nTurning that corner wont be easy, says Persistence Gwanyanya, a member of the monetary policy committee of the Reserve Bank of Zimbabwe. Reliance on aid led to the countrys leadership being a bit relaxed when it comes to economic responsibility.\n\nDonors were coming in to fill the gap, he says.\n\nNow, he adds, is the time for change.\n\nWe just have to live within our budget, he says. We need to be more accountable.\n\nZimbabwe was one of the last African countries to gain its independence from European colonial occupation. In 1980, following a bitter civil war, a revolutionary movement led by Robert Mugabe succeeded in overthrowing a white minority government that had itself seceded from the British empire in 1965. The country benefited from infrastructure built under the white-controlled government that, for a while, sustained society.\n\nOur parents could take care of us with ease, says Tellmore Mutize, 63, a dressmaker from Harare who reached adulthood just as the country gained independence.\n\nThere were jobs, she says. Groceries were cheap, and schools were free. When she gave birth to her first child in a public hospital in 1980, she paid nothing and received top-quality care. When she had twins five years later, the experience was much the same.\n\nColonialism left many parts of Africa in shambles and with an impossible task: emerge from decades of oppressive foreign control to effectively manage natural resources, maintain infrastructure and meet peoples health care, humanitarian and economic needs.\n\nDuring the Cold War, a decadeslong showdown between the US and Russia, the US wielded soft power and won global influence with USAID. Since 1946, the US has budgeted over US$1.1 trillion in foreign assistance to Africa, for everything from emergency food aid to HIV/AIDS relief, from early childhood education programs to civil society development.\n\nDeep corruption was beginning to take root, and human rights abuses were a real threat. Poverty remained a problem. But for many black Zimbabweans, life was easier than it had been for generations.\n\nAbundant rainfall boosted agriculture, reinforcing Zimbabwes reputation as Africas breadbasket. The economy grew in bursts, and the health care systemdrew medical touristsfrom across Africa.\n\nThen came disaster. The regions worst drought set in in 1992, leading to a widespread food shortage. The price of groceries skyrocketed. The droughts effects rippled through many sectors, including health care, where hospitals struggled to maintain adequate services.\n\nAs crops dried up, so did public spending. The World Bank began to require countries receiving funding to agree to market reforms, often characterized by privatizing state-owned industries, ending food subsidies and enacting user fees at hospitals.\n\nMaize flour and cooking oil began to flow in from donors like the Red Cross and Save the Children.\n\nWhen they came, we were happy because in 1992, there was no food, Mutize says.\n\nEight years later, Mugabe began expropriating thousands of large, white-owned farms dating from the countrys colonialism era.\n\nFarm workers, villagers and veterans of Zimbabwes war for independence invaded those white-owned farms, leading to 40 deaths (34 black Zimbabweans and six white farmers) and countless assaults. Eventually, those large farms were converted into about 170,000 smaller properties. Much of the land was snatched up by powerful political players; other parcels went to ordinary people who reveled in owning land after generations of oppression.\n\nThe chaotic, rushed and violent nature of the land reforms led to a massive withdrawal of international investment. Zimbabwes central bank began recklessly printing cash. Hyperinflation took root. Corruption ballooned. Public services collapsed.\n\nBy the time Mutize was ready to give birth to her last child in 2003, public hospitals had deteriorated. She paid out of pocket to give birth at a private hospital.\n\nTwo-thirds of the population required food aid in 2002 and 2003. US aidquickly grew, from US$42 million in 2002 to US$120 million in 2007 and US$260 million in 2009. Even so, between 1999 and 2008, Zimbabwes GDP dropped by 49%  the most severe economic downturn in a country not at war, according to a2019 report from the African Development Bank.\n\nBetween 2014 and 2024, PEPFAR, a giant US health program aimed at treating and containing the spread of HIV/AIDS, supplied on average 18% of Zimbabwes national health budget. In 2019, amid chaotic inflation and massive cuts to the health budget, donor contributions to the health budget were 4.5 times larger than Zimbabwes contribution to its own health ministrys budget.\n\nTotal US aid to Zimbabwe peaked at US$340 million in 2022. In 2024, the last full year before the US slashed foreign aid, it totaled US$290 million.\n\nNevertheless, over a third of Zimbabweans continue to live in poverty: Around 35% of Zimbabwes close to 17 million people live on just US$2.15 per day.\n\nEconomists in Africa and throughout the world have struggled to understand why so much aid hasnt brought about structural transformation. Though health aid has had some big successes  new HIV infections in Zimbabwe, for example,declined more than tenfoldfrom a high in the early 1990s  the Zimbabwean economy is chronically unstable.\n\nIn February, Elon Musk, the unelected man who was tasked with dramatically downsizing the US government, claimed that USAID was corrupt. But theres scant evidence of widespread corruption in USAID projects in Zimbabwe. In 58 audits of USAID projects in Zimbabwe, commissioned by the USAID Office of Inspector General between 2017 and 2024, three projects were flagged for having unsupported costs totaling US$660,000. In at least two of those examples, the corruption was at the local level, not within USAID.\n\nThe real corruption is in Zimbabwes halls of power. In 2024, the US sanctioned President Emmerson Mnangagwa and 10 other Zimbabwean leaders for corruption and human rights abuses. The announcement from the US Department of Treasury, which implements such sanctions, noted that Mnangagwa, his wife and senior government leaders are engaged in corruption related to gold and diamond smuggling networks, as well as a host of other illicit financial schemes and human rights abuses.\n\nAnd thats just a small sampling of the known corruption.\n\nWe need to deal with some nefarious activities that have been resulting in the leakages of the revenue from the fiscus, says Gwanyanya. We need to be more efficient as a government. We need to be more efficient in terms of operations  but also in terms of dealing with the wastages and leakages.\n\nThat corruption ripples down into daily life. Bribery is rife. New mothers have to bribe nurses to getofficial birth cards for their infants. Ruling political party leadersgive away land to their supporters. The black market is now thebackbone of the local economy.\n\nEverything happening in Zimbabwe now is a part of the economic crisis that began in the 1990s, says Eldred Masunungure, a retired University of Zimbabwe political scientist.\n\nWe are still in that crisis, he says.\n\nFragility, he says, has become the countrys defining feature: fragile politics, fragile economy and a fragile social order. When corruption is so routine, he says, How do you uproot that?\n\nPeople are desperate, and those who can leave, do so. Masunungures children live in Canada.\n\nDecades of brain drainhave left the country with far fewer skilled people than it needs to fill the void left by aid agencies. Some African countries wont be able to fill the gap, and even with the resources, they might struggle to manage services that were previously run by donors, says Ken Opalo, an associate professor at the Walsh School of Foreign Service at Georgetown University. That, he says, is my biggest worry.\n\nEconomic transformation is possible  and China could make it happen, Opalo says.\n\nMore than any other donor, China has been willing to partner with countries of programs and projects that have the potential to deliver structural economic transformation, he says.\n\nMore than 70% of US funding focuses on health and saving lives, while more than 70% of Chinas investment goes toward infrastructure projects like electricity, roads and bridges to drive economic growth, says Deborah Brutigam, director of the China-Africa Research Initiative at Johns Hopkins University. Chinas influence in Zimbabwe includes mining claims worth billions of US dollars in the diamond, platinum, coal, chrome and lithium sectors.\n\nBetween 2000 and 2023, China loaned about US$182 billion throughout Africa  ranging from US$3 billion to Zimbabwe to US$46 billion to oil-rich Angola  according to the Boston University Global Development Policy Center. Most of these loans were for either energy or transportation projects  in line with Chinas US$1 trillion Belt and Road Initiative  and have an average interest rate of 3%, higher than World Bank rates but lower than private lender rates of 67%.\n\nChinas approach is often called debt trap diplomacy, meaning that the intent is to overwhelm low-income countries with debt they cant repay. But theres no evidence that these Chinese loans are somehow predatory, Brutigam says. So far, there are no examples of China deliberately entangling another country in debt, then using that debt to extract an unfair or strategic advantage, she adds.\n\nChina has also been keen to make symbolic donations. In 2022, China built Zimbabwe a parliament building at an estimated cost of US$120million. Its one of 15 African parliament buildings that China has either built or refurbished, though its the biggest and most expensive to date.\n\nMore investment from China isnt necessarily a good thing, says Sabiti Makara, a professor in the Department of Governance at Kabale University in Uganda.\n\nSeeing that America is withdrawing its influence, the Chinese might set new terms that may render Africa dependent on them, Makara says.\n\nOn the ground, Chinese investment brings jobs. Chinese Foreign Minister Wang Yi said in March at a press conference that China has created more than 1.1 million jobs in Africa over the past three years.\n\nBut Zimbabweans say those jobs arent necessarily good ones.\n\nNathan Chiwundo worked for a Chinese brick molding company in Harare. There were poor labor conditions and frequent regulation violations, he says. There were no days off  he worked weekends and public holidays.\n\nBut jobs are rare, Chiwundo says, so people will continue to fill them if China provides them.\n\nFor regular people, he says, more investment from China will be meaningless if employees are not well taken care of.\n\nZimbabwean leaders say theyve been able to respond to the countrys most urgent needs, despite the lack of aid.\n\nThere are enough antiretroviral drugs for all who need them, Dr. Douglas Mombeshora, minister of health and child care, told journalists at a media workshop in April. Spending has also been reprioritized to care for people who have tuberculosis and provide malaria treatment, and US$12 million has been earmarked to import medication.\n\nThere is no need to panic, he said.\n\nGwanyanya, the Reserve Bank of Zimbabwe committee member, says hes confident that everything will work out. We just need to adjust to the new reality, he says. Otherwise, we cant survive.\n\nMandove, the woman injured during the war for independence, isnt so sure.\n\nUS aid helped ensure that countless Zimbabweans  and people across the world  had enough to eat. China might invest in roads and factories, but USAID kept food on tables.\n\nNow, Mandove says, her family eats just two meals a day, usually wheat with wild okra. Its cheaper than maize, the countrys staple food. Her youngest son, just 10 years old, herds cattle for neighbors to earn money. But the family doesnt have what it needs.\n\nThe food is not enough, she says. I am usually hungry.\n\nApophia Agiresaasi, GPJ, contributed reporting to this story.\n\nGamuchirai Masiyiwais a Reporter-in-Residence based in Harare, Zimbabwe. An internationally acclaimed economic reporter, her award-winning work includes a Clarion Award for her innovative comic feature on Zimbabwean currency. Gamuchirai holds a bachelors degree in Political Science and a diploma in Journalism and Mass Communication from the University of Zimbabwe. She brings deep expertise and a fresh perspective to reporting on economic issues impacting her community.\n\nLinda Mujuruis a Reporter-in-Residence based in Harare, Zimbabwe. A renowned international reporter and public speaker, she has spent nearly a decade covering human rights, the mining sector, the economy, and public health. She holds an MBA from Midlands State University and both masters and bachelors degrees in Journalism and Media Studies from the National University of Science and Technology in Zimbabwe. Linda is one of Global Press most widely read and syndicated journalists. In 2023, she won the Community Champion Award from the Institute for Nonprofit News for her story Push for Gold Leaves a Toxic Legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12110537/GPJ_Zim_Ug_DonorDependency_Illustration.png",
            "description": "<p>By Linda Mujuru and Gamuchirai Masiyiwa, GPJ Zimbabwe US aid helped save and sustain lives, but failed to build lasting prosperity. Now, the money’s gone. Can Zimbabwe become self-sufficient, or will it turn to China?  This story was originally published by Global Press Journal.  HARARE, ZIMBABWE — Eliza Mandove was a child when her brother</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/a-fragile-state-zimbabwe-reckons-with-the-catastrophic-loss-of-us-aid/\">A Fragile State: Zimbabwe Reckons With the Catastrophic Loss of US Aid </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Harare councillors fight undervaluing land compensated to Chiyangwa’s Pinnacle Holdings",
            "url": "https://www.newzimbabwe.com/harare-councillors-fight-undervaluing-land-compensated-to-chiyangwas-pinnacle-holdings/",
            "content": "By Darlington Gatsi\n\nHARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands.\n\nThe Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate land to Pinnacle Holdings as compensation for property acquired by the government.\n\nPinnacle Holdings is owned by businessman Philip Chiyangwa, who is also a ZANU PF member.\n\nThe directive sparked a heated debate in a recent Council meeting, with Ward 16 Denford Ngadziore expressing concern that the council might part with the land at a value lower than its actual price.\n\nThe report is saying US$5 per square metre. So my argument is, in Malbereign and around Harare, we are selling at US$20 per square metre, whilst on the other side, it is going for US$5 per square metre.\n\nWe cannot transfer land whose value we do not know. We are not transferring tomatoes; this is land we are talking about, said Ngadziore.\n\nThe proposed compensation has angered residents, with associations labelling the move as unconstitutional and tantamount to government interference in the affairs of the local authority.\n\nAs a result, residents are calling for the compensation to Pinnacle Holdings to be halted.\n\nSeveral stands have been earmarked for compensation, subject to the Councils approval. However, anomalies have been raised regarding some of the stands.\n\nAdonia Shoko raised a red flag over stands in Kuwadzana, stating that some individuals already hold offer letters for the land.\n\nKudzai Kadzombe also raised a similar concern regarding land identified as part of the compensation to Pinnacle Holdings.\n\nI have a personal interest because, as Councillor of Ward 41, we have already raised this issue. We have a piece of land in Bluffhill which is on that list, but residents had already submitted a petition and begun mobilising to build a council school, said Kadzombe.\n\nThe HCC Finance Committee is set to deliberate on Garwes directive and conduct due diligence on the anomalies raised in the meeting.\n\nHowever, Mafume bluntly told the Council that those aggrieved should consider mounting a legal challenge.\n\nAnyone who feels aggrieved or has their property rights affected by the letter is advised to make a beeline to their lawyers, said Mafume.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/07224513/town-house.jpg",
            "description": "<p>By Darlington Gatsi HARARE City Council risks losing thousands of dollars in land value if the municipality complies with the government directive to compensate Pinnacle Holdings with tracts of stands. The Minister of Local Government and Public Works, Daniel Garwe, recently wrote a directive to Harare Mayor Jacob Mafume instructing the City Council to allocate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/harare-councillors-fight-undervaluing-land-compensated-to-chiyangwas-pinnacle-holdings/\">Harare councillors fight undervaluing land compensated to Chiyangwa’s Pinnacle Holdings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Air India’s London bound flight crashes with 242 passengers on board",
            "url": "https://www.newzimbabwe.com/air-indias-london-bound-flight-crashes-with-242-passengers-on-board/",
            "content": "India Today\n\nA major aviation tragedy struck Ahmedabad on Thursday when an Air India Boeing 787-8 Dreamliner, operating as flight AI171 to Londons Gatwick Airport, crashed near Sardar Vallabhbhai Patel International Airport shortly after takeoff.\n\nThe aircraft was carrying 230 passengersand 12 crew members, for a total of 242 people on board.\n\nDramatic visuals from the scene showed the wreckage engulfed in flames and thick black smoke billowing near the runway, as emergency teams rushed to the site to conduct rescue operations.\n\nThe Boeing 787-8 Dreamliner is a state-of-the-art, long-haul, wide-body aircraft designed for efficiency, comfort, and environmental performance. Introduced in 2011, the 787-8 is the first model in Boeings Dreamliner series and is widely used by airlines globally for intercontinental flights.\n\nCapacity:Typically seats between 242 and 290 passengers, depending on airline configuration, making it suitable for both high-traffic and long-distance routes.\n\nRange:Can fly up to 13,530 kilometers non-stop, allowing direct connections between distant cities.\n\nConstruction:Built with advanced composite materials, which make up about 50% of the primary structure,resulting in a lighter, more fuel-efficient aircraft.\n\nTechnology:Equipped with the latest avionics, fly-by-wire controls, and advanced safety systems.\n\nThe Boeing 787-8 Dreamliner is equipped with advanced navigation and safety systems that enhance situational awareness and operational efficiency. The Synthetic Vision System (SVS) provides a 3D view of terrain and potential obstacles, improving pilot decision-making, especially in low-visibility conditions.\n\nThe aircraft features Integrated Modular Avionics (IMA), a centralised system that streamlines maintenance and optimises performance by integrating multiple avionics functions into fewer components.\n\nThe crash occurred just after takeoff,with the cause still under investigation by Air India and the Directorate General of Civil Aviation (DGCA).\n\nRescue and fire teams responded swiftly, and the central government has pledged full support for ongoing operations. As of now, the extent of casualties and the precise cause of the accident remain unconfirmed.\n\nPrime Minister Narendra Modi spoke to the Minister of Civil Aviation, Rammohan Naidu, and took stock of the Air India flight crash incident in Ahmedabad.\n\nThe Boeing 787-8 Dreamliner, known for its reliability and advanced safety features, has a strong operational record, making Thursdays crash a rare and deeply concerning event for Indias aviation sector.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12110135/Screenshot-2025-06-12-at-12.01.06.png",
            "description": "<p>India Today A major aviation tragedy struck Ahmedabad on Thursday when an Air India Boeing 787-8 Dreamliner, operating as flight AI171 to London’s Gatwick Airport, crashed near Sardar Vallabhbhai Patel International Airport shortly after takeoff. The aircraft was carrying 230 passengers and 12 crew members, for a total of 242 people on board. Dramatic visuals from</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/air-indias-london-bound-flight-crashes-with-242-passengers-on-board/\">Air India’s London bound flight crashes with 242 passengers on board</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Omnia Holdings increases dividend pay out despite setbacks in agriculture division",
            "url": "https://www.newzimbabwe.com/omnia-holdings-increases-dividend-pay-out-despite-setbacks-in-agriculture-division/",
            "content": "By Business Report\n\nTHE diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends.\n\nOmnia Holdings delivered a resilient performance for the fiscal year ended March 31, 2025 despite set backs in the agriculture division, which was impacted by currency issues in Zimbabwe, drought in Zambia, and the civil unrest in Mozambique.\n\nThe diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends.\n\nThe agri business Zambia, Zimbabwe and Mozambique didnt perform well, Seelan Gobalsamy, CEO of Omnia told Business Report in an interview.\n\nZimbabwe had the usual currency issues and a lot of uncertainty (and) we had some regulatory challenges and in Zambia, we saw a massive drought that impacted revenue.\n\nThe unrest that rocked Mozambique in 2024 and early into this year also affected Omnia. The company had to send products via Namibia into Zambia as routes through Mozambique were disturbed by the unrest, impacting working capital and profits negatively.\n\nWith strong performance from Agriculture RSA and mining segment, Omnias revenues for the year to the end of March grew 2.7% to R22.82 billion. Mining has emerged as Omnias strongest business from an outdoor projective.\n\nThere is still a strong demand for metals, you know, the metals that drive that transition to cleaner energy, you know, the battery metals, uranium. So, we are positively disposed to the mining market, and we are winning new customers, renewing new customers, explained Gobalsamy.\n\nHeadline earnings per share increased by 1% to 704 cents, while operating profit remained unchanged at R1.7bn despite the inclusion of the Chemicals restructuring costs, along with the impact of severe drought conditions and currency depreciation in Agriculture Rest of Africa.\n\nThe Mining segment delivered an improved operating margin of 12.4% from 12.1%, supported by strong performance from Mining RSA and Mining International, as well as higher throughput and efficiencies.\n\nIn the mining sector, sustained demand for critical minerals supporting the global energy transition, underpinned exploration activity and supported positive fundamentals for the explosives market.\n\nHowever, geopolitical tensions and trade policy uncertainty presented ongoing risks.\n\nThe group had a net cash balance of R1.77bn was down from R2.3bn.\n\nThe board declared a total dividend of 675 cents per share for the year. This comprises an increased ordinary dividend of 400 cents, from 375 cents the prior year, and a special dividend of 275 cents per share, returning R1.1bn to shareholders.\n\nDespite persistent macroeconomic headwinds, Omnia delivered sustained profitability and continued to create long-term value for shareholders. This performance reflects the strength, quality, and growing diversity of our portfolio, underpinned by a sharpened focus on manufacturing efficiency, supply chain resilience, and customer-driven innovation, Gobalsamy said\n\nThe increased ordinary dividend payout, and special dividend declared is a clear signal of our confidence in the sustainability of our earnings and the successful execution of our growth and diversification strategy.\n\nLooking ahead, Omnia said the outlook for its Agriculture segment remained positive, driven by expected improvements in agronomic conditions across key regions such as the proprietary Nutriology model.\n\nOmnia said 2026 will be a significant transition year in which non-core assets and business lines will be sold, capital released and returns improved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/12055359/omnia_ssb_trucks_.jpeg",
            "description": "<p>By Business Report THE diversified company, propelled by its mining sector which is seeing new orders for its regional markets on the back of a rebound in copper and battery metals, achieved robust results and delivered bumper dividends. Omnia Holdings delivered a resilient performance for the fiscal year ended March 31, 2025 despite set backs</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/omnia-holdings-increases-dividend-pay-out-despite-setbacks-in-agriculture-division/\">Omnia Holdings increases dividend pay out despite setbacks in agriculture division</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "13 Jun 2025"
        },
        {
            "title": "Passerby bites off builder’s lip for greeting him",
            "url": "https://www.newzimbabwe.com/passerby-bites-off-builders-lip-for-greeting-him/",
            "content": "By Staff Reporter\n\nA MAN from Chirundu in Mashonaland West has appeared in court for biting off another mans lower lip for greeting him.\n\nAccused person, Joel Kwenda was arraigned before the Karoi Magistrates Court facing assault charges.He was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.Prosecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nAccused person, Joel Kwenda was arraigned before the Karoi Magistrates Court facing assault charges.\n\nHe was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.Prosecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nHe was convicted of the crime and sentenced to 18 months imprisonment of which nine months were suspended for five years. A further nine months were set aside on condition offender performs community service.\n\nProsecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.The victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nProsecutors told the court that on June 1, 2025, at around 10am, at the Roman Catholic Church the victim was plastering a house when the offender passed by the site.\n\nThe victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.The offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nThe victim greeted Kwenda, who curtly responded saying he didnt want to befriend him and victim thought he was joking.\n\nThe offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\nThe offender became angry and started chasing the victim before assaulting him with clenched fists. As if that wasnt enough, Kwenda dug his teeth into complainants lower lip and removed a chunk of flesh.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/12/19043340/Karoi-Mag.jpg",
            "description": "<p>By Staff Reporter  A MAN from Chirundu in Mashonaland West has appeared in court for biting off another man’s lower lip for greeting him. Accused person, Joel Kwenda was arraigned before the Karoi Magistrates’ Court facing assault charges. He was convicted of the crime and sentenced to 18 months imprisonment of which nine months were</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/passerby-bites-off-builders-lip-for-greeting-him/\">Passerby bites off builder’s lip for greeting him</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:46",
            "date": "13 Jun 2025"
        }
    ]
}