{
    "news": [
        {
            "title": "Musk calls Trump’s tax bill a ‘disgusting abomination’",
            "url": "https://www.newzimbabwe.com/musk-calls-trumps-tax-bill-a-disgusting-abomination/",
            "content": "BBC\n\nElon Musk has hit out at President Donald Trumps signature tax and spending bill, describing it as a disgusting abomination, in a widening rift between the two.\n\nThe tech billionaire posted on X that the bill would add to the US budget deficit and saddle Americans with crushing debt.\n\nThe budget, which includes huge tax breaks and more defence spending, was passed by the House of Representatives last month and is now being considered by senators.\n\nShame on those who voted for it, said Musk, hinting that he may try to unseat the politicians responsible at next years midterm elections.\n\nThe bill has the backing of President Donald Trump and would be the legislative linchpin of his second-term agenda if it passes Congress.\n\nMusk left the administration abruptly last week after 129 days working to cut costs with his team, known as Doge.\n\nThe comments mark his first public disagreement with Trump since leaving government, after having previously called the plan disappointing.\n\nThe South African-born tech billionaires time in the Trump administration came to an end on 31 May, although Trump said that he will, always, be with us, helping all the way.\n\nIn its current form, the bill  which Trump refers to as the big beautiful bill  has been estimated to increase the budget deficit  the difference between what the government spends and the revenue it receives  by about $600bn (444bn) in the next fiscal year.\n\nIn a series of posts on X on Tuesday, Musk said that the outrageous, pork-filled spending bill will massively increase the already gigantic budget deficit to $2.5 trillion (!!!) and burden America [sic] citizens with crushingly unsustainable debt.\n\nIn American politics pork refers to spending on projects in lawmakers constituencies.\n\nMusk has previously vowed to fund campaign challenges against any Republican that votes against Trumps agenda. But on Tuesday he fired a warning to those who backed the bill.\n\nIn November next year, we fire all politicians who betrayed the American people, he wrote.\n\nAsked about Musks comments soon after the first post, White House press secretary Karoline Leavitt said the President already knows where Elon Musk stood on this bill.\n\nThis is one, big, beautiful bill, she added. And hes sticking to it.\n\nThe legislation also pledges to extend soon-to-expire tax cuts passed during the first Trump administration in 2017, as well as an influx of funds for defence spending and to fund the administrations mass deportations of undocumented immigrants.\n\nTo the dismay of fiscal conservatives, it would lift the limit on the amount of money the government can borrow, known as the debt ceiling, to $4tn.\n\nThe comments from Musk reflect wider tensions among Republicans over the plan, which faced stiff opposition from different wings of the party as it worked its way through the House.\n\nThe Senate has now taken it up, and divisions are already emerging in that chamber, which is also narrowly controlled by Republicans.\n\nKentucky Senator Rand Paul has said over the last few days he will not support the bill if it raises the debt ceiling.\n\nThe GOP [the Republican Party] will own the debt once they vote for this, he told CBS News, the BBCs US partner, over the weekend.\n\nTrump responded to Paul with a series of social media posts, accusing him of having very little understanding of the bill and saying that the people of Kentucky cant stand him.\n\nHis ideas are actually crazy, Trump wrote.\n\nRepublican lawmakers pushed back on Musks comments, with Senate majority leader John Thune telling reporters the party plans to proceed full speed ahead despite a difference of opinion.\n\nWe have an agenda that everybody campaigned on, most notably the president, he said.\n\nMike Johnson  the Republican Speaker who has ushered the legislation through the House  told reporters on Capitol Hill that my friend Elon is terribly wrong.\n\nIts a very important first start. Elon is missing it, Johnson said.\n\nJohnson said he had a 20-minute phone call with the tycoon about the bill on Monday, adding that its phasing out of electric vehicle tax credits could have an effect on Tesla, Musks firm.\n\nI lament that, Johnson said, expressing surprise that Musk criticised the bill despite their call. I just deeply regret hes made this mistake.\n\nAmong the issues that upset Musk involved air traffic control at the Federal Aviation Administration (FAA), according toAxios.\n\nMusk was hoping it would be run on his Starlink satellite system, but he was denied because of issues relating to the technology and the appearance of a conflict of interest, the political outlet reported.\n\nSome Democrats welcomed Musks comments despite their previous criticism of him and the work of Doge.\n\nEven Elon Musk, whos been part of the whole process, and is one of Trumps buddies, said the bill is bad, Senate Minority Leader Chuck Schumer said. We can imagine how bad this bill is.\n\nTrump and Republicans in Congress have set a deadline of 4 July to get the measure passed and signed into law.\n\nMusk supported Trump in last years November election with donations of more than $250m.\n\nTo make peace with spending hawks, Trump is also asking Congress to pass a plan that would reduce current spending by $9.4bn, a figure derived from Doges work.\n\nIt would mainly slash funding for foreign aid, the United States Agency for International Development (USAID) and for broadcasters NPR and PBS.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/04/26043006/esla-and-SpaceX-CEO-Elon-Musk.jpeg",
            "description": "<p>BBC Elon Musk has hit out at President Donald Trump’s signature tax and spending bill, describing it as a “disgusting abomination”, in a widening rift between the two. The tech billionaire posted on X that the bill would add to the US budget deficit and saddle Americans with “crushing” debt. The budget, which includes huge</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/musk-calls-trumps-tax-bill-a-disgusting-abomination/\">Musk calls Trump’s tax bill a ‘disgusting abomination’</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "04 Jun 2025"
        },
        {
            "title": "Sponsored lies – Chamisa dismisses claims he is forming new party",
            "url": "https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/",
            "content": "By Staff Reporter\n\nOpposition leader Nelson Chamisa has dismissedas sponsored liessocial media rumours suggesting he is launching a new movement at the end of this month.\n\nSince his resignation as Citizens Coalition for Change (CCC)president in January 2024, following what he described as the hijacking of his party by Zanu PF,Chamisa has kept both supporters and opponents guessing over his next move.\n\nChamisa has repeatedly emphasised that he has not left politics but was forced to abandon the CCC due to its takeover.\n\nIn recent days, social media has been awash with flyers claiming Chamisa has launched a new party.\n\nIgnore these lies and falsehoods, Chamisa posted on his X account.\n\nOverwhelmed and flooded by calls from anxious, restless and expectant citizens. Disregard these sponsored lies from scared propagandists.\n\nA new nation founded on love, Zimbabwe shall be a new and great nation governed by love, truth and justice, not hate, violence, lies, deceit and corruption.\n\nLove is the missing essential! Love is the foundation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/03/21132503/DSC06267-copy-scaled.jpg",
            "description": "<p>By Staff Reporter Opposition leader Nelson Chamisa has dismissed as “sponsored lies” social media rumours suggesting he is launching a new movement at the end of this month. Since his resignation as Citizens Coalition for Change (CCC) president in January 2024, following what he described as the hijacking of his party by Zanu PF, Chamisa has kept both supporters</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sponsored-lies-chamisa-dismisses-claims-he-is-forming-new-party/\">Sponsored lies – Chamisa dismisses claims he is forming new party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "04 Jun 2025"
        },
        {
            "title": "Oreo maker sues Aldi in US over ‘copycat’ packaging",
            "url": "https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/",
            "content": "BBC\n\nThe corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of blatantly copying the packaging of its famous snacks.\n\nCourt documents showed that Mondelz International said Aldi uses similar packaging likely to deceive consumers and ride the coattails of the companys attraction, fame and prestige.\n\nThe snack giant also is behind Wheat Thins, Nutter Butter, Chips Ahoy!, and Ritz  all products the company accuses Aldi of copying with its discount versions.\n\nAldi US didnt respond to the BBCs request for comment, but its British counterpart stressed that it is not involved in the lawsuit.\n\nA spokesperson for Aldi UK told the BBC, that they are under the same ownership but operate as completely separate businesses.\n\nMondelz, which submitted the lawsuit in May, said it had reached out to Aldi several times about the confusingly similar packaging.\n\nAlthough Aldi did discontinue or alter the packaging of some products, the supermarket has continued making unacceptable copies, the lawsuit stated.\n\nThe company claimed that if Aldi is allowed to continued with its product lines, it will irreparably harm the Mondelz brand.\n\nThe lawsuit included side-by-side pictures comparing the appearances of Mondelz product with Aldis.\n\nMondelz lawsuit The snack giant included side-by-side pictures of their products (L) next to Aldis biscuit brands (R)\n\nIn the lawsuit, Aldi is accused of trademark infringement, unfair competition and unjust enrichment. Mondelz said it is seeking damages.\n\nMondelz described Aldis business model as hinging on low-priced private label products that resemble the look and feel of well-known brands.\n\nAldi, which has its headquarters in Germany, is known as a discount supermarket offering affordable alternatives to well-known brands.\n\nThere are over 2,500 Aldi shops in the US.\n\nThis is not the first time Aldi has been embroiled in a trademark battle. Earlier this year, it lost a battle with Cider producers Thatchers, which accused the supermarket of copying its drink in taste and appearance.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04041224/oreo.webp",
            "description": "<p>BBC The corporation behind Oreo has filed a lawsuit in the US against the budget supermarket Aldi, accusing it of “blatantly” copying the packaging of its famous snacks. Court documents showed that Mondelēz International said Aldi uses similar packaging likely to “deceive” consumers and “ride the coattails” of the company’s “attraction, fame and prestige”. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oreo-maker-sues-aldi-in-us-over-copycat-packaging/\">Oreo maker sues Aldi in US over ‘copycat’ packaging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "04 Jun 2025"
        },
        {
            "title": "Scotts Maphuma faces backlash for missing major children’s festival in Mozambique",
            "url": "https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/",
            "content": "IOL\n\nAmapiano artistScotts Maphuma, real name Mpho Lebajoa,is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform.\n\nThe ShayiMoto singer was set to perform in the country over the weekend at an annual Childrens Day festival in Matola, Mozambique.\n\nHowever, he did not show up to the event, and he later discovered that things work differently in Mozambique, finding himself in trouble with the local authorities.\n\nIt all started when a video of the artist in a police holding cell circulated on social media and sparked mixed reactions as well as questions from fans.\n\nLocal reporters from Mz Magazine News posted the video on their Instagram with a caption that reads: Scotts Maphuma  levado a esquadra por no ter chegado a tempo de actuar.\n\nIt translates to: Scotts Maphuma is taken to the police station for not arriving on time to perform.\n\nMaphuma was meant to headline the Childrens Day festival on Sunday, June 1, at an event known as Lizha s festas in Matola, a vibrant Mozambican suburb.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/09064854/scotts.webp",
            "description": "<p>IOL Amapiano artist Scotts Maphuma, real name Mpho Lebajoa, is making headlines once again, and this time it is because he found himself in hot water as he was reportedly arrested over the weekend in Mozambique, where he was scheduled to perform. The “Shayi’Moto” singer was set to perform in the country over the weekend at an</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/scotts-maphuma-faces-backlash-for-missing-major-childrens-festival-in-mozambique/\">Scotts Maphuma faces backlash for missing major children’s festival in Mozambique</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "04 Jun 2025"
        },
        {
            "title": "High Court trashes stepson’s US$60,000 lawsuit against 70-year-old widow",
            "url": "https://www.newzimbabwe.com/high-court-trashes-stepsons-us60000-lawsuit-against-70-year-old-widow/",
            "content": "By Staff Reporter\n\nHIGH Court judge Justice Christopher Dube-Banda has dismissed an application against a Murewa widow who was being sued US$60,000 for malicious prosecution by her stepson.\n\nThe complainant in the case, Collin Benyure, was suing his stepmother, Anna Benyure, claiming US$$20,000 for emotional stress, US$$30,000 for damages to his reputation, and US$10,000 for legal costs incurred during the prosecution.\n\nThe widowdid not file a notice to defend, resulting in the matter being set down on the unopposed roll.\n\nThe judge dismissed the claim, ruling that Collin had no evidence to support his claim.\n\nThe declaration stated that on 8 May 2024, Anna falsely claimed that the plaintiff, Collin, destroyed her seven-roomed house at Benyure homestead, Nyamakosi Village, Mutoko.\n\nThe court heard Collin was subsequently charged with the crime of contravening s 140 of the Criminal Law [Codification and Reform] Act [Chapter 9:23].\n\nHe was subsequently arrested before he was later cleared, resulting in him filing the present application.\n\nIn casu, in her statement to the police, Anna stated that on 8 May 2004, she received an anonymous call informing her that the plaintiff had demolished her house.\n\nOn the same day, she passed through the homestead and saw that indeed her seven-roomed, unroofed house had been demolished.\n\nThis is the information the defendant provided to the police.\n\nShe mentioned the plaintiff only as a suspect and informed the police that she did not seehimdemolishing the house.\n\nThe court heard she was candid that her information was based on an anonymous call she received.\n\nOn the premise of that account and the investigations, the police arrested and preferred a charge against the plaintiff.\n\nIn dismissing Collins claim, the judge said the decision to arrest and charge the plaintiff was exclusively that of the police.\n\nThe question whether she had a right or not to build a house at the homestead does not arise in this matter. It is irrelevant. The point is that she had a house at the Benyure homestead. Her house was demolished, and this is what she reported to the police. The conduct of the defendant cannot be said to amount to an active instigation of criminal proceedings, said the judge.\n\nIn addition, the judge said Collins affidavit of evidence merely recycles the contents of the summons and declaration.\n\nSuch is unhelpful. The allegation that the defendant made a false statement is not in sync with the facts of this case.\n\nThe demolished house was at the centre of the case; the police could not have arrested, and the prosecution could not have prosecuted the plaintiff if there had been no demolished house. There was a demolished house.\n\nBanda said there is no evidence that, besides giving information to the police, the defendant proceeded to lay a charge and was overbearing on the police to institute proceedings when they would not have otherwise done so.\n\nThe defendant in this case confined herself to giving information on what she believed transpired.\n\nHe said malice may be inferred from the absence of reasonable and probable cause to commence or continue a prosecution.\n\nIn other words, a want of reasonable and probable cause may be evidence of malice, where the court may conclude that there was no honest belief in the accusation made. In casu, there is no evidence of malice.\n\nIn other words, the plaintiff has not proved an absence of reasonable and probable cause operating on the mind of the defendant. Therefore, the plaintiff failed to prove the aspect of malice in the context of a claim for malicious prosecution, the court ruled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter HIGH Court judge Justice Christopher Dube-Banda has dismissed an application against a Murewa widow who was being sued US$60,000 for malicious prosecution by her stepson. The complainant in the case, Collin Benyure, was suing his stepmother, Anna Benyure, claiming US$$20,000 for emotional stress, US$$30,000 for damages to his reputation, and US$10,000 for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-trashes-stepsons-us60000-lawsuit-against-70-year-old-widow/\">High Court trashes stepson’s US$60,000 lawsuit against 70-year-old widow</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "04 Jun 2025"
        },
        {
            "title": "The implications of Floyd Shivambu’s demotion from the MK Party",
            "url": "https://www.newzimbabwe.com/the-implications-of-floyd-shivambus-demotion-from-the-mk-party/",
            "content": "IOL\n\nThe Umkhonto Wesizwe (MK) partys announcement on Tuesday thatFloyd Shivambu had been removed from his position as Secretary-Generalduring a press briefing has ignited debate about the stability and governance of the MK party, which has long been perceived as a volatile and informal organisation.\n\nDuring a tense press briefing in Durban, the party said the decision follows an internal investigation into Shivambus recent trip to Malawi, which officials say contravened the partys constitution and raised questions about leadership discipline within the organisation.\n\nAccording to MK party officials, Shivambus visit to Malawi to meet withfugitive pastor Shepherd BushirisEnlightened Church was the catalyst for his dismissal.\n\nThe partys statement confirmed that the trip was unauthorised and inconsistent with its constitutional guidelines, which explicitly prohibit members from engaging in activities that could undermine the partys integrity or expose it to external scrutiny.\n\nThe partys leadership cited the trip as emblematic of deeper systemic issues, namely, a leadership style characterised by unpredictability, casual decision-making, and a lack of institutional discipline.\n\nIndependent political analyst Sandile Swana weighed in on the implications of Shivambus removal, drawing parallels to the leadership patterns associated with former President Jacob Zuma.\n\nI have observed that part of the HR strategies of Jacob Zumawhere even when he was the President of the State, ministers and top officials were often removed abruptlymirror what we are seeing in the MK party, Swana said.\n\nIts a pattern of instability and informal governance. Leadership positions are often shifted overnight, with little transparency or consistency.\n\nSwana further argued that this informal style fosters an environment where leadership is unpredictable.\n\nThe character of the MK partys leadership resembles Zumas era  characterised by casualness and personal loyalty rather than institutional stability.\n\nThis creates a fragile political landscape where alliances are fleeting, and leadership is often driven by personal whims rather than strategic planning, he added.\n\nSanet Solomon, a political analyst from the University of the Free States Department of Political Studies and Governance, expressed concern about Shivambus removals broader implications.\n\nThe decision to recall Shivambu was not entirely unexpected, especially given the controversy surrounding his Malawi trip, she said.\n\nSuch actions risk alienating voters and could negatively impact the partys prospects in upcoming elections.\n\nSolomon criticised MKs apparent lack of precise succession planning, noting that the partys leadership operates casually and informally.\n\nThis pattern of instability suggests a leadership style that is personal rather than institutional, which can be detrimental to the partys credibility and long-term viability, she warned.\n\nThe ousting of Shivambu has raised questions about the future direction of the MK party. Analysts speculate the party may be heading into profound introspection or further instability.\n\nSome political commentators suggest that the leaderships decision to remove Shivambu rather than confront him publicly reflects a strategic attempt to avoid further internal dissent.\n\nHowever, critics argue that such moves only deepen the perception of disorder within the MK party, especially given the partys history of leadership upheaval and infighting.\n\nSwana pointed out the parallels between MKs leadership chaos and Zumas style of governance, adding another layer of complexity.\n\nThe informal and personal nature of MKs leadership echoes Zumas approach  where loyalty and personal connections often trump institutional norms, Swana said.\n\nThis could indicate that the party is becoming a mirror of Zumas political style, which may have long-term consequences for its stability.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/04022058/floyd-shivambu.png",
            "description": "<p>IOL The Umkhonto Wesizwe (MK) party’s announcement on Tuesday that Floyd Shivambu had been removed from his position as Secretary-General during a press briefing has ignited debate about the stability and governance of the MK party, which has long been perceived as a volatile and informal organisation. During a tense press briefing in Durban, the party</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/the-implications-of-floyd-shivambus-demotion-from-the-mk-party/\">The implications of Floyd Shivambu’s demotion from the MK Party</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "04 Jun 2025"
        }
    ]
}