{
    "news": [
        {
            "title": "Norma Mngoma’s ‘Untied’ episode to air on July 15 after court ruling",
            "url": "https://www.newzimbabwe.com/norma-mngomas-untied-episode-to-air-on-july-15-after-court-ruling/",
            "content": "Sowetan Live\n\nShowmax will air the interview with former finance minister Malusi Gigabas ex-wife Nomachule Norma Mngoma in which she speaks about their failed marriage, allegations of infidelity and pornography on July 15.\n\nThe streaming service made the announcement on Thursday, just a day after the court threw out Gigabas application to stop the broadcast of the interview.\n\nNext week, its Norma Mngomas turn in the spotlight, with her episode ofUntiedairing on Tuesday July 15. Shell share her journey through marriage, divorce and how shes found the strength to pick up the pieces and start over, said Showmax publicist Katlego Molubi.\n\nGigaba argued in court papers that Mngomas interview would taint my good name and dignity I have been rebuilding from the past years after [divorce].\n\nIn responding papers, MultiChoice said Mngoma would not be conducting an in-depth TV interview about her marriage to Gigaba for the first time.\n\nThe company said there have been reports about their marital problems and there was a sex tape, and these were circulated online.\n\nUntiedcreator and executive producer at GOATGraeme Swanepoel said: For too long, womens pain has been edited, softened or silenced. This show is about handing the mic back to them, letting them narrate their own healing, their own growth and their own freedom.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/11055542/norma.png",
            "description": "<p>Sowetan Live Showmax will air the interview with former finance minister Malusi Gigaba’s ex-wife Nomachule “Norma” Mngoma in which she speaks about their failed marriage, allegations of infidelity and pornography on July 15. The streaming service made the announcement on Thursday, just a day after the court threw out Gigaba’s application to stop the broadcast</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/norma-mngomas-untied-episode-to-air-on-july-15-after-court-ruling/\">Norma Mngoma’s ‘Untied’ episode to air on July 15 after court ruling</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zanu PF Mash Central leadership accused of plotting against ex-deputy minister Karoro",
            "url": "https://www.newzimbabwe.com/zanu-pf-mash-central-leadership-accused-of-plotting-against-ex-deputy-minister-karoro/",
            "content": "By Mary Taruvinga\n\nZANU PF Mbire District Coordinating Committee chairman in Mashonaland Central province, Takesure Chikwamba has been accused of orchestrating the arrest of former Agriculture deputy minister Douglas Karoro on theft charges.\n\nThe move was allegedly driven by revenge after Chikwamba lost the Mbire Constituency to Karoro in the 2018 harmonised elections.\n\nThis came out in court this Thursday when Chikwamba appeared as a State witness against Karoro who is accused of diverting fertilisers that were meant for Mbire district under the Presidential Input Programme.\n\nThe former deputy minister, who is being represented by Admire Rubaya, denies the allegations, describing them as a fabrication by his political rivals, among them Chikwamba, whom he outclassed in the partys primary elections to represent the constituency in parliament.\n\nChikwamba told Regional Magistrate Marehwanazvo Gofa that he reported the matter to the police after he received reports from his party subordinates of suspicious movement of fertilisers at GMB Mushumbi.\n\nHe said he was not in Mbire at the time but was at his home in Ruwa when he was informed about the movement of fertilisers at Mushumbi GMB depot heading to Guruve GMB and rushed to the Police Morris Depot to report.\n\nWhen I got information from Nawo Gumbo and Mutukudzi about the fertilisers I got in touch with intelligence officers from the Presidents office. I also made investigations at GMB Guruve, where I was told there was no ammonium nitrate which was said to be going to be exchanged with compound D which had been taken at Mushumbi.\n\nWe expected the compound D would be returned but it was never delivered to the people of Mbire, he said.\n\nThe defence argued that Chikwamba had no locus standi to receive information at GMB and this shows he had a motive to get back at Karoro who had beaten him in elections.\n\nThey argued that in pursuit of his vendetta, Chikwamba rushed to the police despite not having any evidence but just words from his security officers on the ground.\n\nThey added that Chikwamba never called Karoro to inquire about the allegations but rushed to the police as he had the intention to sink him.\n\nYou had ulterior motives; that is why you did not call him to ascertain whether it was true or not. You just concluded he was a thief and rushed to report without even hearing his side of the story, Rubaya argued.\n\nChikwamba responded, saying he went to the police because he had been told a whistleblower whom he could not name was processing documents at GMB to substantiate the allegations against the former legislator.\n\nThe defence insisted the allegations were a fabrication as they were not supported by evidence, adding that the report was not even made where the alleged offence occurred.\n\nThey said Chikwamba ignored his nearest police stations, Ruwa, Mabvuku and Harare Central and instead rushed to CCD, which ordinarily gets reports through referrals.\n\nThis, they said, showed malice and an intention to get back at Karoro because he had a bone to chew with the accused for defeating them in the elections.\n\nYou were determined to be in the new building in Mt Hampden (parliament) that you sought to have him dismissed through baseless allegations. You ignored all the police stations and just rushed to Morris Depot, now Mkushi Depot, Rubaya said.\n\nChikwamba said he was not bitter after losing the election to Karoro but instead he was happy because it was a learning curve and first time to compete, adding that Karoro was just raising it as a defence to the allegations.\n\nHearing continues next Thursday.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/21162813/WhatsApp-Image-2022-05-21-at-5.27.36-PM.jpeg",
            "description": "<p>By Mary Taruvinga  ZANU PF Mbire District Coordinating Committee chairman in Mashonaland Central province, Takesure Chikwamba has been accused of orchestrating the arrest of former Agriculture deputy minister Douglas Karoro on theft charges. The move was allegedly driven by revenge after Chikwamba lost the Mbire Constituency to Karoro in the 2018 harmonised elections. This came</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zanu-pf-mash-central-leadership-accused-of-plotting-against-ex-deputy-minister-karoro/\">Zanu PF Mash Central leadership accused of plotting against ex-deputy minister Karoro </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        },
        {
            "title": "APEX Travel Zimbabwe: A decade of grit, growth, and guts in entrepreneurship",
            "url": "https://www.newzimbabwe.com/apex-travel-zimbabwe-a-decade-of-grit-growth-and-guts-in-entrepreneurship/",
            "content": "By Anna Chibamu\n\nBorn in 1991 as the youngest and only son in a family of three, Tanaka Tank Mupfurutsa has remained steadfast in his pursuit of business success, undeterred by the unpredictable highs and lows of entrepreneurship.\n\nWhile his siblings have sought opportunities abroad, Mupfurutsa chose to stay in Zimbabwe, founding Apex Travel Zimbabwe, a premier travel and tours operator among other business ventures.\n\nHe continues to navigate the countrys challenging economic terrain with courage and determination, all while supporting his family and building a name for himself in the local business landscape.\n\nAt just 19 years old, he launched Black Bean Investments, a candle and maputi (puffed maize snack) manufacturing company  laying the foundation for a bigger vision.\n\nIn an interview withNewZimbabwe.com, Mupfurutsa shares his successes and sorrows, highlighting the guiding principle behind his resilience: Keep changing. Nothing will work without God in it.\n\nIt was not easy, he said, recalling his encounters with the police after overloading his car with maputi but this did not deter him from achieving his goals.\n\nInstead, they became anecdotes of persistence and hustle.\n\nMupfurutsa invested in his own maputi machines. Scaling up, he was processing tonnes of maize and supplying major retailers.\n\nA milestone came when he landed a contract with Afro Foods, distributing 10,000 packets three times a week to over 15 retail outlets around Harare City. The business later suffered due to the collapse of Afro Foods but he remained undeterred.\n\nWhile pursuing a Business Studies and Computing Science degree at the University of Zimbabwe (graduated 2013), Mupfurutsa co-founded Campus Culture, where he served as finance director.\n\nThe student-led enterprise published magazines, hosted events, and even represented the university in a national ICT innovation competition.\n\nDespite multiple job offers, including from Delta Beverages and Document Support Centre, he chose entrepreneurship  the less-travelled path, and that was the birth of Apex Travel.\n\nApex Travel was formally registered in 2014 as an educational tours company.With unwavering zeal, Mupfurutsa and his team visited over ten schools daily, earning the trust of clients one handshake at a time.\n\nApex Travel grew into a leading brand, known for luxurious and unforgettable school trips. The company revolutionised the industry by offering high-end experiences to studentsluxury coach rides, five-star hotel stays, and fully guided educational experiences.\n\nOne of Apex Travels historic achievements was chartering a full Boeing aircraft through Fly Africa, taking 140 students from Haig Park Primary School to Victoria Falls.\n\nAnother proud moment came when Apex Travel booked out the entire Caribbea Bay Hotel for a school tour. Apex became a household name in schools across Zimbabwe and was known for setting industry trends.\n\nThe business expanded rapidly: Apex now included car rental, vehicle tracking, and eventually roadside assistance.\n\nTheir custom vehicle tracking system became a unique product in Zimbabwe. Developed in collaboration with Chinese manufacturers, Apex Trackers now provide features such as live tracking, remote vehicle immobilisation, driver behaviour analytics, geo-fencing, playback history, and microphone surveillance.\n\nApex Travelenforces strict client verification, including fingerprinting and ID capture, which has helped maintain a clean fleet and high customer integrity.\n\nThe car rental fleet grew to include sedans, mid-range SUVs, double cabs, fuel savers, luxury SUVs like the 300 series, and Mercedes-Benz S-Class models.\n\nInterestingly, COVID-19 became a defining period for Apex Travel. Though the travel business paused, car rental surged as companies sought vehicles for restricted local movement.\n\nMupfurutsa reallocated funds from his home construction to fleet expansion, turning a crisis into an opportunity. It was during this time that Apex Travel solidified car rental as its flagship division.\n\nIn addition to that, Mupfurutsa acquired haulage trucks from a distressed seller, further diversifying his assets. With no initial plan, he instinctively knew it was a strategic purchase and it proved fruitful.\n\nHis late father was always the first to test-drive any new vehicle and validate each major acquisition. His passing in February 2023 from cancer was a deep personal loss, but his legacy remains central to Mupfurutsas journey.\n\nMupfurutsas personal resilience was again tested when their nearly completed family home caught fire due to negligence by a caretaker.\n\nDespite the destruction, his father encouraged him to finish the project, calling it the test of time. With support from loyal contractors, some whom refused payment, he rebuilt the house.\n\nToday, Tanaka Mupfurutsa stands tall as a visionary entrepreneur, husband, father, and innovator who continues to grow Apex Travel into one of Zimbabwes most dynamic service providers across travel, logistics, and tech-enabled fleet services.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/10192849/Apex-Tanaka.png",
            "description": "<p>By Anna Chibamu Born in 1991 as the youngest and only son in a family of three, Tanaka “Tank” Mupfurutsa has remained steadfast in his pursuit of business success, undeterred by the unpredictable highs and lows of entrepreneurship. While his siblings have sought opportunities abroad, Mupfurutsa chose to stay in Zimbabwe, founding Apex Travel Zimbabwe,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/apex-travel-zimbabwe-a-decade-of-grit-growth-and-guts-in-entrepreneurship/\">APEX Travel Zimbabwe: A decade of grit, growth, and guts in entrepreneurship</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        },
        {
            "title": "No Covid-19 variants in Zimbabwe – govt says",
            "url": "https://www.newzimbabwe.com/no-covid-19-variants-in-zimbabwe-govt-says/",
            "content": "By Anna Chibamu\n\nThe government has dismissed reports of any Covid-19 variants currently circulating in Zimbabwe.\n\nSpeaking during a Question and Answer session in Parliament on Wednesday, Deputy Minister of Health and Child Care, Sleiman Timios Kwidini said the deadly variants being reported in other countries had not yet been detected locally.\n\nThe country is currently battling a viral infection outbreak that authorities havesaid is just an ordinary flu bug.\n\nMashonaland West proportional representation MP Mutsa Murombedzi posed a question to Kwidini regarding Zimbabwes situation on the suspected outbreak of a Covid 19 deadly strain reported in other countries.\n\nThe whole world is preparing for another threatening variant COVID. What has the government put in place to curb the spread of this virus? Murombedzi said.\n\nWe are aware that COVID comes with different variants but at the moment, the variants that are being found in other countries have not yet been found in Zimbabwe.\n\nHowever, the government is actively working to prevent the spread of the virus and has acquired additional test kits to enhance detection capabilities, building on previous experiences with testing for variants like Omicron.\n\nWe anticipate receiving some new medicines that are going to be used to cure this virus, Kwidini said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/09152417/covid-19-test-e1641884205477.jpg",
            "description": "<p>By Anna Chibamu The government has dismissed reports of any Covid-19 variants currently circulating in Zimbabwe. Speaking during a Question and Answer session in Parliament on Wednesday, Deputy Minister of Health and Child Care, Sleiman Timios Kwidini said the deadly variants being reported in other countries had not yet been detected locally. The country is</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/no-covid-19-variants-in-zimbabwe-govt-says/\">No Covid-19 variants in Zimbabwe – govt says</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        },
        {
            "title": "African Sun in US$18 million transaction agreement for Monomotapa Hotel disposal",
            "url": "https://www.newzimbabwe.com/african-sun-in-us18-million-transaction-agreement-for-monomotapa-hotel-disposal/",
            "content": "By Alois Vinga\n\nTOP hospitality group, African Sun Limited (ASL) has penned a US$18 million transaction agreement for the disposal of Monomotapa Hotel.\n\nThe group has since placed some of its assets like the Great Zimbabwe Hotel, and the Carribea Bay on the market in line with the groups strategy to raise adequate capital to invest in other areas of interest.\n\nIn a recent Cautionary Statement to shareholders, the hospitality group has reached a transactional agreement with the Public Service Pension Fund.\n\nTransactional agreements for the disposal of the Monomotapa Hotel land, buildings, adjacent car park and associated hotel business as a going concern, for US$18 million (plus any applicable VAT), have now been signed subject to the conditions precedent below.\n\nThe transaction involves two parts: Monomotapa Hospitality (Private) Limited, in which the Public Service Pension Fund has an interest, will acquire the hotel business and associated assets, while the Public Service Pension Fund will directly acquire the hotel land, buildings, and car park, as a single, integrated transaction, the group said in a statement.\n\nThe hospitality group is now seekingshareholder approval since the transaction constitutes a Category 1 transaction, which subjects it to an Extraordinary General Meeting (EGM),(for which a detailed circular will shortly be published.\n\nTHE EGM will be convened at a date soon to be announced, as well as seeking approval from the Competition and Tariff Commission (CTC).\n\nShareholders and the investing public are therefore advised to continue exercising caution when dealing with the Companys securities until advised of the conclusion of the said ongoing processes, the company added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga TOP hospitality group, African Sun Limited (ASL) has penned a US$18 million transaction agreement for the disposal of Monomotapa Hotel. The group has since placed some of its assets like the Great Zimbabwe Hotel, and the Carribea Bay on the market in line with the group’s strategy to raise adequate capital to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/african-sun-in-us18-million-transaction-agreement-for-monomotapa-hotel-disposal/\">African Sun in US$18 million transaction agreement for Monomotapa Hotel disposal</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        },
        {
            "title": "U.S Embassy orders visa applicants to make social media accounts public",
            "url": "https://www.newzimbabwe.com/u-s-embassy-orders-visa-applicants-to-make-social-media-accounts-public/",
            "content": "By Thandiwe Garusa\n\nTHE United States (U.S) Embassy in Harare has issued a fresh directive to all individuals applying for the F, M, and J nonimmigrant visas, mandating that applicants adjust the privacy settings of their personal social media accounts to public.\n\nF, M, and J, non-immigrant visas, allow foreign nationals to enter the U.S. for academic study, vocational training, or cultural and educational exchange programs, respectively.\n\nThe announcement was made in a statement posted on the embassys official social media accounts on Thursday.\n\nEvery visa adjudication is a national security decision.\n\nEffective immediately, all individuals applying for an F, M, or J non-immigrant visa are requested to adjust the privacy settings on all of their personal social media accounts to public to facilitate vetting necessary to establish their identity and admissibility to the United States, the statement reads.\n\nThis revised screening policy is part of wider U.S. measures to protect national interests and ensure that visa holders comply with the permitted activities under their non-immigrant status.\n\nEarlier this month, the Embassy also warned against using visas to give birth in the U.S. for citizenship purposes and said that consular officers will deny applications if they suspect such intent.\n\nThe Embassy also added that visa misuse can lead to denial or future bans, especially if public funds are involved.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/06020401/US-Embassy-Harare.png",
            "description": "<p>By Thandiwe Garusa THE United States (U.S) Embassy in Harare has issued a fresh directive to all individuals applying for the F, M, and J nonimmigrant visas, mandating that applicants adjust the privacy settings of their personal social media accounts to “public”. F, M, and J, non-immigrant visas, allow foreign nationals to enter the U.S.</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-embassy-orders-visa-applicants-to-make-social-media-accounts-public/\">U.S Embassy orders visa applicants to make social media accounts public</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        },
        {
            "title": "Zimbabwe currency reserves backing ZiG climb to record",
            "url": "https://www.newzimbabwe.com/zimbabwe-currency-reserves-backing-zig-climb-to-record/",
            "content": "Bloomberg\n\nGold and foreign-currency reserves backing Zimbabwes bullion-linked monetary unit rose to a record in June, the central bank said.\n\nThe reserves climbed to $731 million from $639 million in May and $276 million in April last year, when the nation introduced Zimbabwe Gold, the currency known as the ZiG, the central bank said in a statement Wednesday.\n\nYears of economic mismanagement doomed five attempts to create a functioning currency in the southern African nation, with the ZiG replacing the defunct Zimbabwean dollar, which was in freefall.\n\nAuthorities now want the new unit to supersede the US dollar, which since 2009 has functioned as a dual transacting currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/05/02115157/zig.webp",
            "description": "<p>Bloomberg Gold and foreign-currency reserves backing Zimbabwe’s bullion-linked monetary unit rose to a record in June, the central bank said. The reserves climbed to $731 million from $639 million in May and $276 million in April last year, when the nation introduced Zimbabwe Gold, the currency known as the ZiG, the central bank said in</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-currency-reserves-backing-zig-climb-to-record/\">Zimbabwe currency reserves backing ZiG climb to record</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:42",
            "date": "11 Jul 2025"
        }
    ]
}