{
    "news": [
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Glenview residents protest removal of borehole serving thousands of people",
            "url": "https://www.newzimbabwe.com/glenview-residents-protest-removal-of-borehole-serving-thousands-of-people/",
            "content": "By Thandiwe Garusa\n\nResidents of Glenview, one of Harares cholera hotspots, have petitioned Mayor Jacob Mafume to stop the planned demolition of a public borehole that serves more than 2,800 people.\n\nThe move follows a 48-hour removal notice issued by the City of Harare, ordering the clearing of the borehole site to pave way for four residential infill stands. The council cited illegal occupation under municipal by-laws.\n\nThe borehole, drilled in 2019 under the Presidential Borehole Scheme, remains the communitys main source of clean water in an area already suffering from severe shortages. No alternative water source has been proposed to replace it.\n\nIn a petition signed by 280 residents and submitted to the mayor on Wednesday, the community urged council to form a special committee to investigate the land allocations and assess how many boreholes would be affected by the planned housing development.\n\nThe Petitioner beseeches the Harare City Council to establish a Special Committee pursuant to Section 100 of the Urban Councils Act (Chapter 29:15), conduct an investigation into the allocation of infill residential stands in Glen View, determine the number of boreholes that will be affected, and provide recommendations to mitigate the water supply issues that may arise from the removal of the boreholes, the petition reads in part.\n\nResidents warned that demolishing the borehole without providing an alternative water source would violate their constitutional right to water and risk triggering another public health crisis in the cholera-prone suburb.\n\nThey also questioned how stands approved in 2024 could overlap with a borehole installed in 2018 and upgraded in 2025, describing the sequence as evidence of poor planning and possible corruption.\n\nAdding to their frustration, residents said individuals allocated the contested stands have already begun bringing building materials to the site, despite the ongoing dispute.\n\nThe petitioners further demanded that the City of Harare convene a public meeting to release documents showing whether the land was properly allocated before the borehole was drilled.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/09/23184817/Highfields-residents-queuing-for-water-at-a-borehole-in-Highfields-as-the-water-crisis-worsens-in-the-country.jpg",
            "description": "<p>By Thandiwe Garusa Residents of Glenview, one of Harare’s cholera hotspots, have petitioned Mayor Jacob Mafume to stop the planned demolition of a public borehole that serves more than 2,800 people. The move follows a 48-hour removal notice issued by the City of Harare, ordering the clearing of the borehole site to pave way for</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/glenview-residents-protest-removal-of-borehole-serving-thousands-of-people/\">Glenview residents protest removal of borehole serving thousands of people</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story",
            "url": "https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/",
            "content": "By Alois Vinga\n\nFinance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs.\n\nThe World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and US$12,535. In an ideal setting, this level of income would reflect improved living standards for ordinary citizens through equitable distribution of national wealth.\n\nAddressing delegates at the 2026 Pre-Budget Seminar in Bulawayo on Wednesday, Ncube painted a rosy picture of Zimbabwes economy, adding that most citizens are already spending above the daily threshold associated with middle-income economies.\n\nSo, the minimum GNI per capita should be US$4,500 per person, and this is an annual figure. That means that you ought to be able to spend on any given day no less than US$12 per person. Currently, on average, with the GNI per capita of US$3,300, that implies that we are spending US$9 per day, Ncube said.\n\nHe attributed the progress to the successful implementation of the National Development Strategy 1 (NDS1), which he said drove the economy to an average growth rate of 5.6% between 2021 and 2025, surpassing the official target of 5.2%, buoyed by increased infrastructure development. Ncube added that the economy is forecast to expand by 6.6% this year.\n\nHis statement, however, contrasts sharply with the lived reality of many Zimbabweans. The majority of the working population continues to earn less than US$250 per month, while a significant portion of the labour force operates in the informal sector, struggling to meet daily needs amid rising inflation and a weakening local currency.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/03/14204722/Mthuli-Ncube.jpg",
            "description": "<p>By Alois Vinga Finance Minister Professor Mthuli Ncube has claimed that the majority of Zimbabweans have entered the upper-middle-income bracket, even as most citizens continue to grapple with low wages and rising living costs. The World Bank classifies an upper middle-income economy as one with a Gross National Income (GNI) per capita between US$4,046 and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/finance-minister-mthuli-ncube-claims-zimbabweans-now-in-upper-middle-income-status-but-low-wages-tell-a-different-story/\">Finance Minister Mthuli Ncube claims Zimbabweans now in upper middle-income status but low wages tell a different story</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Govt acquires Monomotapa Hotel to cut costs for parliamentarians",
            "url": "https://www.newzimbabwe.com/govt-acquires-monomotapa-hotel-to-cut-costs-for-parliamentarians/",
            "content": "By Alois Vinga\n\nGovernment has officially acquired the historic Monomotapa Hotel to serve as a dedicated lodging facility for Members of Parliament, in a move aimed at curbing expenditure.\n\nFinance Minister Professor Mthuli Ncube made the announcement, describing the acquisition as a strategic step towards increasing efficiency and reducing the financial burden associated with parliamentary operations.\n\nThe move, he explained, will provide MPs with a convenient and cost-effective alternative to expensive private accommodation during parliamentary sessions and national events.\n\nThe governments acquisition of the Monomotapa Hotel underscores our ongoing commitment to improving the welfare of our Parliamentarians while also addressing the broader issue of fiscal responsibility. This initiative is not just about cutting costs, but about ensuring that public funds are used wisely, allowing for more resources to be directed toward national priorities, said Ncube.\n\nAlthough no current figures were provided, a 2013 report highlighted the high cost of hosting MPs in Harare, revealing that sitting allowances, accommodation, and travel expenses for Parliamentarians could easily exceed US$200,000 per week when both Houses were in session. With fuel allowances, travel stipends, and hotel bills, the financial burden had become unsustainable.\n\nThe decision to repurpose Monomotapa Hotel for government use is expected to deliver significant savings, which could be redirected to other national development priorities, thereby improving both efficiency and public service delivery.\n\nThe hotels previous owner, African Sun Limited, sold the property as part of a broader strategy to consolidate its portfolio, a move that reshapes the local hospitality sector. With its prime location and storied past, the hotels new role as a government facility is likely to redefine Harares hospitality landscape and spark debate over the balance between tourism, state infrastructure, and public service.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/11/06043730/momotapa-hotel-entrance.jpg",
            "description": "<p>By Alois Vinga Government has officially acquired the historic Monomotapa Hotel to serve as a dedicated lodging facility for Members of Parliament, in a move aimed at curbing expenditure. Finance Minister Professor Mthuli Ncube made the announcement, describing the acquisition as a strategic step towards increasing efficiency and reducing the financial burden associated with parliamentary</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/govt-acquires-monomotapa-hotel-to-cut-costs-for-parliamentarians/\">Govt acquires Monomotapa Hotel to cut costs for parliamentarians</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Tanzanian jailed 15 years for drug trafficking in Zimbabwe",
            "url": "https://www.newzimbabwe.com/tanzanian-jailed-15-years-for-drug-trafficking-in-zimbabwe/",
            "content": "By Staff Reporter\n\nA TANZANIANhas been sentenced to an effective 15 years imprisonment following his conviction by a Zimbabwean court for drug trafficking.\n\nThe offender, Sleiman Amour (44), appeared at the Bulawayo High Court for unlawful possession of methamphetamine.\n\nThe State case was that on October 23, 2025, police officers manning a roadblock at the 18km peg along Bulawayo-Plumtree road stopped a South African-registered Mann truck heading towards Plumtree.\n\nIt was further heard that the police requested the Tanzanian driver to produce a temporary import permit and he failed, forcing the cops to search the vehicle. As this was happening, Amour, who was a passenger in the truck, led officers to the loading box where there were lunch boxes wrapped in foil and loaded among bags of beans. He opened one of the boxes and started eating spaghetti in a bid to divert their attention.\n\nSome of the officers conducted a further search, leading to the discovery of more boxes containing methamphetamine hidden in a specially designed compartment on the roof of the truck.\n\nSensing danger, the driver and another passenger fled the scene, but the offender was arrested before he could escape. The truck was subsequently seized and forfeited to the State.\n\nIn a statement following sentencing, the National Prosecuting Authority of Zimbabwe (NPAZ) said drug misuse and trafficking in harmful substances were destroying lives and communities across the country hence the need for stiffer sentences against peddlers.\n\nCases like this highlight the serious consequences of choosing the drug trade over honest living. Let this be a warning to all, the law is watching and the courts are taking a firm stance, the NPAZ noted.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/02/23132207/Gavel-court.jpg",
            "description": "<p>By Staff Reporter A TANZANIAN has been sentenced to an effective 15 years’ imprisonment following his conviction by a Zimbabwean court for drug trafficking. The offender, Sleiman Amour (44), appeared at the Bulawayo High Court for unlawful possession of methamphetamine. The State case was that on October 23, 2025, police officers manning a roadblock at the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tanzanian-jailed-15-years-for-drug-trafficking-in-zimbabwe/\">Tanzanian jailed 15 years for drug trafficking in Zimbabwe </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "06 Nov 2025"
        },
        {
            "title": "Back to the future: Why defending Zimbabwe’s Constitution is defending the country",
            "url": "https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/",
            "content": "By Chofamba Sithole\n\nWhen Nelson Chamisa recently declared on X that there is no constitution to protect or defend and that we must instead defend and protect our country, his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when clarity and focus are essential.\n\nTo suggest that there is no constitution to defend is to surrender the very ground upon which the democratic struggle was built. Our constitution is not some detached piece of paperit is the living embodiment of the peoples will, painstakingly won through generations of struggle. To abandon it is to abandon Zimbabwe itself.\n\nWe have been here before. In the late 1990s, Zimbabwe was gripped by a similar sense of national crisis. Corruption, authoritarianism, and economic decline had hollowed out public confidence in the state. Recognising the depth of the malaise, a broad coalition of social movementsfrom labour unions to churches, students, womens groups, and civic activistsconcluded that the countrys salvation lay in a new constitutional order.\n\nOut of this awakening came the National Constitutional Assembly (NCA), spearheaded by the Zimbabwe Congress of Trade Unions under the leadership of Gibson Sibanda and Morgan Tsvangirai. The NCAs mission was clear: to mobilise citizens to write a people-driven constitution that would redefine the relationship between state and citizen.\n\nAlarmed by this groundswell, Robert Mugabes government rushed to produce its own draft through a state-appointed commission. But when this elite-driven constitution was put to a referendum in February 2000, the people rejected it. For the first time in history, Mugabe tasted defeat at the ballot box, because Zimbabweans demanded a constitution of the people, not for the rulers.\n\nThat dream was finally realised in 2013, when, during the inclusive government, the Movement for Democratic Change (MDC) and ZANU-PF agreed to a consultative process that produced a new, progressive, and people-endorsed constitution. Adopted by an overwhelming majority, it became Zimbabwes first truly democratic social contract.\n\nBut from the very beginning, the ruling elite treated this document not as a national covenant but as an inconvenience. After Emmerson Mnangagwa became President following the November 2017 military coup, he led efforts to butcher the new constitution, most notably the presidential running mate clause, to ensure continuity of Big Man, presidential dominance.\n\nNow Mnangagwa seeks, further, to drive a chariot and horses through the same constitution he once swore to uphold. His reported ambition to amend or suspend key provisions to entrench a preferred succession plan amounts to nothing less than a constitutional coup. With a co-opted and compliant parliament, the regime hopes to legalise illegality and codify authoritarianism.\n\nWhat is at stake, therefore, is not simply a factional battle within ZANU-PF between Mnangagwa and his deputy, General Constantino Chiwenga. It is a national crisis that cuts to the very foundations of the Republic. The fight over the constitution is the fight over the soul of Zimbabwe.\n\nIt is in this context that Advocate Nelson Chamisas assertion that there is no constitution to defend may be seen as problematic. The constitution defines who we are, what we aspire to become, and what powers the state may or may not exercise over us.\n\nTo claim that the constitution is in tatters and therefore unworthy of defense is to concede defeat to those who have been tearing it apart. The constitutions fragility is not a reason to abandon it; it is the reason we must defend it all the more vigorously.\n\nThe 2013 Constitution remains a democratising document, a peoples shield against tyranny. It provides the legal, moral, and political framework through which citizens can resist authoritarian excesses. It tells us not just what Zimbabwe is, but what Zimbabwe ought to be.\n\nWithout it, talk of defending the country becomes abstract rhetoric. What country are we defending, if not the one defined by a constitution born of the peoples struggle? What rules guide that defence? What limits restrain it? If the fight for Zimbabwe is undefined, it risks descending into chaos or co-option.\n\nZimbabwe stands today at another historic crossroads. The constitution is under siege. The institutions meant to uphold it have been captured. The opposition has been divided and, in some cases, clearly paid off. Yet this very moment demands that all democratic forces  political, civic, and social  reclaim their original mission: to defend the constitution as the ultimate expression of the peoples sovereignty.\n\nThe answer to authoritarian manipulation is not to discard the constitution but to rally around it. That was the lesson of 1999. It remains the challenge of 2025.\n\nIf the constitution falls, the Republic falls with it.\n\nSo yes, Zimbabwe must be defended, but to defend Zimbabwe is to defend its constitution. The two are one and the same.\n\nHistory has given Nelson Chamisa a through-pass in the penalty box. The question is, will he shoot for the goal by galvanising Zimbabweans to save their constitution, hence their nation?\n\nChofamba Sithole is a veteran Zimbabwean journalist and political commentator.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/05121529/chofamba.jpg",
            "description": "<p>By Chofamba Sithole When Nelson Chamisa recently declared on X that “there is no constitution to protect or defend” and that “we must instead defend and protect our country,” his words struck a chord with many Zimbabweans disillusioned by the state of our politics. But they also risk leading us astray at a moment when</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/back-to-the-future-why-defending-zimbabwes-constitution-is-defending-the-country/\">Back to the future: Why defending Zimbabwe’s Constitution is defending the country</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "06:44",
            "date": "06 Nov 2025"
        }
    ]
}