{
    "news": [
        {
            "title": "Steward Bank officially rebrands to TN Cybertech Bank Limited",
            "url": "https://www.newzimbabwe.com/steward-bank-officially-rebrands-to-tn-cybertech-bank-limited/",
            "content": "By Alois Vinga\n\nLISTED financial services provider, Steward Bank has officially changed its trading name in line with the entitys new strategic direction.\n\nIn a statement, the Reserve Bank of Zimbabwe (RBZ), Registrar of Banking lnstitutions, Phillip Madamombe said the new trade name has been approved.\n\nNotice is hereby given in terms of Section 22 (6) of the Banking Act (Chapter 24:20) that Steward Bank has changed its name to TN Cybertech Bank Limited and shall be known as such henceforth, reads the notice in part.\n\nThe development follows lawyer-cum-businessman Tawanda Nyambirais bid to spur shareholding to a 53.3% stake in Steward Banks holding company. This was after his company, TN Asset Management, underwrote a rights issue for the company late last year.\n\nResponding on his X (formerly Twitter) recently, Nyambirai clarified that while he cannot speak on behalf of Steward Bank or EcoCash Holdings, he vowed to push for an official disclosure via the Zimbabwe Stock Exchange (ZSE).\n\nA legal notice on the change of name of Steward Bank Limited has generated a lot of interest here on X.\n\nWe shall seek the authority of the Zimbabwe Stock Exchange to publish an update on the name changes. The update shall seek to answer some of the questions that have been raised, he said.\n\nA name looked at in the abstract might be meaningless. But the way the owner carries the name gives it value. Many Zimbabwean bank names lack obvious meanings, yet their strength lies in how they deliver on their promises.\n\nThe present generation would have demanded that Henry Wells and William Fargo change names first, before they named their banks, Wells Fargo after themselves, he said.\n\nThe rebranding process, he noted, will follow stringent corporate governance procedures, including shareholder consultations.\n\nMarket watchers believe that Nyambirais challenge remains convincing the public that the new identity will uphold or surpass the banks legacy.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/09/02233645/Tawanda-Nyambirai.jpg",
            "description": "<p>By Alois Vinga LISTED financial services provider, Steward Bank has officially changed its trading name in line with the entity’s new strategic direction. In a statement, the Reserve Bank of Zimbabwe (RBZ), Registrar of Banking lnstitutions, Phillip Madamombe said the new trade name has been approved. “Notice is hereby given in terms of Section 22</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/steward-bank-officially-rebrands-to-tn-cybertech-bank-limited/\">Steward Bank officially rebrands to TN Cybertech Bank Limited </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "31 May 2025"
        },
        {
            "title": "Airforce of Zimbabwe pilot killed as fighter jet crashes",
            "url": "https://www.newzimbabwe.com/airforce-of-zimbabwe-pilot-killed-as-fighter-jet-crashes/",
            "content": "By Staff Reporter\n\nA TRAGIC incident has struck the Zimbabwe Defence Forces (ZDF) family following the crash of an Airforce of Zimbabwe (AFZ) F-7 fighter aircraft in the Wazheri general area, along the Gweru-Mvuma Road.\n\nThe crash resulted in the death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube, a highly respected and experienced pilot.\n\nThe aircraft is said to have been engaged in a routine sortie procedure when the accident occurred.\n\nIn a statement following the accident, ZDF Commander, General Philip Valerio Sibanda, expressed deep sorrow over the loss.\n\nThe Zimbabwe Defence Force have learnt, with heavy hearts, of the passing of a proficient and highly experienced pilot, Squadron Leader Ncube after an aircraft accident. Right now, our thoughts and prayers are with the family of the deceased pilot, said Sibanda.\n\nIn the meantime, investigations are underway to establish the causes of the accident.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/31060834/Retired-Squadron-Leader-Ritswanetsi-Vuyo-Ncube.jpeg",
            "description": "<p>By Staff Reporter A TRAGIC incident has struck the Zimbabwe Defence Forces (ZDF) family following the crash of an Airforce of Zimbabwe (AFZ) F-7 fighter aircraft in the Wazheri general area, along the Gweru-Mvuma Road. The crash resulted in the death of Squadron Leader (retired) Ritswanetsi Vuyo Ncube, a highly respected and experienced pilot. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/airforce-of-zimbabwe-pilot-killed-as-fighter-jet-crashes/\">Airforce of Zimbabwe pilot killed as fighter jet crashes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "31 May 2025"
        },
        {
            "title": "Olorato Mongale: Suspect in South African student’s murder killed in police shootout",
            "url": "https://www.newzimbabwe.com/suspect-in-south-african-students-murder-killed-in-police-shootout/",
            "content": "BBC\n\nA suspect wanted for the murder of a South African university student has been killed in a shootout with the police.\n\nThe man was linked to the death of Olorato Mongale, whose body was found in Johannesburg on Sunday, about two hours after she was reported missing having gone on a date.\n\nIn the early hours of Friday morning, police officers found the main suspect hiding at a residential complex in the coastal town of Amanzimtoti, police spokesperson Athlenda Mathe said.\n\nThe suspect, who has not been named by the police, shot at the officers, who returned fire and killed him, Brigadier Mathe added.\n\nMs Mongales death has sparked a fierce debate about the levels of violence faced by women in South Africa.\n\nIn an impassioned statement, Police Minister Senzo Mchunu called the killing inhumane and gruesome, adding: To all men, this is a plea  simple, urgent, and human: Please, stop killing women.\n\nThe search for two other men linked to Mongales killing continues, while police have arrested the parents of the deceased suspect.\n\nThe suspects mother is accused of enabling him to evade arrest by tipping him off about the polices presence at her house.\n\nThe police also said that the suspects father is the owner of a VW Polo allegedly used in Ms Mongales murder.\n\nEarlier this week, the police named the three suspects linked to the killing as Fezile Ngubane, Philangenkosi Sibongokuhle Makhanya and Bongani Mthimkhulu.\n\nTwo of them  Mr Makhanya and Mr Mthimkhulu  were last month arrested for kidnapping and robbing a woman in KwaZulu-Natal, using the same VW Polo involved in Ms Mongales murder but had been freed on bail, police said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/30111037/3d2900f0-3c6b-11f0-bd09-85867b04fa4e.jpg.webp",
            "description": "<p>BBC A suspect wanted for the murder of a South African university student has been killed in a shootout with the police. The man was linked to the death of Olorato Mongale, whose body was found in Johannesburg on Sunday, about two hours after she was reported missing having gone on a date. In the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/suspect-in-south-african-students-murder-killed-in-police-shootout/\">Olorato Mongale: Suspect in South African student’s murder killed in police shootout</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "31 May 2025"
        },
        {
            "title": "Zimbabwe’s farmers push on as land grab compensation flounders",
            "url": "https://www.newzimbabwe.com/zimbabwes-farmers-push-on-as-land-grab-compensation-flounders/",
            "content": "AFP\n\nIn a field of paprika plants in the heart of Zimbabwe, fourth-generation farmer Daniel Burger and relative newcomer Miriam Mupambawashe discuss the quality of the crop.\n\nBurger, 36, and Mupambawashe, 59, are neighbours and partners in efforts to revive the countrys once-flourishing agriculture sector cut down by a ruinous land reform drive in the 2000s.\n\nThe reform distributed land from the white minority, which still owned most of the best farmland 20 years after independence in 1980, to the black majority.\n\nAround 4,000 white-owned farms were confiscated, some with deadly violence.\n\nMupambawashe was among thousands who received land. Though she initially knew little about farming, her small subsistence plot now thrives.\n\nOther farms failed or were abandoned, with some new tenants unschooled in agriculture and others  including politicians who were handed land  uninterested.\n\nThere were food shortages and Zimbabwe soon required international aid.\n\nThere was a bit of a tough period through the 2000s and, unfortunately, I think it sort of refuelled racial tensions to an extent, Burger told AFP.\n\nBut being so passionate about farming was the motivator for me to move forward, he said.\n\nMupambawashe moved to the area from the southern city of Bulawayo, around 200 kilometres (125 miles) away.\n\nWhen we first came here in 2001, it was a forest and there was nothing built, she said.Some of the white farmers were angry but we managed to talk to each other in good faith and move forward.\n\nThey never let us down and said, You grabbed the farm, lets see if you can do it. But instead they brought their own tractors and equipment to come and help, which we felt was a nice gesture.\n\nIt was hard in the beginning, especially after irrigation equipment was stolen, and the early failures were embarrassing, Mupambawashe said.\n\nBut today her plot does so well that she only needs to buy in sugar and cooking oil.\n\nBurger leases land from her and lends tractors and expertise.\n\nHis familys land was among the few hundreds that were not seized in the 2000s.\n\nNonetheless, For a long time we became wound up in compensation, said Burger, vice-president of the Commercial Farmers Union of Zimbabwe (CFU) that represents mostly white farmers.\n\nBut it wasnt our purpose. Our purpose was driving agriculture and current agricultural affairs forward, he said.\n\nThis year, some farm owners whose land was confiscated received the first compensation payments after decades of waiting.\n\nThe process has been complex and divisive.\n\nThe government committed to compensation as part of an effort to settle arrears and reform the economy in order to be able to regain access to international credit lines cut two decades ago.\n\nIt announced in 2020 the creation of a fund that would pay out US$3.5 billion for infrastructure on farms but not the land, which it says was taken by force by colonial settlers.\n\nUnable to raise cash, the government in 2023 changed the offer to one percent in cash and the remainder in US dollar denominated treasury bonds.\n\nIn April, the first payments were made to 378 of 780 farmers approved for this scheme.\n\nDeon Theron, who represents the Compensation Steering Committee group of former white farmers, says the introduction of the bonds has annulled the original deal and negotiations need to start over.\n\nThe bonds are unsecured and there is limited recourse in the event of non-performance by government, he told AFP.\n\nThe general feeling amongst the farmers is firstly frustration that after 20-odd years we still have not received anything, Theron said.\n\nBut the Property and Farm Compensation Associationsaid its members would take what is on offer.\n\nThe bonds are under international guarantee, said leader Harry Orphanides, adding that digging in and seeking more from the government would be futile.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/05/29191457/Screenshot-2025-05-29-at-20.14.21.png",
            "description": "<p>AFP In a field of paprika plants in the heart of Zimbabwe, fourth-generation farmer Daniel Burger and relative newcomer Miriam Mupambawashe discuss the quality of the crop. Burger, 36, and Mupambawashe, 59, are neighbours and partners in efforts to revive the country’s once-flourishing agriculture sector cut down by a ruinous land reform drive in the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwes-farmers-push-on-as-land-grab-compensation-flounders/\">Zimbabwe’s farmers push on as land grab compensation flounders</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "31 May 2025"
        },
        {
            "title": "Treasury delists defaulting suppliers, bans pre-payment of services due to non-delivery",
            "url": "https://www.newzimbabwe.com/treasury-delists-defaulting-suppliers-bans-pre-payment-of-services-due-to-non-delivery/",
            "content": "By Anna Chibamu\n\nTREASURY says it has delisted suppliers who have failed to deliver goods and services after receiving payments.\n\nFinance Ministry Permanent Secretary George Guvamatanga said no advance payments will be made to suppliers who are contracted by the government.\n\nThe ban comes after the Auditor Generals report revealed that several goods and services paid for through Ministries, departments and agencies (MDAs) by the Treasury were not delivered.\n\nThose who have not delivered goods and services have been banned from transacting with government.\n\nWe have actually banned the advance payment from most of the goods and services that the ministries and departments and agencies do secure from various suppliers.\n\nAs we speak now, what has been delivered, who has been banned, and what remains outstanding, it was a very long list, Guvamatanga told the Public Accounts Parliamentary Committee (PAC) recently.\n\nHe added, We were shocked by what we discovered. But I think following that intervention, there is now a very marked improvement.\n\nAccording to Guvamatanga, some MDA officers were involved in the scandals involving the loss of millions of dollars by the government.\n\nAnd we did emphasise that there will be an action taken against the accounting officers in the event that they continue with this practice following the intervention of closure, added Guvamatanga.\n\nCommittee chairperson Charlton Hwende requested to have the list of those companies that defaulted on delivery.\n\nWe will provide the list. It is available, said Guvamatanga.\n\nRegarding defaulters, Guvamatanga said, Its the same companies, they change directors, they go and change directors, they get another contract, you know, and its the same players.\n\nSo when we present it for the identity of the companies, we then see the same players all over. We are now calling them, bringing them to where you must bring your bank statements. \n\nThose same people become the directors of the new company. They are then given another tender, which they flout. Three, two years later, they change the name of the company, but they remain with the same directors, Guvamatanga said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2020/05/03011105/George-Guvamatanga.jpg",
            "description": "<p>By Anna Chibamu TREASURY says it has delisted suppliers who have failed to deliver goods and services after receiving payments. Finance Ministry Permanent Secretary George Guvamatanga said no advance payments will be made to suppliers who are contracted by the government. The ban comes after the Auditor General’s report revealed that several goods and services</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/treasury-delists-defaulting-suppliers-bans-pre-payment-of-services-due-to-non-delivery/\">Treasury delists defaulting suppliers, bans pre-payment of services due to non-delivery</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:08",
            "date": "31 May 2025"
        }
    ]
}