{
    "news": [
        {
            "title": "Dynamos fail to score again as rains drench ‘renovated’ Rufaro Stadium",
            "url": "https://www.newzimbabwe.com/dynamos-fail-to-score-again-as-rains-drench-renovated-rufaro-stadium/",
            "content": "By Darlington Gatsi\n\nHARARE Mayor Jacob Mafume Saturday came face to face with the shoddy renovations carried out at Rufaro Stadium by the Harare City Council, as persistent rains exposed the shortcomings of the imposing football facility.\n\nThe rains, which began in the first minute of the match between Herentals and Dynamos, reduced Rufaro Stadiums VIP enclosurea section supposed to be the safestto a swamp as water poured in heavily and without restraint.\n\nMafume and former deputy Mayor Kudzai Kadzombe were in attendance and witnessed the embarrassing scene.\n\nOn the pitch, the rains dampened the encounter, which ended in a goalless draw, with Dynamos failing to score in their second match of the Castle Lager Premier Soccer League campaign.\n\nDynamos lack of a cutting edge was once again exposed, as the fading giants failed to capitalise on numerous chances created during the game.\n\nIn the first half, Dynamos created several opportunities, with Tellmore Pio guilty of missing a clear chance in the 22nd minute when it seemed easier to score than to miss.\n\nHerentals, on the other hand, struggled to create meaningful chances, with their proprietor, Innocent Benza, contributing little to their attack.\n\nAfter the half-time break, veteran striker Lot Chiwunga, who replaced Benza in the second half, provided the attacking impetus Herentals had been lacking, forcing a save from Dynamos goalkeeper Prince Tafiremutsa.\n\nDynamos continued to pile pressure on Herentals but were unable to find the back of the net.\n\nDynamos coach, Lloyd Chigowe, acknowledged that his team had been the better side but lamented their failure to score as their Achilles heel.\n\nTeam building is a process, but I think in terms of clear-cut chances, we created them. In my opinion, we were the better side. Unfortunately, we could not put the ball in the net, said Chigowe.\n\nWith this result, Herentals remain unbeaten in the league, having beaten Telone 2-1 last weekend.\n\nHerentals coach Paul Benza expressed satisfaction with the draw.\n\nIt was a very difficult game. Dynamos came at us strongly in the first half. They had a lot of chances but failed to score, and we are very happy because, at the end of the day, we managed a clean sheet and a point, said Benza.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/15130150/WhatsApp-Image-2024-04-15-at-14.01.23.jpeg",
            "description": "<p>By Darlington Gatsi  HARARE Mayor Jacob Mafume Saturday came face to face with the shoddy renovations carried out at Rufaro Stadium by the Harare City Council, as persistent rains exposed the shortcomings of the imposing football facility. The rains, which began in the first minute of the match between Herentals and Dynamos, reduced Rufaro Stadium’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/dynamos-fail-to-score-again-as-rains-drench-renovated-rufaro-stadium/\">Dynamos fail to score again as rains drench ‘renovated’ Rufaro Stadium </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "PSL fines Scottland F.C for unprofessional conduct",
            "url": "https://www.newzimbabwe.com/psl-fines-scottland-f-c-for-unprofessional-conduct/",
            "content": "By Sports Reporter\n\nThe Premier Soccer League (PSL) has fined league newcomers Scottland Football Club a US$2,250 fine for lack of professionalism during their first league match against Triangle last week.\n\nOwned by Mabvuku Tafara Member of Parliament Scott Sakupwanya, the money bags side failed to provide a team sheet on time for the media to use.\n\nOther than that, Scottland executive also chased away journalists from their designated media space in the VIP section.\n\nThe PSL debutantes were also fined US$2,000 for failing to control their fans in the VIP enclosure.\n\nScottland F.C fans are accused of stepping on the bucket seats hence vandalizing some of them.\n\nMeanwhile, Scottland F.C will be up for another hunt this Sunday afternoon when they face league giants CAPS United at Rufaro Stadium in their second league match.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/28165838/WhatsApp-Image-2025-02-28-at-18.58.14.jpeg",
            "description": "<p>By Sports Reporter  The Premier Soccer League (PSL) has fined league newcomers Scottland Football Club a US$2,250 fine for lack of professionalism during their first league match against Triangle last week. Owned by Mabvuku Tafara Member of Parliament Scott Sakupwanya, the money bags side failed to provide a team sheet on time for the media</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/psl-fines-scottland-f-c-for-unprofessional-conduct/\">PSL fines Scottland F.C for unprofessional conduct </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "‘Where is Itai Dzamara?’: Decade on, pressure mounts on Zimbabwe government to account for missing human rights activist-cum-journalist",
            "url": "https://www.newzimbabwe.com/where-is-itai-dzamara-decade-on-pressure-mounts-on-zimbabwe-government-to-account-for-missing-human-rights-activist-cum-journalist/",
            "content": "By Staff Reporter\n\nA DECADE after the disappearance of human rights activist and journalist Itai Dzamara, pressure is mounting on the Zanu PF government to provide answers.\n\nCampaigners and activists have condemned the ruling party, with some branding it a terrorist organisation that must be held to account for Dzamaras disappearance.\n\nItai Dzamara\n\nDzamara was last seen on March 9, 2015, when he was allegedly taken from his home in Glenview, Harare, by State security operatives in an unmarked vehicle.\n\nThe circumstances surrounding his disappearance remain shrouded in mystery, prompting renewed calls for a thorough and transparent investigation.\n\nAward-winning human rights lawyer and Principal Managing Partner at Tsunga Bhamu Law International, Arnold Tsunga, has implored the President Emmerson Mnangagwa-led government to make a public announcement explaining why it has failed to bring the perpetrators of Dzamaras disappearance to justice.\n\nThe government has to do all in its powers to make a public and open announcement on why it has not been possible to bring the perpetrators of the abduction of Itai Dzamara to account, he said.\n\nThe failure of any progress, it really affects human rights activists and in particular it affects the family. The family of a disappeared person, they suffer uncertainty, trauma, and they dont have closure, he added.\n\nIts a threat to the rule of law; its a threat to the justice and accountability. It reduces confidence of people in the ability of our law enforcement system to be able to protect the citizens.\n\nFormer Zengeza West MP Job Sikhala stated that the Zanu PF-led government knows the whereabouts of Dzamara and owes the public an explanation as to what happened to him.\n\nThe regime knows what happened to Itai Dzamara, Sikhala said.\n\nIt is the duty of every government to protect its citizens. The security of every person falls in the hands of the State. We still demand with our loud voices to know what happened to Itai. It remains a serious issue of public interest, he added.\n\nHuman rights defender and Amalgamated Rural Teachers Union of Zimbabwe (ARTUZ) president Obert Masaraure minced no words for Zanu PF, describing it as a terrorist organisation and warning that the perpetrators of Dzamaras disappearance would eventually face retribution.\n\nThe Dzamara story reminds us that the Zanu PF party is a terrorist organisation. We will not tire to demand the return of Dzamara. Those who abducted him Dzamara will be forced to pay in the coming Zimbabwe, he said.\n\nEfforts to obtain comment from the government were unsuccessful, as both Information Minister Jenfan Muswere and Information Permanent Secretary Nick Mangwana could not be reached on their mobile phones.\n\nHowever, Zanu PF Director of Communication Farai Marapira asserted that human rights defenders and activists carry the burden of proof, as they are the ones making unfounded allegations against his party, which he described as a law-abiding institution.\n\nHe who alleges must prove. It is sad that some people would seek cheap mileage over another familys anguish. We are a law-abiding institution which holds the laws of our land sacrosanct. It is crass madness to then associate us with such a vile accusation, Marapira said.\n\nZimbabwe has neither signed nor ratified the United Nations International Convention for the Protection of All Persons from Enforced Disappearance despite repeated calls to do so by UN Member States. The government, it seems, is dragging its feet on this issue.\n\nThis convention came into being in 2006 and started being implemented in 2010.\n\nLast year, human rights lawyer Obey Shava, represented by renowned lawyer Tendai Biti, took Mnangagwas government to the High Court, arguing that the administration must ratify the United Nations Convention against enforced disappearance treaty.\n\nShava deplored what he described as a systematic pattern of enforced disappearance, abduction, torture, and cruel and degrading treatment. He asserted that numerous individuals, including himself, human rights defenders, opposition political party supporters, legislators, and ordinary citizens, have been subjected to these acts, with some also being injected with unknown substances.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/03/06225924/Dzamara-wife.jpg",
            "description": "<p>By Staff Reporter A DECADE after the disappearance of human rights activist and journalist Itai Dzamara, pressure is mounting on the Zanu PF government to provide answers. Campaigners and activists have condemned the ruling party, with some branding it a terrorist organisation that must be held to account for Dzamara’s disappearance. Dzamara was last seen</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/where-is-itai-dzamara-decade-on-pressure-mounts-on-zimbabwe-government-to-account-for-missing-human-rights-activist-cum-journalist/\">‘Where is Itai Dzamara?’: Decade on, pressure mounts on Zimbabwe government to account for missing human rights activist-cum-journalist</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "ZIFA signs a two-year agreement on sport development with Morocco",
            "url": "https://www.newzimbabwe.com/zifa-signs-a-two-year-agreement-on-sport-development-with-morocco/",
            "content": "By Sports Reporter\n\nZIMBABWE Football Association (ZIFA) has signed a Memorandum of Understanding (MoU) with Morocco, which will see the two countrys football federations working together in developing the sport.\n\nThe new MoU was signed by ZIFA president Nqobile Magwizi, who is in Africa for a visit.\n\nSet two run for two years, the pact will mainly focus on growing grassroot football between the two nations as well as forging technical capacity building.\n\nUnder the new partnership, Morroco will also host and support ZIFA delegations in several exchange programmes, which are aimed to help the Southern African country.\n\nThe new partnership has four key areas to tackle which are, training programmes for coaches, referees and administrators; youth and womens football development; friendly matches for senior and youth teams; and exchange programmes and joint events.\n\nZIFAs new executive was elected into office in January, taking over from the FIFA appointed Normalization Committees. Magwizis committee is seized with setting up structures within the countrys football fraternity after the lifting of the ban.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/12/10051510/NQOBILE-Magwizi.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE Football Association (ZIFA) has signed a Memorandum of Understanding (MoU) with Morocco, which will see the two country’s football federations working together in developing the sport. The new MoU was signed by ZIFA president Nqobile Magwizi, who is in Africa for a visit. Set two run for two years, the pact</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zifa-signs-a-two-year-agreement-on-sport-development-with-morocco/\">ZIFA signs a two-year agreement on sport development with Morocco </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "Marshall Munetsi scores for Wolverhampton to break Zimbabwe’s 14-year EPL goal jinx",
            "url": "https://www.newzimbabwe.com/marshall-munetsi-scores-for-wolverhampton-to-break-zimbabwes-14-year-epl-goal-jinx/",
            "content": "By Sports Reporter\n\nZIMBABWE senior mens soccer team, the Warriors vice-captain Marshall Munetsi Saturday evening scored his first English Premier League (EPL) goal for Wolverhampton Wanderers in a match that ended in a 1-1 draw.\n\nMunetsis goal was the first by a Zimbabwean player since 2011 when Benjani Mwaruwari last scored for Blackburn Rovers.\n\nWolves started slow in Saturdays match, giving Everton a chance to lead in the 33rd minute through Jack Harrison.\n\nHowever, the visitors lead was cancelled by Munetsis strike seven minutes later, thanks to Jean Bellegarde who made a skillful run to eliminate two defenders before giving the Zimbabwean to finish off.\n\nComing back to the second half Munetsi was then substituted for Pablo Sarabia in the 46th minute as Wolves searched for a winning goal.\n\nDespite making the change, Everton was more offensive as it created more chances, but Wolves remained resolute hence, they picked a point which is key as they battle for Premier League survival.\n\nMunetsis side is currently on position 16 with 23 points, 14 points ahead of bottom placed Southampton which is on position 20.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/09024104/FB_IMG_1741472317669.jpg",
            "description": "<p>By Sports Reporter ZIMBABWE senior men’s soccer team, the Warriors vice-captain Marshall Munetsi Saturday evening scored his first English Premier League (EPL) goal for Wolverhampton Wanderers in a match that ended in a 1-1 draw. Munetsi’s goal was the first by a Zimbabwean player since 2011 when Benjani Mwaruwari last scored for Blackburn Rovers. Wolves</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/marshall-munetsi-scores-for-wolverhampton-to-break-zimbabwes-14-year-epl-goal-jinx/\">Marshall Munetsi scores for Wolverhampton to break Zimbabwe’s 14-year EPL goal jinx</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "CAPS United lock horns against Scottland F.C",
            "url": "https://www.newzimbabwe.com/caps-united-lock-horns-against-scottland-f-c/",
            "content": "By Sports Reporter\n\nSCOTTLAND Football Club defender Godknows Murwira is the only player for league newcomers Scottland, who knows whether his side can beat his former team CAPS United or not.\n\nThe two sides are set to clash this Sunday afternoon at Rufaro stadium in what has been tagged game of the week.\n\nSo big is Sundays match that CAPS United has increased gate charges, with the rest of ground pegged at $5, that is $2 more than the standard $3.\n\nFor Scottland F.C, Sundays victory will give them their second triumph of the season following last weeks 1-0 win over Triangle.\n\nOn the other end, CAPS United will be seeking to register its first win of the season after starting off with a 1-1 draw against Greenfuel in Chisumbanje, last week.\n\nBut why is Murwira the focus?\n\nThe industrious defender was one of the top performing players for Makepe-kepe in 2024, as he was one of the teams two players from the club to make it on the Soccer Star of The Year calendar, the other one being Kingsley Mereremba, who is now at Scottland F.C as well.\n\nMurwira parted ways with CAPS United at the end of last year after a fallout with coach Lloyd Chitembwe, who then stripped him off the captaincy armband.\n\nHaving spent the past two seasons at CAPS United, Murwira will have all the attention when he faces his former paymasters probably, he is the only player who knows the Green Machine better amongst all Scottland players.\n\nWhat Chitembwe said ahead of Sundays match?\n\nWith a point in bag from last weeks one all away draw against Greenfuel in Chisumbanje, CAPS United coach Lloyd Chitembwe is hoping his side can pick maximum points on Sunday.\n\nMakepe-kepe has recieved a huge boost as new striker Nyasha Chintuli will be available for selection.\n\nWe are happy to announce that we have a full squad, unlike last match.\n\nWe have Nyasha Chintuli in the team and others like Hastin and Eric who were not available during our last game, so we have a full squad its a boost, said Chitembwe.\n\nCastle Lager Premier Soccer League Matchday 2 Sunday Fixtures\n\nHighlanders vs Kwekwe United (Barbourfields)\n\nCAPS United vs Scottland (Rufaro Stadium).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/05/03094523/279847300_512370347020948_5578061637849601225_n.jpg",
            "description": "<p>By Sports Reporter SCOTTLAND Football Club defender Godknows Murwira is the only player for league newcomers Scottland, who knows whether his side can beat his former team CAPS United or not. The two sides are set to clash this Sunday afternoon at Rufaro stadium in what has been tagged ‘game of the week’. So big</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/caps-united-lock-horns-against-scottland-f-c/\">CAPS United lock horns against Scottland F.C</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "Mighty Warriors forward Ruvimbo Mucherera signs contract with Polish club",
            "url": "https://www.newzimbabwe.com/mighty-warriors-forward-ruvimbo-mucherera-signs-contract-with-polish-club/",
            "content": "By Sports Reporter\n\nAFTER making her first international debut for Zimbanwe last month, national senior womens football team Mighty Warriors striker Ruvimbo Muchere has completed a move to Poland, where she has joined Energa Stomilanki Olsztyn.\n\nThe 28-year-old was plying her trade in Israel for Maccabi Haddera, a club she has parted ways with after serving more than two seasons.\n\nAnnouncing Muchereras arrival, Olsztyn posted, Ruvimbo Mucherera is a footballer for Stomilanek. Ruvimbo signed a contract with our club.\n\nRu is a Zimbabwean national team player who holds an American passport, she is an offensive player.\n\nRu welcome to Stomilanki, we are glad you have joined us.\n\nMucherera joins Olsztyn as an exprienced player as she has featured for several clubs across the globe, amongst them FS Damiense in Portugal, Gintra in Lithuana, San Diego Wave in the United States.\n\nHaving impressed during her debut with the Mighty Warriors last month, Mucherera is the only Zimbabwean female player to have featured in the prestigious Womens UEFA Champions League.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08054722/Ruvimbo-Mucherera.webp",
            "description": "<p>By Sports Reporter    AFTER making her first international debut for Zimbanwe last month, national senior women’s football team Mighty Warriors striker Ruvimbo Muchere has completed a move to Poland, where she has joined Energa Stomilanki Olsztyn. The 28-year-old was plying her trade in Israel for Maccabi Haddera, a club she has parted ways with</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mighty-warriors-forward-ruvimbo-mucherera-signs-contract-with-polish-club/\">Mighty Warriors forward Ruvimbo Mucherera signs contract with Polish club</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "Yadah F.C. feel FIFA sanctions heat but salvage a draw against Chicken Inn",
            "url": "https://www.newzimbabwe.com/yadah-f-c-feel-fifa-sanctions-heat-but-salvage-a-draw-against-chicken-inn/",
            "content": "By Sports Reporter\n\nSANCTIONED Yadah Football Club braved 90 minutes to salvage a 0-0 draw against Chicken Inn at Heart Stadium in Harare Friday afternoon.\n\nThe Miracle boys are being haunted by a FIFA transfer ban, which was imposed last year after they failed to pay three Brazilian players salaries and unfairly dismissed them.\n\nAs part of the sanctions, Yadah is not supposed to make any new signing until they have settled their debt with the Brazilians.\n\nCurrently, the prophet Walter Magaya-owned side has 13 registered players to compete in the league, of which Anotidaishe Gwatidzo was red carded last week in a match against Manica Diamonds, trimming the squad to 12 for the Chicken Inn match.\n\nFridays match had nothing much to write home about as both side were average, although Yadah proved to be the better team despite their limitation of having a one man substitute on the bench.\n\nPicking a point against Chicken Inn was a positive step going forwad for Yadah, who suffered a last minute 1-0 defeat last week away at Sakubva Stadium in Mutare.\n\nMeanwhile, Castle Lager Premier Soccer League action continues Saturday as Manica Diamonds travel to Zvishavanes Mandava Stadium for a date against FC Platinum, as Bikita Minerals host newcomers MWOS at Sakubva Stadium.\n\nElsewhere, Tel One welcome league returnees Triangle at Bata Stadium in Gweru, while Herentals squares off with Dynamos in a Harare derby.\n\nDefending league champions Simba Bhora will be out for a hunt in Kariba against ZPC Kariba while Ngezi Platinum Stars host Green Fuel.\n\nMatchday two action continues Sunday as CAPS United entertain money bags Scottland F.C while Highlanders welcome Kwekwe United.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/03/08054432/TgbCjE3qVgzJCKGnR9mxTo9Aii9WbnCAC02HvZjm.jpg",
            "description": "<p>By Sports Reporter SANCTIONED Yadah Football Club braved 90 minutes to salvage a 0-0 draw against Chicken Inn at Heart Stadium in Harare Friday afternoon. The Miracle boys are being haunted by a FIFA transfer ban, which was imposed last year after they failed to pay three Brazilian players’ salaries and unfairly dismissed them. As</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/yadah-f-c-feel-fifa-sanctions-heat-but-salvage-a-draw-against-chicken-inn/\">Yadah F.C. feel FIFA sanctions heat but salvage a draw against Chicken Inn</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "VPs, Cabinet ministers continue absconding Parliament, deny citizens critical updates on government policies and programmes",
            "url": "https://www.newzimbabwe.com/vps-cabinet-ministers-continue-absconding-parliament-deny-citizens-critical-updates-on-government-policies-and-programmes/",
            "content": "By Staff Reporter\n\nDEPUTY President of Senate Michael Nyambuya has described as sad the propensity of absconding Question-and-Answer sessions by the countrys two vice presidents and Cabinet ministers.\n\nThe worrisome trend denies citizens vital information about government policies, programmes and projects.\n\nSpeaker of Parliament, Jacob Mudenda has, on several occasions, noted the undesirable trend and ordered punitive action to be taken against errant top government officials skipping parliamentary Q and A sessions.\n\nThis Thursday, Hon Nyambuya was unassumed by the absence of Vice President Constantino Chiwenga and his counterpart, Kembo Mohadi, and a huge chunk of Cabinet ministers and their deputies, who missed the important deliberations in the Upper House.\n\nToday is Thursday and following the Standing Orders, we start with Questions Without Notice. As usual, I have a very long list of apologies, sadly, said Nyambuya, before reading the list of absentee office bearers.\n\nThe list of apologies is as follows; Hon. General Rtd. Dr. C. D. G. N. Chiwenga, the Vice President; Hon. Colonel Rtd. K. C. D Mohadi, the Vice President; Hon. M. Ncube, Minister of Finance, Economic Development and Investment Promotion; Hon. Machakaire, the Minister of Youth Empowerment, Development and Vocational Training; Hon. Murwira, Minister of Foreign Affairs and International Trade; Hon. Kazembe, Minister of Home Affairs and Cultural Heritage; Hon. Mavetera, the Minister of ICT, Postal and Courier Services; Hon. M. Ndlovu, the Minister of Industry and Commerce; Hon. F. Mhona, Minister of Transport and Infrastructural Development.\n\nHe went further, Hon. J.G, Moyo, Minister of Energy and Power Development; Hon. K. D. Mnangagwa, the Deputy Minister of Finance, Economic Development and Investment Promotion; Hon. E. Jesaya, Deputy Minister of Sports, Recreation, Arts and Culture; Hon. J. Mhlanga, Deputy Minister of Women Affairs, Community, Small and Medium Enterprises Development; Hon. C. Sanyatwe, Deputy Minister of Home Affairs and Cultural Heritage; Hon. Mazungunye, Deputy Minister of Justice, Legal and Parliamentary Affairs; Hon. A.\n\nGata, Deputy Minister of Primary and Secondary Education; Hon. R. Modi, Deputy Minister of Industry and Commerce; Hon. Y. Simbanegavi, Deputy Minister of Energy and Power Development; Hon. M. Ncube, Deputy Minister of National Housing and Social Amenities and Hon. D. Marapira, Deputy Minister of Lands, Agriculture, Fisheries, Water and Rural Resettlement.\n\nOnly Primary and Secondary Education minister, Torerai Moyo and two deputies were in the august House, which is emblematic of a skewed work ethic.\n\nIn the Chamber today, we have Hon. T. Moyo, Minister of Primary and Secondary Education; Hon. O. Marupi, Deputy Minister of Information, Publicity and Broadcasting Services and Hon. D. Phuti, Deputy Minister of ICT.\n\nCan we then start with those ministers who are present and hopefully, we will be joined by other ministers as we progress? said the Senate deputy president.\n\nA number of Cabinet ministers are under fire for not attending Parliament business, a development that has incensed Mudenda.\n\nRecently, the Speaker revealed that most Cabinet ministers give apologies on the pretext of being on national duty, something he said should be investigated.\n\nThe Q & A session is one of the most important Parliament business schedules where the public gets answers to policy questions asked by their constituency representatives (MPs) from Cabinet ministers.\n\nIn recent years, the two VPs and ministers have evaded the session, leaving citizens starved of crucial information needed to track progress of elected officials.\n\nSeveral MPs have raised their concerns since the previous Parliament until now (10th Parliament), with the Speaker at one point threatening to report culprits to President Emmerson Mnangagwa.\n\nAfter listening to this, there are quite clear apologies that have been very consistent to you. And my suspicion is that these ministers who make apologies cannot be on national duty every week, Mudenda lamented.\n\nMnangagwa has also issued a stern warning to Cabinet ministers, who habitually skip his weekly Cabinet meetings, delegating their deputies to attend in their place.\n\nWhile chairing his final cabinet meeting of 2024 at State House, December 17, Mnangagwa warned that such delegation would not be tolerated in 2025.\n\nHe said in the 2025 calendar year, the Chief Secretary is directed to strictly monitor attendance and ensure that errant ministers and officials toe the line, or face dire consequences.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/06/29152545/new-parliament-5.png",
            "description": "<p>By Staff Reporter  DEPUTY President of Senate Michael Nyambuya has described as “sad” the propensity of absconding Question-and-Answer sessions by the country’s two vice presidents and Cabinet ministers. The worrisome trend denies citizens vital information about government policies, programmes and projects. Speaker of Parliament, Jacob Mudenda has, on several occasions, noted the undesirable trend and</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vps-cabinet-ministers-continue-absconding-parliament-deny-citizens-critical-updates-on-government-policies-and-programmes/\">VPs, Cabinet ministers continue absconding Parliament, deny citizens critical updates on government policies and programmes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        },
        {
            "title": "Simbisa’s recipe to deal with Mthuli’s new taxes",
            "url": "https://www.newzimbabwe.com/simbisas-recipe-to-deal-with-mthulis-new-taxes/",
            "content": "By newZWire\n\nRUNNING a business in Zimbabwe means dealing with the unexpected. For Simbisa, the countrys largest fast-food company, the year began with fresh taxes that could bite into sales.\n\nFinance Minister Mthuli Ncube initially proposed a 0.5% tax in his budget statement, only to bump it up to 1% for implementation in January. He also threw in a new 20% tax on plastic bags.\n\nThis came as consumer spending in Simbisa outlets dipped. Average spend per customer fell by 3% in the last half-year, even though customer numbers rose by 7% to 24.8 million. This means the company has had to absorb the costs while finding ways to bridge the gap. Its strategy? Open more outlets, sell more chicken, and manage costs better.\n\nWere adapting to the 1% fast-food tax, says CEO Basil Dionisio.\n\nOn January 1, we all woke up to a lovely new year, and we were told its half a percent. Then the SI came out, and its 1%. We havent raised prices. Were absorbing itby growing our customer base, increasing volume, and passing that benefit to consumers.\n\nSimbisa opened a net of 38 new outlets between December 2023 and the end of 2024, with 16 of those in the last half of the year. By June, another 10 outlets will be added. Over the next 18 months, the company plans to launch 81 new counters and refurbish 60 existing ones.\n\nAnd what about the plastic bags tax?\n\nWe want to transition to 100% paper packagingno more little plastic carrier bags, Dionisio says.\n\nThis shift aligns with global industry trends. The company is also exploring new sustainable packaging solutions for its Creamy Inn ice creams.\n\nAfter that, we should have no more plastic in our operations.\n\nBeyond opening new outlets, Simbisa is also betting on increased adoption of its delivery services, which remain low in Zimbabwe compared to other markets.\n\nThe company is increasing cost containment, including pushing energy savings, while working with suppliers to negotiate better terms.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/09/29041917/Simbisa-Brands.png",
            "description": "<p>By newZWire  RUNNING a business in Zimbabwe means dealing with the unexpected. For Simbisa, the country’s largest fast-food company, the year began with fresh taxes that could bite into sales. Finance Minister Mthuli Ncube initially proposed a 0.5% tax in his budget statement, only to bump it up to 1% for implementation in January. He</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/simbisas-recipe-to-deal-with-mthulis-new-taxes/\">Simbisa’s recipe to deal with Mthuli’s new taxes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "08:32",
            "date": "09 Mar 2025"
        }
    ]
}