{
    "news": [
        {
            "title": "‘ED2030’ campaign is Zimbabweans’ idea, not MPs – says Zanu PF chief whip",
            "url": "https://www.newzimbabwe.com/ed2030-campaign-is-zimbabweans-idea-not-mps-zanu-pf-chief-whip/",
            "content": "By Staff Reporter\n\nTHE ED2030 campaign is Zimbabweans idea and not President Emmerson Mnangagwas or legislators, Zanu PF chief whip Pupurai Togarepi has claimed.\n\nIn an interview with NewZimbabwe.com after the MPs Precabe Farm visit last Sunday, Togarepi said the visit had nothing to do with extending Mnangagwas tenure.\n\nAbout 34 opposition MPs visited President Mnangagwas farm over the weekend where politician Jealousy Mawarire claims they pocketed US$5,000.\n\nThe visit was widely viewed as part of a ploy to extend EDs tenure when his term ends after self-styled CCC Secretary General Sengezo Tshabangu said they were prepared to support the deferment of elections for Mnangagwa.\n\nHis supporters brought the idea and you all remember that at the Zanu PF conference in Bulawayo late last year, a resolution was made to the effect that the party members want their leader to continue at the helm of the country beyond 2028.\n\nThis is not an agenda by the MPs who have come to this farm but by Zimbabweans themselves. This idea cannot be stopped by anyone or myself. It is coming from the people of Zimbabwe and MPs are representatives of the people in all 10 provinces, Togarepi said.\n\nMnangagwa is currently serving his second and final term which will end in 2028 but there are sections of his supporters pushing for him to stay beyond that. He has however dismissed the notion saying he will abide by the constitution and step down when its time.\n\nHe added, As a democracy, we are allowed to say what we want so this agenda is not for MPs, but the people of Zimbabwe. Who can stop what we have seen here? Look at the development that we see is what people want beyond 2028.\n\nThe truth is that people may trouble themselves on this issue, debarking the wrong tree but the openness that we have witnessed here has made us wiser than before. We have realised that this criticism from the opposition is crucial for us the ruling party to do the right thing. We want that constructive criticism in order to build the nation.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/08/14051611/zdf-mnangagwa-5.jpeg",
            "description": "<p>By Staff Reporter THE “ED2030” campaign is Zimbabweans’ idea and not President Emmerson Mnangagwa’s or legislators, Zanu PF chief whip Pupurai Togarepi has claimed. In an interview with NewZimbabwe.com after the MPs Precabe Farm visit last Sunday, Togarepi said the visit had nothing to do with extending Mnangagwa’s tenure. About 34 opposition MPs visited President</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/ed2030-campaign-is-zimbabweans-idea-not-mps-zanu-pf-chief-whip/\">‘ED2030’ campaign is Zimbabweans’ idea, not MPs – says Zanu PF chief whip   </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Odinga talks African development after meeting Mnangagwa, says foreigners only concerned with money",
            "url": "https://www.newzimbabwe.com/odinga-talks-african-development-after-meeting-mnangagwa-says-foreigners-only-concerned-with-money/",
            "content": "By Staff Reporter\n\nFORMER Kenyan Prime Minister Raila Odinga has bemoaned how Africa continues to wallow in abject poverty despite vast natural resources it boasts of.\n\nSpeaking after meeting President Emmerson Mnangagwa at State House, Monday, Odinga said a blueprint towards the continents development had to be crafted.\n\nOdinga, who has put forward his name for election to the African Union Commissions (AUC) chairmanship, was in Zimbabwe as part of his campaign.\n\nElections are set for February this year.\n\nAs you know I announced my candidature for chair of the AU and as part of that I have been visiting African countries, said Odinga.\n\nMnangagwa is the country chair of SADC so it was important that I visit Harare.\n\nOdinga will be touring the rest of the southern Africa region on his campaign trail.\n\nAfrica has a bright future (but) we must have a clear roadmap and blueprint on how to develop it, he said.\n\nForeigners only come to Africa to make money so Africa will be developed by Africans themselves.\n\nWe have 55 states in Africa and are looking towards how these can be integrated so that they benefit from its resources.\n\nIt is the richest continent on the planet but the paradox is that Africans are the poorest in terms of living standards.\n\nDespite African countries having become fertile ground for foreign investment, very little has been realised by communities as most still survive in squalid conditions, without potable water, proper sewer systems or respectable road networks.\n\nChinese, European and American investments have failed to rid it of its dark continent tag.\n\nThe AUC is the AUs secretariat and undertakes the day-to-day activities of the Union. It should not be confused with the AU, itself headed by Mohamed Ould Cheikh Mohamed Ahmed Ould Ghazouani, the ninth President of Mauritania.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14141942/odinga-mnangagwa.jpeg",
            "description": "<p>By Staff Reporter FORMER Kenyan Prime Minister Raila Odinga has bemoaned how Africa continues to wallow in abject poverty despite vast natural resources it boasts of. Speaking after meeting President Emmerson Mnangagwa at State House, Monday, Odinga said a blueprint towards the continent’s development had to be crafted. Odinga, who has put forward his name</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/odinga-talks-african-development-after-meeting-mnangagwa-says-foreigners-only-concerned-with-money/\">Odinga talks African development after meeting Mnangagwa, says foreigners only concerned with money</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Man steals goat, sells the meat to owner",
            "url": "https://www.newzimbabwe.com/man-steals-goat-sells-the-meat-to-owner/",
            "content": "By Staff Reporter\n\nA Hwange man who stole a goat from his neighbour before he slaughtered it and sold the meat to its owner has been jailed for six months.\n\nThe convict is Shylock Zulu (28) from Mashala Village.\n\nHe was charged with stock theft and was convicted after a full trial.\n\nProsecutors proved that on January 8 this year, Zulu stole a goat belonging to a fellow villager Thabani Sibanda.\n\nThe accused person slaughtered the said goat and proceeded to Sibandas homestead where he sold the meat to the complainant for US$15 purporting it to be bush buck meat.\n\nThe complainant became suspicious that the meat could be from his goat which went missing, the court heard.\n\nInvestigations led to Zulus arrest.\n\nZulu however escaped a custodial sentence after half of the sentence was suspended on condition he does not commit a similar offence in the next 5 years.\n\nThe remaining three months were suspended on condition accused restitutes complainant ZWG$1057.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/04/16182340/Goat.jpg",
            "description": "<p>By Staff Reporter A Hwange man who stole a goat from his neighbour before he slaughtered it and sold the meat to its owner has been jailed for six months. The convict is Shylock Zulu (28) from Mashala Village. He was charged with stock theft and was convicted after a full trial. Prosecutors proved that</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/man-steals-goat-sells-the-meat-to-owner/\">Man steals goat, sells the meat to owner</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Young Warriors captain Tadiwa Chakuchichi on Cape Town City’s radar",
            "url": "https://www.newzimbabwe.com/young-warriors-captain-tadiwa-chakuchichi-on-cape-town-citys-radar/",
            "content": "By Darlington Gatsi\n\nYOUNG Warriors captain Tadiwa Chakuchichi is reportedly on the radar of Betway Premiership club Cape Town City with the South African side showing strong interest in securing the services of the talented midfielder.\n\nChakuchichi, who led the Young Warriors to the quarterfinals of the COSAFA tournament last year, is highly regarded by Cape Town City.\n\nAccording to South African sports publication iDiski Times, Chakuchichi will travel to South Africa for a trial assessment with the club.\n\nChakuchichis stoke continues to rise since captaining the Zimbabwe under-15 team at the COSAFA schools tournament held in Harare in 2023.\n\nLast year, the Legends Academy player was spotted at English Premiership Club Everton as part of a development program.\n\nShould Chakuchichi sign for Cape Town City, he will follow in the footsteps of Legends Academy alumni Douglas Mapfumo who switched to the side in 2021 before moving to Polokwane City.\n\nMeanwhile, Zimbabwean star Nokutenda Mangezi is nearing a loan move away from Betway Premiershipteam Supersport United.\n\nMangezi joined the Pretoria-based club last year from Real Betis Academy has been struggling in his debut season in the South African top flight and has not yet scored.\n\nThe arrival of experienced striker Samir Nukovic at Supersport has further increased competition for places and Mangezi may find himself lower the pecking order at Matsatsantsa.\n\nAccording to South African online sports publication, Kick Off, Supersport is considering loaning Mangezi to Pretoria Callies for more game time.\n\nMangezis current deal is set to expire in June but has an option for another extension should Supersport United trigger the renewal clause.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14141326/FB_IMG_1736860856092.jpg",
            "description": "<p>By Darlington Gatsi YOUNG Warriors captain Tadiwa Chakuchichi is reportedly on the radar of Betway Premiership club Cape Town City with the South African side showing strong interest in securing the services of the talented midfielder. Chakuchichi, who led the Young Warriors to the quarterfinals of the COSAFA tournament last year, is highly regarded by</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/young-warriors-captain-tadiwa-chakuchichi-on-cape-town-citys-radar/\">Young Warriors captain Tadiwa Chakuchichi on Cape Town City’s radar </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Opposition’s support for Mnangagwa term extension raises eyebrows, watchdog questions Tshabangu’s motive",
            "url": "https://www.newzimbabwe.com/oppositions-support-for-mnangagwa-term-extension-raises-eyebrows-watchdog-questions-tshabangus-motive/",
            "content": "By Staff Reporter\n\nTHE Zimbabwe Election Support Network (ZESN) has questioned the motive behind a move by the opposition Citizens Coalition for Change (CCC) to support President Emmerson Mnangagwas bid for a third term.\n\nA key stakeholder in the countrys electoral processes, ZESN said it believed deferring Zimbabwes elections from 2028 to 2030 would have significant impacts on its democratisation process, governance and integrity.\n\nThe statement, released on Monday, follows comic declarations by self-styled CCC Secretary General Sengezo Tshabangu that they were prepared to support the deferment of elections for Mnangagwa.\n\nTshabangu spoke after being feted at Mnangagwas Precabe Farm, where politician Jealousy Mawarire claimed opposition Members of Parliament (MPs) were each given a US$5,000 purse.\n\nIf our presence here improves your stay in power and makes the people of Zimbabwe happy, then let it be, said Tshabangu who was accompanied by about 32 of his sellout CCC faction.\n\nZESN called for stakeholders to respect the Zimbabwean constitution and highlighted Mnangagwas move dispelling any intentions for an illegal third term.\n\nSome sections of Zanu PF are seeking to amend the constitution to allow Mnangagwa a term they say will end in 2030.\n\nAs the debate surrounding the postponement intensifies among political analysts, citizens, and election observers, concerning developments are emerging, some segments of the opposition have begun to align with the ruling party in advocating for an extension, raising questions about the motivations behind such a shift and its impact on democratic processes.\n\nZESN commends President Emmerson Mnangagwa for his commitment to upholding the Constitution. In 2024, he explicitly distanced himself from the push for the postponement of elections, stating that he had no interest in extending his term beyond 2028, demonstrating a commitment to democratic norms.\n\nThe proposal to postpone the 2028 elections, primarily supported by certain politicians, raises concerns about setting a dangerous precedent in a region that has generally maintained relative peace. It will also violate SADC Principles and Guidelines Governing Democratic Elections, of which Zimbabwe is a signatory.\n\nZESN calls for political will on meaningful and genuine electoral reforms and implementing Election Observer Missions (EOMs) recommendations, said ZESN.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14142859/Tshabangu-ED-e1736865004886.webp",
            "description": "<p>By Staff Reporter THE Zimbabwe Election Support Network (ZESN) has questioned the motive behind a move by the opposition Citizens Coalition for Change (CCC) to support President Emmerson Mnangagwa’s bid for a third term. A key stakeholder in the country’s electoral processes, ZESN said it believed deferring Zimbabwe’s elections from 2028 to 2030 would have</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/oppositions-support-for-mnangagwa-term-extension-raises-eyebrows-watchdog-questions-tshabangus-motive/\">Opposition’s support for Mnangagwa term extension raises eyebrows, watchdog questions Tshabangu’s motive</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "SA receives first shipment of imported white maize since 2017 after record-high grain exports to Zimbabwe",
            "url": "https://www.newzimbabwe.com/sa-receives-first-shipment-of-imported-white-maize-since-2017-after-record-high-grain-exports-to-zimbabwe/",
            "content": "MoneyWeb\n\nThe Port of Durban is receiving a shipment of imported white maize  the first import of the grain since March 2017, when South Africa was experiencing a severe drought.\n\nThe African Baza, a bulk carrier sailing under the Bahamas flag, is currently offloading 23 700 tons of white maize produced in the US, while another vessel containing 46 000 tonnes of white maize is expected in February, says Dr Andr van der Vyver, executive director of the South African Cereals and Oilseeds Trade Association (Sacota).\n\nThe current imports are necessitated by poor crops and record-high grain exports to Zimbabwe in 2024.\n\nLower production\n\nDuring the 2023/24 production year, grains and oilseeds experienced a bad year, with production declining approximately 22.5% for maize and 33.5% for soybeans from the previous year.\n\nThe Crop Estimates Committee in November 2024 estimated white maize production at just over six million tonnes  down 29.3% from the previous year  and yellow maize at 6.716 million tonnes (down 15.4%).\n\nIn the South African seasonal crop cycle, these products should last until approximately March/April 2025 before the new crop [planted in November and December 2024)] will become available again, Van der Vyver notes.\n\nAs early as February 2024 it became evident that South Africa would have to import yellow maize and possibly white maize and soybeans.\n\nSouth Africa had just enough grains to feed itself, but we also supply grain to countries in the Sacu [Southern African Customs Union] region. We did not fully anticipate that the drought would also affect crop production in these countries, and we saw a strong demand from particularly Zimbabwe for white and yellow maize.\n\nMoneyweb reported earlier thata shipment of Argentinian yellow maizewas offloaded at the Port of Cape Town in April.\n\nYellow maize and soybean meal imports continued throughout the latter part of last year.\n\nTo date, Sacotas multi-national grain trading members have imported approximately 518 000 tonnes of yellow maize, Van der Vyver says.\n\nSteep price increases\n\nJSE-traded maize and soybean prices started increasing steadily last year, and the prices have continued to rise. Yellow maize reached a high of R5 431 per tonne in December 2024  a 43% jump from February 2024. White maize soared 70%, reaching a high of R6 670 per tonne.\n\nVan der Vyver notes that prices have since come down marginally.\n\nHowever, agricultural economist Wandile Sihlobo cautioned on social media platform X that higher white maize prices in South Africa may be a reality in the first quarter of 2025, and relief may only come in the second quarter of the year.\n\nExpectations for 2025\n\nAccording to Van der Vyver, imports should continue until the end of April. Good and continuous rain for the new production season started shortly before Christmas, and most planting has been completed.\n\nAfter last years drought not only farmers, but all of South Africa, is desperately looking for an average crop. This will stabilise old crop price increases and bring lower prices with the new crops.\n\nHe cautions that the verdict is still out on the availability of stock until the new crop is harvested.\n\nSouth Africans consume around 11.7 million tonnes of maize per season. Over the past five years, on average 1.5 million tonnes of maize was exported to other African countries.\n\nLocal demand, cross-border exports, sufficient imports, and early harvesting of the new crop determine whether enough maize is indeed available.\n\nIndications are that the maize industry will end the season with 600 000 to 700 000 tonnes which is barely enough to ensure a continuous supply in the pipeline.\n\nA lower supply will put further pressure on maize prices, which will negatively impact consumers.\n\nWhite maize remains a staple food for many South Africans, while yellow maize and soybeans are the main ingredients for the broiler industry. Government must take note of the impact on staples and be prepared to support them timely, says Van der Vyver.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14072313/maize.jpg",
            "description": "<p>MoneyWeb The Port of Durban is receiving a shipment of imported white maize – the first import of the grain since March 2017, when South Africa was experiencing a severe drought. The African Baza, a bulk carrier sailing under the Bahamas flag, is currently offloading 23 700 tons of white maize produced in the US,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sa-receives-first-shipment-of-imported-white-maize-since-2017-after-record-high-grain-exports-to-zimbabwe/\">SA receives first shipment of imported white maize since 2017 after record-high grain exports to Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Rusape introduces US$20 certification fee for water tank installation",
            "url": "https://www.newzimbabwe.com/rusape-introduces-us20-certification-fee-for-water-tank-installation/",
            "content": "By Staff Reporter\n\nProperty owners in Rusape will now have to get certification pegged at US$20 before installing water tank stands.\n\nRusape Town Council says this will guard against substandard water tank stands which pose a risk to the community and infrastructure.\n\nIn a public notice, the town council said water storage tanks with a capacity of 5,000 litres or more must be certified.\n\nAll water storage tanks with a capacity of 5000 litres or more, no matter how high the stand is, must be certified.\n\nWater storage tanks with a capacity of 1000 litres or more must be certified if the tank stand is two metres or more above ground level, reads part of the notice.\n\nProperty owners with existing tank stands have until 31 May 2025 to regularise their structures by obtaining structural certification.\n\nFurthermore, the council also set a certification fee of US$20 for each submission of the tank stand certificate to the local authority.\n\nA fee of USD20 is required for the submission of the certificate of the tank stand to the local authority.\n\nResidents are encouraged to engage qualified structural engineers to inspect and certify their tank stands. Non-compliance with this resolution may result in penalties or other enforcement actions.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14182756/water-tank.jpg",
            "description": "<p>By Staff Reporter Property owners in Rusape will now have to get certification pegged at US$20 before installing water tank stands. Rusape Town Council says this will guard against substandard water tank stands which pose a risk to the community and infrastructure. In a public notice, the town council said water storage tanks with a</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rusape-introduces-us20-certification-fee-for-water-tank-installation/\">Rusape introduces US$20 certification fee for water tank installation</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Zimparks appoints Professor Gandiwa new Director General",
            "url": "https://www.newzimbabwe.com/zimparks-appoints-professor-gandiwa-new-director-general/",
            "content": "By Staff Reporter\n\nProfessor Edson Gandiwa has been appointed the new Director-General of the Zimbabwe Parks and Wildlife Management Authority (ZimParks).\n\nGandiwa replaces Fulton Mangwanya who is now the Director General of the Central Intelligence Organisation (CIO).\n\nHe assumes his new role immediately and has over 20 years of experience in wildlife conservation and higher education.\n\nPreviously, Professor Gandiwa served as Director Scientific Services at ZimParks (January 2021-January 2025); Associate Professor, Inaugural Executive Dean and Full Professor in the School of Wildlife, Ecology and Conservation at Chinhoyi University of Technology (May 2013-January 2021), Ecologist and Senior Ecologist based in Gonarezhou National Park (Chiredzi) at ZimParks (October 2004-April 2013).\n\nHe holds a Doctor of Philosophy (PhD) Degree in Wildlife Conservation and Management from Wageningen University and Research, The Netherlands (2013), a Master of Science Degree in Tropical Resource Ecology (with merit) from the University of Zimbabwe (2007), and a Bachelor of Science (Honours) Degree in Environmental Science and Health (with first class) from the National University of Science and Technology (NUST), Zimbabwe (2004), said Zimparks spokesperson Tinashe Farawo in a statement.\n\nFurthermore, Gandiwa chairs the African Elephant Fund Steering Committee and has coauthored over 200 peer-reviewed scientific publications.\n\nProfessor Gandiwa has (co)authored over 200 peer-reviewed scientific publications.\n\nHis research interests include biodiversity and wildlife conservation, protected area management, community-based natural resource management, ecotourism and media framing of wildlife conservation.\n\nProfessor Gandiwa is the current Chair of the African Elephant Fund Steering Committee under the United Nations Environment Programme (Nairobi, Kenya) and he also seats on several boards, he added.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14163226/WhatsApp-Image-2025-01-14-at-18.31.36.jpeg",
            "description": "<p>By Staff Reporter Professor Edson Gandiwa has been appointed the new Director-General of the Zimbabwe Parks and Wildlife Management Authority (ZimParks). Gandiwa replaces Fulton Mangwanya who is now the Director General of the Central Intelligence Organisation (CIO). He assumes his new role immediately and has over 20 years of experience in wildlife conservation and higher</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimparks-appoints-professor-gandiwa-new-director-general/\">Zimparks appoints Professor Gandiwa new Director General</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "Sugar producer Triangle to retrench workers, cites rising operational costs and unfair competition",
            "url": "https://www.newzimbabwe.com/sugar-producer-triangle-to-retrench-workers-cites-rising-operational-costs-and-unfair-competition/",
            "content": "By James Muonwa\n\nONE of Zimbabwes biggest sugar producers, Triangle Limited will next month retrenchan undisclosed number of workers.\n\nThe company will roll out a three-phased employee retrenchment programme after citing escalating operational costs, currency losses, and competition from low-cost, duty-free imported sugar as key factors driving the unwelcome decision.\n\nThe severance process, which will be done in phases, begins late February 2025 and ends August this year.\n\nIn a recent statement, Triangle Managing Director, Tendai R. Masawi said myriad militating factors had necessitated the job cut.\n\nThe current economic environment in Zimbabwe has presented unprecedented challenges for Triangle Limited over the past three years, Masawi said.\n\nAmong other factors, Masawi said inflationary pressures, rising maintenance costs, and the inability to claim value-added tax (VAT) on inputs after sugar was exempted from VAT, have negatively impacted on the companys operations.\n\nEscalating operational costs, particularly in areas such as fertilizer, fuel, maintenance costs, and imported goods/services, combined with inflationary pressures, currency losses, the inability to claim VAT on inputs after sugar was exempted from VAT, and competition from low-cost duty-free imported sugar, have severely impacted our ability to sustain current levels of operation, said the managing director.\n\nSince 2022, we have seen profit margins decline significantly by 55%, manpower costs increasing by 133% as a proportion of revenue, and debt levels rising to unsustainable levels.\n\nThe company has been unable to generate positive cash flows from its operating activities for the past three years and has faced a very constrained working capital position since the implementation of the revised cane supply arrangements, which has necessitated constant trade-offs between what the business needs and what it can afford.\n\nThe decision to cut jobs was arrived at in order to ensure the company remains viable in the wake of an unrelenting and unfavourable economic climate.\n\nDespite implementing numerous cost-reduction and revenue-enhancement initiatives, these efforts have proven insufficient to stabilize the business. This decision has been taken to protect the long-term sustainability of our organization and ensure that Triangle Limited continues to play its vital role in Zimbabwes economy and the livelihoods of communities in the Lowveld region, Masawi said.\n\nThe company pledged to provide fair severance packages and support programmes for affected employees. Its also a committee to work closely with union representatives and other stakeholders to ensure the process is conducted transparently and fairly.\n\nTriangle said the decision is unrelated to the business rescue process of its South African shareholder or its acquisition by the Vision Consortium.\n\nSince 2022, Triangles profit margins have declined by 55%, while manpower costs have risen by 133% as a proportion of revenue.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/06/29151203/Tongaat-Hulett.jpeg",
            "description": "<p>By James Muonwa ONE of Zimbabwe’s biggest sugar producers, Triangle Limited will next month retrench an undisclosed number of workers. The company will roll out a three-phased employee retrenchment programme after citing escalating operational costs, currency losses, and competition from low-cost, duty-free imported sugar as key factors driving the unwelcome decision. The severance process, which will</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/sugar-producer-triangle-to-retrench-workers-cites-rising-operational-costs-and-unfair-competition/\">Sugar producer Triangle to retrench workers, cites rising operational costs and unfair competition</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        },
        {
            "title": "High Court to hear Magaya’s challenge against disqualification from ZIFA Presidential race on Friday",
            "url": "https://www.newzimbabwe.com/high-court-to-hear-magayas-challenge-against-disqualification-from-zifa-presidential-race-on-friday/",
            "content": "By Mary Taruvinga\n\nAn urgent chamber application by Yadah Stars leader Walter Magaya who is challenging his disqualification fromthe ZIFA presidential racewill be heardon FridayJanuary 17.\n\nHigh Court judge Justice Tawanda Chitapi agreed that the matter was urgent when parties met on Tuesday for case management.\n\nTo this end, the urgent application and the main matter will be heard on Friday, a week before electionsset forJanuary 25.\n\nRELATED:\n\nMagayas lawyer, Tavonga Makamure from Rubaya and Chatambudza Legal Practitioners said they have a strong case.\n\nSo we have so much confidence in the matter and we think we have a very good case because our client Mr Magaya has done so much in football and we just want him to get a chance to contest, said his lawyer Tavonga Makamure.\n\nOur understanding is that our clients name should be on the list even though they might have to mention that he is subject to hearing. Our client is not to be disqualified illegally,Makamure said.\n\nMakamure said the matter is of national interestas such Magayashould be heard.\n\nOur client should be given a chance to contest. However, there is an issue that the elections should be held on the 25th of this month before the elections so we met to push for a quick hearing because this is a matter of public interest and a notional matter so we managed to push for the matter to be heard this Friday.\n\nThe cleric and others including former Zimbabwe captain Benjani Mwaruwari, CAPS United owner Farai Jere and Temba Mliswa are notable figures who failed to pass the eligibility test.\n\nThe barring of the four candidates left Nqobile Magwizi, Twine Phiri, Marshal Gore, Philemon Machana, Martin Kweza and Makwinje Phiri contesting for the presidency.\n\nAccording to the ZIFA statutes, the barred candidates have the option to seek remedy from the Court of Arbitration for Sports (CAS) in Switzerland.\n\nMwaruwari and former ZIFA deputy president Gift Banda have since filed joint appeals at CAS challenging their disqualification.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/01/14120808/magaya.gif",
            "description": "<p>By Mary Taruvinga An urgent chamber application by Yadah Stars leader Walter Magaya who is challenging his disqualification from the ZIFA presidential race will be heard on Friday January 17. High Court judge Justice Tawanda Chitapi agreed that the matter was urgent when parties met on Tuesday for case management. To this end, the urgent application and the main</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-to-hear-magayas-challenge-against-disqualification-from-zifa-presidential-race-on-friday/\">High Court to hear Magaya’s challenge against disqualification from ZIFA Presidential race on Friday</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:27",
            "date": "15 Jan 2025"
        }
    ]
}