{
    "news": [
        {
            "title": "Zimbabwe all-rounder suspended from bowling",
            "url": "https://www.newzimbabwe.com/zimbabwe-all-rounder-suspended-from-bowling/",
            "content": "ICC\n\nKelis Ndhlovu of the Zimbabwe womens team has been suspended from bowling in international cricket with immediate effect.\n\nThe decision regarding Kelis Ndhlovu of theZimbabwewomens team came after an independent assessment confirmed that the left-arm spinner uses an illegal bowling action.\n\nThe 19-year-old has been suspended from bowling in international cricket with immediate effect. She was reported by match officials during the first ODI against Ireland in Belfast on 26 July and she underwent the assessment in Pretoria, South Africa.\n\nIn accordance with Article 6.1 of theBowling Regulations, Ndhlovus suspension shall remain in place until she submits to a re-assessment of her bowling action which confirms that she can bowl without using an illegal bowing action.\n\nNdhlovu captain Zimbabwe U19 side during the inaugural ICC Womens Under-19 T20 World Cup in 2023. Thus far, she has played 13 womens ODIs and 51 womens T20Is with 19 and 44 wickets respectively. With the ball, she averages close to 19 in both the formats.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27150133/kellis-ndhlovu.webp",
            "description": "<p>ICC Kelis Ndhlovu of the Zimbabwe women’s team has been suspended from bowling in international cricket with immediate effect. The decision regarding Kelis Ndhlovu of the Zimbabwe women’s team came after an independent assessment confirmed that the left-arm spinner uses an illegal bowling action. The 19-year-old has been suspended from bowling in international cricket with immediate</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-all-rounder-suspended-from-bowling/\">Zimbabwe all-rounder suspended from bowling </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "U.S Embassy extends crew or transit visa validity for Zimbabweans as routine services remain suspended",
            "url": "https://www.newzimbabwe.com/u-s-embassy-extends-crew-or-transit-visa-validity-for-zimbabweans-as-routine-services-remain-suspended/",
            "content": "By Thandiwe Garusa\n\nTHE United States (U.S) Embassy in Harare has extended the validity of C1/D (transit or crew member) visas for Zimbabwean applicants to 24 months with multiple entry.\n\nRoutine visa services, however, remain suspended at the Harare Embassy and applications will only be accepted at U.S. missions outside Zimbabwe.\n\nThis comes after the U.S embassy in Harare earlier this month announced suspension of all routine immigrant and non-immigrant visa services, except for most diplomatic and official visas, citing national security and public safety concerns.\n\nIn a statement Wednesday, the embassy said applications cannot be submitted at the U.S embassy in Harare due to the pause on immigrant and non-immigrant visa services.\n\nThe validity of C1/D (transit or crew member) visas for Zimbabwean applicants has been extended to 24 months with multiple entry.\n\nApplications for C1/D visas may be submitted at a U.S. embassy or consulate outside of Zimbabwe at this time.\n\nThe U.S. Embassy in Harare continues the pause on routine immigrant and non-immigrant visa services, the statement reads.\n\nA C1/D visa is a U.S. nonimmigrant visa issued to foreign nationals working as crew members on ships or airlines.\n\nIt allows them to travel through the United States either to join their vessel or aircraft, or to transit on their way to another destination.\n\nMeanwhile, it is alleged that 709 Zimbabweans, or about 10.57%, overstayed in the U.S. on their B1 and B2 visas (non-immigrant visas for temporary stays, either business or tourism).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/20182253/embassy.jpg",
            "description": "<p>By Thandiwe Garusa THE United States (U.S) Embassy in Harare has extended the validity of C1/D (transit or crew member) visas for Zimbabwean applicants to 24 months with multiple entry. Routine visa services, however, remain suspended at the Harare Embassy and applications will only be accepted at U.S. missions outside Zimbabwe. This comes after the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/u-s-embassy-extends-crew-or-transit-visa-validity-for-zimbabweans-as-routine-services-remain-suspended/\">U.S Embassy extends crew or transit visa validity for Zimbabweans as routine services remain suspended </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "High Court slams British tycoon Van Hoogstraten’s bid to revive 16-year-old property claim – rules case is long dead",
            "url": "https://www.newzimbabwe.com/high-court-slams-british-tycoon-van-hoogstratens-bid-to-revive-16-year-old-property-claim-rules-case-is-long-dead/",
            "content": "By Mary Taruvinga\n\nThe High Court has thrown out British businessman Nicholas van Hoogstratens attempt to resurrect a 2009 lawsuit over a luxury Harare property, ruling that the case was long dead and any order now would be a brutum fulmen  an empty thunderbolt with no effect.\n\nJustice Joel Mambara, sitting at the Harare High Court, dismissed the application, saying Van Hoogstraten had waited far too long to act and could not revive a claim that had lain dormant for 16 years.\n\nThe horse has bolted  the ship has sailed  and it would offend the sound administration of justice to pretend otherwise, the judge said.\n\nAt the heart of the dispute is Stand No. 4 Wroxham Road, The Grange, which Van Hoogstraten bought at a 2005 sheriffs auction.\n\nHe argued that the sale gave him indefeasible rights and accused the judgment debtor, Felistas Runyararo James, of colluding with officials to block the transfer.\n\nBut James later sold the property to the Richard Samaita Family Trust in 2013, which still holds title and was not cited in the proceedings.\n\nVan Hoogstraten applied this year to reinstate his old summons and compel James to transfer the property.\n\nMambara ruled that under Practice Direction 1 of 2022, his case had already lapsed after years of inaction.\n\nLitigation must never be an eternal right without regulated time frames failure to have such cut-off time frames will result in endless suits, the judge said, stressing the need for finality.\n\nThe court found that Van Hoogstraten had offered only a partial explanation for his delay, pointing to bureaucratic hurdles in retrieving an archived file, but ultimately failed to show good cause.\n\nEven more decisively, Justice Mambara said the relief sought was now futile: It would be absurd to order the first respondent to sign transfer forms for a property she sold 12 years ago and no longer owns. Courts do not engage in ceremonial exercises or issue orders that are empty of practical force.\n\nThe judge also noted that Van Hoogstraten never actually paid for the house, since the sheriff returned his cheque uncashed years ago.\n\nWhat the applicant is asking the court to do is to order specific performance when he has not paid a cent for the property. In effect, he will get the property for free.\n\nDismissing the application in its entirety, Justice Mambara concluded: There comes a point when even a meritorious claim must yield to the greater good of certainty and finality. That point has long passed in this case.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/27144107/Nicholas-van-Hoogstraten-scaled.jpg",
            "description": "<p>By Mary Taruvinga The High Court has thrown out British businessman Nicholas van Hoogstraten’s attempt to resurrect a 2009 lawsuit over a luxury Harare property, ruling that the case was “long dead” and any order now would be “a brutum fulmen” — an empty thunderbolt with no effect. Justice Joel Mambara, sitting at the Harare</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/high-court-slams-british-tycoon-van-hoogstratens-bid-to-revive-16-year-old-property-claim-rules-case-is-long-dead/\">High Court slams British tycoon Van Hoogstraten’s bid to revive 16-year-old property claim – rules case is long dead</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "Greed and no consideration for children – judges says as ZETDC HR boss loses Supreme Court bid in bitter divorce battle",
            "url": "https://www.newzimbabwe.com/greed-and-no-consideration-for-children-judges-says-as-zetdc-hr-boss-loses-supreme-court-bid-in-bitter-divorce-battle/",
            "content": "By Mary Taruvinga\n\nThe Supreme Court has dismissed with costs an application by Rodger Sibanda, Principal Human Resources Officer at the Zimbabwe Electricity Transmission and Distribution Company (ZETDC), who sought to overturn the High Courts award of the couples Buena Vista home and a Mercedes-Benz to his former wife, whom he married when she was just 19.\n\nIn a recent ruling, Justice Nicholas Mathonsi, sitting with Justices Antoneta Guvava and Tendai Uchena, said Sibandas appeal was both hopeless and motivated by greed and an unbelievable lack of consideration for the best interests of his two minor children and the interests of his former wife.\n\nSibanda, now 56, who married Thandiwe Casenege Sibanda in 2011 when he was 42, almost twice her age, had persuaded her to abandon school and take up a job at ZETDC.\n\nTheir marriage collapsed in 2017, sparking an acrimonious divorce that saw the High Court grant custody of the couples children, now aged 12 and 10, to Thandiwe, along with the disputed house and car.\n\nDespite retaining three other immovable properties and four motor vehicles, Sibanda launched repeated attempts to wrestle back Buena Vista and the Mercedes-Benz, filing four separate condonation applications after failing to appeal within the 15-day limit.\n\nThe applicant does not deserve the indulgence of condonation and extension of time within which to prosecute a doomed appeal, ruled Mathonsi.\n\nIt is unconscionable that a father can wish that for his family  to render the children and their mother homeless and to use public transport to school and to work, while he luxuriates with multiple houses and vehicles.\n\nThe court dismissed Sibandas excuse that he had been battling depression, noting he provided no evidence to back up his claims.\n\nThe explanation is demonstrably unsatisfactory, Mathonsi said. Clearly, the applicant does not give an honest account of his default.\n\nWith the Supreme Courts decision, Thandiwe will retain both the Buena Vista property and the Mercedes-Benz, while Sibanda remains with the larger share of their estate.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/11/07024130/Supreme-Court.png",
            "description": "<p>By Mary Taruvinga The Supreme Court has dismissed with costs an application by Rodger Sibanda, Principal Human Resources Officer at the Zimbabwe Electricity Transmission and Distribution Company (ZETDC), who sought to overturn the High Court’s award of the couple’s Buena Vista home and a Mercedes-Benz to his former wife, whom he married when she was</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/greed-and-no-consideration-for-children-judges-says-as-zetdc-hr-boss-loses-supreme-court-bid-in-bitter-divorce-battle/\">Greed and no consideration for children – judges says as ZETDC HR boss loses Supreme Court bid in bitter divorce battle</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "RBZ moves to rebrand ‘defiled’ ZWG notes",
            "url": "https://www.newzimbabwe.com/rbz-moves-to-rebrand-defiled-zwg-notes/",
            "content": "By Alois Vinga\n\nTHE Reserve Bank of Zimbabwe (RBZ) has unveiled plans to launch newly designed ZWG notes, effectively dumping the old defiled versions in a move set to trigger yet another wave of shock across the markets.\n\nIntroduced on April 5 2024, as the countrys lasting solution to currency problems, the ZWG has suffered major setbacks since its inception, including the 43% devaluation in September 2024, which left the local units gold-backed status in question.\n\nThe currency is still in short supply, with the rural economy having very limited access to the local unit despite being the most populous. Some regions have resorted to using the rand as a medium of exchange, especially for smaller denominations in transactions.\n\nIn the midst of another storm following the announcements that the country will adopt the ZWG as the sole currency in 2030, RBZ governor, Dr John Mushayavanhu, on Tuesday told a state-run publication that plans to launch a new version of ZWG notes were currently underway.\n\nThe Reserve Bank is working on the modernisation of the ZiG banknote series as advised in the recent mid-term Monetary Policy Statement. The new ZiG banknotes will be redesigned, including improved quality and durability for the convenience of the transacting public.\n\nIn this regard, the production process of the improved banknotes has progressed well and is at an advanced stage. The public will be advised of the expected roll-out at the appropriate time, he said.\n\nSceptics immediately took to social media platforms questioning the rationale behind the new designs, with many concluding it is a ploy to dump the failed first version.\n\nMarket watchers who anonymously spoke to our publication criticised the ghostly nature of RBZ announcements for creating more headaches than solutions.\n\nThey are of the view that the RBZ must accompany its policy announcements with finer details to avoid market speculation.\n\nOn his part, Mushayavanhu said the new notes must not be misconstrued as a new currency but just a normal routine in line with global best practices.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/05171606/mushayavanhu-zig-3.jpg",
            "description": "<p>By Alois Vinga THE Reserve Bank of Zimbabwe (RBZ) has unveiled plans to launch newly designed ZWG notes, effectively dumping the old ‘defiled’ versions in a move set to trigger yet another wave of shock across the markets. Introduced on April 5 2024, as the country’s lasting solution to currency problems, the ZWG has suffered</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rbz-moves-to-rebrand-defiled-zwg-notes/\">RBZ moves to rebrand ‘defiled’ ZWG notes</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "Zimbabwe urges African nations to prioritise sustainable health financing as donor support declines",
            "url": "https://www.newzimbabwe.com/zimbabwe-urges-african-nations-to-prioritise-sustainable-health-financing-as-donor-support-declines/",
            "content": "By Thandiwe Garusa\n\nZIMBABWE has called on African nations to prioritise sustainable health financing following recent withdrawals of donor funding across the region.\n\nHealth Minister Douglas Mombeshora said this at the ongoing 75th World Health Organisation Regional Committee for Africa meeting in Zambia.\n\nMombeshora, who acknowledged that Zimbabwes struggling healthcare system has for too long depended heavily on donor support, which made it more fragile after funding withdrawals urged long-term resilience rather than short-term dependency, saying this was key to building strong national health systems.\n\nZimbabwes message is clear: sustainable health financing is the cornerstone of strong national health institutions.\n\nWe must move away from dependence and toward resilience from short-term cycles to long-term stability.\n\nLet us work together as a region to mobilise domestic resources, innovate in our financing approaches, and deepen partnerships with the private sector.\n\nIn doing so, Africas health systems will not only survive, but thrive delivering tangible results for our people, Mombeshora said.\n\nAs a way to boost domestic health financing in Zimbabwe, Mombeshora said the nation increased its health budget allocation from 9.4% to 13% and introduced new levies on airtime, sugar, fast foods and other products.\n\nHe also added that the government is rolling out a National Health Insurance scheme to protect citizens from catastrophic medical costs.\n\nZimbabwes government has long neglected general hospitals, which now face crumbling infrastructure, medicine shortages, costly patient care and poor wages that have led to low staff morale and a massive brain drain.\n\nMombeshora also added that the government is strengthening primary healthcare, investing in human resources, upgrading infrastructure, and promoting community engagement.\n\nMeanwhile, Botswana has declared a public health emergency, with President Duma Boko saying the national medical supply chain has collapsed due to depleted government coffers and steep cuts in aid from the United States.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/06/19201620/mombeshora.jpeg",
            "description": "<p>By Thandiwe Garusa ZIMBABWE has called on African nations to prioritise sustainable health financing following recent withdrawals of donor funding across the region. Health Minister Douglas Mombeshora said this at the ongoing 75th World Health Organisation Regional Committee for Africa meeting in Zambia. Mombeshora, who acknowledged that Zimbabwe’s struggling healthcare system has for too long</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimbabwe-urges-african-nations-to-prioritise-sustainable-health-financing-as-donor-support-declines/\">Zimbabwe urges African nations to prioritise sustainable health financing as donor support declines</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "Spur looks for growth beyond SA borders with new restaurant in Zimbabwe",
            "url": "https://www.newzimbabwe.com/spur-looks-for-growth-beyond-sa-borders-with-new-restaurant-in-zimbabwe/",
            "content": "TimesLive\n\nSpur Corporation will open a new Doppio Zero restaurant in Zimbabwe, making it the brands second outlet outside South Africa, as the company eyes a total of about 50 restaurants across a number of countries in the coming years.\n\nSpur also wants to add more small-format restaurants for its other brands, including Rocco Mamas, following the success of Panarottis, which breached the R1bn mark in full-year turnover.\n\nDuring the financial year to June, Spur Corporation opened the first Doppio Zero restaurant outside South African borders in Gaborone, Botswana, and now has plans to add more outlets, but mainly in South Africa. Doppio ended the financial year with 32 restaurants after opening four more.\n\nSpur bought the Doppio group, which includes Modern Tailors and Pizza e Vino, about two years ago. The company was fully included in the 2025 financial year, and contributed R709.9m to total group restaurant sales.\n\nRentals are expensive, so if you go into these smaller markets, you cant afford to build a very big store. The most important thing is that it becomes a lovely entry-level investment for new, and young, franchisees. So a lot of new companies might not have R7m to invest in a full restaurant, but maybe theyve got R4m to invest in a smaller footprint format.\n\nSpur Corporation CEO Val Nichas said the new Doppio restaurant will open in Harare in November.We visualise it being a small specialty chain. I would say it probably wont go over 50/60, but you know, it depends on how the market evolves. Might expand, you never know. But I dont think it will be big.\n\nSpur is also extending Doppio to new locations like hospitals, hotels, and shopping malls through a new, smaller format Doppio Caffe to attract different customers.We are opening a Doppio Caffe in a lovely new nursery lifestyle centre in Rosebank, Johannesburg. Thats an unusual site. Its not your traditional shopping mall or strip mall.\n\nFollowing the success of small-format Panarottis and Spur outlets in small towns, Nichas said the format would be extended to other brands like Rocco Mamas. Panarottis small-town strategy has contributed to double-digit growth over the past 18 months, and there are plans to add 13 smaller-format/smaller town locations.Were looking at areas where we dont have to build a big store. Its easier to get a smaller footprint into a smaller community and make it a better return on investment for franchisees, and also for space, she said.\n\nRentals are expensive, so if you go into these smaller markets, you cant afford to build a very big store. The most important thing is that it becomes a lovely entry-level investment for new, and young, franchisees. So a lot of new companies might not have R7m to invest in a full restaurant, but maybe theyve got R4m to invest in a smaller footprint format.\n\nSpur restaurants are also opening at non-traditional locations like petrol stations.\n\nIn the year to June, Spur brand increased restaurant sales by 4.8% to R6.4bn, accounting for 64% of total South African sales. Panarottis increased restaurant sales by 13.6% to R1.04bn, and RocoMamas by 5% to R979m, with these brands representing 10% and 9% of local sales, respectively.\n\nSpurs total restaurant sales, including international outlets, were up 8.3% to R11.4bn. Takeaways account for 13% of total local restaurant sales. Of those, orders collected by customers comprise more than 50% of takeaway sales, with the balance delivered by Mr D and Uber Eats.\n\nNichas said takeaways have grown significantly from 7% pre-Covid, but will likely remain a small segment of the group given that its restaurants are casual dining, in which most customers prefer to sit.\n\nSpur Corporation has 724 outlets in 14 countries, including Australia, Zambia, and Mauritius. It exited the Middle East and India but will open 42 new restaurants in South Africa and 14 internationally.\n\nNichas said Spur Corporations brands have not reached saturation levels in South Africa or beyond, adding: Restaurant set-up costs and refinement to business models continue to be key priority areas. Secondary channels are also expected to grow.\n\nWe will focus on expanding our presence on the African continent, where we have seen good traction this year. We are optimistic about the future of Africa as the casual dining restaurant becomes appealing to consumers who want to enjoy a seated meal experience and celebration.\n\nShe said interest rate cuts in South Africa have bolstered consumer spending, providing a favourable climate for restaurants. This optimism resulted in a notable surge in restaurant sales, especially in urban centres like Johannesburg and Cape Town, she said.\n\nThe quick-service restaurant and casual dining segments have been primary beneficiaries, capitalising on consumers demand for convenience and value-seeking to suit their wallets. However, the cost of living and economic constraints continue to affect household spend. Despite reductions in borrowing costs and food inflation, disposable income and discretionary spending have not yet seen significant increases.\n\nThe country still faces challenges, including high unemployment and fiscal constraints. The competitive landscape continues to evolve with a broader range of players vying for market share. Beyond traditional competitors, the group now faces challenges from supermarket retailers product offerings.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/08/26182030/spur.jpg",
            "description": "<p>TimesLive Spur Corporation will open a new Doppio Zero restaurant in Zimbabwe, making it the brand’s second outlet outside South Africa, as the company eyes a total of about 50 restaurants across a number of countries in the coming years. Spur also wants to add more small-format restaurants for its other brands, including Rocco Mamas,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/spur-looks-for-growth-beyond-sa-borders-with-new-restaurant-in-zimbabwe/\">Spur looks for growth beyond SA borders with new restaurant in Zimbabwe</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        },
        {
            "title": "Court halts RioZim’s asset sales amid corporate rescue proceedings",
            "url": "https://www.newzimbabwe.com/court-halts-riozims-asset-sales-amid-corporate-rescue-proceedings/",
            "content": "By Mary Taruvinga\n\nThe High Court of Zimbabwe granted an urgent interdict to the Zimbabwe Diamond & Allied Minerals Workers Union (ZDAMWU), effectively blocking RioZim Limited from disposing of its mining assets while pending corporate rescue proceedings.\n\nThe judgment, delivered by Justice Maxwell Dembure, encapsulated the precarious intersection of corporate governance and worker rights.\n\nThe case arose after RioZim, a publicly listed company, issued a cautionary statement on July 21, 2025, initiating discussions regarding the potential sale of its mining and non-core assets. This announcement followed ZDAMWUs filing of a court application on April 28, seeking to place the company under supervision due to financial distress.\n\nDembure noted, The mere filing of the application for corporate rescue triggers an immediate moratorium on the disposal of a companys assets, emphasising the protective nature of the law intended to shield creditors and employees from the adverse effects of asset stripping.\n\nHe further highlighted that any attempt at asset disposal during this phase could render the corporate rescue application academic, fundamentally undermining the purpose of such proceedings.\n\nIn lambasting RioZims move, the judge said, If the applicants rights are not preserved, the purpose of the ongoing litigation will be defeated, which is against the interests of all affected, including the workers. The court affirmed that allowing the asset disposals would suit a strategy that frustrates and defeats the pending corporate rescue proceedings, further noting that the company must not be allowed to operate as if it were free from legal encumbrances.\n\nZDAMWUs counsel, R. Mabwe, characterised the urgency of the application as essential, asserting that should the court fail to act swiftly, irreparable harm would result, reflecting the unions commitment to safeguarding employee interests linked to the companys asset base.\n\nRioZims response, led by attorney E. Donzvambeva, contended that the company should be allowed to explore transactions to alleviate financial duress without impediment.\n\nHe argued, The proposed disposals are necessary for the companys survival, pointing out that asset sales could provide much-needed liquidity during corporate rescue discussions.\n\nHowever, Dembure countered, highlighting the lack of clarity in RioZims intentions about which specific assets might be sold, noting that such details could impact any ruling on the matter.\n\nThe court granted two key orders: prohibiting any asset sales contemplated in RioZims cautionary statement and mandating the company to bear the costs of the proceedings.\n\nThe balance of convenience strongly lies in favouring the applicants request for an interim interdict to prevent potential asset dissipation until a determination is made on the main application.\n\nAs a result of this significant ruling, RioZims shareholders and stakeholders will need to navigate the complexities of corporate restructuring under the courts oversight, while the future of the companys asset management remains uncertain.\n\nThe outcome of the wider corporate rescue proceedings now looms large, with potential implications for the mining sector and employee security within the industry at stake.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/04/13181521/high-court-of-zimbabwe-3.jpg",
            "description": "<p>By Mary Taruvinga The High Court of Zimbabwe granted an urgent interdict to the Zimbabwe Diamond & Allied Minerals Workers’ Union (ZDAMWU), effectively blocking RioZim Limited from disposing of its mining assets while pending corporate rescue proceedings. The judgment, delivered by Justice Maxwell Dembure, encapsulated the precarious intersection of corporate governance and worker rights. The</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/court-halts-riozims-asset-sales-amid-corporate-rescue-proceedings/\">Court halts RioZim’s asset sales amid corporate rescue proceedings</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "20:41",
            "date": "27 Aug 2025"
        }
    ]
}