{
    "news": [
        {
            "title": "ZimFest 2025: A Bridge between generations, beats, and belonging",
            "url": "https://www.newzimbabwe.com/zimfest-2025-a-bridge-between-generations-beats-and-belonging/",
            "content": "By A Correspondent\n\nLONDON: With its signature mix of music, community, and cultural pride, Zimfest returned, drawing huge crowds and delivering memorable moments.\n\nAfter two decades, the festival is no longer just a nostalgic gathering for the diaspora, instead, its become a cultural bridge, particularly for second-generation Zimbabweans finding their roots.\n\nA generational shift\n\nPerhaps Zimfests most powerful triumph this year wasnt on the main stage or in a headline set  it was in the faces of its crowd. The youthful demographic was impossible to miss. Teens and twenty-somethings arrived in droves, draped in flags, dancing with pride and curiosity, reconnecting with a Zimbabwe some of them have never physically known. That energy is priceless, and it positions Zimfest as more than an event but a cultural inheritance.\n\nTawanda Chiwira (OLY), spokesperson for Zimfest, said: This event has never just been about the music, its about creating a space where Zimbabwean culture can be experienced at different levels.\n\nWhat really stood out this year was the energy from the younger generation. Seeing them take ownership of the experience, thats what its all about. We want Zimfest to feel like home, like something youre proud to be part of. That connection doesnt stop when the music does, its something were building annually.\n\nWere also continually listening to feedback because while no festival is without its challenges, every concern is an opportunity to improve. Our goal is to give everyone the best possible experience, year after year, and to keep making the festival a true home for Zimbabwean culture in the UK.\n\nSonic innovation: Amapianos takeover\n\nThe Piano Republik stage, back by popular demand, was easily one of the weekends standout attractions.\n\nAmapiano royalty DJ Maphorisa and Young Stunna turned the popular red tent into a memorable experience for fans, with a massive audience moving as one to the beat of this South African genres global rise.\n\nIt wasnt just a series of performances; it was a cultural moment, one that reaffirmed Zimfests ability to tap into pan-African trends while keeping a Zimbabwean heart.\n\nStar power and rising stars: Zimbabwes music scene on full display\n\nVeteran performer Busi Mhlanga made a powerful return to the Zimfest stage, bringing a wave of nostalgia with her.\n\nWith her signature sound and iconic stage presence, she transported the crowd back to the golden era of Zimbabwean music, offering a soulful nod to the old-school while reminding everyone why she remains such a respected figure in the industry.\n\nHer set was more than a performance; it was a moment of homage to the foundation she helped lay for the next generation. In a lineup filled with rising stars, Busi stood tall as a reminder that timeless talent never fades.\n\nSaintfloew took to the stage with the confidence of an artist who knows hes arrived. His journey from underground favourite to festival mainstay has been rapid, and his performance confirmed that the hype is well-earned. His growth was evident, not just in sound, but in presence and its clear this is only the beginning.\n\nRising stars Oriyano and Nisha TS brought their own flavour to the stage, with Nishas performance in particular standing out. It was a moment of real girl power, proving that female talent isnt just part of the story, its pushing it forward. Crowd-favourite Jah Signal lit up the stage with his trademark energy, keeping vibes high from start to finish.\n\nClosing the night with undeniable star power, Winky D once again proved why he remains one of Zimbabwes most commanding performers. A seasoned Zimfest favourite, he knows how to read the crowd and deliver  effortlessly moving from anthem to anthem with the charisma and energy of an artist who understands the stage as much as he does his audience.\n\nTogether, the lineup wove a rich tapestry of Zimbabwean sound, celebrating icons, welcoming new voices, and giving the diaspora a musical experience that felt both rooted and refreshingly current.\n\nThe Bottlenecks: bars, queues, and festival tweaks\n\nThe organisers clearly havent rested on their laurels. This years layout saw notable tweaks, most significantly, the relocation of the Sky Terrace. The move gave VVIP guests an improved view of the main stage and a better overall experience. These adjustments, while perhaps subtle to the casual attendee, reflect a responsive approach to festival curation.\n\nAs with any event of this scale, challenges surfaced. Bar queues were long at times, an issue not uncommon at large-scale festivals, regardless of how many service points are available. The event saw an impressive turnout, and at peak times demand tested capacity. However, all available bars were operational, and organisers have confirmed a review of their placement to better serve future crowds.\n\nUnexpected delays at departure\n\nDespite months of planning to ensure smooth transport, an unforeseen road traffic incident disrupted Zimfests otherwise well-executed exit strategy. As the headline acts wrapped up, a serious collision on a main route meant police had to close the road for nearly two hours, causing widespread delays and also limited taxi access. Despite this, the team handling traffic control acted quickly to implement an alternative plan, prioritising safety above all.\n\nA spokesperson for the onsite team said; Zimfest is a year in the making, involving 12 months of planning and close coordination with partners including local authorities, the police, and National Highways to ensure a smooth and safe experience for everyone.\n\nUnfortunately, the accident on one of our main exit routes and the resulting road closures prevented the swift transition we had planned.\n\nWhile some of these events were beyond our control, we sincerely apologise for the inconvenience and are grateful for the patience and cooperation shown by those who attended.\n\nA festival still worth celebrating\n\nDespite some online speculation from less established sources attempting to cast doubt on this years event, its worth setting the record straight. Contrary to speculation, no fines were issued to the organisers.\n\nZimfest ran in close collaboration with relevant authorities, and the crowds conduct over the weekend was far from the chaos some corners of the internet would have you believe.\n\nYes, a few questionable outfit choices may have made an appearance  as they do at any festival but they hardly defined the weekend. The overall event itself reflected the kind of pride and community spirit the festival is known for.\n\nWith thousands in attendance, this years festival upheld its reputation as a well-run, high-energy celebration of Zimbabwean identity in the UK. From Zimbabwes homegrown stars to cross-border powerhouses, from local vendors to global fans, Zimfest continues to evolve. There were a few bumps in the road and its imperfections may be real but so is its heart. And if the youth have embraced it, then its future is not just secure, its guaranteed.\n\nThis years event was supported by major international sponsors, including World Remit, Remitly, Ecocash, and Mukuru, alongside other key partners like Nyaradzo Life Insurance, Diaspora Insurance, Wiremit, Clear Mobitel Connect, My Hippo Store, Hello Paisa and Kumusha.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/30080741/ZimFest-6.png",
            "description": "<p>By A Correspondent LONDON: With its signature mix of music, community, and cultural pride, Zimfest returned, drawing huge crowds and delivering memorable moments. After two decades, the festival is no longer just a nostalgic gathering for the diaspora, instead, it’s become a cultural bridge, particularly for second-generation Zimbabweans finding their roots. A generational shift Perhaps</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/zimfest-2025-a-bridge-between-generations-beats-and-belonging/\">ZimFest 2025: A Bridge between generations, beats, and belonging</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        },
        {
            "title": "Rangers injured following elephant attacks in Sengwa Chirisa Safaris",
            "url": "https://www.newzimbabwe.com/rangers-injured-following-elephant-attacks-in-sengwa-chirisa-safaris/",
            "content": "By Staff Reporter\n\nTwo Zimbabwe Parks and Wildlife Management Authority (ZimParks) rangers sustained critical injuries after they were attacked by elephants in Sengwa Chirisa Safaris Tuesday afternoon, according to officials.\n\nZimParks spokesperson Tinashe Farawo said the two have since been airlifted to Harare for urgent medical attention.\n\nOne of the rangers suffered a broken arm while fleeing, whilst the other was gored, sustaining abdominal wounds and fractures to his arm and leg.\n\nThe incident occurred after the duo was deployed to investigate a reported case of a snared buffalo that was perceived to be a potential danger to the community.\n\nOn the way, they encountered a herd of elephants with calves which charged at them, forcing them to flee in different directions, Farawo said.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/12/10153528/unnamed-2.jpg",
            "description": "<p>By Staff Reporter Two Zimbabwe Parks and Wildlife Management Authority  (ZimParks) rangers sustained critical injuries after they were attacked by elephants in Sengwa Chirisa Safaris Tuesday afternoon, according to officials. ZimParks spokesperson Tinashe Farawo said the two have since been airlifted to Harare “for urgent medical attention.” One of the rangers suffered a broken arm</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/rangers-injured-following-elephant-attacks-in-sengwa-chirisa-safaris/\">Rangers injured following elephant attacks in Sengwa Chirisa Safaris</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        },
        {
            "title": "‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home",
            "url": "https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/",
            "content": "IOL\n\nMany Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation.\n\nThese were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa forthe 2025 Liberation Movements Summit hosted by the African National Congress (ANC) in Kempton Park.\n\nThe summit concluded on Monday and was hosted under the theme: Defending the liberation gains, advancing integrated socio-economic development, strengthening solidarity for a better Africa.\n\nSouthern African liberation movements, including the ANC, Peoples Movement for the Liberation of Angola (MPLA), Namibias ruling party, the South West Africa Peoples Organisation (Swapo); Mozambiques Frente de Libertao de Moambique (Frelimo); Zanu-PF, and Tanzanias ruling Chama Cha Mapinduzi (CCM) were represented at high level at the summit in Gauteng.\n\nMutsvangwa, in an interview withbroadcaster Newzroom Afrika, was asked for his views on the prevailing political and economic situation in Zimbabwe, which has resulted in the extensive migration of Zimbabweans into South Africa, estimated in the millions, sparking tensions in South African communities.\n\nIn his response, Mutsvangwa said Zimbabweans in South Africa are seeking greener pastures, but the situation back home has significantly improved.\n\nIt is the search for better pastures, that is natural. South Africa had the advantage of having comparative access to capital as a white apartheid state. In colonial times, capital into Africa followed white, and South Africa has the biggest white population on the African continent. All those Western countries gave South Africa a certain edge in access to capital.\n\nWe in Zimbabwe/Rhodesia were second in terms of our white population. We also had comparatively better access to capital than any other African country, and we had migration of labour from Mozambique, Malawi, and Zambia into Zimbabwe.\n\nThe former Zimbabwean ambassador to the Peoples Republic of China said people follow where they see an advantage in terms of development and capital.\n\nNow things have changed. We are now having capital in a flat global world where China can supply capital, India can supply capital, Riyadh can supply capital, so we now have an Africa that is going to global markets, getting capital. That discrepancy in access to capital, which was the case for the colonial era, is beginning to disappear.\n\nYou cannot believe it, there is now a seamless environment between life in Zimbabwe and life abroad. That is why our diaspora is coming back to Zimbabwe, putting a lot of money  our diaspora feels at home, they are now beginning to invest at home. For your information, the biggest diaspora migration is white.\n\nHe said the white Zimbabweans who had fled the country at the onset of majority rule in 1980 make up a good number of the people moving back into the landlocked Southern African nation ruled by President Emmerson Mnangagwa.\n\nSo the return of the white diaspora back to Zimbabwe is actually an indication that things are getting better in Zimbabwe. Remember we are operating the hardest currency in the world, the US dollar, and if you can make your economy succeed on the back of the US dollar, it means you are doing very well as a country, said theWar Veterans Association chairperson.\n\nSpeaking to IOL,Dr Alexander Rusero, head of the department of international relations and diplomacy at the Africa University situated in Mutare, Zimbabwe, said the landlocked country seemingly has its worst times behind it  economically and politically.\n\nI think in all fairness, Zimbabwe has had its bad tide and we are definitely past that in as much as the mess we were once in as a country is concerned. That explains why you hear an opposition voice. We are as good as not having an opposition in Zimbabwe, and if you want to look at Zimbabwes dynamics currently, just look at the balance of forces within Zanu-PF.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2024/04/16052318/InShot_20240415_165630255-scaled.jpg",
            "description": "<p>IOL Many Zimbabweans who left the country at the peak of economic and political turmoil, and settled in numerous countries, including South Africa, are now investing back home, while others are returning to their ancestral nation. These were the views expressed by Zanu PF national spokesperson, Christopher Mutsvangwa, who was recently in South Africa for the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/even-white-zimbabweans-are-returning-zanu-pf-insists-exiles-are-flocking-back-home/\">‘Even white Zimbabweans are returning’: Zanu-PF insists exiles are flocking back home</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        },
        {
            "title": "Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project",
            "url": "https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/",
            "content": "By Staff Reporter\n\nPRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project.\n\nTwo months back, the treasury had not disbursed enough funds withconstruction of the dam set to be completed this year.\n\nAccording to Lands Deputy Minister, Vangelis Haritatos, the Treasury was releasing funds in drips and drops which cannot make any significant changes.\n\nThe Gwayi-Shangani project, which is supposed to be a permanent fix to Bulawayos water shortages, has faced delays and failed to meet several deadlines since work started in 2004.\n\nThe most recent deadline, which was set by the government, was for the dam to be completed by the 2023/2024 summer cropping season, which it also missed.\n\nIn a statement posted on the social media platform X under his pseudonym Jamwanda, the Deputy Chief Secretary forPresidential Communications, George Charamba said US$10 million has already been disbursed.\n\nPresident ED Mnangagwa has ordered the finance ministry to ensure a monthly disbursement of US$5 million towards completion of the stalled Gwayi-Shangani dam.\n\nSo far US$10m has been released, ensuring some four meters of the all concrete wall are done, he wrote.\n\nIn 2018, Mnangagwa toured the Gwayi-Shangani dam and pledged to do everything in his power to ensure the project is completed by the end of 2019 and to date, it has not been completed.\n\nLast year, the government allocated ZiG1,2 billion in the national 2025 budget to complete Lake Gwayi-Shangani and Kunzvi Dam which is now at 72% completion.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29182454/gwayi.webp",
            "description": "<p>By Staff Reporter PRESIDENT Emmerson Mnangagwa has directed the Ministry of Finance to release US$5 million every month to speed up work on the long-stalled Gwayi-Shangani Dam project. Two months back, the treasury had not disbursed enough funds with construction of the dam set to be completed this year. According to  Lands Deputy Minister, Vangelis Haritatos,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/mnangagwa-orders-us5-million-disbursement-to-speed-up-delayed-gwayi-shangani-dam-project/\">Mnangagwa orders US$5 million disbursement to speed up delayed Gwayi Shangani dam project</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        },
        {
            "title": "Businessman granted direct access to Constitutional Court in legal fight with former Zupco chairperson",
            "url": "https://www.newzimbabwe.com/businessman-granted-direct-access-to-constitutional-court-in-legal-fight-with-former-zupco-chairperson/",
            "content": "By Mary Taruvinga\n\nThe Constitutional Court of Zimbabwe has granted direct access to businessman Jayesh Shah, the applicant, allowing him to challenge a prior decision made by the Supreme Court in a case he was ordered to pay US$130,000 to former Zupco chairperson Charles Nherera for malicious prosecution.\n\nIn the case, Shah aims to contest the Supreme Courts handling of his appeal against the above order relating to issues of malicious prosecution, arrest, and detention stemming from an ongoing legal battle with Nherera.\n\nThe complex legal saga traces back over two decades, originating from business dealings between Shahs company, Gift Investments (Private) Limited, and ZUPCO.\n\nThe conflict escalated following allegations of corruption, a bribery scandal that led to criminal charges against both parties, and ultimately a conviction for Nherera that was later overturned, resulting in a civil suit against Shah for wrongful prosecution, which claims damages totalling $400,000.\n\nNherera had claimed US$400,000 but the High Court ruled that the amount was too high.\n\nJustice Nicholas Mathonsi ordered Shah to compensate Nherera of US$130,000, which could be paid in local currency at the official exchange rate.\n\nUnhappy with the decision, Shah then approached the Supreme Court.\n\nThe Supreme Court previously upheld a decision awarding Nherera damages for malicious prosecution and arrest and Shah argues without sufficient evidence of how these damages were computed, raising eyebrows about the integrity of the legal process.\n\nShah, arguing that the Supreme Court decisions violated his rights to a fair hearing and equal protection under the law, sought direct access to the Constitutional Court.\n\nJustice Rita Makarau upheld his application, emphasising the importance of reviewing the Supreme Courts findings that were deemed binding on the trial courta decision that raised concerns of jurisdiction and independence when adjudicating the case.\n\nMakarau observed that the trial court appeared to surrender its authority, attributing overwhelming weight to the Supreme Courts acknowledgement of a prima facie case against Shah.\n\nIn summary, it appears to me that the trial court was conducted in a grossly irregular fashion, thereby robbing it of the fairness that is a prerequisite of a trial under the law.\n\nThe trial court wrongly and wrongfully surrendered its jurisdiction in the matter to the appeal court, again robbing the trial of the prerequisite that it must be before an independent and impartial judicial officer.\n\nThese irregularities could, and in my view, should have been reviewed by the court a quo. I venture to say that the irregularities would have been corrected had the correct law been applied, she said.\n\nThe Courts decision pointed out serious irregularities in the trial process, suggesting that the trial courts conduct signified a deprivation of Shahs constitutional rights.\n\nMakarau JCC noted, The effect and purpose of the decision a quo stand out clearly as validating the myriad of irregularities, highlighting a pronounced disconnect between the legal procedures and the guarantees afforded by the Constitution.\n\nFollowing the Courts decision, Shah is required to file a substantive application within ten days, where further examination of the contested findings will occur.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/29191723/concourt.jpg",
            "description": "<p>By Mary Taruvinga The Constitutional Court of Zimbabwe has granted direct access to businessman Jayesh Shah, the applicant, allowing him to challenge a prior decision made by the Supreme Court in a case he was ordered to pay US$130,000 to former Zupco chairperson Charles Nherera for malicious prosecution. In the case, Shah aims to contest</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/businessman-granted-direct-access-to-constitutional-court-in-legal-fight-with-former-zupco-chairperson/\">Businessman granted direct access to Constitutional Court in legal fight with former Zupco chairperson</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        },
        {
            "title": "Tigere decries mono-currency uncertainties",
            "url": "https://www.newzimbabwe.com/tigere-decries-mono-currency-uncertainties/",
            "content": "By Alois Vinga\n\nListed real estate investment trust (REIT) Tigere has raised concerns over looming mono-currency uncertainties, warning that the policy shift is threatening funding streams in the sector.\n\nThe concern stems from recent remarks by central bank officials suggesting that Zimbabwe could transition to an exclusive use of the local currency by 2030. Authorities have indicated that efforts are underway to build foreign reserves and ensure macroeconomic stability ahead of the potential currency shift.\n\nPresenting its financial results for the year ended, Tigere said the policy signals have already started impacting confidence within the sector.\n\nGiven continued uncertainty surrounding the 2030 migration to mono-currency, the real estate sector remains predominantly equity-financed, the company said.\n\nEquity financing refers to the process of raising capital by selling shares in a company to existing shareholders or new investors.\n\nCommenting on the mono-currency plans, the International Monetary Fund (IMF) mission stressed the importance of further strengthening the monetary and foreign exchange frameworks. IMF staff also underscored the need to complement such efforts with measures that enhance demand for the Zimbabwe Gold (ZiG) currency.\n\nDespite these challenges, Tigere reported a solid performance. Net Property Income stood at US$1,205,846, up 56.6% from the previous year, driven largely by the inclusion of Highland Park Phase 2 in FY24, which continues to demonstrate growth in income and customer traffic.\n\nThe funds profitability remained robust, despite intensified competition and a volatile currency environment. Total Dividend Per Unit (DPU) rose by 44.8% year-on-year to US0.0951 cents, while Earnings Per Unit (EPU) increased 25.8% to US0.0925 cents. This was achieved despite a 48.8% increase in the number of units in issue, supported by an 87.2% year-on-year rise in comprehensive income to US$990,155.\n\nCollection rates also improved to 87.3% in HY25, up from 81.2% in the comparable period, following the implementation of stricter rental collection policies.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2023/02/08061347/Tigere-REIT.jpeg",
            "description": "<p>By Alois Vinga Listed real estate investment trust (REIT) Tigere has raised concerns over looming mono-currency uncertainties, warning that the policy shift is threatening funding streams in the sector. The concern stems from recent remarks by central bank officials suggesting that Zimbabwe could transition to an exclusive use of the local currency by 2030. Authorities</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/tigere-decries-mono-currency-uncertainties/\">Tigere decries mono-currency uncertainties</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        },
        {
            "title": "It’s best to enjoy my last years of football at home –  Knowledge Musona on turning down overseas offers",
            "url": "https://www.newzimbabwe.com/its-best-to-enjoy-my-last-years-of-football-at-home-knowledge-musona-on-turning-down-overseas-offers/",
            "content": "By Sports Reporter\n\nWarriors forward Knowledge Musona has revealed he chose Scottland FC over foreign clubs as he wanted to spend the remaining years of his football career at home.\n\nMusona was unveiled on Monday at Rufaro stadium by Scottland, andwill makehis debut on Saturday when they play FC Platinum at MandavaStadium.\n\nThe strikerjoined Mabviravira as a free agent after parting ways with Al-Ohkhood in Saudi Arabia.\n\nThe Norton-born star was sought-after player by many clubs, including his former side Kaizer Chiefs in South Africa.\n\nMusona launched his professional football career in South Africa as a teenager in 2009 before moving to Europe, where he played for several clubs, including Bundesliga side Hoffenheim and RSC Anderletch in Belgium.\n\nCommenting on why he snubbed overseas offers for Scottland, the Smiling Assassin said,I have been playing international for the past 17 years and look, Im winding up my career, I thought its always best to go back home.\n\nIts also a good experience that I have never played in Zimbabwe before, so I thought its the best time to come back home and enjoy my last years of football here.\n\nFor the first time in his career, Musona will be playing at the same club as his young brother Walter.\n\nI have always wanted to play with him, and for the first time we did play in the national team, and it was a good feeling because I have always wanted him to be a great player.\n\nI want him to play better than I did, to achieve big things in his career.\n\nSo Inow have an opportunity to push him and help him to do big things and grow his career, he added.\n\nMusona recently came out of retirement and featured for the Warriors ahead of the 2025 AFCON Finals to be held in Morocco.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/07/28215548/musona-.jpg",
            "description": "<p>By Sports Reporter Warriors forward Knowledge Musona has revealed he chose Scottland FC over foreign clubs as he wanted to spend the remaining years of his football career at home. Musona was unveiled on Monday at Rufaro stadium by Scottland, and will make his debut on Saturday when they play FC Platinum at Mandava Stadium. The striker joined Mabviravira</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/its-best-to-enjoy-my-last-years-of-football-at-home-knowledge-musona-on-turning-down-overseas-offers/\">It’s best to enjoy my last years of football at home –  Knowledge Musona on turning down overseas offers</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "09:52",
            "date": "30 Jul 2025"
        }
    ]
}