{
    "news": [
        {
            "title": "Robert Mugabe Jnr issued with arrest warrant",
            "url": "https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/",
            "content": "By Mary Taruvinga\n\nRobert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand.\n\nHarare magistrate Lisa Mutendereki issued the warrant after Mugabes name was called three times with no response.\n\nMugabe who is out on bail, was arrested last month for unlawful possession of dagga. He was nabbed during a police traffic blitz after driving against a one-way street along Second Street Extension in Harare.\n\nProsecutors allege police recovered two sachets of dagga, a pack of rizla, and a dagga crusher from his sling bag. The drugs, weighing two grams and valued at US$30, were verified at Harare Main Post.\n\nMugabe is represented by lawyer Ashiel Mugiya.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/02155751/robert-jnr-mugabe.webp",
            "description": "<p>By Mary Taruvinga Robert Tinotenda Mugabe, son of the late former President Robert Mugabe, has been issued with a warrant of arrest after failing to appear in court for his routine remand. Harare magistrate Lisa Mutendereki issued the warrant after Mugabe’s name was called three times with no response. Mugabe who is out on bail,</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/robert-mugabe-jnr-issued-with-arrest-warrant/\">Robert Mugabe Jnr issued with arrest warrant</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "06 Nov 2025"
        },
        {
            "title": "Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension",
            "url": "https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/",
            "content": "By Staff Reporter\n\nA GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora.\n\nMwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling partys controversial resolution to extend President Emmerson Mnangagwas tenure to 2030 or beyond.\n\nIn a statement, the opposition party saidthe attackers armed with guns were donning Zanu PF regalia.\n\nMwonzora had made a brief stop at the MDC Bulawayo Provincial Office to address party members and journalists on Zanu PFs Agenda 2030.\n\nYesterday a group of Zanu PF vigilantes calling themselves Boys  dzaMudhara disrupted a peaceful meeting of the MDC in Bulawayo. We shall never bow down to thuggery. Our fight against desecration of our constitution and the 2030 agenda will be intensified.pic.twitter.com/yHJnTicoqS\n\n Sen Douglas Mwonzora (@DMwonzora)November 6, 2025\n\nTrouble reportedly started after Mwonzora finished addressing journalists.\n\nSoon after the members of the Press left, members of the police mainly from PISI and CID and youths wearing Zanu PF regalia entered the office from the back door, numbering about 20, armed with guns and knives and started dismissing people as they advanced towards the MDC leader threateningly.\n\nThey were chanting 2030 ino budirira chete (The 2030 agenda will succeed), said the opposition.\n\nA stampede then followed as members of the security whisked away the president (Mwonzora).\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/29172327/Douglas-Mwonzora.jpg",
            "description": "<p>By Staff Reporter A GROUP of unidentified men reportedly stormed opposition Movement for Democratic Change (MDC) offices in Bulawayo, Wednesday before threatening unspecified action against its leader, Douglas Mwonzora. Mwonzora is said to have been saved by his bouncers, who fought the assailants baying for his blood for daring to comment on the ruling party’s</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/unidentified-men-storm-mdc-offices-threaten-mwonzora-for-challenging-mnangagwas-term-extension/\">Unidentified men storm MDC offices, threaten Mwonzora for challenging Mnangagwa’s term extension </a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "06 Nov 2025"
        },
        {
            "title": "German nurse gets life in jail after murdering 10 to reduce workload",
            "url": "https://www.newzimbabwe.com/german-nurse-gets-life-in-jail-after-murdering-10-to-reduce-workload/",
            "content": "BBC\n\nA palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others.\n\nProsecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to ease his workload during shifts overnight.\n\nThe offences were committed between December 2023 and May 2024 in a hospital in Wuerselen, in western Germany.\n\nInvestigators are reported to be looking into several other suspicious cases during his career.\n\nAccording to media outlet Agence France-Presse (AFP), the unnamed man had been employed at the hospital in Wuerselen since 2020, after completing training as a nursing professional in 2007.\n\nProsecutors told a court in Aachen that he showed irritation and a lack of empathy to patients who required a higher level of care, and accused him of playing master of life and death.\n\nThe court was told that he injected patients with large doses of morphine and midazolam, a type of sedative, in an effort to reduce his workload during night shifts.\n\nHe was arrested in 2024.\n\nWhen issuing the life sentence, the court said that the mans crimes carried a particular severity of guilt which should bar him from early release after 15 years.\n\nHe will be able to appeal the verdict.\n\nProsecutors have told AFP that exhumations are taking place to identify further potential victims, which could see the man put on trial again.\n\nThe case bears similarityto that of former nurse Niels Hgel, who was handed a life sentence in 2019 after he was convicted of murdering 85 patients at two hospitals in northern Germany.\n\nA court found that he administered lethal doses of heart medication to people in his care between 1999 and 2005.\n\nHe is believed to be the most prolific killer in Germanys modern history.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/11/06105744/morphine-injection.webp",
            "description": "<p>BBC A palliative care nurse in Germany has been sentenced to life in prison after he was convicted of the murder of 10 patients and the attempted murder of 27 others. Prosecutors alleged that the man, who has not been publicly named, injected his mostly elderly patients with painkillers or sedatives in an effort to</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/german-nurse-gets-life-in-jail-after-murdering-10-to-reduce-workload/\">German nurse gets life in jail after murdering 10 to reduce workload</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "06 Nov 2025"
        },
        {
            "title": "War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm",
            "url": "https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/",
            "content": "By Leopold Munhende\n\nWAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land.\n\nLocal Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds.\n\nAccording to documents gleaned by NewZimbabwe.com, his Ministry is seeking to reopen a case that could grant Rautenbach ownership of land the High Court already decided was not his.\n\nThe war vets, under the Springs Farmers Association, have filed their intent to oppose the ministrys application, arguing that the government cannot relitigate a matter that was final and conclusive and that any further interference puts Zimbabwes land-reform credibility at stake.\n\nThe dispute centres on a March 2025 offer letter issued by Local Government Minister Daniel Garwe, allocating 671 hectares at Springs Farm and 412 hectares at Stuhm to Marimba Residential Properties (Pvt) Ltd as final compensation for land in Aspindale Park, Lochinvar, and Salisbury Park that the company claims to have lost years ago.\n\nHowever, the courts have already ruled on the matter.\n\nIn 2019, the High Court found that businessman Rautenbach and his associated companies had no valid title to the Aspindale property, affirming that the land had been lawfully acquired by the State and allocated to housing co-operatives under the National Housing Delivery Programme.\n\nThat ruling, described by the judge as final and definitive, was never overturned.\n\nDocuments show that while Marimba claims to have lost about 180 hectares in Aspindale, the new offer compensates it with over 1,100 hectares of prime farmland, six times the size and far higher in market and agricultural value.\n\nThe paper trail surrounding Marimba Residential Properties raises more questions than answers.\n\nThe Registrar of Companies confirmed in 2018 that Marimba Residential Properties and Marimba Industrial Properties are not registered companies in our database.\n\nAt the same time, the Registrar of Deeds admitted that the title deed purportedly linking Marimba to the Aspindale property is missing from the record.\n\nDespite those gaps, the company continues to feature in official correspondence and now, in the new compensation offer.\n\nIn their newly filed opposition, the farmers accuse the government of attempting to rescind a ruling made on the merits, which the law does not allow.\n\nThey describe the governments filing as a composite application that is procedurally and substantively defective, arguing that it merges three distinct processes: review, rescission, and interdict into a single motion, something the farmers lawyers say is jurisprudentially untenable.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/02/22060822/Billy-Rautenbach.jpeg",
            "description": "<p>By Leopold Munhende WAR Veterans farming at Springs Farm have pushed back against government-assisted attempts by top businessman Billy Rautenbach to grab their land. Local Government Minister Daniel Garwe, who in the past has been fingered in attempts to repossess land reserved for Parliamentarians, stands accused in the scandal that could likely displace hundreds. According</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/war-vets-push-back-against-fresh-government-backed-attempts-by-rautenbach-to-grab-springs-farm/\">War Vets push back against fresh, government-backed attempts by Rautenbach to grab Springs Farm</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "06 Nov 2025"
        },
        {
            "title": "Vandalism attempts led to restriction of Mbuya Nehanda statue – Information Perm Sec",
            "url": "https://www.newzimbabwe.com/vandalism-attempts-led-to-restriction-of-mbuya-nehanda-statue-information-perm-sec/",
            "content": "By Staff Reporter\n\nPermanent Secretary in the Ministry of Information and Publicity, Nick Mangwana, says government restricted public access to the Mbuya Nehanda statue in Harares Central Business District following several attempts of vandalism.\n\nThe statue, unveiled by President Emmerson Mnangagwa in 2021, cost the State a substantial amount of money.\n\nSince its unveiling, the monument which stands at the corner of Julius Nyerere Way and Samora Machel Avenue has been inaccessible to the public, with police officers stationed to guard it.\n\nThe monument was initially accessible to the public. Unfortunately, after a rise in visitor numbers and repeated vandalism attempts, including people trying to push it over or deface it, access had to be restricted, said Mangwana in a post on X.\n\nHe added that government is now working on measures to reopen access to the statue.\n\nTo enable safe public viewing of the Mbuya Nehanda statue, while protecting the iconic monument, the government is creating a new access framework. The President has instructed that this be implemented as soon as possible. We take this opportunity to apologize to the public for the delayed access, he said.\n\nMangwanas response follows criticism after international travel vlogger Davud Akhundzada was denied access to the statue during a recent visit.\n\nAuthorities came under fire for missing an opportunity to market Zimbabwes capital city.\n\nIn a statement, the Ministry of Tourism and Hospitality Industry distanced itself from the incident, saying responsibility for the monument lies with the Ministry of Home Affairs and Cultural Heritage.\n\nWe wish to clarify that the Mbuya Nehanda Statue is a National Heritage Monument managed by the Ministry of Home Affairs and Cultural Heritage. It stands as a proud symbol of Zimbabwes liberation history and identity.\n\nThe site is subject to specific preservation and security protocols and as such, public access to certain areas, including elevated or restricted zones, may be limited for safety, preservation and security reasons.\n\nHowever, as the Ministry of Tourism and Hospitality Industry, we are taking proactive steps to enhance tourist management at such sites. Through a Whole-of-Government Approach Strategy, in coordination with our counterparts at the Ministry of Home Affairs and Cultural Heritage, we are in the process of deploying tourism officers at key heritage and cultural monuments. These officers will facilitate seamless, well-informed and welcoming access for tourists, ensuring a positive experience while safeguarding our national heritage, read the statement.\n\n",
            "image_url": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/06/03062339/Mbuya-Nehanda.jpg",
            "description": "<p>By Staff Reporter Permanent Secretary in the Ministry of Information and Publicity, Nick Mangwana, says government restricted public access to the Mbuya Nehanda statue in Harare’s Central Business District following several attempts of vandalism. The statue, unveiled by President Emmerson Mnangagwa in 2021, cost the State a substantial amount of money. Since its unveiling, the</p>\n<p>The post <a href=\"https://www.newzimbabwe.com/vandalism-attempts-led-to-restriction-of-mbuya-nehanda-statue-information-perm-sec/\">Vandalism attempts led to restriction of Mbuya Nehanda statue – Information Perm Sec</a> appeared first on <a href=\"https://www.newzimbabwe.com\">NewZimbabwe.com</a>.</p>",
            "time": "18:37",
            "date": "06 Nov 2025"
        }
    ]
}